{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-13", "description": "What a Mexican foodies dream that I found in San Francisco! Parking can be hard to find but about a block away there is a park and unlimited parking! Around the area is 2 hours.\n\nWhat we ordered:\n\nMenudo 5/5 - hubby has been craving for menudo since forever and we have finally found the spot! Authentic homemade corn tortillas come as a side to this flavor packed soup! They are not cheap at all with the tripe and inners for this soup! The large is soooo worth it and you can take some home! Definitely A+ standards!\n\nPozole 5/5 - oh man I've made homemade Pozole before with an authentic recipe from mi suegra in Mexico but this is as good as it can get in the Bay Area! Yummers! Couldn't finish the big bowl but I took some home! So worth is since a small is 8oz and large is 24oz! \n\nKids Cheese Quesadilla 3.5/5 - home made corn tortilla with queso with some sour cream slathered on top. It was served w a side of fresh veggies and toasted crispy with cheese oozing out! My kiddo ate 1/2 of it but she slammed two homemade tortilla in her belly \n\nHomemade tortilla 5/5 - soooo fresh and good it was delicious!!!!!\n\nOverall definitely coming back. The hospitality and service and food was amazing! Can't wait to see what else is good here next time!!!", "author": "Victoria U."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-10-25", "description": "Came here today and was waited on by a very nice server. Sat down and ordered lunch which came out pretty quickly. The food was sort of mediocore I ordered a chicken taco salad.\n\nI gave two stars to this place for the nice staff and decent food. My main issue with this place was that I sat next to a column and it wreaked of a combination of mop water and wet dog................. Not what I want to smell as I eat.", "author": "Michael W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-30", "description": "Went there with friends and our kids. First, the food is all very tasty - I wish there was more vegetarian options to enjoy! The veggie super burrito was great anyway. \nFor the kids, some shared a burrito and the staff brought it precut in two separate plates! How convenient and helpful. \nThen, someone - the owner? the manager? - came by and asked if everything was alright and ordered us some extra quesadillas, cheese and beans. We got out of there our bellies full and happy having been so warmly welcomed. I will come back!", "author": "Pierre-Luc B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-01", "description": "Finally! I have finally found a solid menudo place in San Francisco. With great prices, delicious food and quick service this place was an awesome find. Do note that they are cash only!\n\nThe menudo was delicious. Not as good as the ones I've had in SoCal, but the best I've been able to find in the bay area thus far. The soup was rich and flavorful with plenty of tripe pieces. They gave generous portions of the oregano, lime, onions, crushed chili and cilantro. And the whole thing was just nicely cooked, rich and delicious.\n\nFor a large portion it was only $11, which I've come to learn is quite a steal in San Francisco nowadays!", "author": "Tyler T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-27", "description": "Excellent, authentic, homemade Mexican food. You can taste the love they put into it. The salsa is handmade each morning and is spicy hot!  The caldo de res (beef soup) is perhaps their signature dish and, dare I say, a hangover cure. The corn tortillas are delicious beyond compare. The staff is super friendly.", "author": "George S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-02", "description": "Wow what a great find!!!!\nAuthentic and good at every corner\nWe had chili relleno, carrot-orange juice and carnitas \nSeems like lots of folks had the soups and shrimp cocktail, which we were just too full to get but looked great.\n!!!", "author": "D R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-11", "description": "The food was amazing and the atmosphere is great. Got the pozzole and it came with a lot of meat! My cousin also got a plate which was packed with lots of flavor! Def a great stop to stop and eat! Also the owner seems very genuine and kind.", "author": "Nadia D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-06", "description": "I totally wanted to get soup from here, but I didn't have enough cash on me and ended up getting a Carne Asada Burrito with what every loose bills and change I could find in my bag/car.  I didn't have my wallet on me because I came from working out next door and I was STARVING.  I was short by a quarter and they were kind enough to understand and let me have a burrito.\n\nIt's very authentic in here, everyone speaks Spanish and they were watching some kind of telanovela on the screen.  Next time I'll come back with enough money to get the soup!\n\nCASH ONLY", "author": "Lyn C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-01", "description": "Been here a handful of times and their Pozole never disappoints. Good Micheladas just tell them to take it easy with the Lea & Perrins sauce. Its a cash only restaurant which kind of sucks because I hardly ever carry cash. Other than that food is good and definitely my go to for the hangover cure :)", "author": "Vee N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-26", "description": "This is easily one of my favorite Mexican restaurants. The staffs are super friendly and generous. We went for lunch with a group of 10+ people. The fact that they accept reservations makes it very effortless and convenient. A few minutes into us sitting down at our table, baskets of chips and bowls of salsa & guac were placed onto our table for us to snack on. Shortly after, we noticed we might have some additional colleagues joining us so we asked for if we could add another table to the end. The staff was extremely accommodating and understanding. Two of the colleagues got the pozole which looked absolutely mouthwatering. I'm definitely trying that next time. Many of us got the combination plates with the many different options, such as two enchiladas or one enchilada with a tostada, etc. The food is delicious and the portions are huge. Most of us struggled to finish the combination plate. \n\nWe were celebrating two birthdays and the restaurant staffs were so kind to celebrate with us. They surprised our table with a plate of fried plantains and flans! It also happened to be the first day of Autumn for their culture so they decorated the dessert plate with a lot of fall colors and topped it with two candles. \n\nIt's hard to believe that the bill only came out to $170 with tax and tips included for a table of 12! It's so hard to find good food at a decent price in the City nowadays, so I'm so happy that Gallardos offers the best of both worlds!", "author": "Linda H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-12", "description": "I'm Mexican so I've had more than a few bowls of pozole. \n\nI walked in on a cold rainy day and ordered this places signature dish and I was not disappointed.\n\nWhat I liked in particular is that they didn't skimp on the sides. Several wedges of lemon , a ton of chopped onion , tortillas and a tostada. \n\nAll of this came out to roughly 11 bucks after tax. \n\nThe broth was excellent as was the hominy.  The soup came out quickly which is a sign that they make a lot as well. \n\nAll in all a great experience , I look forward to returning when I have a pozole craving.", "author": "Rod M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-13", "description": "This place is a religious experience. I came here sick because I was craving some pozole and this place blew my mother effing mind and overdelivered on flavor.\n\n*Food*\nI got the pozole and a horchata- internally asking myself if it would be worth getting a cold drink since all I could taste was my own snot. They started me off with some crisp, perfectly oiled, housemade tortilla chips and salsa served from a plastic container for you to spoon on to your chips, not for dip. The salsa is spicy, leaving me drinking 3/4 of my horchata before even getting my pozole - but tasty enough for me to finish my basket of chips with the fresh squishy blocks of tomato from the salsa. The horchata tasted housemade, not too sweet, and with the nice grit you expect from OG-non-artificial horchata. \n\nShortly before my pozole arrived, my server stopped by my table to give me 3 stacked wooded plates. On top were limes, under that oregano, and under that some hot looking spice that I assume was Achiote. Please correct me as I am a pozole amateur. They were also substantial amounts of spices that I definitely was not going to use for my soup. But she didn't stop there, she handed me a plate with shaved cabbage, radishes, sour cream, and tostadas. AND THEN, a container for 3 hot and fresh tortillas.\n\nTHEN my pozole arrived which was a hot, warm, steamy, good for the soul soup. In my heart I immediately thought, DAMN I'm going to be full af after all this food and VALUE MEAL. Feel free to split this meal with 1-2 other people. \n\nI spiced my soup to taste, I like it extra tart so I squished all the lime wedges, enough to make a baby's face pucker up. A little BAM of the oregano and a little BAM of the achiote. Nobody looked at me and thought I was weird because this in San Francisco for crying out loud. \n\nAnd then I took a heaping spoonful of the soup, put it in my mouth, and I was sent all the way back to Mexico City. Life was compelte and in that moment I felt that all of my illness was gone. Praise be. The meat in the soup came off the bone and on the bone, suggesting you to place it on top of the crisp tostada, dabbing it with some sourcream goodness and the light and fresh cabbage. Crunch after crunch, sip after sip my soup disappeared until I saw an empty bowl with red and green specs of spice. And in that moment my heart sank only to realize that it was all over. \n\nI looked up to realize that the entire restaurant had turned over. What a roller coaster of emotions. \n\nCome eat here if you want your hear, soul, and belly nourished.", "author": "Geronimo Carlo R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-25", "description": "OHMAGOD was the Pozole delicious! I was debating between enchiladas and the Pozole, and the server recommended the Pozole, so I was in.\n\nFood came out pretty quick, and the server was super helpful when my friend and I were trying to figure out what to eat. I got a small bowl of Pozole, but didn't realize how much additional fixings it came with! I added in some radish, onion, cilantro, and a squeeze of lime. The pork was super soft, and I'm usually not a huge fan of pork. The radish and onions added a nice crunch with every bite, and I felt there was the right amount of hominy.\n\nThe soup was less than $10, which is SUCH a steal! I can't wait to be back!", "author": "Daisy Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-09", "description": "I was recommended to go here for the best menudo in SF. They do have great menudo and an even friendlier staff. I love this place. The decor of famous Mexican actors is a classic touch.\n\nI would recommend this place to anyone", "author": "Daniel C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-18", "description": "This place serves good Mexican home style plates, donde common Mexican fast food. Just cash, be prepared and prices are affordable. I had ranchero steak", "author": "Victorya Esmeralda L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-28", "description": "I was debating between coming here for a big bowl of Menudo or Birria al Horno.\nafter about 2 minutes of contemplation, I decided to go for a large bowl of Menudo.\nlet me tell you, it's a lot of tripes!\nI squeezed all the limes, put all the chopped onions and cilantro, and I just went straight at it.\nit's okay, it's a weekend.\nthe food was good, the ambience was really warm and hospitable, the service was courteous, the bill was reasonable.\nI would come here again to try different things.\nand I would come here again if I have a Mexican girlfriend,\nDefinitely.", "author": "Rudy H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-06", "description": "Great place for huge portions of authentic Mexican food. We came in for breakfast and ordered the cactus, potato, and chorizo scrambles which came generously portioned with rice and beans and warm tortillas. However everyone around us seemed to be there for the soups. That'll have to be for next time...\n\nThe place got packed quickly with the locals and a gentleman came into serenade the customers toward the end of our stay. \n\nWe enjoyed the quick service and the spicy chunky salsa that was the perfect complement to my chorizo scramble for heat and freshness. I also got the fresh carrot juice which was a nice way to start my morning.\n\n*cash only\n*a couple outdoor tables available\n*seems to be a hot spot for the local Mexican community", "author": "Sarah M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-08-17", "description": "Had a very greasy and very soggy spinach quesadilla with a side of rice and beans. That and the sour cream and guacamole all sort of ran together in an unappetizing puddle in the plate. I rarely leave food behind but I wasn't inspired to box up the leftovers to take home.\n\nI'm sure there are better things on the menu - my friend had a burrito that looked fine - but the cooking seemed sloppy. \n\nOther small details that on their own wouldn't bother me added up to a disappointing experience. There were charred meat scraps on the quesadilla - not an issue for me, but could be for someone with food restrictions. Prices listed on menu were incorrect. Cash only, though this was not apparent, and a $30 bill seems a bit much for cash only. Service was pleasant but not particularly attentive, especially given that there were not many other diners. Styrofoam take-out containers. Again, nothing earth-shattering but all together less than stellar.\n\nThe jugo mixto carrot-orange juice was good and a generous size, which I appreciated.\n\nSad we stopped in here when there's so many great places to eat in the neighborhood.", "author": "Jeanne M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-10-28", "description": "Food: 3/5\nService: 4/5\nAmbiance: 3/5\nOverall:  wasn't completely impressed.  the food is ok and serves as another option in the neighborhood.  \n\nThe extended review:\n\nFood:\n\nCarne guisado - the dish was ok but perhaps I'm more used to the stew that is more from the islands (Cuba, PR, and DR).  There wasn't an abundance of meat unfortunately but it was enough to get me sort of full.\n\nService: super friendly waitstaff though we took our orders to go.\n\nAmbiance: a slight step up from hole in the wall.", "author": "Spencer Q."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-07", "description": "I've loved this restaurant for over 20 years. Sadly I don't get over to this part of the city very often or can I still do justice to the generous portions that they serve. \n\nSkip the standard fare that you can get all over town, the enchiladas or burritos; I'm sure they are good, maybe even excellent. But the reason to come to Gallardos is for the amazing soups or the birra -- when they have it -- or the other more homey fare. Look out for bones, just chew around them and set them aside; the meat surrounding them is all the more flavorful for having been cooked on the bone.", "author": "Eli C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-04", "description": "I woke up this morning with a craving for Pozole. As all my friends in Mexico repeatedly told me when I lived in DF, \"Mexican food in the US isn't really Mexican\", but I am happy to prove them wrong. I found this place in Yelp, and I can say unequivocally that it is as good as almost any pozole I had in Mexico!\n\nThey look like they have a number of other interesting items on the menu, so I will be back.... but if it's Pozole you are craving, this is absolutely the place. Gracias y salud!", "author": "Todd M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-26", "description": "First off the portions are huge. I had the birria and it was good.  My friends had the caldo de res and they loved it. Let's not talk about the hand made tortillas and the berries drink. \n\nThe only complain I have is that they didn't have any spicy salsa for the birria because for God sake its a Mexican restaurant. We love spicy food!", "author": "Jessica U."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-07-16", "description": "We were recommended to try Gallardo's by a friend who had been there before so we thought we'd try it out.\n\nWe went this past Saturday with expectations of great Mexican food, something that I absolutely love and seek out wherever I can.  Being from San Diego and having visited some of the best Mexican food in the USA, I was very disappointed in Gallardo's.\n\nI ordered the carne asada plate, which to me is the sign of a good Mexican restaurant if done right.  It was brought to me completely well done to the point of being tough.  There was no sear, which told me it was either boiled or pan fried in its own juice.  It was absolutely bland with NO salt added whatsoever.  I kept trying to pair each piece with other things on the plate just to get some salt.  Nothing helped.  Also, the beans were cold and the rice was clumpy.  A fresh plate from the kitchen shouldn't have food that's cold if it's not meant to be.\n\nMy husband ordered the enchiladas and the corn tortillas were chewy and dry as if they had been sitting out all day.  There was little salt and flavor in his dish as well.  There was a minuscule amount of enchilada sauce as well and you'd expect them to be drowning in it.\n\nThe biggest issue was lack of salt and seasoning of any kind.  I shouldn't have to pile other things onto the carne asada just to make it taste better; it should stand on its own.", "author": "Jake B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-27", "description": "Great Mexican comfort food. \nWho can say no to handmade tortillas?!", "author": "Jessica D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-09-04", "description": "This post must be bumped up to avoid their customers from being scammed by the POSSIBLE dishonesty of the waitresses. What I am about to address may have been an honest mistake, but should not go un-noted. As avid restaurant-goers should know, restaurants add gratuity on the bill for big parties. I am completely okay with that, except that the bill they gave us wasn't a conventional bill, but just an empty paper with only a dollar amount. There were no line items of the dishes we ordered or mentioning of gratuity being added as part of the bill. If this is their everyday practice, I have no doubt in my mind that some big parties unknowingly pay extra tip on their bill. This is a typical way for servers to make extra tip money as I have seen this being done before. They did apologize, but still PLEASE BE AWARE WHEN GOING TO THIS RESTAURANT WITH A BIG PARTY. Food was good though.", "author": "Phil K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-03", "description": "Hands down my favorite mexican food place in the city. It is an intimate family owned and authentic spot where every dish I have is better than the last. The decor isn't gimmicky (which I don't mind sometimes) and it lets the food and kind family service be the stars of the show. I know from personal experience that this family is very giving to their community as well. Micheladas are stellar and outside seating is perfect for a little Sunday Funday. Love this place.", "author": "Katie S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-14", "description": "This place is a hidden gem and will now be in my regular rotation of eateries in the Mission. \n\nAfter a night of heavy drinking, birria was needed. Having never sought it out here in the Bay Area I was skeptical, but this place hit the nail on the head. Birria, a gordita, machaca con huevos, and chips and salsa were everything the doctor ordered to fight the battle of my hangover. My only, tiny, almost irrelevant complaint? Cash only!", "author": "Hector L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-05", "description": "Love this place! The food is so good and the people are so nice here! Cash only so make sure you come prepared.", "author": "Travis J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-10", "description": "Best Birria I've ever had- just like my moms. I got the Birria in caldo (stew) which gave it more flavor. What made this plate even more heavenly was the tortillas, fresh off the comal!", "author": "Marlene C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-20", "description": "First of all the ambiance is like I'm in my grandmas kitchen... the owner is always so sweet asking if our food is good. So I love that right off the bat. But let me tell you their pozole here is LIFE!!!!! & if you're hungover the micheladas also are a must have. You won't regret eating here.", "author": "Jane W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-28", "description": "Excellent food. great prices and service.  Friendly staff.  I highly recommend their beef soup. (caldo de res).", "author": "David G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-11-29", "description": "Nothing to write home about here...\n\nStreet parking in this neighborhood was challenging. The $9.50 Guacamole & (4) Chips will tie you over while your selections are prepared. At $2.50 I love the Jarrito - Tamarind Soda with natural flavor and real sugar.\n\nAt $8.75 the De harina con carne (flour quesadilla with meat) is thick, rich and heavy. \n\nAt $13.75 the Chicken Fajitas looked okay but tasted really quite plain and arrived with no guacamole or sour cream. Its side salad was dry and with out dressing of any kind. Not to mention the three tortillas that arrived much later did so cold inside a steamer.\n\nWith only two tables of customers I expected much better food and service. We might give them another try time sometime in the future. If you choose to dine here, good luck, I hope your choices come out better than ours did. Four photos are attached.", "author": "Caesar A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-07", "description": "Amazing authentic Mexican food! It's still relatively untouched by hipsters. When I walked in, there were tons of families and old friends chatting with the servers. Very unpretentious and we must keep these places near and dear. \n\nMy friend ordered the pozole and wowow the flavor was incredible. They serve a ton of spices and garnishes to go along with it, and it's a perfect meal for a cold San Francisco day. I was craving a quesadilla so I ordered a carne asada one with sides of beans and rice. It was literally just cheese and beef and it was the best quesadilla I've had in a while. The rice and beans were cooked perfectly and I was amazingly satisfied. They serve complimentary tortilla chips which is becoming pretty rare so cherish that. \n\nThe servers are extremely welcoming and friendly and I felt like I was in someone's home. The meal was less than $20 for two of us and I was honestly shocked because everything is usually so inflated in the city nowadays. \n\nI was hesitant to write this review because I don't want this place to get too popular lol but the food is too good so I had to share. \n\nCash only and they don't have an atm in house so bring $$$$", "author": "Stefanie S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-19", "description": "Sweet little spot on the edge of the mission. I think the best thing here is soup and stew. My wife and I both loved our posole. The salsa was fantastically fresh and spicy, but it's served in a little pot you have spoon out of instead of dip, which was very odd. Service is absolutely delightful.", "author": "Marcie K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-17", "description": "Today I came to have dinner with my family and I enjoyed it very much I loved how the waitress came over and asked for a few minutes after giving us the menu she recommended a few items in the menu and then left gave us a minute when she returned we play store order and it didn't take so long to get here she brought us drinks and was very attentive with my boys even though they're so little she still kept them in mind I enjoyed the food it was delicious and well seasoned and my children enjoyed it as well and they are very picky eaters so I recommend you next time you can't decide what to have for dinner come and place the visit to Gallegos and enjoy a wonderful environment", "author": "Laura M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-26", "description": "I don't recommend coming here for tacos, although the portion is huge, I was not happy with the tacos I got. Ordered the carne asada and the meat was way too dry. The michelada was ok.\nCame in @ 3:00 and only a couple of tables occupied. I was immediately seated and my order was quickly taken. I see that everyone was like kind in a rush. Nobody check me even I was finished a long time ago. Everybody was just so busy. I was waiting awhile so I wrote this review right here. \nIt's better if you come here with friends and have a lot of things to talk about coz you will have a lot of time to hang around. May be it's just me. I was just passing by and I was hungry andI was alone.\nOops, check still not here, so I finally approach the counter to get my bill. It's $32 for 2 tacos, a michelada and a pozole to go, it's actually not bad for the amount of food I had. Fyi, the pozole was really good I'm giving this place 4 stars.", "author": "Marlen B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-17", "description": "This is a great authentic Mexican restaurant. Being from southern Arizona, I feel like this is the most familiar style from the Sonoran region of Mexico. Besides providing consistently quality Mexican food, it has an indescribable authentic taste while the staff give that family feel. \n\nGive this place a try and you won't be disappointed. Be sure to have a Mexican coke to compliment the excellent soup, taco, or plate you're in the mood for. I prefer the flautas, rice, and beans plate (yes I'm a gringo). Cheers.", "author": "Re W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-29", "description": "First time here and we will be coming back for sure! Best pazole I've had since moving to the Bay a year ago!", "author": "Shana B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-30", "description": "Pozole here is incredibly meaty, but so good. Cactus & eggs are the best I've found so far. Do not bother with the tacos - they aren't bad, but everything else is so good that they pale in comparison.", "author": "Hawley S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-19", "description": "3.5 stars. Great value. I had the famed Pozole here (pork stew with hominy). I love the flavor. The pork quality could be better but pretty good for the size and portion. If you get this dish, ask them to put a bit less hominy in the soup to be a more balanced dish. Do pile on the condiments to make it delicious!\n\nThe best Pozole in the Bay Area is at Comal in Berkeley...", "author": "Rebecca C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-07", "description": "This is the best pozole I have ever had in my life. After living in Mexico for a year, I thought it would be difficult to find pozole as good as what I tried there. This is better, and it is prepared with such love that I will definitely be coming back.", "author": "Kevin A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-01", "description": "Wow just wow! So delicious. Im sooo satisfied with the chicken soup aka caldo de pollo !! I recommend all there soups. So good to eat when recoving from an illness", "author": "Liset O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-11", "description": "Great food, fair pricing, clean, good service.", "author": "Robert M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-20", "description": "Go here on Saturday and get Birria and a Michelada. Sit outside, enjoy it, and then tell your friend about it.", "author": "Varun S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-04", "description": "I love having breakfast at Gallardos Mexican Restaurant in the Mission. I like Mexican food a lot although I seldom get it for breakfast. Gallardos is the exception to the rule and the reason is because this place rocks! I love getting the goat Birria al Horno (baked shredded meat & tortillas for wrapping as well as light stock for dipping. The staff members are also very attentive and friendly no matter how many special requests I ask for. They are always very nice, not only to take our order but also to check in and make sure we are enjoy our orders. I don't know if they usually do that but I quite adore this place! I would recommend checking out Gallardos. I am sure you'll find something to love about this place.", "author": "Abel S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-10-21", "description": "Nice food.\nShrimp come with the skin.\nTortilla chips come last.\nDont serve water automatically and when I asked they bring just one water and I was with a partner that didn't get.", "author": "Ohad K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-21", "description": "Excellent corner restaurant where a table full of cops were enjoying a meal too!  You know if they are here the food must be pretty good.\n\nSampled a beef taco with excellent fresh salads.  Mild Flavors but not totally flavorful.  Good value.", "author": "Susan C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-27", "description": "I love this place!\n\nIt's near my work. Since I only have a half hour lunch and have to eat at work, I always get my food to go. The restaurant is lovely, though and the wait staff are really friendly, so I'm really looking forward to \"eating in\" some time.\n\nMy favorite item is caldo de pollo (or chicken soup to us gringos.) The large is very big and comes with TWO WHOLE LEGS. A great broth and nice veggies, make this a wonderful soup for a cold day, OR when you're fighting a cold. With the garnish of lots of cilantro, limes, chopped onions, along with plenty of corn tortillas, it is a great meal all by itself.", "author": "Mike D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-23", "description": "Awesome birria, home made tortillas, and micheladas! This is the place to be after a nightout. The food here is delicious and satisfying. Service is fast and the staff is really friendly", "author": "Erika G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-17", "description": "Gallardos is a little slice of urban utopia.  From the minute you walk up to this place and see its wonderful sidewalk garden you know that this isn't a run-of-the-mill burrito shack.  Inside it is gorgeously decorated with beautiful stars of the silver screen all over the walls.  It is a very warm, colorful, and inviting atmosphere.  \n\nA great place for large group dinners to celebrate since they have lots of seating and a great atmosphere for that.  The food is wonderful and the chef's are high-quality and seem to enjoy their work.  This place reminds me of how a business should be and can be run.\n\nWith lots of unappealing, overcrowded whip-cracking mexican food places around the Mission, Gallardos stands out as a real breath of fresh air (figuratively and literally).  I feel good about supporting them and the business they run.  \n\nand let's not forget the food is high-quality with very decent portions and an excellent amount of variety in the menu.  Get your order to go and enjoy eating outside with the garden.  Its really a win-win :)", "author": "Thomas T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-11", "description": "Delicious! Very friendly service, authentic, and big portions for small price!", "author": "Barbara G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-28", "description": "Holy portions batman! Really, they give you a ton of almost everything. We split some tacos (don't get the pork one, it's dry) and some birria (quite solid, be generous with the supplied toppings) and some huevos y nopales which were probably the highlight. As always, I wish the plate came with more beans, but I am insatiable devourer of beans.", "author": "Misha T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-01-02", "description": "My review of the Restaurant. My sister picked this restaurant because she said that they went there years ago. It's kind of like off of Mission and 18th between Shotwell. It's kind of in a not safe area kind of ghetto place, but it's good to go during the day they have a lot of pictures. The food is semi good. I give it 2 star on the service because they only speak Spanish and the tables were dirty and it took us 10 minutes to try to get someone to clean it they speak broken English which was hard to communicate.\n\nSo, hopefully when you go here, someone is fluent in Spanish & English. They have broken English, and they could understand, and you just point to the menu lol and hopefully they get it right. I've had better food but this is a little bit home cooking I guess. \nAnd we all enjoyed it, it was good it held us until we ate that night.\n The one thing that looks really good and tasted homemade were the corn tortillas that reminded me when I was little when when my mother used to make them.\nNow those were good and the homemade salsa that was on fire it's not hot at first, but then all of sudden your mouth is burning. I give that a three star\nThanks for Reading! ~ Liz~  :)", "author": "Lizzie G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-28", "description": "Amazing food and incredible atmosphere  There's no place else to go for authentic food and such welcoming service. This place feels like home", "author": "Citadale D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-11", "description": "Love this restaurant! The food was great and the service was even better. Had a great time getting to know the family who runs this restaurant over a few beers and incredible enchiladas.  \n \nPS: Try their Micheladas (AKA: Mexican Bloody Mary with Beer) and ask for shrimp on the side! Amazing!", "author": "Chris K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-03", "description": "My favorite for birria, menudo and pozole on the weekend. Always fast and friendly service. Parking is usually a nightmare but it is worth it.", "author": "M. D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-04-07", "description": "Clean restaurant and a good menu.  Hard to find parking and for us, even a place to sit.  Even harder to place our order and we had to call out to place it as we only got menus, not coffee or offer for something to drink while we perused the menu.  When we did finally place our order it was written correctly but we received a taco with beef and not pork carnitas that was on the final check.  The plate was complete with salad, crema and guacamole though it did not say so.  A slice of tomato had the green pit still in it (Yuck). Served with large, thick corn tortillas and that was good.  Beef was dry and lacked flavor.  Not much spice in the given sauce for the chile relleno.  Better than most Mexican places but our experience was less than excellent.  Probably because it was full.", "author": "Mike N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-22", "description": "Very good Mexican food and service. Brought my family party of eight and we all very happy", "author": "Pedro C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-26", "description": "I used to go to this location when it was chavas and was sad to see it burn down. But the people that run Gallardos are so nice.\nI go here for the Menudo and the fresh tortillas. I like how there is no hominy in the soup and I request more cartilage and they take care of me. \nMy friend did order the chips and we both thought that they were cheap. Would have been better if they made them there or bought them from La Palma on 24th. Good thing I don't go for the chips : ).\nUntil I find a better place for menudo that comes with fresh homemade tortillas, I am a solid customer.", "author": "fritz k."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-03", "description": "Cheap authentic Mexican cuisine. Honestly one of my fave spots. \n\nPS. Massive portions! You can probably share a plate between two people.", "author": "Maria R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-06", "description": "Hey Gallardos... Gayardos.. Gurados.. ?\n\nI admit, I still don't know if I am pronouncing your name right.\nI did learn it means \"brave\" - correct me if I am wrong.\n\nIt's unfortunate you are a block from another decent mexican place (el tepa) since I think lot of those who work near me never make it past tepa to give you a shot.\n\nBut let me say this, I think you are fantastic. The food is rich and your dishes sure seems a lot more authentic than most places. Of course being that I am not Mexican, people can take that for what it is. \n\nFirst and most important, I rave to others about your POZOLE. nom nom.\nThe soup is good and hearty, but what really gets me is the assortment of items you give with it: Onions, diced cilantro, tortillas, tostadas, lime, spices and so on... I just pour those bad boys in to the soup and it becomes the most hearty soup you can find. Excellent on a cold day, or hot day, or whatever day. \n\nI also tried your beef soup, which was pretty good as well. All I can say is, please never skimp on those extras because that is what makes it extra special. These soups come out fast because they got a giant pot boiling in the back.\n\nYour meat plates are also pretty good. I've still not been able to try your weekend specials but perhaps one day.\n\nThe live music is a fun plus.\nYou are a cool little spot with good food. \n\nSee you next time Galardas\n\n.. gallardes?\n\nWHATEVER", "author": "Paul L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-25", "description": "I woke up a little hungover and craving Mexican food. Used yelp to find an authentic Mexican breakfast place, which I've yet to find in the six years I've lived here. This place is off the beaten track and it is delicious! I got the #12 a chili relleno and an enchilada combo plate (with rice, beans, and salad). I ordered it all cheese but added chorizo and fried eggs on top. I think the server thought I was a little crazy for that, but again I was hungover, and it paid off because it was so satisfying! They provide you with fresh salsa and tortillas... order chips also super yummy! Large portions... looking forward to the left overs in my refrigerator", "author": "Natasha R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-10", "description": "I came in today with friends for my birthday brunch, and I just wanted to say thank you. Thank you for the warm hospitality and venue, prompt service, and delicious food. Since moving from LA, I was worried I would not be able to find an authentic mexican restaurant. \n\nLOVED the table salsa, the fact that they serve fresh tortillas, the spanish speaking staff and golden age mexican cinema posters. \n\nMy only complaint is that los chilaquiles rojos were not spicy and not topped with cotija cheese, but every traditional dish in Mexico is interpreted differently based on region, so I'll let that one slide!", "author": "Daisy M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-02-18", "description": "The food was not terrible for the price but they were out of many items which surprised me. The menudo was not one of favorites. The bathroom isn't kept clean as well. If you're a germaphobe stay away.", "author": "Imani M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-24", "description": "Caldo de res was awesome.  Good Michelada too. The place is very laid back; it's almost as if you're seating somewhere in Mexico in the 50's.  Service was good Cash only.  Expect a line on Sunday mornings.", "author": "Roc A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-03", "description": "Delicious, comforting albondigas soup and attentive service. Granted it was not very busy on a Weds at lunch!", "author": "Stephanie L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-02", "description": "That pozole is out of this world. I think it might need to become a weekend tradition for me. The broth is deeply flavored, has a good tartness, and they serve it up with a ton of limes and the best corn tortillas. My only complaint is that my partner and I never want to order the same thing so we often have a hard time figuring out what second dish to order. He's tried the chorizo eggs and the heuvos rancheros and we always like the pozole the best.", "author": "Victoria J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-03", "description": "Chicken quesadilla is the Best! They cook the chicken with lots of flavor and ingredients. I've also had the steak torta, which was bomb as well.", "author": "Karla G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-06", "description": "That feeling when you finally satisfy your pozole craving.  One of the most authentic mexican spots Ive eaten at in a long time, and I don't have to fly back to L.A. or Mexico to have it. \n\nPozole - Great! Very flavorful, comes with standard fresh verdura. I agree with some of the other reviews that the pork quality could be better and tender, but overall, solid!\n\nNopales con huevos - Seasoned perfectly. Large portion served with healthy amount of rice & beans.\n\nAnother plus - tortillas are freshly hand made! :)", "author": "Roman V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-23", "description": "Jus got the menudo. It's real y'all. Not fatty. They don't put hominy in it. The tortillas are fresh. It's real.", "author": "Cindy F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-26", "description": "Stopped for lunch. Very good. Table Salsa'a hot. enchilada and Chile Relleno were good.  \n\nBTW Cash Only", "author": "Mark M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-02-03", "description": "Served cold food.  Sent back only to have a big messy inedible blob of crap returned to me.  When I pointed it out, she says OK and proceeds to charge me full price.  Other patrons all Hispanic treated like royalty while my white self sat ignored.  Seriously, people walked in after me, ordered, ate and left while I'm begging for attention.", "author": "Lynne P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-10", "description": "When I think of eating Mexican food out, the only place I would go is GALLARDO's!!\nWhy because they give you food made from scratch and portions are more than you can finish !!\n\nLast dish I order was Camarones Tapatios, and man they were nicely grilled with the right hit of my favorite chile, Chipotle!!", "author": "Leticia Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-07", "description": "Just like family.... They greet you with a warm entrance and give the feeling of \" you've found the spot\". Worked at a window and door shop down the street ( until recently relocated). And always recommend gallardos for the best authentic plates.... I HIGHLY recommend this fine restaurant. Good people, good food. Thank you gallardo family!!!", "author": "Ben P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-02", "description": "nothing beats great sit-down Mexican food, and a great big bowl of albondigas is my measurement for being great.", "author": "Jubilee D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-15", "description": "Great Mexican restaurant.  The breakfast is very hardy and will last you all day. Love the inside colors and classic pictures.\n\nThanks for the great food!", "author": "Ian A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-24", "description": "POZOLE with homemade tortillas is Awesome!!! Caldo de Carne is also very yummy. \nVery family friendly, kids love their tacos and sopes. Bean cheese appetizers is awesome with a chilled Negra Modelo. \nDefiantly a great place to visit for a hearty meal.", "author": "Dee Q."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-02", "description": "It seems like this place has a knack for really yummy soups and stews. Not only by the photos, but also in person everyone seemed to be ordering and enjoying the pozole, caldo de res, or albondiga soups, me included. I ordered the traditional pozole rojo. It warmed my soul with it's delicious, spicy flavor, along with it's tender pork. I actually found myself sucking the fat out of the bones MMM. On the side came Mexican oregano, chili flakes, raw white onion, chopped cilantro and limes to add to the soup as you pleased. There was also raw cabbage, radish, sour cream and tostadas, which I thought were unnecessary because it came with warm tortillas and so many other fillings and toppings. Also, the salsa was off the chain! This dish would have been put over the edge if the tortillas were homemade! Though super friendly, the service was slow as heck. This won't stop me though, I'll definitely be back here to try another soup.", "author": "Adriana G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-01-14", "description": "Today i decided to order from this place. Read the reviews seemed like it was going to be delicious. \n\nWe ordered the menudo and the beef soup. \n\nHonestly was the worst menudo i have ever had. \nIf your Mexican i recommend going somewhere else. \n\nAnd she forgot to put the oregano and chile in our bag even after i asked her to and she repeatly told me is was in our bag. \nAnd to top it off she was rude for no reason. \n\nTake your business else ware.", "author": "Paola R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-24", "description": "We love the fresh homemade tortillas and the place was spic and span and we especially love the homemade beans great food and great service. Best breakfast we had in San Francisco.", "author": "Pat D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-23", "description": "The food here was amazing! The portions were big and the service was great! Tortillas are handmade & the agua fresca (cucumber) was refreshing.  So glad we found this gem, can't wait to come again! If you're visiting San Francisco this place is a must!", "author": "Jessica J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-05", "description": "My mom kept nagging about wanting Menudo and Gallardo's was recommended by a close friend of mine. I didn't know what to expect going in for lunch on a Saturday. I went with my family so we called ahead to save some Menudo plates (apparently they sell out quickly!) Gallardo's was packed upon our arrival, however, the hostess was really kind and was able to sit our group of 6 within 15 minutes at max, which didn't seem too long seeing how busy the restaurant was.\n\nFrom the beginning the service was great. We were accommodated at a larger table with enough eating room for all of us. My younger siblings ordered quesadillas, which they seemed to enjoy. The grown ups got the Menudo dish. Let me tell you, their Menudo is seriously authentic and delicious. If you're a Menudo fan, you've gotta try Gallardo's (but don't tell your friends because I want this place to be my little secret!) \n\nAs we were leaving my cousin started talking to the owner, who seemed genuinely interested in his customers satisfaction. Apparently, Gallardo's was previously at a different location in the Mission which we had gone to in the past but couldn't find after it closed. It was crazy to find out this was the exact same place we used to go to for Menudo. I'm just happy we found it and my mom got to satisfy her cravings. Will definitely be coming back.", "author": "Stefany Z."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-06-04", "description": "The long and short of it is that I stopped by for pozole (small $8.75, CASH ONLY) for lunch the other day and it was okay. Not as good as the now closed Chilango on Church St or Nopalito. \n\nWhy was it only okay? The small is actually a pretty big bowl of brothy soup. They serve it with a side dish of cabbage, diced onions, radishes and limes (for the soup), plus sour cream and crispy tortillas (to east on the side). You also get bowls of dried oregano and chili flakes to sprinkle in. I thought the soup was spicy and flavorful but the pork was almost besides the point. It didn't have much meaty flavor. I didn't think there was as much depth and complexity in the soup as in the other places mentioned.\n\nIt's also a weird size - quite big for one person but not quite big enough to share substantially. I kinda wish there was a $7 or less option. Then I'd feel like it was much better value. Paying to get a lot of food that's difficult to take home for leftovers is not a good deal. Possibly I'm the only person with this problems.\n\nChips & salsa were good. Salsa was super spicy. Also comes in a condiment jar so you're supposed to spoon it onto each chip.", "author": "Jean K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-04-20", "description": "My MIL was craving authentic Menudo ... which we found was hard to find in SF. Ended up here based on Yelp reviews, and sadly, were disappointed. On the plus side, it was edible. Perhaps it's just not what we're used to. \n\nThe nice thing was that they had quick service and the food was fresh.", "author": "Esme C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-21", "description": "Luv this place! Food always hot, lots of flavor and the service is wonderful. I say wonderful because I luv going to a restaurant where you feel at home with your favorite person taking care of you and your food.", "author": "Pet R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-01", "description": "Excellent food and general owners. So I was walking by a Gallardo's recently in the Mission and thought, I would love to have one of their amazing burritos. So I stopped in and ordered a super chicken burrito. Then I realized that I didn't have any cash and they didn't accept credit cards. Before they made it, I told him that asked them to cancel the order. Instead, the owner prepared a delicious super chicken burrito and gave it to me. Told her that I could afford it but just didn't have the cash. She just smiled and said it was fine.She didn't ask for anything in return. I just thought it was very generous. Plus it was an amazing burrito that I share with a friend. Love this place.", "author": "Janet K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-10", "description": "Happened in on this fab neighborhood restaurant as I was biking through the Mission. I usually don't like sit-down eateries in this area because of the ambiance. The run of the mill taquerias serve decent food, but their bare bones interior are bereft of any charm. I usually grab and go. Yet at Gallardos I felt like I was in a lovely residential area in Mexico, lingering over my plate, watching happy Latinos slurping Menudos over a beer. I even tried to practice my Spanish and the lovely servers, las mujeres, obliged. I sat outside and had huevos con chorizo, which I didn't care for, because the eggs virtually disappeared into the chorizo mix. But, this might be my fault as I think the server asked how I like my eggs in Spanish, but I didn't catch her super speedy drift. The woman who shared my table ordered a pozole and it looked out of this world. So next time I will try one of the sopas. The menu is definitely full of interesting dishes that I would like explore.", "author": "Firat Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-16", "description": "7-16-16\nCame back again and brought the two younger kids. I got the chilaquiles with green sauce. So good and more than I could eat (which doesn't take much unfortunately). They obviously use their homemade tortillas in this dish and the thickness of them still absorbed the sauce and stayed chewy and hardy. The girls shared the pancake plate with added eggs and bacon. Next time I'm getting the caldo-another dish that looks super yummy. \n\nThe atmosphere was fun and bright and every dish that came out was not skimpy thats for sure. The owner heard me ask another patron about their dish and so he brought me my own small bowl of Birini (lamb soup) and I had a plate of Huevos Rancheros in front of me that I ordered. I am stuffed beyond with the yummiest Mexican food that beats anywhere I've tried in SoCal. The beans and rice were so fresh and flavorful. The orange juice was freshly squeezed and a thick bright orange color. I had to display my whiteness and ask for some butter to go with the hot fresh corn tortillas I couldn't resist. I wish I spoke Spanish to tell the owner really how good this brunch was! I saw the owner walk around and great all his customers with a smile and friendly service. Would definitely go back. Food was DELISH. There wasn't a bad thing we tried- and we tried a lot!", "author": "Trisha R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-16", "description": "\"What can I get for you, my friend?\"\n\nMom and I visited Gallardo's yesterday for lunch (after mistakenly getting on an eastbound bus from Twin Peaks instead of westbound!) Always on the hunt for posole, I was pleasantly surprised to see that they offered the flavorful pork-chile-hominy stew on weekdays (whereas it is traditionally served only on weekends).\n\nService was very amicable; our sharp, bilingual waitress spoke to all of her customers with warmth and friendliness. The food came out shortly after a side of crispy tortilla chips, fiery salsa, and two passionfruit agua frescas. And OH MY GOD. The posole was better than those I've tried in Mexico City. A plethora of fixings - chopped cilantro, diced onion, quartered lime, sliced cabbage, cubed radish, red pepper flakes, sour cream, and Mexican oregano - accompanied the savory, rich, meaty broth of the pozole. The pork inside the soup was tender and good quality, and the hominy was strangely addictive to munch on. \n\nI had a bit of Mom's enchilada plate - the beans and chicken were full of flavor. She joked that there HAD to be MSG in the beans for them to be so savory, but otherwise she really enjoyed her meal.\n\nBetter yet - we paid $25, tips included, for our whole meal. Take it from a pair of Texans - Gallardo's is the destination for authentic, tasty Mexican fair in Mission.", "author": "Chris W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-09", "description": "Honestly, Gallardos has become my favorite Mexican spot in the mission. Especially love their soups and their caldo de res. Massive hunks of delicious, succulent beef and my favorite beef stew in town (and I've tried a lot of them). Come with a big appetite!\n\nThe service is a little finnicky - you often have to flag down a waitress to get your order in. But they greet you with a smile and are extremely friendly. Love the decor as well.", "author": "Ben G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-07", "description": "OMG Mexican breakfast! Not those fake breakfast burritos. The real thing. Family owned and run, super authentic, excellent customer service! They take care of you here.", "author": "Irving S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-15", "description": "We came for lunch today & had some beers and a Pacifico michelada to start. Good start! The waitress also brought chips and salsa for us to munch on and the salsa was good, just a little spicy... So we ordered a side of guacamole for the table and mixing them was great. \n\nWhile we were waiting for our food some little mariachi guys came in and played some music for a while, my grandparents would love this place! Live music definitely makes the ambiance better. \n\nI got the large pozole - perfection!  Our waitress recommended it & I'm so glad she did. I love that it came with all the mix ins on the side, I will definitely be back for this to cure the next hangover... I just wish it was closer to my house. \n\nNick got the chile verde burrito, it's huge! He took half to go. I had to try a bite and boy was it yummy! I'd recommend it. You can get t regular or super for 1$ more - add guacamole, sour cream and salsa I think it was. Do it! \n\nThe service was great and everyone was very friendly. Can't wait to go back and try something else on the menu.", "author": "danielle a."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-01", "description": "Had Sunday brunch, the food was amazing! Waited for a little over 5 minutes to be seated. Once we ordered the food arrived in just under 10 minutes. \n\nOrdered the birria, chilaquiles, and huevos rancheros. The chilaquiles were perfectly crispy and soo yummy! The huevos rancheros were extra cheesy just how I like it. The tortillas were the best handmade fresh tortillas I've ever had. Their coffee was delicious with a hint of cinnamon. \n\nThe service was good, it was packed. My only dislikes were that they charge for chips and they weren't fresh. The chips tasted stale. Also, it was inconvenient that they only accept cash on the weekends, but the food is reasonably priced...so that's good.", "author": "Christina O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-08", "description": "Yesss. Micheladas menudo is everything.. and nothing better than athentic Mexican food  .. can't stand all the white people thoe  ... good service good food good price it don't get any better ..", "author": "Reyna C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-22", "description": "Incredible authentic Mexican restaurant in the Mission!  I highly recommend the chicken enchiladas in red sauce.  The place is cash only and the service can be a bit slow, but the homey feel and excellent food more than make up for it!", "author": "Desiree J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-22", "description": "My husband and I came here both days this past weekend! We had such a great experience and food on Saturday, that we decided to come back for dinner the next day. This is a family owned and operated business, with some deep roots in SF. The customer service is genuine and spot on. \n\nNow, let's chat about the food. AMAZING! During the last 2 days, the husband and I ordered: pozole, shrimp cocktail, pescado de diabla, and some sort of animal infused burrito (all him). The pozole was delicous! From what I heard, his shrimp cocktail was divine as well. My pescado dish had an extra kick of spicy per my request, and I absolutely loved it.  \n\nI used to come here a lot when it was at its previous location on 14th street for lunch. Since it moved, and since I've moved I have forgotten what a gem this was. We will be coming back here as regulars.", "author": "Tracy C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-29", "description": "Excellent, friendly service. I ordered the Chorizo and egg burrito, regular size. Huge size for the money. Great value. Very tasty. I always pop in here to pick up two burritos before heading in for a tattoo appointment. One for me, one for the artist. We both love the food.", "author": "Chef C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-01", "description": "I stumbled upon this place via a morning Yelp search to find a place to cure my hangover born of a Halloween party the night before.\n\nI had been aimless scrolling around Yelp for over 10 minutes before the words huevos rancheros popped into my mind and that was the end. I entered huevos rancheros into the search box and Gallardos was the first place that popped up - for good reason.\n\nI'm not from Mexico, so take for it what you will when I call this place authentic, but it sure does feel like it to me. Fresh, homemade corn tortillas, spicy salsa, the scent of fresh food cooking wafting through the room. What else could you want? I, of course, got the huevos rancheros with a \"side\" of their birria, their weekend special. \n\nNow birria and I have a very long relationship - the first time I tried it I was down in Rosarito, Mexico on a spontaneous weekend road trip down to Mexico. The circumstances of why our group thought it would be a good idea to drive from San Francisco to Mexico on a whim, I am unsure. However, what I am sure of is the fact that it was on that trip when I discovered what birria was and fell in love. For those of you who don't know, birria a Mexican soup, usually cooked with lamb (this is also the way Gallardos serves it), and it is amazing. It's exactly your answer to a Saturday/ Sunday morning hangover and the best comfort food. Now, I am not lamb's biggest fan, and I was hesitant to try the birria here for fear if it being too gamy. Gamy it was, but in a good way. I could eat it and the spices - chiles, etc., did a good job of easing the intensity of the gamy flavor. Gallardos serves the birria with their thick tortillas and those alone are to die for.\n\nWe walked in and got a table immediately, but as we were eating, a short line formed out the door. Also of note is that this place is cash only, so don't forget to grab some before you come. I'll definitely be coming back here next weekend.", "author": "Patricia K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-01-29", "description": "One of the many benefits of working in the Mission District is the abundance of Mexican restaurants and taquerias to choose from on a daily basis. While my co-worker and I Yelp'd our way to find a new place to try, he brought up Gallardos, a Mexican restaurant that he had visited a few weeks prior and couldn't help but recommend. I'm not one to ever turn down a new Mexican spot and we made our way down to their 18th Street address.\n\nGiven that this was a Monday, I can safely say that 1 of the 2 of us were hungover, and I was already salivating over the pictures fellow Yelpers have uploaded. We were both surprised by how busy the restaurant was until we realized it was a Martin Luther King Jr. day and a holiday for most people. Luckily since we were a small party, we were quickly seated without having to wait.\n\nThe cute waitress brought over some menus and took our drink order and brought us some chips and salsa. The menu is rather long and has plenty of options with many entrees around the $10 mark, with only a select few costing in the $15 range. After looking over the extensive menu, I settled on combination plate #3, enchiladas rojas. The plate includes two enchiladas with your choice of chicken, steak or pork, covered in red sauce and served with rice and beans. I chose to go with chicken and as far as beans, you have pinto, black, and refried to choose from.\n\nUnfortunately this is where service began to deteriorate. I understand that the restaurant was busy but it didn't seem slammed and even receiving our two drinks felt too long. Once we did receive our drinks, we were out of chips and that took just as long. As for our food, it took longer than we expected but luckily for us, we weren't on a time crunch. I will admit that once the food hit the table, it looked mouth-watering delicious. Also, I did appreciate that both plates were delivered together and not staggered.\n\nA few bites and I will say that everything tasted A-OK, it was by no means earth shattering but it was better than your standard taqueria fare. The ingredients felt fresh, the pinto beans were done right, and the enchiladas were stuffed with shredded chicken, and topped off with plenty of salsa roja and smothered in melted gooeyness. It was definitely the right choice for a hangover Monday, not to mention the side of rice and guacamole included on the plate. My co-worker was equally pleased with his plate and once everything was said and done, we were both stuffed.\n\nHowever as far as service, it was pretty much nonexistent after our food was served. It was difficult to try and get refills on water and some extra napkins. It seemed rather odd considering that the rush was dying down but for whatever reason, we seemed to be forgotten. Even getting the bill was difficult and took a few minutes, but nonetheless, I'm open to give Gallardos a second chance. The food felt homemade, fresh, and was reasonably priced given the sit down service and portion size. I hope to have a better experience, service wise the second time around.\n\nAmbiance/Decor: 3/5\nFood: 3/5 \nService: 2/5\nPrice: $$\nOverall: 3/5\n\nPros:\n+ Large menu with most prices around $10 with a high of $15\n+ Food tastes authentic and fresh\n+ Sit down, restaurant service \n+ Nice atmosphere and decor\n+ Reasonably priced\n+ Beer and wine available\n+ Credit cards accepted\n\nCons:\n- Slow service", "author": "Alexander E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-14", "description": "Portions are generous and pricing is not bad for a spot in the Mission. It's on the corner and parking was pretty easy for me on an afternoon day. I had two tacos, which were around $4 each - and was stuffed after. My boyfriend had a regular burrito that was super big and left him stuffed as well. The salsa was delicious but too spicy for me to handle, so the waitress brought us a more soupy one that had less of a spice - yum! Service was friendly and I can't wait to return to try all the other items on the list :)\n\nAlso, cash only!", "author": "Amanda C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-31", "description": "Like no other Mexican food experience except my grandmas house and Mexico. So much flavor in their Caldo de Pollo and their Nopales con huevo was delicious!!! I brought some caldo home and it was even more delicious as leftover. Service was average but it all worked out. Micheleadas were a perfect finish to a delicious home cooked Mexican meal!", "author": "Christine S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-10", "description": "Best traditional Mexican food in SF, thanks Juan & family! Try to order the house made tortillas!", "author": "Jacques T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-21", "description": "Amazing burritos! So filling, flavorful, and tasty!   Service is great, just slow as it's very busy. \n\n\nGreat atmosphere.", "author": "Herald A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-14", "description": "I call on Mother's Day and order Menudo and it was the best. The food is delicious I will always come back here. the people were great the lady at the front (cashier) was very polite and very nice.make sure that I have everything and asked if I needed anything else.", "author": "Hector O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-21", "description": "Real Mexican Food!!  I feel the best I have ever had in my 72 years of life.  They make their own salsa and is the best; warning-has a kick to it.  You will want to buy some to take home.  The service is very good.  I am from the Riverside, Ca. area and will definitely eat at Gallardos every time I visit San Francisco.     Steve", "author": "Steve W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-06", "description": "Manager/owner: \"You really like to take pictures\"\n\nMe: \"That's because I'm visiting from NY, the land of no pozole, so I really need to capture this moment.\"\n\nManager/owner: \"Oh, the NYTimes actually did an article on our pozole and menudo.\" \n\nMe: \"Not surprised. It's THAT good.\"", "author": "Tammy K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-07-25", "description": "I just don't think this place has very flavorful food. It's charging SF prices for casual Mexican food. I could deal with that if the food was memorable in any way, but it's kind of not. I think El Techo has better quality food for lower prices. Sure, it's not a sit-down place, but if you go here at a busy hour, you really shouldn't expect very prompt service either: A colleague and I recently had lunch here on a workday it it took over 90 minutes. \n\nSo in my mind, you should either pick a non-sitdown, or if you really want to sit, pick a \"fancy place\".", "author": "Justin A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-15", "description": "Me and the family have been coming to Gallardos since it was on 14th South vannes the pictures all over the wall bring a really good vibe into the place as well as the customer service. The food is always good too. Best breakfast spot to go to", "author": "Paula G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-11", "description": "Yay for outside seating! I can finally enjoy a bowl of menudo with my trusty canine companion.  \n\nThe menudo here is exquisite! It was seasoned perfectly...spicy, hearty, and piping hot...delish!\nThey do not hold back on the meat either...I ordered a small and was barely able to finish it...probably because I ate about half a dozen homemade tortillas.\n\nMy bf had the birria de chivo al horno. He was very impressed...he says its probably the closest in flavor to the stuff served in the motherland (Mexico). Our only gripe is the choice of salsas...i wish they had a better selection. Maybe something with toasted chile de arbol & garlic? That would put this place over the edge for me...oh well. \n\nThe service is impeccable. The food is delivered quickly and always with a friendly smile. I highly recommend this place to my paisanos looking for authentic tasting Menudo & Birria de chivo. \n\nOh and it's reasonably priced too..I'll definitely be back.", "author": "Gina G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-21", "description": "As members of the Fond of Goat organization, needless to say we went to Gallardo's for their Birria de Chivo which is served only on Saturday and Sunday.  The dish - which was a dry (\"al horno\" = oven roasted) version, came with tortillas for wrapping, condiments (lemon, cilantro, onion, oregano, chili flakes), and a bowl of goat broth (\"caldo\") fir dipping.  It was first rate.  We had the same dish at the nearby San Jalisco a few weeks back and it is difficult to pick between the two.  The SJ dish had more bones, which I like, although Gallardo's version made for easier wrapping in the tortilla.  SJ came with beans and rice while the Gallardo's version did not include any sides.  All in all a toss up - best to try them both!\n\nWe did really enjoy Gallardo's space (the warm walls and high ceilings really made for a pleasant dining environment on a beautiful day like today), and their staff was very attentive and welcoming.", "author": "Mike M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-29", "description": "You know an ethnic restaurant IS legit when you walk in and everyone stares at you. Not because your fly is down or you have a protruding camel toe but because they're probably wondering WTF you're doing there. Blame it on Yelp.\n\nWe walked into Gallardos in search of authentic Mexican comfort food and were welcome with stares from all the native patrons. No hipsters in sight. We were definitely in the RIGHT place. \n\nA family owned and operated restaurant, Gallardos seems to be popular among families as we saw many Mexican families partaking in Sunday brunch. They have a fairly large dining area split into 2 sections so it's good for groups. Gallardos has on overwhelming menu: Mexican breakfast items, American breakfast items, omelettes, salads, soups,  tacos, quesadillas, burritos, sandwiches, tortas, burgers, seafood plates, meat plates, and combination plates BUT the thing to order is their sopas (soups). They'll soon be moving to 18th street so do call ahead of time to see if they're still open at their current location across from Foods Co.\n\nCash only on the weekends.\n\nThey were out of Birria, their specialty so I ordered a large bowl of Menudo (weekends only - $9) and Mr. NSS ordered a large bowl of Caldo de Res ($9). While we waited for our order, we received a complimentary basket of chips and salsa: http://bit.ly/16cQtua. The warm chips were thin and crunchy with just the right sprinkle of salt. Like crack, it was purely addicting. We also ordered Guacamole ($5.50) which as you can see should have never been served in the first place: http://bit.ly/12UFrqs. \n\nMy eyes glistened as our two steaming bowls of soup arrived. Comfort in a bowl, the menudo was chock-full of tenderly soft honey comb tripe in a robust crimson mild chili broth: http://bit.ly/ZfTiTZ. There was also a huge pig's feet and knuckle that was a gelatinous sensation in the mouth. I know pig's feet may sound gross to many but it's truly a delicious delicacy that should be tried at least once. Menudo is my ultimate Mexican comfort food and this was by far the BEST bowl of menudo I've had.\n\nThe Caldo de Res is meat and potatoes in a bowl: http://bit.ly/11QCA0I. With large beef shanks, potatoes, tomatoes, carrots, zucchini and corn in a homey broth, the Caldo de Res is served with rice and beans, making it one hearty dish.\n\nAside from the no bueno Guacamole, everything was 5 star worthy. The sopas were amazingly comforting while the service was very warm. The owner even came up to our table and started speaking in Spanish to me (apparently she wanted me to try her desserts). \n\nSorry Ms. Owner Lady, despite having taken Spanish in high school, the extent of my espanol is \"Donde esta el bano\" and \"Yo quiero corona y patron\". \n\nThe two most important things to know when traveling in Mexico right?", "author": "Cherylynn N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-27", "description": "Yikes! They're moving to 18th Street? (photo: http://bit.ly/12OPLQT) Well, that's what I get for waiting so long to try Gallardo's which is a nice, hearty stroll from my home in its current location across from Foods Co. After all, it's been around for only 53 years, clearly a fly-by-night operation. Jamie W. and I came here quite by accident when we were buying our 72-packs of toilet paper at Costco. After we started getting peckish waiting in the ridiculous line there, we walked over to the SoMa Streat Food Park just a little too early since none of the trailers were open. That's when I remembered Gallardo's as a place to get some morning menudo. The place is bustling on Saturday morning with a steady stream of regulars coming in and out of the two-room dining area (photo: http://bit.ly/15OdRhB).\n\nFor lack of options, we were seated at the largest round table in the middle of the floor. The desayunos (breakfast) menu is robust and comprehensive, much like it is at SanJalisco on South Van Ness and 20th (photo: http://bit.ly/11Mnxnx). But instead of colorful Mexican folk art decorating the walls, Gallardos offers what appears to be enlarged movie stills from Mexican cinema. I like it, just a bit of glam to go with your super-burrito. Jamie ordered the $8.25 Machaca Con Huevo, a very full plate of scrambled eggs mixed with shredded beef, onions, tomatoes and bell pepper with rice, refried beans and warm tortillas on the side (photo: http://bit.ly/12OPjls). Hearty eating and diner-ifically good. It's Saturday, so of course, it was the $9 grande bowl of Menudo for me.\n\nThe rich red broth came from a mix of roasted tomatoes pureed with dried chiles (photo: http://bit.ly/Z2hbOI), and there was a generous amounts of tripe and beef bones swimming inside. I sprinkled the cilantro, diced onion and dried oregano, and the result was definitely one of the better bowls of menudos in town (photo: http://bit.ly/183aUJk). Along with the warm tortillas, that should have been a complete meal, but I was so seduced by the lure of the $3 Puerco (Pork) Taco that I ordered one. What arrived was a meal in itself, a corn tortilla piled high with shredded carnitas, queso fresco, tomatoes and avocado slices (photo: http://bit.ly/11rw1zT). Whoa, that was a lot of food but the perfect way to laze on a weekend. Besides we had 72 rolls of toilet paper in the trunk, so we were good.\n\nFOOD - 4 stars...great bowl of menudo, satisfying huevos make for hearty eats on the Mission/SoMa border\nAMBIANCE - 3.5 stars...love the Mexican cinema photos all over the walls\nSERVICE - 4 stars...very kind and attentive as they buzz around the tables\nTOTAL - 4 stars...I'll follow them to 18th Street, I'm sure", "author": "Ed U."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-27", "description": "Arrived this morning, a Saturday about 11 am, and it was packed.\n\nService was super quick tho and our food arrived fast.\n\nWe had the lamb soup, that's only on menu Sunday and Saturday, a chile verde burrito which was huge, could only eat half.  And I had a chile relleno and chicken taco \n\nThe food all tastes great.  The cucumber drink was fabulous (a little too sweet tho, I think they added too much sugar, but I beleive it was very authentic).\n\nOnce we got our food we never saw our waitress again.\n\n....the reason I dinged a star, is we waited forever for the check so we could leave. I finally walked up to register to ask how to pay (which wasn't easy with all the tables to maneuver around) and told to sit down they would bring  it, then I had to go back to the register to pay.  It was all so awkward.", "author": "Foodlover B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-15", "description": "Wow. Giant portions overall and the Pozole was truly incredible. Amazing place and locally run and owned. Will be back.", "author": "Ben G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-28", "description": "This place is great!\n\nCame here for breakfast, and was instantly greeted by the nice staff. The service continued to be great throughout our meal.\n\nThe food is authentic, the atmosphere reminds me of family parties growing up, and everyone seems genuinely kind here.\n\nI recommend coming here for breakfast or lunch.", "author": "Lindsey C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-09-18", "description": "Stopped by here for dinner and were disappointed with 2 of the 4 dishes we ordered.  Steak salad - while the salad was a generous portion, the steak was chewy and flavorless.  Chile Verde De Puerco - the pork was dry and chewy as well.\n\nChips and salsa were excellent.  Tried to order a side of guacamole and was surprised they didn't have any...The kids didn't like the shredded chicken used for the quesadilla. We ended up going down the block to El Tepa for a fish taco afterwards.", "author": "M G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-04-22", "description": "their pozole had way too much cubes of pork.. however the broth was really good!\n\nthe soup came out a bit cold.. \n\nlots of tables.\nparking is tough.\n\nthis place is CASH ONLY so make sure you pass by an atm before hand.", "author": "Kris A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-28", "description": "A local family run mexican restaurant that is cash only.  Nothing fancy, authentic cuisine. Go on the weekends for the menudo.\n\nBeware that yelp warned me they had a low Sanitary score.\n\nPicks:\nEnchilada rojas ($8.75) 2 chicken enciladas in red sauce with rice and beans.  Good size, real meat and beans.\n\nJust OK:\nNone\n\nWould not reorder:\nNone\n\nOverall - Good\nFood - Good\nDecor - Good\nService - Good\nValue - Very Good\n\nWould we come back - Yes", "author": "Ellen H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-21", "description": "Came here for lunch with the bf. Close by to our office. This was our first time dining at a Mexican restaurant (we always eat at taqueria when we want something more common) Food was very good! Flavorful & fresh. BIG portion for a reasonable price! Its always pack and busy (which is a good and bad thing... when its too busy, the service might be a little slower than usual! \n\nDefinitely would come here if we are craving for mexican food!", "author": "Peter C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-09-24", "description": "I used to go to this place and it had better food so I wanted some fresh made tortillas and birria but they didn't have none. So I look at the pictures on yelp believe me nothing of what the pictures show are true the menudo tasted old then I asked the waitress what day was the menudo cooked and she said today. It was a lie it was sticky and nasty. Being a cook myself I know about food. The quesadilla plate that they offered was nothing like the one in the picture it was half of a quesadilla cut in a square. The plate on yelp for the shrimp soup, had nothing to do with reality. It had 4 shrimps a lot of soup to cover that they didnt put enough shrimps they put big pieces of carrots. I don't have nothing else to say about this place.. I won't be returning to this place. Oh and I heard from my family they always go to this place I guess they didn't like me or my kids but I can say they have really good servers that's why I give them one star I hate that some Mexican restaurants in the beginning they offer you the best food then later on cut corners in the food it doesn't taste the same I think that it should be authentic for the prices that we're paying for food believe me I am Mexican so I know flavors", "author": "Maria H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-02", "description": "Fantastic flavors and sincerely cared that we had a great experience. That is special, especially in a city that makes you feel guilty for ordering a coffee at a coffee shop.", "author": "Kevin O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-20", "description": "One of the only authentic Mexican restaurants in San Francisco. With homemade tortillas and big portions you can never go wrong with any dish. This is a family run business and will give you that home feel and service.", "author": "Roberto H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-11-20", "description": "Rainy day brunch for 6 that I won't be forgetting soon. Heart the large black & white photos of classic Mexican entertainment stars(?) along the walls. Heart the loud serenading guitarists randomly walking in & out. Hearted my sabotender omelette + fresh 6-juice blend that matched the deep red tablecloth. No matter what you order, eat some of it on the handmade tortillas = must-try.", "author": "Dan B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-02-25", "description": "Basic Mexican food. I had to get up and ask for chips because they charge for them and you don't get them complimentary. They didn't bother to tell us either as most restaurants don't charge for chips and salsa at least when you dine in. Parking is of course difficult. They give you can sodas at $1.50 each because they do not have a soda machine. Restaurant only takes cash and their ATM machine doesn't work. Alot of old ways to do business.  I had to get up to ask for napkins, extra plates, and it took awhile to get someone to take our order. The plus side is that the staff is kind to their customers they just took awhile to get back to us when we asked for stuff, took long to bring the bill, and really didn't come check on us.", "author": "L S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-28", "description": "Mexican food heaven. This place was packed with a local old timer mission crowd. Fortunately the outdoor tables were wide open.\nI had the abondigas soup. It a ridiculously big portion. Meatballs delicious.  Broth perfect. With it I got a bunch of hand-made tortillas, bowl of dried oregano, bowl of cilantro and onion and home-made salsa - yummm.  Accompanied with a Negra Modella the tab was $13.", "author": "Ric S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-04-02", "description": "This was the worst dining experiences I have ever had.\n\nIt started out fine, with a mostly empty restaurant and our option to pick any table. There were a ton of options on the menu, so I decided to pull up Yelp and see what's popular. That's when I was immediately presented with a notice that this restaurant has a history of poor results on their health department visits. I should have run but we were  in a time crunch and needed to get dinner right away....bad decision. \n\nI ordered enchiladas and my partner ordered a burrito. Food came out quickly. Too quickly. The food was obviously not fresh. The beans and rice on my plate were clearly microwaved, crusty around the edges and inconsistent temperature throughout. The chicken in my enchilada was dry, tough, and tasteless. The pile of wilted greens could only pass for a salad on a public school lunch tray. My partner's burrito was cold throughout. I will say the presentation of the burrito was excellent. We never received chips, but for some reason we were given extra tortillas.\n\nNo one ever paid attention to us after delivering food,  so we could not complain. I was also unable to get a refill on my iced tea. \n\nThe kicker was the end of the meal we waited a full half hour for our bill. The restaurant was only a third full, but no matter what we did we couldn't get the attention of any wait staff. After a while my partner got up and directly asked a waitress to bring our check. She never did.\n\nHe got up again and was completely ignored. So he grabbed a menu from the front of the restaurant, we figured out how much we owed, threw down cash, and left.\n \nI wouldn't recommend this restaurant to anyone, ever, for any reason. The food was worse than mediocre, the wait staff were completely oblivious, and the ambience was nothing to write home about.  \n\nPick any other Mission Mexican restaurant but don't come here.", "author": "D D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-04", "description": "We go there and the place was packed, the waitress didn't speak much English which was fine and luckily speaking Spanish got us a communal table by the door, whew the last few seats left before the line up began. Good sign. I can see everyone getting menudo or birria as it was the weekend. The prices were very good on everything on the menu but we came to try what we wanted the Birria. They had 2 types one \"al horno\" - meat separated from the broth or the big gigantic bowl of goat soup.  We went for \"al horno\" as I like to make my own tacos with it. It was heaven. Just like I remembered it. Love this place. The poor waitress was very busy, the place was pretty big and there appeared to be only 2-3 waitress maybe family run. It took us forever to order even though we knew right away what we wanted.. so difficult to get her attention too but the food made it all worth it. Another tip is the Jugo mixto the fresh squeezed orange and carrot juice is to die for. So yummy. This was a fantastic start to our search of birria in SF!!\n\nValue 5/5\nAtmosphere 4/5\nService 2.5/5\nQuality 4.5/5 \noverall 16.20", "author": "Nina S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-17", "description": "Went to a Mexican restaurant with the dietary restriction of not being able to have any dairy products (or anything that contains calcium). Oh boy! \n\nThe reviews for this restaurant were great and I don't eat a lot of authentic Mexican food so I really wanted to stop by here being that it was also in the Mission. \n\nI ordered Pozole because of the reviews and because of hearing all my Mexican friends talk about it. I asked the server how to eat it because she also gave me tostadas, tortillas, cabbage, radishes, and sour cream. She laughed and was so awesome and told me the ways people like to eat it. It definitely made me enjoy my dish more and enjoy the service I was getting. \n\nThe Pozole was delicious. So hearty and filling. I could not finish it! \n\nMy friend got two tacos. They were pretty big tacos too! He got one carne asada and one chicken taco. He says he enjoyed those as well. \n\nI paired my Pozole with a Negra Modelo (recommended by our awesome server). \n\nYum yum. The restaurant itself is very cute as well. With marigold walls filled with classic black and white pictures of, what I'm guessing are, movie stars. \n\nIt was about $8 for the Pozole, $3.75 each for the tacos, $4 for my beer. My side of the meal was about $14 including the tip. Pretty good!!!", "author": "Jess D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-02-09", "description": "FYI, Cash only on Saturday and Sunday\n\nFriendly staff (even let us pay with credit card as we had no cash), free basket of chips and salsa. \n\nThe highlight, was definitely the soup, the tripe and the pozole. They came in a gigantic bowl, filled to the brim, with plenty of meat in the soup, in fact, LOTS of meat. The soup came with sides of chili flakes, herbs, onion, cilantro, and lime, so you can season it to taste\n\nwill definitely be back!", "author": "Long C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-25", "description": "Since Gallardos moved two blocks away, I have found myself here very often. Everything is as delicious as the first time. Thank God because good authentic Mexican food is hard to find in SF. Coming from SoCal I am used to a specific flavor, spice etc. \n\nSeeing as I am about to jump on a plane to the S Pacific, where there may only be \"count on one hand\" Mexican places, it was a must that I stop in!\n\nA must in the Mission.", "author": "Jaylena P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-07", "description": "The pozole here is so yummy.  Best place I've found in the bay area by far.", "author": "Janell W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-12-04", "description": "Food was solid. Got belittled for not having cash. Food wasn't worth that. If they only want cash they should post a sign and not be rude", "author": "Luke R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-01-19", "description": "There good is not that great and the service was poor. It took them forever to take my order. I went over to the counter to place an order and the waitress told me to return to my seat. Perhaps I wouldn't have needed to rise from my chair if I wasn't kept waiting for so long.", "author": "Estefania M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-07-16", "description": "2nd time here; the food is ok. The 1st time i came it was super crowded and we had to wait for a table. This time, it was only 1/3 occupied. Not sure why. Lunch hour. Ordered grilled camarones. took a while for the food to come. Good sized portion of camarones. I had forgotten to tell them i wanted black beans, so after my plate came, i asked for black beans but it never came. We decided to just leave and let it go.\n\nNo birria or tostada de ceviche. May try a diff place down the block next time.", "author": "Tiffany W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-27", "description": "It was 11:30 AM and time to hang out with the boys for lunch. The place was with a few customers so it was easy to get a table. I ordered a large beef soup. The meat was still on the bone, the corn was soft, and the broth was hot. I used the homemade salsa on the beef and it was HOT!! The soup is $9.00 for a large and $8.00 for a small. When I come back here next time, I will definitely try something different.", "author": "Larry W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-03", "description": "Hands down my favorite place to sit down with friends and have great mexican food at even better prices (\"am I dreaming\" type prices).  The staff is consistent and smiley.  It is my second favorite place to bring people when they visit me in the Mission.  Cha Cha Cha is my #1 Fav.", "author": "Jonathan B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-25", "description": "Being Mexican we are very picky about Mexican food places but this place is Great Authentic Mexican Food! A must when in San Francisco!", "author": "Omar R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-20", "description": "This might be my favorite place to eat in San Francisco. It's cheap enough to eat here regularly, the service is always friendly, and the food is great. The soups (caldo de res, menudo) and their combo plates are the standouts. They do seem like they're understaffed all the time so they're a little frantic but they always take care of customers in a pretty timely fashion. Came here once near my birthday and the owner overheard that it was my birthday so he brought out a birthday plate of flan, plantains, and a palm tree made from a carrot, oranges, and a green pepper as the leaves. It was awesome.", "author": "Young L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-06", "description": "HANDS DOWN BEST MEXICAN RESTAURANT I EVER BEEN TOO!!! My bf and i always order enchiladas verdes and I swear to god this is the ONLY place they know how to make them perfect. My only concern is that this place is a little small for the amount of people they get on the weekends (it gets PACKED!) But i guess that just tells you how popular this place is, the people there are SUPER nice and the food is great. What more could you ask for?", "author": "Alyssa R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-07", "description": "Great happy friendly service & good food , we had Pozole & pork with green chili sauce both excellent \nNote only beer & wine \nOn the weekends they serve Goat", "author": "Rodney H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-14", "description": "Excellent family restaurant in SF! They were quickly able to accommodate a large group. The Coctel de Camaron was excellent! Great service and great food!", "author": "Emily M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-02", "description": "Love the breakfast here. Cant go wrong with anything you order. Fresh made corn tortillas were soooo good. Small place with little seating inside and outside seating. Definitely worth the wait.", "author": "Tina M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-27", "description": "Over more than a dozen visits the food has been consistently great. The servers have sometimes been harried but always friendly and welcoming. When we celebrated a friend's birthday with dinner at Gallardos the owner made a wonderful fuss over us.", "author": "Tom W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-16", "description": "Make moves.\n\nCaptivating mural: http://www.artandarchitecture-sf.com/make-moves-mural.html\n\nCaptivating cuisine: http://www.sfgate.com/restaurants/bargainbites/article/Gallardos-back-in-business-5125056.php\n\nVisited the original location once for breakfast. Came back twice more to the new location for:\n\n-  Lunch: Enormous torta packed with grilled chicken (bit of skin), onions, lettuce, tomato and avocado. Delicious $8 deal. Cheese and sour cream are standard too.\n\n- Dinner: Impressive serving of shrimp complemented by an impressive serving of tomatoes, onions, bell peppers, carrots and zucchini. Impressive taste too.\n\nLast one comes with beans (great to see black beans were an option), avocado, rice and tortillas. $15 for what could have been two meals was very worthwhile.\n\nRed tablecloths and yellow walls give the new space a bright and festive feel. Staff was friendly and attentive. Roving band of musicians was a nice tough.\n\nPlan to make a move here.", "author": "Jason B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-13", "description": "Simply delicious. I drive from Sacramento to have breakfast here, or it's part of my must-stop places every time I'm in the city. Reminds me of my grandma's food.", "author": "Juan G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-02-11", "description": "I've been looking for a place where it has the Mexican soup I had before (Yes, I thought there was only one type of soup in Mexican cuisine). And, I found this place on Yelp last weekend. \n\nOMG, I am glad that I found it. Why? because there are actually various types of soup in Mexican cuisine. HAHA, and, I just found out. \n\nI had the Pozole which was pork meat and hominy beans. There was lots of cilantro and union came on the side. I put almost the whole bowl of them in the soup. And then, I had my first bite/sip. AWWWWWW...SO GooooooOOOOD. I never thought Mexican soup can be so rich and complex. of course, it was delicious at the same time. \n\nIn addition, the waitresses were so nice and friendly. \n\nHighly recommend this place if you want some Mexican soups. I would definitely come back to this place to try other soups and dishes (Their rice plates looked great, too). \n\nP.S. the front of the store look so sketchy and not inviting, but don't let it fool you. The inside was open, clean, and neat. \n\n=)", "author": "Evan L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-26", "description": "Gallardos is awesome. They make great chilaquiles, albondigas, pozole and potato dishes, among other things. We've been here tons. Kind of surprised by the alert on their Yelp page, so unless there's been some drastic change in how they run their business, I wanted to vouch for them as a long-time customer and say that this place has made my day for many years.", "author": "monica d."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-31", "description": "Birria and Menudo on weekends -- come early they often sell out by noon. Chilaquilla are phenomenal (best I've ever had). Friendly helpful service. And fresh squeezed OJ. Highly recommend. Don't understand negative reviews below.", "author": "Daniel W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-23", "description": "My favorite burrito spot in the mission.  Best machaca burrito in town.  Comes with delicious salsa that burns just right.  The other delicious things here are the tostada and posole.", "author": "Dan P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-21", "description": "Best Birria(Lamb soup) \"al horno\" in the Bay. They only have it on the weekends though.", "author": "Sergio M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-05", "description": "Rica comida!! Fast and friendly service. Homemade tortillas with delicious birria. Definitely try this place", "author": "Sandy C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-22", "description": "Food here is really awesome and the family works so hard to make it good.\nStick with the true Mexican food like Pozole.", "author": "Trecker J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-04", "description": "was looking for a snack bite before heading over to Flour + Water later on. 3:30 and the place is packed with families and extended families and lots of happy kids. Walked in and then it hit me....this use to be Chava's. The vibe is still there. Great food. Breakfast served all day. The refried beans are some of the best I've ever had. Nopales and eggs--yum! They had a serious run on the guacamole, so couldn't try it. Will be back.", "author": "K T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-04", "description": "Been there once.  Got the chicken enchiladas w/green sauce.  Yum!  Salsa that came w/chips was excellent -- first time it was hot enough for me w/out losing other flavors.\n\nItchin' to go back!", "author": "Chet M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-03", "description": "Pozole Review\n\n\nI always had bad decision choosing the right menu.\nOn yelp, it seemed to me that the most popular food was pozole and menudo. \nSo i tried it and it was  awesome!!\n\n\nComes with very big size\nAbsolutely deep taste of the soup\nPork is soft and tender\nFresh and that stunning kick of the salsa sauce!\n\n\nWhat more can i say?", "author": "Stanley Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-13", "description": "This is my 2nd top fave place to go In the mission the caldos here are the best super clean and very friendly staff I will deff return", "author": "melisa r."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-12-30", "description": "Stopped in this morning for breakfast, as they turned on the lights.\n\nFood was very good, and service couldn't be friendlier. \n\nBreakfast burrito was huge, and outstanding.\n\nWill make it one of my regulars.\n\nUpdate 12/29/14\n\nDisappointing meal last night. Chili Verde was dried out, and tortillas were dry and hard. Will try them again, but pick a different meal.", "author": "Terry L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-20", "description": "Wow!!! This place is bomb!!! Authentic Mexican food! Just like grandma's cooking!  And portions are huge!!\n\nWe came on a rainy night...ordered some pozole and boy are they generous with all the fixings! It was delicious!!! \n\nFor our main dishes, Carne Asada Burrito and the Camarones al Mojo de Ajo which came with refried beans, rice and salad...the meat in the burrito was so tender and flavorful! And the shrimp was so juicy and succulent. 12 Large pieces too! I was surprised to see that many pieces! \n\nBefore the food comes out, they give you fresh tortilla chips and a jar of salsa!  It was pretty spicy. Luckily we love spice so it wasn't a big deal to us. But seriously, my mouth was burning while i wanted more and more! Ahaha It was so good we used it on our main dishes too! \n\nI only deduct a star because there was just one lady working the entire dining area! She greeted you at the door, took your order, brought your food, and bussed the tables!!!  I do give it to her!! She always had a smile on her face and a good attitude.   But if you needed more water, napkins, or your check, it was hard to wave her down. Actually, just watching her do all that work by herself, we patiently waited...a while.\n\n\nThis place is a great place to take your friends and family! Highly recommend this place. I plan to come back on a weekend when they have their menudo on the menu!  Can't wait!", "author": "Candice V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-01", "description": "This place hits the spot. Coming from San Diego, where the Mexican border is just a short 10 min drive, its really hard to find great authentic Mexican food any where else. San Fransisco as my second home, so far hasn't impressed me with great Mexican dishes till the one day I got sick and in my head I heard my mom say\" eat some soup\" mija!!! Thank you to who ever cooked the amazing Pozole at Gallardos! Not only did I feel ten times better, but felt like I was eating Pozole from my grandmas kitchen with just the right amount of chile rojo. So fresh and Yummy! Im coming back for more!", "author": "Michelle Q."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-09-03", "description": "They were really accommodating to my weird dietary restrictions and made a deconstructed burrito, which was decent. Cute, clean place. Honest food.", "author": "Andrew K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-10", "description": "hey yelpers...\nI been coming here for years they started on 14th. st. this is the best Mexican restaurant in san Francisco.. every plate you get is authentic Mexican cuisine off the hook. since im Mexican I get only a few things I love getting that I don't cook at home often. 1) Birria (goat meat) with all the topping very good for hang overs you can get it in soup form or oven cooked with a side of the broth which I prefer cause you can make tacos and dip your taco in the soup cant go wrong plus HANDMADE corn tortillas my favorite 2)tampicana which is rice, beans (topped with cheese), a piece of steak, chilaquilles (ripped tortilla with red sauce and an egg mixed in it topped with cheese) and one enchilada. its a big plate and goes for about 15 bucks cant go wrong with tht you get alittle of everything. 3)menudo (tripe soup) cant go wrong if your  tripe lover this is for you GREAT for hangovers. theres for my three main dishes I get I have tasted the seafood plates too they are good. I mostly go on the weekends because that's when the birria and menudo are served only. there pozole is also on point and they have that everyday. hope this was helpfu", "author": "Rigoberto C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-03-27", "description": "I came here for the chillequelles and was a bit disapointed.  Sauce was bland and probably canned.", "author": "Dennis W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-23", "description": "Wife had the chilaquiles for brunch and she says they were pretty bland. The sauce wasn't noticeable and the egg was flavorless. Or get juice was super pulpy so beware if you're not into pulp. I found it delicious however.3.5 stars is more appropriate but I'll give it a 4 for the service.", "author": "Alex D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-06-27", "description": "I read the reviews once we walked in. So, I decided to order the pozole and a carne asada taco. What a great decision! With the pozole, you get to add your own lime, cilantro, fresh onions, chili and herbs. It was the best pozole I ever experienced! The taco was so worth the money. It was a huge portion, and it was delicious. They offer a side plate for free with a large helping of sides for your taco; too much for me, but useful if I was more hungry.\n\nFor $10, there were enough leftovers for me to take home, and feed the family. What a great deal for the price and the taste, and the customer service was uber fantastic! I loved my experience and meal. I can't wait to return!", "author": "Rosie M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-11", "description": "Eating here was the right thing at the right time. Great weather for an outdoor table. Had the tampiqueña with the chicken enchilada and a Negra Modelo. So. Much. Food.", "author": "Maximillian M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-24", "description": "Cabbed it here with my ladies after a long night of drinking.. and boy were we in for a surprise! The people sitting next to us payed our tab!\n\nFood: Chorizo and Eggs, beans and rice.. with homemade torillas . 5 stars!\n          Pozole- 10 stars\n          Quesadilla: 5 stars\n\nMicheladas: mmm just right! 4 stars.\n\nService: was a little slow taking our order but the food came out pretty quickly! Place was getting packed as time got closer to noon.  \n\nDefinitely would come back :)", "author": "Melissa G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-01-06", "description": "This review is for the shrimp mojo de ajo plate. \nThe shrimp was absolutely delicious however the rice and beans were luke warm. This is totally unacceptable. I didn't complain because maybe it was a fluke seeing all these reviews. \n\nI went back a second time, I specifically and POLITELY asked \"can you please make sure the rice and beans is hot cause last time they were lukewarm\"\n\nThe rice and beans came back lukewarm...as a customer do I really have to ask you to warm up the fucking food? I'm always a nice person especially to people who work in food and I was a nice person in the moment but my USD will never be spent here. \nPathetic.", "author": "Anonymous ?."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-03", "description": "I've been eating Mexican for a long time. Then I discovered this place and realized I'd been eating a cheap imitation all along. Silly, silly boy. This place is right out of a neighborhood in Old Mexico. No pretension or attitude. Just honest, hearty and authentic food. They've got you covered from breakfast to dinner. \n\nI had the chile verde burrito. The menu says this is a \"tender pork in green sauce.\" I don't think that captures the bliss contained inside the flour tortilla. \"Beyond tender pork with heavenly verde sauce and a touch of cream sauce drizzled on top for extra temptation by the devil himself\". That's how I would describe this wonder of creation.\n\nI will be returning frequently. The sopas look fantastic. They have tripe soup and lamb soup on weekends. It's nice to know where I will be eating for sometime to come.\n\nTo your health amigos!", "author": "Jahan T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-09-20", "description": "Quite surprised that this place has a 4-star. Came here because it was right next to my dance studio. Was extremely unimpressed by the unflattering plate of steak, rice and mashed beans. This place is also not air-conditioned and have quite a number of huge flies. Definitely won't be coming back again.", "author": "Vivien S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-26", "description": "The food was great, there was no long wait and people there were very friendly. I had one of the combinations and will probably not have to eat for three days.", "author": "Luisa H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-12-18", "description": "Let's just say if their customer service matched their food I would have given them 5 stars. It was a Sunday and I know they get pretty busy. Asking us to sit at a table that wasn't cleaned off and when she did clean it, she didn't ask what we wanted to drink and walked away. No drinks, no utensils and no menu. The table next to us ordered, and got their food and we still were not asked for drinks. So I had to get up and ask. All we were going to order were 2 menudo and a quesadilla. By that time other people were walking in getting their orders. We were still waiting to even get our drinks. The table that did order next to us finished their meal and we still did not get our food. It seemed that people who were coming in after us were getting their food and we were being ignored so we walked out. I'm pretty upset to see that it seems that maybe their friends and family who come in get special treatment while others are still waiting.", "author": "Kristi V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-07", "description": "If you want great mexican food, this is it. I mean real mexican food - when the place is packed with mexicans, you know its real and its excellent!\n\nI had the chilaquiles and it was incredible - the eggs were cooked perfect, the tortillas cut right. Very flavorful and plenty of it. I had a bite of the birria and it was fantastic - having that next time!\n\nThe best part is their salsa/sauce - great flavor and carries a little heat, LOVE it!!\n\nIf you don't like this place, you like crap mexican food.", "author": "Tom C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-12", "description": "I have been going to Gallardos for a few years now and always have a great meal there.  \n\nThe service is friendly and the food portions are huge!  I go to Gallardos almost every time I go to eat in the area.  \n\nThree is usually a wait on Saturdays around noon, so I am alway prepared for a bit of a wait.  But they move people through the restaurant pretty quickly, even if there are 10-15 people standing outside the door.  \n\nI'm not sure what their current policy regarding credit cards is -- at the old location on Folsom, it was cash only on weekends.  So, I am always prepared and bring cash.  \n\nYummy food, good service, good prices,.. you can't go wrong at Gallardos.", "author": "Suzie Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-18", "description": "This place was once on 14th and Folsom, but expanded here. Having just reopened, it won't be selling margaritas in the immediate future. But it does serve beer and wine.\n\nThe food is delicious. The plates are large. The salsa is the best I've ever had. And the spiciest, so be careful. The beans are not refried. The tortillas are crispy and the owners will come around personally to ask after you. Five stars!", "author": "Morgan I."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-22", "description": "Birria De Chivo - one of my favorite dishes to savor when I want to disappear with a book for a few hours. The relocation to 18th was worth the wait. Staff is even more cheerful & friendly in this sunny Mission location", "author": "Steven B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-01-14", "description": "I ventured out to the mission for some Mexican hangover helper before heading to SFO to catch my flight back home. The service was very nice and quick. The decor of this place is funny and somewhat creepy, I was the only non-mexican eating there... this is starting out very good. I also noticed everyone was eating Pozole, but I was not in the mood. I opted for some Enchaladas which were decent, but nothing to write home about.... Should have gotten the Pozole!\n\nNext time!", "author": "Jonah K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-03-18", "description": "Nothing great here. \n\nWent to lunch here today and when my plate showed up there was slightly melted squares of American cheese on top.\n\nI had high hopes after reading reviews but this definitely does not need a revisit. It did earn 2 stars for the friendly staff, spicy salsa and the tortillas. \n\nAnd the cheese enchilada was also stuffed with American cheese. Really odd for what appeared to be an authentic Mexican restaurant.", "author": "Kenny D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-26", "description": "I was in the mood for some menudo but couldn't decide where to go. Enter Gallardo's. Never heard of it before but the reviews looked promising. My husband had the menudo and I had the birria. Both of which are only served on weekends. As a Mexican, I am picky when it comes to Mexican food. Also, I always compare it to my mom's and grandma's cooking. Unfair, I know. But I digress. Both soups came with cilantro, onions and limes. As well as oregano and pepper flakes for the menudo. The tortillas were handmade and were delicious. I had the birria al horno, which is just the meat and broth separate. The first spoonful of the broth was like heaven. It was hot and spicy and so full of flavor. I made a taco with the meat, added the onions and cilantro and dipped it in the broth before each bite. Man, was it yummy! I also tried the menudo and it was quite flavorful. The tripe was soft and easy to chew. I was bummed that it didn't have hominy though. I tried the orange-carrot fresh squeezed juice and it was really good. Interesting combo but it worked. My husband had a Mexican bottle coke which was room temp, so that was a bummer. \n\nThe service was bad though. It took a while for our waiter to take our order and only saw him once after he dropped off the food. Had to go up to the counter and ask for a to-go container and the check. I suppose if we had been in a rush I would have been more bothered but we weren't so it didn't matter that much. The line was out the door from the minute we got there to the time we left, so they must be doing something right. \n\nI will add though that I asked for more broth to go and the waitress was very happy to do so. So that was a plus. I will definitely go back to try the pozole.", "author": "Norma T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-26", "description": "A MUST MUST MUST try. I have been a regular at this place for years now. Everything on the menu is delicious. \n-Menudo and Birria are amazing\n-Chilaquiles are some of the best ever\n-Rrefried beans\n-Gallardos Platter for appetizer (It's Huge!)\n-Fresh homemade tortillas\n-Fresh juices\n\nThese are just some of my favorite items from Gallardos. One of the best attributes for this place is the service! Down home family service from amazing people. I have never ever had any complaints about this place.", "author": "Ed S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-16", "description": "Was In bed till about 2 and decided I needed some menudo to cure my hang over. I always forget about GALLARDOS since they have moved but whenever I crave menudo this is the place to go! Their michiladas  are also BOMB\nNeed some good Mexican food on a Sunday morning or I guess any day of the week come here! The staff is sweet too and I like the feel of all the Mexican families having brunch after church on Sunday! Reminds me of LA ;)", "author": "Melissa R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-12-21", "description": "Fool me once shame on you.  Fool me twice shame on me.  \n\nEven in the new spot on 18th and years later, service sucks.  Nothing like getting sat outside for service and then being forgotten about.  The food isn't worth it.  12/21/13.", "author": "Jimmie L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-10-02", "description": "Pozole, Pozole, Pozole, Pazole & surprisingly a hamburger or humburguesa if you're into that sort of thing at a Mexican place.\n\nI always order the Pazole..... Clearly.... and it is very good! 3 stars because the owner needs to get their act together and hire some more servers. Or just get rid of the table service. The servers are very nice ladies and are as helpful and attentive as you can be...... \n\nWhen there's two of you and about 15 tables! It's not just a bum shift either. Multiple times I've visited I always have to go to the register to get the bill. I hate waiting for the bill, more than I hate getting my food before my drinks.\n\nOnly place I've ever just left my money on the table and walked out. Done it twice here after waiting 20mins.\n\nFood is great and so is the service when you're the only one in there.", "author": "Connor M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-06", "description": "Awesome food, fresh squeezed oj, lovely service. Everyone is always nice in here, food is great and prices aren't bad. It's hard to find a place near mission that is clean, yet here it is.\n\nThis time I had the chilaquiles, nice and crispy so you could tell they were just made. Sause wasn't spicy nor sweet :) our server was making my orange&carrot juice right before my eyes, which was so delicious. My bf had huevos rancheros, like the real thing tho. He usually eats slowly, but surprisingly he was done before me both of the times we been here. Service was right on point, coffee refills offered and not pushy on sales. Great brunch place.", "author": "Hector S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-28", "description": "Awesome food and great service...   The amount of food they give you is ridiculous, in a good way.  All their tortillas seemed homemade and the decor was really cool.\n\nI'll definitely be back.", "author": "William G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-27", "description": "Love this Mexican restaurant in the city\n\nOne word, Pozole! bomb.com I can't get enough of it, trust me I've tried.  Their menu is amazing they have everything you can possibly want and more. The owner and staff are amazing people who make you feel welcome and at home. \n\nYou should check it out you won't regret it.", "author": "Jennifer R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-23", "description": "The pozole is still amazing! The huevos rancheros are bomb.  My husband and mom rave about the menudo and my son loved the shrimp omelette and devoured the bacon cheeseburger. The micheladas are a MUST have! This place is overall amazing and now at the new location it made it even better! A modern twist with all the same fabulous familiar pictures covering the walls. It definitely attracts all types of cultures now too. Not just Latinos. ONLY reason why its still at a four  is b/c of the wait to get your bill at the end. It still only accepts cash too. Kind of inconvenient but the food is way well worth it. Keep it up Gallardo's. We will be back again!!!", "author": "Carmen C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-16", "description": "Fast and friendly service! You won't walk out hungry! My husband and I ordered burritos - chile verde and carne asada along with our six year old - a chicken taco. So good! We will be back when visiting the mission district.", "author": "Amylynn M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-14", "description": "Great Mexican food, long family run business, clean, friendly, as a gringo I love their Pasole and on the weekends their Menudo is worth the 20 mile ride from Redwood City, where there are plenty of Mexican restaurants. A little bit of the beaten path in a residential area a couple of blocks from Mission street but that works fine for me. I've been eating here since their days on Folsom and 14 street which was a beehive of activity and before they were forced to move. Worth checking them out.", "author": "Jerry M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-11-04", "description": "At long-last, Gallardos threw open its doors a few weeks ago. I was excited to stop in, not least because it stands where once was Chavas, a true powerhouse of soulful, family-style mexican food, and a restaurant to which the owner is connected.\n\nThe clientele is still bustling (long lines on the weekend), and the owner has done a nice job of cleaning up the appearance of the restaurant. \n\nSadly, neither I nor my lunch companions could find anything to recommend the actual dining experience:\n\nService, awkward. \nFood, bland. \nMeat, tough. \nIngredient quality, poor.\nPrices, astronomical. \n\nThis was not only disappointing, but a little surprising, given the high bar established by restaurants along the 18th Street corridor, and healthy competition for Mexican food even in the immediate vicinity. \n\nConsider these options:\n\nAt the same price point, there is Regalito Rosticeria a few blocks down 18th. Well-considered, authentic dishes with a modern touch and wonderful flavors, and warm efficient service.\n\nFor a quick, tasty meal, El Tepa has been doing a brisk trade for years on the same block as Gallardos.\n\nAnd for family-style, \"keeping-it-real\" food, there's San Jalisco and Los Yaquis a few blocks in either direction on S. Van Ness.\n\nI realize the restaurant is still working things out, and I will definitely give them a second chance in a few months, but so far the decisions I've witnessed look like a recipe for disaster (no pun intended). On the other hand, look at those lines...\n\nNote: The 140+ ratings you see are not for this location.", "author": "Jay B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-04", "description": "I had a menudo with handmade tortillas. It was delicious! The only reason why I didn't give it a 5 starts was because the server can be a bit more attentive.", "author": "Isela L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-27", "description": "Best pozole in town I'm super impressed with the food but not so much on there service but other than than it was worth coming here to eat", "author": "Anthony A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-28", "description": "THEY ARE OPEN FOR BUSINESS!!!  AS OF OCTOBER 20, 2013\n\nThis was one of my go-to places and their new location rocks.  A bit smaller, but cleaner and well decorated.  They brought along their old black and white posters of famous Mexican singers and actors, added a great bold, but tasteful color scheme, and didn't change a thing about the menu.  The staff all came over and Juan is his usual warm and friendly self.  I LOVE this place and highly recommend the Papas con Huevos (potatoes and eggs scramble).  Coffee is strong and good and their service is par excellence.", "author": "Frank B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-17", "description": "New location very nice, and now there are tables outside for a sunny day.\nHad chicken soup...meh, not the best, but a huge portion. Tacos dorados kinda soggy ( pre made shells;  not all fried together the way I like it)\nOverall, still a cheap, good meal, and the new venue is really nice compared with the old place. I'll be back, but might wait a month or so until it gets up to speed. Was super busy though on a Saturday afternoon. Everyone else was having Birria and looked really happy.\nAnd the fresh tortillas are still to die for....", "author": "El B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-30", "description": "Gallardo's Mexican Restaurant deserves a 5 star for their Micheladas! It was absolutely delicious! But because that is just a beverage and not the actual food I am giving them 4 stars. My burrito de carne asada was good but not quite memorable. It was a huge portion but I can't say that it was something I would keep getting. I did notice that they added a chile verde on top of it which contained pork. For those who care whether they are eating pork, it is risky for them to do that without warning you first. I try not to eat pork so it bothered me just a little bit but I grew up eating pork and I know good chile verde or chile rojo con puerco when I taste it. This was definitely good!", "author": "Judith G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-28", "description": "Let's list positives here-\n1) Cheap mexican food. \n2) plenty of meat free options. \n3) Everything I've tried is pretty tasty. \n\nI'm sold, it's right by my work so I'm sure they'll be seeing plenty of me in the future. Another awesome is that they have a breakfast menu in the AM.", "author": "Jourdain D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-25", "description": "I was there for a friend's birthday dinner. Excellent food (The beef soup was delicious), excellent service. This is an amazing, down-to-the earth restaurant!", "author": "Linda S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-17", "description": "The best menudo I've had in the Mission. Flavorful broth with lots of tripe and unctuous bits. The tortillas that come with it are substantial and fresh without being too dense.", "author": "Jeremy C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-11", "description": "This is my favorite neighborhood restaurant!!! Everything I've ordered has tasted great!  Breakfast there on Sunday is a must try, but get there early or you'll have to wait for a table.", "author": "Jeanine M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-26", "description": "This goes under the Cheap but Good category. For 10 bucks you can get a full-on meal with all the fixins. The fresh salsa is one of the tastiest around. No hot sauce needed here. These guys know how to season their food. The service is minimal but friendly. It's got a cozy neighborhood feel and it's tucked away from the madness on Mission.", "author": "William B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-23", "description": "The best authentic Mexican restaurant in San Francisco, and that is quite the compliment, considering that there is probably 1,000 of them in the city.  My friends from Guadalajara say that this is the real thing.  Could serve the best breakfast in the city too.\n\nBeautiful new remodeled location.  Super clean and airy compared to the old dark location.  Old place was dingy, but this place is sparkling new.\n\nService is great.  If some fool complains that it is slow, it is because the place is so busy.  Today the place was so packed you had to wait for a seat, but I still got my food in less than 7 or 8 minutes.  Juan Gallardo gets to know his customers, super nice guy.  It is so obvious that he doesn't just see the place as a money making business, but he takes real pride in the product...the best Mexican food in San Francisco.  If there is a single thing wrong about your meal, he wants to hear about it.\n\nService quick, food served quick, huge menu, steaks, seafood, all the standard Mexican fare (but better), and Mexican stews and soups like Birria, Pozole, Menudo. If you like lamb, this birria is thick with it and delicious.\n\n\nBest omelettes in San Francisco too.  Sometimes I think they put four eggs in them.   The average breakfast there is so huge is is good for two (as are most of their dishes).  Great big glasses of fresh squeezed orange and carrot juice...delicious.  Can't beat the home made tortillas.\n\nGo.  Problem is, if you go there too often, you are gonna get fat.", "author": "Joe S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-15", "description": "Delicious enchiladas and burritos! Very fast and friendly service. Happy to have this place as my go to Mexican spot place for lunch.", "author": "Chauanh D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-05", "description": "Wasnt feeling well on my birthday but my parents still insisted on taking me out even just for lunch. Gallardos was just around the corner from my mom's office and she swears by it and insisted on going there (even though all I wanted was some congee, so asian, I know). \n\nSo we went in, it was around 1 or 2 pm, so not a lot of people. The place is nice and clean, although I'm sure there are no street parking available during peak hours. Anyway once we sat down, we got complimentary tortilla chips together with some super hot salsa. It was good salsa but it's too hot for my taste, I wish they have a milder version. It wasnt so busy but it was very hard to get the attention of the waiters. I literally had to flag her down so that she can get our order. My mom had the pozole, I had the seafood enchiladas, my sister had the chicken enchilada, and my dad had the steak plate something (I forgot). Orders came in really fast (faster than our waitress getting our orders, heh!). The plates are big and everything was delicious. Since the food was so good, I decided to order dessert (it was my birthday after all). I ordered the flan. It was okay, nothing spectacular. \n\nSo all in all, my review for this joint is:\n\nFood = Great\nPrice = Even better!!\nService = Eh.. not so much", "author": "Trisha M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-05", "description": "Lunch today. A decent portion of pork pozole for around $8 with all the condiments and homemade corn tortillas. Carne asada con papas is $12 and is filling. The fried plantains are served with crema and beans; I prefer rice. Restaurant is clean and has a great breeze that flows in from the front door. The food served here might be from the states of Jalisco or Michoacán. Many typical Mexican dishes. Server asked if we needed anything; unfortunately we had already finished. Fresh OJ is sweet. Presentation and prep could make a difference as could taste which is on bland side.", "author": "Mo O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-19", "description": "Great casual atmosphere and food at very reasonable prices. Feels like an old-fashioned family run place and made a big effort for my wife's birthday. Thanks!", "author": "David J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-24", "description": "The best of the best, in a hood with outstanding Mexican food. We shared a bacon omelette with fresh squeezed orange juice.", "author": "Scott B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-08-12", "description": "The posole was excellent but the service was awful.  They said I can seat myself, I get settled in, the staff is just chatting to each other, I believe it's a family.  At some point they catch my eye and realize they haven't even given me a menu and bring one over. They take my order, food comes quickly, she sets it down and asks if I want tortillas, I say yes.  She hollers in spanish to someone behind the wall to the kitchen. She does not follow up, or even check that the person heard her, tortillas never come and they never notice or check on me that they didn't.  When I'm done eating I try to get someone to notice me, finally a man walks by and I catch his attention. He asks if everything is ok? I say the food is great, but I would like a togo box and my check. He yells back to the kitchen something in spanish, and then walks out the door.  No box or check comes. I finally walk to the kitchen and ask for the check and a box which they give me. Thankfully I had the right amount of cash to pay plus some gratuity (I'm just not the type to not tip, can't do it) because no one ever came to take the check from me. I finally just left the cash on the table and left.", "author": "Jessica B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-09-12", "description": "Good food but could have used more salt or spices.\nService is slow, had to get up to ask for things.\nMost importantly, the music is loud and they invite a random guitarist to come inside and play loud guitar table to table, who then extends a bag to ask for money. So uncomfortable and unwanted. Not what I'd expect from a sit-down restaurant.", "author": "M. M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-10-11", "description": "Lukewarm, undercooked, dry is what I got.  I know they make awesome food but I guess it's what you order and when.  I hit it on a bad day on top of ordering the \"wrong\" food.  Sad that this happened.", "author": "Rona M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-23", "description": "Sunday morning and had a blast the night before...my head is screaming for a comfort cure..I've heard many good things about this place so i think its  good time to try an authentic cure..Caldo! A few of us get together, ready to taste cure.\nOur table had had Chiliquiles, Sopa de Res, and so on but it was soooo goood! Even the fresh orange juice was good...(I've had bad fresh orange juice, believe it or not)..\nThe food was very authentic and very satisfying portions...it was all fresh and ...damn im going back!! See ya", "author": "shirley c."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-06", "description": "Wow! Had no idea this place existed and I pass by all the time! Friend and I scarfed down the albondigas, pozole, chilaquiles and the Carne asada tacos. The broths are so rich with flavor, I can't wait for another rainy day to get soup from here again. The fixings for the soup just gives them the extra oomph! Sad thing is that it's moving farther away from me to 18th street.\n\nMove over pho, there's another bad a$$ sopa in town.", "author": "Yoko H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-31", "description": "A true taste of the Mission.\n\nI live out of town, but I am now starting to make a stop here part of my semi-annual visit just to get the Menudo.\n\nMy kids had egg burritos and I cannot stop eating the Menudo for Sunday breakfast. \n\nVery nice staff and I feel like I am in a different world here with the crowd and atmosphere. \n\nYou want authentic Mexico, come here.", "author": "George A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-26", "description": "Very yummy place! Best Mexican food I've eaten in San Fran so far. I have loved everything I've tried from here so far. They even specially made a California burrito for my fiancé! Good food and service. Only thing that is not that cool, service gets a little scarce when it's busy. And the minimum for card is $7, which kinda sucks cuz sometimes I just want to buy a drink :(", "author": "Aiko R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-14", "description": "I'd never eaten pozole. Because of the reviews here and the fact I like hominy, I decided to give it a try. Delicious. The broth flavorful and chunks of tender pork. And the sides: tortillas, crema, huge bowl of cilantro and chopped onion, radishes, limes, oregano, chili pepper. The husband had the enchilada platter, and he loved it. Loved the \"Mexican coca-cola.\" Will definitely return.", "author": "Dennis D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-12-25", "description": "This is the worst \"mexican\" food I have ever had! I passed by one day and saw the line out the door! It was not because the food is good, it's because the service sucks! Who has one waitress serving the entire restroom at lunch time on a weekday?", "author": "Cynthia C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-12", "description": "The food and staff here are amazing. Everything on the menu is truly delicious. Try the #5! OMGsh!", "author": "Mary A. J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-16", "description": "Their birria (spicy lamb stew - served weekends only) was utterly delicious! You can enjoy it as soup with hot tortillas on the side or served with beans and rice. Bowls of chilies, onions, chopped cilantro and fresh dried oregano add dimensions. The kids (picky eaters all) polished off large, yummy burritos. Also of note: the fresh orange juice - most tasty I've ever had. And the flan - dense, rich and sinfully good home recipe!\n\nThis is a family place. The grandmother came to our table to be sure we were happy with our meals (and to meet our children). The children, grandchildren, nieces and nephews all pitch in. It is a joyful place. The walls are decorated with large b/w posters of Mexican movie and TV stars. \n\nCan't wait to go back!", "author": "Cynthia G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-18", "description": "The pozole soup was amazing... So much flavor and tender, slow cooked to perfection. Small size was more than enough for two meals!! The carne asada taco was also gigantic and delicious...for only $3.75!! The chips were great, not too oily, perfectly thin and crispy, with of course, the best, spiciest salsa!!!", "author": "minnie l."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-20", "description": "Hands down one of the top 3 best Mexican restaurants I've been to. Everything looked so delicious on the tables around me it was so difficult to decide. I ordered the pozole which they ended up running out of by the time we left at about 1 pm which goes to show you how popular it is! My husband could tell when we were eating that the owners were from the same town as him in Guadalajara, Mexico.  The food was identical to that which he grew up eating. Everything was wonderfully delicious. The pozole was flavorful and had accoutrements galore- fresh made tostadas, shredded cabbage, onions, cilantro, fresh juicy lime halves, chile flakes, and a large spoonful of crema on the side, my husband says you're suppose to spread that on the tostada. All of the other soups besides the pozole came with a little side plate of rice and guac, the rice was luscious, some of the best ever. My husband got chilaquiles and everything from the homemade tortillas to the silky yummy beans were fantastic. We couldn't have asked for a better meal, my husband also got a mexican hot chocolate which was soo perfectly made. What was the icing on the cake though was the five star service. These people are not only friendly, fast and efficient but they are genuine. They embody everything wonderful you could ever look for in a dining experience. We can't wait to go back, it's worth having to circle around for parking for 20 mins!", "author": "Emma H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-30", "description": "First thing first, their pozole is AMAZING! I'm part Mexican and their pozole is just like the one my mom makes! It's absolutely delicious and full of flavor! Their pozole can certainly cure a night of debauchery and too much whiskey. The rest of the food is also amazing, especially their chilaquiles con huevos. They just opened this location, so their definitely working out the kinks but I have a great feeling that they'll get it all together very soon. Another really cool thing is that the owner is there all the time. He's super friendly and you can tell he wants everyone to have an enjoyable experience. I have a lot of respect for restaurant/bar owners that are not afraid to get their hands dirty! \n\nSo, all in all, a great restaurant with wonderful food!", "author": "Michi R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-09-28", "description": "This review is only for the soups, specifically the Pozole (rich broth with pork shoulder), Menudo (tripe in clear broth with red chili base), and Birria (spicy Mexican meat stew with goat meat). \n\nI like all of Gallardos' soups but Pozole is my favorite. The rich broth seems infused with pork goodness.  Each of the soups are slight variations on each other and all delicious! Embarassingly huge portions of steaming broth and tender meat, served with a several bowls of condiments to customize your soup to your heart's content - lime, cilantro, diced white onions, red pepper flakes, and a special mix of herbs. With a side of warm, doughy tortillas...  you can't go wrong!\n\nThe perfect hangover remedy and/or satisfying breakfast/brunch on a gloomy SF morning!\n\nTips: Cash only and dress warm! For some reason, their restaurant always feels drafty to me.", "author": "Monelle A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-26", "description": "Flan!!!\n\nVery rich, creamy flan. \nDelicious. \nForget about calories. just eat, and love it.\n\nAs far as I know, they take cash only Saturday and Sunday.\nMake sure to stop by ATM before head to this place.  \n\nI haven't visited a new location yet, hope they haven't raised a price.", "author": "Vicki S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-12", "description": "BEST.  POZOLE.  EVER.\n\nAnd I've had lots.  Just look at me!\n\nBeing from LA, I've had some damn good, legit Mexican food...but I gotta say, I think their pozole is one of the best I've ever had.  When you throw in portion size, quality and price, hands down - THE BEST!!!", "author": "Alex T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-07", "description": "I tried the Pozole and the mole. They were both delicious. The food reminded me of my mother's home cooking. The tortillas were a plus. \n\nService here is also great. They are friendly and attentive to their customers. Just remember that this place is cash only.", "author": "Yurida R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-14", "description": "Fast, friendly service; excellent food; and almost unbelievable prices. I'm glad it's only a couple blocks away. Five us went over about forty minutes before closing time, and were served quickly and were able to linger over the food- no pressure to get out at closing time.\nIt's hard to beat.", "author": "Carl C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-15", "description": "This place is the perfect sit-down Mexican food restaurant. Not the best food ever, but cheap and ample and the people are really nice.", "author": "Melville M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-21", "description": "As I biked down 14th Street on a recent Sunday morning, I chuckled to myself at the mass of bodies lingering, hungrily, outside MBC.\n\nWe opted away from fancy brunch cocktails and $12 egg dishes and all-in for a hearty, no-frills-just-the-good-stuff breakfast. \n\nWeekends are cash only, but who cares when you can rock massive plates of Huevos con Nopales (scramble, also available as omelette) and Huevos Rancheros, each for $6.75. Add a buck and a half for coffee.\n\nFull breakfast many with too many options. Most served with tortillas, some with beans (& cheese), and \"garnished\" with tender, moist chunks of pork on the side. Who needs a parsley sprig when you can have pork?!?\n\nAdd a fresh glass of carrot or orange juice or even a beer.\n\nService is prompt, despite the place being packed to the brim.\n\nI was reminded what makes brunch so amazing - and it's nothing fancy. Be it the brunch that undoubtedly could cure any hangover or the catching up with old friends, it surely satisfied.", "author": "Alissa A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-10", "description": "Great food, great atmosphere . The food service was fast and good. Good prices. Great Mexican food!", "author": "Malinda R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-03-03", "description": "After walking by and spying the black and white photographs of Mexican cinema stars on the walls I thought I'd give this place a shot for brunch. The restaurant exudes a friendly and unpretentious ambiance, as most Mexican restaurants do, displaying an open prep area on the right hand side. Thought it strange that they sat the two of us at a table capable of sitting eight, all alone despite the line out the door--in fact, felt uncomfortable enough that when a party of five asked to move to a larger table near them I asked if we could relocate to their vacated table. This was an early indicator that the management suffers a few organizational obstacles in the running of their restaurant. The wait staff looked run off their feet, bringing me a Diet Coke instead of the coffee I ordered (huh?), and then taking a good while to remember the coffee. \n\nTHAT SAID: The food is very tasty. Fluffy tortillas tasted fresh. The flautas I ordered were crispy and not at all greasy, topped with a dollop or two of sour cream and queso and garnished with crispy lettuce. My girlfriend's dish was a standout, the caldo de pollo (chicken soup). Came with two meaty drumsticks, large chunks of carrot, zucchini, and a side dish of cilantro, onion and peppers to add in. Coffee was so-so. \n\nThat the restaurant is cash only (a fact I hadn't comprehended), was a small unpleasant surprise. All in all, a very decent meal--but a place I am not all that eager to return to.", "author": "Brian G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-02-19", "description": "I just got into town and was extremely hungry when I walked into this fine establishment. I ordered the daily special and got it quick, but it was extremely bad, even after not eating for the whole day. They also don't accept credit cards and could not provide me with a receipt, although I directly asked for it (reimbursement, on a business trip). Do not repeat my mistake and try to eat there.", "author": "Anton T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-11-01", "description": "Most of the soups are good, but I tried the shrimp soup and it was disgusting.  The worst part was that the shrimps where not cleaned at all.  I had to devein the shrimps myself.  They where crunchy due to the fullness of their intestinal tract (disgusting) which is why I tasted a lot of dirt in my mouth. When I told the waitress she said that most places don't clean them.    I was very disappointed.", "author": "Pablo H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-10", "description": "I went to Best Buy with my sister and her kids and, as usual, they were hungry. Geez, those kids want to eat every day! So I yelped into my iphone app and found this Gallardos place. We walked over and were greeted by a very friendly lady. Since we were in \"The Mission\" I figured I would ask if this place was cash only. I thought it may not be since it is actually a sit-down kind of restaurant. The lady told me that Monday - Fridays they take credit and debit cards but on the weekends they usually try to keep it cash only. They were willing to make an exception for us but I went across the street to the grocery store to get some cash just in case. \n\nI really liked the feel of this restaurant. There are large framed photographs of Mexican film stars from the black and white era. The photos reminded me of when I was a kid and my family would watch those old black and white movies on Sundays when they would come on the Spanish tv channels. There is also a jukebox so you can find your favorite musica.\n\nThe servers gave us a few minutes and then came by to take out orders. In the meantime they brought us complementary guacamoWe were a little sad to find out that they didn't have \"aguas frescas\". They did have a nice selection of Jarritos, so the kids were happy. I ordered a michelada. They have a good selection of Mexican type beers. I asked for Negra Modelo in mine. Two of the kids ordered cheeseburgers, my sister and oldest nephew had the super carne asada burrito and I had the vegetarian burrito. In case you don't know (I didn't know until I was here and asked), making the burrito super means that you are adding guacamole and sour cream. \n\nThe burgers came with French fries just as they should at any respectable mexican restaurant. The kids loved it. They're still easy to please.\n\nThe burritos were HUGE. The beans had a good flavor, but it threw me off that they put lettuce all up in my tortilla. is that normal?my sister and nephew liked their carne asada burritos, those carnivores that they are. \n\nSo everything was good and the prices are really low considering it is a sit-down place. My burrito was about $5 and the carne asada burritos were like $6.50. \n\nBefore we left, my sister ordered fresh squeezed orange juice to go. so yeah, they don't have aguas frescas but they can make fresh squeezed orange juice. \n\ni think next time i would like to try the pozole or something else, although I probably won't be back unless I need to go to best buy and find myself in this part of town.", "author": "Daisy S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-03-20", "description": "first off, i have no idea how this place got more than a star.  place is soo cramped and soo busy.  when the place is busy, it usually means its good. NOT!!! we ordered menudo and shrimp cocktail and the food was highly disappointing!!!!  the service:  i usually tip, and i base it on the service I received.  took them almost 30 mins to get my food after everyone else got theirs.  bf menudo didnt come w tortilla and we had to ask for it.  our waitress was obviously too busy to serve us.  I don't know the hype, but i know for sure ill never come back.", "author": "Vernz G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-02-06", "description": "Yum Yum Yum Pozole, Menudo, Caldo, Chorizo, Huevoes Rancheros....\n\nGiven how many people we go with and how many times we've been I've sampled more than my fair share of dishes here. They're all super delicious and homemade tasting. My mexican husband says that the menudo is closest thing he's found to the menudo his grandmother used to make. \n\nMy favorite is the hot chocolate. Yummmm Mexican hot chocolate I don't have to make at home....\n\nEven their oatmeal is ridiculously good!\n\nAnd while their prices are all reasonable, beware, it's cash only on the weekends.", "author": "Sydney T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-05", "description": "Me and my friends were walking around the mission because we found out that the place we originally were planning to eat (Ken Ken Ramen) only served ramen after 6 pm! We stumbled upon Gallardos and decided to eat here.I had the super steak burrito and it was one of the best burritos I've ever had! It was really filling (I could barely finish it) and it was only $7.50. They also gave us complimentary chips and salsa and had live music!", "author": "Trisha L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-02", "description": "One of my favorite lunch spots! Great service and awesome food! Family run and owned. I have also seen them give food to people in need - pretty cool folks!", "author": "Alexis R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-21", "description": "Had Birria on a Saturday to cure my hangover and it was great. They give you a LOT of lamb. The broth was delicious with freshly chopped onions and cilantro. Their tortillas are delicious! I'd recommend getting their soup -- other dishes were good, but not amazing. We also had their flan which tasted more like thick cheesecake (not complaining). Service was friendly and we got lucky and saw a band play, too. Would go back when I have my next hangover, which inevitably won't be too long from now.", "author": "Michelle K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-27", "description": "Great flavor and portions are more than adequate! Family run and delicious! Wide menu options for all!", "author": "Javier C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-24", "description": "service was 5star. super friendly. oj was dark orange fresh squeezed amazingness. tortillas made fresh, so effing good. salsa could have been better but not bad, they have hot and mild options. great place for authentic brunch. good seating nice vibe if/when they play music. coffee is not so good but bottomless. cash only.", "author": "K R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-05", "description": "Food is amazing I love every single thing I have tried here. So welcoming when I walk in every time and great food at reasonable prices.", "author": "Melissa R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-10", "description": "Great place to go with my family. Definitely one of our favorite restaurants ! The food is always great and the customer service is excellent , and the food is always fresh and delicious . Seating is comfortable for big groups. We always come back, Highly recommended", "author": "Vilma R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-19", "description": "My brother and i had $21 between the both of us, and this was cash only.\n\nWe left having eaten a bit too much, and still a few dollars in our pocket. I'm ready to go back to try other things on the menu.", "author": "Ameer N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-19", "description": "I love this place. The food is awesome and at a reasonable price. This is truly a family owned business. Super Clean and friendly. I read a previous comment how ever I have paid with my card many times at Gallardos. I do think there is a minimum amount. If you are looking for great taste with little money try there tostadas.", "author": "Carolyne R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-25", "description": "Very good food, but the best service,  simple and really authentic,  the burrito was literally the best I ever had.", "author": "Donny M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-20", "description": "I say this every time I come:  it's not just the best Mexican in San Francisco; it's some of the best food in the city. Period. Make sure you get some tortillas.", "author": "Lucas M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-11", "description": "I love this place.  It's definitely my favorite restaurant of this type (basic Mexican food) in the Bay Area.  I might be tempted to give it five stars but, as a frequent visitor to Mexico, I know that food of this type can be even more impressive.  Unfortunately, I don't have a superpower whereby I can just transport myself to a beach side restaurant in Puerto Vallarta for lunch, though, so when I'm in the mood for some good Mexican food I'll head here when I can.\n\nIt's also good that their portions are generous and the prices are reasonable.\n\nThe staff is also extremely nice, even when they are super busy.  I'm not even THAT much of a regular now that their space is several blocks farther away from where I live and they still treat me like family when I dine here.", "author": "Jeff S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-24", "description": "Totally good and not too crowded for a Saturday brunch, at least on the day I went. I had the menudo which had great flavor and was the 'right size' for me. (Not gigantic, not small by any stretch.)  My friend had the ....errr...I think it was the Machaca. (Shredded beef w/scrambled eggs) which was REALLY good. The beef tasted better and was more tender than other places and the onions were really well grilled.  Bonus: This is not a 'taqueria', it's a sit down restaurant (though not fancy) with table service and high ceilings. Good mix of 'authentic' cuisine and 'clean' if you're introducing parents or out of towners to SF's fine Mexican food.", "author": "David P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-04-15", "description": "Friendly folks running this place, but with so much great Mexican food in the city, they need to up their game with their food quality.  My wife got the seafood enchiladas, and she was disappointed with the American cheese used on it.  I had a veggie burrito that was pretty dry and unspectacular.  They could get away with this quality if they were in a small town somewhere, but not in SF.", "author": "Troy S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-21", "description": "Great food.  Service is solid.  Crispy tacos were delicious.  Shredded chicken and pork.  Prices were reasonable.  Ambiance was great.", "author": "Zach H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-04-15", "description": "Can I just give this place another 5 stars because i've gone back 5 times in 2 weeks for their pozole??!@?!!!!!\n\nthanks", "author": "Natalie L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-30", "description": "Just had the most pleasurable morning this past Saturday @ Gallardos. Friendly service and an ample plateful of shredded, crispy-edged birria with a tomato-chile home cooked broth for DIPPIN. The kind of food your grandma cooked. Great stuff.", "author": "Anthony R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-12-12", "description": "Homestyle comfort food--nothing fancy, and no really strong flavors. Like a much better version of San Jalisco. I tried chile relleno, pork tacos, and milanesa. It was all good, but the competition in this neighborhood is fierce, so it's hard to imagine coming here when better Mexican abounds. Also, service was pretty minimal.", "author": "Mike B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-18", "description": "Gallardos is a really special place. The huevos rancheros totally blew me away. I had thought I knew what a good plate of huevos rancheros was before coming here, but I didn't. So good.", "author": "Robert S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-17", "description": "Best service I have received at a restaurant. Huge portions and amazing food. I really liked their menudo and chilaquiles. Recommend this place to people. It's always packed each time I come here", "author": "Nick G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-01-31", "description": "this place has it's highs and lows.  more recently more lows then highs.  \nI think it was long hair in my partner's soup which can be a real turn off.", "author": "Princess P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-03-08", "description": "Our visit went from bad to worse. Although, it's crowded due to popularity, this restaurant hasn't figured out how to move customers and service along. We waited at least 30 minutes to be served, then only to find out they had completely forgotten my father's plate. When it was brought out, it was the wrong meal, which we returned. It finally came, so by that time we took it to go. Then, you'd think the wait staff would be courteous for the error - wrong. They got rude. The meal wasn't even comp'd - I am always glad to pay and I do consider myself an above average tipper, never looking for a hand-out, but this was the last straw. I am never going there again and I will not recommend Gallardo's to anyone. There are far better Mexican restaurants in SF to be had.", "author": "Lilian P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-17", "description": "We went to Glass All down the street to drop off the car (after the window was smashed earlier that morning in the Mission Dolores) and then tried out Gallardos for breakfast.  We were the only people in the place at the time, but I think it's because it was a weekday.  Also, I noticed most reviews are about there lunch / dinner foods.  Well, this one is about yummy breakfast.  This place is solid.  The food was tasty, the service was friendly and very attentive, the portions were big, and the prices were great.  I think most breakfast dishes are served with beans and rice.  My husband's came with tortillas too.  The coolest part was that when I opened my leftovers the next day, I realized that they had packed an extra scoop of the beans.  I guess because I had done such a job at devouring them.  This was too cool!  Thanks : )", "author": "Alexis B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-25", "description": "The food is great the michelada 's are good the only bad thing is finding parking but other than that it's a good place to stop by.", "author": "Miguel A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-14", "description": "Authentic Mexican and delicious at an affordable price. Had the Shrimp cocktail which was delicious. Just the right amount of spice with big juicy shrimp. My friend had a burrito such was the largest I have ever seen. The tamarindo was home made and a perfect blend of sour and sweet. Even the chips and salsa were fresh and tasty. Been wanting to try this place for a while even when it was at the other location. Glad I finally did . Definitely on my list of good authentic Mexican food", "author": "Matt A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-23", "description": "Really delicious food at great prices with big portions. Very friendly staff and a nice atmosphere. Couldn't have better things to say about this place.", "author": "Aaron A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-15", "description": "I got four items here: nopalitos con huevos, pozole, carne asada, and the cheeseburger + fries. Yeah, that's a lot for one person, but I made it last for five meals. And all of this food cost about $36 with tax. Seriously, an incredible value. \n\nParking in that area isn't always easy but don't let that stop you. The food and the service are worth a visit, to eat in or to go. The server who helped me was really nice and she was quite efficient, covering half a dozen tables, the phone, and the cash register. Many more tables were open at 11am on a Tuesday but when they get busy, having that much room is probably very helpful for a lot of hungry people.\n\nAlthough some of the other items have gotten more hype, the nopalitos were the best of the group. The breakfast dish of eggs, prickly pear cactus, and peppers really hit the spot for me, and contained a more robust and tangy flavor than I anticipated. If this is what a weekday breakfast item tastes like then who knows how good the weekend specials would be.\n\nThe pozole was as excellent as described. Huge portions - the larger size is a quart - with huge chunks of tender pork. \n\nThe carne asada was higher quality than I'd expected, in that two small steaks were served whole with 7/8th cuts in them. Definitely tender enough to break apart easily and eat with the veggies provided with a tortilla.\n\nThe hamburguesa con queso was ground and hand formed with plenty of cheese. It was a fair to good burger but the value is very high. Given the number of cheeseburgers I've eaten in SF, this truly was an excellent value. I recall a price of $4 but that seems low. Even at $6 it would be a great deal, because an order of fries is included.", "author": "Mike H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-12-18", "description": "I'm just going to add to the chorus of voices singing this restaurant's praises. Since we moved to SF from Colorado, we haven't had much luck finding great Mexican food ... until we came upon Gallardos after shopping at nearby Rainbow Co-op.\n\nHighlights of our visit included my posole (huge, wonderful and cheap), my daughter's chicken quesadilla (best ever, she says) and my wife's chile relleno. The service was fantastic and the bill was so low that I checked to make sure they didn't forget to add one of our meals.", "author": "Todd H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-31", "description": "This is not a fancy Mexican restaurant. Instead, this is the kind of place where you go to feel like family. Relaxed atmosphere, great food, and excellent (friendly) service makes this a great place to go if you want tasty food without any pretentious bells and whistles. My girlfriend and I loved the guac in particular!", "author": "Jack J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-20", "description": "Gallardos is hands-down my favorite Mexican place in the city. It's off the beaten path, and the restaurant is generally populated with local Mexicans rather than the Valencia yuppies, which is always a good sign in my opinion. It's humble and unassuming, and the food is absolutely delicious. The salsa they serve before the meal is actually spicy and always tastes freshly-made. I have always ordered the enchiladas, which are some of the best I've had in California, but I have friends who have had the taco and quesadilla plates, and they were equally satisfied. The portions are huge and the entrees are cheap. Also, I recommend the guacamole to start - delicious! The food comes out very quickly, and the waitstaff aren't incredibly attentive but very friendly. This is a great place for people who want delicious, cheap Mexican food and want to support a local, family-owned business.", "author": "Jordan M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-17", "description": "3.75 stars.  Although I really wanted some breakfast tacos, a quick scan of the Gallardos menu told me that napalitos con huevos (cactus with eggs) would satisfy my appetite.  The cactus here is marinated in vinegar and has a supple texture without being too soft (like one finds at most places that serve cactus).  Tomatoes used here have a slightly sour taste that complements the vinegar from the cactus.  Served with a generous portion of eggs, sauteed onions, a satisfying spicy salsa, and homemade tortillas, this meal makes for a hearty quick breakfast.  Be sure not to miss the freshly squeezed orange juice; you know its fresh because there is a huge pile of oranges behind the glass wall and you can watch the staff make your juice.  Add something quirky to the mostly Mexican jukebox and you are in for a morning treat.  \n\n(I haven't tried either the pozole or birria here, but apparently, those are more than acceptable as well according to other Yelp reviews)", "author": "Yelper N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-10", "description": "The ladies that work here are so sweet. I didn't know it was cash only and they told\nme to just pay next time. Luckily for me the food was inexpensive and the $10 bill I found in my purse covered it. \n\nThey have generous portions and the food is flavorful and fresh. I came for the albondigas soup. It was good but not as authentic as I thought it would be. It came with a lot of fresh onion, cilantro, and a very juicy lime, however the broth was not a clear broth. It was chunky and seemed like the potatoes had been cooked since the beginning which made them fall apart. The meatballs were delicious and hearty and super flavorful. Overall nice details to the food and good ingredients.", "author": "Shirley S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-22", "description": "This place is really tasty, I had veggie nachos with rice and beans and I loved the rice and beans, and my boyfriend had an egg and shrimp burrito.  I know that sounds strange, but it is really tasty.  He liked it particularly because they took the butts of the shrimp and he hates it when they leave them on.  \n\nMy only complaint is that I found a hair fried into my chip and my boyfriend found a hair cooked into his burrito.  But the food was still delicious and so cheap it didn't even seem worth complaining.", "author": "Jasmine F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-20", "description": "Saw this place while walking past, looked inside, it seemed inviting, clean, friendly, attractively decorated, friendly staff. An excellent range of Mexican entrees around $10 on the menu. The food was excellent, the service efficient, I'd certainly go back. Now I've seen the other yelp reviews and agree entirely with almost all.", "author": "Michael W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-31", "description": "Gallardos offers tasty food and service with a smile.\n\nThis was my first meal and it was breakfast: chorizo and cheese omelette with rice, beans and warm tortillas on the side.\n\nI will return and encourage any person who shares my love for Mexican food to add Gallardos to your list!\n\nWell done!", "author": "Jay D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-24", "description": "Gallardos is OPEN in its new location!!!!!!!\nBeautiful restaurant. Delicious authentic food .", "author": "Connie S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-02", "description": "I popped in this morning.  It was my first time coming here.  I really just wanted something in my belly.  I did not expect to get a big, fat, delicious breakfast burrito.  I had hoped for something just decent.  I walked away with a overflowing tortilla of deliciousness.  I am Terd Furgeson and I recommend Gallardos.", "author": "Terd F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-28", "description": "Wow this place is legit! From cabeza hasta lengua! Came in on a busy night and was promptly tended to. Staff is on point and precise. Ordered the carnitas and they were delicious! The vanpiro drink was also very tasty. The only knock I give them is the chips were clearly out of a bag.", "author": "Beddaden B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-06-08", "description": "Food was ok nothing to write home about the waiter got upset cause we asked for chips and cause he got my order wrong don't think I'll be back and make sure you bring cash the don't accept credit cards.", "author": "Michael M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-12", "description": "I totally like the enchiladas that you can get from here. Beef and extra sour cream and avocado usually make it even better.", "author": "Krystal S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-07", "description": "I love this place. It's super close to my apartment. Prices are great. Everyone is always super nice. And the food is delicious and always fresh. I confess, I need to branch out with the menu. I've only had the tacos, enchiladas, stuffed relleno, rice and beans, etc. After reading other reviews, I realize that I need to try some new things the next time I go. Their freshly made tortillas are absolutely perfect, too. Between them and Poc Chuc, I really have no reason to eat anywhere else (but I will, because I live in food heaven).", "author": "Rikki J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-06-21", "description": "I have only been to Gallardo's once but have never forgotten it! \n\nI ordered the scrambled egg and chorizo torta and was not disappointed.  The portion was huge and the quality excellent! This was a classic torta that I remember my mom making for me in San Diego (where I'm from--a city full of authentic Mexican restaurants). Gallardo's torta could've used a bit less sauce but I'm sure they could've adjusted it for me, had I remembered to ask. In any case, it was delicious. I had it with the nopalitos (tender cactus).  \n\nMy husband eats here often because his office is nearby.  I would always hear him comment about the great food, until finally he took me on a weekend.  I am sad Gallardo's is out of the way for me on a regular weekday.  I definately need to go back because I want to try their pozole.........and then their birria........then the burritos, chile relleno, etc., etc.!\n\nIf the delicious, authentic, food isn't enough, the decor will transport you to a different place and time.  You will be surrounded by the nostalgia of the Epoca de Oro del Cine Mexicano, which translates to the Golden Age of Mexican Cinema. If you know a bit about this subject then the names of Maria Felix, Jorge Negrete, and Blanca-Estella Pavon will ring a bell.  Make a juke box selection to complete the feel.\n\nSorry to give 5 stars based on one visit. I will definately try them again and update my review.  For now, they can do no wrong.", "author": "Angie A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-05-20", "description": "2 words: Crispy. Tacos. \n3 more words: Best. Mexican. Ever.\n2 final words: Huevos Rancheros. \n\nLove love love this place. It is my absolute go-to in the Mission. \n\nIf you are searching for a great Mexican meal- look no further! Period.", "author": "Kate D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-04", "description": "Get the pozole (rojo) with all the fixins. Every garnish is accounted for. Trust me.", "author": "Derrick V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-07", "description": "I loved this place. It smelled like my mother-in-law's cooking and tasted almost as good! The service was great and you couldn't beat those prices. I will definitely come back here when I am in the city. \n\nMy only gripe was parking, GOOD LUCK! Oh and make sure to look out for it, we passed it the first time.", "author": "Threasa B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-15", "description": "I have come here a few times now for breakfast and I am really starting to like it. Very friendly staff. Everyone greats you everyone says goodbye. I mean they apologized to me when they kept speaking spanish to me and realized I am ignorant :) So far I have had their pozole, chorizo and eggs and huevos rancheros. Pretty great stuff. Pozole was really great, a little salty but really tasty. The tortillas that you get are really amazing too. Very fresh and you get a decent amount too. \n\nSetupwise it's a little tight but it could seat a lot. I mean you walk in and there are like 4 large family tables, and a back room with more. There is a bar that runs around the outside of the first room until the kitchen. A little TV sits above and is sort of the center focus on soccer days, so the food bar is more popular then :) \n\nI am coming back for the cactus dishes..", "author": "Greg G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-11-25", "description": "Nasty food, i never review no time, but today I was feeling hungry now I passed that place a few times because it used to be charity's Mexican restaurant, and by that I mean they had great food up until the place burned down a few years back, but anyway I came in and asked for a burrito nothing hard to make as I was in a rush, asked for a carne Asa's burrito make it a super I said, which I added to add avocado and cream, ( butter Mexican) and salsa, well not only was not a super burrito when I opened oh when I was in the car I asked for them to make it to go\" and well to my surprise, it was nasty, first it was no carne asada in it (steak) it was ground beef, dried as heck nasty, no avocado, no salsa just the rice and that ugly meet,,, and they charged me 10 bucks for that never again! People please don't make that mistake...", "author": "Jay M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-10-19", "description": "Disappointed in the food and service.  Mainly food- ordered the chorizo and eggs dish.   I've also tried the camarones al mojo de Ajo.  Also not very good.  Sf has high standards on foods.", "author": "Salvador S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-06-02", "description": "not open yet, why are there so many reviews of this place already?!", "author": "Jess C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-15", "description": "I had been meaning to try pozole and based on prior Yelp reviews, this seemed like the place to give it my first taste.  My first spooon was without the fixings (onion, cilantro, hot sauce, red chili flakes, dried oregano - I think, radishes, cabbage, crema, tortillas, limes - yes abundant!!!) and that left me wondering how I would make it through the rest of the bowl.  The soup had a little bit of a canned taste to it surprisingly - I can't place it still exactly but I wouldn't have finished it without dumping in about 1/2 a cup of chopped cilantro, freshly squeezed lime juice, onion and hot sauce. At this point, the mixture became delicious, spicy, tangy and savory.\n\nI had a chance to check out some of the other dishes on nearby tables - some of the egg dishes looked inviting.  The guacamole looked like it had a slightly less than bright color to it and not therefore the absolute freshest, but I didn't try it myself.", "author": "Elizabeth P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-15", "description": "Gallardos doesn't look like much from the outside and is a bit easy to overlook, but inside it's quite spacious, nice and delicious. I've been here twice and got very good service both times.  Unlike so many of the Taquerías around San Francisco, this is a sit down, table-service restaurant.  It's not fancy, but it is clean and comfortable.  The food is excellent, the salsa is on the hot side, carnitas and chicken are very good and the dishes are plentiful.", "author": "Augie R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-01", "description": "To those of you writing bad reviews about chewy meat on your custom order Tacos... you need to either take into consideration all of these 4/5 star reviews and order some soup or egg dishes, or go to a taco truck if all you want is a soft taco.\n\nBest darn Pozole ever.   I work very near Nopalito, and their $12 pozole tastes like dishwater in comparison to Gallardos'.     The albondigas is outstanding as well. \nThe egg dishes I've had have all been pleasing as well.   The odd little portion of chile verde on the side of your eggs is an odd but not undesirable touch.  \nThey give so many tortillas with your meal it is insane.  Easily 2 pounds of fresh tortillas for 2 people.   Take them home and put some butter and salt, or butter and cinnamon and sugar.   They will give you butter at the restaurant if you want some that way there.  \n\nTo the Roach lady.  Just stay home.  You are never 100% free of roaches in city restaurants.  It's a city.  These are old buildings.  And don't ever travel to south east asia if you think you saw a big cockroach at Gallardos you'll be in for a treat. \n\nTo the \"taco truck taco\" guy.   WTF?  a 1 star review because you didn't like the item you made up that wasn't on their menu?    It's not hard to figure out what's popular at this place.  You can read recommendations here, or you can just look at every other table.  Notice there is soup on EVERY table?  \n\nHunger is making me grumpy.  i wish there was something even close to Gallardos in the sunset/richmond.", "author": "howard t."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-03", "description": "Thee best Mexican food in San Francisco! You guys need to try the machaca plate! It's soo good! The handmade tortillas are a huge plus and excellent service too! ;)", "author": "Hector E."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-05-07", "description": "Fix your Restaurant hours please!  If you say you open at 7am and i come at 8am don't tell me to come back 9am.. What a joke!!!", "author": "Akiliano T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-16", "description": "Excellent authentic mexican.food. Great for breakfast. Very good portions, prices are reasonable and service is good. You may need to wait for a table depending on.the time you go, but well worth the wait. They also make fresh handmade tortillas. Go check them out.", "author": "Ronette B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-01-14", "description": "Update: 10/16/2016\nWe stopped in last night, a rainy night, only six other people at 3 other tables.\nOrdered the Combo plate of enchilada/chile relleno. I'm sorry Yelpers, but I gotta be honest: the enchilada was the usual yummy but the chile relleno was from a few days ago! the egg batter started chewy and had this funky taste and toward the end of the chile, the egg batter was so chewy I could not cut it with my fork. Our waters went dry twice and each time i had to flag down the busy person( talking with the other cooks) that our waters were empty. Truth be told!", "author": "Bert K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-06", "description": "Absolutely wonderful breakfast. Love this restaurant. Clean. great staff. Wish it were in Wichita.", "author": "Keith F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-22", "description": "The place moved.  I am sad.  It was right next to my work and was really a great lunch place.  I am sure the food is just as good in the new location.  I just need to get over to it.\n\nThe tacos are huge.  A single taco lunch can fill most people and makes lunch cheap.  Burritos are good and big.  The soups. I love the soups.  Pozole  is good.  Chicken is super chunky and good.  Beef is still on the bone and so flavorful.  Side condiments are available to add as you see fit.\n\nThursday was my favorite special.  Chicken Thursday.  Marinated really well.  Tender.  Juicy.  Good sides.  One of my favorite lunches in the area.\n\nI will miss it and will need to plan longer lunches to go there.  It shall occur", "author": "Clifford S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-08", "description": "Great, standard Mexican food.  Everything they make is done well. I love their caldos (soups) and egg dishes.  My son loves the machaca.  Great handmade tortillas.  Any Mexican restaurant that still makes handmade corn tortillas automatically gets a strong rating.  Very clean.  Quick service.  Generous servings.  Outdoor seating available.  Inconsistency about accepting credit cards (bring cash just in case), and chips are not tasty and not free for breakfast.  Solid, friendly, long-time, Mission district business that's worth supporting.", "author": "Magdalena B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-18", "description": "Great Non-Hyped Mexican. They were great when on Folsom and have continued with the new location\n\n\n\nNOTE re Jared C. review 8/13/14 whining about no cash policy: Get over it. It is an owners prerogative. Refreshing. Cash works fine. Remember?", "author": "El R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-24", "description": "This is me and my wife's go to spot for breakfast. One of the best original down home Mexican spots in the city not taken over by hipsters.", "author": "Robert S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-12-14", "description": "Really excellent!  I was looking for a taqueria on a hung over Sunday morning (ok... it was more like Sunday afternoon) I stumbled upon this place.   Being only a few blocks away from my place, my girlfriend and I decided to check it out.  I was at first surprised that this wasnt a take out Mexican place like I've been accustomed to in the Mission.  This is a sit down restaurant that families tend to come to have lunch.  We decided to try it out anyway and were blown away.  The quality of the food, portion size, and price were just really outstanding.   We've been back since and everything I've tried has been fantastic.  The carnitas are really fantastic, as is the chile verde plate.  For around $9 you get a huge plate of meat, rice, veggies, and possibly the best refried beans I've ever had.  On top of all that you get a grilled pepper to top off the dish.    \n\nIf you're looking for a change from the normal taqueria or just a sit down Mexican place for lunch, you really have to try this place.  As long as I live in SF I will be back to this place often and next time I'm hung over, the menudo from this place is for sure going to be my cure.", "author": "Yuri Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-16", "description": "My go to in the immediate hood bfast stop.  Totally a Latino family joint.  Groups of guys who look like father & sons or co-workers, large families, etc.  HUGE portions.  Mexican Hot Chocolate YEAH.  Great fresh OJ.  \n\nAnd amazing amazing movie posters of stars from the 40's.", "author": "nomi c."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-01", "description": "So delicious! Took a trip to San Fran came here for breakfast Saturday morning. I got their camarones a la diabla which were sooooo delicious! I would definitely recommend this place I was skeptical walking down from our apartment through the neighborhood but don't let that stop you, this place is really nice. Definitely 5 stars! Oh btw they ONLY accept cash!", "author": "Jen A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-07-23", "description": "Good customer service i asked for something not on the menu and they did a pretty good job making it. They were next to my work, unfortunately they moved. I hope to go again to there new location.\n\nSupport small business, dont kill'em.", "author": "Bash C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-22", "description": "my local neighborhood spot. authentic and awesome mexican food. burritos are awesome. service is great... could work on their wait line process.", "author": "john l."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-01-02", "description": "Good, cheap food.\n\nBad experience today though.  Chicken fajitas were dry and 4 other tables came in sat and were served before us.\n\nGo when it's not busy, get an egg dish and you'll be happy.  A plate big enough for 2 for $7.", "author": "Nate P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-05", "description": "This place is fantastic. It really is cheap and they prepare very tasty food that sure seems authentic to me. When I was in there today, for the first time, my friend and I were the only gringas in the place, the only people not speaking Spanish so I guess some Latinos in the area think it is tasty and, maybe, authentic-tasting Mexican food.  That seems to speak well of the place -- at least to me. \n\nI 'just' got huevos rancheros.  IMHO, the simple dish of huevos rancheros reveals how well the chef understands eggs, frijoles, rice and tortillas. I often order this item as my first time in a Mexican restaurant. Testing such a simple 'classic' is a good test, at least I think so.\n\nWe split a side order of chorizo with scrambled eggs cause they don't sell just the chorizo/sausage but the waitress had the kitchen hold back the additional rice & beans and talked us out of ordering two orders of chorizo -- which we really wanted to do, imagining we would get sausage links but, nope, they only sell diced chorizos scrambled perfectly and sublimely. And the waitress insisted we not order two 'sides' of chorizo, she said with our two orders of huevos rancheros, it would just be way too much food.  I balked, tried to insist we were up for lots of chorizo and she insisted we just get the one order and see what it looked like. She was right. I had so much food that I was unable to eat all of it.\n\nWith two entrees, coffee and that side order of chorizo scrambled with eggs, the bill came to $22.75. The huevos rancheros -- sublimely perfect -- are $6.75. \n\nMy idea of good huevos rancheros:  runny, creamy, frijoles -- not beans but mushed up twice cooked gooey frijoles, a good tortilla under the two sunny-side-up eggs. Then mix the runny egg yolks with the perfect frijoles, scoop & dip with the stack of very good side tortillas.  It's an awesome comfort food, IMHO. Soothing, simple and awesomely delicious. We also mushed in the chorizo & scrambled eggs, but left about half the chorizo/egg on the plate. We could not eat everything we had.  \n\nI'll be back, even tho I don't have a car and it is a longish walk from 16th St BART", "author": "Shaniqua A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-16", "description": "Weekend brunch = menudo time!  My first menudo and as expected, it was delicious!  It comes with so many dressings too - onions, cilantro, radishes, tortillas, cabbage, Mexican oregano, and chili flakes.  One note is that I'm a tripe lover - in pho, Chinese dishes, Incanto-style all.  So not for novices.  \n\nMy compadres ordered pozole, enchildas de mar, and combo enchiladas - all loved and all was gone.  The house chips & salsa are clearly homemade and fantastic too.  \n\nGallardos is a authentic, family-style place - at the time we went, we were the only 4 non-Mexicans in the place.  Friendly and timely service, and easy street parking, especially during Sunday lunchtime.   \n\nI'll definitely be coming back for more menudo, posole, and other dishes!  \n\nOne drawback is that I'm used to Vietnamese pho having everything together - not just tripe in one dish but also the meat and noodles.  I'm going to make my own Mexican pho next time!", "author": "FoodieGal I."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-31", "description": "Favorite Mexican breakfast in the city! Do come early though, this place gets busy. I love anything they make with chorizo. The goat stew is also very, very good. I was eyeing someone else's and decided to get my own one morning. The man sitting next to me was kind enough to explain what the different bowls of condiments were and I had amazing feast. Portions there are huge. One reviewer mentioned their salsa - and yes, it is the best. I ate almost an entire jar of it one morning... Love to see cool, local, small businesses thrive!", "author": "S.T. C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-03", "description": "For a taste treat which will have you going back again and again, try this Mexican restaurant in the Mission.  I have been looking for a good Mexican restaurant for a long time and I have now found it.  I ordered Chilaquiles which were absolutely fantastic - the flavor stuck with me all day long.  The setting is nice and the service was excellent - our waitress was prompt, pleasant and willing to explain several things to us about the menu as well as the history of the restaurant itself.  There is outside seating  and I understand it is dog friendly.  Open for breakfast and lunch; we were there around 10:30 and had our choice of tables, but I understand it gets quite crowded at lunch time.  Give it a try, I don't think you will be disappointed.", "author": "Jack S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-02", "description": "My bf and I came here at 8am a few months ago, hungover and exhausted from the previous night's partying.  We stumbled across this little hidden gem that served their entire menu all day long.  How fortuitous, as I was in no mood for a traditional breakfast with french toast or eggs.  I wanted me some pozole and boy, was I rewarded with my decision.  Best pozole ever, with lots of lime and diced onions added on top.  My boyfriend got the chorizo scramble w/ soft tortillas and french toast.  The serving sizes are enormous, service is friendly and wonderful, and our total bill came out to only $25 including two cups of coffee, tax and tip.  We were happy campers for the rest of the day and our hangovers were cured!", "author": "Jen Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-06", "description": "AMAZING!!! I love chilaquiles and these were some of the best I've ever had. Even better than my own mom's. From the moment you walk in this place smells incredible. I can't wait to go back and try the rest f the menu.", "author": "Claudia M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-12", "description": "Been in SF for four years and haven't found some good birria, until now. The broth is tasty, rich in flavor and the meat is not dry or flavorless. Although, I wish it was hotter in temperature.", "author": "Kristine R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-03", "description": "favorite hangover spot.  Bowl of Pozole and 2 Micheladas will fix you right up!  so gooooooooooooood", "author": "Mimi X."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-29", "description": "In my opinion, while San Francisco has a surfeit of good taquerias, it has very few good sit-down Mexican places.  Several of my favorites have closed--I still mourn Casa Agilas way out in the Sunset.  So for a couple of years I've been looking for a new place and this may be it.  It's awfully inconspicuous--hard to spot even, as you drive down Folsom.  And when you approach the door, the impression is of a small dumpy place.  But the inside will amaze you--it's quite large and pleasant.\n\nThe usual chips and salsa offered to start are good--the salsa had some serious heat.  I had a combo plate with a chile relleno and a pork enchillada.  The menu seems to indicate if you order 2 pork enchilladas by themselves, they will come with green sauce, but mine (with the chile relleno) had a red sauce, a slight disappointment.  I'm sure if I had though to request green they woud have happily provided it.  Anyway,  the enchilada was very tasty,  The chile was also but regretably they covered it up with a pile of chopped iceberg lettuce I had to push aside.  I really wish Mexican places would abandon this habit of putting piles of undressed lettuce and maybe a tomato slice on the plate--who ever eats it?\n\nI asked for iced tea but what came was raspberry flavored tea--not what I expected but very tasty (I drank 2 glasses).  Finally, I was seriously thinking about some desert and hoping they had flan, but my very sweet waitress didn't ask about desert--she just brought my check and I abandoned the idea.\n\nAll in all, very satisfying.  A few quirks to get used to, but satisfying and a good place to know about.  On this Saturday evening they were practically empty, though--just one other occupied table while I was there--so I hope more people try it and keep them in business.", "author": "B. T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-05-14", "description": "I Love this place and try to come here as often as I can.  I've been eating here for about 15 years now.  The food is authentic and reasonably priced.   I usually order the pozole which is the best I've had in SF. Also they have the most amazing homemade tortillas!", "author": "Mikky T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-03-31", "description": "Man Pozole on a weekday love it ....SO now I can have Mon hangover or a midweek hang over and I can still get Pozole WOW....\n\nShould I start drinking more hmmm", "author": "Kim R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-16", "description": "The pozole is very tasty.  The large bowl was definitely plenty for me and the BF. The tacos we got (chicken and carne asada) were okay, but it was second fiddle to the star... a rich, hearty pork soup with abundant fixin's.  Will be back when the weather gets colder and I'm in the neighborhood.", "author": "Mercutio k."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-03-01", "description": "Man, this place is a GEM. \n\nOn a Sunday at 11:30am, when most San Franciscians are waiting in long lines for brunch in the Mission and Hayes Valley, come to Gallardos instead.\n\nTable for 8? Not a problem, they have large circular tables already set for large parties.\n\nAuthentic (meaning I'm usually the only white girl in there), cheap ($6-10) Mexican breakfasts, with fast and friendly service. \n\nAtmosphere is a plus: jukebox was playin' some mariachi jams and the pictures of old school Mexican movie stars make for a fun vibe.", "author": "Hannah L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-02-18", "description": "I enjoyed my hearty breakfast at Gallardos.  It's not the best mexican food I've ever had, but the stuff is good.  We had carnitas (good) and albondigas (seriously disappointing).  The tortillas, as noted elsewhere, are incredibly fresh and good.  The salsa could be hotter.  Guacamole is gooood.  The beans and rice were below average.  My michelada was f#ckin amazing though. Perfectly spicy and delicious. Do order one (or two or three. Mine was Modelo).  Best of all though was probably the feel of the place. Spanish being spoken and music blaring from the jukebox at 10 AM...I can't complain about that.", "author": "Delan B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-03-25", "description": "Came here for posole after searching for a good, authentic spot on yelp. Yep... drove to the mission on my lunch break, solo, when it was raining, for a nice big bowl of Mexican soup- I'm a winner.\n\nSat at the bar, the waiter was super friendly. I ordered a small bowl of posole AND a taco because it looked good and the waiter assured me the posole would probably be enough.\n\nCame out piping hot with all the fixin's, tortillas, tostadas, lime, radishes, onion etc. Extremely delicious and hit the spot on this particular rainy SF day. I went back to work a happy camper and will definitely be back to try their other famed soups and yummy looking items.", "author": "Sarah A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-29", "description": "perfect lazy sunday = mexican hot chocolate, huge fluffy pancakes, and huevos con chorizo, all topped off with cheap prices and friendly and quick service (and i mean ridiculously quick)\n\nside note: as my friend and i were waiting for our food and spying on other peoples' food, we noticed that literally every single table had at least one bowl of pozole. \"maybe we should have ordered that...?\" guess i'll be seeing you again real soon, gallardos!", "author": "Stephanie C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-07", "description": "The food is delicious. I searched for a restaurant that had Pozole and Gallardos popped up. I ordered papas con huevos and  a bowl of Pozole. The portion size was perfect and the food was amazing. It is definitely authentic Mexican food. I definitely know where I am going for Mexican food in the city.", "author": "Yvette S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-17", "description": "Pozole everyday = awesome.  Very hearty meals with lots of flavor and a nice staff.  Their chips aren't the greatest and the tacos are a little on the heavy side to where you can't eat them without a fork.  Large fresh tortillas and good daily specials also make this place great.", "author": "German L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-01", "description": "After a day of hiking in Muir Woods the family crossed the Golden Gate and decided on Mexican food. I yelped and saw they had amazing pozole. We navigated our way and never would have noticed this place just driving by. We had a party of 10 and the food was fast, great and being Mexican myself I am always a bit judgey when it comes to real Mexican food, I must say the pozole was on hit. We will definitely be back!", "author": "Judy P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-11", "description": "OMG!  Best Breakfast Barritos in town... I move here many years ago from the south (Texas & Alabama) and I have never found a place that can make good breakfast barritos here until now....  SWEET!", "author": "Kevin R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-03-02", "description": "This is my new go to place for Mexican brunch.  \n\nI'm a big weekend Mexican brunch fan, especially where they serve menudo.  They have generous nice cuts of tripe in a tasty broth, with all the traditional toppings.  The fresh, warm tortillas, chips, and salsa on the side are a great accompaniment.  The prices are reasonable.  About $8 for a large serving for a sit down place like this is OK in my book (I stopped going to Los Jarritos when they raised their prices to $10 a bowl.  $10 for a bowl of menudo just seems wrong.  I brought a large group of my family there for dinner once as well and it wasn't that great, but back to Gallardos...).\n\nIf you aren't into menudo, they also have plenty of other brunch options, pozole, huevos rancheros, omelets, shrimp cocktails, other egg dishes, as well as their regular menu.  Most of the people I go with usually opt for one of these options and seem pretty happy about it.\n\nThe wait staff has always been very friendly.  Always smiling and quick to refill your coffee (which is not bad at all) and water.\n\nAll the times I've been here were with groups of 7+ plus people, which they are able to accommodate.", "author": "eugene c."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-12-05", "description": "Gallardo's is like eating at your best friend's grandma's house, bad coffee and all. 7am till dinner, umm fantastic...! Pozole is mi favorito -- day or night, pero todo el mundo de la menu es fantastica tambien. Ustedes quiero!", "author": "eVa J."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-01-16", "description": "My first time and last.  The food was lukewarm. The carnitas looked and tasted like shoe leather. There were two of us and neither one could eat the food. We both have eaten Mexican food throughout the Mission and never had an experience like this. Worse food ever served to me. The service was fine.", "author": "Bert J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-02-20", "description": "ALBODINGAS,PACIFICO and TORTILLAS por favor!!!", "author": "Curt M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-13", "description": "For someone who is very particular about Mexican food, Gallardo's is one my favorite local spots! Friendly service, excellent food and fun decor! Highly Recommend the chilaquiles, pozole & michelada! Buen Provecho!", "author": "Anna D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-12-03", "description": "If they bought better meat it would be 4 stars. Great ambiance, service, and presentation. Red chile sauce was excellent. But my beef enchilada was full of inedible gristle - some of the worst meat I've ever been served in a restaurant. Que lastima!", "author": "Stuart M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-27", "description": "probably my new favorite place to get mexican food! i love how you can mix and match items to get your perfect plate. everything here is fresh and the portions are more than substantial. i had the combo plate that came with an enchilada, a taco, and rice and beans. so good! as i was looking around, everything else i saw looked amazing too. i can't wait to come back again and again to try everything else!", "author": "Sabrina L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-24", "description": "This place was EXCELLENT! Really delicious and inexpensive with large portions. I went with coworkers for lunch and although the server was overwhelmed (they were slammed which is also a good sign) she was cheerful and very nice. I got the chopped steak with tomato sauce and I can't wait for the leftovers. The place was also very clean and charmingly decorated. I'll go back all the time!", "author": "E H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-15", "description": "From the street, you would never know what kind of gem this place really is....through the doors though....Excellent authentic food, the atmosphere is like being in an open air cafe with a very friendly wait staff and the Chef comes out along with the manager asking how the food was and  inquiring about the food and was it prepared to your liking. I will recommend this place to everyone I come in contact with....the restrooms were clean and tidy as well.", "author": "David S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-04-09", "description": "Yes, I AM A FAN! \n\nI've been going to this restaurant since I was a child, my dad likes to go here to get the Birria on the weekends for la familia. \n\nThis is a great spot to go after a long night of patying, El Menudo, La Birria , and Los Chilaquiles are the BEST!  \n\nI also enjoy the fresh orange and carrot juice :) Yummy stuff.", "author": "Claudia G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-08", "description": "Love Gallardo's I eat here every Sunday and I am never disappointed!\nIt is the best authentic food and the staff is nice and friendly.  It does get crowded but the wait is no more then 10 minutes.  So this is my spot!!\n\nEveryone comes down and makes us take them there and they look forward to the dining.  I have a big fat Mexican family and they always are able to accommodate our large group.  They sometimes have a cute little boy helping to clean he thinks he's a real worker and likely will be one day!!\n\nI love places where they remember your order even when you forget to mention no crema.", "author": "Tracy B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-03", "description": "Fantastic food, friendly service, and good prices.  Just about my favorite Mexican spot in San Francisco.", "author": "Robert B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-06-25", "description": "Break the taco shop routine! We dont have enough Mexican food restaurants in SF and this place really hits the spot for a girl from the southwest. Mexican breakfast with handmade tortillas and coffee served up with a side of spicy salsa. mm mm good. The decor alone gets 5 starts, all walls are filled with old-school black and white film noir movie star posters (think Clark Gable Gone with the wind-ish). Try to cactus omelets and the chilaquiles and your heart will smile :-)", "author": "Jordan V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-11", "description": "As a Mexican living in San Francisco I am picky with Mexican food. This place is so delicious. Everything is really fresh, the people are so incredibly nice and the service is so kind. This place is exactly like their pozole: hearty, authentic, generous.", "author": "D Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-03-18", "description": "The excellent birria de borrego on weekends served with fresh, homemade tortillas will bring me back again and again!", "author": "Nick L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-03-23", "description": "went because yelp reviews were so high. My friend had errands at Costco and it's only 2 blocks away so we met there. \n\nPROS:\n-great chips\n-great guacamole\n\nCONS:\n-bad service (place was empty...we were 1 of 3 tables with patrons)\n-carne asada tacos were gross\n-food overall was mediocre\n-most of the patrons had ordered hamburgers (ok I guess that is what is best there so note to self go to Mexican place to get a burger next time)\n-special was some kind of veggie enchilada with fried chicken (note to self, go to Mexican restaurant for fried chicken or hamburgers)\n\nOk, back to PANCHO VILLA or EL TORO....so hard to beat!", "author": "Jane C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-09-15", "description": "I maintain that I can not find a good, solid Mexican restaurant in LA. Sure, there are plenty of good taco trucks, but for other traditional fare? I am often disappointed by lackluster meals which utilize cheese as its main component. While I still haven't discovered the best home style Mexican restaurant in my hood, at least I can say that I've found one in SF. \n\nGallardos comes amazingly correct with its food, especially the soups, and specifically the posole. Right after my best friend's mom's home cooked version, this is the best. The pork is tender and immense in flavor, elevating the soup to the next level. Even as I got full, I just could not stop consuming the posole. It is borderline addictive.\n\nServed with both tostadas and warm tortillas, tons of seasoning/onions/cilantro for you to add as you please, it's really one of my favorite meals at this point.\n\nNext time I'm in the area, I'd like to try the menudo, which again is difficult to find a good version of at restaurants. But the posole is just that good, that I continue to order it each time I make my way over there. Some habits are hard to break, I guess.\n\nWhile some people leave their hearts in San Francisco, I've definitely left mine in an empty soup bowl at Gallardos.", "author": "Karen T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-12", "description": "Very clean, well lit place with beautiful framed movie stills from 1940s-50s Mexican cinema (the \"golden age of Mexican cinema\"). Food is honest no-frills Mexican at cheap prices. Wait staff is fast, friendly and efficient.", "author": "John G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-03-24", "description": "Saucy. Steamy. Gargantuan.\n\nNopalito con juevos burrito in my face.  My arm was getting a work out just carrying that burrito back to work!\n\nPiping hot, flavorful cactus.... overflowing scrambled eggs....juicy and robust rice, potatoes, and beans.....oozy goozy melted cheese for days....OH BEHAVE!\n\nCould only manage to down scarf half of my bor-ee-to: more for later!  And all for $5.75!  Would give this place 5 stars if the chips weren't terrible - super dry, but still greasy?, super thick but not crunchy (kind of stale).  \n\nWill definitely be back for the torta - can't resist'em - when I'm feeling shameless.  \n\nAlso serve a wide variety of combo meals and a la carte tacos.\n\n$From 5.50 for a regular burrito to $12 for entrees, your broke a** can eat here too! ^_^", "author": "Jane L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-03-05", "description": "LOVE. THIS. PLACE. We've ordered a lot of different things from the menu: chicken flautas (beautiful!); menudo (amazing!); albondigas (like a huge hug to your stomach); sopes (so damn good), chilaquiles (perfection!), etc.\n\nI wish it stayed open later at night but that's the only real issue I have w/ this place.", "author": "Minh-Ha P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-01-18", "description": "A co-worker recommend this place and after reading positive reviews I decided to have lunch today. I was contemplating in having  flautas or enchiladas del mar. I opted for the latter. Yes, they serve huge portions but I was  not totally thrilled with the food. The enchiladas had a big of un-melted american cheese on top of it. The shrimps were overcooked and the tomatoes sauce was a tad sweet. The plate was hot but the food was lukewarm.  Fast service which makes me believe that many of the items are precooked. Friendly service. Expansive place but with poor lighting. I will go back and order the flautas.", "author": "Hum V."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-03-19", "description": "Is this this same place?!\nCraving tacos for breakfast, I yelped up Gallardos which was nearby.  The place was full and looked promising.  The menu was typical Mexican fare, including breakfast.  I ordered the taco combination plate.  On the menu it's crispy tacos but I requested plain ol' street tacos.  Meat, cilantro, onions, sauce on a tortilla.  One carne asada and one pork.  \nMan, what a disappointment!  The tacos came \"super\" which means lettuce, cheese, guacamole and sauce.  The carne asada wasn't grilled like these pictures.  It was like stewed or something and very tough.  The pork was worse.  It was tougher and seemed like it was cooked the day before.  Long story short, I didn't even finish the plate.  The rice and beans were decent but I didn't come for rice and beans.  The fresh squeezed orange juice was served at room temperature with no ice.  The waitress was nice but the food was awful.  For you \"don't knows\" there's waaaay better places in the area.  Please educate yourselves.\nStreet parking can be tough.", "author": "Pablo R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-07-26", "description": "Well I cook a lot so I can be a food snob. This place is close to my office so I'm starving today so a breakfast burrito should be cool. The place is pretty clean and they have the cutest lil lady behind the counter which is always a plus. When I make my own breakfast burrito I don't add rice  & beans and I like my bacon a little before well done. I have fancy iron pots to help get a few slices of pig  just right. So to compare my home made burrito with theirs is probably not adequate. However I'm no longer hungry so mission accomplished. I will remember to ask that they hold the beans and cook my bacon a little harder. It was $5 bucks .75  and enough for two!! I think it would have been better if I had given more directions or special request.", "author": "Andre F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-01", "description": "GF recommended this place and we tried it out for breakfast.  The orange juice is a fan fav as it is freshly made.  I ordered the Machaca con huevo.  The beans were tasty, the tortillas fresh, and the rest was very tasty and served with healthy portions and the price was great.  I'll be coming back and trying other breakfast dishes.", "author": "ed c."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-15", "description": "It felt like being in my grandmas kitchen. I ordered 2 carne asada soft tacos with rice and beans. Yum they got their carne asada down right. I was one my hour lunch so speed mattered. I was in and out in 30mins. The staff is very friendly.  They have odd hours though. I have been back but they were closed those 2 times. :(", "author": "V M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-08-07", "description": "Hail holy hell!  Why have I not discovered this place before?!?!\n\nThis is one of the best Mexican restaurants in all of San Francisco.\n\nHands down!", "author": "Larry A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-09", "description": "Fantastic for morning breakfast with a large group - wonderful friendly service and generous portions. We have made it our regular monthly weekday breakfast place for our work group to rejuvenate and reconnect. Appreciated the bonus plantains as well!", "author": "Neda R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-07", "description": "I have been going to Gallardo's for years and I wouldn't go anywhere else. I love their posole the best. My husband and son love their burrito mojado's. All the food is great. I have had chilaquiles, american breakfast (french toast, eggs & bacon), burittos, enchiladas, fajitas, etc. I just can't say enough good things. Juan Manuel and his wife are wonderful people as well as all the staff there. It is bright and inviting and you feel like you are part of their family. I recommend you go and visit and check it out for yourself. You will not be disappointed.", "author": "Vickie M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-18", "description": "This is good, real deal mexican food. LA quality, right in the bay. Who would have figured?\n\nThe soups are frickin' amazing. Sadly, I've not been able to get a bowl of birria, but the Menudo, Pozole, Caldo de Camaron, and Albondigas has been AWESOME.\n\nThe tortillas are hand made, and absolutely the best I've had outside of southern california.\n\nLike I said, this is high quality, LA style Mexican food. Most SF hipsters would be strongly advised to go to more insipid places like El Toro (2.0 BLEH!).\n\nMy only complaint, and the reason for the 4 stars instead of 5, is that the carnitas were a bit on the dry side. Flavorful, but dry.", "author": "Dave M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-01", "description": "I love love this place so much. My favorite things are the the pozole and chicken enchiladas verdes. SO GOOD and very reasonably priced. I wouldn't come here to get tacos or burritos - go to a taqueria for that. The people are friendly and efficient. Yes, it's cash only but who cares. In fact, I'm glad it's cash only so whiny \"i refuse to carry cash\" people steer clear. Also, very good micheladas.", "author": "kathleen m."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-08-21", "description": "My family has known the owners for years, even before the place opened.  Great food and authentic flavors \"a estilo jalisco\".\r\n\r\nWhen it comes to Menudo, I am very selective...since my mom makes the best, I only eat it where my mom eats it.  This is some great menudo, especially with the home made corn tortillas.\r\n\r\nComfort Mexican food!", "author": "A P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-16", "description": "Man their POZOLE is bomb!!! Really authentic!! I also love their freshly squeezed OJ!!! Too bad the restaurant close early say around 4-5pm daily which makes me sad....", "author": "Cee M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-07-18", "description": "Look, I'm not even done with my meal yet and I'm compelled to write this review. I'm at my desk, eating my albondigas soup and I'm this close to licking my bowl. So fucking good. \n\nThis place is a little gem, hidden away in the Mission, and you should really go there. Like right now.", "author": "Andi R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-19", "description": "Super authentico mexican food with a relaxed, family run atmosphere. Try not to fill up on the chips and spicy salsa beforehand...mucho addictive. \n\nI ordered a chicken taco salad with mounds of marinated, shredded chicken, lettuce, avocado and tomatoes in deep fried crispy shell the size of a large helmet. Tasty. The only thing missing was sour cream, which I ordered on the side to make it a great tasting, 1000+ calorie 'salad' I was looking for. Next time I think I'll skip the beans, which didn't jive with the rest of the flavors, but otherwise it was muy yum. \n\nMy boy who frequents this spot about 3x a week had the sopas, which are like thick tostadas made with masa. delicious and filling. He recommended the posole (mexican version of pho) on a cooler day, since it is \"to die for\" and the small bowl could feed a family of four.", "author": "Kelly R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-26", "description": "My family and I went to Gallardo's Monday morning for a birthday breakfast for Mom. I'm a native in the area and had no idea the place even existed. As we entered the first thing I liked were the old style high ceilings that remind me of old SF Victorians. The second thing were the many posters of legendary Mexican movie stars that cover the whole place. The third thing was the great jukebox with good sound and a nice selection of Latino music (viva Chente!). The rest was best, great food and very warm fuzzy service. Viva Mexico, viva Gallardos!", "author": "Ron O."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2006-09-01", "description": "These guys must have some kind of futuristic Star Trek Matter Discombobulator geegaw because I see no other reason for an order of enchiladas in red sauce, PLEASE NO ONIONS to show up as an order of enchiladas in green sauce, chock full of onions, with an extra bonus side of cook's hair.\n\nI am adding a star because the manager/cook was incredibly apologetic and offered to remake everything. When my dining companion, Senorita La Puta and I refused, he graciously comped both of our meals, apologizing all the way.\n\nI may return because I am addicted to their fried plantains, or I may not because I'm not especially addicted to flossing while I eat.", "author": "Frankie D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-02-11", "description": "If you want good authentic mexican food at an incredibly good price - GO HERE!!\n\nMy boyfriend and I have been here a dozen times, and we have never been disappointed. From the caldos (soups) to the burritos to the breakfast plates... basically everything on the menu is fantastic. The freshly squeezed orange juice is a must (ask for a cup of ice on the side if you like your juices cold) The fresh home-made tortillas are amazing. The service is always promp, friendly, and accommodating.  \n\nOne warning, come with a big appetite because the meals here are not for weight-watchers. Besides the huge portions, the meals are slightly calorie-dense. However, they are willing to split the plate for you upon request. Come for breakfast or brunch and you will have the rest of the day to burn-off the tortillas\n\nWe would drive across town anytime, any day for this amazing mexican food!", "author": "Daven D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-06-23", "description": "Great Restaurant!!\n\nGreat food!! Tastes like home cookin!! All the mexican dishes we ordered were good, we all tasted each other's food and it was YUM!!\nEven random, one of the little ones ordered French Toast..and it was super good-cinnamon perfect texture..it was shocking! We really expected that to taste okay since it's not an \"American\" restaurant!!\n\nService was super friendly, quick and they even upgraded a side order to a family size so we could all eat some ON THE HOUSE!!!\n\nSo affordable, not over-priced at all!! Parking on a Sunday was easy, too!! Can't wait to go back!!!!", "author": "M R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-05-26", "description": "This is my favorite restaurant in San Francisco, Mexican or otherwise. I have had dozens of things on the menu and everything is as good as the last. I have been coming here for almost 20 years now, and it's still amazing.  If you haven't been here - go.  If you don't like it, I'll let you punch me in the face...", "author": "Jon B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-01", "description": "Been here once, but will definitely be back. Its family-friendly Mexican food and its good! I had a breakfast dish of a vegetable scramble. My date had a combination platter of Chile Relleno and an enchilada. Both dishes were very good. I asked for some extra heat and the owner brought out some homemade hot sauce and grilled jalapeno peppers. Very tasty and spicy! I was impressed with the quality of the food and the level of service we received. They treat people well here. The dishes were also affordable and at a great value for the quality of food and service we received.\n\nI would give it five stars, but I thought the bathroom was dirty and I was disappointed to see that this place does not accept credit cards on the weekend. So be forewarned, please bring cash if you come on a Saturday or Sunday. Otherwise, it is excellent. And we will be back!", "author": "Matt D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-03-23", "description": "The best authentic Mexican food EVER!\nEverything is delicious, the guacamole is the best!\nThe price is good. Their menu is filled with different items, chilaquiles, posole, enchiladas, gorditas, etc. Home made tortillas! Meals cooked fresh! I can eat there every day! :)", "author": "Maribel Q."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-16", "description": "Delicious Mexican food at a reasonable price. Nice ambiance. I wasn't sure why I should go to a sit down restaurant when there are taquerias nearby, but this place is definitely worth going to. Staff is friendly as well. We will be returning.", "author": "John-Mark I."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-10-10", "description": "I love this place for the pozole, my favorite in the city.  You get a nice size serving of this pork stew and throw on oregano, red pepper, cracked tortilla, radishes, cilantro, and drizzle it with lime.  (I skip the sour cream).  What makes this pozole special is the rich pork flavor in the broth.  And the quanitity is great.  A delicious meal in a bowl.", "author": "John T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-09-30", "description": "Gallardo's is an awesome authentic Mexican restaurant. Everything on their menu is excellent. The menudo is the only exception. I found the menudo to be overcooked. The pozole is awesome as well as the Albodingas. Now I know most people have noticed at MOST MEXICAN RESTAURANTS the beans are not tasty at all. Well, at GALLARDOS the beans are sabroso, delcioso. If you are hungry then order the Guadalajara Special Dinner.", "author": "Christopher G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-30", "description": "We are SO happy to see this place reopened.  The new location looks great!  The food and the menu are the same (as good as ever)!  It looks like they extended their hours into the evening (great).  Only complaint...MAKE MORE BIRRIA...they are selling out too early.", "author": "Aaron C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-12-29", "description": "By far one of the most authentic mexican restaurants in SF. I love their Pozole and Menudo. The machaca con huevo is very good(shredded beef and scramble eggs). This place is run by a family from Jalisco, Mx. Very friendly folks and they go out of their way to make you feel at home. If they are busy do not expect the same treatment. $", "author": "Nelson M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-07-08", "description": "For those of us who work north of the Mission but CRAVE Mexican food on our lunch hour (and don't want to walk too far south), this is a decent place for a quick sit-down, restaurant-style lunch. It was a little dark in the dining room area, but the funky pictures on the wall made it interesting enough. On our way out, there were two younger girls peeling avocados and throwing the pits into a large white bucket. You know what that means: fresh guacamole and family-run.\r\n\r\nDuring the World Cup, they had soccer playing on a decent-sized TV in the bar area. Tables were set up where you could watch it from your seat. Worth a try if you're in the neighborhood. They pile on a bunch of sour cream, guacamole and other salsas atop your enchiladas or tamales or burritos, whether you want it or not. HUGE PORTIONS, so beware.", "author": "Dave K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-26", "description": "Second yelp review ever! BEST MEXICAN FOOD PLACE in SF. Try their milanesa torta, pozole or birria.I do agree with others that say it gets busy during peak hours and weekends, just something to note.", "author": "Grecia L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-05-12", "description": "I didn't have very high hopes for this place, but I was pleasantly surprised.  It wasn't crowded, and I appreciate that.  The service was friendly, and the food was delicious.  \n\nAs a previous Yelper noted, he thought the chips were fried in lard...I'm not sure but they were pretty tasty, and the table salsa wasn't the usual bland fare.  \n\nMy flautas were done to perfection:  not too crispy, not too soft, and topped with a generous helping of cream and guacamole.  I'd certainly return for more!", "author": "Ken B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-01-02", "description": "This is down home Mexican food where the amazing sensations of rice, salsa, beans, homemade tortillas live harmoniously on one plate. As you move from the enchilada to the taco, through the beans and into the rice, you find yourself eating faster with excitement. Hoping that the next bite is a rich and wonderful as the last.\nHigh recommend this place when you are fed up with the usual eat-and-run taquerias. Sit down, order something different and enjoy the sweet melodies of Los Panchos playing on the jukebox.", "author": "Travis W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-22", "description": "Great authentic food. Just shy of five stars for me but my favorite sit down place in the mission.", "author": "Ian W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2005-11-30", "description": "4 stars excusively for the birria every weekend.  The portions are enormous, the meat is fabulous, and the servers are very nice and prompt.  \n\n-1 star for something that might not even be their fault: at least twice while I was there, they seemed to be having electrical problems which made it somewhat difficult to see.", "author": "Casey S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-03-16", "description": "ok this place serves great, authentic, tasty mexican food. I am a picky eater and I don't like going to taquerias all the time.\nthis place is great for families and friends. The staff are friendly and the menu is extensive. Good prices for big portions.\nThey have fresh orange and carrot juices. \nThey offer free chips and salsa when you sit down at the table.\nThe only downside is they don't accept credit cards. But hey, if you go with friends, you can always go dutch.", "author": "Mauling W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-10-31", "description": "Friendly staff, authentic and tasty food, inexpensive\n\nI tried Birria (on their weekend brunch menu) for the first time here and really liked it.  The meat tasted a little \"game-y\" at first, but thats something I appreciate once in a while after living in Alaska and eating caribou, etc...  \n\nMy date voted five stars too... she had the chicken enchiladas plate.", "author": "John L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-08-27", "description": "We love this place and have been coming for at least 5 years.\n\nMostly we come on weekends and can get busy but no line and service is prompt and friendly.  Food is homemade Mexican traditional Mexican style with large + portions and no one can finish the soups.  My favorite is carnitas plater; wife's albondigas.  Usual combinations are very good so you won't go wrong with any (we've not done hamburgers but do look good).", "author": "Richard K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-08-02", "description": "The cuisine here is AMAZINGLY flavorful, and authentically so! The red chile enchilada sauce is the perfect degree of spicy and you can TASTE the complexity of the red chile in it, which is rare. The establishment is CLEAN with full view of their immaculate and fully-functional kitchen. Fresh oranges are stacked nicely for fresh juice along the kitchen counter's glass viewing area. The service was friendly and good. A gem of San Francisco for certain. I've been to Mexican restaurants in Arizona, New Mexico, Los Angeles, Texas, Colorado, Washington DC, but some of the best are in Stockton, CA and Gallardos is right up there with them! I had brunch: Tocino and Huevos over easy... for you GRINGOS y gringitas, that's good ole fashioned bacon and eggs. The bacon was PERFECTLY crispy like I prefer it, not overcooked and 5 strips! the 2 eggs were full of yolk and also perfectly over EASY, served with rice and beans, just as I like it. The cook was generous enough to ADD some puerco a la chicana on top of my eggs, which was a pleasant surprise. I ordered a side beef enchilada just to sample their red enchilada sauce with my eggs. I requested some chips and salsa and was impressed by the flavor of the salsa which tasted FRESH. Add to that a stack of homemade corn tortillas nice and hot and this was sheer perfection for brunch on this day. Oh, and perhaps the BEST part for some of you was the PRICE! I expected to pay like $18 for all that, but when the bill came... ALL that LOVE and FLAVOR for under $10!!!???!!! Amazing!!! 5 Stars!!! :)", "author": "Ernest R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-06-11", "description": "i love this place and so does all my co-workers.  Everyone greets us as we walk in and no matter if you are ordering out or eating in i have always had the best food there...........this place is so good that i have even thought of driving in from the east bay on the weekend to get some food!  Fast service, great quality food, and the nicest people i have met in a long time!  My office goes there at least twice a week! this is REAL mexican food not the chains that are watered down for the mass market!", "author": "S M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-11-16", "description": "Man - talk about one of those places that you walk by all the time and never try, and then do and hate yourself for not doing so earlier!  My buddy and I were bored and lazy, so said 'want to try that place on the corner we always say we're gonna try?'....sooooo glad we did.  In addition to it being really damn cheap, the food was absolutely amazing (think tortillas fried fresh for an order of tacos, huge portions of everything, and high quality ingredients around), and the service was stupid good.  A guy who seemed to be in charge - Gallardo maybe? - even brought us a plate of braised pork spare ribs in a tomato-jalepeno sauce for free - and they were incredible.  So happy I found this place - doubt I'll be eating Mexican anywhere else!", "author": "Evan C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-01-22", "description": "7 breakfast burritos - 7 people with food poisoning.  My colleague generously drive out from downtown to get our team breakfast burritos last Friday morning, that, while tasty, left everyone who ate them very sick for the next 24 hours.  Avoid.", "author": "Eoin O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-07-30", "description": "OMGosh! OMGosh! OMGosh! I can't believe I haven't reviewed this place!  This place absolutely, hands down, has the BEST MEXICAN FOOD in this city! SIMPLY PUT...It's like eating my late Grandmother's homemade Mexican food and is absolutely fantastic!\nI miss her homemade tortillas, refried beans and meat dishes, but this place brings back all those memories in the best way ever!\n\nThis place is not like the \"fast food\" taquerias all over the city in SF. It's a great casual sit down place, very clean, with lovely servers and friendly cooks in the kitchen! It's literally like sitting in my gram's kitchen for a wonderful meal. You asbsolutely have to try this place out!!! It's my favorite place to eat in San Francisco!\n\nAnd...just for the record...I think the few people who gave bad reviews of this place, really need to go again or are just cranky people with a negative outlook is all I'm sayin!", "author": "Joseph G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-03-24", "description": "Finally hit this spot with a few friends for breakfast at 10:00 am. I have been seeking a fabulous chilaquiles place in SF and am writing to report that I found an Ok chilaquiles place.  Gallardos is very familal in ambience, service, and its fellow patrons.  Traditional Mexican menu all around. They have a good number of the usual suspects for brunch.  The place seemed pretty clean.  I ordered the chilaquiles and Mexican hot chocolate.  My pals ordered the chorizo omelette and huevos rancheros.  The food arrived in record time.  The Mexican hot chocolate didn't taste very Mexican - no spice. The chilaquiles - the chip pieces were bigger than i like and there weren't enough eggs for me.  The flavor didn't have enough zing - the sauce that it is- - - maybe not homemade.  The rice and beans had some decent flavor.   My friends had never had Mexican breakfast before and both cleared their plates. We all liked the warm tortillas.  \n\nThere was a nice buzz in the place.  The soups all looked delicious.  The customers were mostly of seemingly Mexican descent and the place was pretty full  with regulars on a rainy Saturday morning. \n\nif in the hood, I'd go back and try the huevos with nopales or a taco at lunch.  All in all - not amazing, but worthy of a repeat looksey.", "author": "Carson R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-08-28", "description": "Gallardo's wins the award for most ill-placed sign ever...right behind a big huge tree.  I biked through 14th & Folsom every day and never even noticed there was a restaurant here.  But when you do go inside, you find a surprisingly large space decorated mostly with pictures from the Mexican silver screen (not too shabby).  I don't know of any \"signature\" dish here, but they did have a nopalitos con huevos burrito, and I've been meaning to try something with cactus for a long time, so I got it.  It was huge, but amazingly, it was gone before I knew it and I didn't even feel that stuffed, but when something's tasty and vegetarian, what do you expect?  In short, not a destination dive but a rock-solid option if you're in this (rather food-sparse) part of town.", "author": "Wes M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-15", "description": "Pretty darn good but not awesome. The location is rather crappy, parking is a biotch! Also they do not have horchata, wtf? Aside from those two things this place serves up some serious Mexican comfort food. For appetizer we started with the Frijoles con queso, a yummy gooey platter of re fried beans with a ton of melted cheese, guac and grilled jalapenos. Gooey goodness! I had combo #5 a tostada and enchilada and the hubby combo #2 green sauce enchiladas. OMG more piled high goodness. The tostada was off the hook with meat, beans, guac and salsa. The hubby enjoyed the green sauce enchiladas so much he didn't want to share, lol! As others have mentioned the handmade corn tortillas are something special, large and tasty. I would return to this place again, I would love to try the soups. The service was nice and quick too. \nP.S. The chips and salsa are just ok, the salsa is on the spicy side. \nP.S.S. I love, love the Mexican movie star posters on all the walls. The gorgeous Maria Felix is always a wonderful site to see.", "author": "La C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-31", "description": "Best Mexican food in the Mission.  There I said it.  The albondigas are amazing.", "author": "Adam E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-10-28", "description": "Absolutely recommend! I ate here for the first time a few weeks ago and don't have a single bad thing to say about the place: our waitress was funny and super nice and seemed sincere in her kindness and patience, the food rocked! and came in enormous portions and is very inexpensive along with the extensive menu (including loads of veggie options and a brunch). \n\nRegarding \"going the extra mile\"...Six of us showed up at 6:59 on a Thursday and had no clue they were actually about to close (at 7pm). They basically reopened the kitchen, turned on the music (my first clue) and brought us not just chips and dip to start but some crazy yummy bean and avocado appetizer (that we were not charged for). There was no rush, no irritation on their part for this big group barging in right before closing; we didn't get wind that they were actually closing until we noticed their hours posted in the corner of the window. Feeling horrible for being so unobservant, we apologized to our waitress and thanked them for staying open and told them we will definitely be back as regulars - their brunch menu was looking darn good too.", "author": "Julie J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-11-22", "description": "Excellent all around experience! Amazing authentic food and great service from kind individuals. The huevos rancheros and chilaquiles were wonderful. Strongly recommend having some Mexican hot chocolate (chocolate abuelita). One of the managers came over after our meal to see how everything was and he took his time and was genuinely interested in our feedback. During our breakfast a man playing the guitar came in and sang. It couldn't have been a more authentic Mexican experience if we'd been in Mexico! Don't judge a book by its cover- try it and you won't regret it.", "author": "Marianne C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-02-09", "description": "The menudo was out of this world!!! It is the best I have ever had. All of their soups are amazing. Their portions are big and fair. It is just absolutely delicious. The have fresh orange and carrot juice. You can mix them per request. They do not take credit cards at this moment, because their machine is broken. Most of the staff speaks broken English, but it is so worth it.", "author": "Angela Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-03-30", "description": "I grew up in the Central Valley and fondly remember going to delicious, family owned Mexican restaurants where the chips were fresh, the salsa was hot, the tortillas were handmade, and after a few visits, you were part of the family. I haven't found anything that came close until breakfast this morning at Gallardos. I stumbled in after finding it on mobile.yelp.com (woo hoo!) and was so excited. My huevos rancheros were delicious, the tortillas were wonderful, and the carrot juice- yum. Musicians serenaded us as I ate my amazing breakfast. I cannot wait to return for dinner.", "author": "Noelle Q."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-03-29", "description": "If you think good mexican food is chevy's or celia's sorry to tell you- you are very wrong. If you want to sit down and enjoy an authentic Mexican meal definitely go here. The portions are great and you can't go wrong with anything on the menu.  The sopes are good, the enchiladas are good...I could go on...", "author": "Valerie A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-03-28", "description": "I live around the corner and I go down probably, once every few months?  I like their food, and they are wonderful people, it's just the atmosphere is a little weird in there, I feel so alien when I walk in and sit down.  The food is good and dependable, the enchiladas are always done well and the interior, the wall to wall black and white still of latino movies is great.", "author": "Asha H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-03-09", "description": "I have to admit I've only tried the albondigas soup...  I keep telling me myself next time I come here I'll order something else but it's sooo good that I end up getting the large albondigas soup again.\n\nLarge chunks of carrots, potatoes, and celery makes perfect companions for the large meatballs.  The broth is light yet very savory.  I like to add huge spoonfuls of parsley and onions to finish out the soup.", "author": "mellow p."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-07-16", "description": "roaches - hoping you see this post  before you eat here. i will never forget my experience and the  roach!   while eating a bowl of  menudo my husband pointed to the wall behind me, i  turned to see what he was looking at, i  actually thought it was a bee but no it was a huge roach... i got up in a panic and told the guy at the counter, he grabbed a napkin and went and squished it on the wall, then threw it down his kitchen sink. i hope it was dead!  omg i thought i was going to have a heart attack, i said that outloud  ,and he said shall i call 911 - i said no but i know who i'll be calling the health dept!  just called to place the complaint.  do not go here unless you want to risk bringing  roaches home, or eating them urggg, yuck gross - the owner started to talk about me in spanish -saying shes never seen a roach in her life stupid white girl - and the answer would be no you nasty man i never had seen a roach before that is until i went to your restaurant, and i speak fluent spanish because i'm mexican!  yuck, groosssssssss  oh and mr smartypants owner said the roach came from next door because they don't have roaches, um yea....  ewwwwwweeeeee", "author": "Elsie G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-09-20", "description": "I live right next to Gallardos so naturally I want it to be my go-to spot for quick & easy pick-up. I continue to give them my business after many failed attempts of theirs to make me happy. I usually get the super chicken burrito and say however many times they request, that I do not want rice in it. It is a 50/50 chance my burrito will actually come without rice. Today the odds were not in my favor. I called and requested my order again which was very difficult for them to understand. I went to pick up my new burrito and the lady asked me where my old burrito was? I asked her if she really wanted me to go home and retrieve my burrito and she did. Did she think I was trying to scam them? Was she gonna reuse the chicken? I grabbed it and presented it unwrapped and 1/5th eaten in exchange for my 2nd burrito. It was still mediocre as usual and I can't stand the two handfuls of big pieces of lettuce they include. I am sad to say I continue to try my hardest to never have to eat here. I miss San Diego's Mexican food :(", "author": "Jessica Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-05-01", "description": "This place is across the street fromn me and I really like it. The breakfasts are $6.75 and more than filling. The place is deceptively large and covered with these great large photos of mexican movie stars. The staff is very friendly and It is a family run place. The food is very fresh. Good takeout too. Great hangover location.", "author": "Julian M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-03-28", "description": "Mmmmm... I love their food here.  Price is decent and the platter is HUGE.  Everything is so flavorful and u also get salsa and chips while you wait.  This place is located right across the street from Foods Co.  It's a bit hidden in front of a bus stop.  $10 will get you a platter of refried beans a taco and enchilada.  It's delicious!", "author": "Mimi S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-07-03", "description": "good service\ndry, nasty, did I say DRY? carnitas in the enchilada\nI dont think it was a good experience and suggest you go into the mission further. Like El Faro or El Toro.", "author": "Razza M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-08-13", "description": "OK, I REALLY want to like this place, so I'm giving it 3 stars.\n\nThe atmosphere is great - huge framed photo stills from old '40s Mexican movies cover the walls. You feel like you're in Mexico City, at some restaurant that caters to middle-class Mexicans.\n\nThe food just misses.\n\nThe salsa is a little too tame, the chips a little too greasy.\n\nThe chicken in the chicken enchiladas is EXCELLENT!!! If only the tortillas surrounding the chicken weren't so greasy (my Mexican grandmother would have told them that the oil they cooked them in wasn't hot enough). And I like cheese as much as the next guy, but they smother the enchiladas, beans and salad (with 1000 island dressing) with it, topped with sour cream. All these toppings don't do justice to the excellent chicken, rice and beans underneath.\n\nListen up, people! Mexicans use cheese sparingly, if at all, and even less cream! This place uses cheese & cream like some bad Italian restaurant in 1980s Ohio! \n\nThe daily special I had yesterday was \"pollo con verdudas\". \"Muy rico\" said the waitress. Well, it was my gringa mom's DULL chicken stew with carrots, potatoes and celery, not a hint of herbs, spices, peppers or tomato.\n\nTortillas are probably regional, but for me I found them a little too course and heavy.\n\nThe service is friendly, fast & efficient considering one waitress has to serve 2 huge rooms.", "author": "John G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-02-20", "description": "I stopped in at Gallardo's yesterday after a dance class. I was starving and had wanted to try their food. It was great. I ordered the cheese enchiladas which come with rice and beans and yummy green salsa. Many locals eat here. The service is friendly and quick. The prices are reasonable - $8.50 for this delicious meal. I will definitely be back to try the posole, etc. Also liked the photos lining the walls.", "author": "Roseann G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-12", "description": "follow the leader...unlikely find...across familiar nihon whiskey...enter gallardos...following advise...a trial and hope for no error....aged, but seemingly pleasant....greet and seat....smile and menu....already noticing a twist and variation to mexican menu....omelettes, scrambles and soups, and pancakes?!?...new to mexican breakfast and quick glancing around....what to order?....radar around...seeing scrambles, soup bowls gigante, pancakes...being safe and breakfast burrito trial....large platter weigh heavy....spoon salsa picante only option....meat and eggs filled....meat and egg heavy...scarce beans or extra filling....perfecto!...meaty egg burrito worthy of second visit.....a second visit within one week period....pancakes and scrambles next....standard american pancake thick chew great....lather syrup and butter pasting...mm...chorizo scramble bit dry while other scrambles looking finer....note for future order....steaming hot tortilla wrapping, beaning, ricing, lettucing and salsa'ing...bite and filling meal..worthy of third visit....soup next!", "author": "Hen A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-04-23", "description": "Ok peeps... this place is dee-lish! I am Mexican-American and am so PICKY with my Mexican food. I am lucky to say that my mom still cooks authentic Mexican meals 7 days a week sooo it's easy to compare the authentic to wannbe... Anywho... their enchiladas de pollo or queso are the bomb. chile verde is one of my favorites. Had their pozole today! SOpa de rez, just like my mommas, fajitas are very flavorful and healthy, home made tortillas to die for, beans and jalapenos are cooked with manteca (tastes like it mmmmm :) the only down side is they dont have agua fresca.. just fresh squeezed oj and carrot juice...their birria is good. my dad orders birria when we go here... lets see what else...carne asada is very flavorful... albondigas are yumm-o... cant go wrong here... good luck ya'all.. oh and dont try to go for dinner.. its just breakfast and lunch !", "author": "lupita r."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-04-29", "description": "OMG, Must try their beef or chicken soup, so good especially in the winter, and their salsa is awesome!!! Too bad they close sooo early...", "author": "Amy C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-03-23", "description": "We've been having lunch here for about 14years.  The food is very good and prices are very reasonable!!  However there is no alcohol served here.  They even serve breakfast.. the omellets are fantastic!", "author": "Catherine H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-10-21", "description": "Bland decor/ambiance....but that doesn't matter because you just need to order, eat and leave....huge portions of tasty, homemade mexican food. Had the seafood enchiladas....stuffed full of lobster, shrimp, and crab....red sauce with American cheese on top which seemed strange, but it totally works....dee-lish. Love to eat here when I'm in this part of the city.", "author": "EStar M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-08-20", "description": "i could not believe what reviewer fallopian swim team d. said about this restaurant.  i grew up eating mexican food that my grandmother cooked and i can tell you this is good food.  the portions are more then generous, the owner juan has really built up the business and has a large following.  as far as menudo, its good and certainly doesn't smell like old socks. i always recommend this restaurant especially for breakfast.", "author": "PATRICIA A."}
