{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-01", "description": "Everything here is DELICIOUS.  I especially love the sponge cakes, wife cookies, pineapple buns and, HOLY SMOKES, the egg tarts!! I come here every time when I  am in SF to bring some pastries home for my family. The price is good for my wallet also. :) I leave this place with a happy wallet and anticipating taste buds. Highly recommend!\n\nThey also sell birthday cakes and coffee! I have yet tried their birthday cakes, but they seem promising!", "author": "Janet T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-27", "description": "Got here around 10 or so and it wasn't too busy. Quick service when ordering but no paper bag or container. Ended up getting my Dan Taat on a napkin and wife cake in small bag. The lady on the other side was very friendly.\n\nDan Taat was solid and pretty standard. Could have been a bit flakier but the custard was nice. Ate the wife cake which was ok but didn't seem to have enough winter melon. Wished there was more in it as I do enjoy my winter melon and it's rare to find wife cakes that have winter melon in it.", "author": "Kimberly Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-20", "description": "BEST EGG TARTS EVER!!! Maybe I have weird taste.... but I like the egg tarts here better than the ones at Golden Gate Bakery and even in famous bakeries that I stopped by when I was visiting HK. The egg tarts here are warm, sweet, and pretty much just eggy goodness mmmmm. The pork buns are also really good and solid! I had some of their other breads (coconut bun, sponge cakes, other soft breads, etc), and they're all decent but nothing too amazing. Will definitely return for the egg tarts and pork buns. Probably doesn't need to be said, but this place is cash only.", "author": "Erica T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-15", "description": "Garden Bakery is a tiny bakery on Jackson and Stockton in the heart of SF Chinatown. I've passed by it many times and have always found it to be packed with local grandmas and granddads enjoying a coffee and an egg tart. Everyone here seems to have a coffee and exactly one egg tart that they are nursing. Anyway, a couple of days ago I decided to try their egg tarts.\n\nI was helped by a sweet old lady. When I asked for my standard order of 3 egg tarts I was told to get two more so that I could get a box. No problem, I'll get five. I almost fainted when I was asked for $4, which made these like 80c each. Exactly half of what you would pay at Golden Gate (that is when they are not on vacation of-course). It doesn't get cheaper than this.\n\nTheir egg tarts are a little different than Golden Gate. The crust is not the crunchy flaky type and the custard is a little firmer and sweeter when compared to Golden Gate's. These are like the tarts that you get in Eastern Bakery or Wong Lee Bakery. I personally prefer the tarts from AA Bakery or Yummy which are more like Golden Gate but that is a personal choice.\n\nOverall this was pretty good. I guess I need to stop by more often and get some more stuff from them and that is exactly what I will do in the near future.", "author": "Ahmad J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-11", "description": "I love this bakery located in the heart of Chinatown. As usual, it is a cash only establishment, but you can definitely get a lot for your buck here! I love how when I walk in, the ladies all speak to me in Cantonese. I do understand them, but speaking wise, I speak in terms of a 5 year old, but I still try. Their egg tarts are pretty good here for less than a dollar each. Their barbecue pork buns are really really good! It's a great proportion of bbq meat with the bun and it's so tasty even after reheating in the microwave. I love their pineapple buns here too. Very large and the crust on top is full of that sweet flavor. I've also ordered their wife cakes here and they're only 60 cents each! I haven't tried it, but it looks pretty yummy too. Can't wait to come back and order more buns!", "author": "Ada C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-08-29", "description": "A perfectly decent Chinatown bakery serving honest-to-goodness, down-home Cantonese baked goods. They're not going to be the best-quality stuff ever (like Kee Wah Bakery in the suburbs), but everything here, like the pork buns (char siu bao), egg custard tarts (dan tat), and pineapple custard buns (bor lor lai yow bao) are fine enough.\n\nThe venue itself is nothing to write home about - it's a long, narrow storefront with a glass display case, a few small tables with lots of Chinatown locals conversing over coffee (and judging you openly - it's the Chinese version of the outspoken uncles and aunts at your Thanksgiving table), and the working bakery in the rear. Whether you can snag a seat here or get your goods to go, everything is solid, dependable, and super cheap.", "author": "Vincent L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-18", "description": "You know it's the real stuff when a Chinatown spot is run by folks who don't speak English and their shop is regularly quite busy from all the older locals who hang around here.\n\nUnlike some of the \"modern\" Asian bakeries these days who charge you more in exchange for friendlier service and better wrapped pastries (looking at you, 85°/Sheng Kee/Kee Wah), this place just provides the bare bone Cantonese pastries and desserts.\n\nI usually frequent their pineapple buns, egg tarts, and cocktail buns, while I've never seen my roommate happier than when he left this shop carrying a big box of pineapple custard buns in one hand and devouring a single bun in the other.\n\nPrices have gone up over the years, but you can still find freshly baked warm buns and egg tarts for 50¢-75¢, which is a done deal for me!", "author": "Joseph T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-01", "description": "Everything was closed. It was open when we went on New Year's Day. The elderly lady said they only had 12 egg tarts left. Only $1 a pop. She ended up giving us one extra cause she miscounted and said \"ohhhhhh 13 lucky. Last one!\" The crust was flaky and the filling was creamy.", "author": "Thi N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-30", "description": "This is a local family business which running by 2 old ladies(Both of them looks over 70) , and i am its loyal customer. Every time when I go to Chinatown, i will get some egg tarts and pineapple buns from it. \n\nCompare to other bakery, Garden is a very traditional and old school one, you always see bunch of elders sitting inside with a pastry or coffee for 1 or 2 hrs. probably because the price is very reasonable here, like $0.9 for egg tart...Although it's not as famous as Golden Gate Bakery , the taste is super delicious, especially when they are warm. \n\nLast, but not least, the ladies owners always give u a big smile during serving U!", "author": "Andy T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-25", "description": "This is a freaking great place to go to. The ladies serving were very sweat and nice and we got a selection of baked goods in a pink box for under $10. What a steal for a reasonable price! All in all very happy with this place and will definitely be going back.", "author": "Liza H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-31", "description": "Very friendly. Fresh and baked daily.Locals hangout spot with coffee or tea to enjoy.", "author": "Frances H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-09-03", "description": "The bread here is delicious, but the service is inconsistent. If you don't speak Chinese, you will not be served fresh food. This has happened on more than three occasions. So, ask for FRESH bread and pastries. It is unfortunate that there is such oversight.", "author": "Jay L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-03-31", "description": "This place is SO SHADY!!!. Have been walking all over China town to find cocktail buns- finally and upon this place, and specifically asked for COCKTAIL BUN and the lady instantly said yes- filled a box with what we thought were cocktail buns- but only to find out when I opened the box in the car, she filled the box with PORK BUNS!!! Tried to take them back and she obviously knew she did it on purpose, telling us that since we took the box out of the store she can't take it back Nor can she give us a refund. It was the end of the day and she probably just pulled a fast one on us to get rid of her bakery items. DON'T BOTHER SPENDING YOUR MONEY HERE, they don't deserve it", "author": "Mona F."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-01-21", "description": "Bought two dozen wife's cookies and 6 Bbq pork. Lady at the counter kept pushing for me to buy coconut buns. Told her I didn't like coconut but she kept insisting. Total I was charged $20.50. the wife's cookies were $0.60 each. Not sure how much the buns were. I just paid and left as quick as possible as I felt the old aunties were trying to force me to buy more.", "author": "Nance_ E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-05", "description": "Pineapple buns are one of my staple weekday breakfasts, and this is where I get them. Their crust is full of eggy flavor and just the right crumbly texture. The bread is nice and fluffy. If you take them home and re-bake them in the toaster oven, they are heavenly! They are my favorite Chinese bakery to get pineapple buns.\n\nFor immediate consumption, their buns are freshest during the late morning. They keep them nice and warm in the warmer behind the counter.", "author": "Lovina C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-03", "description": "Best pork bun ever. I also picked up my guy an egg custard which looked delish. Super low key and full of locals not tourists! That's how you know it's good! 2-pork buns 1-egg custard $3 no complaints.", "author": "Michaela M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-11-21", "description": "This place is really meh... nice ladies and a decent variety (they're still selling mooncakes in November, if you really like mooncakes), but what we got was kinda meh ...the egg tarts 蛋撻 made me even sadder that Golden Gate Bakery was closed for the holidays, and we did not like the chick biscuits 雞仔餅 at all... I was pretty sad because my friend was visiting SF all the way from Alaska and I would have loved for her to have had really good egg tarts (Good Mong Kok Bakery was open, but were out). I also got almond cookies (never heard it referred to as 老公餅 \"husband biscuits\"** but maybe I'm just too ABC) and wife biscuits 老婆餅, and those were quite a bit better than the egg tarts and chicken biscuits. Maybe we got the wrong things from here. I'd check out other bakeries if i'm ever in Chinatown again though (especially if Golden Gate Bakery is closed... again...)\n\n* Note: there is a restroom in the back of the kitchen but they had no paper towels or toilet paper....\n\n** okay I looked up 老公餅 and what I got were definitely almond cookies (the one that comes in a pack of 6) but I said \"老公餅\" and she gave me the almond cookies. soooo I dunno. but they're almond cookies.", "author": "Melissa L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-06", "description": "Really nice people, felt welcome and it has amazingly reasonably price items. I would definitely recommend this restaurant if you are ever in town!! 10 out of five star rating!!!", "author": "Christine C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-28", "description": "Came here the morning of the lunar new year for some coffee and Chinese pastry. The place was packed with older Chinese men and women, enjoying the goods, sipping on jot coffee while hearing fore works go off! It was wonderful!", "author": "Mary N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-14", "description": "I came to San Francisco for a week and my breakfast consists of bread or pastries from a Chinese bakery every morning for the past six or so years. \n\nIt's interesting to know that when I walk in, the lady greeted me in English, and seemed shocked when I spoke to her in fluent Cantonese. \n\nI walked in and saw their 雞仔餅 (chick biscuits). A lot of other places sell it for $9, though, they were only selling it for $3. Coming from Toronto, I can usually get a bigger pack for $3, so i didn't buy it. \n\nI got the wife biscuit/cake, almond cookie and the sponge cake. My, oh my, the wife cake is a five star. The pastry was absolutely delicious as it was SOFT, not too rough on the edge, the outermost skin did not come off, it didn't taste a bit rough. The inside wintermelon paste was not sweet, there was enough filling, absolutely SCRUMPTIOUS. These are sold 2 for $1, so cheap!\n\nThe sponge cake was pretty good, it had a lot of egg in it which enhanced the taste. However, I would say it's a little more wet than the sponge cakes I normally eat, because when I put it out for the third day, it started turning a little soggy.\n\nTHE ALMOND COOKIES WERE BIGGER THAN MY FACE. Oh my goodness. These were the largest almond cookies I have ever seen! They have walnuts on them and were just MASSIVE. They tasted a little funny though, I'm not sure if the water in San Fran is different, or if the almond was different. It was good, but just a little different from what I normally taste. Did I mention they were MASSIVE?! For just $1 each too, what a deal!", "author": "Kristy N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-23", "description": "God dam, the best in the West when it comes to Custard pies man !! Woop, woop. So freakin delicious i don't know where to start. Golden crust, warm yolks, and not to overly sweet custard. OH MY GOD. All i have to say is, i'm going back for more. Yummy, yum, yum !!", "author": "Lex L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-27", "description": "Egg tarts are much better than Golden Gate's (too sweet for Golden Gate's) ... and it gives you the old tradition taste of Chinese bakery.  The atmosphere of the store gives you the right feel for the good Chinese bakery ... also the price is also a bargain.", "author": "Stephen L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-10", "description": "This place is wonderful. I come by a few times a week to satisfy my cravings for bao! The pastries are always delicious and the prices are very cheap! They have quite a selection to choose from, but you won't be able to see some of the items because they keep them warm on trays away from the counter. \n\nFrom here, I've had:\n\nWife cake/lou poh beng (60 cents): Absolutely beautiful. So flaky, and the wintermelon filling is generous and delicately sweet! My absolute favorite item from here.\nCocktail bun/gai mei bao (60 cents): Warm, soft, and the coconut filling is sweet but not overwhelming. \nPineapple bun/bolo bao (60 cents): The sugar crust is crunchy and comes off easily. \nCustard-filled bolo bao (90 cents): I got this on accident! But it was a great mistake because it was amazing. The bread was warm and soft and the custard was the right amount of sweet. Wow. Just wowww.\nEgg tart/dan tat (80 cents): Rather thick and flaky crust. Filling is good even when it's not fresh out of the oven. \n\nThe inside is often crowded with older folks chatting, drinking coffee, and reading the newspaper. It's really cozy inside. The ladies at the counter are nice and friendly too. I don't speak much Cantonese at all so I don't understand everything they say to me (aside from food-related things), but they're always welcoming and patient and greet you with a smile (Don't worry, you'll get along fine ordering in English too). \n\nOverall, it's a lovely and authentic bakery with delicious pastries and great prices. I always come back for the lou poh beng -- it's seriously the best I've had.", "author": "Melissa Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-15", "description": "One of my favorite bakeries in Chinatown that I grew up eating at. The amazing fresh breads are not expensive. A yummy bread can just cost $.60. One thing I dislike is their egg tarts, the crust tends to be thick instead of flaky. But overall you can't complain for $.80 egg tarts.", "author": "Melanie N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-08", "description": "Love their egg tarts, it's so tender!! $0.80 only! It's such a steal! And in the morning the entire cafe is filled with local grannies and grand pops. This is when u know a Chinese bakery is authentic (:", "author": "Rae C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-08-27", "description": "Since the Golden Gate Bakery was closed, we found this bakery to try out.  When we walked in, the woman behind the counter was asking us what we wanted.  I didn't like that we couldn't see all the buns she had available as they were in trays behind the counter.  We told her we would be back but not before she told us that her buns were good as we could see the place full of (older) people enjoying a bun.  \n\nWhen we went back, I wanted to get a BBQ pork bun and when we ordered it speaking Toishanese, she said here are 3; one for each of you.  Since they were a good price, we didn't refuse and paid for our buns and left.  I ate it a few hours late and it tasted fine, nothing spectacular.  If I was looking to buy one bun, wouldn't come here as I'm afraid she would sell me a boxful.\n\nOk bakery but not as good as the other we found a few days later in Chinatown.", "author": "Violet P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-10-23", "description": "Very small and narrow bakery. You can tell it's authentic chinese because of the chinese ladies behind the counter and chinese elderlys sitting and chatting in the shop. \n\nI got taro, lotus, and durian moon cake.  Cheaper than other bakeries.  Moon cake range from $4-6 each.  AA bakery prices were $6-7.50. \nTaro was the best imo, had taro flavor and it wasn't powdery. I liked it but my family didn't.\nDurian tasted more like mung bean than durian. I didn't like it.\nLotus had to be the worst one, it was made with brown sugar so the filling was dark brown and hard, not chewy, and didn't taste anything like lotus. Not good. \n\nCash only. Very small place. Get it to-go.", "author": "Yenn T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-28", "description": "This place leaves many childhood memories. My grandpa use to get me an eggtart here everyday afterschool. Whenever i visit my grandparents now and i feel like eating an eggtart, i come here! This is my favorite place to get eggtarts. The boss lady is very nice and always has a smile on her face. It is always filled with grandmas and grandpas drinking their cups of coffee while chatting with one another.  The buns here are very soft and delicious. Prices are relatively cheap compared to others. If you want something authentic, or a \"gift\" for someone from San Francisco Chinatown, you can't go wrong with this place.", "author": "Allie Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-07-04", "description": "The Baked BBQ Pork Buns here have meat with an interesting flavor: we suspect that the meat contains some sweet dessert wine. The bread is fluffy with a slightly hard outer skin. While the pieces of meat were big and chunky, there wasn't enough meat overall in each bun. Given their ridiculously low cost, this didn't come as a surprise!\n\nThis visit was part of a 6-person BBQ Pork Bun Crawl to a bunch of San Francisco's most popular bakeries. To read up on other bakeries we visited, check out my Yelp list: http://www.yelp.com/list/bbq-pork-bun-crawl-sf-san-francisco.", "author": "Mark C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-09", "description": "With Golden Gate Bakery closed again for vacation, I decided to try the egg tarts at this bakery!  Small bakery packed with patrons, I knew it would be good.  Indeed, it was good. It had a nice flaky crust and a nice sweet filling.  I would definitely go back.", "author": "Kaylin O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-04", "description": "Is it a destination bakery like that never-open iconic spot on Grant Avenue?\nNo... but, if you want a true local (capital L)  taste, you'll find it here.  From pineapple buns (bolo bao) to chicken tail buns (gai mei bao), this Marty McFly kind of place will take you back in time (https://www.youtube.com/watch?v=ZXN6tgE4g_4).\nIn the '70's and '80's, garment factory and restaurant owners would crowd this tiny spot for a cup of coffee and a random bun for their pre-work breakfast.  The chatter would normally be about family, friends, or work gossip and, if you wanted a Chinatown rumor spread quickly, just put the word out here.\nNow, it is mostly neighborhood retirees and your quick bite seekers who stop here.  My choices used to be their $1.00 for five chicken tail buns (gai mei baos) or their pineapple red bean bun (bo loh dao sa bao), but food prices have definitely increased.  \nIs it on a par with the Sheng Kee's or Wheat Field's (don't EVEN compare to 85°)?  Emphatic no, but it is certainly easy on the wallet.", "author": "Mike C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-04", "description": "There are a lot of Chinese bakeries in SF's Ctown.\n\nI was on the hunt for a good egg tart.\n\nAs my family was getting some Delicious Dim Sum across the street, I peered inside Garden Bakery. First thing I noticed was that there were Chinese grandmas and grandpas sitting on all the tables, just chatting away. I knew that if the locals come here, it must be good.\n\nI went in and got a egg tart for .70 cents. \n\nI bit into my tart and was please. The crust was flaky and buttery. The egg tart was soft and eggy. \n\nI was pleased with my egg tart! :)", "author": "Cynthia J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-02-15", "description": "Tried this an add-on to a egg custard showdown that I conducted with egg custards from 5 other bakeries recently.  I've gotten food here before, and my sister from out of town requested that I send her certain items.  After trying one of their coconut tarts, which was pretty good, I decided to get some egg custards from here.\n\nThe crust is very good - flaky, sweet-ish, and holds up well.  The filling was mediocre.  Custard had a slightly watery flavor (not as bad as some other places), subtly sweet, slightly eggy.  Overall a decent effort.\n\nLess impressed with their BBQ pork bun.  A little light on the filling, with an uninspired flavor and texture.  Coconut tart was dense and rich with flavor.\n\nMy only quibble with this place is that when I asked for a box to take home my stuff (I had ordered 8 coconut tarts and 2 sponge cakes, they kept on trying to put a whole bunch of egg tarts in there.  I kept arguing with them to take them out, but they insisted that they had to fill the box.  It got confusing after a while, and finally I relented.  As it would turn out, I ended up getting more food than I actually paid for, so I guess the hustle was okay in the end.", "author": "Lee L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-09", "description": "I happened to stumble on this place by accident as I was trying to get to some other bakery that supposedly had the best egg tarts, but they were closed. Luckily, we saw this place and I really wanted egg tarts in SF! \n\nWe went in and a bunch of people were sitting there eating some yummy pastries. I decided to get my egg tart and another one of my favorites, wife cake/sweetheart cake. My egg tart was delish...not too sweet with a flaky crust. I wish I had gotten more, but we were heading home that day. The wife cakes were delicious yummy winter melon/almond goodness. \n\nI think I bought about 6 wife cakes and 1 egg tart all for under 5 bucks. I was leaving and the lady was trying to give me my change back and the lady called me leng lui (pretty girl), but I told her to keep the change which she smiled a big smile. When I'm back in San Francisco, I know I'll be stopping by here again.", "author": "Brenda L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-06-12", "description": "Ordered 6 different items this morning.  Found BBQ pork puff and lotus puff got rotten.", "author": "for y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-24", "description": "Wow, I have not written about Garden? This is a no bueno.\n\nLet me tell you the side story of how I know about Garden. My mother's boss at the time brought back some wife cakes from SF and passed them out. Mother ate it and said it was one of the best tasting wife cakes she EVER had, not too sweet with enough flakiness. Because mother knew I went to SF every so often, it was engraved in my list of things to do is to bring home a dozen (or two) back to LA.\n\nI've been here twice, and both times that I have walked in, I was PROBABLY the younger customer. Lots of grandmas and grandpas sit around and chit chat, just like how any eatery place in Los Angeles Chinatown would have it. Placed an order for two dozen wife cakes and told them that I was taking them back home to LA. I had requested to put them in a bag, so it would be easier for me to stash away; instead they said not to worry and gave me the standard pink box, stuffing 30 cakes. The cakes itself were 2 for a dollar, which is a steal, in comparison to every other place in San Francisco AND any place that sells these kind of baked goods in Los Angeles. I believe the server gave me freshly baked wife cakes, since she had probably emptied out two trays just for my order. \n\nService was great; granted I did take advantage of my Cantonese speaking skills. Love the fact that they have a machine that does the ribbon binding! And probably the greatest of it all? One of the workers asked me, \"such a handsome boy, using the wife cakes to get a wife?\" If I could give brownie points for that comment, I totally would; five stars will have to settle.", "author": "Tom T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-17", "description": "I had wife and husband bun, pineapple bun and something she recommended but i forgot the name. Everything looked so fresh and authentic! People were having tea, bun and talking with each other casually! It reminded me of the old Cantonese lifestyle! This is the best Chinatown i've ever been to!", "author": "Chang L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-19", "description": "This is my favorite place in Chinatown to get wife cakes.  A wife cake is a cookie-like flaky pastry filled with gelatinous winter melon & sesame.  They are only slightly sweet but so soft & buttery.  They are my new fave Chinese treat!\n\nThe place is much smaller than Eastern Bakery or AA Bakery, but they know their baked goods.  The women who work behind the counter are very welcoming & the place is always packed with older Chinese folks.  \n\n2 for $1...you can't beat the price!", "author": "Erin S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-30", "description": "The moon cake with green beans was very good. Tasted like it was made not too long before.\nThe lady serving us was helpful explaining the ingredients of the different cakes.\nThere was no waiting time in the middle of a saturday afternoon.\nToo bad I could not find taro cakes though, the reason why I originally walked in!", "author": "Leslie S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-17", "description": "45 cents for pineapple buns and 70cents for egg tart!\n\nWhat more can I ask for?! So yummy!!!\n\nIf only prices were this low everywhere else in the Bay Area...=(", "author": "David W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-21", "description": "The only bakery that had egg tarts still available at 5 PM on a Sunday. I'll take it, because it's better than anything I can get from back home.", "author": "Tunaidi A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-09", "description": "Not a Chinese Bakery expert, but this place is definitely worth a try. I stopped by and had a wife cake. Pretty sweet and soft. Good experience for only $1!", "author": "Krystal P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-15", "description": "We stopped here kind of late for bakery hours on a Wednesday. I'm sure the woman behind the counter could of talked me into trying everything and was patient with me not knowing exactly what the pastries were. I ordered some pork buns and egg tarts, buns were very good, the egg tart was a little watery on top but very good as far as egg tarts go. I also ordered a mooncake that I saved for later. The bean paste filling was sweet, slightly nutty and really delicious. The pastry texture was thick and very moist. Would definitely come back to try the wife cake and some pineapple custard cakes next time. The prices were very very reasonable.", "author": "Ann K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-06", "description": "CASH ONLY.  I noticed that my Yelp friend Matt G. checked in to Garden Bakery the other day so I had to stop by since I was in the City.\n\nHe got some cocktail buns so I had to get them too.  I asked the lady in English how much & she said 5 for $2!!  Wow!  So cheap & they taste good.\n\nI asked about Pineapple Custard Bun & they have it!  3 for $5 Big ones, but I only wanted one to try.  They are good!  60c each if you don't want a lot.  Next time I'll bring more Cash & buy more!", "author": "Ann L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-11-30", "description": "Filled with locals (old Chinese grandmas and grandpas) when I visited on a Saturday morning. Their prices are pretty cheap, only $1 for a char siu bao, but that's reflected in the quality, with barely any meat inside the bun. Just lots of air. The sponge cake was also $1, and pretty good, the inside was nice and soft and spongy. I would probably stick to the more bready substances rather than the meaty ones because flour is cheap and they can't exactly skimp on flour.", "author": "Jenny W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-05-28", "description": "Another continuation of dim-sum hopping in SF Chinatown (4 bakeries in 20 min).  This time I tried their wife-pies.  There's probably a better English marketing term for them, but the literal translation is wife-pies, and they were super sweet.  Super sweet as in lots of sugar canes were used, so it depends on your preference.\n\nI didn't really like how dirty their cabinet windows looked (where they had all the baked goods).  Maybe I'm a bit picky, but many other places kept their windows clean, so the baked goods look a bit more appetizing.", "author": "Sam L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-25", "description": "We tried their pineapple custard bun today - yummy and only $0.60!  \n\nAlways love their pineapple bun - just look at the delicious crust, now just imagine sweet custard within the soft bun - YUM!", "author": "Gloria H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-08-28", "description": "It was cheap, and quick, but when you say 4 or 5 times cocktail bun, and she repeats it back to you..but you know there is a language barrier, but she gives you HOT DOGS..wtf. I understand i was the only white girl in the joint on a Sunday morning, but come on.. And pork buns, which weren't great, and an egg tart, which was small, and OK, flaky shell.\n\nIt was hell getting there to get them, and I certainly won't make the trek back to that spot.", "author": "Abigail W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-13", "description": "Still my only go to place for cocktail buns and pineapple buns.  Always fresh and warm.  I can eat those things all day.  \n\nCocktail bun - substantial fillings.\n\nPineapple bun - crispy thick top crust.", "author": "Janet S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-16", "description": "What's not to like about this place.  Two very friendly ladies in front who greet you in Cantonese with a (translation) \"Hey, pretty lady or good looking guy.  What can I help you with today?\"  They always have a smile and look you in the eyes unlike some other places in Chinatown.  So how can you turn them down when they say get a couple more of the same to make a half or whole dozen.  Good salesmanship.  If you don't want more, just say \"maybe next time.\"  Also, if you are not ready to order and looking thru the display case, don't be surprised if they help other people in line behind you first.  This seems to be the norm in SF Chinatown but at least when you are ready, they give you there undivided attention.\n\nBest egg custard tart, sponge cake, crème filled sponge cake roll, coconut crème rolls I've had.  Always brings back fond memories of when my mom would bring these pastries home after working in the city when I was younger.  Not overly sweet like at GGB where a line outside does not necessarily equate with greatness. Also, bigger is not better, just bigger.  You have to go to places like this where you see the locals eating, esp. elderly Chinese people. My mom used to try other places but she always came back to this bakery.  My go to place to bring back a box of egg custard tarts for co-workers.  They disappear almost immediately.\n\nYes, the bakery has lots of stuff not on display but be honest, you are most likely only going to ask for items you have eaten here or somewhere else and liked in the past.  And these are in the display cases.  If it's not displayed, it's probably not their specialty anyways and you'll go away dissatisfied.  Yes, they make baked BBQ pork buns but this is not a dim sum place.  It's okay but the filling is not as good as some other places.  My mom used to get these at some other place in Chinatown.  Pineapple bun (no pineapple inside) is okay too but I never liked this style of bun since sweet on top but dense and bready for the rest.  Preserved duck egg bun - not for the faint of heart.  The only other buns I know about are small steamed red bean bun or steamed sweet egg custard bun which I have never seen sold at this place but at dim sum restaurants.  I think that these only taste good hot and out of the steamer.  Would check out one of those dim sum carryout places if interested.", "author": "Ming H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-22", "description": "Besides the fact that the lady behind the counter cannot do math for anything in the world, the place is pretty good.  \n\nI ordered 4 egg tarts, 2 wife cakes and 2 sponge cakes.  I took them over to a friend's house and we reheated the egg tarts and the wife cakes in the oven and they were both pretty good.  Sponge cake was a bit dry on top, but still yummy.", "author": "Jenny L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-05-05", "description": "Originally came to China town for Golden Gate Bakery but they were closed for vacation. Since we we're in the area we decided to try something and not waste the trip, but I would've definitely passed on this one. I mistaken this bakery for another one that was specializing in pineapple buns. These we're alright, tasted like any other chinese bread but with a very very faint hint of pineapple which honestly goes away after one bite. Wouldn't bother coming back here again.", "author": "Alyssa M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-08-12", "description": "When you're in Chinatown, you will immediately know whether a place is good or not depending on how many people are inside/waiting in line. Chinese people are frugal after all haha. \n\nGarden Bakery is filled with people! Grandmas with their grandkids, grandpas drinking coffee and reading sing tao, moms rushing in to buy baked goods, etc\n\nThe pineapple buns just came out, so i asked the lady for one, but she recommended 3 (maybe it's cheaper to buy 3, or I just look like someone who would want to eat more than one) She also recommended a coconut dusted bun with cream going down the middle. I also got 3 Wife Cakes and 1 egg tart.\n\nhonestly, i didnt like the egg tart. the crust wasn't as flaky as I usually like them to be. the good part was they are not skimpy with the egg/custard filling. \n\nthe buns were really tasty and fresh. they use real milk, unlike other places. the wife cakes (also know as Sweetheart cake~ look it up on wiki, the story is really sweet) were soooo good (3 for $1.40) flaky on the inside and chewy on the inside. Service was super quick and my total was under $8", "author": "Connie M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-03-31", "description": "Pros: excellent Pineapple Custard bun. \nCons: no idea I ordered that because language barrier is enormous here.\n\nCame in asking for an egg custard. Clearly I didn't know what I was really wanting so I pointed to the tarts. Sensing it was a bun I wanted, she came out with this bun with a yellowish crumbly top. I insisted it was the tart I wanted. But she gave me both after saying \"this tart...this bun...custard inside\". I got it then. I was worried about that crumbly stuff but walked out with 2 items after paying $1.50. Ate the expected egg custard tart first and YUCK. This thing tasted like fluffy scrambled eggs in a flaky crust, not like a dessert at all. No sugar in that tart and the consistency was way too much like jello and not soft. I ate it but it was like eating breakfast again. I then was less excited about that custard bun thing. Well, I was wrong!! That was absolutely divine. It tasted like a Boston Creme donut inside and the crumbly yellow stuff was sweet and complimentary to entire \"bready\" bun! It was so good I went elsewhere yesterday for another \"custard bun\" only to find out that there is an actual REGULAR custard bun (without crumbly top) and PINEAPPLE custard bun and Coconut custard bun. I realized ONLY then that my custard bun experience was actually a Pineapple custard bun and not regular. Either way, yesterday I got the latter at A&K bakery on Stockton. I will review them now.", "author": "Vic W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-04", "description": "Loved this place. We ducked in near closing, and the very friendly woman behind the counter let us take our time choosing and highly recommended the coconut bun. We bought one along with a wife cake, mini bean paste moon cake, and mini lotus moon cake. All were great, but the coconut and wife cake were the standouts. Three of us split those four items and were very satisfied.", "author": "MaryE W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-03-25", "description": "Grabbed a quick bite here and picked up a Pineapple Bun (Boh Loh Bao). Although the bun was warm, sweet, soft, and fluffy, the topping was too thin and unsubstantial. This made the texture of the top more like a cracker rather than a crumbly streusel. I wouldn't say it's bad, but it doesn't really stand out from all the other bakeries in Chinatown.", "author": "Nei N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-20", "description": "Small mom and pop store.\nVery old school & traditional.\nSpeaking Chinese is a plus!\n\nFound website on my recent receipt: gardenbakerysf.com\n\nEgg tarts - very fresh! Tip: Ask the lady for the ones that just came out of the oven!\nPineapple bun - they are soOo fresh with the sweet crisp on the top! \nWife's cake - they make their paste fresh there... not the artificial paste from China. ...ordered a dozen and brought them to the office. it was gone within minutes! \n\nBusy place with many grandmas and grandpas chatting and sipping coffee all day...a hangout place.. waiting to pick up their grandkids. \n\nTip: Go when it's busy!\nCash only!", "author": "A A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-07-03", "description": "Good and affordable Chinatown Bakery. This place is the only bakery in Chinatown that carry day-old pastry at a discount price.  Buy a bag of day-old pastries and refridgerate and microwaved them and eat them for next-day breakfast\nLike most Chinatown bakeries, most the patron are older men, who left China and left their loved ones there and gossip all-day. This bakery is a huge hideout for Oldermen.\n\nOh,yeah Vitasoy is $1.00 each. Damn!!!", "author": "Matt G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-13", "description": "5 stars for the baked buns. I don't know of another place that can beat them on a quality/price ratio since it's high quality and very cheap.\n\nTry the cocktail bun and pineapple buns. They're usually kept warm and delicious right after purchase.\n\nEgg tart is okay (Golden Gate is better) and wife cakes are decent.\n\nThe ladies tend to stuff the breads into a bag so they get smashed. You can get a box if you order a lot (e.g. 2-3 dozen). But then those are compacted into the box anyways.", "author": "Alio G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-03", "description": "Pretty delicious. I love the egg tarts, sponge cake, and lemon filled jelly rolls. Staff is always friendly and slightly pushy when it comes to selling there goods but I don't mind saying no. I do not enjoy the BBQ pork buns here because there is far too many chunks of straight fat. So pass. Still searching for the best BBQ pork buns in SF boo!", "author": "Janet D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-02", "description": "UPDATE:\n...said leng lui's at Garden Bakery ON 5/31/2012 were CUSTOMERS!\n...I repeat, they were customers and not the staff.\n...now, back to your regular scheduled programming :D", "author": "Derek N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-23", "description": "My new favorite place for pineapple buns and Mexican buns!! Their pineapple buns' sugar coating stands out because I taste butter. I like butter. I therefore like their pineapple buns' sugar coating more than other places. But...I still buy pineapple buns from other places (AA Bakery, Hollywood Bakery) just to switch things up every now and then.\n\nTheir Mexican buns remind me of hot cross buns. When you toast them in your toaster oven to a certain point, the sugar coating is soft and gooey. If you toast it past that point, it gets crisp. I like them best when the sugar coating is soft and gooey.\n\nThe other important component of all sweet baked buns aside from their sugar coating is the bread, and their bread wins me over because it's soft, fluffy, and melts in your mouth. I think they use real milk. \n\nLast but not least, their buns are cheap. Cheap, cheap, cheap. And the workers are friendly and patient with indecisive people like me.", "author": "Christina C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-12", "description": "I've been to about a dozen bakeries in Chinatown, and Garden Bakery has the best buns in both quality and price.  \n\nI've gotten pineapple buns, pineapple buns with the egg cream, cocktail bun, some kind of black sesame (Canto: \"dao sa bao\"), and other random buns.  I've only had one so-so bun in more than a dozen times I've eaten here.  The egg tart, when fresh from oven, is better than Golden Gate, and it's only ~$0.70 compared to GG's way overpriced egg tart. \n\nRecommendation if you don't have a specific bun in mind: ask for a bun that's fresh out of the oven... you can't go wrong with that. =)\n\nGarden Bakery is ~25% cheaper than all other bakeries I've been to in Chinatown, and ~50% more delicious.  Hands down, my fav. bakery in SF Chinatown.", "author": "Sasuke N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-20", "description": "I'm a sucker for good bakeries...especially the Asian ones.\n\nThis place is diagonally across the street from \"Delicious Dim Sum\", and the lady at DDM actually referred me to Garden Bakery when I inquired about the classic \"dan ta\" or egg tart. They had plenty here, and for 70 cents a piece, it was cheap and good! I snuck one out of the box while in my car driving, and it hit the spot! \n\nI only regret not trying out their other goodies while there, but ah well. Next time!", "author": "Bruce C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-12-27", "description": "When it comes to Chinatown, my grandpa knows where the best bakeries are, and he suggested this place to me. \n\nI came here to grab a few buns to go for myself and grandparents. I got the regular Bo Lo Bao, custard bo lo bao, and even the Mexican bun (literal translation) \n\nGot them pretty fresh and they were delectable. I'll probably be coming here every time I'm in Chinatown.", "author": "Harriet W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-10-19", "description": "It's da Dahn Taht dude here!\n\n(oh yeah, dahn taht's are Cantonese style egg tarts)\n\n                                                  O  ---- Me LUV LUV LUV Dahn Tahts! \n                                                 ( | \\       Nom Nom Nom Nom Yom Yom Yom \n                                                  / \\\n\nThere are certain things in life that claim instant associations and recognition.\n\nLike fer instance\n\nPristine Mozarella Burrata ------------------- A16 (SF)\n\nSalt & Pepper Baked Dungeoness Crab ---------------- R&G Lounge\n\nPimp Sum -------------------- Koi Palace\n\nNigiri $u$hi ------------------ Ino, Sakae, Sushi Ran etc\n\nand last but not least\n\nDahn Taht -------------- Golden Gate Bakery \n\nBut when yo egg tarts of lore are currently not available at Golden Gate Bakery, because for some inexplicable cray cray reasoning, they CLOSE FOR THE REST OF THE YEAR (despite taking their annual month plus off typically during late summer/August timeframe), what's an egg tart crackhead dope fiend to do? Rich $lacker$ those folks are at GGB, yes...yes (oh hell if you're charging $1.10+ for a dahn taht receipe that no longer has that exact same flakeylicious layering like before because the original chef croaked and didn't really have good apprentices to carry on the crust receipe properly, and still getting lines for them like de$igner $prinkle$ cupcake$, you better be driving a Roll$ Royce, Bentley Turbo, or Mercede$ $ cla$$ ).\n\nAnswer: Ya $chlep it over to this quaint older neighborhood type bakery called Garden Bakery. \n\nSure, it's not the same kind of crack you're used to. It is as if like your sig other dumped yo crackity ass, and now you want some rebound hot monkey love, and expect some familiarity..... that Hong Kong style French ki$$ just ain't gonna happen.\n\nBut Garden Bakery's egg tarts are a bit lighter duty on the sugar, a half decent effort on the multi flakey layer crust, and not as shiny sexy golden blonde in the center (aka the sexual fanta$ie$ of most budding Asian male$)....as GGB's of course. Satisfying at the least.\n\nA side note, there are two schools of dahn taht crusts....the cookie outer layer, and the classical flakeylicious multi layer that is incredibly difficult to nail down unless you are brave enough to use LARD. \n\n                                                (\\____/)             \n                                                / O__O \\   ------ did someone say LARD for    \n                                              ( (  (oo)  ) )    egg tart crusts? OINK YEAH! \n                                               ` - . ---  . - '       \n\nSlotting the Garden Bakery dahn taht's at 3.5 SF stars, as it is easily way better than what one can get in the Peninsula or South Bay (which would be considered 4 star down here).", "author": "Ken K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-04-10", "description": "While everyone else waits in line at Golden Gate Bakery, I'll be here saving not only my time but my $$$ as well. I swear to Buddha they have the best pineapple buns here! (Sorry Sheng Kee). And the best part *drum roll* is that they're ONLY 0.40. Seriously... you can't even get a can of Coke for that price now. I also love, love, love their raisin bread which my cousins and I grew up on. I don't eat bbq pork buns but according to my boyfriend they are yummy as well. Don't take my word on it? Just look at all the old people hanging there, eating their pastries and drinking their coffee everyday.\nP.S. I would like to respond to the complaint about the prices of their mooncakes... that is CHEAP considering that most places sell them for about $3-4 each and that a box of good mooncakes can cost $20 and upwards. #seriously", "author": "selina n."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-05-13", "description": "Alright, so here's the thing: I. Love. Pork buns.\n\nAs a young art student dishing out the big bucks for a higher education, Garden Bakery is one of those incredibly special little places in the city that I'm especially thankful for. I can eat some breakfast there for something like, $2, and the (adorable/hilarious) old ladies working there are always super friendly to me and constantly try to fatten me up (\"you need more pork buns!\"). The place is, of course, a wonderful little \"whole in the wall\" institution that lacks pretentiousness and has a kitsch, homey feel, thus explaining their neighborhood cult following.\n\nBut let's talk buns.\n\nThey offer the BEST pork buns I've ever tasted, I think because instead of steaming them, the buns are baked. AMAZING! There's something aesthetically and more aromatically pleasing about the fact that they bake their goods which leads to a tastier pork bun. Plus, unlike the other bakeries in Chinatown, Garden Bakery pork buns don't make me feel like I've eaten poison (I'm looking at you, You's....).\n\nI love you, Garden Bakery.\n\nAnd you should, too.", "author": "Niku S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-24", "description": "I only had their wife cake a couple of years ago. It's better than other bakeries shop out here. I feel the SF bakery shops usually make this kind of cake very Americanized, a lot more so than those in NYC. More color, more red, the fillings are weird as well. So I think this shop is a bit better than others. It's located at the ramp uphill between Stockton and grant. A good exercise to get goodies.", "author": "Ashley C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-12-29", "description": "Look, if you tell me that I'm going to have a freshly made, warm egg custard tart and I get a lifeless cold play-doughy tasting egg tart, I'm not going to be a happy camper. Yes, I know this place is normally filled with old Chinese people - maybe their taste buds have gone to hell because you can't tell me the pastries here are any good. This place is like all the other places in Chinatown - complete hacks relying on their location to sell crap to tourists.", "author": "Henry W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-05-24", "description": "Most amazing egg tarts I've ever tasted. Will definitely make sure to swing by next time I'm in San Francisco!", "author": "Ed S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-19", "description": "Like the best egg tart in SF is at Golden Gate Bakery, this is the place to get pineapple bun! \n\nEvery time I order my pineapple bun, it's always given to me pretty much fresh-out-of-the-oven hot and soft (in a bag of course). Most of their buns that you don't see in the display case are usually handed to you nice and hot.\n\nJust a note that the ladies behind the counter who take your orders have very limited English. The place is small and always packed with elderly people occupying all the tables chatting with each other, so I wouldn't recommend this place if you want to have a sit-down snack, but who really needs to sit down to eat a bun? :)\n\nI would also recommend the custard pineapple bun, green onion bread, and the cocktail bun from here as well! Yummm", "author": "Am Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-15", "description": "Wooooot Garden Bakery. I use to come here all the time to get their delicious egg tarts each day after school in preparation for more after school studies at st marys. I use to live in chinatown, in ross alley, and it was very convenient for all of us to get bakery goods from garden bakery. Ever since I was a wee little toddler, I came here hopin for a fresh batch of egg tarts!\n\nas i recall, the egg tarts were very good. true they are not cookie crunchy like golden gate's bakery egg tarts, but they are flaky and delicious on their own accord. i would recommend garden bakery's egg tarts and pineapple bun over any other establishment that serves the same. \n\na definite must visit if u are in san francisco's chinatown. good eats, cheap price.. win\n\n-wifive-", "author": "simon k."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-04-12", "description": "I don't get the wife cakes.  They were boring.  Never had it elsewhere to compare but don't think I would care for them.\n\nCustard in the nai vong bao was really good but way too little custard for that huge buns.\n\nFinally, the egg tart was disappointing. It doesn't have the flaky texture like golden gate and the custard was too mild.  Texture of the custard was good.\n\nOverall, maybe a 3.5 stars for the value but not a must-have.", "author": "Will W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-03-09", "description": "Your standard Chinese bakery.  Any bao you can think of is probably sold here at a decent price.  Pretty good regular dan ta (but no Portuguese style).\n\nI might have given it one more star had it not been for the fact that you have to order a minimum of 12 items if you want your goodies in a pink box.  Cheap bastards.", "author": "Tiffany H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-09", "description": "I come here for their GIANT almond cookies (they translated it as walnut cookie) for $1.25!!! It's HUGE!l Almost the size of your face HUGE!!\n\nI didn't know about their pineapple buns. Darn, I wish I read the reviews before I went there again. This place is across the street from this all you can eat dim sum place and next door to Ming Lee Trading Inc (which is also a cool place to check out)!!!", "author": "CeCe C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-27", "description": "Authentic old Tyme  Cantonese classic cakes and cookies.  Best wife cakes lo po  beng and preserved egg cakes pai Dan so..  It is a hole in the wall with many neighborhood regulars especially seniors with grandchildren.. If you understand Cantonese and toisanese the conversations are warm and homey and funny.  Don't let the crowded old place fool you .   it is the best. People from out of state buy their cakes and cookies by the dozens to take home and share especially the Lo po beng and pai Dan so.", "author": "Cynthia Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-01-24", "description": "I was sitting in my hotel room one day watching Friends and then I started craving for some Chinese baked goods. So I went on Yelp and searched for bakeries within the proximity of my hotel of course and the reviews of Garden Bakery really grabbed my interest. So I ventured along the streets of Chinatown San Francisco following the directions from Google maps, and finally I reached the bakery all eager to try out their baked goods.\n\nI ordered two egg tarts, two wife cakes, a coconut tart, and a cup of tea, which came to $4.75. Although the price was pretty good, I can't say I'm a fan. The treats weren't bad but I was a bit disappointed, because everyone was talking about how amazing the egg tarts were but I found them to be average, in fact I've tasted better. Their coconut tart was okay too, a bit better than the egg tart but not very outstanding either. The tea was average, I could make the same tea at home. However I did find their wife cake pretty good, and if I was to return to the bakery, I would probably just buy the wife cake next time.", "author": "Linh T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-06", "description": "My dad recommended this bakery to me yesterday when I asked for a place with a good selection of buns. I walked in here and it was full of older persons sitting with friends enjoying breakfast with their coffee. \n\nThe buns I wanted weren't on display, so it may be a hassle to have to ask which  buns they have available. They brought out fresh pineapple buns and I knew not to hesitate. \n\nI also got the green onion bread and my total came out to be $1.10, sweet!\n\nThe service was quick. I didn't even have the chance to look at my options when the lady helped me, which is nice from the usual hassle of Napoleon bakery.", "author": "Connie C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-03-09", "description": "i was in the neighborhood and saw that the bakery was still open after 8pm on a monday. i was craving for some cocktail buns so i decided to go in and check it out. i noticed the trays of baked goods were filled up like they had just opened.\nthe lady who was helping us was nice, though i felt she was pushing me to buy more. well, i ended up buying an egg custard tart and pineapple bun along with 2 cocktail buns. \nthe cocktail buns were pretty good, reminded me of wonder bakery's in oakland's chinatown. \nthe pineapple was really light and fluffy. i enjoyed that, im sure it wouldve been amazing if it was served warm.\nthe egg custard was okay, definitely had better elsewhere.\nits a cool bakery to go to when all the other bakeries are closed and its cheap!", "author": "Anita W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-26", "description": "What's not to love about a $0.70 egg tart? I've always walked past this little cafe in Chinatown and I'm glad I walked in! The people inside seem to be loyal customers and the cafe itself is quiet and charming. Lots of seats here!", "author": "Jason T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-02-12", "description": "Okay so I've definitely tried a lot of places in China Town for their baked goods and this one is my favorite!  It's a bit more in the cut since it's not on the main streets like Grant or Stockton but it makes it better to enter because you aren't feeling like you're in a stock market exchange holding your dollar bills out trying to get what you want amongst all the chinese folks who actually know the language...  you're in an advantage!\n\nSo you walk in, and there a bunch of Chinese grandmas in the front and more Chinese grandpas in the back all enjoying the tasty baked goods and coffee.  I love it, it actually reminds me of my future once I become a grandpa, but ain't happening for another 30+ years.  Haha!  Finding your local neighborhood bakery and enjoying the company of your old time friends over what used to be cocktails and beer in your 20s which is now coffee and pork buns.\n\nAnyways, pork buns at 0.70 cents, self-serve coffee at $1.25, chinese cookies at 0.25 cents, cheese rolls at 0.60 cents, etc.  Nearly all their baked goods are under $1 for one.  They taste really good too!  I enjoy coming here and the 2 women always try to get me to buy more... it's quite funny actually!  Happens all the time!  Anyways, while I live in Nob Hill, I'll still try to find out more spots in the bustling China Town but I'll always make my way back here...  Check it out!", "author": "Limzer L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-04-12", "description": "The buns and egg tarts are not even up to standard.  Cheap, but disgusting! Take a look inside and one word..... dirty.  I don't know how reliable these environmental health scores, but I found this: High risk vermin infestation High Risk 22-JAN-13.", "author": "Cece Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-20", "description": "I had to see what all this hype about \"wife cakes\" and egg tarts were all about. I've never had one so I can't really compare...yet. But they were both delicious. Wife cake had chewy texture on inside. Looooved it. And egg tart did not sound so appealing but I believe my fatness may have gone up with this new addiction. Flakey crust....oooh. \n\nOh and I went in before work so about 830am and there wasn't a line but lots of older asians having their breakfast snacks at table. So it must be good. The ladies at the counter are not that bad..just point at what you want. Sucks that they don't smile or are more friendly. Maybe I'll learn some Chinese words to brighten their day!", "author": "Lola D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-05-02", "description": "I bought about 18 breakfast buns here (rolls, raisin bread, green onion bun and pork bun).  The lady offered to put 12 buns in a pink box but she stuff the rest in a plastic bag (huh?  I don't get that.  I just spent $8 and you're too cheap to give me a box?).\n\nGreen onion bun is made up like a braid (not the usual round version at other bakeries).  The bun is pretty flat but it's stuffed with green onions.  They don't mix the ingredients well enough cuz certain parts of certain buns are more saltier than others.\n\nRaisin bun - they cheaped out on the raisins.  I counted maybe 4 in the whole bun?  What the heck is that all about?\n\nPrices are on par with other bakeries (maybe even cheaper than Washington St. Bakery and those so called \"high end\" places).  I deducted one star cuz the lady cheaped me out of a pastry box!", "author": "Wendy H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-02-06", "description": "This place has been my mama's hub for the last 20+ years. I think this place rocks off the hook (baus), my favorite would have to be  (dou sa bo low bau, (red bean in pineapple bun), dahn taht (egg tarts) and ling moong dan kuen (lemon favor cake)\nI grew up here... so this is my hub as well as my mama's hub. \nThe boss lady is super nice, and so is all the workers who work there! Kudos to GArden Bakery\n\nNo Parking in CHinatown. Walk please", "author": "Monika T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-26", "description": "after some horrible dim sum, i felt like i needed something sweet to get rid of the after taste left in my mouth from pearl city...my dad told me that this place had some of the best bakery items in chinatown.  \n\negg WHITE custard tarts...wow, i never knew that this existed!  we took one of each...one of the regular and one of the egg white...$1.10/each.  these tarts were a good size.  and they were also super fresh!  \n\ni was looking for some steamed buns but didn't see any...but the baked ones looked just as great.  next time when my meter isn't running on empty, i'm definitely heading back to grab a few more to munch on!", "author": "Jen W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-27", "description": "Excellent Wife Cakes (Low Por Bang)- a few layers of light and flaky on top and then you bite into the center that's soft and glutinous.   The outer layer is not oily but a nice flaky few layers wrapping the cake in a perfect package.  There are small shred of the wintermelon (maybe even coconut)bits through out the cake.  The center is the perfect consistency, not too dry, watery or chewy. \n\nTheir pineapple bun is also very smooth and light through out the bun.  The sweet crust does not crumble off the bun and has great flavor.  Excellent fragrance.\n\nOne of the least expensive bakeries in Chinatown!", "author": "Eva W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-09-16", "description": "We were in SF China Town and decided to buy a snack.\n\nWhile wandering around, we saw this place packed with locals ( or Chinese people) and mostly in their 60's.\n\nSo we decided to try it out.\n\nAt first... we have no idea on what to order. It's a pressure because we look like tourists (obviously we are) and the customers are staring us! uh huh.\n\nSo I said \"4 of this and 4 of that\" hahaha! I found it out that it's called mooncake. To be honest, we have a language barrier here because we didn't understand each other that much. She pointed another item and talking to me in Chinese and she said it's good. I was like...no.... (smiling). And she said \"yes?\". And I said yes... and she started grabbing those items! Oh no! So ok... I said \"just 2 pls!\" And she said... 4??? good! No... 2 (with a peace sign). \n\nSo all in all... I paid 10 bucks. I was expecting like 5 bucks only...ugh. 10 bucks for a snack is way too much (for me at least). 1 dollar each? And the mooncake are like 1 inch in diameter.\n\nBut taste wise, it's good. I deducted 1 star because of the price.", "author": "Thigh C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-08-04", "description": "popped in during an impromptu baked bbq pork bun tour in hopes of finding a cheaper alternative to Great Eastern. \n\nwe got  2 buns, 2 egg tarts, and 2 wife cakes. the total was $3.80, so pretty cheap. the buns were big and not too bad, but the bread just can't compare to Great Eastern's buttery magic. they were bland and dry in comparison.\n\nthis was my first time having egg tarts and wife cakes so i'm not sure how to judge them, but the egg tarts were ok. flakey, though not light by any means. there was a lot of filling, which i have read people liked. and the wife cakes were definitely flakey with a thick jelly center. interesting, just not my cups of tea. \n\nthey have huge vats of steaming hot coffee at the counter with DUN DUN DUN non-dairy liquid (not powder!) creamer--i applaud them. usually you have to go to starbucks or a pretentious cafe to find dairy alternative creamers (and NOT that powder shit) but here's a small moms and pops shop that's looking out for us lactose intolerant and dairy-allergy folks. not to mention the ladies behind the counter are really nice and speak english perfectly fine. other shops in chinatown don't offer the same friendly service, so it was rather nice and honestly shocking to have them say \"bye! have a nice day!\" as we left.", "author": "Melissa N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-03-13", "description": "Came here to grab a quick and small bite to eat, so that we would have room to fill our bellies with more SF deliciousness. We didn't know anything about Garden Bakery at the time, but it was pretty crowded so thought that was a good sign and decided to give it a whirl. \n\nI was SUPER excited because they had nai wong bao (bread with yellow custard inside) and we had asked at two other bakeries, both of which told us they didn't have any. I stocked up with five. They are me and my bf's faves.\n\nWe also got three pork buns, and a wife cake -- all for eight dollars. \n\nAnd the pork buns were very flavorful, and still warm, yum yum!  A perfect snack before eating more! haha\n\nI will make a mental note of this bakery for sure, although I still favor the dahn taht at Golden Gate, this will def be my SF go-to place for my beloved nai wong bao.", "author": "Erin M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-11", "description": "My mom buys from here, only thing is she doesn't  like the patrons always gossiping  cause she and I know the language.  I ate this stuff as a kid and eating it again as a grown man.  The cocktail bun is what I remember because a long narrow bun with sugar inside, I mean a lot of sugar, but nice and warm, kept in a warming oven.  If you get lucky, you get some that the rack they just pulled from the oven.  Now, those pineapple buns, they don't  have any pineapple  in them, it's just a name.  It's a bun with sugar melted on top.  The pork bun is ok, big but the pork is not high grade, meaning sometimes bits a fat, it's ok to spit out.  They have other stuff like moon cakes if you are adventurous.  Ask them to let you look at the hot b us inside the warming oven and you decide.  These breads are less then $1 a piece, so it's not going to break the bank.if you try it and don't  like it, it can't  be that much of a lost unless you are a drama person.  Hey, it's a learning experience.  People who reviewed this place take it too serious, don't  worry, be happy.", "author": "Rey D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-05-23", "description": "Best buns ever. The custard buns are so flavorful and not just a cheap custard squirted in the center. Ate what I bought and bought twice as many before leaving.", "author": "Andrea M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-29", "description": "I came here for an egg custard (dan tat) on an early, very rainy morning. Chinatown may seem dead on a Saturday morning if you don't know where they hide the good stuff. At 70 cents apiece (as of 3.29.14), this is probably the best deal you're going to get for an egg custard in Chinatown. I figured this must be a pretty good bakery because I didn't see anyone inside who looked like a tourist. There are about 4-5 tables inside that were all taken by people who, I'm assuming, were from the neighborhood. They must know best, right? The woman behind the counter was very nice and spoke English very well (spoke Chinese to her anyway...). The egg custards were fresh and and the crust was perfect. There were several other types of pastries and cakes to choose from. I only take away one star because, well, it's Chinatown. It's very old. I don't expect a lot and it doesn't bother me but some may not consider many of the restaurants in Chinatown to be the cleanest. But, hey, what do you want? It's a 70-cent egg custard.", "author": "Hilary C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-04-18", "description": "This is my favorite bakery in Chinatown. Yes, I like it better than Golden Gate Bakery. The lines are never crazy and the buns and pastries are fresh and cheap. Everytime I go there, people are always buying fresh Mexican buns. I tried one, three for a dollar, I believe. Crisped and sweetened top, soft inside - delicious. I also like their wintermelon cake (aka wife cake) here vs all the other places in Chinatown because I like the filling's smooth and thick texture. Other places rarely have any filling. Their custard buns are kept in the oven along with the pork buns and other buns, so if you order the, you get them nice and warm.\n\nJONASAPPROVED!", "author": "Jonas T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-02-06", "description": "This is my favorite breakfast stop in Chinatown on my way to work.  It's a complete hole in the wall bakery with cute old Chinese folks hanging around all day long drinking tea and eating buns.  It's never super crazy like other bakeries (i.e. Napoleon Bakery) and the ladies who run the front counter are very nice.  They take orders according to whoever comes in first rather than those damn impatient line cutters!  I also like that they keep their pastries nice and warm throughout the whole day.  I usually order the oatmeal raisin bun and sesame seed bun for a grand total of 75 cents!  My other favorites are the cocktail bun and Mexican bun.  Yum! \n \nThe only problem with this place is that you need to know what pastries you want ahead of time and it's a big plus if you speak the language (I think that pretty much applies to most of the places in Chinatown).  They don't have all their pastries laid out on the display with labels in English like many Chinese bakeries, so you can't point what you want.  If you want to check out Garden Bakery, be sure to do your research on Chinese pastries ahead of time.  It's totally worth it!", "author": "Amy T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-23", "description": "I've been coming to this bakery for over 10 years now and its still my favorite. I use to always get the cocktail bun, but now i get the pineapple bun with the different fillings inside. The crust on the pineapple bun from Garden Bakery just taste so much better than any other places I've tried before. As for the service the ladies working there are always nice and always encourages you to buy more and more! If you're looking for a place in chinatown with cheap and good buns this would be the place!", "author": "Bruce L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-07", "description": "Possibly the freshest, fluffiest pineapple buns and cocktail buns in SF.  Yum!", "author": "Melinda C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-30", "description": "Great place!  Super friendly, fresh baked pastries, total hole in the wall.", "author": "Brian A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2005-08-10", "description": "I love this place like I love the scent of Chinatown. It's this wierd smell that you can't avoid, but can bear. But again, it is a scent. The food is really good, and cheap for  Chinese baked goods, but beware of the lady who works there, she'll overload you with more than you want, and then charge you for it unknowingly because she doesn't tell you. \n\nSo for any of my non-chinese speaking Yelpers out there ever chance upon this place, beware! And check your bag or box before going away and paying, otherwise you might get gyped. Oh yeah, don't buy drinks here, more expensive. There's a place across the streets with bananas hanging outside it's store that has cheaper drinks.", "author": "Michael C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-03-26", "description": "40cent pineapple buns! I find their crust a bit crumbly (it falls off the bun a bit easily), but it's still delicious :)", "author": "Clarissa L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-26", "description": "I'm a fan of this bakery; it's one of my favorites in Chinatown. My favorite thing to get here are the egg custard tarts (dahn taht). They are cheaper, has a shorter line, and open all-year round compared to Golden Gate Bakery. They also have a variety of other breads, pastries, and cookies that are very good too.\n\nConsidering this is Chinatown, you wouldn't expect excellent service. However, they are very nice here and they do everything with a smile. \n\nThis place is where older Chinese folks go to have snack, gossip, and relax. This place is crowded. All of these things are definitely positive.", "author": "Kimberly N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-05-19", "description": "I go here for the egg custard tarts. It's 1 of 2 places in chinatown i like for bakeries.. btw,  quality is just as good as golden gate bakery, a place i think is way overrated!", "author": "Lina C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-07-06", "description": "Had the egg tart, cocktail, wife cake.  Loved the egg tart and wife cake.  If you can suffer through poor service, Napoleon Super Bakery might be better for wife cake.  Here was the best service I got out of 5 bakeries in Chinatown.  Really sweet lady.  Place was terribly crowded, yet she put up with my indecisiveness at the same time of another customer.  Really cheap stuff that's good!", "author": "Missa P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-08-07", "description": "DELICIOUS pineapple buns and egg custards. They are the only bakery that I know of in Chinatown that actually uses real milk in their buns. It makes a difference.\n\nHowever, if you prefer the sheen that other bakeries may put on their buns, they don't have that. I actually prefer it that way, because then it doesn't get your hands all nasty if you're trying to eat it while walking.", "author": "Andrew T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-10-18", "description": "Go to Golden Gate Bakery instead.\n \nPros:\n-Cheap (I got 4 pastries, they were big and fat too for only $4)\n-No line.\n-Asian pastry - I love it!\n \nCons:\n-no one speaks English (given)\n-slightly rude, but it comes with the territory (OB~viously!).\n-no parking\n-not freshly made, it is fresh but it's been sitting there", "author": "Jennifer S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-05-20", "description": "ah, garden bakery...how i miss thee. most of my fondest childhood memories involved a pastry or two from here. i remember walking past this place every morning before school and smelling the warm aroma of fresh chinese pastries, till this day they are still churning out yummy and cheap goodies. some things have changed a bit of course, a cocktail bun used to sell for a quarter is now $.40, but hardly worth mentioning compared to the more famous shop around the corner that sells their buns for $.75!!! i wholeheartedly believe that their egg custards(dan tat) are tastier than golden gate bakery's. and for half the cost, you can do two rounds of testing to decide.", "author": "Melissa Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-05-18", "description": "I'm surprised there is so little reviews here. I personally think Good mong kok is a little hyped. Anyway this is a review for Garden Bakery so lets stay with the subject. \n\nLOVE their cocktail bun and pineapple bun. They have 3 types of pineapple buns- plain, custard fill, and red bean filled. We like the red bean filled but any of the pineapple buns are good. \n\nYou know chinatown, their customer service is not their top priority here but surprisingly, this place gives very good service and with a SMILE! yes, shocking isn't it? Owner is super nice and the worker here are also very polite and nice. We only buy our cocktail buns and pineapple buns here.   Oh but for steam buns we go to yong kee. Egg tarts we go to golden gate bakery. But yes come here for your baked pineapple buns, coctail buns and other baked goods.", "author": "Ailin N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-09-29", "description": "This placed is packed with old chinese locals. The pineapple buns are supposed to be good here.  Its was alright, pretty decent, above average.", "author": "Dijon Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-01-11", "description": "Pretty good sponge cake and egg tart at Garden Bakery.  It is crowded so know what you want when the lady points at you.  Reasonable prices too.  Across the street from Delicious Dim Sum.", "author": "Aaron T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-03-27", "description": "This place has the best cocktail buns and pork buns in the bay area and the price is really good ($13 for a dozen of each).  Every time I go to Chinatown, I make sure I stop by here and get some food.", "author": "A W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-12-21", "description": "This place has been in business since I was a Kid!  This is where all the locals come to hang out with their friends and enjoy a hot cup of tea and chinese baked good.  I like coming here for their Char Siu Bows (baked bbq pork buns) and their coctail buns (butter, coconut, and sugar).  No nonsense service and can get pretty crowded in there on the weekends.", "author": "Henry S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-06", "description": "This place is good and cheap. More meat in their BBQ bun than the ones at Anna's. You can buy 3 pineapple bun or 3 Mexican style bun for $1.20. Can't remember how much the BBQ bun is but I think it was .60  or .65 cents.", "author": "Jay S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-06-23", "description": "I LOVE their Pineapple buns!!!  They have the BEST pineapple buns in the city!  For those of you who have not been here before, you might be intimidated because there are A LOT of seniors in this place drinking cheap coffee and enjoying some seriously good buns.  Their counter is practically filled with baked goods.  I come here mainly for the pineapple buns.  Just last year, you can still get 4 for $1!!!  25 cents for one bun!  That is so ridiculously cheap.  But now they've raised it to 40 cents each, but they're still worth it.  Their other buns are good as well.", "author": "Katniss B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-06-05", "description": "When I first saw the the name \"Garden Bakery,\" I thought it's an outpost of the large commercial bakery with the same name in Hong Kong. It turned out to be a really traditional bakery that sells Hong Kong-style pastries. As a Hong Kong native, I crave Hong Kong-style pastries every now and then and after trying numerous places over the Bay area, I think it's one of the best. The almond cookie was infused with almond flavor (often missing at many other places), crunchy yet not greasy. I also tried their pineapple bun, custard bun, sweet raisin roll, and spring onion roll and they were all pretty good. I'd say the pineapple bun had less filling that I expected, but the bun itself was huge. The lady manning the counter was very friendly the last time I went there probably it was past 7 pm and the place was pretty quiet. I speak Cantonese and we even chatted a bit. The place really reminds me of what I perceived Hong Kong to be like in the 60s and 70s, so if nothing else, go check out this place and sit at one of the tables with a cup of coffee or Hong Kong-style milk tea just to get a feel of the ambiance.", "author": "Ed C."}
