{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-28", "description": "FOOD: 3.5 stars\nSERVICE: 4 stars\nPRIVATE ROOM w/ TV playing the Warriors: 5+++ stars!\n\nCame here on Saturday night with my family for a birthday dinner. Since we had about 14 people, we got one of their private rooms downstairs. The room was spacious and fitted 2 tables; a big one seating us 14 very comfortably and another kiddie table seating 5. The room was decorated nicely with Chinese New Years decorations. It was clean and super accommodating. We loved how they had a big flat screen TV playing the Warriors but with Chinese commentators. lol. \n\nFOOD (in order with pics): \n- pork bone and meat dipped in sweet&sour sauce\n- sauteed beef with bell peppers and mushroom\n- fried egg yolk\n- walnut prawns\n- stir-fried black bean clams\n- white meat chicken \n- snow peas\n- stir-fried water spinach w/ fermented tofu\n- sweet and sour pork chops\n\n- shrimp with eggs dipped in jalapeno soy sauce!\n- salty egg yolk crab\n- fried fish head from the snapper\n- whole red snapper fish \n\nMy favorites were the snow peas, water spinach w/ fermented tofu, sizzling beef, sweet and sour pork, red snapper, fried fish head, and black bean clams! Everything was flavored and seasoned just right. The salty egg yolk crab and shrimp was a hit amongst my family. The fried fish head from the snapper was fried nicely with mushrooms, garlic cloves, onions, and bell peppers. The red snapper took the longest to come out. It was our last dish and spaced out 15 minutes so we were like \"what is going on..\" lol. The red snapper was super pearly white and soft. I purposely saved a third of my bowl of rice just to eat with the fish so I can submerge my rice in the fish sauce and green onions. It was delicious. \n\nWe had two servers throughout our meal; a man and a woman. they were both very attentive and came regularly to give us water refills, napkins, etc. The TV playing the Warriors was definitely a bonus. In total, for soup, 13 dishes, dessert, steamed custard bun, oranges, the bill was ~$600 with gratuity. Very worth it cause the food was delicious, portions were generous, service was attentive, and we even left with 6 boxes of leftovers!!\n\nP.S. Did I mention how fluffy and tender their rice was!? My family especially my mom and grandma raved about how perfect they cooked their rice and couldn't stop eating it. When your momma and g'ma is constantly talking about the rice, you know its some damn good rice!", "author": "Anissa D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-18", "description": "Chinese comfort food? This is the place to go. When you first walk in, there is a nice asian atmosphere. (Not like you're not getting it all over china town). The tables are nicely spaced apart, and everyone isn't just squeezed together. All the food on the menu looks amazing, but if you're not sure what to get your server does have recommendation. If anything else they might just cook up something special for you. \n\nWe ordered a lot of food. Their boiled shrimp is really good. The shrimp they serve here is a bit different from the ones your can normally get from a grocery store. The shell is a bit harder, the meat firmer, and sweeter. \n\nThe vegetable is cooked very delicious. I love their bitter melon dish. My family and friends love the pickled cucumbers. I totally recommend getting a couple of them. \n\nThe fried pork and pork shank is good as well. It is lacking a bit more flavor, but if you do have left overs, you can take it back home to make congee or just reheat it up for other things. \n\nIf ordering family style is not your thing, you can definitely order the typical none traditional asian food. I've seen other people eat orange chicken and those stuff. \n\nI'd totally come back here again.", "author": "Drew R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-10", "description": "We had a group dinner here on Monday night. The beautiful thing is that the restaurant is right across the street from the Portsmith Parking Garage so parking is very convenient.\nThe place has been remodeled and has a fresh look.\nThe food is pretty good as far as Chinatown Chinese food goes and we had an abundance of everything.\nService was excellent and the plates were timed well.\nI had a very nice time dining here,", "author": "Dirk D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-10-18", "description": "There are hair in the dish served. I ordered Szechuan Beef rice (lunch menu). Saw hair in the dish. Super disgusting.", "author": "Zhipeng Peter Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-09", "description": "Familiar dishes, we had sesame chicken, beef and broccoli, spring rolls and a refreshing cucumber salad. Nothing \"strange\", and food can get adventurous in chinatown!", "author": "Ruth P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-02-25", "description": "While watching the Chinese New Year parade, this restaurant caught my attention next to our hotel. It was quite busy and Yelp pictures showed many dishes that looked appealing. The place was packed and the servers were hustling to wait on people. One in particular seemed to be the boss and her objective was to serve as quickly and possible and disregard giving good service. \nWe ordered duck, ma-po tofu, chow mein and green beans. First time having a duck and the last time. Tofu dish was greasy but the other two dishes were good. \nI was looking for other dishes that I saw in Yelp no longer exists.", "author": "Joe K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-07", "description": "Great service!! Food was amazing! We are so happy we found this place! Having Never been to Chinatown, we had some recommendations from our hotel concierge. The restaurants recommended had long lines, and wait times. We kept walking and looking... found this sweet little restaurant. We were immediately seated and brought tea. Food was fabulous, highly recommend.", "author": "Karen J."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-10-10", "description": "I have eaten at The Garden numerous times over the years and it used to have great food and good service but this last time, the service was so bad, I will not be returning.\n\nThe two of us came for dinner on Sunday night around 7:30pm. The place was packed and there were a couple of other people waiting for a table. We stood there as the servers ignored us. We waited patiently for about 10 mins before being sat at a small table. Then we waited for quite awhile as the 4 servers walked back and forth but still not acknowledging us. Then a female server who looked grumpy came to our table and practically slammed our plates and chopsticks and tea cups down on our table. She did not say a word although I smiled and thanked her.\n\nWe had no idea who our server was. We saw one take the order of another table who came in after us. A male server finally took our order. We ordered chicken fried rice, kung pao chicken, seafood won ton soup and lobster noodles. He rudely said we ordered too much. WTH!!! He's not the one paying!\n\nThe food came and our small table was cramped with all our plates. No one came to check on us. My friend had to ask for more water but was basically ignored. Then when the bill came, our server told us that the bill already included a tip. WOW!!! I saw that it included a 15% tip which was ridiculous due to their lack of service. I'm usually a generous tipper but this place sucked. I will NOT be returning to The Garden!", "author": "Zoey W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-12", "description": "It's rare to find a Chinese restaurant in FiDi that serves a whole Peking Duck during lunch hours. I had high expectations for this place, and it did not dissapoint! The skin on the Peking Duck was super crispy, the meat was juicy, and the sauce just tops it all! They also serve complimentary soup for all guests. Lastly, the waiters provided great customer service and the place in general was very clean.", "author": "Victoria T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-16", "description": "Really friendly staff and short waiting time food was A good Spicy flavor. The waiters were very patient and nice while the food came quick even when it was busy Would recommend to others!", "author": "Patrick W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-08-09", "description": "Ordered the chong qing crispy chicken and chicken fried rice. The chong qing chicken was very very mediocre and had no resemblance of spicy crispy chicken. Not sure why they would post a picture of this dish on the outside of the restaurant when they haven't mastered it. The fried rice was decent though. Service was nearly nonexistent. Won't be coming back.", "author": "Alan H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-19", "description": "Well prepared Chinese food. Good selection of spicy foods. Next door to the Hilton SF Financial District Hotel and across from Chinatown. Would highly recommend dining here. Menu is in English and Chinese.", "author": "A L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-30", "description": "Oh hell yes! This restaurant is soooo good! \n\nThe food came fresh, Everything was sizzling, and they give huge portions! Their beef is VERY juicy and their abalone is just amazing. We got around 6-7 dishes for dinner.\n\nBest of all, The waiter we got was super friendly too! I'm a keeper of this place!", "author": "Jonathan Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-30", "description": "Amazing place! The service was casual and super attentive. The waiter was happy to answer our questions and even made suggestions. The food was GREAT, so fresh. We had the dinner special, orange chicken and king pao chicken, it comes with spring roll and the night's soup...need. The soup was amazing, the taste, the portions. We substituted some egg fried rice and that too tastes great and fresh. \n\nAmazing place for great tasting Chinese food and service!", "author": "Julia L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-20", "description": "What happened to one of my favorite places to eat at? Saw a pink sign on the window  that says they are temporarily closed Oct 15 to NOV 2017. Kinda vague re-opening date?", "author": "Charlie E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-03", "description": "My 94-year old dad is very selective when it comes to eating In Chinatown. We had lunch at Garden Restaurant 2 weeks ago and went back for dinner last week because dad enjoyed the food so much.\nThe steamed fish was delicious as was the mustard greens with tofu and mushrooms. The food was not greasy; ample portion size, and we had great service! We've got a \"winner\".", "author": "Nancy W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-18", "description": "Who would have thought the outside that looks so dingy would actually serves some really great food?! Apparently everyone in my family but me. When I asked my grandma where she wanted to go to dinner, she said the downstairs place would be nice. \n\nThey served a complimentary broth soup made of a dried bok choy and pork bones. It was a great way to start the meal. \n\nAnd sometimes, I like weird things.... The salted fish with chicken was amazing... the leftovers sitting in my car on my way home.... not so much. i'm still excited about eating the left overs though. \n\nI also ordered the pork and eggplant clay pot. My grandma asked to leave out the spicy sauce (the XO sauce). It was still good without it, but I asked for some of it on the side to take with my left overs. Also delicious when added later. \n\nYou should ask about what specials/off menu items they have. I was originally going to order pea sprouts with garlic, but the waiter told us that they some other vegetable, which my grandma asked for instead. Also a winner. \n\nWe finished with their complementary red bean dessert soup. It was wonderful way to end the meal, and it wasn't too sweet. \n\nThere was so much food, I had plenty of left overs that will last for another two meals. \n\nEdit: Bonus points: I discovered the bathroom is SUPER CLEAN! \n\nPro-tip: Never judge a book by its cover. \n\nP.S.S. Ask about specials that they may have - they don't have a board to tell you what they are.", "author": "Vicky L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-19", "description": "Really good food & good portion size. Great tea, really hit the spot. Friendly staff.", "author": "Alessandra C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-22", "description": "On hindsight (we just got back home from an exhilarating 28 day tour of the US from west to east coast) I realize this was the best oriental restaurant we had the privilege of going to. And it was completely unplanned.  \n\nIt was our first full day on US soil, specifically San Francisco. After holy mass, breakfast at Ziggy's and a walking free-wheeling look see of Union Square and environs, we were on our way to Fisherman's Wharf for our very first pre-booked tour. We chanced upon this corner resto. Hubby/Dad wanted to check out chinese cuisine. Our 5 children and I w/ a close friend demurred. The place looked so ordinary and uneventful from outside. Hubby won, so in we went. \n\nMy heart skipped a bit and felt a sudden hope from the feel and look of the main door handles and frame- they looked and felt of good quality gold brass. \n\nWhat followed next was amazing. The food we ordered came thick, fresh and fast. Beef, pork and chicken were juicy and savory, noodles were firm and/or crispy as needed, seafood tasted fresh, delicious and light, vegetables of good quality and deftly done. And the portions, wow, generous is an understatement. \n\nAnd the last but not the least part, the price was really reasonable. And I mean it was so reasonable, it was unbelievable. To top it all, the place was quite clean, especially the restroom. Restos this cheap normally give their price as an excuse to be dowdy. Not this one. \n\nAs we ended our trip, And after several other Chinese restos from San Francisco to New York, I realize this was bang for the buck the best we went to.  Congratulations!", "author": "Ting D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-10", "description": "This is one of my go to for lunch if I want good Chinese restaurant and doesn't want to pay too much ( R & G lounge).  This place serve good food and reasonable price.  Great lunch spot and no complaint.  \n\nMy go to: \nSalt & pepper spareribs & Fish\nBraised Tofu with tender green\nWalnut prawns\ncombination fried rice\ncombination chow mein/ hong kong style\nWest lake beef soup \n\nService: \npretty attentive, but do have to remind the servers certain items because they tend to forget. \nservers are always nice to me and my friends.  maybe because we are one of the regulars so they remember us. but still really nice\n\nAtmosphere:\nVery roomy and cozy. I am so glad they remodel because it doesn't look like an old school Chinese restaurant anymore.  They remodeled few years back and it looks really nice now.", "author": "Candice Y."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-02-28", "description": "My friend and I have been going here for years for lunch but after their renovations, it seems like it's a different restaurant. They have a new menu and the food we ordered was not good! They have a few items from their old menu so I ordered my favorite fried rice. It tasted so bland and the rice was hard!  My friend's wonton soup barely had any taste! They must have a new owner or new chef.  So disappointed!  We decided it was our last meal here.\n\nFarewell Garden Restaurant!", "author": "Cathy D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-08-23", "description": "Ate quick lunch here. Only had their chow fun beef which was average tasting. Lots of noodles, little beef for $8.95. Relatively clean next to Hilton hotel for quick meeting", "author": "Clifford W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-16", "description": "My family ends up here quite a bit to celebrate special occasions such as birthdays and new years over a nice banquet style lunch. I always thought this restaurant was pretty good, but with my latest visit here, I found the dishes to be phenomenally done!\n\nThe first compliment to give this restaurant compared to other restaurants in Chinatown is that it is very clean. The prices reflect that however, as the food here is quite expensive as compared to its Chinatown equivalents. \n\nEveryone knows the famous restaurant across the street, R&G Lounge. As I'm told, the chef here had some sort of connection with the chef(s) there, so the food is definitely cooked with much skill and expertise. The owner of this restaurant has owned other restaurants in Chinatown in the past, and if you see him, ask for recommendations! The dishes he recommends tend to be expensive, but very well worth it!\n\nNow, it's time for me to recommend some plates. Prepare for my hideous attempts to come up with English names and descriptions to these dishes:\n\n- Pork knuckle w/ Chinese New Years special hair resembling veggie (fat choy)\n- Egg dropish soup w/ Beef\n- Steamed Egg w/ salted egg\n- Green Beans w/ dried up tiny shrimp\n- Anything w/ sizable chunks of tofu", "author": "Joshua M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-06", "description": "Once a friend said to me, \"You've lived an extraordinary life.\" I thought that he was being flattering. But more people had said to me, \"You should write a book.\" I just assumed that was also people being polite. But I do think what I'm about to tell you is a story not lived by many, and it all started here, at this restaurant, more or less. The year was 1988, I was very young, and as one of the first few high school students of the very first foreign exchange program between the two largest world economies, I arrived in this country dazed and confused. The original restauranteur, who was ultimately responsible for making this ground breaking exchange program happen since the beginning of the People's Republic, treated us five students meals here frequently, so our transition to this country was not as drastic as it would have been.  \n\nAll those Chinatown banquets and Chinese consulate dinners felt more like a magic dust to this homesick teen. She was surrounded by people who knew what these kids represented and adored them for what they also meant to them. Each gathering was filled with nostalgia and hope. For those Chinese Americans active in Chinatown, they longed for a connection to their hometowns through us; and for those Chinese diplomats in the consulate on Laguna, they saw us as for what was yet to come: the beginning of the two world's largest economies's cooperation and cultural exchange, and the great industrialization of a third world country, which took China by storm somewhat 10 years later, propelling this country of 1.2 billion people onto the world stage. It all seemed to start from here, five young kids from three different Chinese high schools, serving as an olive branch, and starting a meaningful dialogue between the two nations since Nixon.\n\nBut, it's the gathering and meals prepared here at the Garden Restaurant that introduced me to American Chinese food. I had never seen Egg Foo Young before, nor Wor Wanton Soup. The waitstaff always gave us fortune cookies, which I had not seen before coming to America. \n\nAfter twenty-some odd years later, I returned here on a Sunday afternoon. The restaurant has changed ownership, but it stayed in the same family of the people who came from the region I came from; the alumni network is strong in San Francisco chinatown. The food is very similar, and you can get the lunch or the dinner menu, apparently; though we only received the lunch menu. The great man who initiated this exchange program, who had since sold the restaurant, had retired, both of his kids attended Lowell and then elite colleges. He remained active in the community. The new owner, who's been running the place since over 10 years plus ago, had reconfigured the restaurant to allow a banquet room in addition to the regular dining room. You can still order Egg Foo Young and Wor Wanton Soup. I learned all this by chatting up with a Caltran worker, who belongs to the same alumni association. He did not remember me, though he said wonderful things about the owners.\n\nThrough this simple and delicious meal, I was transported back to when I was just a skinny teen, fresh off the boat (or the plane, as the case may be),  I spoke no English, I looked every bit lost as any immigrant or refugee would feel. I did not know at the time, that I was going to embark on a brand new journey - a future unwritten, stories unformed, and a life, not yet lived.", "author": "Victoria E."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-03", "description": "Since my last review of Garden Restaurant things seem to have gone downhill.  An appetizer of roast pork was tasteless and swimming in a pool of fat.  Not good.\n\nA seafood combination claypot was mostly comprised on mushy tofu.  Of the seafood in the bowl, the whitefish was overcooked, the scallops were stringy, but the shrimp verged on OK.\n\nThe owner of the place walked through the largely empty room chatting on her cell phone.  Service was minimalist but food got to the table hot.", "author": "David D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-30", "description": "Great food! Very nice! The service is very nice too. I'm surprised that this restaurant is not as popular as r&g since most of my Chinese friends think this is better.", "author": "Cozy S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-16", "description": "Review is for dinner.  \n\nOrdered their seafood and bean curd clay pot - which was fresh, savory, and delicious!  Seafood came with squid, large shrimp that was deveined and scallops.  \n\nThe clay pot didn't come with rice so ordered a side of rice. For $2 the rice could feed a fat Asian family!\n\nHighly recommend this legit Chinese place.", "author": "Nicolas N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-04-08", "description": "This one of two similar restaurants located directly across from portsmouth square (with it's parking garage) and adjacent to the hilton financial hotel. \n\nThere's some things to like here. The owners have a focus on presentability. the staff all have matching outfits, and the place looks impeccably clean. The service is quick to get you seated and attended to, and the food isn't terrible.\n\nAnnnddd that's where it starts to go wrong. The food ranges from \"That was okay I guess\" to \"Why does the cook hate me?\". Pricing is a little higher then nearby places for just okay food. \nHence the three stars.\n\nHowever, if you are in that big stupid hotel, this is your first visit to SF chinatown, and you are intimidated by the local diversity, then this will be a nice safe comforting place to eat. But do know there are places with better food literally right next door.", "author": "Steven W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-27", "description": "Very good food and the food also came out in a timely fashion. Family style portions make it easy and affordable", "author": "Shawn G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-08-11", "description": "Customer be aware !!! They add tips under service charges for a party of only 2 people then demand tipping again after swiping credit card.  It's against the law for mandatory service charge!!! In fact, waiter confirmed they ripe off tourists by always adding extra tips so tourists won't notice it when paying the bills.  2014 California past a law about service charges.  Restaurants have to report to IRS, service charges need to be reported as wages earned by waiters.  I wonder if this restaurant ever report their service charges to the IRS.  I would love to call and find out.  Guess what??? You (Garden Restaurant) ripped of the wrong person. Again Customer be aware!", "author": "cherry s."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-29", "description": "Decent Chinese food! Sure it's a little pricier than inner Chinatown, but the place is also much cleaner! The flavors are good and on point. The owner(?) is funny guy and goes around and chats with his customers! They also have lunch specials available which is great. oh.. also.. THEY TAKE CREDIT CARDSSSS. woo!!\n\nI will be back if i need my beef chow fun fix!", "author": "Judy W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-25", "description": "I remember the Garden from when it was a very modest place with so so food.  From reading other reviews, it looks like the ownership changed in 2011, and it went more upscale.  Since I didn't know about the change, it took me a while to rediscover it.\n\nAfter the R&G Lounge, this is the best Chinese place on Kearny St.  There are no lines, and usually it's easy to get a table.  My overall rating should be 4.5 Stars.\n\nFor lunch, they have a nice selection of soups with various meats and noodles from $7-$11.  The flavor of the broth is really good.  Personally though, I usually don't get the wontons.  I'm not sure what it is; but, every time I have them, they have a different taste than I am used to.  Their flavor is not bad, just different. You should be warned that the beef stew often includes a little bit of fat and/or tendon.  But, trust me that contributes to the flavor.  When I've order it, the chicken soup always comes with white meat.\n\nTheir Deep Fried Prawns are incredible.  The batter is very light and airy.\n\nI really like the Seafood Chow Mein.  The fish they use is delicious.  I only wish the chow mein came with a few vegetables to balance the seafood and the noodles.\n\nBased on the fish in the seafood chow mein, for the first time, I had the Fish Fillet with Vegetables.  It was amazing.  It came with a really tasty light sauce, and the fish is very fresh.  The owner told me they use slices of Rock Cod in this dish.  I don't normally order fish dishes as I'm usually disappointed; but, this dish is excellent. The dish comes with American Broccoli; but, you can get it with Chinese Broccoli, or mixed Vegetables (including slices of ginger).  Though this dish is on the dinner menu, I have found that they will make it as a lunch special.  Basically, any dish made with this fish tastes good.\n\nAs much as I like the Seafood Chow Mein, my new favorite is the Seafood Chow Fun.  To me, it tastes even better than the Chow Mein.  I still wish they would throw in a few vegetables as it usually only comes with green onion.\n\nThe Pork Fried Rice is good.\nThe Mu Shu Pork is good.\nSalt & Pepper Chicken Wings are good.\n\nThe Hot & Sour soup is pretty good.\nThe Pot Stickers are pretty good. Best yet, they take a few minutes to prepare; as they should.\nThe General Tsao Chicken is pretty good.  It only comes with chili peppers and a bit of onion.\nSingapore Style Noodles are pretty good.\nMixed Mushroom, Tofu, & Chinese Green is pretty good.  The tofu is slightly fried on the outside to firm it up and has a nice flavor.  For the Greens, you can ask for American or Chinese Broccoli, or Bok Choy.  My only complaint is that sometimes the bigger pieces of sliced mushroom are undercooked and a bit hard to chew.\n\nThe Mongolian Beef was just so so.  It didn't taste as good as it looked.  The Mongolian Lamb tastes better.\nThe Egg Plant with Garlic sauce is just OK.\n\nThough I haven't tried it here, the owner tells me they always have Salt and Pepper Crab on the menu.  The price just changes during the year depending on how far they have to source them from.\n\nEverything cooked Salt and Pepper Style is pretty good; even the Tofu.\n\nI remember when the R&G Lounge was a modest place with good food and easy to get a table.  Then, the Hong Kong celebrities discovered it, they went upscale, and now they have lines of people waiting out the door every night.\n\nPart of me hopes that also doesn't happen to this place as I want to make sure I can always get a table...  Oh, oh.  Since posting my review, it's getting more crowded for lunch!", "author": "Roy C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-03-12", "description": "Came here because R&G lounge was too long of a wait and it was raining. We ordered seafood tofu pot, peeking duck and BBQ pork, pea sprouts, and walnut shrimp.  \nSeafood pot: all the seafood was very fresh, tofu was really good but too much ginger for my taste. (Personal preference though) \nWalnut shrimp: really good, portion was TINY though, like 10 pieces of shrimp for 17 dollars \nPeeking duck and BBQ pork: once again flavor and preparation was good just really small portions. The duck pieces barley had any meat on it. \nPea sprouts: only thing with big portions but one plate of veggies was 19 dollars.... That's more than the shrimp lol \n \nAlso rice was 2 dollars a bowl. Could have potential of they weren't so stingy and so pricey", "author": "Angie H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-13", "description": "Came here on Christmas Day. This place was definitely popular. Even though my family was the only white people in the place, the staff were very welcoming. It is a place though to understand some culture. They will not come to your table every 5 min, you will need to wave them down. \n\nWe shared rice, honey walnut prawns, broccoli beef, general chicken and something i can't remember. It was a lot of food but we were able to get through it pretty well. It was soooo good. I would highly recommend the Honey Walnut Prawns.\n\nEven through it was a little pricy, I was okay spending it on Christmas night.", "author": "Ryan E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-29", "description": "Good, not outstanding, but a solid offering for a traditional family style dinner. Easy to find on Kerney betwen Clay and Merchant (next to the Hilton).\n\nOur family enjoyed the following dishes and here's my take:\n\nWe started with West Lake soup and we all thought it was very good. A nice combination of minced beef, egg whites and cilantro. The broth was a thick consistency that I really liked.\n\nWe had lobster with green onions and ginger.  We originally ordered dungenous crab, but the waiter recommended the lobster becase they were offering a special. Two for $21 versus $29 for one crab.  I appreciated the recommendation and the lobsters (although small) were very tasty.\n\nChow fun with BBQ Pork was very good.\n\nWe had a special fried rice that is not offered on the menu. Again our waiter recommended this as an alternative to the House Fried Rice. One difference was that it included dried shrimp, and we thought it was good.\n\nThe Sweet Pea Leaves with Garlic dish was very good. Very fresh greens and the preparation did not use a lot of oil.\n\nThe Peking Pork was my least favorite of our dishes. The batter on th pork was a little heavy to me and the sauce was a little too similar to the American Sweet and Sour Pork.", "author": "Paul C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-19", "description": "I had eggplant with garlic  and Walnut Shrimp it was delicious.  Atmosphere was nice the waiter was very nice  I would definitely come back", "author": "Karen B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-01", "description": "Quality Chinese food!\n\nCame back here just for their squab! SO CRISPY SO GOOD. Also got the sea cucumber and abalone. Their sizzling beef was also great with rice.\n\nService is exceptional. Our waiter was super nice. Bonus is that this place is CLEAN. Much cleaner than the other Chinese restaurants in the area.", "author": "Anna W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-19", "description": "Long overdue. I have been this restaurant at least 20+ times in the past few years.\n\nThe setting is quite nice and the service is pretty good (especially for Chinese restaurants) and people work there seem to have been there for a long time as I rarely see new faces. \n\nThe food is quite good as all dishes are well prepared, not super oily/salty. \nFrankly, it is at least as good as R&G Lounge (that place is seriously overrated).", "author": "Barry W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-19", "description": "Sleeper alert. \nHard to believe that it's been over a year since writing my breakfast review since I always thought that this was about the max of their culinary skills.\nHere's what I ordered for my family of four:\n\nAppetizers\n1) Cold plate, BBQ pork, Roast duck, & jellyfish (http://www.yelp.com/user_local_photos?select=brK1YLdyi1S_WVmvEnDAZg&userid=saJuyv784apZzH--psHZ3Q) - Not the best I've ever had, but above average especially for Chinatown these days.\n\n2) West Lake minced beef soup - Not too salty nor overly thick.  Good amount of cilantro added to the flavor.\n\nMains\n3) Chinese style rib eye steak cubes (http://www.yelp.com/user_local_photos?select=vnHaCgX_BvGyAU3dETr99g&userid=saJuyv784apZzH--psHZ3Q) - Think sweet and sour pork flavor on tender steak pieces.  Not bad at all.\n\n4) Mixed mushrooms tofu with Chinese greens (http://www.yelp.com/user_local_photos?select=bBpGDid0HTEUF7B-UVlW8Q&userid=saJuyv784apZzH--psHZ3Q) - Pretty standard SF Cantonese dish, but liked the variety of mushrooms used.\n\n5) Salt & Pepper crab (http://www.yelp.com/user_local_photos?select=caw814pLNu8uY1OgkrOsFg&userid=saJuyv784apZzH--psHZ3Q) - Don't expect a copy of R&G's ($45.00 there).  This one is $29.00, but it is a tad spicier and slightly drier.\n\nNeedless to say, this meal was plenty and then some for a family of four, but, hey, my parents LOVE variety.  Also, it makes for nice next day(s) meals.  The staff are very accommodating in packing things to travel and were very cooperative in following my schedule to ensure the food arrives home temperature hot.  They even offered free boxes of white rice, a rarity these days for Chinese restaurants.  My coworker who waited for me to drive up told me that the dining rooms were packed (there are two of them here) with neighborhood families on a recent Sunday night.  If the R&G line is too long or you don't want to drop those C-notes on a casual dinner, this is probably the right place for you.  It certainly works for me.", "author": "Mike C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-09-01", "description": "Average food but the wait staff sucks. Having waiters stand and look at you during the entire meal from about 5 feet away is not appealing. Requests for ice water received repeated refills but simply lacked any ice more than a few small slivers (literally). Food was served quick and rather hot. On a rather hot day in the city, the restaurant was equally hot and there was absolutely no air movement at all. I'll very likely never stumble upon this place again nor seek it out.", "author": "Steven C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-01", "description": "Because of an hour long of wait to one of the famous Chinese restaurant across the street, we ended up dining here. We've been here for few times so we knew the place  will not disappoint. We're right again this time. It's not that crowded, food was tasty and delicious, and they have friendly and very courteous staff. Bonus points, we saved our time, saved some money too for they are not that expensive. We finished and fill our tummy and we're very happy!", "author": "Jem G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-31", "description": "Wow much better than rg lounge down the street ordered live sea bass 2 ways. They served a fish broth soup with the head served with mustard green and tofu then the rest of the fish was served stir fried w snow peas and ginger. Ordered dou miu and salt and pepper crab. Enough for 4", "author": "Doug C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-18", "description": "Not as grand nor popular as R&G, but service and food is extremely comparable to R&G. Also on the pricier side, but a couple of dollars cheaper than R&G. A positive side is that you don't have to wait in line. The place is always available. \n\nI love that they offer their daily soups for customers, which according to the owner/manager is MSG free. We've tried their noodles and other dishes and they were pretty solid. One of my favorite dish is the their Dried Scallops and Egg White Fried Rice - 瑤柱蛋白炒飯. It was recommended by the waiter the first time we went there. I've ordered it ever since. He boasted that this is the only place where they make it. That's a lie, I've tried it in many restaurants. The truth is that they do make it the BEST there. It fluffy and not oily. The fried rice showcases the fire power of the stove! It's piping hot when the dish is served and you can taste all the ingredients in every spoonful of the fried rice. For those who haven't tried, you must.\n\nThe restaurant is right across from R&G. So if you ever find yourself stuck with a 30 minute wait time, hop on over. You will not be disappointed.", "author": "Em T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-10-22", "description": "It is one of those chill, dining restaurants where one eats with family and stay there for a couple of hours.\n\nI like the ambiance because the waiters don't rush you out and they are not busy during peak hours for dinnertime.  Their Hong Kong styled based food is pretty good.  I do like their steamed fish and their fried tofu with shrimp, eggplant and bell pepper with black bean sauce. \n\nhttp://www.yelp.com/biz_photos/17lWSfu2U04ayITamrBaiw?select=PpHNDI2bv6tZtGHggUck4A#g9_kxxT3FpqfuLLmEae7RA\n\nhttp://www.yelp.com/biz_photos/17lWSfu2U04ayITamrBaiw?select=PpHNDI2bv6tZtGHggUck4A#qNxBdXS8coXU26M-NkS4eg\n\nThe other dishes we ordered, such as the fried calamari and cold jellyfish appetizer lacked the flavor that would make the dish spark and taste great.\n\nIn general, this place located in Chinatown is very doable.", "author": "Tiffany D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-16", "description": "Ordinary menu and setting, but definitely above-average food. Not an occasion place, but completely reliable which is pretty darn worthwhile.", "author": "Jane M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-11", "description": "Ordered salt and pepper crab, steamed and stir-fried vegetables, and seafood in clay pot. Really delicious food and friendly and fast service! Can accommodate parties of any size. Would definitely recommend.", "author": "Anthony B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-27", "description": "Forget R&G peeps. Come and try Garden Rest. Try the  salted egg yolk lobster. (Mic drop). Combine it with salted fish fried rice and you may just send me money to thank me for this recommendation. Enjoy. We are coming back ASAP.\n\nGreat meal but lobster seemed to have cost a bit too much. Nonetheless, it was to die for....maybe for $10 less.", "author": "Martin L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-02-20", "description": "Chinese New Year madness!!\n\nI've been here before but this year the service is bad! The only reason i don't give it  one star is because the food is pretty good here.\n\nWe shall see. Getting a table wasn't the problem when we first got here. It's when we sat down. The wait staff seemed to forget about us. I guess you had to be in a big group in order to get some attention.\n\nNow it's just wait and see if all the waiting is still worth a repeat visit.", "author": "Martha V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-17", "description": "They make the best Salted Fish & Chicken Fried Rice! I even order it with a salted egg! They also made really good fried and salted pork!", "author": "Alice X."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-18", "description": "Very Good food and fair service, lack of \nDim Sum offerings. \nNot the best in SF but well worth trying for the good food.", "author": "Angela B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-30", "description": "This is my first time ever that... I have actually have had lunch at The Garden Restaurant!!! If you happen to be in San Francisco Chinatown Area go to The Garden Restaurant its a good Chinese restaurant to eat at!!! And what I had to eat for lunch on a beautiful hot sunny day was a Sweet & Sour Pork w/ Fried Rice and it also came with Hot and Sour spicy soup in which it was very spicy for me but I didn't care I drank the soup anyways!!! After I had ate up the Sweet & Sour Pork w/ Fried Rice... My server was very nice with me and also came to me with some watermelon to cool me down!!!", "author": "William B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-02-11", "description": "Well DO NOT EAT HERE. First of all, awful service. We were sat in the back corner, a family of 5, and they ignored us for 15 minutes until we had to flag someone down like we were in elementary school. When they brought our food, it was tasteless and poorly cooked. They also said we would get white rice with our meal and did not get the rice until we got our check and had to ask for it. The food was about 20 bucks each plate and was definitely not worth it. Not to mention a poor food score. NOT HAPPY.", "author": "Brynna I."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-13", "description": "The workers were very attentive and the food tasted great :)!\n\nThe service was very good and all the workers really cared about what the customers wanted.", "author": "Jasmyn T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-12-28", "description": "Stopped here on a visit to China town. Should have dug into the reviews a little deeper. The spring rolls were still frozen. They made us \"orange chicken\" it was fried chicken with orange juice on the side. Maybe we just ordered the wrong things but no one in our party enjoyed it. Everyone didn't feel to great after either. The service was okay kind of slow considering we were the only ones in the place. Also added on their own gratuity charge. Won't be going here again.", "author": "Brooke C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-10-15", "description": "First time trying at this restaurant.  I have been to SF Chinatown many times but I never noticed this restaurant until my most recent visit.  The interior is pretty nice.  Seems like it was brand new but I'm sure they have been here for years.  Maybe they remodeled it.\n\nFood:  I ordered the lunch combo with chow mein and sesame chicken.  It wasn't that great.  Chow mein was a little bland and sesame chicken was just only meh.  Sesame chicken in general is one of my favorite chicken dish.  Their version is not that great.  My friend ordered their BBQ plate with BBQ pork and duck.  It was only ok as well.  \n\nService: In the beginning, it was great.  My friend and I were immediately greeted when we walked in which is a plus.  After we got our food, it kinda went downhill.  They didn't come and check on us.  When we were done eating, they didn't bring us the check.  I had to flag the waiter down.  I told the waiter \"check please\".  He said ok and grabbed our dishes away.  I thought that he would bring our check over after he put away the dishes but nope, he came back out and was doing other things.  We continued to wait another 10 minutes and still no nothing.  I flagged down another person.  I believe he was the owner.  We finally got our check.  We paid and left.\n\nOverall, this place was only ok.  I can get better Chinese food elsewhere.  Good thing about this place is that they offer free wi-fi.", "author": "Susan B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-08", "description": "I usually come in right before noon and never had any problems being seated. The dally lunch specials are pretty cheap, and I try to order from that menu. I've tried the chow fun which is plentiful but lacks a little bit in flavor. The salt and pepper pork and fish filet are great, but it only comes with rice, no veggies or anything. As a bonus, they serve you the soup of the day as you are seated.", "author": "Mike O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-04", "description": "I used to eat at the Garden Restaurant when I lived here 18 years ago. I was shocked when I entered the restaurant today because it looked so nice. It used to be very dirty and dingy but the roast duck wonton soup was amazing. Although I am very impressed with the makeover, I was a little disappointed with the soup because it used to be more flavorful. But it was still good and with all of the cosmetic improvements it still deserves 4 stars from me.", "author": "Tracey P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-08-09", "description": "Haven't been here since the Holiday Inn was bought out by Hilton. The restaurant is conveniently located right next to Hilton with street parking and the Portsmouth Square parking garage accross the street. Stopped in for lunch and ordered their seafood chow mein, which was excellent and a beef chow fun which wasn't. It was way too greasy with hardly any beef in it. The service was great and had a pleasant lunch with mixed reviews.", "author": "Roland F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-19", "description": "I brought 2 friends here for dinner, it was a first time for all of us......\n\nThere was already a line forming at the door, we were next but still had to wait half an hour.......all the other places around were also booked.....this was last Sunday....\n\nWe ordered salt n pepper crab, bei jing duck, honey sauce ribs, green beans and seafood clams......the big ones with vermicelli noodles and garlic steamed.....\n\nEverything was good but there was a wait, for the food I am talking about.....\n\nThe atmosphere is pretty nice and clean, we could see the hustle and bustle passing by Kearny.......\n\nGreat place for family gatherings and great service......", "author": "Leslie Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-19", "description": "I usually come here for my family dinners and believe me, you would want to come with a big party so you can try a range of entrees. This is definitely a great \"alternative\" if R&G across the street is packed as always. I don't want to label Garden Restaurant as an alternative because they deserve the recognition.\n\nThis restaurant is clean... dining area and bathroom. Lots of seating and have attentive, friendly staff. They made sure your tea is filled, and that you have a clean plate if yours is filled with shells from that yummy crab or others.\n\nThe baby pig is very good. Tender and not too fatty. The shells were crunchy. This dish also came with the quail which was tasty as well.\n\nSalt and pepper crab - surprisingly this didn't have much fried batter from what I had elsewhere. It's seasoned perfectly with salt and pepper and fried lightly. Very enjoyable. \n\nDuck fried rice - delicious!!!\n\nAlso ordered the spinach that came with bamboo shoots, fish, beef cubes...and a lot of other items. Everything was very good and I always leave too full.\n\nThe hot taro tapioca dessert is a great finish to the whole meal! Don't hesitate...give this place a try.", "author": "Nancy N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-12-25", "description": "Place was conveniently located. Atmosphere was mellow. Food was ok on the light and milder side on flavor.", "author": "Nidz S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-15", "description": "We ordered delivery online from here tonight. The experience started out a little shaky. Apparently their fax machine was down so they never received our order. After about an hour we called and they were super apologetic. They got our order to us within a half an hour. Unfortunately, they forgot a part of our order so I had to call back. They quickly rectified the situation and brought us the missing order within 20 minutes. To our surprise, they threw in a free order of eggrolls and potstickers for our trouble. They were extremely nice through everything and you could tell they really care about their customers and truly want them to return.\n\nThe food was very good and worth the wait. We would totally order from them again in the future, regardless of the issues we encountered. Great service does that to you.", "author": "Alie C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-27", "description": "Very good food quality, ordered kung pao chicken, string beans and walnut shrimp. Kung pao chicken is mostly white chicken meat yet very tender. Good customer service. Will definitely come back again.", "author": "Cat Rox L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-30", "description": "I had my wedding reception here on June 22nd and it couldn't have gone any better. I selected this restaurant due to the great Cantonese food and the service. The head waiter and owner put together the perfect menu for me and gave me the whole restaurant for the night. The restaurant is also conveniently located right across from the Portsmouth Garage and they validate 2 hours of parking. \n\nWe had a rowdy reception that lasted over 5 hours here and the staff and owners were gracious and attentive. The owner Danny Ho had some special table covers, napkins, and chopsticks ordered for my event. It is a smaller restaurant and my banquet was about 60 people so if you have more than that, the Garden Restaurant may not work for you.\n\nThe food here is really excellent, and their Peking Duck is especially delicious. We had a cold appetizer plate with pork, beef and jelly fish. Honey ribs, salt and pepper shrimp, fried rice, shark fins soup, mushrooms and veggies, Peking duck lettuce wraps, steamed whole fish and dessert soups. \n\nThe staff changed out the dinner plates every other course or so, provided soft drinks, let us bring in our own wine and corked it without extra charge. They also served up my wedding cake without extra charge. I am extremely pleased at my choice for wedding banquet and urge other patrons to consider this venue for their special events. There are two private rooms and bathrooms downstairs for changing or taking a break in. One of the rooms also has karaoke (the owner does not charge extra). Also. as the hosts of the party, he let us park right in front of the restaurant! A million little details like this made our night so much easier and pleasurable.", "author": "Tricia K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-07-06", "description": "Not typically a reviewer of things but this experience was worth noting. Came in to prompt/pushy relocation to a table. I was then handed a giant menu with more options than were necessary while my waiter hovered nearby staring at me. \n\nI then tried to order the hot and sour soup and curry beef but was told the hot and sour soup was not for 1 person and that I could have egg flower soup instead. \n\nI was mildly irritated but figured I was hungry and egg flower soup is good so why not. Soup came out quick and super hot. Gave it a try and tasted largely like hot water. Almost no flavor. \n\nSecond or third spoonful into the flavorless soup and I find a hair floating in the soup. At this point my appetite is waning and out comes my curry beef. \n\nLooks ok but is basically large chunks of onion, green and red pepper accompanied by large flat squishy flaps of beef-ish material. I tried a few bites but the combination of squish and flavor were inedible for me. \n\nI was done at this point. I could eat no more. I asked to have it boxed up so I could give the non haired beef to the homeless. My same waiter said sure. Plate leaves for a few minutes then comes back to the table in a bag that looks like someone vomited the curry all over the to go box and the inside of the bag ...and no utensils. \n\nI ask for utensils to which they oblige and the waiter then decides the food needs to go into a bigger box. Food leaves again and comes back in a bigger box, same bag. \n\nI am about to walk out completely done and one of the other staff sees the bag and decides I can't leave with the gross bag and takes the food again despite my protest and re-bags and gives to me. Finally I could leave. \n\nVery discouraging. Definitely a no go for me and wish a better experience for others that end up here.", "author": "S P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-17", "description": "Tried Garden Restaurant for the first time. Pricey but excellent food. Fast delivery and hot. Meat was lean and cooked just right. Right amount of oil used. Wasn't greasy. No heavy deep fried and over cooked breading. \nIf future orders are consistent this will be our go to place for Chinese Delivery.", "author": "Linda C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-27", "description": "Was exploring chinatown when suddenly my girlfriend gets ridiculously grumpy... So as any boyfriend would/should do: I took her to a restaurant nearby. WOW... this restaurant turned out to be one of the best choices I've ever made. We got the fried crab and the Salt&Pepper tofu. The fried crab was just as you'd expect crispy on the outside and succulent and juicy on the inside. The salt and pepper tofu on the other hand was AMAZING as it is my favorite dish from my childhood. Dare I say, its on par with my mothers cooking. I recommend this place to all.", "author": "Gibran L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-31", "description": "The garden restaurant Its located conveniently  next to the china town hilton.\nOut of the all the dozen of place i walked across i decided to try my palate here. What got me was the bbq pork and chilled cold chicken lunch combo. Priced at i believe 7$ and some change i though it was a wonderful deal. Server greeted me immediately filled my water 4 times, and was very polite to me and my friend. ALSO, the bathroom was immaculately cleaned like i would have dinner in the bathroom stall clean.\n\nBottom Line\nThis place is clean, several waiters to attend to your every needs, and decent prices.", "author": "Harrison P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-04", "description": "This place is solid. Been meaning to try it due to the rumors about its chef's background. We had walnut shrimp which was succulent and light and crispy. On choy was on point. Also had HK style fried noodles and ribeye beef both of were also good. What I like about this place is that their dishes have \"wok hey\" which is important in Chinese cuisine. This is the use of proper high heat for its dishes. Also, unlike many Chinese restaurants, this place doesn't seem to use MSG so although the flavors were a bit on the lighter side, you don't feel yucky and super thirsty after a meal here. The service was very good as well, a pleasant surprise. I will definitely come back with a larger group to try their crab and other dishes.", "author": "Al B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-10-12", "description": "Next door to the Hilton on Kearny. It might be your first choice for lunch if you were staying at the Hilton and did not want hotel food. I was surprised the food was not special considering the potential clientele. \nThe staff was pleasant and attentive. Food came quick and service was overall efficient.\nUnfortunately the food was average at best. I subbed chow mein for white rice for an extra buck bringing the total for my Kung Pao Chicken lunch plate to $8.00. \nNot a bad price if quality was there. The chow mein was absolutely uninspired, flat, not hot, barely warm. Same with the egg drop/flower soup.\nThe Kung Pao lacked  in the chicken department, there wasn't much of it and the dish tasted just average. No special effort was put into the sauce.\nMy wife liked her beef with string beans, loved the string beans and I confess the beans were special. Our son had the cashew chicken w/ chow mein and said he gets far better in the Asian Ghetto (local term of endearment) in Berkeley.\nOverall I might stop in again if I can't find a parking spot up the hill in China Town. The beef with string beans is a fairly safe bet.", "author": "Mike M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-02-12", "description": "Their salt & pepper crab was not as good as R & G's.  It was smaller and greasier; perhaps the oil was old/reused and not as hot.  The rest of the food was not a lot for the price they charged; such as the fried rice.  The only saving grace was their free hot tea.  Other than that, it's not a place I would recommend or return to.", "author": "Maria L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-14", "description": "I came here for take out on a Saturday evening. It was not too busy. The waiter was pretty nice as he took my order .\n\nI ordered a supreme broth Yao Choy \nAnd a pan fried chicken noodle\n\nTotal came out to $25.00 \n\nA little on the expensive side\n\nHowever the food portions were well sized and the noodles were done right and\nVeggies were fresh and tasty .\n\nI would order take out again :)", "author": "DOM d."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-26", "description": "Great food, professional service, nice environ's., parking garage across the street.\n\nItsa reliable joint. Been to dinner a few times, each time, every dish, was tasty. Had a variety of dishes fish, prawns, duck, veggies, pork, tofu, ... prepared in a variety of ways and always ... it was great.\n\nService is polite and responsive. \n\nUnderstand some changes are in the works for September, will go back to check out the result !", "author": "Matsuo U."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-07", "description": "This is my first time at Garden Restaurant and I would say this place has pretty good Chinese food. I would recommend the shrimp and walnut dish as well as the ginger chicken. The oranges they give at the end were really sweet too (:", "author": "Allison P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-05", "description": "I really like this place! The wait staff is very friendly which is a breath of fresh air from some of that Chinatown service.\n\nWe ordered for takeout and it took about 10 minutes to get our order. That's pretty long considering the fact that most Chinese food in Chinatown is made very quickly. Anyways, I had the beef chow fun and the beef was SO tender! It was amazing. I enjoyed it very much. My coworker had Szechuan chicken and he said he enjoyed it.\n\nIf you're in a rush, I wouldn't recommend this place. If you have some time to wait, I would give this place a shot :)", "author": "Erica A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-07-12", "description": "Came here for their lobster noodle special.  $14.99 with egg noodles or $17.99 for the pan fried rice noodles.\n\nThe space is open, spacious and clean.  It has a diner feel, maybe because of the booths.  The wall with bottles of wine is interesting, as is the selection.\n\nTheir menu is limited and definitely prepared and priced for the non Asian tourists.  The waitress who took our order didn't speak very good Cantonese and a bit pushy.  \n\nWe had:\nlobster wide egg noodles - $14.99 - pretty good, I liked the ginger slices \ncrab with ginger and scallion - $19.99 - not bad but the crab is definitely on the small side.  \n\nWe didn't finish both orders so it'll be a nice snack at home with some cold beer.", "author": "Gloria H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-28", "description": "From the outside this restaurant looks pretty unassuming. However inside it's extremely clean. The decor isn't overly fancy but quite welcoming and humble. \n\nFood is very good. A solid 4 1/2. Well prepared and flavorful. The mongolian beef was amazing. \n\nIt's their service pushes them to a 5. Friendly, professional, but not in a stuffy fake way. They didn't assign any table a specific waiter but their staff works so well together that it was not necessary.", "author": "Dan C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-02", "description": "Surprisingly good Chinese food in a good, comfortable dining environment.\n\nWe rarely eat in this area but tried the Garden Restaurant after reading some reviews and hearing good word of mouth stories about the place.\n\nWe had lunch here on a Sunday morning and found this to be a very good Cantonese restaurant -- better than average Chinese food, pleasant service, and a pretty clean and comfortable dining environment.   Prices were reasonable for what you get.\n\nThe Lobster Noodle special is one of their best dishes.  Its well prepared and they give you an entire Maine Lobster cooked \"Cantonese\" style.   Although this is not on the printed menu, its displayed on signs all over the place.    It has gone up in price to $15.\n\nIn addition to the Lobster Noodle special, we also ordered their 7 Course Meal for $69 which provides soupand a choice from their high end priced items (Peking Duck, steamed whole fish, etc.), and four choices from their medium priced items.   If you are with a big group, this is a pretty good bargain.   You can fill out the meal with some well prepared items -- Peking Spareribs , chicken with black beans and asparagus,  beef with assorted mushrooms, and filet of fish with chinese broccoli (gai lan).   The dishes were all prepared well; a bit of oil but not too much, and not alot of salt so we were all pretty impressed with the flavors and freshness.    While some of the dishes are westernized for western tastes, all of the dishes were good and tasty.\n\nI think if you are looking for simple, well prepared, reasonably priced Chinese food in very clean and comfortable surroundings, then The Garden Restaurant should be a place you should consider.   I gather from other Yelp reviewers that the place recently underwent a change in ownership/management and older reviews were based on the previous regime.   If that's the case, it might explain why the service staff here were above the usual sullen (bordering on rude) service you get in alot of small Chinese restaurants.   The people who served us were friendly, energetic, and seemingly interested in serving us.   We parked in the garage in Portsmouth Square, and the restaurant does give you partly validated parking for 2 hours with a minimum purchase.\n\nI'm giving this 3 and a half stars with an extra star for the very clean environment and above average service.", "author": "Bad News S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-08", "description": "A nice surprise next door to the Hilton Financial District Hotel!  Great food and excellent service. I would not have tried this restaurant from the unassuming sign and outward appearance, but our group trusted the Yelp review and tried it over the recommended R&G due to long wait time. So we had salt and pepper tofu appetizer, pot stickers and vegetarian spring rolls. Delicious and wonderful light and crispy textures. Entrees were Kung Pao chicken (spicy with slight sweetness and a hint of five spice), ma Po tofu (spicy and good), and duck lettuce wraps (wow don't miss these). \nHighly recommend for others to enjoy.", "author": "Eric H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-12-28", "description": "Unbelievably bad service. Classic tourist bait lucky to be located next to Hilton. Look elsewhere unless you want mediocre food with a low food safety score.", "author": "Tom W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-01-11", "description": "This restaurant is next to the Hilton so it caters to business travelers.  When I was there during the evening most of the diners seemed to fit that profile and weren't locals. The service is good and slightly formal (for Chinatown) and the ambiance is nice.\n\nThe food is mediocre. It's not that it's Americanized or somehow prepared to the lowest common denominator, it's that the talent isn't there. I had the Peking duck and stir fried beef with vegetables. The Peking duck lacked flavor. Stir fried vegetables with beef is a basic benchmark dish but it just didn't taste very good.\n\nBased on the quality of the food this restaurant should get 2 stars but deserves an extra star for the good service.", "author": "John W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-04", "description": "Order off the manual, can't get any better than this. Great services, friendly workers, clean place to have a great meal. This has been our place for lunches and dinners. Make sure you try the crab and their king crabs as well.", "author": "Judy C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-27", "description": "The Garden Restaurant is a lovely place that's a little out of the way, but worth the trip.  The food us decent, but the good prices and ample portions make this a place I would return to.", "author": "Douglas G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-09", "description": "The Garden Restaurant is a solid, solid place to get a nice Cantonese style dinner. Rumor had it that a chef from R&G Lounge worked his magic here at some point, and the result was good food for a decent price.\n\nThe last couple of times here we got the duck three ways: Peking-style skin with buns, diced meat with lettuce cups, and bones in a gingery soup with tofu and mustard greens. So good! We've also special ordered some Canto family favorites like prawn salad, which they can make with either a potato base or a fruit base.\n\nWould definitely come back to try other specialties, if I ever get tired of my family favorites!", "author": "Andrey C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-17", "description": "My husband insists on visiting this restaurant when we're staying in the city. We've always received great service and found them to be very family friendly and very accommodating. We always get the BBQ Pork. It's great. \n\nNoticed during our most recent visit in April 2012 that the inside has been completely remodeled and is really nice. Met the owner during that visit and he was incredibly friendly. \n\nIf you're in the area definitely worth visiting.", "author": "Autumn S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-24", "description": "Good quality Chinese restaurant. Got the lobster and duck dim sum(comes with white fluffy steamed buns, add the duck and green onion and a teaspoon of sauce ooooofff). Both were tasty and seasoned just right. \n\nExcellent service too, very friendly and helpful.", "author": "Comyar S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-19", "description": "Definitely one of the best Chinese restaurant in sf! The food tastes authentic and delicious. In addition, the environment is calm and welcoming. Staff was patient and very attentive. Would definitely recommend this place to family and friends :)", "author": "Camille M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-07", "description": "My husband and I went all the way from Gilroy to meet with my good friends from NYC in San Francisco.  It was lucky that we went to dine and chat in Garden Restaurant.  Our experience was GREAT.  If there is a six star rating we would be glad to do it!\n\nThe food, all the dishes we ordered were delicious.  We had not had such wonderful dishes for a long time.  Believe me, since all four of us are native Chinese.  The bill for such good food was much less than we expected, plus they gave us two dishes for free, a well cooked nutritious soup for us, and a meat bone for our dog.  Everybody smiles.\n\nWe picked this place because it is upscale, clean, and quite so we could chat pleasantly.   We didn't expect that our well behaved German Shepherd was welcomed there.  The first thing we noticed was the floor.  It was so clean that we knew our always clean shepherd could sit without a problem.  \n\nThe restaurant boss is a dog lover.  He loved our shepherd, and he loves all the dogs since he has dogs his own.  He treated the dogs like humans, and even has two rooms downstairs to make them happy.  \n\nOur dog was very quite that night.  She was contented.  She got a big piece of delicious meat bone and a taste of all our delicious food.   \n\nWe don't go to SF that often, but we thought we found a treasure in SF.  Anytime later we go to SF this is our restaurant!\n\nDid I forget to mention that this restaurant is also super conveniently located:  It is just across the China Town's only big parking lot, Garden Parking, and you will get a two hours valid parking from this restaurant.", "author": "Shawna S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-02", "description": "Was staying at the Hilton across the street and decided to eat here for dinner, so glad I did! Probably some of the best Chinese food I have ever had! And really reasonably priced for the portion size! Will come back next time I'm in town again", "author": "Sierra M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-18", "description": "Last week, I went to breakfast, The food here is really excellent, Very good service. Neat and clean. I like the ambiance because the waiters don't rush you out .\n\n上週，我去吃過早餐，這裡的食物真的非常出色，很好的服務。整潔，乾淨。我喜歡的氣氛圍，因為服務員不會催你。", "author": "Eric W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-03-29", "description": "Wow!  This place was terrible!  I guess we should have thought twice before entering... seeing that it was a beautiful sunny Saturday in SF at 12:30pm -- and there were only 3 people in there!  Here's the breakdown:\n\n~ Waiter was nice.\n~ They brought us tea, right away... then it was downhill from there!\n~ I asked for water... it never came!  (after 4 requests)  Really?!?!  How hard is that?\n~ They don't give you plates to eat on... just bring your food out on the plates that it's served... and I'm not sure what they expect you to dish your food onto?\n~ I asked for two plates... and they were annoyed.\n~ Hot and sour soup was ok.\n~ Crab Rangoon -- was just Rangoon!  There was no crab present!  Just deep fried won ton wrappers filled with cream cheese.  And they give you about 2 tablespoons of sauce... so be sure to use sparingly! ;-)\n~ Honey BBQ Pork was as much meat as it was fat and gristle! Yuk.\n~ Pork Fried Rice was bland, and the pork/egg had a strange flavor/smell\n~ Hong Kong Style Beef Chow Fun was HORRIBLE!  It was like they marinated the noodles in oil overnight, and then cooked them in a vat of oil.  The dish was so oil laden and COMPLETELY TASTELESS, I had two bites (first one... terrible, second one... just to make sure!) ;-)  Then I tried to pawn off on my husband, who will generally eat just about ANYTHING... and that was a no-go!  He had one bite... and pushed it away.  We just left it for the waiter to pickup and throw away.  When he asked us if we liked it, we told him that we didn't -- as it was saturated in oil and had no flavor... he just laughed.  THAT was annoying!\n\nWith so many amazing places to eat in Chinatown, I would NOT recommend this one.  We were going to go for Dim Sum... but the pushy sales ladies at the corner bamboozled us into eating there.  \n\nOur bad... :-(\n\nThis was a MAJOR food disappointment, don't let it happen to you...", "author": "J O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-15", "description": "Had a mini-vacation in SF w/ some friends this past weekend.  After a day walking around all day (w/ 4 kids in tow) we ended up in Chinatown.  We purchased some cheap gifts in the stores and were ready to collapse by the time our bellies screamed for food.  Looking for a good burger joint and failing (just kidding) we came across this restaurant.  This place was the perfect ending to an exhausting yet fun day.  The prices were fantastic and the food and service were solid.  The flavors were subtle and tasty.  All 8 of us enjoyed the dinner and the final bill including tax and tip was $108.  TOTALLY worth it.", "author": "Ron F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-25", "description": "Really good Chinese food, right next door to the Hilton FiDi. Good shrimp chow mein and seafood wonton soup.", "author": "Hal L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-09-10", "description": "If I could give this place negative stars I would. The service here sucked. Had to walk to the register to place an order. Food was bland and rice was not fresh. Not to mention why does a restaurant need a two-way mirror? Kind of creepy don't you think? When I asked for the check the lady yelled the total from across the room. Never coming back and sure the hell not recommend to anyone. But I heard the lunch buffet is not too bad.", "author": "Jessica B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-10-02", "description": "Good food - the appetizers were out fast and impressed us. I got the salt and pepper tofu, David got his pot stickers, and we had some spring rolls to share.  They were all very fresh and flavorful.  Then we waited...and waited.  Davids entree - general cho chicken was a hit.  Great sauce, unburdened by veggies, just the way he loves it. And we waited ...and waited.  David had finished (at my instance) and my noodles still weren't there.  I asked for them to cancel the order only to be told they were almost ready.  Waited another 10 min and when I insisted we just get to go, i was presenters with a huge bowl of tasty noodles and the excuse that they had to wash out the wok for me (being vegetarian).  Hmmmmm.  I wouldn't go back, but all in all it was good.", "author": "R B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-17", "description": "Don't waste your time at R & G, this place is less expensive and just as good if not better!  Validated parking at Portsmouth Square garage.  The Peking Duck is to die for and the Crab is awesome.  You want a Chinese banquet in a relaxed and not rushed atmosphere, come here!", "author": "barry w."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-04", "description": "My wife and I took a chance , and we were rewarded with friendly service and started with crab rangoon followed up by lemongrass soup and then an order of peeking duck and salt and pepper crab.\nThe food was served hot and fast. The highlight was the salt and pepper crab!", "author": "Matthew G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-05-24", "description": "Where dat garden?\nWhere da mulch?...Where da hoe?\nDa-yummm....I ain't seein' no garden.\n\nBut I do see some won-ton soup, and I needs me some won-ton soup. Since Hon's Wun-Tun House was filled to the gills, I decided to give this place a try. Across the street from Portsmouth Square on Kearny, it ain't horrible...it's like a Chinese-style greasy spoon with little mini-booths for solitary diners like me who just want to eavesdrop on the negotiations transpiring in the adjoining mini-booth. Negotiating about what...I don't know....but I guess tickling costs extra.\n\nI went for the $4.95 bowl of the House Special Woh Won Ton chock full of stuff - shrimp, pork, chicken parts, button mushrooms, bok choy...you name it...it was in there (see my photo). A good, hearty bowl for the money though hard to slurp given all the odd sizes of the ingredients. I was in and out of there in twenty minutes, perfect for a meeting-intensive day like I had. They also have country clay pots, rice plates, lo mein and chow fun, even egg foo yung..so I may come back to look for that garden...Where dat garden?\n\nFOOD - 3 stars...a hearty bowl of everything but the kitchen sink...still my heart belongs to Hon\nAMBIANCE - 2 stars...kinda old....and where dat garden?\nSERVICE - 3 stars...like a blitzkrieg\nTOTAL -3 stars...a middling Chinese diner...could do better, could do worse", "author": "Ed U."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-04", "description": "---------LUNCH ONLY-------\nThis review is strictly for food only. Because if I had to review the \"cleanliness\" of the restaurant, it'd prob get knocked down to a three haha. But, honestly, I expected it since it's a Chinese restaurant =x \n\nANYHOW, the food is pretty good! It's very flavorful, great price, and service is quick (perfect for lunch). The garlic string beans, walnut shrimp, and chicken were my particular favorites. \n\nService and decor are pretty on par with the rest of Chinatown's restaurants. If the water spots on the glasses disgust you, just ask for a new one (although I can't promise the new one will be better). But food wise, I'm a fan.", "author": "Diana Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-28", "description": "Loved the service and staff here! They were really friendly and attentive, definitely had enough people to keep the place running on a busy weekend night. As soon as we walked in from the cold outside, they had hot tea on our table. The Kung Pao chicken was pretty yummy with good quality pieces of meat (not fatty or chewy like a lot of places). Hot and Sour Soup could use a little more salty flavor, we took the soup home and added soy sauce which made it better. We would definitely come back if we're in the area again!", "author": "Tiffany M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-01", "description": "On a recent visit to San Francisco, we stumbled upon this restaurant for dinner after having tried unsuccessfully to get in the R and G Lounge up the street.  \n\nThe Garden Restaurant was a nice surprise! The garlic house crab was phenomenal. -- in fact, my husband and I preferred it to R and G's salt and pepper crab, which we ate the following weekend.  Also had the Mapo Tofu and a mixed vegetable dish, which were also delish. Dishes were reasonably priced.\n\nStaff was very friendly and accommodating.  Service was quick. Came here at about 7-ish on a Sunday, so the vibe was relaxing.  \n\nRecommended!", "author": "Dori F."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-01-28", "description": "My friends and I walked into this restaurant because Chinatown was the last of our stop in our San Francisco tour, and we figured it was fitting to have Chinese food.  Unfortunately, the restaurant that we wanted to try had a 45 minute long wait, and we didn't have the time to wait, order & eat dinner, then make it to SFO in time for a flight.\n\nOne of my good friends is Chinese, so I left her with all the ordering and that was an adventure in itself.  We had to order through 3 people before getting our orders in.  The first two people that attempted to take our orders either didn't know the menu at all or couldn't understand us, which I find weird because we had all languages covered to be understood.  We finally got to put our order in, so we sat and waited.\n\nWe were given Sweet and Sour soup to begin with, and normally I would eat the soup.  This time around I didn't mainly because my friends and I agreed that the soup was too peppery.\n\nOnto the main dishes, we ordered Pan Fried Noodles, which were okay.  My friends and I have had better in Chinatown in Los Angeles, New York and in Boston.  Then ordered a spicy green beans dish, which wasn't too bad.  We also ordered Honey Walnut Shrimp, which probably saved our dinner from being horrible.\n\nWould I recommend anyone coming here?  Most likely not.", "author": "Darlene P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-17", "description": "The food was delicious, this is my new favorite Chinese Restaurant.  Hot & Sour soup is to die for.", "author": "Colleen C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-09-10", "description": "The a-la-carte for place was ok.  I had coworkers telling us it was as good as R&G but a lot cheaper.  \n\nService: A smile wouldn't hurt, seriously.  We had 3 people come take our orders and seemed to rush us even if we said we needed a few minutes\n\nFood: lots of rice (seriously) took up half the plate, but it was \"ok\" next time we'll try to the group style menu, hopefully food will be better.\n\nParking: It's China town...look for a parking garage, there's one across the from the Hyatt.\n\n$7-9 for lunch a la carte, isn't too bad...", "author": "Omar L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-22", "description": "Ppl here r cool. Good service is what I've experienced. Lobster specials too", "author": "Johnson H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-02", "description": "Good food and the owner is very honest. My dad's friend accidentally left his wallet in the restaurant and the owner called him back to give him his wallet back. That's good customer service from a Chinatown restaurant. =)", "author": "Tracy C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-10", "description": "A good alternative to R&G Lounge across the street. This place is less crowded and food is equally good. We tried their ginger and scallion crab and fish fillet with stir fry vegetables and they were all good. We would like to go back and try their speciality lobster with noodles. This place was reasonably clean for a China town restaurant. This is not a fancy Chinese restaurant but they try to provide good service.", "author": "Raman S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-05", "description": "Not bad for late night eats on Kearny St.  There aren't that many good places open on Kearny without it being too pricey, fancy, or a long wait.  We opted for this place and it was alright, definitely a good option.  The restaurant has a lot of seating, clean and comfortable ambiance with a flat screen tv (ahem!), and good service.  We ordered minced lake beef soup, salt & pepper spareribs, salt & pepper crab, salted fish fried rice, chx chow fun, live stir fried lobster with udon noodles, and they served a delicious taro hot dessert.  I didn't try everything but it was good considering I was sober and everyone else at the table wasn't.  It was about $300 total.  Tasty!", "author": "Meredith K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-04-14", "description": "A friend of mine introduced me to this place when I asked for a place to dine around chinatown. The food is quite ok., but I was disappointed by the treatment. They added a surcharge of 15% tips on top of our lunch bill. It was only four of us. I asked a lady ( looks like the owner or manager) about the surcharge tips, she said because the computer automatic do so and ignore me. And I asked another waiter to show me about the policy for adding surcharge for 4 ppl. He gave an excuse because he taught we were tourist and they did it for my convenience. There are nothing in their menu about surcharge tips for 4 ppl. He voided the surcharge tips, but never apologize about their unethical behavior.", "author": "Allie T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-12", "description": "Pretty awesome customer service. Good food, good portions for ala carte. Try salt and pepper porkchop and beef fried rice! Most definitely delicious. Porkchop was on point.. It's not like those hard, over cooked porkchop. It was chewy, and flavorful!", "author": "Cristina M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-02-13", "description": "I came here for lunch with my co-workers at 12:00 on Friday. There were a couple people seated but it wasn't to busy. We were seated right away and we gave our orders right away. \n\nEverything started going downhill from then... our waitress never came back and 25 minutes has gone by. Finally we were able to get the attention of one of the waitresses and told her that we need to go.  We asked for our check and to pack up our food to go.  They gave us our check immediately and never came back with the food... another 10 minutes went by and we had to ask.\n\nThey told us it'll be another couple mins... now its been 35mins and we saw several tables that sat after us received food before us.\n\nAfter we left we finally got to eat our to go and they were cold and disappointing. I don't think i'll come back here after this.", "author": "james y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-21", "description": "This is a very solid establishment.  I was staying literally 50 feet at the Hilton and decided to give this place a try.  I ordered the sesame chicken and also the dumplings.  I hoped that the dumplings would have been steamed, but they were fried.  Everything was very good and packed nicely for take out.  There were so many options in this area and there may be better options but the food was solid and the ease way nice.", "author": "Jared M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-19", "description": "The service was impeccable. The waiters specifically catered for our vegetarian requests. Every dish was authentic and traditional, which reminded me of my years in Hong Kong. We could feel that the restaurant was treating us with their heart and soul. Will definitely come back again.", "author": "William R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-10-08", "description": "Nice place to run in and get a quick bite to eat.  Haven't tried the crab yet that some have raved about.  It should be good as I hear the chef is from R & G Lounge.  (not confirmed, just something I heard)  Wasn't impressed with the Salt and Pepper Chicken wings because it was four wings or two whole wings for $5.95.  for something that pricey, it should have been excellent. I'm not at a steak house, I'm in Chinatown for goodness sakes!  It's should have at least been eight pieces.  Aside from all that tho, Brian our server was excellent.  I was impressed by his professionalism and obviously takes pride and his job very seriously.  If I had a restaurant, I'd hire him in a second!", "author": "Nancy L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-07", "description": "I wrote this place off as a tourist trap, but had to come for a family dinner. I was pleasantly surprised! I'm still thinking about their delicious yellow curry crab and DEEP FRIED Peking Duck buns. Omg they were so good, especially dipped in the curry sauce! I've never seen that before and am a huge fan now. \n\nI recommend their sweet sticky spareribs and chicken (which was deboned) w onion & ginger. Servings were small for a Chinese restaurant, but service was excellent. Our dishes were changed out numerous times. \n\nVery happy with the value and cannot wait to go back for curry crab and deep fried buns! The manager of the place was real friendly and made us feel welcomed.", "author": "Freckles H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-12-28", "description": "Great Service and food.\nAuthetic Chinese food. The best Salt & Pepper Crab comparable to (even better than) R & G. The price is worth at $26/each. MUST TRY!!! Will definitely go back again. \nHighly recommended for dinners!", "author": "Ken L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-06-22", "description": "If I could give it less than one star I would.  I went there for lunch on a layover with my airline.  After making me stand in the entrance for nearly 10 minutes, they rudely told me they were closed even though it was only 3 o'clock in the afternoon and there were others dining there.  When I tried to ask them about this they waved their hand me as if they were shooing away a fly.  I have never been treated so rudely by a restaurant, and I certainly will never be back.", "author": "Allen W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-11", "description": "FIRST OF ALL...... IGNORE ALL POSTS PRIOR TO FEBRUARY 2011....\n \n                   NEW OWNER, NEW DECOR, NEW FOOD\n          NICEST REST ROOMS IN CHINATOWN ~ SPOTLESS \n\nRecently I had 3 women helping pack up my belongings as I was moving. They worked really hard and deserved a delicious meal. Everyone agreed on Chinese Food. I really had no idea of where to go as most Chinese restaurants have really dirty carpeting, dirty bathrooms and that is unappealing when eating. \n\nSomehow, I spotted THE GARDEN RESTAURANT and we wandered in. My mouth dropped as the decor was NOT CHINESE style. It was .hip, minimalist bistro! I was astounded as the main wall was covered with brushed stainless wine holders with real bottles of wine. The colors were a rich and warm brown with a mellow golden mustard accent. The wood pillars are the same rich brown as are the booths. We could have sat in the dining room with round tables but opted for a spacious booth. \n\nWe perused the menu and i ordered something special and the women were all happy with what was ordered. We had Honey Walnut Prawns as an appetizer and I was truly impressed with the beautifully carved carrot phoenix bird. It was a small masterpiece of golden carrot, so delicately rendered. What amazed me we were in an unknown Chinese restaurant, not a white table cloth establishment. Its beauty added to \nour enjoyment of the delicious dish ~ the walnuts were coated with a honey glaze, they were crisp and crunchy with the added toasted sesame seeds. Basically we swooned and were really impressed with the dish. \n\nWhen we were served the roast duck we got Eye Candy once again, it was from eating the beautifully presented dish as well as THE TASTE ~ WOW!!!! It was the best we had ever eaten. Asparagus was in season as it was April 15th and they at their prime. The prep was minimalist, just a bit of sesame oil and perfectly cooked and seasoned, we basically had to restrain ourselves from eating more than our fair share. The noodle dish I ordered, Hong Kong style pan fried noodles with softly scrambled eggs, scallions, prawns and cilantro disappeared quickly. \n\nIf we were BELLY RUBBERS, we would have done that too, we were all happy with the well prepared cleanliness and decor. \n\nMost of all, we really liked the Handsome Owner, Alan Kwong. He is gracious and giving. nice appearance to his guests. Plus he is definite Eye Candy and makes a wonderful host as he is quite charming. \n\nI was so impressed that I took guests there FOUR TIMES IN ONE WEEK!! I have never done that before. \n\nTHE GARDEN RESTAURANT IS MY FAVORITE CHINATOWN SPOT!! \n\nGOOD LUCK ~ ALAN and NEW GARDEN RESTAURANT. \n\nPS: I met his Mother, Aunt and Wife, Jennifer too. All Lovely Ladies!", "author": "ELINOR H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-25", "description": "The Garden is my favorite Chinese restaurant on Kearny Street. I always eat here when I'm staying at the Hilton, which is right next door. I sometimes order to go and bring the food back up to my room. I've tried a range of things from the menu, but I like their noodle dishes the best. The beef chow mein is especially good.\n\nAlthough it's not as upscale as R&G and some of the fancier places on Kearny, it's generally faster, a bit quieter, and less crowded. The food comes out quickly and I've never had to wait to be seated.\n\nIf you are staying at the Hilton and want a good, convenient dinner, you should definitely give the Garden a try.", "author": "Ryan P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-03", "description": "If you don't know.... there is a new Boss for this Restaurant.\nYes, it has a new friendly Owner, new management and a new chef.\n\nSeafood is served fresh!\nHere are a few of my recommendations:\nFried Rice with Egg Whites & Scallops is really good and non-greasy.\nA Must Try is the Fried Dungeness Crab. \nTypically I struggle with eating crabs because it can be a bit messy. \nBut it's well worth it here. \nThe crab meat falls loosely from its shell and tastes delightful. \nJust thinking about it makes me want to go back for more. (Drooling)\nThe Peking Duck is really good. Buns are sweet and the Roast Duck isn't too salty. My boyfriend could eat a whole plate to himself because it's so tasty. \n\nOverall my experience was pleasant. \nInterior is updated and clean so don't be fooled by its cover or surroundings.\n\nTip: I learn the Chef was from a local well known Chinese restaurant so trust me when I say you'll be satisfied with the quality and price from this restaurant. \n\nPrices are fair and affordable. \nCheck out the family dinner menu.\nPrices are really reasonable.\n\nParking Garage is conveniently across the street and the restaurant offer validation as well.\n\nI AM A HAPPY RETURNING CUSTOMER!!!\n\nPhotos will be uploaded soon. :)", "author": "Lynn T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-05-26", "description": "I was staying at the Hilton next door and was sick of a $22 breakfast that was a bag of eggs boiled until runny an crunchy bacon with dried out waffles. So I walked out the front door and looke to see what I could find. \n\nI saw a Chinese banner with 'ham and cheese omlette' under it and decided to go for it\n\nPlace is cash only but extremely good value for the price. An omlette' with toast and hashbrowns was 6.95. Compared to 22 next door that was awesome. \n\nThis is simple food done well with the breakfast menu.   I haven't done anything other than breakfast so can't speak for the rest but I'd you want a three egg omlette' with some fried potatos and it to taste decent and not pretensious high dollar stuff it's a great stop", "author": "Tom B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-06", "description": "OK, I read the other reviews for forgetting about the bad old posts, and we are glad we did. \n\nWe had 10 people in our group, our waitress too awesome care of us, the food was great, and there was plenty of it.\n\nI would actually give it 4 stars if it was normal, but the fifth star is to make up for the old bad reviews.", "author": "Denton S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-02", "description": "On my last day on the west coast, I stopped in here with my other attractive travel-mates. It was one of the best decisions we made on the trip. \n\nWhile the owner forgot part of the order, he was very up-front about it. The food came out quickly and was very delicious. The Diet Coke tasted fresh like it had been recently canned. \n\nI want to move to San Francisco and live in The Garden Restaurant, surviving on nothing but their General Tsao's Chicken and whatever the tofu thing was that my friend got.", "author": "Brandon C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-07-10", "description": "Came here 2 days ago on 07/08 in the evening after a full day of the Fillmore Jazz Festival and a movie with the SO.\n\nIt looks a lot different from the last time I visited. The white paper-as-table-cloths were gone, the Asian decor had become walls decorated with numerous bottles of wine sitting on modern looking wall racks. We walked in and the two of us were seated at a large booth. It was so large that we ended up sitting on the same side.\n\nThe Garden Restaurant's lobster noodles (with the wide flat noodles, not the skinny ones) is a favorite of my SO and it was his suggestion for the night that brought us here... But once we went in, we discovered that there wasn't any type of lobster noodles listed on the menu nor on the the chalkboard sign outside the restaurant door where I saw it written the last time we came for lobster noodles here. Not to fear, the waitress indicated that they still made them. Since I was craving something hot, we also added an order of crab meat soup, which neither of us had tried before. The waitress nodded and smiled as she took our order, advised us that the soup came in a medium size, then walked away, coming back with two empty bowls and serving spoons for our soup.\n\nThen came the weird part. Shortly after another waitress came up and asked what kind of noodles would we like in the lobster soup. Huh? I tried to explain that we didn't order lobster soup, we ordered lobster noodles and crab meat soup, but she seemed to become more confused before yelling back at our original waitress in Cantonese. Finally, she asked us to please give her our order again so she could write it down. She left looking a bit upset, then returned again only to take back the two bowls and the serving spoons that the other waitress had placed on our table. \n\nWhen our soup came (and it was more a large size than a medium), it was our original waitress who brought it to our table, started speaking unintelligibly, neither in English, nor Cantonese, nor Mandarin, and then - upon discovering that we no longer had bowls and serving spoons - became upset and walked back to the other waitress, speaking angrily the whole time. Perhaps they could work on their communication next time...?\n\nOtherwise the lobster noodles were good as usual - we always enjoy savoring the large chunks of lobster meat - and I really liked the crab meat soup although the SO thought it was bland and proceeded to adjust his portions with salt. Although instead of the house special crab meat soup we pointed to on the menu, I think they brought us the fish maw and crab meat soup - but the SO didn't notice and I wasn't going to make a big deal of it. \n\nIt all came out to $27, which is not bad for a whole lobster with noodles and a large bowl of soup for 2. When we asked for the check, our original waitress handed us the bill and started speaking unintelligibly again, but while we thought it strange, we ignored it as we were already on our way out after paying and needed to catch a bus. \n\nWe'll definitely be returning as the lobster noodles are as good as ever, however we will be more aware of waitresses muttering unintelligible things at us and the not-so-good communication with each other over what was ordered.", "author": "Jali D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-11", "description": "Amazing!  Best Chinese food I have ever eaten.  Wonderful service, perfect flavor and texture.  Homemade chili garlic sauce...I'll stop there, but could go on...", "author": "Monica U."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-04", "description": "Lunch specials are really great! It's in the middle of a great area, pretty easy to get to on foot.  Even if you go during regular business hours, the food is very reasonably priced. If you can go during lunch time, I think I got 2 dishes and water for like $7!  I keep hearing their breakfast menu is delicious, so I'd really like to try them in the morning.", "author": "Sheena C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-12", "description": "Great food and even better service. It was only expensive because we ordered the salt and pepper crab, which was delicious. Definitely recommend!", "author": "Leanne L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-07-15", "description": "Ordered the $138 set menu to go.  Food OK, but entree portions were very small.  Much larger portion when eat in.", "author": "May L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-10-01", "description": "False Advertising...\n\nWas on my way to my usual spot Kam Lok to get a beef chow fun for lunch today and I saw a sign that said \"special on beef chow fun today for $4.95 (written only in Chinese with neon ink)\" in front of the Garden Restaurant.  I said scored!  Went in, sat down and ordered without even looking at the menu, thinking, \"they can't screw up on this common dish right?\"\n\nThe dish came pretty quick and it was ok.  The noodles were thin and on the chewy side, which probably meant the noodles weren't fresh.  After I scarfed down the food, the tall male waiter handed me a bill for $6.95 plus tax which totaled $7.54.  I asked him about the discrepancy and he said my dish is not the special for the day.  I showed him the sign in front and he said only the two signs \"directly\" in front of the restaurant showed the correct specials and prices.  It didn't make any sense to me at all and I didn't want to argue over 2 bucks so I just told him not to put the other sign out as it was confusing.  He said thank you and took my money.\n\nI know, I know, I probably should've asked about the price first before ordering.  I will just stick to my regular spot that provides better and cheaper food with a smile in the future.", "author": "Randy L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-16", "description": "I am traveling with a girl scouts troop and was referred to this restaurant by a very kind stranger.  She even called the owner to let her know we were coming.  We arrived at the restaurant and was surprised a table reserved for us.  The waitress was kind and our food arrived quickly.  Alan, the owner even came out and said hello and sat near our table to chat a little bit.  The food itself was the usual chinese food fair, my daughters ordered the chinese brocholli/beef, sweet&sour pork.  Both liked and finished.  I ordered the tofu/beef, was good as well.  \n\nI would give it a 3-star rating, the food didnt have the WOW factor. but I gave it 4-stars for the personal service.", "author": "Racquel U."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-01", "description": "Came here with a tour group for breakfast. The tour group had dropped us off in Chinatown, but I was craving an American style breakfast. \n\nLuckily, The Garden Restaurant offered eggs, bacon, hash browns, and toast for only $4.95! With my cup of coffee...it was a great price. The tast of the food was actually pretty good. The waitress was friendly and offered quick service.", "author": "Rasien I."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-09", "description": "The best customer service.   Bill the server was great and accommodating. Food was tasty.", "author": "Jane T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-07-02", "description": "This place was recommended by a local who said it was good and reasonably priced.  The latter I agreed, as for good, that was not my experience. I ordered something simple like roast duck wonton noodles. What I expected was 1 dish with duck meat, wonton and noodles in it. Many things went wrong. I got a small plate of duck on the side that was very fatty with lots of bones. I got a bowl of wonton soup with a wedge of lettuce and no noodles. I asked the waiter about the missing noodles, he apologized and went back to the kitchen to ask them to make a bowl of noddles. I was half way through my wonton when he realized no one brought me the bowl of noodles. Waited so long for mediocre food.  Granted I did not try their seafood dishes like salt and pepper crab and from the other dishes I saw, they looked decent. Quite a lot of regulars there as well so maybe they can't do a simple noodle dish.", "author": "Khiang S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-01-27", "description": "We came in around 7 and were seated immediately. The decor isn't really impressive, wonderful orchids tho. It had a great mix of customers. The waitress took our orders and then... She kinda disappeared. Took bout 20 mins for the food to show up. Not feeling too hot, I tried  asking for 'Tea with honey'  and I guess she was having problem understanding me, My boyfriend then repeated that I wanted tea with honey. And she said fine. When she returns she brought 2 cups of lukewarm tea without honey. \nThe food wasn't spectacular, place wasn't memorable, and not touching the wait service\n\nWhat led me to this place was the online menu that I have found online. I was trying to order out but I couldn't call. And after reviewing the menu. The prices have changed and increased. Its not an arm and a leg, but theres a bit of a difference. I assume that it's because under new management.", "author": "Patti G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-08", "description": "I am a fan of this place. They got service down right (Tea cup is always full)  and they have a very clean spot. Their lunch items are on point. I order all my hong kong stir fried noodle options here and never get disappointed.  I'd suggest eating here and not to-go, simply because you get more food. The old reviews are shitty, sure...but the change in ownership has done this spot some good. Get the crab and stay away from the clay pots. Everything else is legit!", "author": "Brian C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-26", "description": "Very good service. Neat and clean. Service people are very friendly and always smile to make you feel good. Superstar crab!", "author": "Jason D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-28", "description": "Didn't expect much when I chose a quick dinner at the first restaurant next to my hotel. But, I was pleasantly surprised.\n\nThe service was friendly and attentive without interrupting the meal. This is typically reserved for only fine dining in the US.\n\nI got the orange chicken, since my expectations were low. The orange sauce they brought out doesn't deserve the insult of being compared to others I've had.\n\nIf this is indicative of what SF's Chinatown has to offer, I now understand why people make such a big deal about it.", "author": "Jo R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-03-24", "description": "Rainy day in SFO and I didn't feel like wandering out too far but being so close to Chinatown I felt the need for some good Asian food for lunch.\n\nGood friendly service, reasonably priced, and clean restaurant but that's about it on the positive side of the review.\n\nFirst off I wanted Hot & Sour soup, but they don't serve that here (?!) so I opted for the won ton and it was very watered down and very little flavor.\n\nI had the Mongolian Beef lunch plate with fried rice and an egg roll.  Lacking flavor seems to be the theme here... the presentation looked nice but biting into it there was absolutely no pop in the sauce at all.  Fried rice was below average and the egg roll wasn't really hot when it came out.\n\nSo don't be lazy like me and hit the first place on the corner when you get to Chinatown... even if it is raining.", "author": "Chris N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-21", "description": "Just like other Yelp reviews, good food with reasonable price. Roasted Duck is must have. We also order day special steam crab only $10 each,  light and fresh. Tentative, friendly staffs. Will be back!", "author": "Theresa C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-02-01", "description": "If you are a fan of MSG, this is the place to be.  We went here for lunch, the interior still smelled like a fresh paint job.  The lady gave us some meat soup (mainly watered down).  I ordered the ho fun with black bean sauce it was $6 or $7; i forgot.  The dish looked yummy, onions, bell pepper, noodle.  It was really greasy and my stomach started to turn as soon as I took the third/fourth bite.  I was hungry so I kept eating.  Now as I write this review, I'm regretting it. My stomach was turning the rest of the day and I still got the runsssssss.\n\nI wonder how long has that \"GRAND OPENING\" sign been there.. let's see today is 02/01/2011.", "author": "Elliot Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-01-11", "description": "Been here twice since the remodeling and change in ownership.\n\nI was excited to see the changes and wanted to try it out for lunch. I love their Hainanese chicken dish ($6.95) and they gave me extra garlic ginger sauce. I wish they gave me more chicken though as I probably got about 6 pieces combined. Those of you that have eaten a Chinese chicken will know that they are slim and small. \n\nMy friend had a fish dish with rice and was rather disappointed with it. I don't blame her because Thai sweet and sour sauce was literally dumped onto the fish. \n\nThe prices are very reasonable and affordable especially for lunch. They even gave me soup both times. The waiters were friendly and I got my food rather fast.\n\nIt looks cleaner than before. I was told by the ownership that the chefs have changed as well. I, however, do miss the old fried chicken and noodles.\n\nConveniently located right next to the MUNI 8X station going towards Pier 39.\n\nAmple meeting space which is rare in Chinatown. Many tables. Portsmouth Square parking lot is right across the street. Good for tourists who are staying at the Hilton next door as well.", "author": "Tina C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-03", "description": "We haven't been here in a few years so we decided to try it out for lunch.  The place was completely remodeled.  It is cleaner and the food a lot better!  Before it tasted good, but was really greasy -- your typical \"dive\" if that is what you want.  Now the food seems to be a bit higher class.  It's not as good as a banquet type of restaurant, but it is really not too bad.  The prices were reasonable, but still more than the super cheap restaurants you find a few blocks away in Chinatown.  If you are looking for a presentable place to bring guests and don't want a small, dirty restaurant, this is the place to go.", "author": "Michael L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-08-27", "description": "I recently went to this restaurant with my wife and 2 year old son and had a very pleasant experience.  Upon entering with a crazy 2 year old, they were warm and welcoming.  Obviously they had experience with kids and allowed us to pick a convenient table and were very attentive.\n\nWe ordered lobster noodles, green beans and wonton soup.  Our son is usually picky, but ate almost everything.  My wife and I didn't hold back and polished off the rest of the food.  \n\nSome restaurants are annoyed when you bring kids, but they actually were thoughtful enough to strategically place all plates, food and water out of his reach.  \n\nThen we got to go across the street and play at the park.  We'll be back!!", "author": "Wen F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-03", "description": "Chef from R&G - need I say more?!  the crab - definitely BETTER!  the light tempura style coating is SO much better than R&G's heavy handed flour and ???.  the peking duck...served like I was back in Hong Kong.  skin and meat on one serving dish with the bones on another.  The buns...fluffly and light.  Pea shoots...light and always a hit with hubby.  And I HIGHLY suggest the pan seared soy sauce prawns.  Um...seriously, I can eat all of it myself..of course, sharing is BEST.  GO!!", "author": "Sonia C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-03", "description": "Service was impeccable. Food was really good! Prices extrememly reasonable and the restaurant was clean. Beer available, and wine but you need to buy the wine by the bottle.", "author": "BL C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-01", "description": "Best hot and sour soup i ever had!  service is good. They even held my lost credit card for a week until i was able to come back.  lobster noodles were great.  a great find in China town", "author": "Allan B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-21", "description": "Great food. Great service. Best quality Chinese meal in a long, long time.  Every dish was delish", "author": "paul b."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-10-14", "description": "There aren't too many choices for food on a Sunday morning in the outer FiDi area, but I would recommend you avoid this place.\n\nBeing hungover from Oktoberfest, I saw a sign advertising breakfast next to the Hilton. Figuring this would be a safe place, and not wanting the Subway across the road, I popped in for some takeout.\n\nThey had two types of breakfast - western and Chinese. I tried the Singapore Style Chow Mai Fun ($6.25 + tax) and it was really disappointing. The noodles are bland, its covered with onions, and nothing seems to taste good. Avoid this in the future.\n\nThe other patrons were probably from the hotel. On the left of me was a family who ordered the western breakfast of pancakes and bacon. The father has lived his entire life without using a knife to cut his breakfast, and there is no point trying something new. To my right was another family, with the dad in sweats looking like he should be in The Sopranos. The daughter was about 6, and had a large coffee. Nice one bruvva!", "author": "Joseph T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-14", "description": "My wife and I had dinner at The Garden restaurant last weekend and really enjoyed it. Food and service were fantastic. They customized a few items for us and were very helpful. We had the seafood fried rice, sizzling beef, fried crab and seafood soup. All were really tasty. I'd recommend this restaurant.", "author": "David S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-08-06", "description": "After factoring in the lobster noodle special, Garden Restaurant earns 3.5 stars.  It offers authentic Cantonese fare at reasonable prices and in a clean and tidy setting.  Since the restaurant is located at the perimeter of Chinatown and next to the Hilton, the menu also offers plenty of \"safe\" touristy lunch specials (in the spirit of cashew chicken, etc.) for tourists and the faint of heart.  On the other hand, Cantonese food veterans will enjoy the roast duck wonton soup with veggies was probably above average Chinatown cuisine and the surprisingly tasty lobster noodle special (well-priced at $14.99 with thin or broad egg noodles).  I don't know how long the special will be available, but without it Garden Restaurant is safely in the three-star zone.", "author": "Chris T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-07-30", "description": "It was ok. There was no orange chicken, which is basically all my kids eat. We had the kung pao chicken and it wasn't spicy at all. We also had the sweet and sour pork, and it left little to be desired. Pork fried rice was boring and bland. Egg rolls were so so but a little too greasy. The wait staff was behind us like vultures waiting for us to finish and I'm not sure why it's not like it was a super full house and it was no where near closing time. Over all it wasn't the greatest experience, but it was edible and the place was clean.", "author": "Gaby M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-21", "description": "I came here for dinner with my family tonight, and I pretty much had every well-known dish of the restaurant.\n\nQuail, Chinese-Salty Egg Deep Fried Crab, Twin Lobsters, Wintermelon Lamb Stew, Vegetables, Deep Fried Flounder, Dried Shoots and Lamb Stew over Lo Mein.\n\nI'd have to say that the Chinese-Salty Egg Deep Fried Crab is a must-try!!\nThe exterior was layered with a thin fried layer of Chinese Salty Egg, like the taste of the egg yolk of moon cake.  The crab itself is cooked perfectly, not overdone and chewy.\nThey also serve the crab.. head innards.  Also deep fried, but not encrusted in batter, so the taste is still there.\n\nThe deep fried flounder is also very good here; very crispy, not burnt, and the meat was perfect; not overdone and chewy, but melts in your mouth.\n\nIf you're a meat lover, try the Wintermelon Soft Boiled Lamb Stew Hot Pot.\nThe Lamb is deliciously juicy, tender, tendons were soft, and the Wintermelon is hot and soft.  The soup it's being cooked in is pretty delicious too.\n\nI don't remember the menu, but it had quite a selection of other choices, but these were the restaurant-brand-name dishes.\n\nI'd have to say the first impression upon entering the restaurant, it seemed designed for smaller parties.  The center of the restaurant was designed for many parties of 4 sitting arrangements.\nHowever, they do have 6 tables toward the back of the restaurant that seat parties from 10~15 people.\nI would say it's not a very popular restaurant yet because they've recently switched owners.\n\nThe decor of the restaurant isn't typical for an Asian restaurant, it's very clean, not commonly seen in many restaurants around Chinatown.  Even the restrooms are kept clean, and free of water spills.\n\nThe service is what's expected of Chinese-style restaurants, the waiters only come to you when your food's ready, or if you flag them down.  They're constantly moving around, but it's still a lot easier to get serviced than at other bigger restaurants.  But that's the type of service that is expected of genuine Chinese restaurants; the waiters don't impose themselves on you because they feel that is impolite to disturb people who are eating their food.", "author": "Jimmy H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-04-22", "description": "So it was a toss up between 1 and 2 stars, so given the proximity to Chinatown and the potential for other good Chinese food instead of this place, I had to give it one star.  So the reason I event went in here is lame.  It was raining, I was hungry and tired from traveling and it was easy.\nSo it's weird that it looked more like a shabby American diner than a Chinese place.  But I stayed.  I ordered a spicy chicken dish on rice.  Normally when I get a chicken dish, there is some vegetables with it.  Not here.  Just chicken and a very slightly spicy brown sauce with fragments of red chili.  Plain white rice mounded beside it (Lunch special).  All dark meat chicken, no white mixed in for good measure.  Detective says... cheapest chicken served in this dish.\nChoked it down, noticed \"Cash Only\".....\nWow, will I make a bit more effort next time when raining outside.", "author": "Matt G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-08-03", "description": "One of the worst meals of Chinese food ever. Spring rolls icy cold (actual ice crystals inside). Hot and sour soup lukewarm, and returned to us lukewarm and without a ladle. Most dishes bland. Server slow and confused. Didn't ask us whether we enjoyed our meal, which was the most perceptive they were all evening.", "author": "Robert L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-08-13", "description": "I was forced to go here with co-workers. Whatever you do, don't order the salt & pepper beef with fried tofu. It was a horrible choice picked by someone at our table. If you have to go here, the shrimp with lobster sauce & vegetables is good. You'll be disappointed by the eggplant with garlic sauce (an order not on the menu, but we like this dish at other places). Their vermicelli style chow mien is whatever.", "author": "Faith W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-08", "description": "Lunch special!  This place is packed during lunch, not with just work people on lunch break but with actual Chinese people.  You know it's gotta be decent.  The lunch specials are $4.95.  Usually beef/chicken broccoli or something familiar.  Always cooked fresh and always a health portion.  A def must for a quick cheap lunch.", "author": "Thugnificent M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-10-19", "description": "I really wanted to hate this place! It isn't much to look at, a little too dirty but you have to kind of expect that at a China town hole in the wall. The thing is that I didn't have a lot of time and they took so long with my chicken porridge that I had to take it to go. \n\nI really want to two star the place but the porridge was just too good.", "author": "Manny F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-01", "description": "Not a very busy place when we came in, but the service was decent.  The Kung Pao chicken was great, with fresh vegetables.  The portions were huge.", "author": "Lauri H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-02-13", "description": "Its a chinese food / 70s american grub place. How is that not awesome?\n\nBreakfast is cheap and the sausage is top notch.\n\nThey have super cheap hamburger that could cost twice as much and still be great. \n\nPlus there is a second room that's never used that would make a great HQ for some sleazy gangster types", "author": "Matt C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-04-02", "description": "The food here is pretty decent I thought, but the service is maybe the worst I've seen.\nThe server never checked back once, even though there were maybe three other tables occupied.\nNever brought water I asked for, never filled coffee, nada~\nI felt invisible there.\n\nThe food there deserves another chance, but I won't be in a hurry to try again.", "author": "May L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-20", "description": "Very pleasantly surprised - I came here after another favorite place was full. Nice lunch, good price and very friendly. What else can you ask for?", "author": "George S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-11-16", "description": "It does not feel that I went to the same restaurant as that described by reviewers.  If I  didn't know what real Chinese tasted like, perhaps they would get more stars.  Had crab rangoon appetizer - overly fried, garlic eggplant (yuxiang qiezi) - bland, and chicken chao fen - bland.  It was edible (unlike Yan's Kitchen), but mamahuhu at best.", "author": "N P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-06-13", "description": "Whatever happened to good old Cantonese food?  This was the second time I ate here after the remodel.  The old Garden restaurant had pretty good Cantonese dishes.  Reliable chow mein, chow fun, and Yee Foo won ton.  Now, the chefs must not be Chinese.  Once we ordered Tomato Beef Chow Mein and got beef chow mein with sliced tomatoes.  What the ...!  It is on the menu and we ordered it in English and Chinese and got this strange looking I-have-never-cooked-Chinese-food dish.  The Hom Yhee Gai Nup Faan was like plain fried rice.  This place is across from Portsmouth Square, dead center Chinatown.  Let the tourist eat here.  They don't know the difference from Cantonese, Mandarin, Shanghai, or Panda Express.", "author": "Michael N."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-03-19", "description": "Serviceable enough ,with relatively quick service and reasonable quality food. certainly not worth going out of your way for. \n\nAdding dried chilis to an american Chinese chicken dish does not make it Szechuan !", "author": "Adrian B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-11-03", "description": "One of the very few places near the Financial District that serves breakfast at lunch.  Mama's this is not; in fact, the breakfast here is pretty similar to what I would be able to make at home.  But that's beside the point.  Sometime you just want breakfast for lunch, even if it's made with non-organic eggs, non-applewood smoked bacon, non-freshly grated hash browns, and non-homemade bread.\n\nThis is also a good spot if you're in the mood for cheap Chinese food (like when you see a Panda Express in the airport, and you think, \"I needs to get me some of that\"), but you want a step above from that place that sells three items and soup for $4.62 (admittedly, I still rock that joint once in a while).  The salt and pepper spareribs are surprisinly good (probably because they are super fatty), as are their dumplings and fried rice.  The egg rolls pretty much suck, however.", "author": "David C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-08-19", "description": "Came here last week and decided have to write a review. \n\nWorst restaurant in San Francisco. Bad service, bad food. AVOID!", "author": "K H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-01-30", "description": "i attended a chinese new yr dinner here last friday, and it was pretty good.  we got a banquet menu w/ all the usual items.  particularly good was the crab and the sticky rice that was stuffed into crispy chicken.  the staff was friendly, but i wished the guy would stop pouring wine into our glasses, because he kept mixing the wines!", "author": "Helen T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-10-08", "description": "I went there with a big group of 13 and had a very good experience.  The service and the food left nothing to be desired. The seafood dishes were very well prepared, not cooked in a lot of greese and fat like typical chinese restraunts.  The menu although traditionally chinese in many ways, had a distinct style that not only was satisfying (as an american person), but made me feel like the new boss has really taken strong ownership of the menu.  One of the high-lights for me was the Roast Duck, definetly a must order.  The decor was clean and we were treated with exceptional hospitality.", "author": "adele m."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-10-23", "description": "Absolutely disgusting. Definitely the worst Chinese food I've ever had in my life. I had the vegetable egg rolls. Greasy and bland and mushy inside, served with a horrific fluorescent sauce of some sort. Also had the Mao Po Tofu rice plate. Inedible. This is supposed to be a nice, spicy dish. The waiter said it had veggies with it. What I got was a plate of slimy tofu with FROZEN VEGETABLES (like those horrible little cubed carrots and peas, along with another overcooked, slimy unidentifiable vegetable that may have been a pepper). It was served in a gross, gelatinous, bland brown gravy. Spice (a defining feature of the dish) came from some jalapenos that they had thrown in. It was served with a side of just okay rice. Ugh, I could barely look at it let alone eat it. I had like 3 bites, then told them what I thought. They took it away and were barely apologetic (although the waiter did kind of laugh at my expectation that they would have fresh veggies). Of course they charged me full price. They also advertised vegetarian plates, but they were served with soup with pork. No vegetarian option for the soup, no offer to substitute, no discount. Worst dining experience in recent memory. Stay away.", "author": "Sarah C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-11-05", "description": "The chef from R&G Lounge actually left and is now cooking here.  The food was good.  The salt & pepper crab was really good.  Had the set meal and everything was good including the price.", "author": "Mary L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-10", "description": "I was so happy when they finally reopened after their remodeling--they were closed for a very long time. I have been going here for years and have always loved their location and booth seating.  I recently had their Beef Tomato Chow Mein and really loved it!  The portion was huge and really worth the money!  I think I will start ordering my old usual dishes again--Scrambled Egg Beef over Rice and also Beef Stew Lo Mein--I hope they still have them.", "author": "Robert T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-07", "description": "Omg, i been coming here for years the general chicken is a must have and the kung pao prawns are amazing I LOVE IT!", "author": "Xavier G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-09-20", "description": "the chinese food here was average. good, but not amazing. but on the other hand, the cheeseburger here was amazing! i ordered to-go and i didnt realize there was ketchup the bag until i was done. i cant imagine how much more awesomer it would be if i had ketchup on it :)\n\ni cant wait to come back to try another cheeseburger.... you know.... to make sure my taste buds werent fooling me", "author": "Sarah L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-02-21", "description": "Going here was the worst restaurant experience I have literally ever had. I realize it was a little crazy because we went in during the Chinese New Year Parade and we were prepared to be patient. But we were sitting here for maybe 30 seconds before the waitress came by and asked if we were ready to order. We had not even gotten menus yet. So we asked for some and she seemed annoyed. At least 3 different waiters came back in the next 4 minutes to ask if we were ready and we had to keep telling them to give us a sec. At one point, my friend lost her phone and asked some of the waiters and at the register if someone had turned in a phone. They were completely rude to her and ignored her to the point that my friend (the nicest, happiest person I have ever met) had to yell \"It's not a stupid question!\". They finally brought us the bill and we were sitting right next to the register and in a hurry to leave so I took it up there but she ignored me for a full five minutes, not even making eye contact with me. When my friend went up and finally paid, they overcharged us a couple dollars. So we decided to hang out, just to make them mad and we were still trying to find my friend's phone, and sat in the booth for a while. When we did get up to leave, a lady chased us out the door claiming that we didn't pay. I have never received such horrible service or been so mistreated by a place in my life. \n\nThe food was mediocre. I felt like it might as well have been Panda Express, except the portions weren't as big. \n\nAvoid at all costs.", "author": "Kelsey R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-11-14", "description": "I've been eating breakfast/brunch here quite a few times lately. I like the pancakes but I've been ordering the cheese omelet, which comes with hash browns and toast and is quite filling! At $5.50 it's a pretty good deal, too. The only gripe I have about this place is a tiny glass of OJ costs near $2, which seems like kind of a rip-off but it's still damn good OJ (is it fresh squeezed or what?!) All in all, pretty good!", "author": "P A U L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-05-02", "description": "We split the house special rice, curry beef clay pot, and the spicy salt and pepper prawns (served with the shells on).  The beef in our clay pot was too fatty, but other than that no complaints.", "author": "Adam Z."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-05-31", "description": "Not sure why they bother with american food. The toast, omlet, eggs, were soooo oily.  Never going back there.\nThey should stick to chinese cooking only.  \nAnd why would you NOT accept credit cards, this is San Fran and 2009....", "author": "Ria G."}
