{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-02", "description": "Grabbing a sammy, at George's Zoo, solo alone, with no crew, went for beef or ham, not something new. Then I saw egg salad, not often on the menu. Seeing it there is already a coup. But this particular egg salad is now my new go-to. \n\nTasted familiar- it's deja vu. Just like at home, only egg, salt and pepper, with mayo as the glue. No celery or pickle - those overdo. And never mustard - that I eschew - in egg salad it's way too frou-frou. Nice and simple is best, thank you beaucoup, not from the fridge, they make it fresh on cue. \n\nMy visit wasn't planned, it was impromptu. So much good food around, in this gourmet milieu. But this sandwich was so good, there should be a queue. I'm already planning a return, to this venue. We'll have an egg salad super rendezvous. \n\nI didn't want to write just another review, so this time I decided to rap it at you.", "author": "Michael S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-08", "description": "George's has been mine and my family's favorite place to get sandwiches for the longest time! We've been coming for years now and every time we come, we're never disappointed.  The service at George's is always amazing as well.\n\nI usually get the Lion House, which is beef brisket, Swiss, and avocado on a Dutch Crunch roll. The ingredients are always fresh and the rolls are always toasted to perfection (not too toasted and not to soft). My sister usually gets the turkey with provolone and mozzarella on a soft roll. & my mom goes back and forth between the Lion House and the Pastrami. \n\nGeorge's also has a vast selection of different drinks that go well with any of the sandwiches. I don't really think you could go wrong with any of the choices on the menu! Definitely try it, if you haven't already :)", "author": "Siera O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-08", "description": "I stumbled across George's by accident not long ago.  What a cool little market and deli with a solid selection of beer and wine.  If you're down on Sloat by the San Francisco Zoo (also Ocean Beach and Fort Funston are down this way) it's worth a bookmark just in case you need to, oh say, buy a bottle of wine before going to the Zoo.  Or, grab some beer on the way to Ocean Beach. \n\nYou can tell when you walk into a market a lot of what you are getting.  You can tell whether a place is hospitable and quality oriented.  This place feels that way.  I hate to give a review of food based off of hearsay and gut level vibe, but this place seems to be a good place to grab a sandwich.   I was certainly a bit amazed when I saw that they have wine under their own label - pretty cool.  \n\nOh, and the service was super nice the day I went.  I picked up a 6 Pack to take down to the Beach - I believe a 21st Amendment Brew Free or Die (cans).  Go figure.  This was a cool spot to stop and I'll definitely keep it in mind for the future..", "author": "Adam S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-30", "description": "I came in here by accident and felt irritated with the person I had hired to do my gardening. We were at Sloat Garden Center when he said, \"I have to eat now!\" Well, it was cold and I didn't have a jacket and....I'll just say, we found George's by accident, the sandwiches were exceptionally good and fresh and they were so friendly. I know I'll find reasons to go back again. I was really impressed with their selection of wines and other delicacies. I felt irritated no more! ;-) (and my garden is beautiful)", "author": "Larry R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-21", "description": "This was our first time coming here, but it will not our last. We stopped in, unexpectedly, on our way to the San Francisco Zoo. Our attention was grabbed by their enticing sandwich board. They have an amazing selection of sandwiches and hamburgers, all made fresh and with love. And, at a great price too! Mona took care of us at the register, and was so genuinely interested in who we were and what we were doing and took every measure to make sure that we were happy. We sat outside the store for a few minutes, and she came out to shoot the breeze for a little while. She kept telling us what great people we were, but it was really Mona who is the great person. Our kids really loved her, and so did we. A few of the neighborhood locals popped in to say hi to Mona, and it was clear that she was considered by many of them to be family. We will definitely be back again soon.", "author": "Ryan O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-19", "description": "This place makes the best sandwiches I have ever had. I love the customer service from the owners and how they remember who me and my husband are when we walk in. I recommend Rjs invention or the Thanksgiving. ALWAYS on sourdough loaf. So so good!!", "author": "Sarah K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-17", "description": "I was going to trivia night at the United Irish Culture Center. I needed something to eat, and I wasn't sure if there was going to be food available there. Plus I really just wanted a sandwich more than anything. Luckily George's Zoo deli was a short walk away. \n\nI was greeted so warmly by the gentlemen behind the counter. I ordered a grilled chicken sandwich on a sourdough roll. It had pickles, mustard, lettuce, tomato, chicken, jack cheese, and avocado. It's a typical sandwich, and it was delicious! I could only eat half, and I can't wait to eat the other for lunch. \n\nThey have an assortment of chips, near the counter, and by the entrance.\n\nIt's also a liquor store, so there's an assortment of alcoholic beverages to choose from, and there's also some limes and lemons available to purchase. \n\nThere aren't any places to sit down, so you would have to take your sandwich to go. \n\nThis deli is far from my apartment, otherwise I'd come here often to get a good sandwich! Five stars for both the sandwich and the service!", "author": "Vira P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-04", "description": "I highly recommend the sandwiches from George's.  They are consistently good...must be the bread or just the fast and friendly service. I live around the corner and I have to say George's have never let me down.  The owners are super nice as well.", "author": "Bombo V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-03", "description": "A regular stop on our way to Ocean Beach for fresh sandwiches, snacks, & beer. Sandwiches are always delicious", "author": "zia w."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-21", "description": "I live down the street from this place and this review is long over due. \n\nThe sandwiches are amazing! Like the best sandwich in the city. All the breads and ingredients are fresh and delicious and the folks running the joint are awesome. \n\nIf you're spending the day at the zoo, come here first instead of wasting money on the flavorless food at the zoo.", "author": "Casey C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-18", "description": "As someone who's godfather owned a deli I'm very bias. However, this place is amazing. I've gone here 3 times and plan to keep going. They lady there is so sweet their selections always keep me intrigued and I adore it.  It's a cute and cozy little deli that reminds me of that old familiar feeling I had at my uncles deli.  For that and the bomb tuna melt I give 5 stars :)", "author": "Kassandra C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-26", "description": "I been coming here for years. \nAlways had good experience.\nFriendly people working here.\nSandwiches are huge and fresh and good. Even my parents liked the sandwiches.", "author": "Eric S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-30", "description": "We have stayed in a motel very close to George's Zoo a couple times and enjoy coming in for a snack or one of their many delicious sandwiches. Very friendly staff and awesome food. The prices are very reasonable as well. If we are ever in the area we make it a point to stop in. Thank you so much !", "author": "John A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-09", "description": "I usually refuse sandwich-making establishments and that definitely includes Subway. DEFINITELY Subway. \n\nMy roommate one day notices my absolute laziness to cook and convinces me to go down the street for some food.  Really just down one block, I walk into an absolute GEM. I usually order my deli meat up the street from the grocery store, but walking into George's Zoo Liquor Deli, it was a game changer.\n\nLike I said, I'm not much of a sandwich girl, but my roommate RAVED about how good the food is. Her absolute favorite was the \"Avocado, cucumber, cream cheese.\" ... If you thought, \"Wait, no meat?\" That was absolutely my thinking. Anyways, there's a variety on the menu with hot and cold choice of sandwiches. If you got that imaginative mind unlike me, then you can also customize your own. \n\nI gave my roommate a HUGE hug because after my first visit, then I went for a second, third, fourth... now who's counting? I absolutely crave that \"avocado, cucumber, cream cheese\" sandwich. Never noticing there's no meat. The dutch crunch bread is a go-to for me. There's also an AWESOME big number of cheeses to choose from. I like to be adventurous and ask them to choose whichever cheese they think is good, which is always good. \n\nThe service is great and I always get greeted by a smiling face. Even seen the owner, who I can only assume is him because there's also a painting of him there. \n\nDefinitely check it out if ever you're in the outer outer sunset! NO Subway, only George's Zoo Liquor Deli!", "author": "Casie C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-15", "description": "As an airline pilot, I travel throughout the country and after flying, I explore for good local meals. George's Zoo in the Sunset area of San Francisco is a five star WINNER!  Outgoing Philip Dudum, the owner, is passionate about using only the most flavourful meats, the freshest veges, and that great San Francisco sourdough bread. Frankly, Philip's sandwiches rival the best hoagies back in my mom's hometown of Philadelphia (but don't tell her that :) And if you will be pleasantly surprised by the low prices, too.", "author": "Captain D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-31", "description": "Got to try the pastrami sandwich!! The sandwich was so good, the meat quality was great and was big enough for my husband and I to share. My 9yr. old son got the Roast beef and he loved it.... he didn't even save me a taste. \n\nAlso, I had the double vanilla latte, it was wonderful! Got to try as well!\n\nWhen we went in the owner was behind the counter making the goods and his mother running the register. They were both so nice and sweet! The sandwich and latte was very well priced, not over priced! \n\nHave to confess the first time he passed by George's Zoo was on our way back from the Java Cafe and noticed there was a deli and coffee inside. Java Cafe was good, but way over priced. So the next time we wanted a sandwich went to George's and was blown away by the great tasting food, customer service and great price. Will definitely go back!", "author": "Michelle B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-15", "description": "Love George's so much! Their sandwiches always have the freshest ingredients and are quite large for the price. The family that runs the store is really kind and always recognizes people from the neighborhood.", "author": "ipvcake i."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-22", "description": "Was surprised by what seemed like just another corner liquor store is actually also a friendly neighborhood deli. It's got a great vibe from the kitschy and cozy decorations and the friendly workers. There's a large selection of sandwiches but I stuck with the Reuben on dark rye, the craving that led me to discover this spot. I will definitely need to come back to try other sandwiches, including their piroski and breakfast sandwiches.\nFYI, their bread is baked by Wedermeyer bakery which delivers more than once a day, ensuring fresh bread!\n\nConvenient, tasty, reasonable prices, and warm service!", "author": "Tina K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-01", "description": "Such an amazing spot. I had a work training for a week at Lake Merced and I was here every day. I alternated between 2 sandwiches, \n\nGeorge's Special \nChicken Pesto \n\nGood lord were they good. I like how they use all fresh meats and shave it in front of you so you know it's fresh. I would highly recommend", "author": "Michael P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-08", "description": "The kid Dylan making sandwiches knows his stuff! He's friendly and pays attention to his craft! Sorry I didn't leave a better tip, next time tho!!!", "author": "Lydia K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-06", "description": "One of the top 5 San Francisco sandwich stops, hands down for sure 100%. There are no other places that can provide a quality meat like boars head with fresh bread for cheaper and with as large a range of services as George's zoo. They make a solid sandwich. I always get turkey avocado with cheese and they have a special George's zoo which is well done. Compete with Clancy's as the best sandwich in sf.", "author": "Nick J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-02", "description": "Love Phil and his mom...The foods are creative but the coffee is to die for. It's one of the last family run places and love the fact that she follows the kids out of the store to come to the car to say Hi. Love the young guys behind the counter who create the \"california lion\" sandwiches and are always willing to be specific on orders. It the gem of the neighborhood and I appreciate them for years of service.", "author": "Dianne A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-08-19", "description": "Ummmmm. This place is okay.  I have a feeling it gets 4 and 5 stars because it's one of the only places to eat out here besides the zoo. \n\nI got the Lil Puffer sandwich which was as embarrassing as all get out to have to say aloud.  (It's like ordering a Rutti Tuttie Fresh & Fruitti at ihop). The sandwich was okay.  Odd that one of the regular toppings is sprouts but not a bad thing.  The thing that bothered me is that they microwave the sandwich to heat it up.  That's not what a hot sandwich is.  Also, for a $9 sandwich, coukd I at least have a fricken bag and a couple napkins????\n\nThe staff was okay. Not overly friendly but not rude.  Two young bucks in there working.\n\nI probably won't come back but if I was starving, this place is an option if everything else in the area is closed. Including the zoo.", "author": "Brian S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-20", "description": "1) These are the nicest people in the world. I've been going here for years, and have never had a negative experience. I've never even seen anyone else have a negative experience.\n\n2) Their sandwiches are great. Everything is fresh, they're not stingy with the ingredients, and they're cool when I want to customize whatever I'm ordering.\n\n3) They have all kinds of chocolates, chips, etc. I always find extra stuff to buy when I'm they're making my sandwich.", "author": "Katie T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-05", "description": "One of the best deli's around. The sandwiches are great and breakfast burritos are legit. Beer and wine selection is top notch. The people that run the place are incredibly nice. Hidden gem near the zoo to get all you need for the day", "author": "Chris R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-18", "description": "Dont go fo java beach!!!! George's zoo all the way, nice friendly staff, family owned, and wayyyy better!!!", "author": "Sasha G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-10-11", "description": "Liked my sandwich, but noticed that the guy making it used his bare hands after he handled money. \nGood prices, tasty stuff, but lazy food handling.", "author": "Hannah W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-26", "description": "What a treat. I walked right past George's thinking it was just a liquor store, when the owner greeted me on the street. We talked for a bit and I decided to get get dinner from their deli.\n\nI had a rueben and it had a good amount of high quality pastrami. The sauerkraut was also top notch. But the best thing was the service and the community. While I waited for my sandwich regulars came and went and the owner knew them all. Whether it was a guy getting a cold beer after work or someone buying fruit. I wish we had a corner deli like this back in my neighborhood.", "author": "Andrew F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-26", "description": "Been going here for over 10 years now and recently became vegetarian and their veggies sandwiches are just as good as the rest :) super friendly and nice people and good vibes all the time", "author": "Monica L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-01-30", "description": "A-OK for my breakfast sandwich after leaving SF Zoo.  The Zoo's restaurants are WAY overpriced, so I popped in here for a quick bite.  Sandwich was made to order - and it was lunchtime, so I appreciated that they still would make it even after typical breakfast hours.  Service was ok - the sandwich dude was nice, the cashier gal was not.  Would definitely stop here again if in the area and hungry.", "author": "Shannon N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-01-16", "description": "George liquoris  is good stuff . He makes good sandwiches. I was feeling cold and hungry in this rainy. Day so decided to give them a shot. My neighbors all like it. It's near the zoo. Hence Georges liQuor and picture of monkey. Our maybe George was the father. I dunno. Had the pastrami briscutt on wheat", "author": "Selby C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-01", "description": "If you're looking for a awesome sandwich or coffee stop here.  It was one of many places we stopped at during our trip.  This place is legit!  Great sandwiches and service awesome to meet the owners.  He made my wife's latte \"Just Right\". Looking forward to coming back to the city to stop by again.", "author": "Nick B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-25", "description": "I was craving a sandwich but all the places in my area were closed except for George's Zoo Liquor. So I decided to give it a shot and I was pleased! I got the pastrami melt with everything on it. I gave a -1 star because, honestly, it didn't seem like there was much meat inside the sandwich.\n\nHOWEVER, I can see why there isn't much meat . It's because the meat is of high quality! Nothing is worse (for pastrami) when you bite into it and you can't even chew it apart and all the meat just falls out when you pull away. This pastrami, however, seems like it almost melts in your mouth and is very tender.\n\nI will definitely go back to try other sandwiches! Like I said, though, -1 since I wish the sandwich could have more meat! I'd even be willing to pay an extra dollar for it!", "author": "Gregg H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-06", "description": "An all time favorite of mine. They have excellent sandwiches and breakfast sandwiches on top of every candy from everywhere in the world u could imagine. But what really makes George's zoo even more outstanding is the staff. I went in with my mother once after being sick and they continue to ask how I'm doing and how in feeling. It's like a family away from home. Really can't get enough of this place. Thanks guys!\nJade", "author": "Jade D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-31", "description": "They are an authentic neighborhood establishment.  The breakfast English muffins are to die for (I've tried to replicate them... Even bought American cheese.. And to no avail). I think it's all family run which I love too :).  Try the ham and cheese English muffin (ham shaved to order and egg cooked while you wait) or the rabbit with sprouts and tomato :)", "author": "Shannon S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-07-13", "description": "This place is meant for tourist because they have tourist prices. I have been here several times and every time I come here I am upset. The prices on beer is insane. 13.00 bucks for a 6 pack. Shut the front.door!! This is highway robbery. Why they wanna do me like that. This is uncool. I get that this location is subject to a lot of tourism but come on man. The prices here are just unacceptable. However, the sandwiches are good even though the sandwiches prices are outrageous as well. If you are in a rush and need beverage then cone here but heed my disclaimer. Best of luck to you all.", "author": "Robert F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-23", "description": "Little and unassuming, this place is LEGIT. come here. Get all your snacks, get an bomb fresh sandwich, and a cold one and you're set! Great food and the service was beyond.  Love finding a place I like to give my money to. Instead of theses places that are too cool for school. These guys know service and sandwiches. Hit them up you won't be disappointed.", "author": "Raquel F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-30", "description": "Very friendly staff, Phil and muna are amazing friendly people. Highly recommend their sandwiches.", "author": "Yazan Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-28", "description": "Really good....GREAT sandwiches! Nice little hole in the wall liquor store that has food. What else can you ask for? The employees are real cool, chill and relaxed. It seems like it's a cool place for the locals as a few people walked in and actually had conversations with the 2 guys working. It's far for me to come get a sandwich but they put sprouts on them so I'll definitely be back!!!", "author": "LeAndre M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-27", "description": "Eh... Not the greatest. I mean the meat was great, and the bread had good flavor, it just had too much bread in my opinion. The bread was super dense and often masked the flavor of the turkey. But the crust on the bread was almost perfect. I'd come here again.", "author": "Joseph A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-07", "description": "The best deli sandwich in San Francisco. Very friendly people, incredibly high quality meat, overall great place!", "author": "Austin N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-02", "description": "Sandwiches are good. That's the main point. It's healthy and quick done.\nGuys are friendly too. They have a lot of choices of drinks and chips in their shop too.\nThey should show their place better than what they do currently, however :/ without Yelp, I wouldn't see this place.\nPrices are honest.", "author": "Mickey M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-04", "description": "Great wine selection!  Nicest staff who make you feel special every time you come in.", "author": "Rebecca E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-15", "description": "One word: DELI. All the sandwiches are great and made with care. Breakfast sandwiches are awesome, too, and under $4 ! The folks are all good people, and they work hard. It's good to see that--and the sandwiches are filling--and addictive !", "author": "Nicole S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-06", "description": "Owned by the best people in the sunset with everything I need when making a quick stop and the sandwiches are killer!", "author": "Natasha T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-16", "description": "How have I not reviewed this place yet? I've been going here -- and ordering the same thing -- for years! Dat swiss and gouda on Dutch crunch with no sprouts life.\n\nWonderful people run this place too, and there's a hospitality that you don't find often in the city.", "author": "Mike T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-27", "description": "I swung by George's as a lunch break during my bike ride by the beach after I saw the reviews and it was exactly what I was looking for: local, affordable, and tasty.\nThe shop seems like half liquor store and half sandwich deli. They have a huge selection of refrigerated alcoholic and non alcoholic drinks (more than just sodas), many that I hadn't heard of. The sandwiches were priced 6.99 for build your own to 7.99 for 'favorites' (plus add ons if you wanted). I got the grilled california, which was a grilled chicken breast with avocado (plus the standard toppings) and I chose on dutch crunch, based on another review. It was really great! Very fresh, a good size (I could only eat half with chips), and affordable. Not to mention that the two guys working the front were extremely professional and friendly.\nThis is not at all a sit down place, but they do have a table outside the front on the sidewalk! I would recommend heading down and sitting at the beach down the street to eat anyway. \nOverall: This shop lived up to my expectations and I wouldn't have changed a thing. Give it a shot if you're in the area or want a sandwich for a day at the beach.", "author": "Brad M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-15", "description": "Rabbit hole.\n\nAlways delivers: https://soundcloud.com/markusschulz/markus-nye-la-rabbithole\n\nAlso delivers: V-Rabbit breakfast sandwich with scrambled eggs, avocado spread, sprouts and jam on an English muffin. More focus on flavor than oil.\n\nEgg whites were not an option but cheese was. Disappointed to see it left on despite asking otherwise, but mistakes happen and apologies were made.\n\nTriple shot Americano helped it go down easy. Sugar free syrups and nonfat milk were both not options but a dash of 2% worked just fine. Surprisingly smooth.\n\nBoth came with me to the beach on one of the warmest May days in city history. Stopped on the way back for a turkey sandwich with cranberry and veggies on a seeded roll.\n\nThanksgiving is still a good six months away. This was a massive and delicious preview. Penny less than $8. As good of a deal as the $5 breakfast sandwich and $3 espresso.\n\nStaff sealed the fourth star. Granddaughter was learning how to make espresso drinks. Grandmother was so welcoming and earnest in her thanks.\n\nThis trip down the rabbit hole is worth taking.", "author": "Jason B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-13", "description": "This place is an institution in the Sunset District...seems like it's been here forever, and there's a reason- friendly service, fair prices and an overall general vibe of cleanliness. Their sandwiches are very good, made to order with crisp vegetables and freshly baked bread. I live three blocks from this place and have been coming here for years, and so a review is long overdue.", "author": "Louise I."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-30", "description": "For all the people that go to the other establishment practically next door, you might wan to rethink that.  Always a smile in this place, and you might even get the queen mum to give your kids some treats.  Try the BLTA on toasted Dutch Crunch, grab a bag of chips, a drink and eat it on the one bench out front.  It's sure to deliver a good experience and great food.  If the wind is blowing the right direction, you'll even hear the howler monkeys.", "author": "Alexander C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-14", "description": "The nicest owners/employees, an eclectic selection of chips and candy, great drink selection for a small space, and reliably enjoyable sandwiches. This is the only place I'll get a Reuben, totally enjoy it, and not hate myself after eating it. I'm always happy to spend money at this terrific establishment.", "author": "christine l."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-10", "description": "Absolutely fabulous sandwiches made to order.\nMy favourite is the chicken pesto on a seeded roll-warm and filling on a cold San Francisco day.\nAt first I thought the sandwiches a little pricey but I'm reminded \"You get what you pay for\"\nOutstanding!", "author": "Emma B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-07", "description": "George's is also a go-to of mine.  I frequent at least once a week, but you gotta get there early for the deviled eggs, they DA BOMB!", "author": "Kyle N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-23", "description": "A true neighborhood gem. This family owned and operated deli and corner store offers friendly and attentive people who always greet you with a smile. My kids love their sandwiches are treated like family.  I gladly suggest you pop in if you're in the area.", "author": "Sean S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-29", "description": "George's seems to be an institution.  While in the neighborhood I have spent a good deal of time in this corner store.  The prices are about what you would expect.  The deli sandwiches are pretty good.  The staff is friendly and the location is convenient.  What more could you ask for?\n\nP.S. - If the older woman is behind the register, try and get her going.  She can be downright sassy, fun and friendly.  It's always a joy to deal with her.", "author": "Nick M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-03", "description": "DELICIOUS DELI AND WONDERFUL STAFF! The Thanksgiving sandwich warmed up on Dutch crunch bread with everything but mustard is AMAZING!  Yummy deli sides and sweets too.  Excellent location while visiting the zoo or picnic on the beach.", "author": "Ashleigh L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-09-09", "description": "George's is a liquor store with your basic liquor store staples and more, including a deli. I recall seeing asian snacks like dried squid that I would typically see only at asian markets so they have some items that may surprise you. My friend and I came specifically for a sandwich and chips. At the deli in the back of the store, there was only one other customer in front of us and it took a while for someone to take our orders so we were standing around for longer than expected. We ordered a New Yorker on dutch crunch and after ordering, we picked up our chips, and paid at the cashier who was this super sweet older lady. When we got to eating the sandwich, I found that the dutch crunch didn't taste very fresh and was a bit dry. I thought the pastrami was pretty tasty but overall, the sandwich was lackluster.", "author": "Maya S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-05-15", "description": "You can see from the pictures that it's a great sandwich. Really delicious meats and cheeses - good spreads / dressings and condiments. Crunchy on the outside and soft on the inside bread. \n\nI gotta mention that the friendly service of these people really stands out. I like going here because the guys behind the counter are so cool!", "author": "Rew C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-12-11", "description": "Wow!!! an all-in-one liquor store and deli spot by the sf zoo! Pretty cool concept if you ask me and very convenient at the same time. Located on the corner of Sloat Blvd and 44th Ave, their sign is very noticeable which caught my eye to go there. It has some animals posted on the walls outside which is awesome since the store is right across from the zoo lol.\n\nYesterday, I came here for a cup of coffee because it was the only place I could find around the area where I was parked at. The items on the menu sounded good but I didn't get anything cause I was about to eat with my friend that I was meeting up else where. \n\nThis place is really cool cause you can buy food here before going in the zoo. It's decently priced for their deli and anything else you would find as a snacks in the liquor store section. Cash or Credit is accepted here!\n\nI am going to come back and try the deli sandwiches that they make and will review about it!", "author": "John P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-05", "description": "Goodness, I love this place. I love the family that works there,  I love every sandwich I've tried. I love that it's by the beach. I love that they have a great candy selection and donuts all the time. \n\nRemember dutch crunch sells out quickly! Get it before lunch or call ahead before coming in!", "author": "Kimberly M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-03-06", "description": "I come here 1 - 2 times per week.    Am giving two ratings:\n\nTo cusotmers / potential customers:  5 stars.   This place is great, familiy owned for years, quality sandwiches and great home made deli items.  Stop for your beach/zoo needs and smile for spending money in a local quality establishment. \n\nTo the owners:  three stars.   Guys, love your staff, store and products, but your store needs to be cleaned.  I dont think there is a sanitation issues at all, but there is dust/dirt all over.  Some of the things you have on the shelfs and walls have a 1/4 inch of dust on them.   Hire a cleaer once a month or have the staff do some deep clean.   other wise 5 stars you guys are great.", "author": "Johnny C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-19", "description": "My favorite local secret! This store has an amazing variety of groceries and drinks for how small it looks on the outside, they'll have pretty much any thing you need at the moment. The sangho he's are amazing! I'll always stop by here for lunch if I have an extra 15 minutes. What really makes this place is the customer service. After just two visits the two usually working know my name and order. It's so refreshing to be able to chat with the associates here while I wait for my food to be ready versus a chain restaurant or fast food. I recommend this to all my friends and fellow yelpers!", "author": "Jenni A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-05-31", "description": "LOVE THIS PLACE!! \n\nMy sister found this by searching YELP when we were visiting the zoo, this place had GREAT reviews so we went. Honestly it's not the kinda place that screams stop here from the outside, but we went because of the high yelp reviews and LOVED it!! \n\nThe mom and son and grandson that run the place are such sweet people, but it's the food that really sold us! Great sandwiches  at cheap prices!", "author": "Maureen W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-03", "description": "One of the best sandwich places in the outer sunset! So delicious, they use boar head meat and you can't go wrong with quality like that! This little liquor store is a must when your craving a sandwich in the sunset", "author": "Hannah W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-01", "description": "Sandwiches here are delicious!!!\n\nPrices are the same as other shops in san francisco but the sandwich was pretty huge. Really nice people who work here. They keep it clean and organized.", "author": "Neek W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-20", "description": "George's is a fantastic find. Their deli menu is HUGE and their sandwiches even bigger! \n\nFrom the outside you wouldn't expect this place to be much of anything besides your typical liquor/convenience store but I had read reviews on yelp that were so positive that I thought I should check this place out since I was staying at a hotel nearby. I can't recall the name of the sandwiches we ordered but they were very tasty and you get what you pay for. I can only assume you can't go wrong with anything on their menu. I honestly could only finish 1/2 my sandwich because of how much meat they stack on and it was really good quality food too like Boar's Head etc..  \n\nThe guys in the shop were very nice and we didn't wait long for our sandwiches. It was awesome that they were still open, including the deli, at 9pm because we really wouldn't know where else to go for such a late dinner.", "author": "Katie S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-23", "description": "Great sandwich and friendly people! Way better & not expensive like IKEs. Will definitely be back!", "author": "Natalie B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-11", "description": "Nice, clean little deli/liquor store right across from the Zoo. Phil, the guy who owns the place, is very friendly and makes a mean sammich.\n\nThe sandwiches are not overly large, but are a good size with fresh ingredients.\n\nThe dutch crunch bread is awesome.", "author": "Albert R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-14", "description": "First time here, we had a California Special and a New Yorker. Super crunchy, super tasty, super fresh. Really nice staff.\nToo bad there is no place to sit down.", "author": "Anna O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-11", "description": "Awesome friendly service. \n\nMouth watering sandwiches. \n\nFresh ingredients. Good quality. \n\nWide variety of options: breakfast items lunch items coffee beer and many other essentials. \n\nConsistent. \n\nAnd once again friendly. \n\nI have ordered many sandwiches here and enjoyed every one of them. Will be back undoubtedly.", "author": "Brandy B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-03", "description": "Great sandwiches to take with you on a walk to the beach. Don't forget the ice cream cooler either,  they have Its-It ice cream sandwiches.", "author": "C'pn K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-07", "description": "Delicious sandwiches :) very kind staff and great coffee :) open until 9pm\nGot the California on Dutch crunch. Other than me forgetting to ask for it toasted it was wonderful.", "author": "Emily F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-10-17", "description": "Passed by this place a billion times, saw the sign but never took the second to stop and check it out. After looking for sandwiches on Yelp, decided to give it a try this time. \n\nPhil, who I think may be the owner was really nice when he took my order. Smiling even though it's Sunday at 4:30pm. He and his sidekick seem to get along quite well at the shop. After telling Phil I found him through Yelp, he asked me what I did, where I was from and felt really genuine. No wonder these guys have been here for 25 yrs! \n\nI ordered the RJ Invention (Pastrami and chicken salad) mixed together. Check out the photo! Good stuff. Enough meat and I'm sitting pretty full. Good stuff. I'll be back.", "author": "Brian Q."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-09", "description": "I was hungry and saw this store on the way home, so I stopped by to pick up a roast beef sandwich, on wheat. This store has a very friendly staff and I enjoyed talking with the \"owner,\" Phil. I think that was his name. Couldn't really remember since I was pretty tired from school. \n\nI kept on asking about the liverwurst, since I never had it before...so Phil kindly gave me a slice to try. Tastes like cold hotdog. \n\nOverall, the sandwich was decent, there was great interaction and they didn't charge me extra on the avocado, since I told them I'm a poor starving student (or maybe they just forgot).", "author": "Sam Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-04", "description": "Their sandwiches are really tasty and the staff is friendly.  They have a great variety of candy.  Mona is the sweetest lady.  You should stop in just to chat with her.", "author": "Tanya W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-02-18", "description": "This is a small place. Sells beer wine and other beverages.  From the looks of it, you wouldn't think this place is any good, but the Sandwiches are AWESOME!!! \n\nDefinitely stopping by here again if in the area. :)", "author": "Priya K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-23", "description": "This is a great little deli. They make great sandwiches with boars head meat and also a delicious breakfast burrito. The customer service is great and the employees/owners are extremely kind and easy to talk to. Being only a couple blocks from the beach it's a perfect place to grab a sandwich and drink and enjoy it looking at the ocean.", "author": "Hayden W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-01", "description": "I must admit I am in love with George's Zoo. When you are famished and you crave a sandwich, head on over to this neighborhood standby. The sweetest family runs this place and they make excellent LARGE sandwiches, especially if you get yours on a roll. I have had a variety of their options and all have been fresh and well prepared. Their is usually a line, so be prepared to wait a few minutes and enjoy kibitzing with workers/owners. They also have a great variety of specialty chips and European candy.", "author": "Esther L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-25", "description": "Came here on a random search on Yelp for food from a long drive from LA to SF to grub it up before entering the city where I needed to go.  This spot is kicks ass... good people, good food and all in one spot on Sloat.\n\nI got their roast beef sandwich. Premium ingredients, good ass meat and on some good  ass bread. All for about 1 Abe Lincoln and 3 Washington's and a couple of Washington's for tip.. That's not bad.. Shit most places charge at least a Hamilton.. and some at least a Jackson! Off all places this coming from a liquor store? trip out on that.\n \nSF does a sandwich right..  For sure I'm stopping back again when I come up to the bay..  George that magnificent son of a bitch makes a good ass sandwich at home made prices.. makes me wonder if this spot is name from curious George since the Zoo is next door.. hmm...", "author": "Gene K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-25", "description": "They are very nice here. Great coffee and great sandwiches. All your basic liquor store stuff and its fun with all the zoo stuff. Great spot to stop on the way to the beach", "author": "Scotty G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-25", "description": "This place is something special. Great food, engaging owners and enough uniqueness to keep ya coming back. Perfect pre park or beach picnic spot.", "author": "Truckee R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-04", "description": "This place is great! every time I'm in sf I come here. Excellent service, great people and the food is incomparable. Zoo deli by far, will always be my favorite \"stop and go\" deli. Simon you're awesome!!!!!", "author": "Christian S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-02", "description": "I love this place, they make their sandwiches with quality ingredients and they're quite hearty. & the people that run the store are so sweet and friendly.", "author": "Devon M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-25", "description": "They really do put a little love in every sandwich...Take it from this sub snob, grab a picnic from George's and head to Ocean Beach!", "author": "nicole s."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-10-02", "description": "Seeing the yelp reviews we decided to get sandwiches for lunch. I went in and the place was a typical liquor store but with funky animals around, hence the zoo part.\n\nWe got the specials....i think the tuna melt, and the one with pastrami. The guys helping were really nice. I looked at the candy while I waited and they had some interesting stuff. \n\nThe sandwiches were 7.99...guess the prices went up from before.\n\nBrought it home to eat and realized it wasn't toasted, so we ate half un-toasted and then decided to toast the second half which tasted so much better!\n\noverall it was okay, thought there would be something different about it, but tasted like a normal sandwich.", "author": "Christine M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-15", "description": "Giving this place a 4: 3 for the sandwich and 1 for the name. The RJ's Invention on soft roll was good but I'd probably try something else next time. Didn't expect the soft roll to be a wheat roll, so I'd go with the dutch crunch like others have suggested. \n\nSpecialty sandwiches are $7.99. I called in a group order of five sandwiches on a Saturday morning (10:45am) and I was told they were backed up and it'd take 30 minutes for the order. Kind of surprising they were this busy at such an early time, so I suggest viewing the menu on their website and calling your order in ahead of time.\n\nMy tummy gives George's Zoo Liquor Deli...4 Stars!", "author": "Allan L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-11-02", "description": "I tried the lion-house sandwich which was a roast beef with avocado paste, mustard, lettuce and onion. I chose the dutch crunch bread. Even though the roast beef content was warm, the bread was not toasted or warm and too thick. The quality per price was OK, but not recommended.", "author": "Sasan A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-01", "description": "I'm so blessed! I recently moved into my grandmas house, and had to yelp up all the nearby places so I know when and where to grub. Found George's at the top of my list. Its really unexpected that a plain ol liquor shop has a 4.5 stars rating. \n\nAfter reading the reviews I realized why.. its not the liquor, people will love liquor no matter where they get it from! Its the sandwiches.. Ive learned from experience that the spread and bread is what makes a great sandwich, and this place definitely has both, psttt get the Dutch Crunch. Their names are all based off the zoo, which I love lovelove!! A special sandwich is about 7.95, or you can create your own. Now I know some people may think 7.95 is too expensive for a mere sandwich, but trust me, even if it does look small at first, it'll fill you up. \n\nThe ingredients are so fresh... The bean sprouts are perfect. The deli meat is incredible. +The workers are friendly. I love the lady in the mornings, might be the owner. Stopped by once to grab a breakfast sandwich before a 13 hr session at school, and the first thing she said to me was \"you're beautiful and you have a great figure\" WOW. What a morning confidence booster:) Made my day!! And the breakfast sandwich was just right! Not too oily, but definitely filling. \n\nI love grabbing a sandwich whenever I walk my pup, perfect pit stop. My dog loves the way everything smells too:) LOVE GEORGE'S DELI!!", "author": "Wendy X."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-04-21", "description": "The best eats by the SF Zoo can be found at a liquor store, George's Zoo.  George's isn't your typical deli.  They have their own brand of wine and their own coffee blend (Zoo Blend by Uncommon Grounds in Berkeley).  The owner is really friendly.  I think he greets everyone who walks in.  \n\nYou can build your own sandwich ($5.99) or choose one of their special sandwiches, plus they have breakfast sandwiches and organic, free trade coffee (since they serve Uncommon Grounds coffee, they should have really good coffee).   \n\nI ordered the tuna melt (around $7) which includes your choice of cheese (so many choices), your choice of bread, mayo, yellow mustard, pickles, thinly sliced red onions, tomato, sprouts (nice touch, not many places include sprouts) and leaf lettuce (yay, it isn't shredded).  \n\nThe Dutch crunch roll seemed very fresh, soft with a slightly crunchy top.  Good bread.  I had a hard time discerning the cheese in my sandwich so there must not have been much cheese.  The tuna salad was decent and included chopped celery.  The veggies were fresh but I think there was too much bread relative to the sandwich fillings.  The sandwich is about 6 inches, not monstrously large but satisfying  (and messy).  The price includes a small/medium fountain drink.  \n\nThe rest of the store is similar to 7-Eleven with potato chips, frozen food, a good candy selection (including Bit O' Honey, Peanut Butter Whoppers, Japanese gummy candies), cookies, magazines, soda, and of course liquor.", "author": "Lolia S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-26", "description": "DUTCH CRUUUUUNCH!!! The sandwiches are soo good! They always make it with fresh bread. It's perfect if you're at the zoo or beach and need snacks, drinks, and sandwiches. They've been here for awhile now and the sandwiches have been as good as they were before. If you come here, you will not be disappointed.", "author": "Jade F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-17", "description": "This place is awesome and the people are wonderful. The deli is AMAZING. The sandwiches are quintessential quality deli fare, prepared expertly and with a smile. They have everything I look for in a corner store as well as a sweet and lovable matriarch to ring you up. I LOVE THIS PLACE!!!", "author": "Tone G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-24", "description": "Pastrami with provolone and avocado on a sweet roll!  BOOM!  That's my go to before walking in to the zoo.  The sandwiches are better than anything you can get inside the zoo.  If you go around lunch, be prepared for a wait.", "author": "ROB L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-01", "description": "We found this place on Yelp and it was a perfect match .  Delicious deli sandwiches and at a reasonable price. I got the sandwich with turkey and chicken salad and it was more than large enough to fill me up.   We drove a bit down highway 1 to find a scenic spot to enjoy our lunch. We'll be back here for certain.", "author": "Chris B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-04", "description": "Visiting my daughter in San Francisco again and just had to go to George's Zoo.  I am so glad I did, I chanced to meet Mona(proprietress) and her son, Rodney.  What wonderful people and so helpful, too.  My husband has strict dietary requirements, and Anthony(sandwich guy) respectfully listened to his order.  The sandwich came as ordered.  You can have it your way at George's Zoo.  It might be best for a first time visitor to check out the menu at the website before ordering as the choices are vast.  A family run business where the customers become family:  George's Zoo Liquor and Deli.", "author": "Cheryl W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-18", "description": "My favorite local place. I go here almost once a week for the past year and a half and they're always really cool and delicious sandwiches. Breakfast sandwiches are also pretty good for what they are (pretty simple, bacon egg + cheese). My personal favorite is the yard bird (turkey + chicken salad). Right next to java beach, which I have only been to a couple times, because I can't stop going to George's Zoo every time. Decent market in there for chips, drinks, beers, etc. Highly recommend this spot for sandwiches or coffee, Phil and the crew keep it real.", "author": "Jamie G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-13", "description": "We got 3 sandwiches all were delicious! Service was great and prices reasonable :) my favorite was the California sandwich. Good option for grabbing a sandwich and heading to the beach.", "author": "Aspasia I."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-14", "description": "Honestly the best family owned sandwich shop I've been to. The people are friendly and pretty much know about everything they have to offer.", "author": "Logan C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-30", "description": "Mona is the nicest lady and it shows that this family business is one based on love. Great sandwiches and spanakopita.", "author": "Elizabeth W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-25", "description": "Great store! Every business owner should be as friendly as Phil is!!\nI love going here and getting coffee because the price is reasonable unlike the competition around the corner!", "author": "Pat Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-28", "description": "Omg their Dutch crunch is 5 stars alone! I normally order the California Special and it near fails! The staff is very friendly especially Phil and his mother! Oh, and definitely try the breakfast sandwiches! Thank for adding that to the menu.", "author": "Mimi M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-10-01", "description": "I never realized how much I loved this place until I moved away. Phil is great, knows everyones name and exactly what you want when you walk in the door. I miss these guys. To top it off, they have great coffee, and the best breakfast sandwich in SF.", "author": "Will F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-22", "description": "Love this place, I've lived a few blocks away from them for about 6months now and never knew it served awesome sandwiches until just recently! Their breakfast sandwiches are super cheap and delicious. Whenever I'm hungover or out of groceries to make breakfast I walk over there and get a couple breakfast sandwiches for a little bit over $6! So cheap. The service is great too, everyone is really nice and helpful. They also have really interesting things you would normally find at a liquor store.", "author": "Bat V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-04-07", "description": "Super sandwiches! Love this place. Every sandwich I've had has always been made with fresh ingredients, not too big but def not small and always assembled with a smile. Phil and his crew are really nice and have fun in that lil shop. \n\nIf by ocean beach and hungry, this is the place to order delectable deli sandwiches.", "author": "Kimber M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-14", "description": "Great sandwiches the chicken salad sandwich is good but the turkey with sprouts is great and friendly place also tge cookies are good to.perfect to buy and go to the zoo .", "author": "Sal L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-01", "description": "Wow!  Phil is phenomenal!  Try the egg, avocado, cheese on an English muffin for breakfast.  Don't forget the coffee, great selection.  All in for $10.xx for two.  Sandwiches to go the pastrami is huge!  Mama is pretty sweet.", "author": "H. J. Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-05", "description": "Big, yummy sandwiches within walking distance of my house. Always a plus.\n\nJust wish they were open earlier, so I could pick up a sandwich for lunch before work.", "author": "T H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-25", "description": "George's Zoo deli has great sandwiches - this coming from a person that doesn't even love sandwiches. They're fresh and packed with veggies. A+ for having sprouts included. Phillip is great, and so is the older gentlelady who runs the register on weekends.", "author": "Kate T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-21", "description": "Came in here randomly one day to pick up some snacks and noticed they had a deli. Came by another day to try out their sandwiches. Looked on their board and saw \"RJ's Invention,\" which is pastrami and chicken salad. I just had the same combination at M&L market the week prior so I just had to try this to see how well it would stack up against Judy and May. The sandwich was real similar down to the sprouts. The only difference was the meat portions weren't as huge as M&L but George's Zoo definately held its weight.\n\nWe have a new winner for sandwiches in the Set. Forget about Gene's and swing by the Zoo for a real sandwich.", "author": "Eric L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-05-14", "description": "After living in the city now for over 2 years and eating many sandwiches at various SF delis, I need to revise my review for George's to be 5 stars.  Never had a bad experience and really enjoy chatting with the staff, even if it's just a couple minutes.  When the line is a bit longer, Phil makes the wait very bearable with some of his golf stories.", "author": "Mark W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-04-05", "description": "I absolutely love George's Zoo Deli. Their sandwiches are amazing. They even stayed open late and waited for my boyfriend to get ahold of me so he could get me a sandwich. I just started going there, but I have a feeling I will become a very loyal regular.", "author": "christine f."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-17", "description": "George's Zoo is very unassuming and you could definitely pass right by it without even noticing it if you weren't looking for it.   As soon as you walk in, the owner (I'm assuming still George?) greets you with a smile and conversation.  They seem genuinely interested in talking with you, and are incredibly friendly.  Service is quick, and they have a great little liquor store.\n\nNow, for the sandwich review. \nThe sandwich had lots of fresh meat, cheese was tasty and they didn't skimp on the condiments either.  They forgot to add my pickles (huge mistake if you ask me), but the sandwich was tasty nonetheless.  Still not the best sandwich I've ever had though.  It is, however, PERFECT for the Sunset District since there are no sandwich shops anywhere.  All in all, this place is very good and I will definitely be back.", "author": "Jennifer S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-06-23", "description": "I had the misfortune of tumbling off of my bike while riding around Lake Merced, miles away from my hood. Frustrated, injured, and seeking help, I stumbled to George's in search of a phone, and maybe some water and band-aids. The lady behind the counter, Mona, took pity on me and offered me use of their restroom to wash up and took charge in calling a taxi for me. While waiting, she chatted me up and I eventually purchased my band-aids, water, and after passing by the deli, a delicious and filling sandwich. Unfortunately, the taxis we called never came through, but no worries - regular customers, or as Mona called them, \"my friends,\" helped me breakdown my bike, load it into one of their cars, and drove me home! As I was leaving, she called out - \"aren't my friends wonderful? come back and see us!\"\n\nThis place is the real deal.", "author": "Cedrick A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-09-28", "description": "If you're looking for a good sandwich, this is a hidden gem.\n\nIt's a family business and they're always friendly.  The deli menu has a zoological theme.  I usually go for the \"Yardbird\" on dutch crunch.  After eating over twenty of them, I can report that they're consistently fresh, tasty and bountiful.  And I've never had to wait more than a few minutes.\n\nPerfect for SFSU students, zoo patrons and beach goers.  \n\nBesides, there's not much else you can find in this neighborhood for this cheap.", "author": "Bryan R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-16", "description": "amazing sandwiches, fair prices, delicious giant cookies at the register, awesome art, nice people. whats not to love?", "author": "Dylan F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-05-18", "description": "As we all now, sandwich making is an art form. Some places don't get it but this place does.\n\nAwesome sandwiches at great prices with the bev. included in the price of your awesomeness between slices of bread. \n\nLike one of my fellow yelpers I always go for Tuna Melt on Dutch Crunch...\n\n\nThe softness of the interior of the sandwich contrast with the sweet crunchiness of the dutch crunch to create an experience that's really too good for the outer sunset location. \n\nAlso the guys who work there are incredibly friendly and relaxed as the beachfront atmosphere", "author": "Alex O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-05-06", "description": "oh a stead-fast and trusty favorite of the outer/inner sunset folk. If your hung over and too lazy to make a basic meal for yourself head to GEorge's!! \n\nThe california special never lets down, especially not with its FRESHLY SLICED turkey breastacles wedged between their especially good dark rye bread (light on the rye seeds which is a + in my book).\n\nBesides, you know your sandwich will be good when the majority of employees behind the assembly line are stoned. xoxo Sharkey. \n\nMona the owner, a tired little European woman is a sweetheart and she deserves every extra bit of business our recession can spare!", "author": "Tina D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-20", "description": "They were so accommodating!  My son is Autistic and we ordered sandwiches and even tho it wasn't on the menu he made it happen!  Sandwiches were DELICIOUS!!!", "author": "Meagan C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-02-12", "description": "This place is awesome! RJ's Invention on Dutch crunch, MMMMMMM. The very friendly and personable staff is a plus. Pick up a sandwich, chips, soda/beer, and maybe even a European candy bar, and your good to go! Definitely check it out if you're going to the beach, coming back from the zoo, or just hanging around the Sunset.", "author": "Sean M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-18", "description": "Got the New Yorker & the Cole slaw... MAN!!!! it was freaking amazing. I wish I would have added avocados. Next time I will. The sandwich was great and they didn't skimp on the meat.", "author": "Erica A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-12-04", "description": "Now that I've had about 20 sandwiches from George's, I'm growing more frustrated with the inconsistency with the sprouts.  \n\nIt's listed  as one of the condiments on every sandwich, but they rarely actually have them, so we ask every time we're there.  About 85% of the time it's a no, but last weekend, when they did have them, I was stoked!  My boyfriend asked, the guy said yes, asked if my bf wanted them, he said yes.  We were happy. \n\nThennnnnnn we get to the beach, open our sandwiches, only to find sprouts on HIS sandwich and NOT on mine - W T F!?  Was it wrong for me to assume that since its listed as an standard condiment, and they had sprouts on hand, that I might actually have them on my sandwich?  Jeez, get it together man! Do I really have to explicitly say that I want them?  Even though I specified \"no pickles, no mayo\"??  By rule of deduction, that means GIVE ME THE SPROUTS.\n\nI'm sorry but I have to take off a star for that.  I still love George's and will still go there all the time, but now I'm going to be especially neurotic when I'm there.  And please don't think this is a one time thing.  The sprouts issue is topic of conversation on our drive over every time.  It's a constant guessing game.", "author": "Alice H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-08-18", "description": "Excellent customer service! The cashier let me and my sister try some of his vanilla and cardamom ice cream and then he asked if we wanted more It was delicious. The cashier was just awesome all around... and friendly... Left the place feeling good, and wanting to come back because they have these cookies by the cashier that are awesome...the chocolate dipped macaroon and then the M&M cookie that was dipped with white chocolate or half of it was...mmmmm :D good snacks, great service! That's what SF is all about...:D", "author": "Clara H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-05-01", "description": "I grew up with this place.  Working at the zoo right across the street, this was my lunch spot.  Great sandwiches, good selection of snacks, and they carried my favorite candy back in the day that is from Australia-- the Violet Crumble (not sure if they still do, it's been a while).  The owners knew all the regulars, I would walk in and they'd start on my sandwich without me even saying anything.  I miss working next to this deli, it holds a very special place in my heart.", "author": "Tamara N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-08-12", "description": "I come here when I'm around the area to grab a sandwich! Their New Yorker is usually the only thing I get here. I haven't even tried the other sandwiches, but this New Yorker never fails to amaze me! It's hot pastrami on rye bread, with the usual toppings, and coleslaw! I'm not sure what it is, but the mixture and the blend makes my mouth intensely happy.\n\nI'm a big fan of coleslaw. \nI love pastrami sandwiches.\nAND THEY STILL OFFER DUTCH CRUNCH, THE BEST BREAD EVER.\n\nIt is a bit on the pricey side, but if you're having it every so often, I'd say that it's worth it.\n\nOther than that, they have other things to snack on. It's a liquor store as well, so you know, you can get stuff like alcohol, candy bars, some chips, and a pack of XL magnums all at the same time.", "author": "Andrew W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-05-07", "description": "Ahh, a day at the beach with my sweetie and we stopped at this deli along the way to pick up a sandwich.  I waited in the car and my honey picked up a special pastrami (hot!) sandwich with homemade coleslaw in it!  It was so big and we shared it.  Every bite I took ended up with some coleslaw squishing out the sides !  What a great quick lunch and I had to send my sweetie back inside because I read the sign that said you get a free soda with the sandwich.  We actually woofed it in the car right in front of the deli -- YUM!", "author": "Ruthie V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-12", "description": "Sandwiches are fresh and good. I'm going to try more of their special sandwiches, the RJ special was really good and different. Pastrami with chicken salad? Who does that?", "author": "Gordon L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-03-27", "description": "Good sandwiches. Cool guys that run the place. Prices are okay. \n\nThey seem to remember me every time too...how? I have no clue. I am in this shop maybe 1-2 times a year. \n\nMaybe it's that ski mask I've been known to wear?", "author": "Dee J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-09-17", "description": "I wasted 6 months of my outer sunset residency having never gone in this place for more than an occasional beer/snack run. I tried the sandwich semi recently and realized I wasted 6 months by ordering pricey delivery when I could have walked down the street for a tasty sandwich and free fountain drink... \n  a waste I tell you, a waste.\n\nOhhh it feels good to be a regular at this place. The lady who works there always says \"ooooo you are sooo cute\" and other flattering pleasentries that make me all warm inside. Java Beach is a few doors down now but I will continue to get lunch here so I dont have to wait 20 minutes for sandwich.", "author": "Rebecca S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-04-05", "description": "My bff is obsessive about pickles and wouldn't shutup til I brought him here to satisfy his damn craving!\n\nThe peeps who work here are extremely friendly....the guy got our pickles..which were humongous!!\n\nI've heard they make great tasting sandwiches and I definitely need to come back and try one!", "author": "Jade B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-08-03", "description": "Mona. We LoVE you! This little deli is FULL of hidden treasures- chips- you only get in specialty markets, sandwiches, coffees, aspirin, They even market their OWN wine!- Ive never had a bad experience while visiting-  and its so well kept! Honestly, you can get anything from tampons to liquor here- My family enjoys this market whenever we stay in the South of the city!", "author": "Rosemary W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-09", "description": "We frequented this place during my pregnancy, usually stopping by after coming through the sunset from UCSF.  I had an extreme craving for hardbun sandwiches while I was pregnant, and this place became a favorite.  I love the California special - roast turkey, provolone, and avocado - YUM!  It can get busy during the weekends while families are getting their lunch while visiting the zoo.  But a great place to grab a bite to eat, and head over to the beach or Lake Merced for picnic.", "author": "Jennifer V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-12", "description": "This place is a staple in the Outer Sunset, family run sandwich shop that has great sandwiches and service, they have fresh Kripy Kremes and coffee every morning, plus everything else a convenience store could offer.", "author": "Sergio H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-07-05", "description": "I have to admit this is my local bodega (liquor + some grocery + deli), but I like this place a lot.\n\nThe place is run by really cool people, basically a family plus some employees, all of which are nice people. You'll definately see the same faces and your sandwiches will be made by, most likely, one of two or three people.\n\nSpeaking of which their sandwiches are good, and they offer some nice coffees. Try any sandwich with chicken salad in it, ESPECIALLY RJ's invention!\n\nI have to say that their selection of liquor and cigarettes is very small, but they have a decent selection (for a store like this) of wine, and a pretty big cooler of non-alcoholic (soda etc) drinks (+ the usual alcoholic drinks as well)\n\nThis is definately the kind of place where they'll get to know who you are and greet you enthusiastically when you come in, and a nice place to chat it up.", "author": "Josh S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-03", "description": "I went into this place yesterday...let me tell yah !!! after talking too funny man..he definitely knows how to laid on the meat...hehehe..after talking to him for a bit ...come to find out the place we I and a friend really wanted to go too was john place just a little walk from the Zoo.....And we arrive a bit late and was unable to eat there...as I look in the window i was looking for the old man another funny guy...and he has this guy has the Greatest pickling recipe off the hook...Yet after talking to the owner he had mention how john son and he went to school together...man I thought how awesome!!! Any way got a shirt had him sign it and I will post it as it is a cool shirt...and not only that  what a way to advertise for free get it...I will wear an advertisement for free is given for free or reasonable price  at ...least that's what she told me last night .hehehe...So..keep up the good work the sandwich Was  Off the Hook!!! Lots of Love ......Altho, I didnt see meat hanging from the deli window....I knew there was some meat around..hehehehehe...You know its always better to spread the mayo on the bread before you place in the meat as well as other things..had too clean this one up a bit....hope too c this place again I introduce my self as A-B..known in the world of Yelp as Sj Moondoggie....=san jose moondoggie peace love and happiness to everyone that is bless to visit this shop  thank you very much....", "author": "San Jose M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-22", "description": "My favorite corner store! I live near by and they always remember me and ask me if I want \"the usual.\" They also have breakfast sandwiches. The staff is very friendly. There's another sandwich place down the street that looks fancier but I like George's Zoo better.", "author": "Lena B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-07-12", "description": "Went here before heading to the beach at the end of Sloat, didn't expect anything but found a real gem.  Beer and sandwiches selection is fantastic and the staff are great, even give you a deal on beers if you're nice and conversational.  i don't live anywhere near the place, but if i did i'd be here regularly for sure", "author": "Erik G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-08-02", "description": "Great sandwhich. I love the people that run it and the food they sell. Big ups!\n\nPerfect for pre/post San Francisco Zoo action.", "author": "Selino V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-04-06", "description": "My definition of a perfect deli.\nCold beer\nWide assortment of \"crunchies\"\nSlammin' sandwiches.\nGeorge's Zoo has all three.\nOf the sandwich \"favorites\"...Yardbird and the New Yorker get my vote.\nAlways on time.", "author": "Barry A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-09-28", "description": "I went to this place right after I went to the ZOO since it's across the street. The sandwiches are OK for the price which was $5.99 w/ drink. You pick your meat, cheese, bread and whatever you want with it. There is a LOT of snacks and drinks. The owner is really nice and I would come back here again when I'm in the area", "author": "Jason T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-08-18", "description": "Two (kinda gay) words: Lil' Puffer.", "author": "Trav W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-08-03", "description": "Everyone was very friendly, which is a surprise from small deli's. \n\nThe chips, cookies, and general snacks were plentiful. The alcohol selection seemed smallish but I didn't really look (it was lunch, afterall).\n\nYou get a free fountain soda with a sandwich, which was exactly what I asked for and wanted. Clean tasting.\n\nThey also had donuts!\n\nI'd go everyday if it were more convenient. OPerfect for a cheap, refreshing, and filling lunch after walking around the zoo all morning.\n\nWould've given it 5 stars if it were somehow more exciting or different than every other deli in the world.", "author": "Sydney T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-29", "description": "George's is a diamond in the rough. Friendly owner, open early in the morning, makes breakfast sandwiches and bomb ass deli sandwiches. I never would have discovered the greatness of George's if it wasn't for my coworkers at the zoo. We order sandwiches on a slow day and run up the block to get them. I usually get the Californian on dutch crunch with jalapenos... It tastes like heaven!", "author": "Jackie M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-02-01", "description": "After reading all of the reviews and contemplating my neverending desire for a sandwich to top the last one I had, I decided to visit George's with big dreams. Unfortunately, I was very disappointed! Sandwich was very dry and missing the avacado that I paid extra for. \n\nI'm going to give it another shot, and will post a review when I do, but if you want a sure thing, check out Ike's Place or The Yellow Submarine", "author": "Matt D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-04-25", "description": "A great place to grab a sandwich and some extras and drinks before heading over to the beach.  Blah exterior but well-stocked inside and friendly staff.", "author": "Arvin C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-02-13", "description": "Looks like Fredy's got some competition for best beach-wich.  Note that George's is a corner store, though, so you'd best have a place to eat in mind.  Unfortunately for me, my bike flat-tired just as I got here, so by the time I got back home on the bus and toasted my sandwich (I got the \"Zoo\", natch), it was 2:00 and I was starving.  Needless to say, despite its impressive size it was gone in a blur of blissful chowing, but what I do remember is some amazing dutch crunch that managed to be chewy as well, almost seeming to fuse with the cheese at times.  Sigh, I think I actually miss that sandwich already.  Highly recommended, *especially* as an alternative to eating at the zoo.", "author": "Wes M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-08-31", "description": "I went back and they had Boar's Head deli products, a clean refrigerator case, and a Fully Stocked Beer fridge! Great job! Now I will start coming here more often. Thanks for taking the time to upgrade your food and beverage fridges!", "author": "Full T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-04-20", "description": "This is the place I go to when I want a quick lunch. Very friendly service and their sandwiches are huge and the stuff they put in it are so fresh and yum! I also love that they have dutch crunch! My fave sandwich is RJ's invention which has chicken salad in it. If you like pastrami, the New Yorker is good too. I've been there 3 times but they always seem to run out of sprouts except for one time. I guess it depends when they decide to go to the market? Just get there at 12 or something. It's not really a problem if you don't like sprouts of course. Don't forget to get a drink with your sandwich because it's included in the price.", "author": "Shu L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-08-26", "description": "George's Zoo and I go WAY back. My experience with this corner deli conveniently located across from the San Francisco Zoo (for Zoo staff and visitors, that is...i am not sure who ELSE frequents George's) began about 10 years ago. My staple fare of yester-year (a spinach calzone and raspberry iced tea Snapple) has metmorphosed into a love of the Lion House sandwich. I love the staff here, though there have been more than one instance within the last few months that my sandwich order was not filled correctly. Still love it though - \"I can't stay mad at you sandwich!\" - Homer Simpson", "author": "Jessa B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-04", "description": "great sandwiches, very friendly people. perfect to take a sandwich to the beach on a nice day (only a 4 block walk or so).", "author": "Matt K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-07-03", "description": "This is a review on the customer service and the sandwiches here.  My gym is about 5 blocks away so we frequent this place quite often.  Solid tuna sandwich!!  You could easily phone the order in and have it ready for you asap. They take cc and the staff is really sweet!!", "author": "Shelley N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-02-27", "description": "Great Sandwiches and on some days they have these huge deviled eggs that are yummy. The owners are super nice and its a corner liquor deli but they make really good sandwiches.", "author": "Hyung L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-07-02", "description": "Perfect place to fulfill your deli sandwich craving. They slice the meat fresh (I got salami) and the sandwich comes with a drink. All the employees are super friendly, I will most likely end up a regular here.", "author": "Annie N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-04-26", "description": "I like this place. Has a cool neighborhood feel and you always feel like you are part of the family. Phil and him mom are great. They are really nice. Very convenient as well. Instead of waiting in line for a few bags of ice at Lucky's, I just drive a few blocks down, park in front and pick them up at George's,  skipping the crowd and not having to wait in any lines. Love this place.", "author": "Opie D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2005-12-22", "description": "This is a big liquor store.  George is a good guy.  The coffee here is really good considering that this is just a corner shop.  They make sandwiches on the cheap also.  Pretty decent too.", "author": "Thadd L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-06-23", "description": "Great Local Deli shop with employees who remember your few favorite sandwhiches.  Awesome selection of cold beer.", "author": "Lynn T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-07-20", "description": "The people here are awesome with costumer service! I'm a regular here, and same with many other people so they get a lot of local repeating costumers because there so great. Prices for anything isn't bad at all. Their sandwiches are by far the best in that area and is made to order. Plunty of parking and plunty of smiles, check them out if your in the area. Stay away from them other few local liquor stores near by because you'll never see a smile there.", "author": "David M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-07-27", "description": "Stopped in for the first time over the weekend and Wow.  Just wow.  Amazing sandwiches and the widest selection of munchies I've ever seen.  This is my new favorite sandwich place in the city!", "author": "Samantha R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-12-23", "description": "It doesn't look like much from the outside but I work out at Fort Funston and this is one of the best (and closest) spots to grab a good lunch in this corner of the city. I recommend it for picnics on the beach or anyone who just has an urge for a good deli sandwich (I'm partial to the California on Dutch Crunch). Not to mention a super friendly staff, free bite-size donut samples and all the local zoo gossip (ask about the tiger incident, they have all the dirt).", "author": "Thea Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-04-19", "description": "I love their sandwiches!  I am addicted to their California Special sandwich on dutch crunch..mmmm good.  They have a great selection of snacks and drinks. They even make lattes...Great convenient store/deli. The staff there is awesome, especially the older lady, she is so sweet-I love her! :)", "author": "Mimi z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-07-04", "description": "I used to live down the street from this place and would go in 1-2 a week and get sandwiches for lunch. The food is really good and the staff is very friendly. If you're in the area and need lunch, I would try it!", "author": "Mike A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-02-05", "description": "Good sandwiches at good prices ($5.99 each with cheese, $6.99 for fancier sandwich). Just the right amount of ingredients in the sandwich - not too much, not too little. The service was fast and friendly.", "author": "Ruby T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-07-23", "description": "George's Zoo is the $hit! The sandwiches are tasty and cheap, super fresh, and fast too. The California Special always makes my day, but the way the staff serve it up takes everything up a notch. Almost everyone is related, husband and wife, son, cousins, etc. who will literally offer you the chips from their very own bag. The espresso coffee drinks are a delicious surprise, and made with love, like everything else. On a nice day, order up and walk down to Ocean beach to enjoy.", "author": "Leslie L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-10-02", "description": "The best deli sandwiches in the city. Great staff, great food, fair trade organic coffee that is better than any of your starbucks or pete's.  \n\nGreat place- worth coming to even if you have no intention of visiting the beach. Top points for this place.", "author": "Chris G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-02-07", "description": "This is by far the best sandwich place in all of sf. The meat they use is high quality boar's head beef. The breads are really good and the workers are very friendly. The portion are big and filling. my personal favorite is the BBQ beef it is the fucking shit.", "author": "philip g."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-04-29", "description": "Big fan of these guys.  They are about as friendly as they come and they make great morning coffee and breakfast sandwiches. I've made my way through the sandwich board and so far all have been tasty however, the Lion's Cage is still my favorite.  All in all, a great place to grab a bit on the go.", "author": "nicole s."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-10-24", "description": "This place pretty much rules.  Nicest staff... Phil the owner = nicest guy ever.  He makes everyone feel like a local.  Sandwiches are the best!  plus they come with a FREE drink!  Who does that!?  and they're cheaper than the new Java Beach I might add.  Beer is a little costly, but it's a mom and pop liquor store.  I'll pay an extra dollar to have them laugh at my jokes and give me samples of the new smoked gouda.  Try the New Yorker sandwich, it's amazing.  Not to mention they have every kind of booze in every size you could want!  Hungry?  Thirsty?  George's to the rescue!", "author": "J.D. E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-04-17", "description": "george's zoo is the best! do yourself a favor and avoid the yuppies, strollers and mediocre staff at java beach by skipping over to george's instead. they have a great selection of sandwiches (yeah bbq turkey and smoked gouda on dutch crunch!) and a ton of chips to choose from, too. you couldn't ask for better people behind the counter and the dolmas in the deli case are not to be missed! oh- and you can pick up the latest issue of penthouse while you're at it. ha ha!!", "author": "saraH c."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-07-26", "description": "Live only a block away and me and my wife always get the RJ's and the California Special. The people there are super friendly and the sandwiches are great! Definitely give them a try if your in the area.", "author": "Kei T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-10-05", "description": "I live a few blocks from here and when craving for a quick bite without wanting to go far, I always stop by here and pick up one of their delicious sandwiches. The customer service there is top-notch; after only a few visits the regular staff there would recognize me. If you're in the area, visiting the zoo or the beach, definitely give this local liquor store/deli a visit!", "author": "Toshi T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-06-12", "description": "Some of the best sandwiches in the city! Me and my dad used to go here for sandwiches and chips. They have great taste, good prices, and lots of variety. You'd be a fool not to go!", "author": "John H."}
