{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-11", "description": "After coming into the store multiple times just to score free caramel squares, my boyfriend and I thought it was finally time to try out one of their signature sundaes. We split the Cookie Bits Sundae, which comes with vanilla and cookies 'n cream ice cream (my favorite ice cream), handmade hot fudge, whipped cream, Ghirardelli Chocolate Chip Cookie crumbles and two Ghirardelli Milk Chocolate Caramel minis. I do not know how else to describe the sundae except for that it was decadent and wonderful - oftentimes the simplest ingredients are the best. The ice cream is rich and creamy, the hot fudge is made from their own chocolates (no artificial aftertaste), the chocolate chip cookie crumbles provide a delightful crunch, and the milk chocolate caramel minis add a burst of flavor. We finished the entire sundae in one sitting, even though I'm pretty sure it was meant for 4+ people to split! Service is prompt, and we only waited 5-10 minutes for our sundae to come out.\n\n Unfortunately, as it is located at the heart of the city, it's not as charming as the Ghirardelli Square location is, and there are constantly people entering and exiting the store simply to browse. If you are a tourist in SF for the first time and want to get the truest, most authentic Ghirardelli experience, I would recommend making the trek to Ghirardelli Square near the Embarcadero. I also visited Ghirardelli Square during my summer in SF, and the ambience & ocean views are incredible. Especially because there is an outdoor seating area / patio, Ghirardelli Square is the best place to share an ice cream on a sunny day!", "author": "Claire L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-10-25", "description": "Overall just....ok.\n\nCame here for a post dinner sundae and the sundaes are not cheap ($10-$13), but it had generous amount of ice cream and the trademark Ghirardelli fudge!\n\nMy only complaint is there is no way an average person could finish one, leaving a lot to waste. Come here with intent to share else you'll just feel bad afterwards :)\n\nFudge was good but could be warmer, the ice cream wasn't outstanding but wasn't bad - I'd come back to try and share a sundae but for one person it was way too much!", "author": "Alvin H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-20", "description": "Pretty good sundae! Chrissy sundae. It has generous amount of cookies. I love it! Very tasty. \n\nAlso, it's huge. So it takes about 4 people to eat this.", "author": "Rose F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-10-01", "description": "I am not a huge fan on chocolate with soy in it but the aroma of waffle batter in the iron drew me in. I looked around for a bit then decided I wanted to get a single scoop of cookies n' cream in a fresh waffle cone and I surprised with how good it was. Price wasn't too bad at $5.75 I just don't care for the part of town that it is in. Very nostalgic feel to the place and there is some awesome bar seating that looks out to the streets.", "author": "John C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-31", "description": "It's hard to beat a sundae and some chocolate at Ghirardelli. It's the classic ice cream sundae that everybody loves. If you don't like it, there's something wrong with you. Mentally. Wrong. \n\nMy wife and I shared a sundae with brownie. For me, being a savory person, just a couple bites on sweets and I was good. \n\nThe biggest knock on this location is there aren't enough seats available to all the customers. This location is just too small for the amount of people. The location in Fisherman's Wharf area is 100% times better and I want to say the sundaes areeven a tad better in the big location.\n\nBut overall for a good chocolate fix, this location does the job.", "author": "Michael L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-24", "description": "This ooey, gooey, decadent, sinful amazing brownie vanilla sundae (Treasure Island) hit the spot after dinner at Plouf. I'm not usually a fan of fudge overload but this homemade fudge was so good.  I want it again right now.", "author": "Rachel M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-21", "description": "Stayed at the Palace Hotel for 4 nights and we went to this place 3 times! Loved the Decadent Chocolate drink, Butter Pecan and Cookie Dough Ice Cream.\n\nWe bought lots of chocolates to bring back home too!", "author": "Benjamin S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-26", "description": "We usually come here for our after dinner hot chocolate...  my kids love it. Very hot and very cholately.", "author": "Ann C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-13", "description": "Stopped by on Sunday night for some dessert: my friends each had a chocolate and vanilla (large) shake, and I opted for the raspberry sorbet with fudge! For someone who does NOT like chocolate at all, the fudge was really good because it was kind of ooey and gooey and had the best texture with the icy sorbet! It's definitely a splurge to come here, so if you're coming, be sure to sit down and enjoy the ambiance!", "author": "Sherry W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-19", "description": "Expresso chip ice cream on a waffle cone - doneperfect cold and hot coffee, smoothies, and best of all ice cream and chocolate. I wanted to try the new Cookie Crisp sundae but I knew it would be too much so I opted for a single scoop instead.it was just enough, huge portions.", "author": "Ruby A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-06", "description": "After 8 miles of roaming around the city, my feet needed a break and I was looking for something sweet. I had come to Ghirardelli square often as a child for ice cream and I was curious to see if it was still as amazing as I remembered. \n\nThey had cute patio seating outside which is great for gazing out at the water. The inside of the store is small ( note: if you want to go to the main one, it's up the stairs and crazy busy) but still full of goodies! The only menus they have for their ice cream sundae deals is at the entrance so don't miss it! \n\nI ordered an Oreo shake and it took about 5-7 minutes to make, despite me being the only one in the store at the time. It was good. Not great, just good. I think the employees are probably over the tourists asking if that location is the main one, where the bathrooms are, etc because they were a bit short on patience. \n\nI would say if you're looking to rest your feet somewhere with a view and want to avoid mega crowds, come to this location! Otherwise, if you want the more traditional experience walk upstairs!", "author": "Steph G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-07", "description": "Stopped here on Sunday afternoon after some shopping on Market st. It was a good busy - enough to keep the place buzzing, but not too many people/tourists to where it affects the service. I split the paint ladies espresso dessert with my boyfriend, and it was more than enough sugar for us.\n\nIt's a fun, clean, quiet place to stop for a bit. Lots of seating inside, mostly tourists. Prices feel SF-ish. You get a free piece of Ghirardelli chocolate upon entering. It's always been caramel (least fav) when I go, unfortunately.", "author": "Thu P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-09", "description": "I walk pass Ghirardelli every day on my way into the office and would see people enjoying their ice cream sundaes. I finally caved in and decided to have one for myself. \n\nI generally like Ghirardelli chocolate so I imagined that ice cream topped with high quality chocolate would be amazing. It was. The only bad thing was that my order was inadvertently made to go, so I had to eat it out of a plastic cup. This made it hard to eat. Bleh. \n\nI would not recommend taking their sundaes to go since they're meant to be enjoyed right away. Also, The hot fudge melts the ice cream which makes for a sloppy mess.  \n\nAside from the ice cream there are tons of chocolates to choose from here.", "author": "Simon S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-23", "description": "Delicious brownies! I ordered the banana split and it was delicious. I added extra brownies which made it great. The best brownies ever. My only concern is that the little plate they put the banana split in was way too small. I ended up making a mess and dropping everything on the table. It was way too messy which I didn't like but delicious!", "author": "Andrea C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-03-30", "description": "Popular tourist destination per it's location and proximity to mass transit. \n\nWhile I like the ice cream here I just think there are better more innovate options nearby and throughout the city. Throw in the price point for this location and that's why I give it a 2 star rating. I've been here several times but recently I snagged a mint chocolate chip and it was pretty good. \n\nSo many good ice cream/gelato/chocolate spots in the city. Here is my ranking but they are all pretty darn good.\n\nWho doesn't love Chocolate and Ice Cream? (If you're raising your hand you can stop here ) \n\nI like making lists what can I say. I have lists for Ramen, Steakhouse/Brazilian , Milk Tea, Egg Tarts, Chicken & Waffles (super random list right). Give my profile a follow if you like them. \n\nRanking explained:  #1 (listed at the top)  is my favorite/ #?  (listed at the bottom) is my least favorite. Check out my latest reviews for my latest up to date Rankings. \n\nRod's San Francisco Chocolate and Ice Cream shop Rankings: \n1 Mr. and Mrs. Miscellaneous\n2 Marco Polo Gelato\n3 Dandelion Chocolate\n4 Polly Ann Ice Cream\n5 Salt and straw\n6 Chocolate Covered\n7 Smitten Ice Cream\n8 Teuscher Chocolate \n9 Humphry Slocombe Ice Cream\n10 Over the Moon\n11 The Ice Cream Bar\n12 Coletta Gelato\n13 Cako Creamery\n14 Bi-Rite Creamery\n15 San Francisco's Hometown Creamery \n16 Miyako Old Fashioned Ice Cream\n17 Mitchells Ice cream\n18 St. Francis Fountain\n19 Z Cioccolato\n20 Joe's Ice Cream\n21 Christopher Elbow Artisanal Chocolate\n22 The Baked Bear- Custom Ice Cream Sandwiches\n23 Ghirardelli Ice Cream and Chocolate Shop\n24 Recchiuti Confections \n25 Poco Dolce Chocolates", "author": "Rod M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-04-06", "description": "YELP 100 CHALLENGE 2018 - 94/100. \n\nComing from SFMOMA, Hubbers had a taste for some kind of dessert. There wasn't really a lot of places open around the area -  much less for dessert - especially on a Sunday. It wasn't really a big deal, \"not important.\" \n\nBut right before heading down Montgomery to catch the Bart, there it was: GHIRARDELLI. \n\nIt was meant to be! It couldn't have been more perfect! \n\nWalked in and whoa! Pretty packed! And a greeter gave us each a sample. \n\nHubbers got an ocean beach. Since there was a chill outside, I went for the sea salt caramel hot cocoa. Both got to our table in no time. (They really didn't mess around!) \n\nNot a fan of dessert or sweets, but the sea salt was a great way to level the sweetness down on the hot cocoa. Hubbers liked his treat! We liked the stop so much, we ended up buying and bringing home more chocolates! (Mostly for him, though...)\n\nIt was a great discovery and a great stop. Will keep a mental note of that location for the next time we're around here and Hubbers needs his sugar fix!", "author": "Jennifer B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-09", "description": "Located on Market and New Montgomery street. Bart station near by! Been here a few times now and still get the same great smiling people! Love the fact that this is my first stop once off the Bart train! Awesome sundaes and hot chocolate especially the sea salt hot cocoa. Hot and sweet! This spot is always busy. Great for a short stop if meeting with friends. Love their chocolates so I don't not ever come in here when I'm in the area.", "author": "Jemellee S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-04", "description": "Fuck the fats and sugar. I'm absolutely sweetlover and sugar fan!  When I come here I'm ready to sell my soul to the Diablo ==)) they make such a yummy ice cream and stuff with different tastes. Come here, try it and bring your kids in. They will name you as a Hero))", "author": "Vadim R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-09", "description": "Sugar rush !!! Place is really great for Sunday's. Definitely in the mood for chocolate this is the place to go. Be careful, the portions are bigger than expected. It might be a good idea to share. We were walking through market street and made a good decision stopping here", "author": "Aaron V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-06", "description": "I love the holidays. Why? Cuz someone will always bring me peppermint bark. Luckily, we got a bag at work on Tuesday, December 19th around 12:15pm. It contained both dark chocolate and regular, so I was happy as I adore the dark chocolate ones. I love the minty peppermint.\n\nNot sure if they sell peppermint bark all year round, but I look forward to the holidays because of it. Sure, they have other delicious squares, but being a fan of peppermint ice cream, I'll always have a place in my heart for the dark chocolate peppermint squares. So decadent, refreshing, and comforting.", "author": "Elena N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-12", "description": "It's a Ghirardelli store. I like coming in to get sample squares of chocolate, but I think it's also worth ordering one of their frighteningly unhealthy sundaes at some point in your life (shared with friends, of course). The Earthquake is a monster, but if you want an even higher calorie/dollar ratio, get the brownie one. Best brownie I've ever had.", "author": "Serena J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-30", "description": "Love it every time. It's always clean, staff is friendly, and ice cream is great. Only thing is their brownie on the Sunday is not always warmed up.", "author": "Arjan N."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-10-27", "description": "Ghirardelli ice cream is good but doesn't compare with Fenton's (Piedmont). I got the banana split. Seemed like it was half whipped cream. For roughly the same price as a Banana Jr (smaller version of Fenton's Banana special) at Fenton's, you get roughly less than 1/2 the amount of ice cream (3 mini scoops of vanilla, strawberry and chocolate). They also skimped on the pineapple and strawberry sauce. Ghirardelli banana split not a good value. Should have gotten the classic fudge sundae. Also, not huge but think get more ice cream. Lot's of tourists, so place was busy.", "author": "Ronald C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-17", "description": "The place is always full of people. Was curious to try one of their sundaes. Ordered Crissy field sundae which is quite good and would take two people to finish it. The price was around 13-14 dollars which was reasonable. Would come here again on a sunday to try another sundae.", "author": "Sharad B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-10-16", "description": "Denied my $1.00 off coupon because the sundae I ordered wasn't a qualifying sundae despite the coupon saying \"any sundae\" and the cashier saying she could apply the coupon.  Her annoying attitude is reason enough to avoid this overpriced tourist trap.", "author": "Jamey E."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-12-21", "description": "This is definitely a place you have to go to once in your life - especially when you're feeling touristy and want to go to the original Ghirardelli.\n\nHowever, that being said, there could be better. For once, the workers were not the nicest, and seemed like they were just waiting for time to pass. Giving them the benefit of the doubt, it does get really busy it there, however they need to work on their customer service. The desserts are way too overpriced too, especially for the simple things like the banana split which is $13 and basically like any banana split you can get.\n\nI got the Ocean Beach which was amazing. The salted caramel tasted really good and the chocolate was really rich. \n\nIf you go here and don't want to be disappointed, get any of the hot fudge sundaes. Other than that, it's just meh.", "author": "Hannah M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-11", "description": "the one on the top floor--- \nthis place is apparently always just...mayhem. been there a handful of times now and it's usually the same thing. busy, lines, usually friendly staff, and big ice creams. Their outdoor seating is what we go for if we can find seating to get away from the chaos that is families and children running amok and shoulder-to-shoulder movement or seating. Giant collection of chocolate flavors, obviously.", "author": "A. I."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-09", "description": "Dream place for kids and tourists who love ice cream. \nWe had hot chocolate, banana split, and more fun options they offered from the menu. \nStreet parking", "author": "Sammy B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-24", "description": "Got myself for my ordering for ice cream place on my 1st week of fall break with my bff Paola so much, because she was my favorite person of all the time! So I ordered a Midnight Reverie, Sea Salt Caramel Sundae and I think that's it. So my bff just ordered Butterscotch Hot Fudge Sundae, because she liked it alot also.", "author": "Tatiana V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-26", "description": "Here I go.... **********ASK FOR VALIDATION******** this place had a huge line but the line goes in fast. If you are here with your family or whatever, you should make it to go and wait for them to call your name. Also once your order your sundae or whatever GET THE SPOON. They have tendency to run out of the spoons. My experience was okay, I have better sundae at Disneyland Ghirardelli than San Francisco. We took our order to the near beach and ate it there. Cup weren't even labeled Ghirardelli :-(", "author": "bilal s."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-08", "description": "Everything ice cream and chocolate all under one roof. The lines are long but the choices are aplenty. The quality is excellent, though. They have several desserts/sundaes that are named after San Francisco landmarks like Crissy Field, Ocean Beach,  Golden Gate, etc. Prices are in the $12 to $40 range. The Earthquake ($39.95) feeds 4 and has 8 scoops of ice cream and comes with 8 toppings. \n\nGhirardelli...Quintessential San Francisco sweet treats.", "author": "Chuck D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-20", "description": "I'm still dreaming about this place. No doubt it was the best dessert place! Real chocolate desserts, real hot chocolate! Just amazing...", "author": "Julianna K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-16", "description": "Came here for the first time last night, although I've tried the location in the Westfield mall. \n\nAt first I didn't know where to order as there's a register I thought for merchandise purchases only and a counter. But then a gentleman who worked there gave out free peppermint samples and pointed me in the right direction.\n\nI wanted to try the Crissy Fields sundae but it's quite large, to share wit another person. So I ordered the Treasure Island sundae instead which comes with a brownie, perfect serving size for one.\n\nIt came out really quick! The server was very kind asking if I needed anything else. The sundae looked delicious and it was!\n\nI will admit it's pretty expensive considering some of the sundaes aren't much different than what you'd get from any other ice cream sundae place, aside from their fun names. The starting price is $12 to about $16. You'd be better off getting the Crissy Fields at $15 and splitting with another.\n\nI came alone after an evening event but will definitely come back again with a friend! Love that it's open late too!", "author": "Monica G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-19", "description": "Been here multiple times over the years I love the smell when you first enter the store. I also like the sample chocolate they hand out when you are in line. I had choc fudge sundae  the last time was there. Not cheap but pretty good.", "author": "Sunil R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-09-15", "description": "If you have a severe sweet tooth, this is definitively the ice cream shop for you. Anything you order here with chocolate will be overwhelmingly chocolate-y, as to be expected, but I warn you again! \n\nMy friend and I got a Crissy Fields sundae to share, and we barely made a dent in it. The chocolate fudge, cookies and cream ice cream and two chocolate pieces on top were just too much chocolate for us, and that says a lot given how my friend loves sweets. The portion size is large enough for 4 or 5 people to share just because of the intense sweetness. Overall, it was a pretty average, overly sweet sundae. \n\nThe tables were a bit sticky from previous customers, but other than that the decor is super cute and SF vibe. Would come back with more people next time!", "author": "Priscilla S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-25", "description": "It was very nice but it is too sweet for korean.\nAlso I can give them to 5 stars if they changed chair to soft..", "author": "Hakjoo L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-25", "description": "Walked in and got a caramel square sampler from the guy at the door who explained all their sales. We got a scoop of yummy ice scream and some squares to go. Nice location and they do a decent job keeping the homeless out", "author": "Jennifer U."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-22", "description": "Great ice cream and chocolates. Gets busy on weekends and evenings.  Great location. We tried the banana split and it was awesome.", "author": "Andrew P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-07", "description": "Ordered the split banana. Sufficiently large to be shared with someone else and so delicious. It has more than 1K calories if you care about your health :)", "author": "Mehrdad M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-07-19", "description": "Very pricy and very sweet. Tourist trap, but I knew it going in. Good service, friendly staff, and decent ice cream. The hot fudge is the best part but I can't get over the price for a sundae. $12 plus tax for two scoops, hot fudge, marshmallow cream, nuts and a cherry. I asked for no nuts but they put it in anyways. Luckily I'm not allergic. I'd go back here for special occasions and super hot days though.", "author": "Joanne T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-01-25", "description": "A fleeting thrill that can turn quickly into chocolate overkill. My recommendation is to order the more subtle entries off the menu. Even besides chocolate overloads, for instance, I ordered the Sea Salt Caramel Hot Cocoa and that became way too sweet after a few sips in and my entire face cringed. I had a good time with two scoops of vanilla and rocky road ice cream (such economy of balance!), and a bite of brownie was enough. I don't see how, though, anyone could not try famous \"Ghirardelli\" once, it's just one of those things you have to do. Just go in with the plan to order the more subtle chocolate items, or go milk chocolate. For me, I ate and drank everything because that's just what I do. #foodslut", "author": "Sean C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-14", "description": "I can't comment on the ice cream -- which looked fabulous -- I can comment only the hazelnut latte and the great staff plus divine mini chocolates.  \n\nDo yourself a favor and stop by in the AM for a latte from Ghirardelli.  The lattes here are honestly better than Starbucks, Peets, or Dunks if you like \"flavored\" coffee beverages.  Not too sweet, but just sweet enough with a nice warm nutty flavor.  I also loved that they included the calorie content on all of their food and beverage offerings.  But with chocolate shops, sometimes ignorance is bliss.  Chocolate bonus:  they basically have every kind of chocolate known to man sold here in bite size pieces.  Waste lines beware!  \n\nI also wanted to comment on their great staff.  On a slow Sunday afternoon, I saw what appeared to be a homeless woman wander into the shop, eat off a dirty dish left by another customer before it could be taken away by the staff, and verbally assault one of the shop workers with racially (and nationality) charged comments.  The staff handled the situation professionally, calmly, and firmly.  I was very impressed.  Kudos to you guys!", "author": "Sarah M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-04", "description": "A must visit when in San Francisco. Beware the rush even on weekdays are crazy so be prepared to wait in line to get your favorite dessert. They do have a place where you can buy the chocolates assorted. Try their sea salt caramel sundae! You will not regret it. It's something different and not available everywhere. You can also see how chocolate is made there. They have some machines and chocolate flowing continuously.", "author": "Julia J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-17", "description": "This shop is just down the street from my office, so it's very convenient to pick up chocolates for gifts, parties, etc. I'm always pleasantly surprised by the high level of customer service provided by all the workers, from the manager to the person who welcomes customers and hands out free samples. Everyone who enters the store is greeted with a smile and treated with dignity and courtesy. The large bags are the best bargain and provide a delicious assortment of the most popular varieties.\nA top rating for this store!", "author": "Susan N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-06", "description": "Awesome ice cream. Lines are long and yes its touristy but they have the best chocolate and a very creamy ice cream. If you can handle a wait it's worth it. It's not as bad on weekdays, def in barely not a weekend thing unless you don't mind the wait..", "author": "Andrew M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-02", "description": "My daughter insisted on getting a brownie fudge sundae at this chocolate paradise. That one sundae was enough for the three of us to indulge in chocolate heaven. I'm an ice cream snob and I could tell they use good quality vanilla ice cream with this sundae.", "author": "Franklin M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-02", "description": "The new remodel is GORGEOUS, so much more spacious and modern and I love the San Diego line of chocolate!", "author": "Kelsey H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-26", "description": "Tasty and open late right at the Montgomery bart. I ordered the strike it rich butterscotch sundae. It was delicious and very filling. The icecream was good but the real stars were the butterscotch and Ghirardelli hot fudge. It definitly hit the spot. Take advantage too of yelps dollar off offer.", "author": "Sean G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-08", "description": "Yummy ice cream, on the extra sweet side but that's OK.\nJust be careful going to and from there and watch your step on the sidewalks outside; this is San Francisco - Post Modern Version 2.0.  That means, watch out for the human waste and toxic waste outside.", "author": "Ricardo O."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-02", "description": "I love the idea of stopping in here when I happen to be in the vicinity but tend to regret it a bit once I actually go. Don't get me wrong, the actual treats are wonderful! But the whole experience in the jam packed inside isn't exactly an enjoyable one which definitely takes away from it all for me. I much prefer the Ghiradelli in California Adventure for that reason alone.", "author": "Karina M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-10-21", "description": "If you've never been to a Ghirardelli shop and you're in SF, go to Ghirardelli Square (near Fisherman's Wharf) to the original store to get the full experience. Trust me, it's worth it. \n\nHowever, this particular location was in my neck of the woods for a work conference and I was craving something sweet and it was rainy...so I went here. It's on the Market/Montgomery Street corner.\n\nReasons this wasn't as thrilling a visit:\n\n+Upon entry, a worker awkwardly gave me a wrapped square of chocolate. Like just kind of shoved it in my face. Thanks? Would've appreciated an explanation - \"this is a seasonal flavor\" \"this bar is on sale today\" etc.\n\n+Prices are steep like at all the Ghirardelli shops - the classic hot fudge sundae is $13 after tax. Oof. But easily split between two people. However, I felt the signature hot fudge was a bit sticky, like it hadn't been heated up/melted enough.\n\n+Overall, it lacks the charm and history that the original Ghirardelli store has to offer.\n\nIf you're in a pinch, need a sweet (or a gift of chocolate) and find yourself in the neighborhood, stop here. Otherwise, go to the original store.", "author": "Katie U."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-04-08", "description": "Frequent this place constantly. When shopping for items around the store, service is always hit or miss. Sometimes there's someone there that is super enthused to help you find the right gift items for your occasion, others, there's a person who comes off as if that day is the worst day of his/her life, so you shouldn't even make eye contact, much less ask them a question about a product, because it will just end badly/sadly. \n\nI definitely try to shop during non-peak hours, early morning or later evening so I can mix and match baskets, or check out their new gift items without having to dodge a lot of people there to order hot beverages or giant ice cream creations. There are great items wrapped up in pretty packaging or SF-themed if you're looking for family gifts, holiday treats, or corporate packages. \n\nThe shop is definitely adorable, it's in the corner of the historic Palace hotel, and the set up is like an old fashion soda fountain. Definitely one of those tourist traps when it comes to the $10-$12 ice cream sundaes, but it's a festive experience and you can sit along the windowsill making passersby/foot commuters jealous with the massive ice cream creations. \n\nSuggestion: espresso-based drinks/coffees are often on the weak side, so save your caffeine trip for the coffeehouses, and keep your visit ice cream and chocolate-focused.", "author": "Alison A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-01", "description": "Excellent! First time coming here and must say their ice cream sundaze are wicked! We tried the sea salt chocolate sundae (small) for two. At 1160 calories it was way more than expected. Definitely coming back here sometime in the future !", "author": "Harry H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-14", "description": "I love chocolate. Their signature sundane definitely worth a try, they all come in family size, so good to share. Love the hot chocolate too.", "author": "Alicia T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-31", "description": "Ghirardelli is iconic and a must-visit for every visitor to San Francisco, particularly foodies and chocoholics. It's busy and expensive, but the wait is usually worth it. Try to get your hands on one of the paper menus so you can decide what you want to eat while you're waiting. There are several specialty sundaes but I think the build your own is the way to go. It's not widely known that they offer sugar free vanilla ice cream. I usually get that with their delicious hot fudge (not sugar free) and marshmallow topping (also not sugar free) on top. I realize I am a walking contradiction but I don't care!\n\nIn the back there's a chocolate machine with melted chocolate that smells so good and is fun to watch. It's a self-guided \"tour\" and seems to really intrigue children. \n\nMake sure you pay a visit to the adjacent chocolate shop too: you'll be given a free sample square (individually sealed) of a delicious Ghirardelli chocolate candy! (Cheapskate alert: you can often go through multiple times and collect more than one sample).", "author": "Louisa M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-12-08", "description": "Very touristy chocolate shop. I was very glad that security was screening out the homeless that would loiter inside every now and then. Very nice location. But was dissapointed with their cold drinks. I went here just to try it out. Explains why only tourists come in here. I like their products but the cafe could be a lot more enticing with improved menu", "author": "Beatrice T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-05-01", "description": "Such a disappointment! The Sunday was basically served in a Starbucks frapuccino cup (we requested to have it on-site, not to go) and was basically vanilla ice cream and shell syrup. I was expecting better from Ghirardelli hometown. I do like that they're open late for an unexpected sweet craving at night.", "author": "Jessica S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-27", "description": "Popped in for some hot tea during a chilly lunch break. Bought a hot tea and couldn't help but getting some chocolate squares. But the icing on a cake was a complimentary sorbet! So that made my day and made my lunch hour SWEET", "author": "D S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-05", "description": "OMG!  I've been here so many times and it never disappoints.  I went there at the end of August and they had a special sundae that I really hope they will add to their usual offerings.  The Ocean Beach Sundae (a sea salt, caramel sundae with hot fudge, caramel and salt) was to die for.  I had one scoop of vanilla and one of espresso chip.  I was worried it might be too sweet, but it was not.  It was superb.\n\nI did have a bit of trouble with the tables not being cleaned, but the manager handled it wonderfully and even gave me some candies for my trouble.  Overall, a great experience", "author": "Susan R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-01", "description": "Obviously I had to make a trip here! My friend and I both got sundaes. She got their famous brownie sundae and I got their butterscotch sundae! Both were delicious, but Huge! I recommend coming here hungry and in the mood for sundaes lol!", "author": "Tahini R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-12", "description": "I love this place so much that when a friend and I were in town, we skipped traditional dinner and ate ice cream instead. We shared a monstrous Sunday and did the happy dance with each bite. Every topping was rich and decadent and that chocolate... yum yum yum! if you are in the SF Bay Area, you have to do yourself a favor and drop in. there are barrels of candy, the staff are incredibly friendly, you get free chocolate tasters when you walk in, AND THE PRICES ARE GREAT! This is definitely one of the places that I hit every single time I am out that way. I also love the history that's associated with the square and this shop. I like to mosey around and read the little placards and old photos with captions of the way things used to be... it definitely makes me feel like I'm adulting while eating like a 5 year old.. all for the sake of cherishing history.. it's a tough job, but someone's gotta do it :-p", "author": "Rucinda S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-01", "description": "This place is supposed to be great for its ice cream and chocolates. The prices caused alarm and me grab my wallet as if i was being pick pocketed. I took a deep breath and ordered the banana split, which costs $15. While waiting at the table i started having anxiety and buyers remorse cause $15 goes a long way in the mid west, and i wasn't in Kansas anymore. \n\nWhen my tin boat of frozen dairy and sugary confection arrived my fears were allayed as i took the first spoonful of the chocolate side, and a piece of banana, and i realized this is not a national chain, which uses artificial flavors and ingredients ( is it even made of dairy?). And there we go, the secret to this treat was the nice thick and creamy consistency of real dairy. Of course there was whipped cream, sprinkled with chopped nuts, along with chocolate syrup. With a cherry on top.\n\nI recommend visiting Ghirardelli Square and getting any of their ice cream treats. It is worth the money and makes for a memorable authentic experience to Fisherman's Wharf and SF as a whole. You will be happy you did so.", "author": "William B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-09", "description": "I am boggled by the fact that I have not written a review before since I have been here many, many times and have LOVED it every time!!!\n\nThere is nothing more quintessentially San Francisco that Ghiradelli. The ice cream concoctions are to swoon over, and you can buy delicious chocolates to take with you as a bonus!\n\nThis is a must stop on every trip to SF. It takes you back in time to the institutions of old SF and all of it's charm. If you have never been, GO. If you have, keep going. Enjoy. SMILE. This is what life is all about.", "author": "Lauren C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-05", "description": "The ice cream at any Ghiradelli's store is consistently delicious, but I do think it is pretty overpriced. Luckily there is a $1 discount with a Yelp check-in! The ordering process is easy, and they hand you a number and bring out your sundae to you when it is ready. I treated my two friends to a Golden Gate sundae (vanilla, chocolate, and strawberry ice cream scoops with hot fudge, fresh fruit, a banana and whipped cream, $12.45). The ice cream itself was creamy and smooth, although it was difficult to actually taste much of the ice cream itself because of the toppings (not that I'm complaining... I love the toppings). The hot fudge was particularly rich and chocolatey, and I like that they gave ample whipped cream.\n\nI took off one star because of the value - almost $13 for an ice cream sundae is pretty pricey!", "author": "Amy C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-09-13", "description": "Great place to get a sundae and anything ghiradelli! Definitely a tourist trap- i walk by this place everyday on my way to work and people are eating huge sundaes at 10am! Weird.\n\nCame on the hottest day of the year in SF and we definitely had to hover for tables.\n\nThey have a lot of staff but they need to do a better job at cleaning the tables- everything was sticky.\n\nSundaes run 10-15 and are perfect for 2 to share. The brownie one we had was delish! I don't like that they ass sea salt to it but that might be your thing sweet/savory.\n\nThey merchandise is all adorable and SF themed. If i wasn't local i would definitely buy it as a souvenir for friends and familu. Super overpriced though!!!", "author": "Erica D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-20", "description": "You know what I hate about this place? The free chocolate guy is such a pusher! He sees me coming back from the gym, he sees me in my gym clothes and he will look me in the eye knowing I'm going to take his pumpkin spice Carmel chocolate square while he waves it back and forth.\n\n;-;\n\nButtt like if you want a mocha why would you go anywhere else", "author": "Robin H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-10", "description": "Always crowded but worth the wait! If you do t have a big appetite you can order a single scoop with toppings! I love hot fudge on cookies n cream! Yum yum", "author": "Kerry K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-03-30", "description": "My husband and I came here on a Monday since it was impossible to get in on the weekend without waiting for an hour. We ordered the hot fudge sundae, thinking it was going to be huge since we paid just about $14 for it. Keep in mind California charges 4% \"unhealthy food\" tax. The lady slammed the sundae on the table and said enjoy. Pretty much every employee here was less than heppy to be working it seemed. And for the sundae it was less than exceptional. I could have made this sundae at home for 2 bucks. Not sure why people flock here.", "author": "Alyssa M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-25", "description": "Yum! Yum! Yum!!! Great service by Everett who noted it was international sundae day and 1/2 off our old fashioned sundae! Very personable and attentive.", "author": "Melanie B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-03-10", "description": "Place - good place to acess. Pretty many tables and less crowd than Ghiradelli square. You don't need to wait to order or get table. There also offter same prodects like Ghiradelli sqaure. \n\nTaste - Good. Sweet but not tooooo sweet. I love browny with ice cream. Treasure Island is good for two people. Drink is not too special but vanilla latte is great! If you ask a whip cream on it, they will do for your drink.\n\nPrice and Service - price is not too expensive just tourist place. Service is not that good. A person who gave a free chicolate was nice but evey time I visited here, cashers were not nice.", "author": "Da Won L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-11", "description": "It's everything you would expect for a top tier chocolate place. The staff is very accommodating and welcoming, the chocolate is rich and the servings are plentiful. The Treasure Island Sundae is absolutely delicious!", "author": "Michael W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-08-31", "description": "The ice cream is delicious and free chocolate when you walk in is always a plus! \n\nCame into the store during the afternoon with a group and the place was packed, there was no place to sit. We decided to get the banana split with strawberry, chocolate, and vanilla ice cream. The ice cream was prepared pretty quickly and tasted delicious. However, the spoons they gave us were already USED! Like there were some chocolate dried on the spoon probably from making a previous dessert. When we notified one of the people worked there he, he just looked at it and then snatched it out of my hands. No apology and no new spoon. So we grabbed the plastic ones and then he realizes it. However, other people seem to have a great time and Ghiradelli is a iconic place to visit when one is in San Francisco. \n\nBottom line, this is a great addition to San Francisco with great desserts but the service could be a hit or miss!", "author": "Jeanette Q."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-19", "description": "If you're looking for a quick getaway in The City or just need your sweet-tooth fix, look no further!\n\nConveniently right off the Montgomery BART stop, you can get $1 off an ice cream sundae simply by checking in.", "author": "Roger D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-03", "description": "How could you go wrong with ice cream and chocolate?? \n\n\nYou can't.. lol \nBest dessert in town!!", "author": "Tina K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-15", "description": "LOOOOVE! Aside from the delicious sundaes, the customer service is awesome. My intentions were to get my sundae to go because parking is ridiculous however, I was treated to well that I decided to sit down and enjoy my ice cream. I was greeted as soon as I walked in and got my sample. The cashier, Jess, was beyond nice and helpful. The person who made my Sundae, Emiliano, went out of his way to make sure my order was prepared and ready to go. Like I mentioned before, I wanted my sundae to go so he made sure I had extra napkins and an extra bowl so ice cream wasn't all over the place. I enjoyed talking to the employees so much that I was sitting down before I knew it. I ended up ordering chocolate covered strawberries before I was done with my first order. Lastly, the store is very clean and well stocked. Everything in there is pricey but it is definitely worth it. I wish I lived closer.", "author": "Margarita B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-22", "description": "If you want to have \"TASTE SEX\" with chocolate - this is the place!!! We had the hot fudge sundae with a brownie --had to share--too much to eat for one person--sooo damn deelish! Bought a large bag of caramel and chocolate to go!!!", "author": "Margaret B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-14", "description": "Other that being way over priced for what you get, it was delicious as usual.  It's a family tradition every time we go to San Francisco.", "author": "Matilda Q."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-29", "description": "Now this is a great dessert stop! They make quite a few different desserts to choose from, you really can't go wrong. If your in the area stop here or if your in Boston stop at there location or whatever there's a location by you stop there. Service is always good and everyone seems helpful. Every time I leave here I'm satisfied! If you LOVE Chocolate then this place is a must stop for you. Hope you ENJOY!", "author": "Al C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-14", "description": "The desserts here are so good. And the prices are not even that bad. Me and my friends shared the banana split and the lands end. My friend also got the sea salt caramel got chocolate which was also good.", "author": "Audrey A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-05-08", "description": "I decided to check this place out with my brother and sister in law and I was honestly disappointed. Don't get me wrong the ice cream is very delicious, but I would rather just go to Cold Stone or Baskin Robins. Their portion sizes for their ice creams are HUGE and I just love how beautifully designed the place is. It is a little pricey for the ice cream, but it's only because it's enough to feed a family of 5. If you're looking to have a good time def check this place out, it's located in a very beautiful area filled with a lot of fun attractions.", "author": "Neloffer E."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-06-28", "description": "Not impressed whatsoever. Staff harried, rushed and less than pleasant. Had to buss and clean tables as they were filthy and staff showed no initiative to clean up. Ice cream flavor was good however minimal hot fudge and Sunday toppings were given considering a $13 price tag for a two scoop sundae. Will not be going back to Ghirardelli.. total tourist t", "author": "Joanie W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-09-16", "description": "This shop smells amazingly sweet. As soon as you walk in, the aroma of chocolate surrounds you and forces you to try some ice cream. I went for the classic chocolate ice cream, which was a generous scoop and tasted good, but not better than chocolate ice cream at our local ice cream shops in Oklahoma. I'm not even sure it's worth the experience, as the shop is very small and you can buy Ghirardelli Chocolate pretty much anywhere.", "author": "Ciara D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-30", "description": "If have have not heard of Ghirardelli then please find a flashlight and get out of your cave. Stopping at this place well in San Francisco was as important and seeing the Golden gate Bridge. Well, maybe not that important but pretty darn important. As soon enter you are greeted with free chocolate and the aroma of all the tasty treats you been dreaming of you since you're a kid. I must admit there was a little bit of sticker shock as we approached the counter and looked at the menu pricing but when in Rome spend as the Romans do I guess. We ordered the Crissy Field sunday. By the way there is a one dollar off checking offer! We ordered one to split his we figured that would be enough as we already had a huge dinner. Boy was I wrong I could've ate two of those things not because they're small but because they are so good. My brain does not know when to say stop. Aside from the crazy pricing, I was completely pleased. Maybe next time we will stop here first and eat dinner second ha ha. We gathered a few Christmas presents on our way out for all of our friends and family.Rest assured we'll be back as soon as we can!", "author": "Eric S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-25", "description": "When in San Francisco on Christmas Day, there are not many options for desert. However, Ghirardelli is open on Christmas Day, the essential San Francisco ice cream/fudge parlor. I ordered the amazingly and seductively delicious and sweet original hot fudge sundae with no whipped cream. The hot fudge was seductively delicious and the best part of the sundae. The vanilla ice cream did its job and it was delicious. The nuts and maraschino cherry complemented the seductive sweetness of the sundae. This Ghirardelli was full of classic San Francisco pre-hipster vibes and bits of classic Americana. However, there was a hair in my sundae which is why I shalt only grant this Ghirardelli four stars. Overall, Ghirardelli is still home to San Francisco's best hot fudge sundae and is an essential stop for every San Francisco tourist. Finally, to obtain the full Ghirardelli experience, one must head to Ghirardelli Square.", "author": "Nick C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-04", "description": "I super love this place,  i.e. the style, the airiness, the deserts, the shakes and the CHOCOLATES. \nThis is one of those desert places that one just want to sit and eat there heart out without worrying about the calories. \n\nNow let's about the deserts enough said about the place. \n\nLands End (Salted caramel brownies sundae) - I am still drooling a bit when I think about it. So yummy, loved the warm sundae with creamy ice cream. \nIt was so gooey and fresh !!! \n\n\nStrike it Rich (Butterscotch hot fudge sundae) - I liked the saltiness of this drink, very unique blend of flavour with creamy ice cream and butterscotch filling. \n\nP.S. We spotted a hair in the salted caramel brownie sundae and when I mentioned it, they were sweet enough to acknowledge it, said sorry and didn't charge me for it. \n\nI would definitely go here again !!! Great staff, excellent service and free chocolate when you enter", "author": "Simran K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-10-09", "description": "I thought about going to 2 stars, but I honestly could not think of one reason why I should. I thought maybe because I didn't personally eat any chocolate? But my friends did, so screw that. I thought maybe am I biased because I'm not a tourist? But screw that too. They should be able to serve Bay Areans and make them happy too. \n\nWent with some co-workers to get an afternoon snack, and I got a $6 cappuccino. Worst capp I've ever had. It was mostly milk, and lukewarm at best, and by the time I got to my office it was cold. My friends both got brownies and said it tasted like they were store bought, frozen, and re-heated. They fell apart into crumbles. The staff at the register were kinda rude, supremely disinterested with working, it seemed. Even the guy handing out chocolate samples didn't smile. Kind of the worst place ever in my opinion.", "author": "Nikki G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-07", "description": "Wish they have these places more in Southern California because this is a real treat. Not only is there walls of chocolate to pick from but they offer a variety of ice cream Sundae that are sure to make everyone in your group happy with their favorite twists of a Ice cream sundae. \n\nI would recommend this place to anyone visiting the area that is looking to quench their sweet tooth with something of good quality that is affordable for city prices.", "author": "Ryan S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-08-31", "description": "Very, very disappointed. I live in SF and love Ghirardelli, visiting often. My wife and I ordered the World Famous Hot Fudge Sundae and was completely disappointed. The ice cream had ice crystals and it was served in a plastic cup. My guess is this is pre-made and frozen in the plastic cups. I asked the staff and they would not answer if they were pre-made. They kept avoiding the question and would not remake the sundae. For $11.95 I do not expect icicles in my ice cream or the cheap ice cream they made it with. Out of fear this ice cream was defroasted and refrozen (which causes the ice crystals and is a health code issue) we tossed the sundae in the trash. Do not purchase this so called World Famous Hot Fudge Sundae.", "author": "Michael C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-20", "description": "Love the shakes and the customer service. The shakes and hot chocolate were really good.  On our way out one of employees could see we stopped there before we made our way out for our flight and gave us extra chocolate for the trip out. Really loved that and gonna make sure to always visit for the hot coco and customer service.", "author": "Michael R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-12-31", "description": "Ice cream was good but not worth 12 dollars. The pictures on the menu make the sundaes etc. look way larger than they actually are.", "author": "Amanda R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-03", "description": "Heavy and super sweet but yum sundae. Also, they have these huge machine mixing chocolate. Very cool.", "author": "Mini K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-04", "description": "Went there on a visit to sf during my husband's birthday weekend. Since it was someone's birthday so both of us were not counting the calories ;) As soon as we entered we were given a free sample of their new chocolate. It was a milk chocolate and tasted good. We grabbed a place to sit and started thinking about ordering something. Well let me tell you, their menu has a lotsss of options :D So you might end up spending extra time thinking on what to get. At one point, you might think of getting everything on the menu :D :D But after much discussion we decided to go with a scoop of vanilla ice-cream, topped with molten sweet chocolate fudge and topped with chopped almonds. It came in a waffle cone dipped in chocolate. \n\nIf I tell you that it tasted awesome then it will be an understatement ;) It tasted like heaven. Their ice-cream was so rich and creamy and tasted way better than many vanilla ice-creams that I have ever had anywhere. The molten fudge tasted simply amazing and it was the highlight of the entire item. The fudge became thick after sometime but it still tasted awesome. \n\nThis place had ample seating and lines were short. Everyone was served quickly even though there was a huge foot traffic. I will definitely come back with friends and family.", "author": "Bharti K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-17", "description": "Yes, it's super touristy to go to a Ghiradelli store.  But sometimes you want a decadent sundae and they do that well!  Plus the ambiance of the fancy Plaza Hotel is a bit nicer than the overcrowded Ghiradelli Square or a mall basement.  So as a local, I'll admit, sometimes I do indulge.\n\nLand's End: A very generous amount of syrup (chocolate & caramel), which in my opinion is the most important part of a sundae.  A brownie was split in two and placed on each end of the bowl.  It was a tasty brownie, but a bit more cakey than fudgy; I prefer fudgy.  They used vanilla ice cream, which is the perfect blank canvas to let those other ingredients shine.  Splitting among two people, you both leave with a nice sugar buzz.  Not sure how one person could take down this monstrosity though!", "author": "Adam B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-27", "description": "The ice cream portion is very good, staffs are super welcoming handing out candies constantly.", "author": "Jane W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-26", "description": "I came in to get two caramel lattes and a chocolate covered strawberry and a chocolate chip cookie and Josalyn charged me for the more expensive chocolate covered strawberry and forgot to put it in the bag because she was so busy trying to upsell me on getting an additional brownie that I clearly wasn't interested in purchasing. I just am very unhappy with the customer service and even worse I paid for a strawythat I never got. I hope that management reviews this and helps their staff understand that they don't need to upsell so hard that they mess up what the customer actually wants.", "author": "Emilee M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-02", "description": "These few blocks of FiDi are pretty dead on the weekends so you'll definitely find seats. The desserts are standard with what other Ghirardelli stores around the country serve (i.e. gigantic portions of sweetness) but if you're visiting Ghirardelli as an SF sight to see, probably better off going to Ghirardelli Square :)", "author": "Elise P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-08", "description": "Ugh, what i miss living in LA? Getting to visit the Ghirardelli when passing through Hollywood. But thankfully the Bay is close by to get my sundae fix. One of the best", "author": "Cyndi L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-30", "description": "The original! We walked all the way over here from Fisherman's wharf, so we had worked up an appetite! We shared a chocolate sundae & we were not disappointed. There a great view of the water from where we were seated. We didn't eat in the main restaurant but the store cafe, which was perfect for us since there were shorter lines.\nIt's in a nice area with different stores and a beer garden too! Worth a visit for chocolate lovers.", "author": "Shelly S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-24", "description": "After having a belated V-day dinner at my most recent discovery Mourad for the second time in 2 months, we made sure to save room to head over to the Ghirardelli Ice Cream & Chocolate Shop for dessert just a few blocks away.  \n\nI was excited to find that there was another ice cream shop option outside of what can often be a too touristy and crowded Ghirardelli Square on the weekends.  Attached to the Palace Hotel where you can enter through the hotel or from the street side, this shop has a good blend of tourist and locals.  In the midst of the Financial District and close to the Downtown area so right by BART, it is a perfect location to drop by to pick up chocolates for yourself or gifts for others.  Like most stores, as you enter, you are greeted with a complimentary square to whet your palate before you dive into the many choices available.  \n\nSince our home is already on chocolate overload these days, we came for the Ice Cream Sundaes.  Starting at $10.95 for Sundaes served in the Sundae glasses to up to $39.95 for the 8 scoop Earthquake meant for 4, we settled for the middle ground and split a $13.50 Land's End Salted Caramel Brownie Sundae served on a Sundae boat.  The brownie was soft and a perfect pairing for the ice cream.  I do wish they were less heavy handed with the whip cream though as the entire first bite for both of us was all whipped cream and strange that they do not remove your # after they serve you your order.  That meant having to pick up the sticky number tag and return to the counter yourself.  \n\nBut overall, enjoy having an easier to get to location for a decadent Sundae fix.", "author": "Joyce Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-01", "description": "Love the chocolate? Then why not try other items to offer.  The store is small with limited seating, by there is additional seating outside.  Today was actually a super hot day but still this place was hopping with a line and seats were full. Many people also enjoyed their purchase to go and walk and enjoy the area around the water.\nWhen you walk in they served us their today's choice of chocolate, as my husband stated, wow this is actually super good!  He thought it was just a huge hype because of the name and now gets why people love it.  So smooth and tasty it makes you want to buy everything in the store.  That small start of a teaser can get you to want more and before you know it you bought ice cream and chocolates to take home to family.\nSomething about buying the chocolate from the store makes it more valuable then buying it from the grocery store. \nIf you are close to this store you gotta check it out, it's one of popular San Fran things to do while in town.", "author": "Sanaz M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-08-11", "description": "Hot Fudge Sundae? The fudge was hard and cold. The ice cream was nothing special and had ice crystals in it. All this deliciousness for $13. That's right, $13 for a mediocre sized crappy hot fudge sundae. Don't bother.", "author": "B B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-12-07", "description": "Review #231 - 2016\n\nShowed up with my nephew on a Saturday night around 10:30 PM and the place was packed.  We were kind of hesitant about ordering because we weren't sure if we would find a seat since it's self-seating.\n\nAfter we placed our orders, a few tables became available so we took a seat and waited for our desserts.  My nephew had the 2 scoops of ice cream on a waffle cone.  He actually asked for one scoop of chocolate, but I wanted to try the butter pecan so I just added that extra scoop to his order.  I went with a large cup of sea salted caramel hot cocoa minus the whip.\n\nFor a pretty expensive chocolatier, I was expecting the food to show up in a more presentable manner; the ice cream on the waffle cone showed up lying down on a platter, which definitely made for an ugly photo op.  At least the ice cream tasted better than they looked.  Their butter pecan is probably one of best that I've tasted.  The chocolate wasn't too bad either.\n\nHowever, my hot cocoa was extremely sweet.  So sweet to the point that my throat started to hurt as soon as I took a few sips.  I had to ask for ice water just to wash all that sugar down.  My hot cocoa was supposed to be served with a side of milk chocolate square, but I guess they must have forgotten because I never got one.\n\nI'll probably never come back being that parking is already a pain, and to top that off, the desserts just aren't worth the extra trip.  I would've been happier with my Godiva soft serve at this point.", "author": "Sivilay T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-06", "description": "Simply delicious! It's always crowded but worth the wait.... and you get a free chocolate as you walk in! Yum!!", "author": "Jenn L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-20", "description": "This place is always great to visit when we are in San Francisco. My kids and I seem to always over indulge ourselves and walk away feeling like a glutton. I always get a banana split sundae and end up finishing whatever leftovers my children don't get to. There are definitely lines every time I've been here, but it's a tourist attraction so it's a given.", "author": "Michael L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-15", "description": "With Ghirardelli Square being so out of the way, this location is perfect to experience what the chocolate giant has to offer. The second we walked in, we were handed chocolate square samples for free, which is always a plus. I was craving a dessert of some sort this night so I opted to get their chocolate milkshake (almost $7). It was delicious and just what I needed. \n\nI definitely recommend it if you're into sweets, and definitely for tourists who want to check out something local and specific to San Francisco.", "author": "Emma W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-10", "description": "Great place to battle your sweet tooth, really enjoyed the Sundaes.  Would recommend to anyone who like banana splits.", "author": "Kenneth M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-08", "description": "The food was amazing, I ordered a chocollet mousse. The Dow side is  the wait seemed like forever. And for a Tuesday evening??!!", "author": "Brandy W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-12", "description": "Just as I imagined. Get the ice cream and coffee items. You can get the chocolate cheaper at your local grocery. The views are breathtaking. You can see Alcatraz from one seating area. We sat outside and had our coffee and ice cream. There was good live music at and it was great people watching.", "author": "Courtney S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-03-25", "description": "We got the Treasure Island and the Golden Gate, both of the sundaes are too sweet. They need to clean their tables. The price is not cheap for a sundae. Our total bill was about $27 with SF health Tax 4%.", "author": "Mike L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-10", "description": "Like Chocolate, like ice-cream blend together and you get a happy place!\n\nThis Ghirardelli store not only sells it delicious famous chocolate but also ice-cream delights which you can sit in and enjoy.\n\nStaff friendly and you start to the 'happy place' is a member of staff offering you a piece of free chocolate.  How can that be a bad start to anything!\n\nIce cream delight served quickly and I have nothing bad to say about it!!  I will be back and back again!", "author": "Paula M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-28", "description": "I did not realize they had three locations around this area and all 3 of them have a line out the door.  The only problem is one of the stores does have the homeless smell to it so it might ruin your appetite when eating it. The line moves very fast and quick. We ordered the sundaes, the Gold Strike which is butterscotch and a lot of ice cream and the cherry vanilla sundae, I forgot what is the name of it. Do not look at the calories as it might well not convince you to go as most of them are over 1000 calories. But since we played Pokemon all day, it is all good.", "author": "Keven W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-07-27", "description": "Got 2 sundaes and they were just subpar. The fudge was Cold, whipped cream tastes like whipped oil. Ice cream had frozen chunks in it. Like it had been in the freezer way too long", "author": "Chad E."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-09-08", "description": "IF YOU HAVE A NUT ALLERGY THEY WILL STILL PUT NUTS IN YOUR SUNDAE. Went here today around 3-4ish with a couple friends visiting from out of town. One was severely allergic to different types of nuts so we double precaution and asked for no nuts(almonds from the twin peak sunday). \n\nWhen we got our sundae we didn't taste the almonds until we were halfway through eating it. Honestly I didn't want almonds anyway. I quickly went to the people making it and asked if they could remake it because there was nuts in and my friend was ALLERGIC to nuts. \n\nFor some reason, one of the workers came back to us and asked if we had chocolate in our sundae(yes?!) and  even though I kept saying yes and that I got the twin peaks one, she sounded hella confused acting like she didn't know what was on the menu when the menu specifically said there was chocolate in the twin peaks sundae... AND THEN SHE SAID \"there's almonds, not nuts in this\" and in my head I'm like ??? Isn't almonds a specific nut? And even if I was wrong I still meant that I didn't want almonds in my damn sundae anyways. Idk why she even telling us this.. cus obviously someone can be allergic to multiple nuts...\n\nThe order comes back and the top icecream is fine but the middle part HAD ALMONDS AGAIN. I'm assuming they didn't even remake it but added new icecream to the top without almonds. We didn't even finish it once I ate it again and found almonds STILL IN IT. Next time inform your staff that if someone says they're allergic, don't freaking question it and make a freaking NEW one because you're gambling with people's LIVES. He might of not been severely allergic to almonds specifically, but someone else could of been and because of your careless, lazy employees(there was like 5 behind that counter) they could of died or had to go to the hospital.", "author": "Jennifer C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-27", "description": "Typical Ghirardelli store right outside of Montgomery BART station. This store has a multitude of chocolate and a sit down section for those oh so sugary desserts. Typically, you are given a sample of chocolate when you enter the store or when you are processing your purchase with a cashier. You have everything from full chocolate bars, Ghirardelli minis, SF themed packaging, and combo packs in this store. The dessert menu has a good variety as well and includes sundaes, splits, brownies, milkshakes, and more. Prices are, as expected, a bit high, but you do get a good taste and overall experience at this store.", "author": "Lakshmi M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-18", "description": "After meeting a dear friend for dinner, he wanted something sweet like ice cream so I checked Yelp and whaddaya know, there was an ice cream shop a couple blocks away. Eating ice cream when it's a wee bit cold outside can seem counterintuitive but it's ice cream so this detail can be overlooked. \n\nWhen you go into the shop it can be overwhelming with walls and stations of chocolate, chocolate and more chocolate. They had tons of gift baskets and bars that you can stock up to bring home and enjoy.\n\nWe ordered Cookies 'n Cream and Chocolate Chip Cookie dough in a cup. In normal ice cream places you get a small paper cup with one scoop of ice cream. Ghiradelli made it classy with a generous scoop, an ice cream glass and a long spoon. \n\nIt was super decadent and a perfect way to end a lovely evening,", "author": "Nette T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-18", "description": "We have been to many Ghirardelli Ice Cream parlors over the years, but this one was the biggest. It had many different stores around the square, including four Ghirardelli Stores. A must do for chocolate lovers!", "author": "Mark H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-15", "description": "This is probably my favourite Ghirardelli shop out of the three Ghirardelli's I have been to in San Francisco.\n\nEntering, we were given a complimentary chocolate - I think they're promoting the minis lately. DE-LI-CIOUS. What a smart way to get people to purchase them. They are currently selling 80 minis or 80 of their regular chocolates (which are heavier) for about $27.95 which is really worth it for so much chocolates!\n\nThis environment is very open and has plenty of seats for those who would like to sit down for a sundae or a drink. We got the brownie sundae (treasure island) in a waffle bowl for about $13.50. The brownie was delicious, it was chewy, with a lot of fudge beneath it. The ice cream was alright, well of course, Ghirardelli specializes in chocolate, so I wouldn't expect their ice cream to be amazing. Their waffle bowl was dipped in chocolate, usually in other places, you would need to pay extra, but I suppose for a chocolate shop, chocolate dipped waffle bowl is the only option. It had a little TOO much chocolate in my opinion, I would like it if it had less chocolate, so I can have a taste to the waffle bowl, or I would hope that they can give an option of a waffle bowl without chocolate.\n\nThe staff are really friendly as one of them kindly let me know that she will be right with me to open the washroom door (code) for me as she was finishing up checkout for another customer.", "author": "Kristy N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-27", "description": "Tip: my favorite is the hot fudge sundae. But it's too much. I just discovered that I can order one scoop and add the topping. Perfect!", "author": "Lori W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-01", "description": "I mean come on if you love chocolate, ice cream, and lots of calories then you have arrived at your destination! Very touristy to say the least but I think that is expected duh...........you are in SF right near the water. Ok it is always packed, parking is a mess on a busy day also expected. But the menu is off the charts.................I thought I was going to have a heart attack if we stayed there longer! Chocolate so rich, Ice cream so \"creamy\" sorry that is the only adjective that comes to mind, you had to be there with me, to know what I mean! Overall you just cant come to this city and not visit them period!", "author": "Ray K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-01", "description": "Best ice cream in the city and a significant radius beyond.  You will not find a creamier ice cream that packs so much deep flavor in each bite.  Everything else will seem icy and generic after you've tried it here. You will love their flavor.", "author": "Michelle D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-19", "description": "Okay so here's the scenario. It's late night and freezing. We were out looking at Christmas lights on the house is. Then the Sweet Tooth overtook us and all we could think about was hot chocolate. But who wants to just have a regular old hot chocolate. No we want to go to Ghirardelli in San Francisco on Market Street and go in and have one of their sea salt and caramel hot chocolate with a wafer of chocolate goodness floating on top and whipped cream. Oh yeah they did it all. Well so I had the chocolate brownies topped with ice cream. Yes it was cold. But we didn't care. We just ate chocolate. And we were all good. Great place to go in the evening great place for kids and you love everybody will find something that they like.", "author": "Thomas B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-14", "description": "I don't understand what all the hype is about. This is an absurdly over priced ice cream place. The employees are incredibly rude. The hot chocolate tastes like room temperature water, no flavor at all.  They messed up our order and all they could do is roll their eyes and blame us. Don't waste your time or money. You can find better else where.", "author": "Alexandra M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-15", "description": "Went here for a quick sundae on sunday! I ordered just a Mint Chocolate Chip Ice Cream Cup with sprinkles, whip cream and a cherry! I was a bit sad to see they used chocolate chips instead of sprinkles, but felt bad having them remake it. Overall it was delicious, but became way to chocolately, if that is even possible.\nWhen I come back I'll probably order something else.\nThis location always has super nice lobby staff who offer you a free chocolate sample, and the store smells amazing!", "author": "Larissa S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-11", "description": "Excellent place. Nice service and really yummy dessert. It was really GOOD!!! Very large selection of different chocolates. I learned a new terminology too. \"Intense dark chocolate\". wow you have to try it!", "author": "Jimmy P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-01-21", "description": "IMPORTANT PUBLIC SERVICE - Ghirardelli is suppose to bring a smile to your face and joy to your heart  delicious ice cream in a magical environment served by happy happy employees - but (now here's the warning folks) step inside the location at New Montgomery and Market and you will find just the opposite experience - made the mistake on going in there Saturday night around 930 pm and it was gloomy - employees who looked and acted miserable - an environment that wasn't magical but pitiful - dirty looking and no sparkle to be found - ice cream served in plastic cups with plastic spoons as we sat down at a table - don't make the same mistake - either go to the original one or just go into a supermarket to the frozen food section and get a tub of any ice cream - you won't regret and you'd be thankful you followed this advice - I know ice cream and this isn't it -", "author": "Phillip S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-10", "description": "Worth the visit and stop! Still the same as when I first visited here. A San Francisco favorite", "author": "Mariana T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-07", "description": "Hands down the best sundaes. Super tasty chocolate fudge is to die for! So delicious that you won't want to share! Unfortunately, the prices are extremely high so be prepared to spend 10$", "author": "Crystal R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-29", "description": "This place is way too convenient! Catch the BART Montgomery station and you are right on the doorstep. The meet and greet is very sweet as you are offered a chocolate as well as assistance. Today, my 3yr old companion got two for being so good. She learnt last week here that good behaviour has its rewards so she doubled to an angelic level today.", "author": "Sue L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-03", "description": "Came here after the Giants game last week with my wife, son, mother in law, and lilttle bro in law.  The lines for Ghirardelli was a bit too long at the ballpark so I suggested afterwards stopping off at one of my favorite chocolate shops connected with the Palace Hotel. I had a sundae, while my wife ordered hot cocoa,  My brother in law is 3 and only had 5 blocks of sea salt carmel chocolate squares, and my mother in law succumbed to temptation and ordered and enjoyed here banana split.  This place will always make your tummy happy and wanting more. Truly hoping to keep Ghirardelli a special family tradition for years to come.", "author": "Ben D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-19", "description": "******************** 1572 ********************\n\nThis is my go-to to show my customers or business colleagues when they come here for a conference with me at the Moscone Center. It's just a few blocks walking distance to get the famous San Francisco chocolate to bring home for their loved ones. \n\nThey let you try a sample when you first walk in. The store is nice, clean, and in the historic building adjacent to the Palace Hotel.\n\nThey don't offer white chocolate, did you know that? But their cafe offers hot chocolate and it's pretty darn good. \n\nAlways smiley faces that work here.", "author": "Manda Bear B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-08-01", "description": "Very disappointed with this place! It is waaaaay over priced for what you get! Not worth it! Service was all over the place! Won't be back! This is just a huge tourist trap", "author": "Anne-Marie R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-01-03", "description": "Wonderful food, horrible service. It took them 20 minutes to give me an ice cream cone and it was 9:30pm at night. Not busy at all. Just 4 servers working very slowly.", "author": "Kathia S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-03", "description": "Great ice cream and free chocolate when you walk through the door!\nHad a chocolate chip cookie sundae and my girl had two scoops of chocolate chip and gharadelli chocolate ice cream.\nDecent price for around there too.\nFast friendly service.", "author": "J D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-05-02", "description": "We came in search of an ice cream sundae.  Very expensive for what appears at first to be very large, but in fact is about an average size.  If you check in with Yelp, you get 1.00 off.  The give you a free sample of chocolate when you walk in, and if you want, you can ask for a different flavor.   The ice cream was good, however the \"hot fudge\" solidified and it was really hard to eat.", "author": "Randi M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-06-29", "description": "Definitely great, quite on the pricey side. Took an order to go, pretty little compared to the amount you'd get while dining inside.", "author": "Disha B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-31", "description": "I was here twice a few years back and I was not too pleased about just on everything at the (at that time) new location. Therefore I was not daring enough to type a negative review on a sweet San Francisco institution and hopefully wait for improvements.\n\nOn the other hand, I do like this newer location much better than the touristy original location in Fishermen's Wharf/Ghirardelli Square. The new location is quieter and less crowded at night. As many of you know, Downtown Market Street/Union Square is also a busy corridor too.\n\nOn my return back, I have redeemed myself and ordered the Presidio Passion Sundae to end my weekend.  For $9.95 + tax, I get a scoop of vanilla and chocolate ice creams, chocolate fudge and chopped strawberries with a cloud of whipped cream and a large chocolate-covered strawberry topping in a tall glass cup. This treat is made to perfection by the workers and all the ingredients incorporated very well. I also liked the chocolate-covered strawberry topping as the \"cherry on top\". This sundae is best way to end my Sunday!\n\nAs many of you have read from my \"Quick Tip\", if you check in with your phone, you will get $1.00 off your sundae. And with the shop's various sundaes, the check in offer does help. \n\nWith all the changes including personnel, the new shop has finally got it all together did well to satisfy my return.", "author": "Matt G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-25", "description": "Came in like 11:00 pm at night with a few friends for some late night ice cream run. Nothing around here was open late aside from this place and it was delicious. There are two entrances for this location one through the inside of a hotel and one through the corner of the building to the main street. If you would like water it is self-serve. As you walk in one of the employees will greet you and give you a sample of chocolate. After you enter you can see the selections of chocolate for sale. Also, if you are in the mood for ice cream check out their menu! It's full of wonderful selections. Pay at the front and they'll give you a number to place on your table. You can pick wherever you want to sit. Ice cream can get messy so grab a ton of napkin! Also note the ice cream prices are a bit expensive, but the portions is huge! I had to share my treasure island dessert with a friend! Overall, will come back when I am in the area and craving ice cream! I highly recommend people to check this place out especially if you don't want to travel far for ice cream if you are in he area.", "author": "Danika P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-05", "description": "Ghirardelli is a very cute and convenient place. Our family enjoyed the complimentary chocolates which was received as soon as you walked in the shop.  The chocolate in which we received was the seasonal peppermint bark. The staff was kind but the actual service was a little slow. The portions of the ice cream was huge and very heavy. Although it was filling, the ice cream was truly delicious! The peppermint hot chocolate which we bought the next day was very yummy and had lovely flavours. All the prices are a little expensive but it's worth it. I definitely recommend visiting their whole your in San Francisco.", "author": "Maheen C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-05-12", "description": "2016 Yelp 100 Challenge Review #19\n\nI settled in on the Ocean Beach Sea Salt Caramel Sundae and it was indeed very good but I just felt the price point was too steep.  I was visiting San Fran and so I splurged and wanted to say I came here and tried it.  They give free chocolate samples when you come in which is nice.  Customer service was basic at best.", "author": "Steffanie B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-12-12", "description": "Walked 1.7 miles to get the hit chocolate i was craving. Reached 10:11PM, 19 minutes before closing, and was turned away, saying they have some meeting and can't make me a hot chocolate. Meanwhile a half dozen people sat inside enjoying their sundaes and shakes, while I looked on. Biggest disappointment so far this holiday season. Ghirardelli: it would help to post modified hours on your door.", "author": "Anoop G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-07-06", "description": "Very nice ice cream shop inside the Palace Hotel on Market Street.  We walked in on an early sunday afternoon, were greeted with a worker giving free samples of chocolate squares.  There were plenty of places to sit, we ordered and it came to our table in less than 5 min.  \nOnly 3 stars because the Sundaes are $9.95 ea - which I think is pricey - and the butterscotch topping was wayyyy too sugary sweet.  And they're not that big.  They look big in the photos but just remember it's thick glass.", "author": "David S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-28", "description": "If you want the biggest party in your mouth then this place is for you! (don't take this out of context lol)\n\nI honestly like Dove and Godiva better than Ghirardelli but this place is pretty darn good. I forgot what I had but that doesn't matter because it was sugar/fat/ junk heaven.\nThe minute you walk into this place it smells like you gained 5 pounds haha.\nIf you are on a diet it's still worth going to!\nThe only thing from 5 stars is that it's just a little bit pricey and tasted almost too rich for me. \n\nHope that helps.", "author": "Eugene P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-10", "description": "This is a classic go to spot in San Francisco and so many of my friends raved about it. My friend and I decided to go here for dessert after grabbing a quick bite to eat at the fisherman's wharf. It was amazing! The service was super quick and efficient, and they brought our sundae to our table. We decided to share the sea salt sundae and it tasted so amazing! Words cannot even describe. The sea salt caramel was the perfect balance of salty and sweet. I would definitely go back here!", "author": "Navya K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-03-31", "description": "It's iconic...you almost HAVE to come to Ghiradellis when you're in SF, right?\n\nYou will be greeted by someone offering a fee sample and that's pretty cool, but you better bring your wallet if you order anything.  \n\nA chocolate chip cookie and hot fudge sundae is gonna run you about 17 bucks, without tip.\n\nBoth are mediocre if you ask me, but they must be doing something right cuz they are hugely successful in spite of my opinion about their brand.", "author": "Lucky S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-05", "description": "I hide out here after the Golden Gate half for a short period to stay warm, sipping a matcha tea and eating a warm chocolate chip cookie. They gave me free samples of chocolate & were very accommodating with friendly customer service.", "author": "Kristen K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-12", "description": "Great freshly made waffle cones and chocolate lovers dessert paradise!  Was pretty crowded for after 900pm, but didnt have to wait more than 10 minutes from ordering, paying and receiving order.  I really enjoyed the Black Cherry Vanilla flavor in my waffle cone.", "author": "Chip H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-30", "description": "You can't go wrong with ghirardellis when in SF! Very clean with plenty of seating. We were greeted right away when we walked in and were given a sample of the dark blueberry chocolate. We settled on a salted caramel brownie sundae ($1 off with Yelp check in) which came out to be about $15. We were given a number and the sundae was brought out to us.\n\nThe sundae had two soft brownies, they were good but I'd say they were more cake like. Either way, we devoured them quickly. Usually brownies with ice cream tend to get rock hard but these didn't. The sundae had two scoops of ice cream, hot fudge, caramel, whip cream and sea salt. You can never go wrong with caramel and sea salt BUT I'd recommend getting sea salt on the side. It was unevenly distributed on the brownie so we got a mouthfuls of salt. We tried scraping some salt off but it didn't help much. One sundae was good for three of us to share.", "author": "Jennifer T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-02", "description": "I just love this place. My favorite Ghirardelli location. Great old-school service and not too touristy. I love to come here and order a custom sundae. This is a fantastic way to treat yourself after being good for a while. Probably my favorite restaurant in all of San Francisco. Try the \"Lands End\" sundae, if it is your first time to the shop.", "author": "Joseph B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-04-16", "description": "Just another over priced ice cream shop. $12 for a simple sundae seems par for the course in SF but the service lacked a bit. Somewhat dirty and the exterior is riddled with street peddlers.", "author": "Dr D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-15", "description": "Very tasty. This isn't the main touristy location, it is in the heart of the financial district and honestly - that was ok by me. We stayed a few blocks away and was thrilled to find this place. They offer you a full-size Ghirardelli square when you first walk in - which is a nice greeting. I had a fudge sundae in a waffle cone and my husband has a caramel milkshake. We were both pleased.", "author": "Jessie C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-22", "description": "Better than the actual Ghiradelli shop because it's not where all the tourists go. Lots of chocolately options and free samples when you walk in. It's in the Palace hotel which is always really pretty and well decorated.", "author": "Kelly G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-04-28", "description": "This place is absolutely awful! I got the \"famous\" sundae and the ice cream and chocolate fudge basically had no flavor. A sundae at McDonald's for $1.29 far surpasses the low quality, tasteless crap, they call \"ice cream.\"", "author": "Erika P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-16", "description": "So good- got the cookie dough sundae and shared it with my husband. It big enough for 2 to enjoy. The area has a lot of homeless so you have to get the code to use the bathroom- I guess that helps it stay pretty clean.", "author": "Linda E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-06", "description": "Not only is the chocolate delicious...but the staff member who stood in the doorway and greeted everyone was awesome! Great customer service, very courteous. You can have any type of delicious ice cream treat here and they have a menu of fabulous sundaes! It was very busy when we stopped off after a Giants game but it didn't take long to get our treats.", "author": "Sheila M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-30", "description": "Yummy ice cream.  A lot of seating indoor and outdoor.  Parking is a little rough but what isn't in San Francisco. A must stop with the family when visiting.", "author": "Mo R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-21", "description": "I was originally looking for the creme brûlée cart, and my navigation said it was right in front of me  oh well, needed to get this sweet tooth craving fixed so ended up at the Ghirardelli square. \n\nIt was my first time at this location and its smaller than the one near the pier. But it was definitely really cute. They were giving away blueberry dark chocolate, i'm not really a fan of dark chocolate so it was just okay for me. \n\nEnded up with the worlds most famous hot fudge sundae with chocolate and espresso with espresso chips, and that's definitely always a HIT! \n\nThe staff was super friendly and supervisor, I forgot her name gave me a free waffle cone. She's so sweet! \n\nOh and don't forget to check in so you can unlock your $1 off for a sundae!", "author": "Kathy B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-07-10", "description": "I went in here last night for a quick ice cream. 1 cashier, the line was to the door. 1 person making ice cream orders. Lots of people in Ghirardelli clothes walking around doing stuff but not really helping customers in this respect. I can't believe that it took 30 min from the time I walked in to get a small ice cream in a cup. I guess more, I can't believe I waited this long. Pretty poor customer service if you ask me.", "author": "Sean G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-31", "description": "When you're walking down Market and you can no longer feel your hands from the freezing cold, it's time for a hot cocoa (because sometimes gloves are just too practical). \n\nIt's easy to hop into this place since it's a pretty good size with minimal crowds. They rotate through different mini samples that they pass out at the door and lucky for me, they still had peppermint going for the holidays. \n\nMost of the merchandise is on the left side of the shop and the seating is on the right, all underneath a really incredible panorama of the city. Who doesn't like views with their dessert? As we stood in the very short line, we saw a whopping sundae being shared by a family of four - you definitely get what you pay for here. I stuck with a sea salt caramel hot chocolate with extra whipped cream, which was heaven. Maybe I'm not a local, but this place isn't just for tourists! I'd be replacing Starbucks with this stuff in an instant.", "author": "Kate K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-28", "description": "Holy cow!  I went in to give the maid some time to make my room up. This was in the hotel and I had a little bit of a sweet tooth. \n\nI ordered a small chocolate shake, based on a friend's recommendation. This was by far the richest shake I have ever had. Not as thick as I might like, but I was more than happy with it. Honestly I could not have finished a larger size. Goooooooood stuff!", "author": "Mike Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-22", "description": "This is the largest of the Ghirardelli stores/ice cream shops. Often when the Original Ghiradelli store has lines out the door you can walk right in an order at this shop. \n\nYou can watch chocolate in many different shapes being made right up front in the store. and there are quite a few more retail options in this store. \n\nThey have the same menu as the other locations, last visit I ordered the Lands End - Salted Caramel Brownie Sundae. So much better than the regular brownie sundae, seriously. \n\nI do wish they would get new dishes, they dont seem to contain the ice cream very well and since they are metal they slide around a ton on the stone table surface.", "author": "Javi Alexa A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-27", "description": "Great location! Busy as always but it's so good it's worth it! Had a vanilla shake with Chocolate chips after a busy day of shopping and walking.", "author": "Paulina C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-04-01", "description": "Honestly this place was pretty mediocre and I wasn't impressed. I got the sundae that had marshmallow and hot fudge on it. The hot fudge wasn't even melted or hot (it was as if it wasn't heated up at all and just a thick fudge) the ice cream itself wasn't special either, basically what you get at a grocery store and I couldn't find any marshmallow in my sundae. I think this place was really hyped up for me to be so unimpressed which sucked cuz I was looking forward to it", "author": "Lauren K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-08", "description": "Came here with a friend who was visiting from\nout of town, as a part of the whole tourist experience. We shared the world famous hot fudge sundae. I'm not usually a fan of hot fudge, but the sundae was delicious! All of the other sundaes looked great as well. A little on pricey side, but definitely worth the visit.", "author": "Gina P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-19", "description": "The Hot Chocolate is amazing!! Choosing a sundae was one of the most difficult options I had during my vacation. Overall the experience was great, the sundae and ice cream were delicious . the only reason why I am not giving 5 stars is because for what you get it is kind of expensive however it is San Francisco so it has to be expected", "author": "Taylor F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-03", "description": "I was strolling around for a store selling chocolate, ice cream, milkshake and other confectionary items. After a burrito bowl at Chipotle, I decided to come in for a sweet treat. Ghirardelli chocolates and desserts are the best way to satisfy that sweet tooth.\n\nI came in looked around and checked out the menu. Next moment, I ordered the Vanilla and Chocolate Flavored Ice Cream in a Sugar Cone. It is delicious and I absolutely enjoyed it.\n\nThis is one of the best chocolate shops I have been to. It wasn't too busy either which is a good thing. They are in the lobby level of The Palace Hotel making it a perfect confection spot for everyone.\n\nPositive first experience here so I'll definitely have to come back to try other items.\n\n- Friendly staff members (+1)\n- Good service (+2)\n- Clean facility (+2)", "author": "Bennett W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-12-29", "description": "not like omg nom nom must pay extra bucks for but a nice sweet dessert", "author": "Vicky T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-14", "description": "Great hot chocolate with my wife. We live stopping here whenever we are in San Francisco. Always clean and really cool to watch chocolate being made. A must see in the city, stop by and enjoy an amazing Sundae.", "author": "J T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-29", "description": "Same recipe as all of the others. Superb  ice cream sundaes as always. We have two minor complaints. One being the employee Tristan who had major attitude the entire time we ordered especially when we asked him if all of the locations had the same Christmas tree ornaments which was displayed on the counter. The other complaint is the cleanliness of the restroom. Gross!", "author": "Dennis D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-05-29", "description": "I'm surprised this place has as many stars as it does. Last night we had a horrible experience and it wasn't just us. The line to order was out the door and everyone was miserable waiting between 30minutes and ONE HOUR for their ICE CREAM. Orders were delivered wrong MULTIPLE TIMES. One guy had to tell the staff what was on one of their signature sundaes because when they gave it to him it was missing the right toppings. My sister and I ordered one scoop of ice cream and it took 45 minutes. They are clearly understaffed, disorganized and poorly managed. I felt bad for them because it did not seem like a fun work environment. It was awful.", "author": "Alexis A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-08-23", "description": "Pretty good ice cream but a bit overpriced. The chocolate fudge is really good. Look to spend over $10 for an ice cream sundae here. If you like chocolate this is a pretty good place. Otherwise it's pretty average for ice cream.", "author": "Jane W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-12-04", "description": "Chilly day in the city? No problem! Warm up to a cup of hot chocolate, served in-house or to-go! It's smooth, with just the right level of sweetness and a dollop of whip cream on top! Though tasty, was it the best cup of hot chocolate I ever had? It's certainly better than most, but nothing earth shattering (for that, you need to go to La Maison du Chocolat in NY). 3.5 stars and thanks for the sample mini chocolate when I walked in! Much appreciated.", "author": "Chase B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-10-14", "description": "So happy we went to this one instead of the one in Ghirardelli Square! Same menu, but about a million times faster cause there was barely any line.\n\nService was very nice and friendly. It was nice sitting by the window and people watching.\n\nGot the Crissy Fields (cookie bits sundae), which was okay. I shared with a friend and we couldn't finish it, even though it doesn't look very big! The dark chocolate they put in the ice cream did not taste very good/didn't go well with the cookies 'n cream/vanilla ice cream, which was weird. I liked the cookie bits, they were quite crunchy!", "author": "Connie F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-02", "description": "CHOCOLATE HEAVEN!!!\n\nThis location is at the busy Financial District on Market Street. Not only the retail portion but also the restaurant. That is right~ It is ice-cream time!!!\n\nThe moment we walked in.... FREE SAMPLE!! Friendly staff standing at the door giving out free sample, what a great way to greet the customers~\n\nLove it when we could get assorted flavor of chocolate (our choice) in a bag. They have great sales promotion and that definitely motivate customers (ME) to buy more chocolate!!", "author": "Cassandra Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-02-22", "description": "I came here and ordered a Brownie Sundae. It was pretty expensive at around $15 after tax, but it was a lot - too much for 2 people to finish. \n\nAlso, the spoons we got were sticky.\n\nIf I were to come back again, I'd order something smaller.", "author": "Guorui W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-10", "description": "Tried some nob hill chill.Loved it.The caramel at the bottom is the cherry on the cake.Lip smacking!\n\nAlso tried some caramel flavored quake drink and loved it.", "author": "Priyanka L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-14", "description": "Such a cool place to hang out! The store is fairly big in size thanks to their eating area. \n\nAll of the workers were very friendly and helpful throughout our chocolate buying experience. Once we walked through the front door we were welcomed by a greeter who gave us free chocolate! FREE CHOCOLATE! Who doesn't love that! \n\nWalking around the area you can see a couple of chocolate makers do their magic and provide you with samples of what they just mad. The endless options of chocolate gift bags, tins, and create your own was overwhelmingly welcomed! \n\nThe reason for the four stars is simple, at the \"sundae bar\" you can't see a thing! If you go to the bar to watch the people make ice cream and shakes you can't see anything because your seats are low and there is just tons of equipment blocking the magic. When I hear bar, I think \"open\" not a leg with a couple chairs.....\n\n\n\nP.s left with $50 in chocolate and had a sundae UFFFFFFF love!", "author": "Marc P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-17", "description": "Came in and instantly got a mini chocolate sample from a greeter at the door. Menus were stacked on a stand right in front and thankfully, lines were short (I came around 6pm) so I was able to step right up. \n\nI'm a huge sucker for brownie sundaes so seeing it on the menu was a dream come true! It helped that the picture for the sundae looked impossibly delicious. Even better? The sundae actually came out looking like its picture! The brownie wasn't as warm as I had hoped but ice cream was delicious and everything worked together perfectly without being insanely sweet. \n\nThis was an amazing treat after a long day of facing adult responsibilities, even for a girl that doesn't have much of a sweet tooth!", "author": "Lani C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-19", "description": "In the mood for a sundae? Look no further! Yes, it's a total tourist trap, but it's a dang tasty one. Sometimes, nothing but Ghirardelli hot fudge will do. \n\nThat being said, be warned that the specials (the entire front of the menu) are HUGE. I shared two of them with two hungry guys, and we still didn't manage to finish them. One would have been enough for the three of us (and we all love desserts). But dang, they were good. We got:\n\n1) The Lands End Salted Caramel Brownie Sundae. This was awesome; it has everything I look for in a sundae, PLUS Ghirardelli brownies, which are the best. Win.\n\n2) The Chrissy Field Cookie Bits Sundae. Not as good as the Lands End. The cookie dough ice cream was great, but the crumbled cookies on top made the texture of the fudge really weird, and the dark chocolate squares were totally overwhelmed by the rest of the sundae. \n\n(Honestly, what we should have done was gotten the Lands End, but with cookie dough ice cream instead of vanilla.)\n\nI also had a salted caramel hot chocolate, which was delicious at first (loved the caramel sugar on the whipped cream), but I think a lot of the salt sank to the bottom, so when I had finished about half of it, it just became super salty and undrinkable. Or maybe I was just ridiculously full from the sundaes. \n\nThis place is the definition of indulgence, but sometimes that's just what you're looking for.", "author": "Liz F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-29", "description": "\"A taste of Ghiradelli in the Financial District\". The sweet shop that hits the spot. Whenever I am in the Financial District of San Francisco, I visit this place. If you can't get to Ghiradelli Square, this will suffice. They have ice cream, they have candy and the servers are just adorable! Are you craving a hot fudge sundae? No more worries because this is your place! It's right on the corner of Market & New Montgomery. You can build your own sundae or you can order one of their specialized menu items. If you are looking for candy to bring home to friends from your trip, you are in luck! Yummy Ghiradelli specialty chocolates can be purchased here as well!", "author": "Rebecca W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-07", "description": "Delicious ice cream for a classic confection company. It was a great way to start off our trip to San Francisco on the first day. The place is chock-full of chocolates and ice cream. Just beware of the gigantic ice cream scoops they give you. And you can always grab some chocolate if you feel like it.", "author": "Elliot F."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-08-01", "description": "This restaurant has hired some staff that does not seem to behave well with its international  customers, especially asians\n..a sampler guy named Frederick initially refused to give a sample...later he dropped a chocolate bar on the floor near his feet and told my father in law that it was his sample! My father in law is a highly respected individual and doesnt deserve this. ...this is outrageous  racism.. .however the area manager Mr. Kroma remedied the situation by offering a complementary gift and made the employee Apologize ...highly unhappy with the situation but happy with the manager for his action..", "author": "Vivek R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-06", "description": "It is not quite the same as going to the original location but it will do in a pinch.  The Land's End sundae was delicious.  The brownies are amazing.  It is pretty much the quintessential sundae.  It's not cheap but it is one of the best ones I have had in a while.  \n\nThey sell the small pieces of chocolate by the pound but it's not really by the pound because the minimum you can purchase is half a pound.  This was a strange interaction with the cashier and what seems like a pretty silly rule.", "author": "Sheryl C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-08", "description": "Nice shop but don't go there too late at night, homeless wandering around", "author": "Wangshu S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-05", "description": "Well-located branch version of the original Ghirardelli has substantially less seating, but all of the products. We were there about 8 p.m. tonight. The unisex restroom was a biohazard; the floor and toilet were a mess. The staff should have been much more attentive to this.", "author": "Scott N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-09", "description": "Okay, so I've come to this place twice the first time was in March and the second time was this morning. \n\nREASON FOR ICE CREAM BREAKFAST:\nThis morning.. was a complete accident. My friend and I had to catch a noon flight going back to LA and we didn't realize most of the dim sum places were closed.. Me, being Chinese knows that traditionally Dim Sum places are supposed to be open earlier in the morning for a breakfast/brunch meal! So I am very disappointed in you SF Chinatown! You shame the dynasty! :P \n\nTHE CRISSY FIELD: \nAnyways, interestingly enough the store that was open was this sweets shop and out of my friends brilliant idea was to eat ice cream first thing in the morning, like a five year olds dream and a 90 year old diabetic's nightmare. We ate the crissy field three scoops of cookies and cream ice cream with a soft baked cookie throughout the ice cream. With a ton of whipped cream all over, with cookie crumbles all on top and two dark chocolate Ghirradeli's to top it allll off. \n\nIt is very RICH and CREAMY. Very heavy, I deifnitely could never finish this on my own. The first time I had the Brownie Sundae with a friend and we couldn't finish it. \n\nLOCATION: \nIn the heart of DTSF, on the corner just off of the Montgomery Bart station :)", "author": "Tiffany J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-10", "description": "This Ghirardelli shop is a super cute place for an after dinner treat, date night, or just because you want something sweet.\n\nWe were greeted immediately upon walking in and offered samples of their sea salt caramel chocolate (which was delicious... but then again, sea salt caramel is one of my favorite flavors).  You order in the front and your items are delivered to you.  All of the desserts are reasonably priced from around $8-12.\n\nIn addition to desserts, they also sell shakes, coffee, tea, chocolates, and baking products.  We ordered the banana split and both devoured it!", "author": "Annie P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-24", "description": "I love this place! Customer service is great and I just can't stay away from the chocolate cookie!", "author": "Dee J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-27", "description": "Good ice cream, we ordered the raspberry sherbet and banana split, both are good. The only complaint that I have is there's only 1 bathroom and we had to wait a long time to use it and smells really bad. Come on Ghirardelli, for the price of your ice cream, at least clean up your bathroom and add more bathrooms please. Ice cream came really fast and the server was nice. Kudos for that", "author": "Royeni T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-24", "description": "There are so few touristic things in SF that locals will do unless dragged there by visiting friends and family: Pier 39, walking across the GG Bridge in the wind-whipped summertime and sundaes at the original Ghirardelli Square (preferring the lines at Mitchells or Bi-rite.)\n\nBut this corner oasis at the Sheraton Palace makes Ghirardelli sundaes so civilized and worth it, even for a local (or in my case, a returning local.)\n\nI'm surprised how good these gigantic sundaes are  --old school good, from the intense chocolate fudge to the fresh whipped creme with a cherry on top.  I recommend the Brownie Sundae or the Butterscotch (thank goodness they are bringing back Butterscotch, which has bled fans for years thanks to the hugely popular salted carmel.) Hey even salted carmel fans have a sundae here too, so no hard feelings, although there is something fairly disappointing and disarming about salt on my whipped cream that makes me sure this is one I will not order twice.\n\nThis newer location at Market and New Montgomery has that classic soda shop feel, along with colorful, hyped up modern marketing. Importantly, its got a low key feel and no pushing crowds.  There is the steep cost of $9 per sundae, so there's that, but these are some very large, decadent old school sundaes.\n\nI'm going to say it: this tourist spot has many delicious and redeeming qualities.  Self respecting San Franciscans can enter with their held high.", "author": "Rachel H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-08", "description": "Awesome! Kids love the shakes chocolates , late nights with friendz or just a stop over with family . Wonderful place", "author": "Sonia J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-12-31", "description": "What is lacking in this place is the \"specialness\" of going out for a chocolate and ice-cream treat.  There is no separation from the throng coming in-and-out, the oh-so-long line, the barking of names when orders are ready, and the signs that the place is well-used - dirty surfaces and all.  There is such a thing as being too popular, so the impact of the fans swarming to this place overwhelms the chocolate and ice cream.  It comes down to the reason for coming to this place.  If one looks to satisfy a craving, then this place does the job well.  If wanting to share a blissful moment with someone over a sweet treat, then this place is deflating.", "author": "Jay C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-01-15", "description": "We went to the Sundae Bar on Ghirardelli Square.  I ordered the \"World Famous Hot Fudge Sundae.\"  The ice cream tasted terrible.  It tasted more like ice milk than ice cream.   There was so little chocolate fudge I could hardly taste it and it was cold not hot.   It cost $11.95.  I was terribly disappointed.", "author": "Michael P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-15", "description": "The atmosphere was great when you walked in and we were greeted with a chocolate sample.  It was busy and we had to wait for 30 minutes to get our ice creams.  The ice cream was delicious, but it was served in a tiny plastic cup and cost $12. I could have bought better ice cream in a grocery store.", "author": "John B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-12", "description": "I have visited the store on numerous occasions to purchase treats for others and myself.  The fare is of course good Ghirardelli chocolates.  They are always fresh and of course delicious.  The also usually have sales where you can get reasonable deals,", "author": "George W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-06-26", "description": "Ice cream is actually Dreyers, but the chocolate is good. Pretty much a normal sundae, good food though.", "author": "Ryan B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-11", "description": "This is the best chocolate store that sells the best chocolates in the world. Best chocolate shop you will ever encounter... without a doubt.  I recommend drinking a hot chocolate, since it is made there instead of heating up water and mixing it with cocoa", "author": "Adrián B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-30", "description": "Expensive but quite an experience!! We were there on Black Friday and it was packed! They were handing out free samples which we really enjoyed.", "author": "Brandi K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-18", "description": "Busy Saturday night but service was on point. Great ice cream and fantastic chocolate are second to none.", "author": "Remo T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-31", "description": "The Golden Gate banana split wasn't anything special but the Treasure Island warm brownie sundae is a must. The brownie is warm so it ends up melting the ice cream faster than I can eat it so me and my bf just share one, that's if he's willing to share that day lol", "author": "Wendy N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-30", "description": "Alright so the brodie and i had left the carnaval fest and needed some drinks. Every drink shop that we stopped by was closed until there was a ghirardelli in sight. Decided to get two drinks which ended up to be close to $20. Deeeyyum but it was totally worth the wait! The drinks bomb af and will definitely be coming back here on another occasion. Just what we needed after a long day.", "author": "Luis M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-26", "description": "Mother and I went in on a Friday night and though it was quite busy, there was a person who greeted us right as we stepped in and handed us each a sample of their chocolate minis. We decided to order a scoop of their ghirardelli chocolate ice cream in a waffle bowl to share. Though the total came out to around $7 (quite expensive for ice cream) it was absolutely delicious! The chocolate ice cream was rich, but wasn't too sweet so we were able to finish it without water. Wish they had a plain waffle bowl as their chocolate dipped waffle bowl is way too sweet! \n\nRemember to check-in on yelp for $1 off an ice cream sundae. Keep your receipt for 10% off your entire purchase the next time you come in, though the 10% discount may not be used together with the yelp check-in offer.", "author": "Kristi T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-01", "description": "We ordered Haight Ashberry Sundae because it had free sunglasses and flower crown. It tasted ordinary. Nothing special about it. But hey, they gave away free sunglasses and flower crown.", "author": "Leanna C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-28", "description": "- overpriced\n- overcrowding tables \n- dirty tables \n- price \n\n+ service \n+ restroom was clean \n+ rich and decadent Salted Caramel Sundae\n+ portion size \n+ speed \n+ local business (founded in 1852)\n+ they control every aspect of its production \n+ they reject almost half of cocoa seeds, only wanting the highest quality ones\n\nMy daughter is big on caramel, not me but I wasn't going to spend $30 on ice cream so I can order my own. We shared a salted caramel sundae and I got Gavin a scoop of chocolate. \n\nI don't need to write anymore. Simply look at my picture of the sundae. It was so creamy and rich. I loved it. My son finished his scoop and asked for more.", "author": "Tram N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-23", "description": "Very clean, tourist friendly. Pricey, though I knew it wasn't going to be cheap. The line was out the door. \nThe sundae was sooo good. So creamy and rich in flavor. The hot cocoa was a bit too sweet for me. I couldn't finish it. \n\nWe did get a free sundae though because they made one too many. Yaay\n\nThere wasn't much seats. We had to wait about 10 min to get a table.", "author": "Aubrey H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-21", "description": "I know that this place is going through renovations...the line is insane!!  Once you order, explore the place.  Great place to take kids. \n\nLove their deserts.  Highly recommend going to the Palace Hotel location if you don't want to wait.   The staff there offers you a chocolate treat as you walk in.", "author": "S. C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-14", "description": "After giving a talk at a conference nearby, it was recommended that I treat myself at this ice cream shop. I came around 4:30pm on a Thursday, and while relatively busy, there were plenty of seats/tables open. I ordered the salted caramel brownie sundae ($14.50) and a vanilla latte ($5.95). The sundae was absolutely gorgeous and delicious, but I was defeated about 1/4-1/3 in, so bring a few friends with you! The latte was also made well, and I was a fan. In addition to brownie sundaes, they also serve regular sundaes, sorbet, ice cream scoops and cones, shakes and floats, hot chocolate, and other types of tea/coffee. The price of their sundaes is definitely a bit higher than I expected, but it would be very difficult for one person to finish it, and worth it as a \"treat yoself\" moment. There is also plenty of chocolate in their gift shop- I bought a few gifts (including a SanFran-themed chocolate box) for friends, but they also had their square chocolate in every flavor. While waiting in line to order, I was also given a free square of chocolate, which made me happy. Overall, I'm really glad I tried this place- it was fun!", "author": "Lisa S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-08", "description": "Really friendly service. The ice cream is so good.  Free samples help take the bite out of the expensive prices.  But it's SF - everything is expensive.  It is super delicious too.", "author": "B Dale D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-18", "description": "Old fashioned ice cream sundae done right.  Yes, I'm a fan! Great ice cream, fresh ingredients, clean store, and friendly staff - what's not to like.  Even with all the people (i.e., tourists) coming here, you're still able to get your order without too long of a wait.  I definitely recommend Ghirardelli for a good treat.", "author": "Ken S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-05-06", "description": "I've definitely had better ice cream at other places. It is a cute little shop though, and a nice place for tourists to rest and buy some chocolate. But I honestly wouldn't come here if I was craving ice cream--there are just so many better options.", "author": "Stephanie L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-26", "description": "Easily the best Banana Split I've ever had. Great atmosphere, friendly staff, and big portions. One Banana Split is easily enough for two people. Can't wait to come again and try the World Famous Chocolate Sundae.", "author": "Damian M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-05-10", "description": "Came here on my way to the Giants game. It was right at the top of the BART entrance on Montgomery. My wife and I got milk shakes and people watched as we indulged. The shakes were delicious. The price was high!\nThe overall atmosphere of the place was pleasant with normal noise.", "author": "Patrick Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-20", "description": "It was just okay and not as well as I thought. That will be great If they could make sundaes looks better. Anyway, I like the chocolate.", "author": "Nina N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-06", "description": "A must have if your in the area. Prices are decent considering it is SF and the service was quick. Will definitely return if I'm in the area again!!!!", "author": "Wesley S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-20", "description": "This place just never disappoints. Everyone has always been super friendly every time I've gone. And it's always delicious and a fun treat. Yummy", "author": "Christopher J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-16", "description": "Great chocolate is an understatement. We had a hot chocolate and an ice cream Sunday!!\nGreat service as well.", "author": "Kethnie M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-25", "description": "I do love the fact that they're open until 10:30 on the weekdays and 11:30 on the weekends.\nThis place is definately a tourist trap. Unfortunately they do make the best hot chocolate.\nIt's a perfect treat for yourself at the end of the night.\n\nThis spot is packed with tourists during the day time, so I'd suggest anyone who wants to order something without a massive line to go during the evening.\n\nDesserts are always better at night right?", "author": "Alui L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-08", "description": "got some delicious mlikshakes from here our last night in San fran and what deliciousness they were! also picked up some chocolates to bring home and hot chocolate mix for me :) expensive but worth it.", "author": "Crystal P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-04", "description": "Warm greeter at the door who handed out samples of their signature chocolate squares and asked if we wanted to take a look at the menu!\n\nI came with my working girls right after a long, middle of the week, Wednesday and 8 hour plus shift so we treated ourselves to some sweets!\n\nIce cream, sundaes, warm fudge and any types of chocolate filled goodness on the menu, Ghirardelli offers richness to any of their chocolate delights!\n\nI do recommend their Salted Caramel Hot Chocolate Cocoa - http://www.yelp.com/user_local_photos?select=drb7f1iv9Rthn0aHg8WdcQ&userid=I-FmdvI28N7OIIt4JZOgIg\n\nA bit of that sea salt balances out with that drizzled caramel decorated on top and that piping hot cocoa is great on a cold, foggy day in SF!  It surely warmed my body up and kept me quite content with the cold weather when we left and started to stroll down the streets!\n\nGood dining area, great customer service and superb chocolate selections!  \n\nGhirardelli makes me feel like I'm welcomed, a great caffe shoppe where I can relax and splurge on chocolate fine dining!", "author": "Tiffany D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-24", "description": "When you're craving dessert, Ghirardelli is the place to go. Everything on their menu will satisfy your craving & make you so happy afterwards!!! The only thing is that it's a bit overpriced. But once in a while, you deserve to get yourself a little something extra!\n\nBy the way, their cones are huge! Be sure to mentally prepare for a lot of happiness.", "author": "Alice H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-29", "description": "Come-on now, let's be honest this is the best ice cream place in the city.  You have a great view and you have the best chocolate ice cream in town. If you go to San Fran you have to stop by this landmark.", "author": "Joe T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-11", "description": "It's Ghirardelli! If you like chocolate then come here. If you like THEIR chocolate then really come here! Besides selling the normal chocolate bars they have in stores, they use them in their ice cream, shakes, and sundaes here. It's a chocolate lovers paradise. If you're in the area, it is worth a visit. I had to bring my wife here twice. Customer service was great and the establishment is clean!", "author": "Robb F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-24", "description": "Awesome. Cannot come to San Francisco and not get a hot fudge sundae at Ghiradelli's!\nThis location serves ice cream and coffee and has a candy section.\nCashier was super friendly and pleasant. Double confirmed our order which was served up in minutes.\nHighly recommend if you are nearby and need a bit of sweetness.", "author": "David S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-03-24", "description": "Wanted a mint shake, got a brown liquidy shake with the chips blended to a powder... I saw the guy really struggling making the shake. I have worked in an ice cream store before, made plenty of shakes and it's all about knowing the right proportions. This guy had no idea. Put in like 5 huge scoops for a small, and a little milk, so then he had to keep putting in milk and extra ice cream about 3+ times. Sadness for $7+ :(", "author": "Celine S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-02-13", "description": "Oh golly, I feel like I should call Eddie Haskell and Lumpy Rutherford and cruise chicks like Mary Ellen Rogers before the Beaver ruins everything with his shenanigans. Then I see it costs $6.95 for a Hot Fudge Sundae and think maybe I'm not really in the Eisenhower era after all. This new, fully loaded Ghirardelli location would seem to be in an ideal spot as it has the prime corner location in the Palace Hotel facing both Market and New Montgomery Streets. Jamie W. and I ventured in here after dinner since we wanted to see if it was a place we could hang out and tap on our iPads.\n\nWell, there's no free WiFi, so what else could we do here? (tapping fingers)... Hmmm, I guess we could order a Hot Fudge Sundae with extra whipped cream and nuts (see photo). Well, we did and felt like we were going steady for the first time. OK, not really. We're just all-weather ice cream eaters if given our druthers about our dairy intake. Brain freeze... I'm better now. Looking around, it certainly offers a lot of space for like-minded dairy enthusiasts of which there were only two that night, lonely-looking people devouring their own sundaes with sad-eyed abandon.\n\nI think you can find most of the sundaes available at the flagship operation in Ghirardelli Square, including that horrendous-sounding Earthquake, eight scoops of creamy decadence covered with eight equally decadent sauces. And there are enough bags of chocolate squares in there to feed a country the size of Montenegro. However, I'm not feeling that much electricity about the place, especially on a quiet, wintry weeknight when barely a soul could be found in search of a chocolate fix. Hate to say it, but I think Ghirardelli may have reached a saturation point with its burgeoning chain despite the lure of free samples.\n\nICE CREAM - 3 stars...hits the spot but there are calorific consequences to consider\nAMBIANCE - 2.5 stars...expansive but unenergetic\nSERVICE - 2.5 stars...borders on the unctuous\nTOTAL - 3 stars...just one too many Ghirardelli shops if you ask me", "author": "Ed U."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-02", "description": "Ummmm so this place was one of the only places actually open at 8 PM on a Saturday night. Thank God! My husband and I were craving something sweet after dinner and we found it at this magically delicious spot! We ordered he fudge ice cream sundae, hot chocolate and mint tea. Fabulous sundae...one of the best I've ever had and the hot chocolate was superb! Goodness, I would come here everyday but I would probably turn diabetic. Thank you so much for an amazing experience!", "author": "Darina H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-01-10", "description": "What Happened?\n\nI literally take my staff (10 +) from work here once a week for a TREAT \n\nJust this past Saturday (1/9) I did not know they made a shake called the Tenderloin \nThis establishment had a pungent odor in the air (dry pee like smell) from the wet rag they were using to wipe the table. Literally the urine like smell added a sour flavor to my shake\nLet me add the shortage in staff who made my shakes had sweat running down there face (oh my, extra salt to my sweet drink)\n\nI would include some photos but I did not want to offend my viewers", "author": "Ryan R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-24", "description": "Sipping chocolate on my way home!\n\nI love having this place here. I don't know why its only filled with tourist though. I guess when you live in a Disneyland like city you over look the gems and this is one of them.\n\nThis is the best Salted Caramel Sundae on Earth.", "author": "Justin S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-04-29", "description": "It's really gone downhill. The glasses are dirty and sticky. The portion I got with my BROWNIE SUNDAE was like finger sized. When I complained to the server, he rolled his eyes and said it was a half brownie portion.  I think a half browie should be at least 2 inches this was one max. Plus, I think he rolled his eyes because he's gotten this complaint often enough. They didn't even offer a plate under everyone knows there will be spillage. Every empty table was not cleaned yet and it took a while for us to get our sundaes, the couple ahead of us were served and finished by the time we got ours. Not a good experience", "author": "Taurean F."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-01-02", "description": "Perhaps as a 40 year San Franciscan I'm jaded but increasingly I see a lot of moderate priced places with lesser quality and service than low priced places...\n\nToday I met a new gal who came to the city to meet me.  With the holiday we had fewer choices than normal.  We were both late meeting for various reasons and she wanted to warm up so I simply headed to Ghiridelli's at 2 Montgomery street.\n\nI consider the price high more like at the Wharf than for downtown... I wound up spending almost $30 for basically 2 brownies with ice cream and coffee for the gal and a medium shake for myself.\n\nThe service was exceptionally poor in my opinion - greeted at the door then left hanging.  It would appear you order at the counter near the door but don't -- you have to go to the back register. \n\nMy medium shake was too dark and bitter for my taste.  I would have preferred the McDonald's $4 shake which tastes better and is not so dark.  For the price and quality I think it was too little and too tasteless.  I also resent them charging 10% sales tax including the 4% for healthcare.  If they take an order at the table and bring it to the table OK, but when you have to stand in line to order and only have a person slowly bring it to the table and set it down this does not merit in my opinion and additional 4% on the tab for people just doing their jobs.  Tell the cheapies at Ghiridelli to pay up for their employees health care your prices are high enough to cover it already.\n\nIf some dumbo just off the boat or just in from SFO thinks this is great welcome to suckerville San Francisco wants to fleece you.  I guess this works at the wharf but the real joke is on the tourists because real San Franciscans never go to the wharf.  My date is a native born San Franciscan and fairly pleased with her pile of chocolate but next time I'm taking her to Rainbow Grocery and getting her ten pounds of the stuff for the cost of the two brownies.\n\nI rate our experience moderate at best to poor - one other point we were trying to talk to each other but it is too noisy to hear each other like so many places with hipsters and tourists invading them.\n\nYou can con the tourists but not the long time locals or natives...", "author": "Dalt W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-04", "description": "Hands down this best tasting chocolate and butterscotch out there!! It's a great way to end the trip to San Francisco after a Giants game before getting on the bart! Can't wait to stop there again! Staff is amazing no matter how busy they are you won't be waiting long!", "author": "Frank M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-15", "description": "Some people have said I'm an \"ice creamaholic\" and I tend to agree with them.  That and my love for all things chocolate.  I've been enjoying the Original Ghirardelli Ice Cream Parlor at Ghirardelli Square for many years and always leave very content.  Noticed Ghirardelli opened an Ice Cream and Chocolate Shop near work and just had to go check it out.  Albeit it took me awhile, but been working some crazy hours, so decided to treat myself the best way I know how..................with ice cream.\n\nHad to stick with my absolute favorite Hot Fudge Sundae and it brought back fond memories of going to Ghirardelli Square.  I received a $1 off discount when I checked into Yelp, so that was a bonus.  What a great way to end my day.", "author": "Lon H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-27", "description": "Absolutely delicious. Came by here on break to relieve some stress aka destroy an ice cream cone. The place has some construction going on around it, but it still is pretty clean inside. The girl behind the counter was nice and I ordered a vanilla ice cream in a waffle cone. I decided to sit down and eat it and just kinda take it all in. The place is kinda pricey ($6 for the ice cream), but the quality of the place makes up for it because the ice cream was absolutely perfect. I'll definitely come by here when I have a sweet tooth.", "author": "James R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-13", "description": "Attention chocolate lovers, welcome to paradise.\n\nSeriously, if you love chocolate you have to come to Ghirardelli's. The Ghirardelli square location is much better, plus it has a nice view of the bay and the Golden Gate. But if you can't make it, this is an excellent alternative.\n\nThe sundaes, ice cream and hot chocolate are fantastically decadent. My favorite is the triple chocolate ice cream.\n\nAs you would expect they have a wide selection of chocolate bars and gifts which you can also find in a couple thousand locations around town from the airport to Walgreens, but of course Ghirardelli's has more choices and products like the hot cocoa powder that you don't usually find elsewhere.\n\nIf you are going to get some bars, may I recommend the Evening dream 60% cacao?", "author": "Gerardo D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-16", "description": "Yes it is good but a little too sweet for my personal taste but it is more rich than other chocolate so it makes sense...a little expensive but you are paying for quality", "author": "Jo N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-13", "description": "GHIRARDELLI is One of the BEST FOREVA in the city with its ultimate Sundaes anyone could die for. It never compromises on its standards anytime. If your planning to have an Icecream aft a HEAVY dinner, then SHARING works-coz it's too overwhelming to be finished by a single person . For once I don't want to review their icecreams coz everything is sooooo good there.\nPS- Easy on the whip cream if you want more Icecream", "author": "Amu S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-26", "description": "Great ice cream, and lots of it!  Ghirardelli is a San Francisco tourist destination, but it is also great for locals looking for something sweet.  We tried the chilled cocoa float with mocha chip and vanilla ice cream.  The wait time was short, and the drink came out to us with two spoons and lots of whip cream.  My girlfriend and I got through most of it, though it was a little too big for the two of us to finish without getting a bellyache.  With tax, the bill came to $8.98.  Highly recommend for folks looking for a solid ice cream fix (and walk through the hotel after for some free live music and nice architecture).", "author": "Matthew R.C. Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-28", "description": "For anyone who loves chocolate, if you are in San Francisco, you should absolutely check out one of the several Ghirardelli Ice Cream & Chocolate Shops. \n\nUpon entering the shop customers are handed samples of the latest chocolates from Ghirardelli. Admittedly, there have been a few times when I've been walking to somewhere else in the area and I've just popped in quickly just to get a sample. Hopefully, if people are inspired to check out Ghirardelli based on my review, that will offset my sample thievery. \n\nAs good as the free samples are, if you go in the shop, you would be remiss if you did not get one of their stupendous ice cream sundaes. Note: If you check in on Yelp, you get $1 off of a sundae. My favorite is the Treasure Island which features two warm, incredibly rich and decadent brownies served with two scoops of ice cream and a bevy of toppings including what is possibly the best chocolate syrup ever. The sundae's cost around $9 (even with the check in deal) but they are worth every penny. They are easily the best ice cream sundaes that I've ever had. To the tourists reading this, your trip to SF is incomplete without a stop at Ghirardelli.", "author": "Ravi S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-12", "description": "HAVE AGAIN: the hot fudge sundae was delicious, but a bit steep at $11.95. A one scoop ($4.95) with hot fudge (+$1.25) and nuts (+$1.25) was a much better deal.\nService needed to be improved: no one handing out chocolate samples and it was unclear about how the ice cream would be served. But Yelp had $1 coupon which was good for both sundaes.", "author": "Keith R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-15", "description": "First off, i love that they're open late. \n\nCame here last night after having dinner at a nearby restaurant; it was 10pm and the people still kept coming even after us. \n\nThe servers was nice and friendly. Our sundae came quickly right after we ordered it. It was delicious, as with anything that has Ghirardelli chocolate. Would definitely come again if I had a late night sweet craving.", "author": "Robbie P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-31", "description": "If you're going to go to Ghirardelli Square, or even San Francisco, this place is a must! I took my friend from out of state here after dinner and we had an absolutely wonderful time. We went on a Friday night, so yes, it was super busy and we were lucky to have been able to place our order in under 15 minutes and even be able to find a seat. we split the sea salt caramel sundae that ended up being $13 (did not expect it to be that expensive!) but it was so delicious and surpassed my expectations. \nAs we were finishing our sundae, we were facing an Instagram captioner's block and just could not figure out a caption for our picture from the Square. We decided to ask a server, but when we asked, I don't believe he heard our question but just smiled at us. It was an incredibly busy night so we were stuck facing our blocks by ourselves. Nearly 10 minutes later, this same server came to us with the brownie sundae. I said, \"we did not order this; you must have the wrong table!\" He said \"no I don't, it's for you.\" Though we were completely stuffed already, we still tried to enjoy some part of the brownie sundae. Such a kind, random act of kindness. It is servers like this that keep customers coming back. We didn't manage to grab his name, unfortunately, but what an amazing end to our Friday in the city!", "author": "Danyelle A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-10-25", "description": "As I mentioned earlier, The Nephew #2 is in town. After we made arrangements as to where and when to meet up after our various SF expeditions, I spotted this Ghiradelli Ice Cream and Chocolate Shop location. Wow, they sure are everywhere, as Ed U. mentioned in his Yelp! review. I remember this location at New Montgomery and Market used to be a bespoke/custom shirt place. Bespoke shirts made-to-measure and order.\n\nI was definitely in the mood for a hot fudge sundae even though I had lunch. When I walked in, I was ambushed with an offer of a Ghirardelli chocolate and caramel sample by a sales associate. I declined the offer and asked if they had any samples without caramel. Unfortunately, these were the only samples being offered that day. I then stated I was only stopping by for a hot fudge sundae. I was then directed to the till to place my order. \n\nWhen I got to the till, I inquired about the hot fudge sundae sizes to the young woman at the order terminal. She told me I could get either a one scoop or a two scoop. I opted for a one scoop. She then proceeded to explain taking the number to the table and that my order would be brought to me. Pretty cut and dry.\n\nAs soon as I selected a table and sat down, the ambushing sales associate brought me my hot fudge sundae. Wow, that was pretty fast. It was not crowded at all, not that busy, that's for sure. There were two tables already occupied and one person sitting at the window counter. It started to get a tad bit busier by the time I left. There were two women getting ready to sit down as I was leaving. I asked the sales associate now performing the role of server as to where to put my dirty dishes. He told me to leave it on the table.\n\nWell, this one is A-OK. The service was all right. It just does not have the ambiance of the original Ghiradelli Ice Cream and Chocolate Shop in the Fishermen's Wharf area. With the chocolate being rolled back and forth and back and forth. . . .  If anything, it is like a Starbucks branch just about on every corner. A Ghiradelli Ice Cream and Chocolate Shop just about on every corner in San Francisco.  Hmm, that makes logical sense to me when I consider Ghiradelli chocolate is a San Francisco institution.\n\nI am done here, time to go do some S-H-O-P-P-I-N-G (as in the title of the Pet Shop Boys song from their 1987 album titled ACTUALLY) before meeting up with The Nephew #2 to head for home.\n\nhttps://m.youtube.com/watch?v=jR4h6yfqI-M\n\nSYOY! Ciao!", "author": "Chiara A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-06-19", "description": "Having been to the Ghirardelli factory in the marina, I know what the sundaes are supposed to be like and this was definitely sub-par. I got the cookie bits sundae, which is supposed to be smothered in hot fudge and there was only a tiny drizzle on one side of one of the three ice cream scoops. It was enough for ~1/4 scoop. The sundae tasted pretty bland without it, especially the vanilla scoop, since there weren't enough cookie pieces to flavor it without the fudge.\n\nAlso my friend ordered two scoops of ice cream and they only gave him one scoop. When he questioned them about it they said it was hidden in the waffle cone under the first scoop and he just couldn't see it. He was skeptical, but went ahead and ate through. Once he got to where the second flavor should be, it wasn't there. Thankfully he had gotten two flavors, so he was able to prove that they had only given half the order, but if he had gotten two scoops of the same flavor he wouldn't have been able to prove it and might have only gotten half the order.", "author": "Brennan R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-02-17", "description": "So crowded and hot in there. You can buy the chocolates anywhere in town. So save yourself some time and money and do that if you are on vacation! Just go through to take a picture in front of the sign.\nAlso, FYI if you want a sundae go to the bottom ice cream shop Ghiradelli has (right by the steak restaurant). You will save yourself an hour of waiting time and it is the same menu!\nWe waiting in a 15 min line only to be told if you want a sundae you have to wait another 40 min in line. I just gave up because it was so warm in there :(", "author": "Vicky S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-11", "description": "Great place to get a small, super sweet/rich snack. \n\nEmployees are super friendly and they give you samples as you walk in!  \n\nI bought 5 chocolate bars, but the best one was the Intense Dark Raspberry Radiance Bar.  It is one million percent worth the $5.  \n\nI'll try the ice cream sundaes next time.", "author": "Kristin H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-10-03", "description": "Came here after dinner to grab ice cream. We had three orders of ice cream with SUGAR cone and were given the regular cones - that was very disappointing but that's what they called sugar cone because their other option was waffle. The ice cream was also a bit on the pricer side. It was near $15 bucks for three scoops and the ice cream wasn't anything exceptional. Should go here to order their specials like the sundaes etc. they sell a lot of chocolate all around the shop which really tempted me. There's also plenty of seats inside to eat your ice cream.", "author": "Amanda C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-08-10", "description": "Visit here if you must but nothing special. i can get the chocolate at my local grocery store.", "author": "Dan N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-13", "description": "Is work stressing you out? Get some ice cream!\n\nThe portion sizes here are HUGE. The sundaes are a good size for two people to share. It's pricy, at almost $10 for a sundae, but might be worth it for a special occasion. A basic ice cream cone is $5 and is a much better size for one person. Yum.", "author": "Theresa M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-08", "description": "Cute guy greeted me at the door and pointed me in the right direction. Grabbed a mocha for my friend and was in-and-out in under 4 minutes.\n\nExpensive but (ostensibly) delicious (I didn't have it, my friend did).", "author": "Sean B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-06", "description": "I've stopped here many times during my visits for a morning mocha and the service is almost always fantastic. There's a girl there, I think her name is Alicia who absolutely rocks. She remembers me, even from months before and remembers my drink! She let me use my 10% coupon more than once during my vacation. She's always friendly and even gave me a discount when she could not find a drink punch card for me. I stopped in on the last day of my vacation and unfortunately she was not there. No one offered a chocolate, my coupon was refused as it is for chocolate, and when my drink was ready they just yelled to me that it was on the bar. Nevertheless, I will be back. Alicia makes up for the other lackluster employees. That girl deserves praise and a raise!", "author": "Nicole J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-12", "description": "Sweet tooth heaven!\n\nI was always told that Americans can't do chocolate and after a Hersey's experience was a little candid to try Ghirardelli's. Although wooed by the taster minis (milk chocolate caramel), that they hand out at the door in this branch, I was enticed to shared a muir woods sundae and a drinking chocolate. \n\nI am an absolute sucker for cherry ice cream and the hot chocolate sauce on the sundae was just divine.\n\nThe drinking chocolate was also pretty good. I've been a touch spoilt with hot chocolate in Europe (not England, where this tends to be atrocious - although we are getting an upsurge in cacao, which I am thoroughly enjoying), but was pleasantly surprised by this little cup of goodness. I wouldn't go out of my way to drink another, but I would for that sundae... And it did go some ways to dispel the myth and open me to the idea that Americans can make great chocolate on par, and even better than some European varieties.", "author": "Ray C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-31", "description": "This place is always a go to place if you are in the city! \n\nExpect long lines as it is a tourist hot spot.  However, they try to keep you happy by providing complimentary chocolate. \n\nOnce the line starts moving, it goes by fast.  I got the strawberry hot chocolate and it was delicious!  Seating can be hard to find so you have to do a bit of looking.  However, I greatly appreciate how they bring it right to your table.", "author": "Shiori S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-18", "description": "I was disappointed that I was not able to make it to Ghirardelli Square for my ritual buying of my chocolate bars and to have a sweet treat.\n\nWith our luck, there was a Ghirardelli on our way back to Union Square and I had to stop. There are mini chocolate squares now available (maybe for diet people?) and we got free samples of it. Man, I wanted the regular sized one as a sample! DARN IT!!!\n\nI ended up buying 5 chocolate bars to bring back home (Buy 4 get 1 Free Promo). It is only in SF that you can buy limited edition bars and various flavors.\n\nThis location also serves dessert!", "author": "Maria C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-28", "description": "It's always great to eat the ice cream sundae here. Too bad the Pasadena, CA location closed down a long time ago. I used to go there in high school.", "author": "Steve P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-17", "description": "If by chance you're near-ish to the Embarcadero/Financial District and want to pick up a chocolate-themed gift (assuming that said gift can come in the form of chocolate squares or bars), this is the place. (It's also a full-scale ice cream shop, but I'm saving that experience for another day).\n\nWhile it's fun to visit the historic Ghirardelli Square for the nostalgia, there's no need to go out of your way if you're primarily on a chocolate acquisition mission. Most (if not all) of the merchandise is the same there as it is here.\n\nThe best bet? Check out the clear, 80-count sacks of \"overstock\", available in several varieties (currently, $26.95 each). Shelf life is printed on the bottom of the bag, in case you don't plan on eating/giving the bag right away. Checking with the greeter at the door occasionally will tip you off to additional deals though too (...and they're usually armed with a basketful of samples, just in case you've forgotten why you came to the store...).\n\nNote:\n* Considering buying some chocolate (for later) and a sundae (for now)? Check the bottom of your receipt from the sundae purchase to see if a coupon for 10% off of a future purchase is included.\n\nComing back twice? Darn... you might just have to.", "author": "Dennis W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-10", "description": "Very delicious ice cream!!!. I recommend this place. I think it was a little pricy but is worth it.", "author": "Nasim S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-10-16", "description": "I love ghirardelli as a local from the North Bay; however the service I got here seemed as though they wanted me out as soon as possible. I arrived 30 min. before closing so that should not have been the reason. I would much rather go to the location at Ghirardelli Square than this location. \n\nIce cream however was delicious as usual. I got a scoop of strawberry and a scoop of cookies and cream. If you are fine with potentially poor service this is a good place to go.", "author": "Eric W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-03", "description": "I figured this would be a tourist trap, overpriced and full of people. Well, nope! I was wrong. We were nicely offered pieces of chocolate as we walked in. The shop wasn't packed at all during an afternoon, which was nice!\n\nThe interior is quite nice with a counter/bar that looks like the ones you find in Europe & with a nice Ghirardelli Square panoramic picture above it.\n\nWe got ice-cream in waffle bowls & cones. They have some good flavors like Butter Pecan, Cookie Dough, Mint Chocolate Chip, Rocky Road. You can add hot fudge on top... Yum!\n\nWe ate inside the shop eyeing the chocolate covered nuts and other chocolates. :-D\n\nIf you're looking for San Francisco souvenirs, there's a good selection of gifts for people outside the city/state/country like Cable Cars with chocolates inside. All the Ghirardelli chocolates make good presents too! \n\nCool SF spot. I recommend!", "author": "Leslie S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-22", "description": "I like this place, aside from the one by fisherman's wharf. It's less touristy and crowded and still serves the same sweet and filling goodness of fatty chocolaty creamy options. One ice cream sundae is worth a whole meal's full of calories or more. I'll come here again to buy chocolate as gifts for family or friends.", "author": "Alice S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-05-05", "description": "It's a complete chocolate shoppe just surprised to see lot of chocolate boxed so tempted to buy all the available boxes over there, and finally bought one assorted mixed chocolate box and took sample chocolate given by them. So planning to taste sundae ice creams over there.", "author": "Sandeep R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-04", "description": "Stay away if you value your value healthy blood sugar levels and teeth. Upon entering, like any other Ghirardelli, you're treated to a complimentary piece of chocolate. This chocoholic's heaven is lined wall to wall with perfectly stacked, wrapped, and packaged containers of chocolate. Honestly, who knew that a company that produces only square pieces of chocolate would find so many ways to package their product? \n\nAnyways, I come here pretty much only for their house-made treats: ice cream and drinks. Pick up a menu near the check-out counter and feel free to peek at the tables of other sweet-toothed patrons along the way. There are plenty of seats here to sit and enjoy your dessert! Best part is since they offer coffee to the early risers, the rest of the shop is open early too for crack-of-dawn sugar emergencies. Bathroom requires an employee to unlock for you, a little annoying when you're in a rush or the employees are busy. Don't be afraid though - they're pretty friendly and can get the job done.\n\nIf you're here you probably already know what Ghirardelli chocolate is like - if not go ahead and take a bite of that freebie you got walking through the door. Yeah? Silky sweet. Okay, imagine that in ice cream/shake/hot chocolate form... Whatever you're thinking will be pretty accurate. You can never outgrow a good hot chocolate, but even the small size packs quite the diabetic-punch. I opt for the Sea Salt Caramel Hot Cocoa to try and get a little more balance, but the sea salt usually all ends up at the bottom so it's all in vain. Ice cream is oh-so-delicious, even on the coldest and windiest days. But their shakes? To die for. Get a Mint Quake Shake and you'll understand the meaning of #thestruggleisreal while waiting for the ice cream to melt enough so you can keep sipping.", "author": "Helen S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-29", "description": "I never really was a fan of Ghirardelli... mainly because I'm not a big fan of chocolate. However my girlfriend kept insisting we have a late night dessert here for our last night in SF. \n\nOf course, we were given free chocolate upon entering (which is always nice!) and we ordered a sundae which came with cookies and cream ice cream, cookies bits, pieces of chocolate, whipped cream, and chocolate syrup! I wasn't really excited but then again, I haven't had a sundae in a while and I forgot how yummy they are. This sundae was AWESOME. What made it was the pieces of chocolate chip cookies in the sundae... that was the best part. Between 4 girls, we couldn't finish this sundae. It was a good way to end the night.", "author": "Felicia L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-19", "description": "I love chocolate (If you ever read my reviews you would notice)! Always looking for a chocolate desert, or looking forward to Wednesday (which is my personal chocolate day). So yes! Of course I needed to head to a Ghirardelli shop during my time in San Francisco. If you know nothing about Ghirardelli (and you should) it's a chocolate brand division of the famous Swiss brand Lindt that is a SanFran local! \n\nI was welcomed with big smile (American costumer services nice as always), and a small sample of Dark Chocolate and Salt Caramel. OMG, I liked it!Ok, now I am ready for more. Bring down the ice cream deliciousness.  \n\nMy overall experience here was great, I have nothing to complain. Nice service, great product, the only shame is not having it back home. I guess I need to buy a bunch and bring back with me next time. Hummmmm Wednesdays will be happier with Ghirardelli for sure!", "author": "Fernanda S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-28", "description": "Great ice cream and great costumer service!!!\nThe location is convenient and is in down town area.\nWorth it to try:)", "author": "Darko G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-09-02", "description": "Thia ghiradelli is AIITE YANO AIITE. Its overpriced and wayyy to sweet. However if you want a place to get some chocolate souvenirs then you can come here. I like the caramel chocolates but thats it LOL. The dark chocolates are pretty bad no offense and the sundaes are MEH. Just go to godiva or something hahahaha", "author": "Jane K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-08-15", "description": "too much good stuff in here. especially the hot chocolate! mama and i ordered one each after dinner to keep us warm on a surprisingly brisk summer night walk. the store is not big, but, well positioned. friendly folks and lots of sample options. obviously, pretty pricey. but, we had to pick up a couple pieces for the kiddies. nice spot.", "author": "Rey L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-17", "description": "Nothing tastes better on a cold, windy San Francisco afternoon than Ghirardelli ice cream!  I haven't been here in a while, so it was a great treat and brought back so many fond memories of weekends out with my family.  The line was out the door when we got there, but moved quickly.  They are so efficient and friendly.  Ordered the classic hot fudge sundae.  It was sooooo delicious.  Not too sweet, not too rich, but just right.  I forgot how much better ice cream tastes at an ice-cream parlor.", "author": "Jayce O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-20", "description": "I ordered the chocolate and rocky road ice cream and that alone for me is satisfying.", "author": "Grendel Z."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-01-15", "description": "***This new Ghirardelli location provides San Francisco residents and tourists the ability to try their popular ice cream sundaes without having to make the long trek to Fisherman's Wharf (many Ghirardelli locations only feature chocolates and no coffee or ice cream); in terms of their chocolates, a lot of the product here is standard stuff and surprisingly pricey given just the decent quality, but you can purchase individual chocolate squares and this store (like other standalone Ghirardelli locations) features much greater variety than what is available at a Target or a grocery store***\n\nThis Ghirardelli is located in a very busy area and street parking is very hard to find.  There are a few parking structures located in Union Square and you can also find metered street parking along the street that faces the Ferry Building.", "author": "Anthony N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-06", "description": "I love hot fudge sundaes. \n\nNow add Ghirardelli\n\nThen a melting Ghirardelli brownie\n\nDONE-ZOE!", "author": "Greg F."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-01-28", "description": "20 minutes to make a hot chocolate?  Last time I checked that was like 2 ingredients, max.  Had to make a dash for the next BART, so didn't even get to receive our hot chocolate in time.  Employees were chatting it up and clearly in no hurry to serve (in a reasonable amount of time) the whopping 6 customers that were there.  Charged us 5 bucks, and not even an apology.  Good for you, Ghirardelli.  Thanks for taking our money without serving us. Waste of time and money.  Only attempted to go there because they were the only place open at the time.  Won't be back. would suggest that others find a better, local, higher quality establishment that doesn't treat it's customers like garbage.", "author": "Jeff T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-25", "description": "Ghirardelli never does me wrong! EVER! I came here after a dinner with one of my best friends and we were thinking of splitting a sundae.. but knowing how they do it at the Ghirardelli by the pier, they're huge. So we just got one scoop of rocky road in a chocolate-dipped waffle bowl. Total was 5.70, but this one scoop is literally.. one HUGE scoop. Probably like two scoops for me since I don't eat that much. It was definitely good enough for the both of us for some dessert.\n\nFor the most part, what I'm trying to get at here is that if you already had the soda fountain experience at the tourist location, come here to the financial district and get your fix. It's more geared towards the locals and they do the same things at every other Ghirardelli: hand out free chocolate, sell bulk chocolate, and have hefty portions of ice cream and sundaes without the crowds, long lines and fighting for a table to sit at. The prices are the same as the North Point location, roughly $8-$10 for a meal-like sundae or malt shake. I'll probably come back for some coffee or tea and a light dessert next time. Service is always friendly and helpful, no doubt there.", "author": "Kathleen S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-02-20", "description": "Cool lil shop. You can purchase chocolates, gifts, or ice cream featuring their chocolate. \n\nFriendly staff and typical prices for Ghiradelli. \n\nI got a classic sundae for a lil under $10. \nThe ice cream was nothing to write home about. Classic vanilla ice cream by Dreyer's \"/  you'd think they'd use better quality ice cream to douce in their chocolate but nope! I was actually pretty disappointed. I've had better sundaes at local ice cream shops in the east bay for much cheaper. I also didn't too much like the globs of thick chocolate in the sundae. I don't like my chocolate in sundaes to be a quarter inch thick and three inches long. They should use more of a chocolate drizzle. \n\nOverall, come for the merchandise (they have great gift ideas for any budget), the experience, free samples and friendly service but don't have too high of hopes for the sundae.", "author": "Keenya D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-05", "description": "I can't believe how many times i've walked by this place and never gone in - it's so great! Central location in financial district near ferry building. Lots of ice cream / sundae / shake options. I forgot what it was called but i had a shake with salted caramel, ice cream, and banana in it. Was nothing short of amazing, but also super sweet. My friend and i sat at the bar stools by the window which are great for people watching, the minir downside of that being that people can see you too, so be prepared for that lol. Clean place with friendly, attentive staff. And, of course, there's also bags ans bags of ghirardelli chocolates to buy as well", "author": "Bianca C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-07-06", "description": "DO NOT order your ice cream treats \"to-go\" no matter how busy the store is. Very disappointed and left with order-envy as we saw so many other full-size treats that eclipsed ours by a mile! Paid $33 for 2 adults treats and one small one for our daughter and super-bummed as we were trying to show off a SF staple to out-of-town company.", "author": "Rodney V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-07", "description": "The best place for a late night snack - staffs are helpful and very professional! They are aware of the flow of customers and the seating areas are cleaned! Prices are fair and portions are large-can share the banana split...They are located right downtown. Good for locals and tourists.", "author": "Stephanie C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-03", "description": "Cookie Sundae is delicious! Just a good as the shop in Ghiradelli Square and less crowded.", "author": "Amanda S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-04", "description": "Best ice cream and hot fudge in the city.\nService is great and ambiance is perfect for a great dessert.", "author": "Jonathan H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-29", "description": "This is one of the top tourist attractions in SF. I had the espresso crunch and the ice cream was good. It's very sweet, good for dessert at night. This place is a must try as a tourist. The staff is friendly as well and it's clean inside.", "author": "Jaime F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-16", "description": "Itz a ghiradeli fame but in a convenient location.\nPrices: avg $10 sundaes\nMy fav is the ltd time strawberry fudge sundae which is usually available nr valentine's day. But tday is the 16th so unsure if it was for this yr\n\nService: 2nd visit n had the same server, allen. Was vry courteous n paid attentive to our requests\n\nSundae: has their ocean beaxh, salt n caramel sundae. If u lyk sweet n salty, this 1 is for u. I cant compare this sundae to bi-rite's bc itz only ice crm vs a sundae.\n\nBathroom facility: gd that a code is needed to open, but wen I had to use it, there was no toilet paper. Feel sorry for the ladies", "author": "Keikaikaoakua P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-08", "description": "Chocolate and not crap american chocolate either!\n\nWe opted for the ocean sundae - which consisited of sea salt, caramel, chocolate and ice cream.  Boy it was a treat!  But I'm glad I shared one with hubbie as it was huge!\n\nEvery time you wank into this store you are treated to a bite sized ghiradhelli chocolate too.  \n\nIt's really good central location too.  Lots to choose from for gifts to take home too!", "author": "Emma W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-24", "description": "Shop is huge with cute decor with chocolate galore and ice cream surrounding a bar. Their Ghirardelli chocolate ice cream is the best! Their scoops are very generous compared to other ice cream shops, so I'd probably be content with just one scoop next time. I love it better than Byrite.", "author": "Cookie B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-11", "description": "Amazing ice cream creations! It's expensive, but worth every cent. The service is fast and friendly. Everything about this place is excellent!", "author": "Charles S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-06", "description": "I had the espresso chip ice cream and it was heaven. I didn't get a free chocolate square qq but maybe they were understaffed or something when I went. \n\nI really want to try their sundaes in the near future.", "author": "Juliana P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-05", "description": "Giving 5 stars because the service here is awesome! I noticed that most of the employees were young and just so attentive, polite, and welcoming. I was just so impressed by the service. I know it's an ice cream shop and not a restaurant, but they just provided such a great environment/ambience.\n\nAs for the ice cream, I ordered the Gold Rush sundae. I would order a sundae here, even though they are pricey. They are HUGE, and def fulfill that sweet tooth craving. You probably should share the sundae to not feel so guilty. The ice cream flavors are normal here. The chocolate pieces are definitely delish. Great place to stop by if you have a sweet tooth. It's definitely a San Francisco treat!", "author": "Kirby P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-29", "description": "I still love this place after all these years! Even as the price of an ice cream sundae has gone up the loyal Ghiradelli chocolate lover in me stays!\nEven on a cold day the fan comes to enjoy! It is busy folks! Yes, all the tourists are here and your party might do some table hunting, be prepared. \nYou can purchase chocolates elsewhere as well but if you have never tried a Ghiradelli sundae, with this amazing chocolate fudge..you must!", "author": "Marie P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-06-01", "description": "There are not too many ice cream shops left, and this one is a good option at any of the many locations. This one is located in the historic Palace Hotel, and features comfortable seating (much more quiet than many of the other locations, such as the one a few blocks away at the Westfield Center), good service, and pretty good sundaes, etc. (I had a hot fudge brownie sundae with dark chocolate ice cream, and it was pretty good). If you are looking for something a bit more old fashioned and less corporate, try Fenton's in the East Bay (on Piedmont Avenue).", "author": "Jethro B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-09", "description": "You can't really go wrong in getting any kind of ice cream or Sunday topped with their delicious signature chocolate fudge sauce here. I've never had a bad experience at any ghirardelli's", "author": "Rehana K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-16", "description": "Of course, the food was great.  The tables had been left dirty and after I asked someone to clean the table, she disappeared for several minutes.  While she was gone, I figured she left for the day, so I used napkins and the water dispenser to clean the table myself.  While I was doing that, she returned with a warm cloth and did the job I already did.  Other tables needed attending, but, she walked off and left them.", "author": "Vanessa W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-13", "description": "If you are coming to San Francisco and love love chocolate. You cannot go wrong with this place!!!!", "author": "Dana S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-21", "description": "I loveeeee ice cream! Some friends think I survive solely off of ice cream because I love it so much!\n\nThis place is my default ice cream shop since it's so close to home AND it's close to the office. wheee! Things to order from the cafe:\n- Ghirardelli Hot Fudge Sundae\n- Hot chocolate\n\nThose are the two orders I ALWAYS default to...plus I bring my out-of-town guests here so they can get some souvenirs to take back home. It's a great alternative if you're running out of time and can't make it to Ghirardelli Square. Lovelovelove!\n\nThey have their chocolate selection of bars and assorted bags, plus the usual SF swag with chocolate in it. But the best part about the place is the \"fill you own bag\" section, where you can just create your own assorted baggies for $10/lb.\n\nWhen I create a baggie, I get:\n- Hazelnut Crisp\n- Toffee Crunch\n- Cookies and Creme \n- Milk Chocolate Truffle\n\nThose are my favoriteeeee!! though..some ppl say the hazelnut crisp is way too sweet, to which I say -- if you don't want something sweet, why are you eating truffle/fru-fru chocolate? :) Might I also add that they have a good variety of dark cacao bars too? :)\n\nOverall a great place! There are some great chocolate places in the area with artisan chocolate, but when you're in the mood for the classics...this is a convenient, good ole', down home spot to hit up!", "author": "Jennifer S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-30", "description": "Delicious sundaes and big portions. A bit touristy, but the product was quality. Two people can generally share one sundae, so that $12 price tag does not seem so unreasonable. If you want to buy Ghirardelli chocolate, it's wiser to purchase at your local drugstore like CVS or Walgreens. You'll get the same stuff for less $.", "author": "Ben K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-28", "description": "Delicious food! What more do you need to know? I have tried many different sundaes and shakes from here and not one of them has failed to impress me. The staff is super friendly and will help you if you're stuck on what to order. Also, the free samples that they hand out is a fun plus!", "author": "Ailish R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-01", "description": "We don't have this ban on New York so it was a must to try! I ordered the Treasure Island. Ice cream with brownie! Who can say no to that.\n\nIt was quite sweet though, the brownie was too rich for my liking. But overall good experience. It reminds me of Serendipity's hot chocolate but dressed up!", "author": "Louise C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-22", "description": "It was like a trifecta of a perfect storm:\n\n+I was craving something sweet.\n+I had had a small lunch.\n+Some lady sitting by the window was going to town on a sundae.\n\nI didn't walk here on my own accord. Some form--of divine intervention, karmaic intercession, the Flying Spaghetti Monster's intuition, whatever you believe--placed my feet in front of one another to enter the doors of chocolate heaven. \n\n(Actually, my boyfriend's chocolate heaven, but that's a story for when the kiddies go to bed...)\n\nI ordered at the counter and watched the lovely ladies prepare the \"World's Best Sundae.\" (http://www.yelp.com/biz_photos/ghirardelli-ice-cream-and-chocolate-shop-san-francisco-3?selected=-q8xXbSq-43zz6JF-3oQcg#UNAv_CFks-Of_v3QuFzWkw) Hot fudge with vanilla ice cream, tons of whipped cream, chopped almonds, and a Maraschino cherry on top. \n\n+Was it tasty? Yes.\n+Was it worth $10? Yes.\n+Did the chocolate surrounding you help? Yes.\n+Were the servers friendly? Yes.\n+Are you being forced to say \"yes\" because of some inexplicable force? Ye---wait, what? No! Really, it's one tasty, tasty sundae.", "author": "Adena B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-29", "description": "I needed a big batch of chocolate covered strawberries for my friends birthday and they came through for me with excellent service!!! It was pretty short notice. (only 1 day) but I stopped by the day before the party and they helped me arrange everything.  The next day they were ready for pick up when I needed them and they were in beautiful boxes.  Alicia helped me through the process. She's awesome!! Everyone loved them.  Side note: if you are every throwing a birthday party for someone that doesn't eat gluten consider avoiding the cake and getting some chocolate dipped strawberries!! Mmmmm!!", "author": "Brian L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-07", "description": "Stopped by here while in the downtown area, we were greeted by a chocolateer handing out free chocolate and starting conversation. There was a line for the bathroom that collided with the line to order which caused some confusion but both lines went fairly quickly. There isn't much room for a stroller to pass through that store so just a heads up, best to fold up your stroller or park it before coming in. The sundaes and shakes we purchased were very good.", "author": "Nikki H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-01", "description": "Who doesn't love chocolate? Ghirardelli is one of the top when it comes to chocolate brands, so coming by this shop is always a treat. And, it's the best place to make a pitstop as you end your shopping trip in Union Square. I've tried only a couple of the desserts, but my favorite has to be the Treasure Island Warm Brownie Sundae. The combination of brownies, fudge, & ice cream makes it a perfect dessert to share. The only downside is the slow service at times, but other than that, it's a great spot to pick up some of that famous chocolate or try the desserts!", "author": "Angela D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-06", "description": "I'm very opinionated about my chocolate. I dislike chocolate that is waxy. I like dark chocolate but I consider myself a light weight since my chocolate of choice is usually semi-sweet. I can only take a maximum of 68-75% cocoa content before I find the chocolate too bitter. \n\nI picked up some chocolate as Christmas presents last month and I couldn't resist getting some for myself. I discovered that Ghirardelli has a dark chocolate I adore. It is the Intense Dark, Sea Salt Soiree with roasted almonds. \n\nHey, it is not an excuse but a medical necessity. One ounce of dark chocolate is good for my health and those little bitty squares are just .375 ounces. I'm not sure about the % of cocoa but the first listed ingredient is semi-sweet chocolate.", "author": "Cece E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-13", "description": "The ice cream is tasty. The fudge sundaes are really good so anything you get is worth it!!", "author": "Cynthia M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-12", "description": "oh so yummy!  I don't even really like ice cream that much but I would eat this anytime!!!  What can I say.  You can't go wrong!", "author": "Kris H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-11-06", "description": "This chocolate shop is exactly what you imagine when you think Ghirardelli.  Went in on a cool day in San Fran (i.e. any day), and had a good hot chocolate.  It was dead quiet when we were there, so service was great.  \n\nReason for 3 stars and not 4, was that while its a nice place, you can't shake the feeling that you're in a giant corporate chocolate shop.  Everything tasted formulaic, and while it was a good hot chocolate, it wouldn't register any-where near my top 50 or even 100 chocolates I've had.  (I really like chocolate).", "author": "James O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-22", "description": "Came here on Monday around 5pm with some girlfriends. Warmly greeted by a cute worker and offered samples! Yay!\n\n$1 off an ice cream sundae check-in offer on Yelp? Thanks! My friend and I split a Muir Sundae, I think... It was blackforest cherry vanilla ice cream with a copious amount of whipped cream and a cherry on top. And best of all, generous helping of hot fudge! The fudge was to die for, and the cherry ice cream was tastier than I expected. Cherry was gross, whatever. \n\nTotal was just over $9-$10, pretty standard. I only wish the sundae cups came in a bowl or with a plate... Because they were so messy/hard to spoon without spilling everywhere, felt bad for them. (sorry!)\nNot the usual Ghirardelli's I visit while in the city, but I was craving a sugar fix after some shopping around Union Square. Decent!", "author": "Aimee V."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-01-04", "description": "While the product is good, this location was a disappointment.  \nThey ran out of caramel. Yes, an ice cream parlor ran out of caramel. Unapologetic. We figured out something else. \n\nProduct arrived with three dirty, used spoons. Wet and sticky covered in whipped cream dirty. \n\nAlso wrong ice cream flavors were served. \n\nReturned item to much attitude. \n\nIce cream returned in a tiny plastic cup instead of usual glass. No chocolate square as advertised. \n\nI take my calorie bombs seriously. This was a disappointing San Fran experience.", "author": "Robin W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-23", "description": "Service is fast and the lines move quickly. You could never go wrong at this place when it comes to chocolate. Love the Espresso Escape! If you like coffee, you will love this one.", "author": "Jason A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-25", "description": "Fun place to take friends and family who are visiting SF. If you're in the mood to indulge, this is the place! Usually there is a line, but it moves fast and the service is fast. There are actually two cafes, making the service even more efficient. It's somewhere everyone should visit if they like chocolate and ice cream", "author": "Alisa M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-07-19", "description": "The lady at the counter gave me A LOT of attitude. I ordered a cone with cookies and cream ice cream and chocolate sprinkles; she gave me a chocolate dipped cone with chocolate ice cream. She rushed me and started laughing with her coworkers half way through my order. She looked at me in a rude manner and acted very courteous towards the foreign tourists next to me. I would not come here again due to her poor behavior towards customers.", "author": "Melissa G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-12-26", "description": "Disappointing. Hot chocolate had a distinctive burnt flavor. Clearly, the staff was overburdened to meet customer demand.", "author": "Diane B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-12", "description": "A gift for my daughter ;-) she likes chocolates so much. I chose a red metal box for her, with all kinds of different flavors.", "author": "Qingyi Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-14", "description": "I had the classic hot chocolate mmmm...yummy. Great on a cold evening which apparently every evening in SF is, after dinner! I had a bite of a friends brownie,  OMG great . super rich.", "author": "Elisha J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-10", "description": "Amazing icecream!!! I could eat every single day... XD People who works there are also very nice and happy. If you decide to visit San Francisco, remember to stop by!!! You wont regreat. ;-)", "author": "Mariana B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-22", "description": "I'm a sucker for chocolate so this place was a 2nd Heaven for me. Stared at the menu for 10 minutes because everything looked so good I couldn't decide. Ended up going with one of the Painted Ladies named Espresso something. The menu picture does not attest to how large this thing really is. Definitely order this to share. Unless you're like me and took on the challenge of eating it solo. Anyways...this place is delicious. I couldn't remove the smile from my face the entire time I was inside. My 10 year old self came back to life and I didn't miss that at all. Go find yours!", "author": "Jeremiah M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-05", "description": "I would gain at least 10 pounds if i live close to here! I tried the brownie sundae and sea salt caramel. It was too much for me, so i took the \"leftover\" home and saved it for breakfast the next day! The choc was also special!", "author": "Chang L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-04", "description": "My favorite ice cream joint of all time.  It's not just that it's San Francisco based and I always love local company, but it's the sentiment of this joint.  I had the best childhood memories coming to the shop and sharing the absolute ridiculous size of monstrosity of ice cream with 5 other family members.  But, seriously, their chocolate sauce is really one of the best.  So smooth, not too sweet and always so creamy and comforting!", "author": "Julian B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-27", "description": "Needed something sweet after our great meal.  Got the Lands End.  Brownie Sundae.  Very busy location but well trained staff.", "author": "Travis B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-03", "description": "We usually are at the Ghiradelli in Orlando when on vacation, and will usually make two to three trips in....The hot fudge is fantastic!\n\nMy sister and I spent my birthday walking around the city and wanted some dessert.  She knows how much I enjoy EVERYTHING here, so she made it a point for us to stop in on our way to BART.  We split the brownie sundae and it did not disappoint.  I've never been able to finish anything by myself here,  I would suggest splitting or come hungry!!", "author": "Marisa I."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-20", "description": "Ghirardelli ice cream. Can you ever go wrong with this?\n\nWe were craving ice cream after dinner along the Embarcadero, but made our way back to Market Street JUST for some Ghirardelli ice cream!\n\nThe staff was friendly and cleared off a table for us just as another family left. They took our order and delivered our sundaes within a few minutes. Love chocolate? GO HERE!\n\nP.S. Free chocolate samples as always!", "author": "Leana L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-20", "description": "OMG! We had the Ocean Breeze sundae, vanilla ice cream layered with hot fudge and caramel. Yummy!", "author": "Laureen L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-27", "description": "I was craving something sweet and since Ghirardelli was on the way to our BART station, we stopped by on a Saturday afternoon. Surprisingly, it wasn't too busy so ordering was a breeze. A simple scoop of vanilla ice cream paired with a caramel sauce topping cost close to $7, which is very expensive in my opinion! Although they had about 4 employees working that day, the store was unkempt with dirty dishes and water cups everywhere. 4 stars due to the lack of cleanliness and prices, but 5 stars for that delicious caramel sundae.", "author": "Joyce E."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-01-02", "description": "Poor service.  Friday night was busy and it appears the management and staff were not trained for a busy evening.  Orders were mixed up or lost and items were made out of order so people that ordered later got their items sooner (not a crowd pleaser).\n\nThe mood the the packed place was tense and upset instead of fun.  I hope that Ghirardelli management reads this and figures out what to improve.  We like this location and when it is not busy, it has good service and great ice cream  We will give it another try.", "author": "Vivek V."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-07-03", "description": "Not on a dare would I go back into this place.  The place was like a popular amusement park ride with no organization. People everywhere, the staff overwhelmed and impossible to keep the floors or tables clean.  I would assume the city of the historical great fire would have a occupancy limit for buildings and I am certain it was exceeded last evening.  We kept our order simple with 4 milkshakes and then waited to pounce on a table as someone began lifting their butts off of a seat.  It was a lot like seagulls chasing a piece of bread.  We ended up with 3 seats for 5 people.  The milkshakes were fine and the staff seemed to being doing their best. I have no idea how they moved through the sea of people with trays of orders without dropping them or getting them in the hair of patrons.  The shakes were good but hard to enjoy in that environment.  I would say this is a pretty disappointing way to represent the Ghiradelli brand and certainly is not an experience that you would have in Hershey, Pennsylvania.  I think we are pretty much jaded on the Ghiradelli brand forever as a family.", "author": "Jeff B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-31", "description": "The sundaes here are absolutely fantastic. There is even one where I work, so I am gonna have to be careful, otherwise I am gonna end up eating nothing up ice cream all day long. The Warm Brownie Sundae has been my favorite so far, but then again, I have yet to sample the entire menu, time will tell.", "author": "Bryan M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-26", "description": "My finacee and I were looking for some late night sweets and were surprised to see this location open when ever other business in the area was packed up for the night. On top of that, all the employees were very friendly and knowledgeable about their selection. \n\nAnd as always, the fresh dipped chocolate waffle cone and ice cream was delicious!", "author": "Conor B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-08-31", "description": "So disappointed!! This review is specifically for the \"original ice cream sundae\" - the square itself was a great place to hang out! \n\nI was so looking forward to having the classic, original \"world famous\" sundae but I have to say, it was likely the worst I've ever had - and I love chocolate and ice cream!! It's hard to imagine how it could taste bad but it was bland and flavorless.  Not sure if it was an off day (it was a Tuesday afternoon) or what.. I kept trying to come up with some excuse for it being terrible, bad batch of hot fudge, poor technique when creating, bottom of the barrel ice cream? None of these make sense tho!  I would have gone with a more exciting option vs the original if I knew the taste was going to be so blah.  We didn't even eat a quarter of it! To back up my point, I gave my 16 mo old daughter a taste of ice cream and she didn't want a second... Bland flavor confirmed! \n\nI did order a cappuccino which was delicious, but right toward the end I noticed a gnat landed in the foam and I thought, yep this is par for the experience! I love their chocolates but won't be ordering another world famous classic sundae.", "author": "Jacquelyn T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-29", "description": "Not quite Willie Wonka and his Chocolate Factory, but it's pretty close!\n\nWhat's there not to love about this spot.  There's chocolate, ice cream, chocolate ice cream, some concoction with various items, and sundaes.  This is a two in one spot.  You can grab some dessert to stay and eat at a table OR you can purchase gifts for folks.  Either way I like the ambiance of the place and the employees who work here are very nice!  \n\nThis is my go to spot for sundaes!", "author": "Bernie C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-01", "description": "I received a free random free banana split from an angel who shall remain nameless! Very delicious! I'm a satisfied customer! :)", "author": "Trunina O."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-05-21", "description": "The ice cream dish was great, servings are HUGE so the most important part gets the best rating, the food.  It is light on stars as the place was not clean, service a bit slow, seating layout not great for flow to cashiers etc.", "author": "Lisa J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-06-03", "description": "Coffee is eh. Cream is processed. Staff are high school kiddos. Big chain chocolates. But maybe I'm just particular about coffee & chocolate, and many other people may love this place.", "author": "Courtney M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-26", "description": "4 stars only because I don't like sweets.  Everyone I was with loved it!   The chocolate fudge is the best in the Bay Area.   I would recommend this spot for families kids love sweets!!", "author": "Cory F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-03", "description": "Same great ice cream bar as the one in Ghirardelli Square minus the huge long wait.\n\nThis one is conveniently located on the corner of Market St and New Montgomery by the Palace Hotel and the Montgomery St BART station.\n\nI popped in to buy some chocolate foiled squares and then caught the Muni Metro home.  \n\nNext time I'll need to order an ice cream sundae given more time.", "author": "Shirley N."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-11-21", "description": "IT'S WAY TOO SWEET!!!!!! a little more expensive than usual (not as much as dandelion) but it's extremely sweet and it honestly doesn't have the fullness that dandelion chocolate has. Go to valencia and give it a try.", "author": "Chanun O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-20", "description": "Simply amazing. The ice cream menu was fun and unique.  I did the Sea Salt Caramel sundae in a homemade waffle bowl. It was delicious. A great mixture of sea salt with caramel and hot fudge. The prices are high but the portions are huge and well worth it!", "author": "Morgan R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-27", "description": "I used to work at this Ghirardellii, so I can probably provide some fairly descent tips for all of you who want to improve your Ghirardelli experience ;)\n\nTip #1: Firstly, I must strain that Ghirardelli uses DREYERS icecream. If you come into the store and buy a single scoop of ice-cream with no toppings, you are wasting your money. THE TOPPINGS ARE WHAT MAKE THE ICECREAM.\n\nTip #2: If you order a sundae, such as the Ghirardelli famous Hot Fudge sundae, I urge you to ask for your hot fudge ON THE SIDE. Otherwise, the Hot Fudge will melt the ice-cream, and you will be left with a puddle. It happened all the time while I worked there, and it left a lot of people unhappy.\n\nTip #3: There are a lot of specialty sundaes/beverages that are not provided on the menu. Ask about the Domingo, the Marina Sundae, the Muir Woods, the Seacliff, and the drinking chocolate.\n\nTip #4: Customize your order! One of the best parts of Ghirardelli was that anything in the menu could be customized to your palate. Add butterscotch, a second cherry, marshmallow syrup, dark chocolate fudge, pineapples, and a variety of other savory treats to really improve your experience. \n\nTip #6: For all of you coffee lovers, i recommend you not to waste your money here. Ghirardelli beverages are not as good as its ice creams. The coffee, espressos, lattes, and cappuccinos are fairly average quality and fairly high costing. The Hot chocolate can be good, but it is very sweet, so you must keep that in mind. ALSO, While the brownies and cookies are delicious, they are NOT made in the store, but rather shipped in frozen. They are also VERY sweet, so keep that in mind. If that doesnt bother you, feel free to try them :)\n\nTip #7: My final tip is basically just some of the sundaes which I liked most. Unlike most of the yelp reviews on  here, I have been able to try every single flavor of ice-cream, topping, milkshake, chocolate, and sundae that the store has sold. \n\nFavorite icecream: plain Icecream is really nothing special at Ghirardelli. Id say that the mint and blackcherry have the most accurate flavors though.\n\nFavorite topping: All of Ghirardellis toppings are shipped in pre-canned except for the fudge, which is made right in the store, and because the store specializes in chocolate, I highly recommend it. \n\nFavorite milkshake: the Quake shakes are by far the best milkshakes in the store. My favorite is the seasalt caramel quake shake, but you cant go wrong with any option.\n\nFavorite Chocolate: All of the Ghirardelli chocolate is delectable, but each has an important characteristic. For dark chocolate lovers, its important to remember that the higher the cacao percentage is, the more bitter the chocolate will be. 86% dark chocolate is very bitter, while 60% is typical dark chocolate. As for the flavored chocolates, I dont recommend the brownie fillings. They are too sweet (which is a common flaw in the store). You can never go wrong with sample chocolates. Typically, caramel chocolate and Sea Salt Almond are the most popular, as well as my personal favorites.\n\nGood luck! Enjoy the store. It has a lot to offer ;)", "author": "David D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-16", "description": "Amazing chocolate shop right Downtown San Fran! Tons of chocolates to buy and choose from (warning! It is a bit pricey) but the best part is that they have an ice cream shop located in the chocolate shop serving up ice cream dishes that are to die for! All ice cream uses their famous Ghirardelli chocolate as well. Yum!", "author": "Hana P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-04", "description": "Bought some chocolate here last night! It was delicious and we got a free sample.\n\n\nThe chocolate covered strawberries are steeply priced (4.95) but still very good! \n \nI will be back to try the ice cream!", "author": "Kayla N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-14", "description": "YES!\n\nYou must stop here if either visiting or living in the city.  The chocolate is unparalleled.  I would say it is worth the possible diabetic coma.\n\nI drank the hot chocolate and almost cried.  Try also getting their version of a frozen hot chocolate.  It is awesome.  Couple that with chocolate dipped strawberrys and you'll be in sweetness heaven.\n\nFrom the dining area you have a perfect view of the bay and a little part of the trolly station. \n\nThe service was perfect.  They even made the chocolate strawberries early for me since I came right at opening.\n\nThe entire area is well kept, I was very impressed.  This is a must stop.", "author": "Ryan V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-27", "description": "Quintessential San Francisco stop. Yes, you can buy most of the stuff in stores around the country. But you certainly can't find a fresh made Ghirardelli Double Hot Cocoa. It's the perfect SF accoutrement while traversing the sometimes chilly streets. What makes this place especially nice are the free flowing samples. Want to try something before buying - no problem, just ask for a sample! Kind and generous - my kind of chocolate place!", "author": "McKenzie S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-07", "description": "Very Nice location, during the holidays season and I usually get my hot Sea Salt Hot Chocolate paired with some gourmet Chocolate ! I always like to sit by the windows and watch all different kind of people passing by! It is an experience and a moment that I enjoy from time to time! It makes me very happy. Then I end up buying some chocolate for my family and myself!", "author": "Mido E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-20", "description": "I've been here over 10+ times. \n\nWalk in, skip the free samples and order a sundae of your choice. My recommendations are the strawberry sundae or the salted caramel. \n\n- Hot fudge is heaven. 5 stars. Get it dark. \n\n- Ice cream is Dreyers 4 stars \n\n- Each sundae averages $10. It's big enough for two. If you want a mini sundae that's half the size, it'll be a buck less. \n\n- Very clean. Service is attentive. People watching is cool.", "author": "Momo M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-02-19", "description": "First time to the Mission Street location. Very similar experience to the Ghirardelli square location, except no lines, and really light-speed-like service. Had the fudge brownie sundae with two spoons. It totally satisfied both of us.\n\nIt's nice to see the proliferation of Ghirardelli ice cream shops!", "author": "Reyn J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-13", "description": "We loved this little gem at the bottom of the palace hotel.  They had some of the best ice cream sundaes ever!  What a treat!  We loved the gold rush and strike it rich!  As well as being delicious, the aroma of chocolate wafts in the air and the presentation of the sundaes belies true frozen food skill!  A great place for desert and fun!", "author": "Al P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-03-22", "description": "Inside: the shop is very colorful and tourist-friendly. Lots of varieties for purchase, and you are greeted with a complimentary chocolate at the door. Environment is charming, has ample seating, and makes for a great stop if you're walking near the Embarcadero, Soma, or Union Square.\n\nFood: The made-to-order options include various ice cream and drink options, including hot chocolate, baked goods, and the infamous hot fudge sundae. \n\nThe sundae is exactly what you would expect; normal ice cream with an above-average-tasting fudge drenched on top. Given the hype, I was expecting something to really \"wow\" me, but in the end this is just a normal (but tasty) sundae.\n\nThe hot chocolate is synonymous with warm milk with a hint of chocolate, not anywhere near as chocolately as I would've hoped. I have ordered this drink twice at this location (expecting that maybe I just had a new employee making the drink the first time) and the results were the same.\n\nAs an avid chocolate lover, I had Ghiradelli at the top of my list when first coming to the city. After visiting this location a few times and generally getting accustomed to the SF foodie scene as a whole, I think this location is fine and has some good offerings, but is nothing to write home to mom and dad about.", "author": "Shawn R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-08-20", "description": "Oh how I love ice cream.  I am a firm believer that Star Wars is the best movie series ever and that ice cream cures all. Now if only we can figure out a way to have it be guilt free, like no fat or calories.  I love love love ice cream, I can literally eat an entire quart of it in one sitting.  On that note, this is the shop on Market, its convenient if you're in the area but the  one near  pier 39 has a better atmosphere.  On that note, they have great chocolate and hot chocolate here, ice cream on the other hand just average.  I think Bi-Rite has better quality ice cream.  But sure stop in and get your chocolate fix, the staff is friendly and the service is good.", "author": "Angela V."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-10-25", "description": "I'm allergic to nuts and they put nuts in my Hot fudge sundae. Customer service was very rude. Owners need to have a talk with lady that made my sundae. You can be held liable for injuries or death.", "author": "Keith B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-10", "description": "Who does not know Ghirardelli. Our Manager took us all out for dessert at this place. We share each other, I love them all. Their chocolate is the best. I use their baking chocolate too,", "author": "Maria S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-09", "description": "This is our favorite ice cream shop in the world. We first started our love affair with Ghirardelli on a trip we made to Vegas back in 2006 and were so happy to know we had one in Lincoln Road which of course we used to go almost every weekend until they closed it down. Now the nearest one we have it's in Orlando :(. Back to our review, our first day in San Francisco of course we went and it was just as good or better that we remember. We ordered their world famous sundae which had one scoop vanilla one scoop chocolate, whipped cream and the hot fudge with their delicious chocolate. The shop also sells all types of their chocolate confections.", "author": "Zaida C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-04-24", "description": "The shop smells like decadent sweet chocolate...How is it possible NOT to get a sundae when you're here?  I got the Ocean Sundae, which is similar to the normal sundae, but with caramel syrup and sea salt. It was good, but I think the caramel syrup actually made it TOO sweet. I will probably just get the classic sundae next time. The sea salt was a nice touch. The fudge is sooo good, but it would be better if Ghiardelli actually made the ice cream they used, and not Dreyers.", "author": "Rosanna K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-04", "description": "So amazingly delicious. One thing we always look forward to while in San Francisco... We came here and since my lactose intolerance has been pretty bad lately, I asked for soy in my drink (not seen as an option on the menu) and they said no problem and did not even charge me extra for the substitute! My stomach thanks you... Then we enjoyed picking out our own tins of the individual chocolate squares...mmm. we got 63 pieces for $20! Score! \n\nSee you next time Ghirardelli!", "author": "Jenelle J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-07", "description": "When I die, this is how I imagine heaven is like but of course without the heavy calories.", "author": "Vinson H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-09-01", "description": "It's so hard for me to give Ghiradelli anything lower than 5 stars. The service was slow at this particular location. The servers mixed up our order with someone else's. \nAlso, I was so disappointed that they discontinued the Goldrush sundae. Ghiradelli no longer carries peanutbutter sauce so they cannot make it. \nApparently there were reports of cross contamination with someone who has a serious peanut allergy. \nI'm very allergic to fish & seafood & I live in the Bay Area. I completely understand having a food allergy. I always tell my server to make sure my food is separate from fish/seafood. \nI don't understand why they can't keep one scooper labeled with peanutbutter & don't let other scoopers or dishes go near. Jamba Juice does this. \nThis Ghiradelli was a regular stop for my hubby and Me when we're in the city. Now we're not going to go out of our way for it.", "author": "K F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-16", "description": "Sundaes are amazing! Our group had the Crissy Field (Cookie bits sundae), Strike It Rick (butterscotch hot fudge sundae) & Painted Lady, Mint Bliss. Everyone was happy with their order. Chocolate fudge is so rich and yummy. Limited tables, but there are counter seats. Service great. Order at the register, they bring it to you. Lots of chocolate to purchase to take home. Only one bathroom and you need to get someone to unlock it for you. It is on a busy street and it is not a public restroom.", "author": "Elizabeth J."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-03-23", "description": "Don't get the mint chocolate chip ice cream. It tasted very powdery. I'm pretty sure it's not supposed to taste that way. This is actually a really cool place, with sort of a johnny rocket's feel where you can sit at the counter and they serve you your ice cream in a little platter, however, the texture of the ice cream really ruined it for me.\n\nThe decor of this place is awesome though. They probably have some better dessert options, and I might go back and try some of their shakes sometime - but mint chocolate chip ice cream - never again.\n\nService here is a-okay too. Not amazing, but not unfriendly.", "author": "Junel S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-31", "description": "I tried to find something that I disliked about the place and the quality of the products and was unable. It was nice to go at night and with a small group of people.\nNot one of us was disappointed by their order. While I opted for the delicious (rich in texture and flavor!), my friends opted for ice cream (which the devoured in three seconds) and a sundae. It was a very good decision and the perfect place to stop for dessert.", "author": "Paola S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-02", "description": "The nicest people ever in one of the most beautiful chocolate shops I've had the privilege of being in. Get the sea salt caramel hot chocolate on a windy night!", "author": "Jon S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-31", "description": "We got the Crissy Field and the hot chocolate which totaled about 18$$$. The Crissy Field is enough to fill one person from hungry to full. It's really a lot and its super sweet but would recommend. The hot chocolate they served was very weird. It was really sweet for the first 5 seconds then became really bitter. Would not recommend", "author": "Justin N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-25", "description": "I stopped here because I wanted to get a free sample and look around. The store is easy to find as you can just follow your nose like toucan Sam. The sample was amazing and I enjoyed it. The store has almost every square of chocolate flavor that I can remember them ever making. I would have loved to have dined here but I was full from another great eats. Next time for sure.", "author": "Amanda K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-07", "description": "I had something to celebrate and I did it with a $10 sundae.\nIt was delicious but way two much.\nOn the way out a homeless lady asked me to buy her one., and I said sorry no cash and she said \"they take credit cards\" you can't make this up you have to live in SF.", "author": "Joe H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-12-06", "description": "Good factory standard for hot chocolate on Market in FiDi. Set next to the Palace, so while it lacks the originating history of the one on the north side of town, it's still situated in a building that's over a hundred years old. \n\nIt's a new location and not all staff are aware about offerings and how to make certain drinks. The tables are often a bit sticky, but there's plenty of napkins to DIY clean.", "author": "Yosun C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-13", "description": "I love coming here whenever I'm in SF. Any city you're in, stop into the Ghirardelli-- the ice cream sundaes are fun and you can't go wrong with the chocolate. I travel a lot for work and I'm always stopping in for ice cream!", "author": "Jessica F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-23", "description": "Warming up.\n\nBumgarner for another monster season: http://www.sfgate.com/giants/article/Spring-training-Bumgarner-throws-first-bullpen-6090399.php\n\nGhirardelli for another monster dessert: Chocolate chip for chocolate chip this is one of the biggest cookies in the city. Perfectly moist and chewy. Bit salty too.\n\nStaff asks if you want it warmed up. Upon tasting the perfection after a few minutes heated you won't want it any other way. And for $5 the price demands perfection.\n\nIt's a championship contender.", "author": "Jason B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-07-18", "description": "You know how you used to eat something in your childhood and you remember it fondly as something that was really good? Then you eat it as an adult and you think, \"What the heck was I thinking?\". That was my experience here the other day. I haven't had anything from Ghirardelli in years, so hubby and I decided to split a salted caramel sundae. There was so little caramel or topping in the sundae, that my husband got up and asked for a little side of the caramel sauce to pour on top. The ice cream is flavorless and we actually didn't finish the sundae. Both of us were so disappointed at how bland everything was. It was much better in my memory!", "author": "Goldi J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-17", "description": "Has a bar, sit down dining area, complete selection of chocolates. Best of all, it's right down my hotel.\n\nRecommending classic hot cocoa for a slightly cooler night. Service is good and take outs are discounted.", "author": "Romella J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-23", "description": "It's a Ghirardelli store so you know what to expect: delicious (albeit a little expensive) chocolate and sundaes. I normally don't get the sundaes, but I love the chocolate. When you walk in, you'll be greeted by a friendly worker offering a free sample. During the holiday season, they give samples of the special peppermint bark flavor. It's so good!\n\nThe location is also very convenient, a literally 15-foot walk from the Montgomery BART station and right by the office. I'll often treat myself to some Ghirardellis after work if I feel like I've earned it.", "author": "Nikhil S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-30", "description": "Richest chocolate you've ever had! The sundae was too good and rich to finish even for 2 people. They show you the process of making chocolate so there's history there. A bit pricey but quality cost", "author": "Kenya W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-30", "description": "Even though it's winter I could not resist ordering ice cream. It was to die for. The staff consisted of mainly young people, but they were nice and polite", "author": "Madeleine S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-24", "description": "Chocolate heaven.  Walls and mounds of chocolate everywhere. Pretty cool to look at. Right as we walked in, one of the workers greeted us and offered us a sample. I think it was milk chocolate with caramel. It was really good. The workers were really nice and helpful. I didn't try the ice cream sundae  this visit but the menu looks incredible. I might have to try it at the other location by the wharf though. And when you check in on yelp it offers you a $1 coupon off any sundae so that's cool", "author": "Tammy W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-15", "description": "Had the cookie bits sundae. I should rephrase that, I split the cookie bits sundae and it was delicious. I had a hard time deciding between the cookie bits, the espresso sundae, and the brownie sundae. I am not sure if there was a wrong call but we definitely made the right one. Two scoops of cookies and cream ice cream with another of vanilla, some chocolates, whipped cream, and cookie crumbles all over it. I don't think you can mess that up. The vanilla itself was pretty meh (and i actually like vanilla a lot) so I would hesitate to order a sundae that was mostly vanilla. Make them substitute that flavor for something better.\n\nThis shop is a nice place to grab some very large sized desserts. They give you free samples as you walk in the door and have a great assortment of chocolates to buy if you are considering an early death for either yourself or your wallet. I will most certainly be back.", "author": "Luke O."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-05-25", "description": "Hadn't been here in years. I was born and raised here in SF. This place was really disappointing. Waited over a 1/2 hr to get in to just place our order. There isn't much for seating and they had the upstairs closed. I ordered a hot fudge sundae that was $9.95, which in my mind is a bit for icecream. We waited another 1/2 hr to get our order, which was already melting by the time they get it to you. The hot fudge wasn't even hot and the whole experience in my mind was a big waste of time and not even that delicious. I wouldn't waste my time waiting again at this place. There are other ice cream shops that taste better and aren't as expensive.", "author": "Ronette B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-18", "description": "Insane ice cream sundays here. Awesome location. The perfect stop for a visiting tourist.", "author": "Andrea C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-10", "description": "I LOVE chocolate! And Ghirardelli chocolate is my kryptonite :) A great place to hang out and people watch and the menu has plenty to choose from. If you're in the area, also check out Ghirardelli Square!", "author": "Stephanie W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-02-14", "description": "Terrible Terrible service,  they tricked me on the price and weight of the chocolates and assumed no blame.  I live in the neighborhood and don't appreciate the bad service.", "author": "Iva L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-27", "description": "Suuuuuper friendly staff! Very clean place.\n\nThe new OCEAN BEACH is A MUST!!!! :-) It is soooooooooooooooo yummie!!!!!!!!! Vanilla ice cream with home made fudge, caramel, whipped cream with salt on top.", "author": "C K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-12", "description": "I am still salivating over my sundae and Bunny wishes that there was one in Cleveland. Great staff and very helpful. Hot fudge is delicious. Clean quickly changed tables. Nothing bad here only good.", "author": "Kevin M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-12", "description": "The Ice cream is so good!!!!  I got cookies and cream ice cream with dark hot fudge on it. I hate hot fudge when its too sweet. Ghiradelli is right on on the sweetness. I would definitely go there again. It was one of the best ice creams I have ever had.", "author": "Ankeen T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-10", "description": "I was in San Francisco, so it was a given that I would have to get some Ghirardelli chocolates and ice cream.\n\nI really liked this shop.  Nice layout for dine-in with separate registers off to the side just for those shopping.  Went with a simple hot fudge sundae, only it wasn't simple in terms of flavor.  Really love the rich taste of the hot fudge and creamy ice cream here at Ghirardelli.  Plenty of table and bar space, and staff was all around friendly.\n\nI helped myself to the free samples when picking up some souvenir chocolates to take home. I went with some Halloween-designed boxes for the kids on my list and went with San Francisco Golden Gate bridge boxes for the adults.\n\nI also created a little baggie for myself to enjoy throughout my trip in SF.  My favorite being the eggnog and hazelnut.\n\nMy visits (2, the second just to pick up more chocolate) here during my trip were in the evenings.  I enjoyed he ambiance inside at night.  Nice, soft lighting and not overly hectic though still busy even around 9pm.", "author": "Irene Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-09", "description": "this is the best location in my opinion. it's never busy and the quality never disappoints! the brownies and cookies are ALWAYS warm unlike the big square at fishermans wharf.", "author": "Taylor M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-07", "description": "Great service and never crowded! I love this location even more after visiting the madness that is the location in Ghirardelli Square.", "author": "Angela C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-17", "description": "My view on Ghirardelli chocolate shops: expensive chocolate sundaes for when someone feels like splurging a bit cause the chocolate and ice cream desserts are delicious!  \n\nThe average sundae's about $10, which I would recommend sharing with someone cause all that sugar gets pretty filling and it's just not as good at the end. Also makes it easier on the wallet. It's not an everyday kind of thing, but maybe once it a while, they're just what your taste buds need to make your day a bit happier.", "author": "Teresa P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-05", "description": "What I Ate\n- Sea Cliff ice cream sundae (chocolate chip cookie, vanilla ice cream, fudge, nuts, and whipped cream) in a chocolate-dipped waffle bowl\n\nWould I Go Again\nDue to Ghirardelli's flagship chocolate and ice cream shot being located near San Francisco's Fisherman's Wharf, I feel like Ghirardelli gets a bad rap at \"touristy.\"  When I think of touristy restaurants, I think of long lines, high prices, and bad food.  When I think of Ghirardelli ice cream shops, I think of the best-ever cookie sundae in the best-ever waffle bowl.  The Colossal Chocolate Chip Cookie lives up to its name--if that massive piece of baked goodness is only half, I don't even want to know how my stomach would feel if I hate the full cookie!  The cookie is delicious, and I'll leave it at that.  \n\nThe ice cream is very good--quality, but nothing fancy.  The vanilla knows its role is to only complement the cookie and waffle bowl, which is does with remarkable ability.  The fudge is, of course, outstanding; however, the real standout here is the waffle bowl.  Perfect in every way and only enhanced by Ghirardelli's delicious chocolate coating the edges.  It is so good that I think it would be perfectly reasonable to order just the waffle bowl, maybe with a glass of milk on the side.  Though, I wouldn't that.  Leave the calorie counter at home and go for the Sea Cliff--share it with someone if you like, but just order it.  I am confident that you won't be disappointed!", "author": "Ben M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-09-28", "description": "Ghirardelli is my wife and I's favorite ice cream stop. I always get a single scoop of espresso chip with dark chocolate fudge. The wife always samples something different.\n\nMy biggest complaint is that they ALWAYS get at least one thing wrong. Most of the time the people taking orders are barely paying attention to you. Especially if you do any customizing of the standard menu. I've gotten to the point where I expect something to be wrong and I just complain or ask for what I actually wanted when they bring the wrong thing. Every once in a while they have some punk kids working there who are rude.\n\nI will always go back though. The sub-par service doesn't matter, I want my fudge!\n\nupdate: I've been to other locations where they don't make mistakes. It's really only this one. But i'll deal with it since i'm near by.", "author": "Aaron S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-04", "description": "A good sized store on Market.  This place is where you can get your sugar fix.  The hot fudge is really good. I would recommend the hot fudge sundae if you're hungry. If not, get the single scoop sundae.", "author": "Brian C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-31", "description": "Yummm! We went here later for our sweet tooth craving. We seemed to have just beat fans returning from a baseball game. The line became long really quickly. \n\nWe shared the sea salt caramel sundae. It was more than enough for the two of us. Delicious!", "author": "Alicia A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-09-18", "description": "2 stars for the sweet tooth craving.\n\nI went in after a sort of slow day for myself. Born & raised in this city, paying the ever growing rent, you have to imagine days off are spent recovering And getting ready for the next work day. I cAme to ghirardelli to reward myself After a very arduous work week.\n\nThey ran out of numbers during my transaction, when the cashier(Wendy) was offered a number to assign me she passed on it. She informed me that they would \"scream out your name from the middle of the bar\" and swiftly told me that my sundae would come in glass. I look forward to these events for myself. The cold ice cream, hot fudge, sweet cherries, and light whipped cream are what makes the nostalgia come over me as I savor the flavors.\nI finally find a seat and patiently wait only to see the few patrons in front of me receive their confections in glass, metal dishes, real spoons. So, when I heard my name being called out I happily made the trip to the bar only to be carelessly handed my dessert in plastic. I took what I paid for and enjoyed it. I then see patrons that were behind me receive their dessert in glass, with a smile, and friendly service.\nAll I got from the server, James, was a sort of \"take your sundae, be happy we made you one, and get out\" service as he joked with his co worker. I saw James prepare a sundae for 2 young ladies very very carefully. And here I was 2 bites into my sundae and my fudge was frozen over, hard to chew, and running over. Plastic does not hold the fudge over as glass. As I struggled to eat with my plastic spoon I just felt sad. Here I am, working hard to make a living in the city and the one time I feel to reward myself I get looked over on the one thing I wanted to enjoy that day.  I will not bring my money back to spend here.  The managers really need to take into consideration that consistency in service and what they put out remains in the heads of people who frequent this establishment. Why wasn't I given a number? How come I didn't get it in a glass? The supervisor, young Filipino man with a pony tail And the manAger,  should see the value in consistency and coming thru on what you say.\n\nWendy.... If you say something is going to happen AND you take the customers money right after, it's better you don't lie. And when you see that your word wasn't enough, correct it. That's great customer service.\n\nJames... Next time don't rub your face and hair without washing your hands before assembling food. Not only is that a health code violation but the fact that it's a habit cements the idea that I shouldn't spend my money here because you are not sanitary.\n\nSF blue collar local since '86.\nNot some rich techie from Google.", "author": "David C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-14", "description": "Love this shop. Service is always great and they give you little pieces of chocolate when you walk in (don't get too excited it's the sea salt caramel one). My coworker and I always come here for a treat after a long hard week. Use yelp $1 discount if you can!", "author": "Ameera D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-21", "description": "It's a bit of sensory overload in here, but the ice cream is great.  I had a scoop of chocolate and a scoop of mint chocolate chip in a chocolate covered waffle bowl with hot dark chocolate sauce (and a double espresso).  Zing!!", "author": "Tim A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-11", "description": "Yes, this is a touristy spot but this is somewhere you need to get off the bucket list. And like all touristy places it is pricey. There are a plethora of ice cream shops in SF, but I enjoy visiting Ghirardelli's Ice Cream and Chocolate Shop. It is a a fun and unique SF experience with a nice/interesting environment. Come here to get your chocolate fix. Their Warm Brownie Sundae is amazing and my favorite. The staff is pleasant and courteous.", "author": "Soroosh A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-08-31", "description": "Super touristy! You can just get a better hot chocolate from any local cafe; for chocolate; walgreens offer a cheaper price.", "author": "Joelle K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-28", "description": "This place would've gotten 5 stars if they updated their ticketing/delivering of the orders.  If you choose to sit-down, you are given a number and usually end up on a mad hunt trying to find a table to sit down.  Once you find a table, it's a waiting game.  Your icecream is delivered to you by their workers dressed with little Ghiradelli hats and gloves.  It's really quite cute but I'd give up that little novelty if it meant my icecream will be delivered straight to me without any melting.\n\nSF is obviously known for Ghirardelli Square so going here is an absolute must for everyone! The icecream is delicious and I ALWAYS go back for the Very Berry Sundae.  What I came to realize is that the \"To-go\" portion is significantly larger than the \"Sit-down\" portion because of the containers they serve you.  Each icecream entree runs around $8-9 but if you check into Yelp, you'll get $1 off a sundae (which is nice).  Don't forget that you can choose what flavors of icecream you want in your order if you don't want the \"stock\" flavor.  This place is ALWAYS packed so be prepared to wait!  \n\nMy bf and I are absolutely addicted to this place ever since we moved here to SF.  Because of the price, we are trying to limit ourselves to coming here only 1x a month :)\n\nupdated: The Very Berry Sundae is officiall discontinued :( The visit when I discovered this, I ordered the traditional hot fudge sundae instead...and well...it was just as wonderful!  BEST icecream spot ever!", "author": "Anna G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-20", "description": "Visited TWICE the two days we were in town! It was that good! Get the 'Treasure Island' it's a hot fudge sundae with a brownie!! It's the BEST! The chocolate is so fresh and rich! I recommend the treasure island because the 'world famous sundae' only has ice cream and hot fudge, it's missing something, hints the brownie! You won't be disappointed with the Treasure island! Also, a new favorite is the 'Lands End,' it's caramel, hot fudge, vanilla ice cream, 2 brownies& whipped cream& a cherry! YUM!!!", "author": "Katie J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-20", "description": "If you love chocolate & ice cream, definitely come here to give it a try! Totally worth it  I had the treasure island and the brownie was amazing. It's a perfect combination with the ice cream and the caramel", "author": "Chelsea T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-07", "description": "This place is at a great location. Close to both muni and bart :) It provides shelter and sweets when you're exhausted and waiting for someone to pick you up!\n\nThey have really good sea salt hot chocolate- a must!", "author": "Jenna L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-19", "description": "I had the Chocolate Malt... YU--MEEEEEE!! So rich and delicious. It's $6.25 (ouch) but worth it to me. A good quality malt.\n\nNice clean, good presentation, menu at the door, nice and friendly staff.", "author": "Wallace A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-29", "description": "Love this place.  Might have been one of the best basic awesome Hot Fudge Sundae's I've ever devoured!  Great place to inhale ice cream and people watch in the city.", "author": "Mel B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-10-04", "description": "Great place to have ice cream with lots of toppings.  Wait time is not bad given number of people that eat here. Gave them a 3 due to service attitude. Felt like I was on a manufacturing line. If you don't know what you want then you have to step aside and let next person go. Everything is rushed with no time to be friendly.  And when I reminded server that I ordered water I waited 10 mins for another server to get bottled water.  Great place to visit but don't expect that warm, fuzzy interaction with the servers.", "author": "J S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-19", "description": "A local favorite that is a bit too close too home for me. It's way too tempting to walk past here and not stop in. They always give out free chocolate samples. So even if you don't buy anything you come out satisfied.", "author": "Brian F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-13", "description": "Yummy yummy yummy real ice cream with Ghirardelli hot dark chocolate fudge = such a delightful treat.", "author": "Anna K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-12", "description": "Everyone working here is friendly and welcoming. My son was in heaven because, well....CHOCOLATE. They offer samples. We had ice cream, and it was delicious!", "author": "Amii P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-11", "description": "Not surprisingly, the Ghirardelli chocolate ice cream tastes pretty legit. And, you get a free mini chocolate square just for stepping inside. America.", "author": "Maximillian M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-12-23", "description": "I pass this location every day on my way to work, thinking, \"those blue lights are so pretty, and I bet everything tastes so good...\" when finally this weekend, I was doing some holiday shopping in the city and there were a million and one Ghirardelli people hitting the streets passing out Peppermint bark! \n\nAfter nomming on a few, I knew I had to get more! I went to the location inside the Westfield which had a limited assortment, and a great deal on Milk CHocolate Peppermint Bark in a huge 80ct bag for $25! BUT I wanted Dark Chocolate Bark for my dad for Xmas.... they didn't seem to want to help me out so I went over to the New Montgomery location, was happily greeted by a nice gentleman, and then they too did not have the 80ct bag in Dark Choc, but the gentleman hand counted 80 pieces and created a bag just for me!\n\nExcellent Customer Service. Excellent Street Marketing. Excellent Product!", "author": "Katie K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-11-15", "description": "\"This is HEAVEN,\" said the Little Niece.  What sparked that statement?  Was it the free sample of Peppermint Bark?  Was it the Presidio Passion sundae with strawberries, hot fudge and amazing whipped cream?  Was it the strawberry Quake Shake made with an entire chocolate bar blended in?  And not a puny chocolate bar either.  It looked like a massive 3.5 ounce one!  No matter.  She is a child after my own heart.  She, her sister and I will definitely be back!", "author": "J. P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-06", "description": "It's exactly what you probably expect .. Delicious ice cream sundaes in large portions that are pretty over priced.. But when in Rome!", "author": "Patricia M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-02-14", "description": "This is an amazing place!  I  was here once when I visited some friends in San Francisco.\nThe place has such a wide variety of treats I had no idea where to start. I had a delicious hot chocolate and it just tasted amazing.", "author": "Mayra S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-07-28", "description": "I'm writing because I can't believe how they trick their customers. I bought two boxes of chocolate that I didn't know were expired. I was visiting SF and bought them as gifts. I took the price tag off of one box and saw that they were expired. The same thing happened with the other one. It's upsetting that the store is selling expired chocolate but even more appalling that they tried to cover it with a price sticker. Truly disappointed.", "author": "Jong L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-04-17", "description": "Decent ice cream sundaes with many combos to choose from! The exciting parts of these sundaes is that they use Ghirardelli chocolate as the sauce. We ordered the intense dark chocolate and mint sundae in a waffle cone and it was good (if not a bit too rich and sweet). Overall, good experience.", "author": "Jan Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-24", "description": "Love this place!  Less crowded than the original one at Ghirardelli Square.  The sundaes are the best and the prices are reasonable.  Today's visit had even better service than usual.  We were greeted by someone at the door with samples and when there weren't enough seats for an extra guest an employee offered to get us one.  Great service, great food.  :)", "author": "Tony K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-22", "description": "The place was super clean, everything was organize and the staff was friendly and helpful. It was somewhat pricey but it was worth it since it's a name brand chocolate. I found a coupon on yelp. Downloaded it and print it out. The coupon really works. It made be a hassle to download it but it worth it because everything is really pricey. I would come back to buy chocolate for  special occasion.", "author": "Chris Y."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-07-24", "description": "My daughter ate butterscotch icecream and I chose banana split icecream: Both were okay. Butterscotch was too sweet: Very lacking in flavor. Banana split was okay. Portion was huge: I shared it with my husband. I wish the ice cream was more flavorful than it was. Be aware of the long line that you need to endure. If you are in the area, it may be a good idea to nap at the Ghirardelli square, which is a unique experience!", "author": "Ana T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-20", "description": "Awesome place to check out to splurge on a ton of sugar (definitely worthy of a cheat meal!).", "author": "Juan A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-19", "description": "Such a cute little spot. The shopping center is full of festivity during the holidays. It's a great date spot of place to go with the family. Service here is wonderful and the ice cream is delicious!", "author": "Laila W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-03-23", "description": "The best cost/benefit at the store is the golden box. If you arrange the chocolates like I did in the picture, you can take home 18 squares and 13 minis for $12,50 plus, of course, the very nice gift box :-)", "author": "Andre D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-02-09", "description": "The stairs up to this place are a killer. But if you need a workout before gorging yourself on ice cream and chocolate, then you're in the right place! Way too overpriced, you're paying for the brand name. The greeter at the door gives out little chocolate samples which was nice, though. Also, the floors are bowing which is a little scary. They might cave in someday!", "author": "Tiffany M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-12-28", "description": "This is a nice, new place in the Palace Hotel in what had been a clothing store.  It is attractive and the staff friendly.  They have ice cream, cocoa, and they sell Ghirardelli chocolate (mostly the small individually wrapped squares), all of which is nice to have available.  They hand out squares sometimes and it is nice to be able to buy individual ones to try different flavours or mix and match.  That said, the ice cream items and hot chocolate seem to be a bit crudely prepared with a heavy hand and very, very sweet with little flavour otherwise.  I haven't tried the special hot chocolate that one mixes onesself, though, and that could be better.", "author": "Wulfstan C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-13", "description": "It's an iconic must for anyone visiting San Francisco from out of town or just across town. Is there better icecream? Sure, but it doesn't come with the view of the bay and the feeling of SF. The sundaes only come in one size: huge (expensive). Make it a meal or share with someone. They have a lot of chocolates for sale. This is not the best deal. You can get their chocolates anywhere for much cheaper.  However, take home a bottle of their caramel sauce; it's amazing.  Make sure you take advantage of the chocolate samples they hand out as you enter. They're handy for when you need a reminder of that sweet trip you had.", "author": "Ashley B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-03-11", "description": "It's good and definitely a nice experience. I got the strawberry fudge sundae and at $10+ it's nothing that amazing.", "author": "Jenn R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-30", "description": "great shakes! Enjoyed a to go order. The store needed a little TCL and cleanliness, but it was also closing time. Friendly staff. Cool names like Lakeya...", "author": "Matt B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-01", "description": "Excellent place to have a chocolate flavored products. Only thing is long wait in queue", "author": "Satinder S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-25", "description": "The place is pretty clean, the staff was friendly, and the price was expected.  They offered us free samples of chocolate while we waited in line, which was nice.  My girlfriend and I had the \"Treasure Island,\" which was really tasty and satisfied our sweet tooth.  Overall a pretty good experience.", "author": "Ryan W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-19", "description": "Kind of expensive due to the nature of place - it being so touristy and it's Ghirardelli. After a little wait in the line, I ordered my banana split. It was so crowded that it felt so impossible to find seating at this place but we managed to grab a table. My order came pretty quickly and enjoyed it immensely!!!", "author": "Hiromi I."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-03-31", "description": "I was so disappointed! We had the famous hot fudge ice cream Sundae . The place was packed and we waited a really long time so I expected awesome hot fudge on my Sundae. This was not the case! I make better chocolate sauce at home! The hot fudge was thin, there was barely any there and it wasn't even warm. I am surprised this place gets so many great reviews. I don't mind waiting for great food but to wait all that time for a mediocre Sundae...totally not worth it.", "author": "T D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-28", "description": "i took my date to a place where it's predominately known for it's ice cream/ milkshakes/sundaes. \n\nshe opted for the hot chocolate. THISSSSS chick. same thing happened for that one time we went to a pho joint and instead of getting the typical beef/ combo meat pho, she opted for CHICKEN pho. who da heil orders a chicken pho?! what da heillll ?!  then again, to be fair, i guess why the heilll was it on the menu to begin with, right?! hahahaha \n\nw/e i can't complain, it was pretty good, it was cold that night sooo i guess she had a point. \n\nnote for dudes: there's this area behind the store where yall can go strolling or bench sitting afterwards. great scenery. chicks love great sceneries.", "author": "Thankie S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-05-29", "description": "The sundaes were okay but nothing special and really expensive. One scoop with hot fudge $5.50 okay since we are on vacation but I would be surprised if locals ever ate here.", "author": "Kathy D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-01-06", "description": "Large shop with all the candy and cable car candies you could imagine. The huge sundae was great for 4 of us to share. A bit over priced though we figured it would be due to it being a tourist destination.", "author": "monya b."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-15", "description": "I got a flavor full butter pecan sugar cone for $4 I said single scoop because it's cheaper but the man hooked it up with two scoops. My mom got a single scoop mango sorbet and that was too sweet even for me but I enjoyed it. My brother got a nob hill chill for $10 so watch out every 16oz drink is $10. Long lines and usually one guy doing everything by himself. It is worth it here.", "author": "Sovenne O."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-05-06", "description": "I live in SoMa and went in to buy several boxes of chocolates for gifts for an overseas trip. As I was peeling off the price I noticed that a few of the boxes were past the expiry date! I called Ghiradelli and was told that the manager would call back but he didn't so I ended up going back into the store - the manager then proceeded to tell me the expiry is just a recommended date and that they are still fine!! Shame on you Ghiradelli for trying to sell expired chocolates! Especially for full price! Disgusting behavior!", "author": "Michelle S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-23", "description": "It is a nice place. not for me, though. Line is way too long and I can buy their chocolates in CVS for cheeper", "author": "Anya V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-02", "description": "total tourist trap, but the ice cream is delicious and totally worth the wait and the calories.  and the servings are HUUUUUUUUUUUUGE.\nand you can get the special ghiradelli seasonal flavors too!", "author": "Liz C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-05-15", "description": "Holy cow this is super sweet!! honestly though, what you expect??? Family was visiting from el monte, and being touristy, they wanted to go in ghirardelli. Almost everytjing here has caramel sauce or chocolate sauce yuck. Banana split was good, but too much sweet. My  shake was also very good. The light brown sauce is apparently was salted caramel....the people were really friendly and there's free sample in the shop. I only gave it 2 stars because it's way too sweet for me. It's a dream come true for people who want diabetes or someone with a sweet tooth. Waaaay too sweet and it took awhile for our orders to come. Try out the giagantic banana split.", "author": "Evelyn L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-02-16", "description": "Wasn't what I thought. A tourist trap for sure. What was pleasant was we order a fudge sundae and a banana split and neither was too sweet at all. In fact lacked a little sugar and I was OK with that.", "author": "Kks78 S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-16", "description": "Delicious ice cream, lots of seating and is open late in the evenings! This is the perfect spot to go with friends after dinner in the city", "author": "Mel P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-26", "description": "I'm sure there are better ice cream places but this is one is a great tourist trap that's worth a try. The waffle cones and banana splits were excellent.", "author": "Malachi S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-06", "description": "My best friend and I have been here at least three times around 9pm after class. Even though they close at 10, they always let us order a sundae. Their service is very fast, and their sundaes are to die for! If you have a huge sweet tooth and don't mind paying 9 dollars for a sundae, this is the perfect place for you. One sundae was perfect to share between the two of us. \n\nWe've tried the Haight AshBerry, the Cable Car, and the World Famous. All three were 5 stars in my eyes.", "author": "Christel L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-11-07", "description": "I had the best chocolate chip milk shake that I could ever dream of!! This place ROCKS!!! Oh and not to forget that my co-worker also had a cookies and cream milk shake. We could barely drink them, the milk shakes were soooooo thick and yummy...and today was a great day to have one.", "author": "Mae D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-02-10", "description": "I can't believe after 15 years of living in the city.. I finally took my visiting parents to eat here! It is a very cute square with fountains and lights at night. A hop and skip away from Pier 39 it is a great place to visit during the day or at night. They have plenty of shakes and desserts to choose from. It can get a little crowded but who doesn't love to people watch?", "author": "Yennie N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-15", "description": "The ice cream is a whole other breed here! All of the toppings are top notch! we had the butterscotch sundae and classic fudge sundae with a waffle bowl. It is a little spendy, but you're absolutely paying for the name.", "author": "Chandra M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-03-20", "description": "30 minute wait for a $10 hot fudge sundae. This place gets by on its reputation as a tourist destination not quality or value.", "author": "Lynne S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-02", "description": "Great location!! A little expensive probably but portions are meant for sharing.", "author": "Joy D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-06-21", "description": "very expensive for ice cream and chocolate. the ice cream is straight out of eddys grand ice cream bucket you can get in the supermarket. if this was not a tourist attraction i definitely would not recommend going.", "author": "Warren L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-07-05", "description": "I have gone to the location in Ghirardelli Square and had an awesome experience. However when I walked into this place I immediately smelled the dirty rags that are used to wipe the tables and counters. The service was excellent as was the sundae, but I couldn't get over the smell! I wish I asked for the sundae to go. Also, the spoons that came with the sundae were sticky. Everything needs a good scrub down!", "author": "Melissa S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-10-21", "description": "I used to like this corner chocolate gift shop. But the service is growing worse and worse. I ordered an iced coffee but received a hot one in a 85 degree day. I used to have yummy hot chocolate almost twice a week in this shop. Sadly, they don't do semi/sweet. And this is fine, I can accept intake extra sugar, but the service is really disappointed nowadays. Hopefully it will get better.", "author": "Lisa C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-21", "description": "Ice cream was delicious!!! went there with my daughter, she loved the place and of course the ice cream. The parking could be better but what can you say its SF. but over all the place was nice, great customer service.", "author": "Hamed A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-23", "description": "You're definitely paying for the name. Got a huge brownie sundae for $11 after tax, and it definitely filled my sweet tooth craving but wasn't as amazing in taste as I anticipated. Convenient location. But I'd definitely rather go a little more out of my way to get a more memorable cone.", "author": "Mina C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-23", "description": "Great location by the pier and the chocolate is always so rich and delicious!! The service is good and the desserts came out in about 5 minutes.", "author": "Deanna L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-24", "description": "Can't go wrong with ghirardelli chocolate or ice cream!", "author": "Elizabeth P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-04", "description": "We went here tonight and had a fantastic experience! I've been here twice before but not for a long time. Our group got the salted caramel sundae, brownie sundae and frozen hot chocolate with ice cream. All delicious! The frozen hot chocolate was kinda wam when it came then became room temp, so I wouldn't really recommend it. Regular hot chocolate is great though! All of the workers were very friendly and helpful!! Catherine brought us our desserts and she was great! I asked the guys at the sundae to go bar to heat up my \"frozen\" chocolate and they gladly helped me out!", "author": "Lindsay B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-28", "description": "Treasure Island sundae hit the spot. Very rich and a free chocolate sample as we walked in the door.", "author": "Adam R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-12-23", "description": "I was so excited to have a hot chocolate date with my son today at Ghiradelli's. Service was prompt but the Hot Chocolate was disappointing and we left after a few sips. The drinks were cold, and I should have picked out the cream, because it just became worse.  The cream was sticky and not fluffy.  \n\nWorse hot chocolate I ever had.", "author": "Marianne G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-04", "description": "Came in at 9pm expecting a shit show.  Surprisingly not that busy, I was greeted immediately and handed a mini chocolate while listening to the special.  Ordered and almost had my sundae before sitting down.  Experience made 5 stars thanks to exceptional service", "author": "Shawn B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-17", "description": "Stayed @ Palace hotel and this was connected to it. Staff was nice and there was a nice big selection. Right out of the Bart station + no line! yay", "author": "Tiff W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-25", "description": "Pricey but delicious. Really enjoyed their dark chocolate fudge on my sundae but didn't care for the brownie which is odd because we always buy their day brownie mix at home.\nI was also expecting a better ambience given that it is a tourist attraction.", "author": "Rosemary T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-31", "description": "Ask for light fudge if your item has fudge in it. They use way too much fudge IMO otherwise it's good.", "author": "Daniel C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-01-28", "description": "The ice cream itself is pretty run of the mill, but the hot fudge that goes on it is what makes it all worth it. There are a few downsides though. For one, desserts here are pretty pricey. Also, they tend to forget to make the requested substitutions (although this aspect has gotten better since they got rid of that one cranky woman that used to work there). Lastly, it seems like the size of the brownie in the brownie sundae has gotten smaller, which is a shame for my taste buds but perhaps a blessing to my waistline. xP", "author": "G C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-23", "description": "Love this place! My friend and I decided to stop in for some hot coco before heading home down to the South Bay. What a treat that everyone was still in a good mood and super friendly (even nearing 10pm when most folks working in the city get crabby). Carl in particular was an absolute dear. Great environment, we'll definitely try to stop by whenever we go back to the city. :)", "author": "Jen N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-12", "description": "I enjoyed being here with my family during Thanksgiving week. However, it was really crowded as always. The line was so long. Secondly, there was no room to sit indoors because all the chairs and tables were taken. But I think that just says how popular this place really is. I thought the location was ideal for anyone wanting to get into the San Francisco vibe. It's a few blocks away from the pier area, which also provides a great view of the newly modified Bay Bridge. Absolutely stunning! I've seen and drove through that bridge for a good chunk of my life and it surely has come a long way. I think it's best to walk and/or take public transportation considering the sky high garage rates and street parking being limited. Furthermore, I think WI-Fi as an addition would be a complimentary service for guests.", "author": "Rachel P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-09", "description": "Had the Cable Car. Amazing stuff. Chocolate ice cream with little marshmallows in it. Was not too expensive, and it was more than enough for two. Definitely recommend.", "author": "Rohit M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-02-01", "description": "good dark chocolates bars. hot chocolate is very very sweet and bland. probably very similar to the quality you could get at mcdonalds. extremely disappointing for a \"world class\" chocolatier specially  5.25 per cut.", "author": "Jonathan F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-08-04", "description": "Update on an update - FINALLY got a response from Ghirardelli Corporate Offices, albeit late, it still came and was genuinely corrective in nature.  Many apologies to my original difficulties, that's not how our Corporate culture works, etc., but they backed it up with some gift certificates and a rather nice chocolate treat basket delivered to my front door.  They didn't have to do that......but they did, and it is only right that I acknowledge them for it.  Haven't had the chance to make use of the gift certificate yet (although it's on the radar), and we happily devoured the nice gift basket, so thank you Ghirardelli in recognizing a service misstep and you took action to compensate a customer on a whole lot of inconvenience - nice job.", "author": "Kevin C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-05-31", "description": "The main store in Ghirardelli Square is better. The waffle cone tasted like very watered down batter (which it was; we saw the pitcher of batter later). Ice cream was fine.", "author": "Susan Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-09", "description": "Amazing.   Hands down, the best damn hot fudge Sundae in town.  Very happy they opened a downtown location.  Staff is very polite.  The chocolate toppings for the sundaes are phenomenal.", "author": "Sunny J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-24", "description": "Yummy yum yum hot chocolate , a short stop on my way to work.  Yes, a little pricey but it makes me happy!", "author": "Pam S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-11", "description": "Always a must stop for our family.  It is always high quality and we can share a couple of sundaes for our family of four.", "author": "Sean W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-05-01", "description": "Some of the grumpiest people - the 2 girls behind the ice cream counter - work here. When manager was notified, she didn't quite seem to care. Henry and the door guy were the only nice guy working there. Only redeeming fact were the ice-cream and chocolates.", "author": "Kevin T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-11-03", "description": "Simple chocolate sundae cost $7.05 ans was worth every penny.", "author": "Roger H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-02", "description": "omg what a nice cap to the evening. we had a nice, romantic dessert together at this fine chocolate and ice cream bar. fantastic!", "author": "Frank G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-12", "description": "We were met at the door with a smile and a signature chocolate square - sheer bliss!  Then we were left to browse in the huge chocolate store and after a time, the attendant approached and asked if we had any questions about the menu - yes, lots!!  We ordered to-die-for sundaes, wonderfully warmed brownies and tall, very tall, lattes that didn't leave us wishing we'd ordered a double shot.  Everything tasted other worldly, the chocolate everything is really without equal (which I can say because I live in Australia ...)  Definitely a highlight of our holiday in the States and a great first day exploration in the great city of San Francisco.  If you want a really first class chocolate hit don't go anywhere else, come to Ghirardelli's!", "author": "Marama G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-29", "description": "A strange thing happened at the Ghiradelli store on New Montgomery.  The chocolate was great, of course.  It's Ghiradelli!!   I went there to purchase three $20.00 packs of chocolate.  In the store, there are cellophane bags which are used to personalize individual chocolate.  I took five of the bags so I could divide my three large $20.00 bags.  When I went to the counter, I ask the clerk if I could have the five cellophane bags or pay for it.  The manager was there and he instructed the clerk take back two of the bags, stating \"you're only allow three for free\".  I was taken back since the cellophane can't be worth more than $0.01 each.  Regardless, I offered to pay for it.  I think Ghiradellii needs to have better training of their managers to make sound business judgment.   Otherwise, the place is great place to buy chocolate.", "author": "H S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-15", "description": "I gotta say, their chocolate chip cookies surprise me in a good way. When I'm looking for a cookie with a soft chewy, almost raw cookie dough center, Ghirardelli's is my go-to.", "author": "Aiko S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-04-28", "description": "I stumbled into this store the first time when I was staying at the adjacent Palace Hotel on the day after they opened.  I forgave some of their missteps because the place was brand new.  However, we recently visited again - about 6 months after opening - and this place still seems a bit befuddling.  We place orders for sundaes and were told they would have to served for us \"to go\" because they were out of the glass sundae dishes.  Somehow I found this hard to believe since there were dozens and dozens of them lined up behind the counter.  Whatever.  So we got our sundaes and sat down to a couple sticky tables and a stick floor.  I guess they don't wipe/mop around here very often.  Of course, the sundae was fine, but nothing out of the ordinary.  I don't get the whole concept of the retail store either.  It's all Ghiradelli squares of one variety or another packaged about 50 different ways.  Why would you buy the stuff here when you can get it in nearly every grocery store in America?  This place better find a differentiating reason to exist or else it will hit the skids....fast.", "author": "Ryan W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-23", "description": "You can never go wrong with Ghirardelli. I had the regular fudge sundae and it was amazing. I also tried the new cookies and cream chocolate square and I want more. Nice place to hang out and get your chocolate fix. Service was fast. the place has a few small tables but lots of counter space. I plan to be back soon.", "author": "Annie W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-25", "description": "I had the best dark chocolate milkshake here. Also the staff was super friendly. I definitely get the feeling that they are catering to tourists here as the friendly staff reminded me of the kind of reception I get at Disneyland which is something I can get used to!", "author": "Caroline G."}
