{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-04", "description": "Wow, what a pleasant surprise to find this little gem in the waterfront area! Dropping in for a late dinner, we really appreciated the quality of the food, drinks and service.\n\nThis is an informal and small place - seats perhaps 30, with more room outside - with a well-crafted menu and drink selection. Decor is a mix of bar seats at counters, and simple modern walnut tables for groups of 2 or 4. It was apparently quite busy most of Saturday night, but several tables were open when we dropped in at 9:30pm. I imagine it gets quite loud when full, but the ambiance was relaxed and fairly quiet for our late dinner. Some very interesting reggae was playing in the background, just enough to set the space, not too loud for conversation.\n\nWe loved the food. Both the margarita and paloma were excellent, and we had both al pastor and fish tacos plus a salad for dinner. All were fabulous. \n\nThe staff were warm and friendly, even after what was apparently a long busy evening. There is a very lively local bar next door, so I can easily imagine going here on a date night, and hanging out next door afterward. If the weather is warm, the outdoor seating is a nice option.\n\nAnother nice surprise...nothing is disposable! Cloth napkins, metal straws for the drinks. This is a green business. We'll be back.", "author": "Tom C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-11-05", "description": "Rude service will prevent me from ever coming back here. \n\nI was excited to try this place after the good reviews. But when I sat down in a nearly empty restaurant (two other people were there) and was treated immediately with contempt and hostility by the hostess/waitress, I walked out. \n\nGreat job losing a customer when you were almost empty. If you keep chasing out potential customers, you'll fail miserably.", "author": "Raj S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-03", "description": "Calling this place \"like tacolicous\" is an insult Glena's and an underserved compliment to tacolicous. \nThe chips were hot and fresh-made with incredible salsas and great guac.\nThe tortillas were handmade making the tacos themselves stellar. \nThe salad was great. \nEverything a nouveau taco bar wishes it could be. We will be back.", "author": "paul k."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-05", "description": "Good service. Great tacos. Al Pastor and fish are tasty. Chips are made fresh. Try this spot!", "author": "Kevin W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-02", "description": "Lordt! The tacos were aaaaaaaahmazing! I was looking for a chill street taco place (or even a taco truck) where I could grab a quick bite. This wasn't it. This is more of a sit down restaurant but the tacooooooos are made well! \n\nSmall inside. Service was excellent!", "author": "Tasha T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-06", "description": "I live close by this place and always see it packed.  Came in on the weekend for lunch. The people and service is awesome. The seating is cozy but not cramped. Lot of room and privacy to enjoy your meal and talk while being able to hear everyone at your table. \n\nI got the three tacos: pescado, al pastor, carne Asada. The tacos were amazing. Coming from San Diego, I didn't think I'd find tacos this good.  Also got the guac and salsa. Guac is a tradition guac with no frills. The salsas that come with it are a really nice and refreshing salsa verde, a roja that had a Smokey kick.l, and a habanero. The habanero was pretty spicy and had a lot of flavor. The salads are really good here too. You get a massive bowl that has a nice crisp and refreshing flavor of cilantro and a vinaigrette which I couldn't put my finger on. However it was super good. For the food alone, I'd say this is the best Mexican I've had here so far. \n\nNow for the bad part. This place is pretty expensive. Almost $15 for guac and salsa is pretty crazy. It's like one avocado worth of guac. Looking at the menu it kinda looks like guac salsa and chips is 7.25 but it's really 7.25 extra. It's good but maybe not $15 good. Also the black beans are really good but they are $8. I'd say if they cut the price of the sides and salsa in half I'd go there all the time. But for the price, I'd probably only go every few months. With drinks and food, it's easily $100ish for two.", "author": "Mark W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-07-15", "description": "What a disaster of a restaurant. I guess people go here because there isn't much around. Looking back at the old menus they have consistently raised their prices. Tacos are now upwards of $6 for most of them. Such a shame when SF has so many affordable and fantastic places\n\nThe tacos themselves are also subpar. While the al pastor taco is actually fairly tasty, the cod taco tastes like cardboard. No flavor at all. Combined these high prices and subpar food with poor service and that is Glena's.", "author": "Eric W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-14", "description": "The cocktail menu has grown significantly over the last few months. I had the coconut horchata with bourbon and it was great (and very coconutty!).\n\nThe pastor is still some of the best I've had in CA, but they lose a star from my last review because of the 3 tacos I ordered, the menu said 2 of them came on flour tortillas, but all 3 came on corn tortillas.", "author": "Jeffrey S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-11", "description": "A good neighborhood hang out with good drinks and nearly no carb free diet options. Still, we found somethings that I could consume and we spent a heck of lot of time drinking and catching up.\n\nThe strange thing about coming home is that you don't remember where home is and where you are going next. I often find myself lost in hotel rooms and pondering which city I live in. I also found the entire experience of drinking in the middle of the afternoon a bit bourgeois behavior. \n\nSalsas are nice and spicy. Food in general is very tasty. Good atmosphere, not rushed, a good place to go and hang out with my girlfriends after I've been gone from this country for an entire month.", "author": "Victoria E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-20", "description": "Love this place!! My favorites are the carne asada tacos and the fried chicken torta. So yummy. I don't think I have had a sandwich quite like the chicken torta here. The chicken portion was massive and the bread was nice and buttery. There is a black bean spread that is just dynamite. A bit messy when eating it but I thought it was worth it and I enjoyed every bite. Pretty good portions although it is a bit on the pricey side. Drinks are expensive and everything adds up! Drinks are 10-15 bucks each and even the Coconut horchata is 6 dollars (although it's good).\n\nGlena's doesn't have an extensive menu, but what they have is of good quality and taste. Can't wait to go back. Plenty of parking and there is usually a bit of a wait, but it usually isn't too bad compared to places downtown or Hayes Valley.", "author": "Cicely T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-21", "description": "I came here after work around 6 p.m. on a Tuesday with some co-workers. We were pretty much the first people to show up, there was maybe one other group of two at another table. The size of the establishment in general is on the smaller side, that's alright with me. The server was very prompt and serving us and asked us what types of drinks he wanted. \n\nWe settled on the pitcher of a margarita which was $42; the pitcher of margaritas is overpriced. The picture itself is smaller. And you can maybe get a cup and a half each. All together that's maybe for glasses and change in total. $10 4 a glass of margaritas which isn't the biggest class anyways is overpriced.\n\nThe food is very good. We got one of the salads to share along with some chips and dip. And each of us got our own tacos. I got the taco with the pork shoulder, I can't remember the name of it and the fire hot dog. The chips and dip is probably where it's at. They give you avocado, and three different types of salsa. The salsa ranges from mild medium to hot. I'm not a huge fan of spicy food, I like it but I'm not in love with it, the spiciest salsa was very hot to me. The hot dog I was expecting to also be very spicy. But it wasn't, surprisingly.\n\nOverall the vibe was a good place to head for some happy hour after work. There isn't an official happy hour at this establishment. Other than the pitcher of margaritas everything else was relatively fair-priced. That was the only bummer of the outing. Otherwise I probably would come back just to hang out with some co-workers. The food was very good and delicious.", "author": "Mark G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-22", "description": "3.5 STARS\n\nAfter drinking somewhat nearby, we decided to head to Glena's for dinner. My group of four arrived on Wednesday, October 4th around 7:30pm. It wasn't super busy, so we we sat at the table to the right of the entrance. The space is rather small, so we got lucky on a random Wednesday night.\n\n*AL PASTOR: Flour tortilla, marinated and grilled pork  shoulder, charred onion, cilantro, pineapple & salsa verde ($5) x2\n*PESCADO Taco: Corn tortilla, grilled fish, cabbage, chipotle mayo, jalapeño & lime ($5)\n*HUEVO: Corn tortilla, fried egg, black beans, pickled red onion, cotija, cilantro & salsa verde ($5)\n*CARNE ASADA: Flour tortilla, grilled skirt steak, cilantro, white onion, lime & salsa roja ($6) x2\n*CHIPS + SALSA + GUAC: Guacamole and Glena's salsas ($12)\n*FRIJOLES NEGROS: Rancho Gordo black beans, cotija, crema, white onion & cilantro ($6)\n*Margarita: tequila, lime, agave, salt ($12)\n*The Baja Ha Ha: vodka, suze, passionfruit, lime ($12)\n\nI was here for the drinking so I got a fish taco and a margarita. The fish taco had good flavor and was rather light. I actually wanted it be a little bigger, but it was a good snack. The margarita was just what I wanted. Tart and not too sweet. Afterwards, I had either a four roses or maybe a templeton rye? I honestly can't recall, but a friend and I each got pours of something dark. Our server was sweet and attentive. Especially since we were ordering a couple things at a time.\n\nIf I was hungrier, I would have loved to try the carne asada and al pastor tacos. Those are more up my alley. If I'm in the area, I might come back just for that!", "author": "Elena N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-03", "description": "Life-changing huevo tacos. What more do you need to hear? But seriously, Glena's might be one of the best little finds, nestled into Dogpatch along the bay. Mexican with style, but not without authenticity. \n\nHighlights of Glena's include welcoming wait staff, quickly-refilled water on a hot afternoon, noticeably fast service and of course spectacular food and drinks. Huevo and El Pastor tacos are knockout and a choice of regular margaritas or the Young Buck will start or end your day right. Sustainability points for reusable straws too!\n\nDon't second guess Glena's if you're close or between Mexican (or taco) options. This place will not disappoint.", "author": "Michael L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-09", "description": "Came here strictly for drinks on a Wednesday evening, pretty surprised by how busy the place was at 8pm. Seating is pretty limited, which can be a problem for larger groups. \n\nAccording to my friend who frequents this place, their drink menu recently expanded and now includes a wider selection of cocktails, beer and non-alcoholic options.\n\nI personally ordered the spiked coconut horchata - I was expecting something overly sweet, but it was well balanced and refreshing. I think it'd be equally delicious without the bourbon. One friend ordered the pina colada, which was pretty standard and served on the rocks. My second friend got \"The Hoff\" which was a mix of mezcal, frozen blood orange daiquiri, and horchata. The smoky mezcal may not be for everyone, but she really enjoyed it. Overall, they have solid drinks at a decent price, and a nice atmosphere to catch up with friends. I really appreciate that I can easily hold a conversation here without having to shout over each other.", "author": "Christine C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-30", "description": "Absolutely delicious tacos! I tried the fish and huevos tacos with a limeade on this beautiful sunny Sunday. \nThe fish taco was very flavorful, you taste the freshness of the fish, some grilling goodness flavor, and it was NOT overlooked. It was t first time trying huevos taco and it did not disappoint. The fried egg was cooked perfectly with gooey yolky goodness that the waitress warned me to be careful that it might drip after I bite into it. Corn tortillas were house-made and really good. Glena's own hot sauce was tasty as well. I would've preferred a spicier option/version. Limeade was super limey, you do not feel ripped off from too much sugar, articulated flavor, or ice. \n\nOverall, I was pleased with my first visit. Ordering was easy, located at the right side of the door. Food was fresh and well executed. Only reason why I'm giving 4 stars instead of 5 is because of the price. Each taco was $5 and the limeade was $4. Didn't get the carne asada taco, but it would've costed $7 and chips + guac would've costed $12. However, I still highly recommend. It's really good and definitely worth the try if you like good, fresh, and clean tasting tacos.", "author": "Iris H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-03", "description": "Great place if you're in the mood for tacos. Small place but great ambiance. Tried their chips & salsa, which are pretty tasty and comes with three different salsa's. Also, tried all five of their tacos and each of us pretty unique and different. My favorite was the tofu one. And you have to finish off with dessert ... plantains w/ crema.", "author": "Iryna P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-04", "description": "3.5 Stars \n\nRounding up due to the quality but price point is where I had pause \n\nGuacamole and chips is a solid way to kick off - the chips are crispy, thick and well seasoned. The guacamole portion is on the smaller side but flavorful and refreshing + the sauces on the side all had great flavors\n\nSteak taco $5 + $2 extra feels really steep for something that was rather ordinary in both texture and flavor\n\nEgg Taco was done well and executed just right but again $5 for a single taco is hard to justify \n\nOverall Thoughts\n\nCan't be a go to spot with the price point but in some ways you are paying for good quality", "author": "Eddie W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-07-31", "description": "Not giving it another chance. I tried, I love small businesses and cane back because I kept thinking 'of it's an off night.' Nope. \n\nThe food is ok, some of the tacos are super bland and the others are alright. Mostly, I hate the customer service here. They all seem too bothered to take care of you. It's not rude, per se, just disinterested.  I recently read an article on the owners indogpatch newsletter - they say that their goal is to make everyone feel like they're at home and welcome. For the times, I've been there I have never felt welcome and felt like it was a friendly or inviting space. I'm not sure if I met the owners or staff but ... for mediocre food with bored service. \n\nConfirming their horrible customer service: no follow up from owners for me or any of the customers with similar experiences.", "author": "K O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-06", "description": "Everything we tried was very delicious but we were a little surprised at the $100 bill for 2 for lunch. We did each order a drink but the sides (beans, guac) are in the $7-$8 range which seems a little excessive. The location is super cute and the staff really friendly (they let me modify a dish to make it vegan) so all-in-all it was worth trying out but I'm probably won't be back again.", "author": "Jessica H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-12-05", "description": "We went to Glena's on one of the hottest days ever in SF and since they don't have AC we were all a sweaty mess before we even started eating.  Then when eating some spicy food we melted even more.\n\nGlena's is pretty small so if you're looking for a seat I'd recommend coming early to make sure you are able to grab one.  I started off with the spicy Margarita and it lived up t its name but it wasn't too overpowering.  For our main meal, I had a variety of tacos and they were good but not so much that I'd drop everything to come back.\n\nDecent, fresh food in a quaint spot in the Dogpatch.", "author": "Blake B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-11-03", "description": "Tacos taste great, place is cute, and the only place that serves tacos nearby (Dogpatch, Potrero). Service is fast and friendly. However, prices are too high. $5-6 per taco. Probably need to eat 3 to be full. I wouldn't mind going back once in a while.", "author": "Jennifer W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-09-27", "description": "The tacos were decent, and the ingredients were fresh, which is a plus.\n\nAt $5 each, I've definitely had bigger and better tacos. But, I guess this is one of the only places (if not THE only place) that serves tacos nearby, hence the inflated prices. I don't mind paying more for food when it's truly elevated and spectacular. These didn't wow me though. \nI don't usually eat too much and I would need to eat 3 of them to feel full.. $15 for 3 tacos (without tax or tip yet!) just doesn't sit well with me. 3 stars!", "author": "Emily C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-04-24", "description": "Cute taco place around the corner from a bomb brewery! The sign says tacos & margaritas, but they don't have their liquor license yet. You can order to go or eat in. The vibrant colors are inviting. \n\nI ordered carne asada, al pastor, pescado taco, churro, and sweet plantains (drunk munchies). The order came out relatively quick and the churro was freshly cooked and super warm. The tacos are slightly bigger than your regular street taco size. The churro execution was almost perfect, it was more on the crunchier side than fluffy. The sweet plantains were tasty but some pieces were saltier than others. The white yogurt sauce that accompanied them was kind of pointless. It didn't taste like anything and to be honest, the sweet plantains was better off on its own anyway because of the rich flavor it already has. The tacos were decent, but the meat was kind of dry. The pescado taco was my favorite. \n\nI can see the potential in this place and wouldn't mind coming back to give it another shot, but it wouldn't be my go-to for a taco craving.", "author": "Jenna T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-24", "description": "There's several people at the office that I despise. Yah, I'm talking about you, Mr. Engineer on the 7th floor who never holds the door for people and slams it in their face. Even with the door shut, I can see your colossal wedgie through the glass so what's the rush? \n\nAnd, there's was one person that I was terrified of so I avoided their path for the longest time...until a little birdie told her that I like food, as much as, she did. One day, she approached me to talk food and to my surprise, she was quite the chatty cathy. Now, she constantly sends me links to food articles which is how I found about Glena's Tacos & Margaritas. \n\nAfter reading the article, I knew I had to visit Glena's. The chef/owner used to work at Manresa and Kin Khao, both restaurants that I've really enjoyed which was very promising. \n\nUntil they get their liquor license, Glena's is only open Monday - Saturday from 11 am - 3 pm.\n\nBeware: Parking in the area really sucks but you can order to-go and have your passenger run in and grab your order. \n\nIt's a fast casual eatery. Order with the hostess and grab a number, or sit at the bar for full service. It's a tiny space  that fits 20 people so it's not for large groups. \n\nOn the menu are tacos ($5), platos ($12-$16): salads, torta, tostadas, pozole, chips + guacamole ($10), plantains ($6), and churro ($6). Drinks and juices only until they get their liquor license.\n\nTo start, I ordered the Al Pastor Taco ($5): http://bit.ly/2lE9oK5 which was one of the best tacos I've had! I'm not a fan of corn tortillas because they can have the texture of a rubberband but this taco was served on a flour tortilla. The al pastor had deliciously crispy charred edges but was very tender and flavorful. The pineapple added a nice sweetness while the salsa and squeeze of lime gave it a punch of acid. Beautiful layers of flavors and my only regret is not ordering another.\n\nA steaming bowl of Stephy's Pozole ($15) was in order since it was so cold outside: http://bit.ly/2l8usXn. It was served with dried oregano, shredded cabbage, diced onions, lime, and radish so you can doctor it up to your liking. Cubed avocado and tortilla chips were also provided. \n\nThe pork shoulder was lean and tender. The hot broth was perfect for this cold weather but it was really mild for \"spicy\". The housemade tortilla chips provided great texture. The pozole was good but not as good as the ones you can get for $10 at Gallardos (my favorite in SF) and San Jalisco. \n\nI usually judge a Mexican restaurant by the meats they serve, and prefer places that serve offal but Glena's proves that you can serve great quality [organic] Mexican food without dumbing down the flavors.\n\nWith bars like Third Rail, The Sea Star, and Dogpatch Saloon just steps away, Glena's is going to be a popular spot for drunchies once they extend their hours of operation. \n\nThis may be far fetched but I would love to see menudo on the menu one day!", "author": "Cherylynn N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-03-16", "description": "You can't buy a round of shots for people of color here, very unfortunate. Owners discretion. \n\nI decided to go grab some food here and joined some people of color in some fun conversation. It was fun, it was epic, it was great! Were we loud and obnoxious and rude, of course not. The overall mood of the place was festive, people were eating, chatting, it was grand....until I wanted to get a round of shots for everyone. The bartender had to \"check with the owner\", who looked over and saw who we were....why did he have to check? \n\nAnyways. Non people of color next to me for a round without permission...sooo...I will never be coming here ever again.", "author": "Michael R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-20", "description": "Drove by and saw taco sign. Couldn't pass by. I had their big three which is assortment of three different flavors. Steak was the best in my opinion. Overall one of the best tacos I had. The only thing I noticed upon leaving is that every table except mine had chips and salsa:(", "author": "Yessen A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-11", "description": "A bit overpriced but the tacos a truly great. The fish is my personal favorite but everything is very well done. What makes this place more than just a taco spot is some awesome service and a great bartender who will whip you something up from scratch.", "author": "Lorena S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-18", "description": "Adorable little spot that let us enjoy amazing al pastor tacos and pina coladas while sitting outside in the sun with our dog. Extra points for fast, friendly service, and PLANTAINS. \n\nOnly downside: looking at your bill and wondering how you just paid that much for tacos.", "author": "Nikki M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-17", "description": "Mondays at the office are extra-dreaded because that's the one day that Glena's is closed! Ugh, I love this place so much. The al pastor taco is my absolute favorite, but lately I've been getting the delicious fried chicken torta (the bread is fantastic, and balances perfectly against the face-meltingly hot habanero salsa that comes with it). The chips and tortillas are some of the best in the city. \n\nI always receive such friendly and attentive service when I dine in. And I tend to sit at the bar to have closer proximity to the cocktails. :) And when you go, make sure you check out the beautiful bathroom. \n\nThanks, Glena's, for keeping my office so happily fed!", "author": "Sandy G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-06-25", "description": "Let's taco'bout how good Glena's is! \n\nIt's a relatively small taco place located right next to a bar (Third Rail) which can be considered an amazing culinary duo. Keep in mind that I have never met any-juan that dislikes tacos and tequila, or tacos by itself. Nonetheless, let's get right into reviewing one of my to go places after working out at Dogpatch Boulders (the premier indoor bouldering destination in Northern California)\n\nPro(s):\n- Tasty tacos for any late night food cravings.\n- Thirst quenching drinks for all your dehydrated needs. \n- Positive staff members\n- Fresh scent of carne asada, al pastor, pescado, huevo, and tofu tacos when you first walk thru their doors\n\nCon(s):\n- $5 per taco (Not a total deal breaker considering the location, Dogpatch, but enough to put a dent in my wallet) \n\nOverall, this establishment has the typical taqueria food mashed up with simplicity in mind. I definitely recommend this place if you're ever in the Dogpatch and in a taco-craving mood.", "author": "Benson M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-07-23", "description": "I love and hate this place. The drinks are good, the atmosphere is cute and cozy, and the food is delicious. The real issue is in the price considering the service, when you're charging that much for chips and guacamole (12$), you need to get it right. We come here once a month and they typically forget something, or give our food/drinks to the wrong table. Tacolicious, which is similarly high priced, does a great job of this. Everything is thought about, they rarely make mistakes (and when they do, they'll comp, etc.), and the pricey dinner is worth the whole experience. So please, Glena's... I beg you to fix your service. I want to come and drink margs and eat tacos, but three visits in a row where you mess things up just makes it tough.", "author": "Wilson L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-08", "description": "I just stumbled onto this place as I was walking by. It is owned by a husband and wife......The place is clean and cute.  I had the tacos, pastor.  They had a good flavor, and presented well.  They are a little pricy, and I hope they bring back the happy hour.  They have an extensive margarita menu, and I would love to try one, at a later date", "author": "Paul G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-24", "description": "Cool little taco bar that we ate at while hopping between breweries. We ate at the counter and sat right in front of the bartender. The margs here are on point!", "author": "Michael K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-10", "description": "Great al pastor tacos (tortilla crispy perfect), quick service (at noon on Saturday)\n\nCan't wait to try more.", "author": "akshay c."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-28", "description": "I work in this neighborhood and was looking for a quick bite for lunch. I am vegetarian and I greatly appreciate 2/5 of their taco options being vegetarian. The tacos were amazing with tortillas made from scratch. I also would like to praise this restaurant for avoiding single use plastics and providing metal straws, reusable napkins and cutlery. You have my business and I will definitely be recommending this place to all my friends and family!!!!", "author": "Lizette G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-31", "description": "The most appalling experience I've ever had at a \"restaurant\". I ordered Pozole for take out and as I got home I believed someone was paying a joke on me, the serving size was that of the kids menu!! Keep in mind the pozole was over $15! I walked a half a mile to make an exchange but instead of an apology I WAS  belittled and they made me feel like trash! The bartender gave me look that would make anyone cringe, that look that makes you feel stupid. DO NOT GO, DO NOT GIVE THIS PLACE A CHANCE,", "author": "Jesse D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-22", "description": "Nice little place in Dogpatch! I love this neighbourhood, perfect to explore some of the new places that have come up on a weekend afternoon. Small place, owner used to work at Kin Khao before. We were a party of 3, and Vegetarians. There is only one taco, one salad and a couple of sides to choose from for vegetarians. We pretty much ordered all of them. The plantain chips was great. This is slightly different from ones you would normally get in other Mexican places. These ones are cubes of ripe plantains fried and garnished with spices. Best part is if you get me my food piping hot, I m already sold, and yes this is a dish that comes that way. INSIDER TIP: ask for the Chilli lime salt and sprinkle some of that on this. Game changer. \n\nThe guac although creamy was lacking in flavour (it was just very well mashed avocado). You can avoid it. Or if you choose to get it, flavour it up with the Chilli lime salt.\n\nThe Salad: Good thing was they can split the salad in two bowls, works great if you want to share your salad. The portion is quite big. The vegetables were fresh and crisp, however the pickled onions made it too sour and was overpowering. I would avoid this too\n\nTacos: The tofu taco was yum. You could distinctly taste each flavour.  The texture of the tofu was perfect, chewy enough, not too dry and not too moist that it crumbles. \n\nWould come back to get the plantain chips and the tacos.  Was a bummer that they could not customise the other meat tacos, and replace meats with the tofu. Very Kin Khao-ish.\n\nAnother benefit of this place is you can walk to Neighbours Bakehouse (best bakery ever!!) and get some fresh treats for home (be mindful they almost run out of most stuff by 11am on a weekend)", "author": "Puneet L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-28", "description": "Delicious tacos and even better people. First time here and will be back for sure. Incredibly customer oriented and just genuine good people working here. Thank you all!", "author": "Trevor K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-11", "description": "Accidentally stumbled upon this place and here we are. A perfectly balanced spicy margarita, side of shrimp ceviche and salty fresh chips n salsa. 5 star service and sidewalk restaurant!", "author": "Liza F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-30", "description": "They say it's all about the al pastor tacos on taco Tuesday. Here... NOT! It's actually all about the carne asada that's fire. You know what else is fire? Their habañero chip dip. Made me chug my mezcal margarita. If you're in the Dogpatch hood and feelin' a lil hungry- stop in here for a quickie. There's other platters at a good price point as well.", "author": "Jillian V."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-04-12", "description": "I will say the food is quite good and even though it is quite pricey for a quick lunch I have gone there numerous times since it opened 2 blocks from my home.  Tonight I was with a friend and we thought we'd eat at the counter (actually I was going to have a couple tacos and he a Margarita) but I ended up walking out because I was treated so badly, something I have never done in my life in any restaurant.   It started when we walked thru the door, no one greeted us and after patiently waiting quite some time we started to ask a passing waiter if we were to just take a seat or wait for someone and were told to wait.   The couple in front of us in the line looked like they were already frustrated and left.\nFinally a young women came to ask us the usual, how many people, and if we preferred a table or a counter.  I said I was just wanting a quick Taco and would be happy to sit at the counter.   By now there were 3 empty places to sit and we were still standing.  She cleared the counter for us but left us standing there.  We couldn't figure out why so I went to ask her.  She seemed annoyed and said the table was not ready because she had to wipe it down.  Another 5 min or so passed and I was running out of time because I had to teach a class in about 30 min.  So I want to say I'd like to place my order to go since I was short on time.  She told me it would take just as long because the kitchen was very busy.  I didn't say I expected it sooner I just wanted to take it to go so I would not be late for my class.   I told her that was fine and she started to walk away and I had to quickly ask for a menu before she was gone.  She gave me one with a bit of an attitude and when she returned just a couple minutes later I started to give her my order when she cut me off and told me the kitchen was too busy and was not doing orders to go.  She did not apologize and left me feeling like a totally unwanted customer.   I will say that the place was very busy but that is NO excuse for treating customers without respect.   \n\nI am very disappointed to see a small business like that move into my neighborhood (I have lived her for 23 years), one that I would really like to support and see thrive, only to find that they treat their customers in this way.\n\nBy the way, this is the first negative review of a restaurant I have ever posted.  Yup....I am a little ticked off!", "author": "Christy C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-06", "description": "Thanks Stephanie!\n\nShe listened and immediately resolved it. Like I said, the food is delicious and they are really listening to their customers. I appreciate that more than they know and this place has earned my business.\n\nI think it's really amazing that the owner reached out immediately and resolved it so fast that I didn't even realize it. It was as if I was in person. WOAH!\n\nThat says a lot when in reality, this could've been a review that gets lost in the abyss of the future reviews to be written. I truly appreciate and my bf says thank you. We'll be back!", "author": "Sweets N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-24", "description": "Having worked in the restaurant business for 15+ years, I never understood why restaurants closed between lunch and dinner. Granted it's slow but that's when you do prep, clean, and minimize staff so not to disappoint those who want a good meal at an odd hour.  Glena's has such a good social media presence on instagram and yelp that It's been bookmarked for a couple of months. Being a former resident of the Bay Area and a lover of tacos ,  I couldn't wait to try an al pastor taco and their spicy margarita on my next trip to the Bay Area. As soon I departed the plane I checked their address to drive there ASAP since I was statving, and then noticed they are closed between 2-5pm. What??? Why??? Come on!!! Unbelievable...so I skipped my lunch here and made a detour to Dip. I came back after 5pm when they opened and was not disappointed. The staff was very friendly and knowledgeable. I was still full from lunch and decided to have a drink at the bar and order to-go food for dinner to enjoy in my hotel room. The Spicy margarita was delicious at $12 and the Al Pastor taco had marinated cubed pork, instead of the traditional boneless pork shoulder sliced super thin ($5). The show stoppers were the salsas I ordered with chips and guacamole. I've tried numerous salsas from here to Mexico and I must say the three salsas included with the chips are by far some of the most delicious I've ever had. Fair warning the orange colored salsa is extremely HOT!  I love this concept and the food but they have to rethink closing between 2-5.", "author": "Mike V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-26", "description": "If you're out in the Dogpatch and want a quick bite, Glena's is perfect! \n\nYou HAVE TO try the al pastor tacos, chips and guacamole (they're served warm--it's amazing!), and the plantains. The service was also really pleasant and everyone was super friendly. I can't wait to check this place out when they start serving drinks.", "author": "Sarah G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-01", "description": "New spot, had the fried chicken torta which was pretty good, my friend had 3 tacos which he said were better than tacoliscious.  \n\nService was quick and easy, not sure what the other reviewer was complaining about.  Definitely worth a try before it gets too popular/crowded.", "author": "Mike D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-06-11", "description": "I saw all the great reviews and ran all the way here from ferry building (literally) excited to feast on tacos at the finish line. Unfortunately, I was disappointed. I had the trio of tacos that they group together on the menu. Listed in my order of preference, it was the pescado, al pastor, and carne asada. Pescado is the only taco I'll ever order again. Al pastor was ok, but quite bland. Carne asada was bland and the meat was tough to chew, so the texture made it last place for me. There is way too much tortilla for the amount of meat on the taco. The hot sauce they provide was a saving factor. For $5 tacos, I expected better. Maybe the good reviews here are for the drinks.", "author": "Katherine Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-04-02", "description": "This place just opened, so I know they will be learning and figuring things out and since it's in my neighborhood I do plan to come back.  The menu is small but great lunch or casual dinner.  They are in the process of getting a full liquor license, will be great to pair some of the spicy food with a nice margarita.  Some of the menu items seem overpriced and not very creative.  There is a lot of Mexican food in SF so they need to step it up. \n\nWe had the fish and port tacos, plantains and guacamole/salsa and chips. \n\nThe tacos were great, nice pieces of fish, spicy, fresh ingredients, yum!  The pork taco was great, could use a bit more flavor maybe some smokiness. \n\nI loved the plantains too and so will my vegetarian friends. \n\nThe guacamole and chips were horrible.  The chips were thick, salty and just looked soaked in oil.  The guacamole was strange, it was cubed avocado and I didn't see any other ingredients in there, it was also bland and a small portion. Salsa should be free in this place and just come with the order.  A Mexican place can't fail at guacamole.", "author": "Inga W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-24", "description": "I'm Hispanic and let me tell you in a town full of American food this food is pretty authentic! I got a chicken milanesa torta and it was so good!the drinks the area everything was amazing !", "author": "Andrea C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-14", "description": "They have excellent vegetarian tacos. The salsas are great! The habanero salas is face melting hot, so be careful and only go for it if you really enjoy the heat. I recommend the mushroom tacos, but everything I've seen come out of the kitchen looks great, so you can't go wrong.", "author": "Adam V."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-03-14", "description": "We use to frequent New Spot as we live close by. We were happy to see another restaurant take its place that is open on weekends.\n\nWe decided to give it a try on a Saturday afternoon around noon. We ordered up front and found seating. I thought it was strange that they would have such small glasses for water when a water pitcher was not accessible. I felt bad constantly asking the host up front for water bc there really isn't a wait staff outside of the bar.\n\nWe ordered chips and guac and an al pastor taco. It was ok. The chips and guacamole were great but I would say the al pastor meat was not what I wanted. I had some great pieces and some very dry hard to chew pieces.\n\nWe will def be back since it's so close. Hoping to try their pozole next.", "author": "Tiffany L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-10", "description": "Really really amazing food! I had two el pastor tacos. He had the salad. We shared the chips & guac. I finished with a churro-- finally the churro that I've been looking for in SF! \nVery high quality of ingredients, well executed recipes and nice portions ( we both were very full when we left) \n\nService was great: you order & pay then sit down & your food comes out; you just walk out the door when you you're done!", "author": "Simona A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-12", "description": "A cute lil taco place in the dogpatch! I'm pretty picky with my fish tacos but I loved the ones they have here. Bonus points that the fish was not fried! I was at 3rd Rail next door and was hungry so I'm happy that I was able to nosh on these. If you're in a hurry, beware -- food takes a bit of time to come out. This was pure agony while watching the Warriors game. Haha. The tacos are pricy at $5 a pop, but it is San Francisco...\n\nI also had a bite of the carne asada and carnitas, but the fish tacos were my favorite!", "author": "Janet H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-07", "description": "What a great new addition to the Dogpatch neighborhood!  I really enjoyed my dinner here, though I have some constructive criticism - hence the 4 and not 5 star rating.\n\nThe space is really cool.  If you've been to Media Noche, this reminded me a lot of it - not in any super specific ways, just the vibe....like a modern, U.S., hipster interpretation of the culture the restaurant embodies.  It's cool - nothing offensive.  Very sleek but kind of cozy, too.\n\nThe staff was really friendly and service was fast.  Ordering is in the format of Barzotto and Media Noche.....order, get a number on a post, have your food delivered to your table.\n\nWe went around 9pm on a Saturday and were served super quickly....like, within 5 minutes of ordering.  Thankfully, they did pace things out.  Chips and dips for a while, then mains and sides when we'd gotten through most of the chips.  We were one of two tables there when we first arrived, but 4-5 more groups came in shortly thereafter.  They must do a normal dinner and then get a post-bar-crowd later...\n\nI really enjoyed the food and drinks, with two exceptions that I'll note.  The chips and salsa are awesome.  And the chips are, like, out-of-this-world good.  Housemade, piping hot, perfectly salty.  They are so airy and crisp, I told my boyfriend that they're the tortilla chip version of a stellar Parisian croissant.  They even refilled our basket after we devoured them!  The salsas were also really good - it's a trio of three, and even the habanero option was flavorful...not just blisteringly hot.  The guac, however, was a let down.  It's really just cubed avocado.  Maybe that's more authentic - I really don't know - but it's nearly impossible to scoop it up with the chips....we kind of had to mash it ourselves at the table.  I also missed it having onion and/or tomato, though I have heard that making it without IS more authentic.\n\nFor entrees, I had fish and Al Pastor tacos and my boyfriend had the torta.  We really liked both.  I was especially surprised at how much I liked my fish taco since the fish is grilled, not fried...and I usually prefer fried.  I liked that the tortillas weren't super heavy, though the corn tortilla was better than the flour tortilla.  I did not like, however, the side of Rancho Gordo beans that we ordered.  My boyfriend was actually really into them, but I thought they were sorely lacking in salt or any other seasoning.\n\nFor drinks, we both had Topo Chico - yay! - and I also had a tasty paloma (they have their liquor license now).\n\nOverall, a cool new spot that I can definitely see myself returning to.", "author": "Tay H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-09", "description": "This place is great.  A fine addition to the Dogpatch that I hope stays for a long time.  Food is delicious and flavorful.  The warm chips and guac/trio of salsas was a great opener.  The guac is simple yet delicious and chunky.  Tacos were good but not the hit I was hoping after the chips and dips.  Don't get me wrong they are good but I was expecting just a little more flavor- especially for $5.  We also had the fried plantains.  I wish I could eat these every day.  Salty, sweet, with a hint of lime.  Check this place out for sure.  Great interior.  Friendly and helpful staff.  Can't wait for them to get their alcohol license so I can see what they do with their drink menu!  \n\nWelcome to the Dogpatch!", "author": "Laura B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-25", "description": "The fried chicken torta is very very good, and you can have a cocktail from the Third Rail right afterwards. Huge win in my book.", "author": "Christina S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-23", "description": "I attended a business meeting where the host catered lunch from Glena's Tacos & Margaritas. I had the El Guapo Ensalada with Chicken, and that chicken was shockingly delicious. The menu on the website lists the salad's inputs as \"Little gem lettuce, cilantro, cucumber, red onion, cotija, sour cream, and lime dressing\".  That lime dressing was pretty sick too, come to think of it. Maybe the meeting was going well so I was just in a happy place, but I thought my modest little takeout salad was awesome.  Mental note: find the storefront to try the tacos.", "author": "Michael S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-17", "description": "Decent spot for tacos in dogpatch. service wasn't spectacular and really small dining accomodations.", "author": "Danielle T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-26", "description": "Amazing casual taco spot. We ordered almost every taco on the menu plus the plantains and the guacamole and some margaritas. I used to live in Mexico so am admittedly a bit of a snob when it comes to tacos. The food at Glena's is spot on, completely worth the drive across town!", "author": "Erin W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-01", "description": "This is a 3.5 for me. Tacolicious sets the bar for me for this kind of place and Glena's is no Tacolicious. I thought the chips, salsa, and guacamole were the best thing we ordered. My dining companion thought the chips were too greasy for his taste. They were pretty greasy. We also had posole and an assortment of tacos. The cocktail menu looked very inventive, but we stuck to beer and wine. \n\nI'll also note what detracted from the overall experience was the noise level. Glena's is tiny and filled with hard surfaces and high ceilings. They could benefit from a few acoustic adjustments to make the environment more pleasant - especially their employees - I don't know how they don't go deaf with all the noise.", "author": "H. B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-06", "description": "Pros:\n\nAwesome food. Great tacos. Great cocktails. Great service. The tortillas are made from scratch. The salsas are fresh. \n\nCons:\n\nThere are really no cons. They'll make you a churro fresh. There's a tofu taco. The place is cozy and clean. And you can walk to mr and mrs miscellaneous for a second post-churro dessert. Just stop debating and come on down!!", "author": "Mark O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-24", "description": "Glena's.....Located in the Dogpatch of SF.  Hasn't been open too long, maybe not quite a year. Heard alot about this small taco eatery. I'm sure they are still working out the kinks of a new business. Main obstacle I noticed was their price point. There are many, many Mexican eateries in San Francisco. Its imperative to deliver top food and service to survive in this day and age. Their service was on point, but as I indicated, their prices are high. Mind you, I don't object at all to paying more $ for above standard meals as long as the food is elevated and spectacular. I think Glena's fell a tad short.\n\nWe had the Fish and huevo tacos, plantains, and guacamole/salsa and chips. The tacos were great. I really enjoyed their house made corn tortillas (my favorite is always corn!). The Huevo taco was very unique and yummy. The plantains were good but I've had better. The guacamole I thought fell short. It was just cubed avocado but I couldn't taste anything else in it, and it was in the small size. $12.00??  Again, ouch on the wallet! The margarita was great but....too much ice. \n\nI don't usually eat much. But I would need 3 tacos to feel full (3 × $5= $15) that's b4 tax & tip.....and a margarita.\n\nIf you work/live near Glenas, I could see revisiting. However not likely, for me. As I stated, lots of other Mexican eateries.\n\n4 stars....deducting 1 star for price point and 1/2 star on the guacamole.", "author": "Janet T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-08-17", "description": "Really limited menu. I ordered two carne asada tacos for $7 each. The tacos were good but not worth $7 each. \n\nNot sure I would come back here again. Actually saw a few people come in,  look at the menu then leave.", "author": "CL S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-02", "description": "Glena's is an awesome spot in the Dogpatch to unwind after work. It's spotless, the staff is super friendly, and they have their liquor license now! The Dogpatch is a perfect neighborhood for Glena's, all very relaxing\n\nTheir margaritas are fantastic, so are the tacos!", "author": "Patrick K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-27", "description": "Glena's is great! We went with a group of about 8 for dinner one Saturday and even though the restaurant is on the smaller side, the staff was able to snag us a table so we could all sit together and were very attentive to our large and thirsty group all evening. With so many people, we were able to order almost everything on the menu and enjoyed all the things we tried. The plantains, pork tacos, fried chicken torta, and the house-made salsas are not to be missed, and the food is a great deal for the price. I could leave full and happy for under $15 at lunch or dinner if I didn't have a drink. I wish we had a restaurant like Glena's in our neighborhood back home!", "author": "Liz O."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-03-04", "description": "Food is very salty, can't taste any other flavors because the salt is overpowering. Chips, salsa, and guacamole are the best part, but you can't eat much because of all the salt. It's really dark and cold inside. Only get 1 taco for 5 dollars, no sides. Not a place I would visit again, so many other better places in San Francisco.", "author": "Micha F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-20", "description": "It's funny how you can be a relatively new (2+ years) resident of San Francisco but already experience the pain of loss and change amidst the rapid development of areas you love. That said, I was a frequent visitor to Glena's predecessor, which boasted one of the most delightfully egg-y chile rellenos I've ever had. Glena's is a different experience all together - more polished and painstaking in their offerings. I enjoy their al-pastor tacos, as well as their plaintains and black beans. The husband really liked the huevo taco, with the tofu taco coming in a close second. I gladly welcome this addition to the neighborhood, but not without the lingering pain inherent in losing a familiar and delicious staple in the regular take-out lineup.", "author": "Archana P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-04-03", "description": "Was hoping for more from Glena's. This area is lacking in hipster Mexican. The taste, price, and service were just all too lacking to go again. \n\nGuacamole and Salsa $10 - their guac was cubes of avocado with some lime juice. Insulting for $10. \n\nTacos $5/each - street taco style, burrito price. All meats were low quality, would have hoped for better on a $5 taco. For a place that has \"tacos\" in the name I was surprised by low quality as well as offering. \n\nSalad $12 - chicken was ridiculous $6 add on. Bland flavors. \n\nKitchen was clearly off as they messed up the three orders before and after ours. \n\nI'm sorry Glena, it just didn't work for us.", "author": "Anthony G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-31", "description": "Beats Tacolicious and Nopalito by a landslide. Everything is made in house (best hot sauce I've ever had!), with the friendliest crew around. High-quality food without a hint of pretense.\n\nNo corners are cut - avocado servings are plentiful, ingredients are fresh. Tortas are served on Acme buns. If you like tacos, but are wary of SF's traditional taquerias' sourcing and ingredients, look no further. \n\nGlena's will have a liquor license soon (they tell me they're going to have a fresh take on the frozen margarita!), but in the meantime the jimaica drink is delicious (it's a deep purple color as it's made with hibiscus) and isn't too sweet.\n\nTheir simple, clean take on Mexican food is mirrored in their design. Glossy green floor-to-ceiling tiles reference Mexico, but with a clean, modern aesthetic. Simple Muuto ceiling lamps are functional and beautiful. Big windows allow light to stream in and word on the street is that they'll soon have outdoor seating. \n\nBest tacos in the city. Worth the trip even if you aren't lucky enough to live South of Market :)", "author": "Erin G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-10", "description": "I was visiting a nearby UCSF clinic and got out around lunch time. In the mood for tacos, I looked up the nearest taco joint of some repute and this spot popped up. I liked being able to put my order in at the door; wonder if that's annoying if there's a line, but in my case there was nobody in front of me. The ambience and seating are nice, comfy. The food and drink I had were delicious. I loved the carne asada taco, in particular. \n\nMy only beef, based on my first encounter, is the chips and salsa situation. Where I grew up, chips and salsa are free, even if they're made on the premises. I don't expect that in S.F. where overhead costs may be prohibitive. But $10 for chips and salsa (and, yes, guac)? I refuse to pay that price for chips and salsa. I don't need the guac or the array of salsas, just a few chips and one good salsa to whet my appetite and round out my meal. I suggest creating a middle-ground option for folks like me who just want some chips and salsa. Charge $3-$5 and you might move more product and satisfy more customers.", "author": "Drew T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-31", "description": "I've been eagerly awaiting Glena's opening and have already been a half dozen times. The food is fantastic, fresh, flavorful, and filling. I'm working my way down the menu, but the torta is among the best sandwiches I've had and the tacos are in a league of their own. The torta is on Acme bread and the tacos are on a great handmade tortilla. I'm looking forward to the margaritas that are coming soon, for now I'm enjoying their juices, especially the jamaica. \n\nThe space is great, nicely laid out, bright, lively, and clean. The proprietors are committed to delivering a high quality product sourced with local and organic ingredients. They're super friendly and locals themselves. I'm grateful for their long, uninterrupted hours, which itself feels like a public service. \n\nCheck them out before the lines are wrapping around the block.", "author": "Amir A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-02-04", "description": "Has potential.\n\nThe service here was excellent. The drinks were amazing. The quacamole, chips and salsa was $12 for a scimpy serving of plain guac. The chips and $14 torta could've used about 1/4 of the grease they were made with. I'll probably be back for just a taco and another tasty cocktail, but will skip anything made with grease.", "author": "Seth M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-18", "description": "Good food. Value is lacking.\n\nBy the numbers:\nFood 5/5\nAmbiance 5/5\nService 4/5\nValue 3/5\n\nI enjoyed the fish, al pastor, and carne asada tacos ($5ea). I recommend getting corn tortillas. The grilled fish was the best one, and all were pretty faithful but upscale versions of their al carbon hermanos down south.\n\nIf the restaurant could lose the table service that no one wants to pay for and drop all the prices by a dollar or two, they'd have a winner on their hands. It's good, but not $5/taco (+tax and tip) good.", "author": "Navi O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-22", "description": "I got an al pastor taco and fried chicken torta.   Both were great. The menu is a little small.  The habinero sauce was very spicy.", "author": "Michael E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-22", "description": "Killer. Fast, friendly, delicious. Is $5 a lot for a taco? Yes. Is said taco hearty and lovingly made? Yes. \n\nExtra super bonus points for the amazing guacamole. It's exactly how it should be - barely mashed, super limey, and without tomatoes and the other gunk that should never sully guacamole. And ... fried to order tortilla chips. \n\nOh, and I came in with two nine month old babies and no one batted an eye. Much appreciated. They liked the guacamole even more than I did.", "author": "Ethan R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-11-11", "description": "Still a good spot in the Dogpatch but I can't in good conscience leave my 5 star review as is.  This has now become a bit of a weird place - Half taqueria and half sit down restaurant with table service.  Same small menu, but prices have increased.  Guacamole is TWELVE DOLLARS.  The tacos are good, but not good enough to be worth the price (5 or 6 bucks each).  The menu also never changes.  I don't think I need to come back - except maybe for their still amazing cocktails.", "author": "Melissa F."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-03-26", "description": "Friendly people but not very organized. I have been here several time and there are issues with payment processing. The kitchen seems to be disorganized and the service is slow. In addition, imo the food is overpriced and not up to SF Mexican standards.\n\nI hope they get it together.", "author": "leslie m."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-18", "description": "This place is really good. The menu is simple but very original. It builds off of a few traditional Mexican dishes but adds a hipster twist. I had the fried chicken torta, which was made with beans, avocado, lettuce, and a very good (slightly spicy) salsa on the side. Next time I think I'll try the Pozole!", "author": "Andrew L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-05-03", "description": "Disappointing. Front hostess was unfriendly, borderline rude when we asked if we sit down and then order.  It wasn't clear and was just confusing. \n\nMisleading - ordered the shrimp ceviche plate/entrée and got a small bowl of ceviche and chips. When I order an item under the \"platos\" category, I'm expecting something to fill me up for a meal, especially for dinner. Maybe put ceviche under a different category, say appetizers or even sides?  It really isn't a plate at all, is it?\n\nThe chips and plantains were greasy and unappetizing. Every bite of the plantains just oozed oil, rather than being a crispy carmelized exterior with a gooey center that I'm accustomed to when having fried plantains. \n\nWould I go back, no.  Everything was just meh, nothing exciting. I left hungry and I can't even eat that much in one sitting.  What would a normal person do?\n\nUpdate: we now both have upset stomachs and off to get some pepto.", "author": "Miss H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-27", "description": "In this place there used to be taqueria, you would've lucky to stumble upon it when looking for something super cheap but still delicious .. \n\nTime goes on and rents go up and you want to cook with fresh local ingredients.  besides, they have a liquor license people. \n\nMy one tiny quibble is I wish they'd let us know it wasn't necessary for our friend to order a SEPARATE bowl of chips.  Perhaps you're looking at the menu board and saying to yourself, $10 for chips & salsa & guacamole?!  are you kidding me right now?  well, just order that and see for yourself.  it IS most definitively 'worth it' - but one order's plenty for a table of 3.\n\nas for the great guacamole debate:  it's all about the avocado people.  just a whisper of garlic and lime, a bit of salt.", "author": "Jaina S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-03-03", "description": "Went by looking for The New Spot, apparently it's been replaced by this joint instead.  Was rather shocked that a single taco is $5.  No matter, we were already there and hungry so order we did.  I got two tacos, my partner got one, and we got a coke and a limeade to drink.  Total was $24.\n\nWas rather disappointed by the result.  What was served was something way too complex and included either pineapple or mango, which was gross.  The meat was overcooked and a bit on the salty side.  A simple taco shell, meat, onions, and cilantro would have sufficed.\n\nIt seems a bit of money was spent on the presentation of the facility.  New tables and chairs, everything cleaned, fresh coat of paint in the bathroom, etc.  These are good.  But the gourmet paper napkins and personalized drink coasters is too much.", "author": "Nick P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-18", "description": "Excellent food. Excellent customer service. Cannot wait for the liquor license to come through, if they make margaritas or michelada's with the same care and attention to detail as the food we had, they will certainly not disappoint. Very happy with our experience. We will be back. \n\nI must mention, the habanero salsa is indeed hot. The staff gives the appropriate warning when you order it and again when you receive the salsa... however I thought they were simply overly cautious, I certainly enjoyed being proven wrong.", "author": "Andrea S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-10-17", "description": "An 8 ounce bottle of diet coke costs just as much as a 12 ounce bottle of imported Mexican coke.  Unfair.  Either charge less or buy bigger bottles or charge less.", "author": "Eddy K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-14", "description": "Stopped in for a quick tequila and a couple tacos. Huevos and pescado tacos were a five, salsa and chips were also way above average. The brown salsa was incredible. Had a bit of heat and maybe lime flavor(?). All around solid.", "author": "Rich G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-14", "description": "This place gets all the details right. Beautifully done interior with tile and wood. Nicely done cocktails. Delicious tacos with the right assortment of ingredients. And the staff are really on-point with their service and attitude - friendly but not overly intrusive - just right. \n\nGreat addition to the neighborhood.", "author": "Marcus L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-11", "description": "Mmmm this place was a great place to have a weekend lunch at! Tacos, tortas and ceviche oh my!  I think my favorite were the tacos, at 5 dollars a piece two of them could fill me up. We also tried the chicken torta which is huge so if you're feeling really hungry, this is also a good option. I'll definitely be back for that carne asada taco. Highly recommended if you're into good quality meats.", "author": "Sneha M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-25", "description": "Stopped in for a quick snack with my boyfriend. We got 1 al pastor and 1 carne asada taco. The meats were high-quality. The flour tortillas they used tasted fresh with a nice balance of warm chewiness and slight crispy-char. I really liked the colorful, tangy pop of flavor on the al pastor from the pineapple & salsa verde. The portions for a single taco were generous. Although this place is not as cheap as other taquerias, it's relatively affordable for SF these days - especially for fresh, quality ingredients (including organic meats). It's a focused menu, but has enough variety to be a frequent go-to option. I'll definitely be back to try some of the platos. \n\nAs for service, the owners (of Kin Khao/Manresa and Plow fame) were friendly and welcoming. The space is small but warm and inviting. You order/pay right away when you walk in, and they bring the food out to your table via order number. I can imagine this place being busy for lunch, and as someone who lives down the street, I hope they get dinner service going soon. \n\nNet net, Glena's seems like a great casual and affordable addition to the neighborhood.", "author": "Michelle F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-10", "description": "Finally got to try the food at Glenna's today. The Al Pastor taco was delicious! Nice size, bigger than a \"street taco\" so the $5 price point seemed on point. All fresh ingredients and handmade tortillas. Ordered a Fried chicken torta to go for my husband and traveled back to Marin with it, it stood the test of time in my car well and was also delicious (the hot sauce that is served on the side like a little after thought, is not to be ignored, it is so good and has a really nice kick to it. Heat level, up there!)\nLooking forward to going back for dinner when I can enjoy some of their homemade spicy margaritas!", "author": "Krissy T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-04", "description": "Great little spot for a quick bite!  You order at the counter and find a table or sit at the bar for full service.  The food comes out quickly and the staff is super friendly. I had the Tofu taco and side of vegetales en escabeche, which were both delicious and very fresh.  I can't wait to try Glena's again the next time we visit the city.", "author": "Ashley C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-03-26", "description": "It's alright here. The $5 tacos are a bit steep in price but they are tasty. Seating is pretty limited as well. It's just unfortunate because the menu is pretty small so you're kind of stuck with the tacos that I don't think are really worth it. Not really filling either.", "author": "Vinh T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-05-20", "description": "Well, talk about gentrification and white people take overs.  I remember this establishment being Latino owned.  When we arrived we were surprised as this place use to be Latino owned so we were disappointed.  The tacos were not made with corn tortillas and very salty. The chips salsas were great and we enjoyed that.", "author": "Valerie F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-29", "description": "Tacos, tacos, tacos!! I really was just in the mood for a good taco without having to deal with any attitude you find at a lot of SF places. Found this place in the dogpatch, and it was clean, cute, and not crowded. Sat down at the counter and ordered tacos, chips + guac + salsa, and fried plantains. The tacos were everything I hoped they would be. I ended up getting steak and al pastor. They are bigger than street tacos at most places, and I really liked the way they pan seared the tacos before serving so there was a nice crispiness to the shell. The homemade tortilla chips were served warm and were amazing. Glena's is now my favorite place for tacos.", "author": "Ash T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-16", "description": "Small, but very cute place! Food is very good! I thought it was a little over priced considering I paid $16 for ceviche that i still have to mix together yourself. Also, $5 for one taco. \n\nThe drinks are expensive but totally worth it. Bartender was amazing and fun. \n\nI'd definitely visit again, but I'll plan on brining more money. :) Not as cheap as your typical Taco spot.", "author": "Nicole W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-21", "description": "Cute little spot. I had a tofu taco which was GREAT, also had some black beans and plantains, all solid.", "author": "Debra D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-19", "description": "Casual and delicious. We enjoyed the al pastor, pescado and carne asada tacos. Too difficult to choose a favorite, all three were hot, fresh, and came with a variety of toppings. The tacos are 6inch in diameter, larger than your average and excelling in flavor. \nThe shrimp ceviche is great and go well with warm, house made chips.\nThe churro is my best friend.", "author": "Elisa C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-19", "description": "This place is lousy. The pizole wax not only overpriced it was an awful flavor, however the indigestion is free.", "author": "Patrick M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-12-08", "description": "We went to Glena's and ordered 2 tacos, one guacamole, one beer and one juice and paid almost $50 for our meal. The tacos were tasty but extremely over priced, even if they are using high quality ingredients. We are happy to pay good money for high quality food but these guys miss the mark.", "author": "Urban S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-02", "description": "Simple and good. Everything on the menu shines. Must come back and often. Plantains are a huge hit with my toddler and wife. Try the different margaritas, they're all so tasty. Great looking space.", "author": "Daniel C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-24", "description": "Fantastic street food-style tacos, made with the freshest ingredients and created by an amazing team, most of them formerly of Khin Khao. I had the al pastor and carne asada tacos \n - both delicious and super flavorful. The homemade tortillas were a real plus. I swear the black beans were some of the best I've ever had. Margaritas are fantastic, and their guacamole is fabulous. Small place, but very cute and welcoming. And I should mention that the tacos are quite large (especially for the price)...2 of them are more than enough for a meal. \n\nMake a trip down to Dogpatch to visit this awesome new spot!", "author": "Whitney B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-10-01", "description": "Came here with a group after climbing at Dogpatch.  The place is horrendous.  The same price as Lolo's in the Mission, but nowhere close to the same quality or value. We ordered guac and no joke it was just sliced up avocados.  No salt, onions, tomatoes or anything.  Just sliced avos.  The carne asada tacos were ok, but the portion size for the price was no where close to what it should have been.", "author": "Mark K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-21", "description": "I'm still upset over last year's loss of New Spot (cheap taqueria type place that was previously here) yet this isn't a bad replacement.  The prices are higher than more \"legit\" spots in the Mission (they charge $5 for a taco) but the quality is really good.  If you've been to Tacolicious expect a similar experience here.  They really do need to look at offering a \"house margarita\" option that's less than the $12 options they currently have.  The margaritas are tiny (but good) and I'd order two if they had like an $8 option.  Service has been great and pretty friendly most of the times I've been here.  In summary I'll keep coming back since I live nearby but I wouldn't recommend going out of your way to go here.  You might as well go to Tres or Tacolicious for similar quality and prices with a much more interesting atmosphere.", "author": "george c."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-02-25", "description": "Great place if you want overpriced gentrified Mexican food. Tacos and shrimp salad were fine - nothing special. I nearly fell off my seat when I saw that we were charged $12.25 for chips, salsa and guacamole  This wasn't at all clear on the menu as it said $5 for chips and salsa and $7.25 with guacamole - so we assumed it would be $7.25 in total - especially given that any decent taqueria gives chips and salsa out free. Also the chips were completely saturated in oil. On the plus side, there was no line and service was quick and friendly. However, if you want decent Mexican food, save your $$$ and go to the mission.", "author": "Hannah D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-10", "description": "Simply put...just too expensive. 2 tacos, 1 torta, 1 kids cheese quesadilla, plantains, 1 cocktail and juice. With a tip it came to $80. The food was good but not amazing, portions were on the small side (tacos should be overflowing to the point where you can divide it into 2 tacos for $5 ea). Cute decor. Convenient location. But we left a little hungry. We won't be back", "author": "Megan N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-22", "description": "Here are my highly recommended items- Fried Chicken torta, Frijoles Negros, shrimp ceviche, chips & salsa. I love their habenero sauce.", "author": "Chris M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-03", "description": "Ok. I feel like eating Mexican food every day. To say it's my favorite food is like saying breathing's useful. I'm from Southern California and I'm sorry to say, but the Mexican there is better than in Northern California. I love La Taqueria, Pancho Villa, Papitos, Taqueria El Buen Sabor, etc etc. But. And I can't believe I'm actually writing this after only two visits to this little spot in Dogpatch (Dogpatch!?), Glena's is the best. It's the best for three simple reasons: 1. I've been on a search for the best Al Pastor in SF for four years, and now my search has ended; 2. The Carne Asada tacos have to be laced with nicotine as my heart whimpered when I took my last bite and I felt a craving for more even though I was full; 3. Most importantly the UNBELIEVABLE TORTA. Get. In. My. Belly. Twice. Honestly it was so dang good I couldn't believe it. I gave bites to the folks I was with and they confirmed my feeling. That fried chicken. That acme roll. You are a super model of deliciousness. So. If I had to give one critique it'd be this: I'm a massive fan of Salsa. I Love Salsa. And most of all. I'm obsessed with habanero Salsa. The habenero Salsa at Glena's is a little too vinegar-y. Glena, if you're a real person, or whoever runs this joint, I will literally come in and help sort out the habanero Salsa. Seriously. DM me girl (or guy)!", "author": "Greg C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-10-15", "description": "Went here on a Sunday afternoon. The door was unlocked and there were a few groups inside sitting but the guy behind the counter told me they were closed until 5. Not sure what the deal was, their hours said they were open all day and it seemed like those other people had been served. \nFYI the place next door was awesome. Really good cocktails and jerky. Would highly recommend going there instead of Glenas.", "author": "Tori R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-09", "description": "To start with, everyone was friendly and welcoming. I sat at the bar and had great service.  The spicy margarita was spicy but not deadly.", "author": "Darel H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-24", "description": "10/10 friendly service, great recommendations, not too loud and the food is AMAZING. Drinks are super unique I love the twist on average cocktails. I recommend this to anyone who likes tacos, unique cocktails and/or hole in the wall shops.", "author": "Cassandra P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-26", "description": "I like this place for lunch, especially their fish tacos, since I work nearby.  Delicious, simple menu.  Waitstaff and bartender are always nice and friendly.  Clean with stylish décore.  A great neighborhood place.", "author": "Victor S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-08-12", "description": "This place is really beautiful- great decor.  My husband and I also got very friendly service. The food was also pretty tasty, notably the house made chips were excellent. That said it was very overpriced, and the portions were very small. We ordered a couple tacos and chips and \"guacamole,\" which was merely some avocado cut up with some lime juice. I love this area of Dogpatch and the atmosphere here is top notch but the portion/pricing here is not worth going back.", "author": "Nora C. E."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-09-27", "description": "You'll leave hungry because the portions are tiny and you'll also wonder why you spent 10x more than the taco truck around the corner on exactly the same food.", "author": "Oliver F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-16", "description": "Outstanding food, drinks and service. Super fresh, and very affordable. I would eat here every week if I lived closer.", "author": "Nicolas K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-18", "description": "Fabulous tacos, fresh chunky guacamole, variety of salsas, and fresh made chips. This is a hidden gem.", "author": "Lisa V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-06", "description": "Tasty drinks and yummy fish and tofu tacos! I think I'll save meat tacos for oakland taco trucks. *Note the guac is pretty much just cut up avocado.", "author": "Adriana R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-18", "description": "The tacos are on the big side, so I was able to make a meal out of one plus sharing plantains and chips. Very tasty all around. The automatic flour tortilla is interesting, very dense and chewy, different from the basic corn tortilla street tacos. Didn't get a chance to try the cocktails but they sounded solid.", "author": "Katherine W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-23", "description": "Good food good people great sparkling water and 4$ Modelo beer!!! This place is really good don't freak out over the 5$ tacos there really good; I rank them second to the mission tacos. I Had drinks and lunch here as we waited  for the addition to the family to enter the world. The hospital is right down the block so this place is a great alternative to the hospital cafe. I have been here twice and I will go back", "author": "Andre F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-02", "description": "The food is not bad but seriously pricey in a city where Mexican food is King. I live close by but choose not to frequent as drinks and a light app cost $40 (?!) Cute decor, but sadly will not frequent as a regular.", "author": "Angela H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-08-05", "description": "3.5 stars.\n\nCool spot, great environment, and great service overall. The food was good, not great. \n\nThe guac is basically just a cut up avocado which was kind of disappointing for $12. The tacos were flavorful and tasty, but for the price aren't that great of a value. The drinks were good. I spent ~$70 for 2 drinks, some tacos, and guac for two people (including tip), which is too much for Mexican food IMO. I'd probably go back because it's in the neighborhood, just wish it were a bit of a better value.", "author": "Matt L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-03-28", "description": "Decent food but ridiculously small portions and everything you'd normally get at a Mexican joint is extra. $16 for an underwhelming shrimp ceviche plate with chips and no salsa (how can salsa be an additional charge at a Mexican restaurant?). Called several times before reaching anyone to place a to go order, but probably won't be back.\n\n* the owner followed up not to offer me a complimentary taco or reimbursement, but only to tell me that i was wrong for ordering their smallest entree blah, blah, blah. To say that your chips are made \"in house\" is kinda ridiculous - what you cut up the tortillas and fry them all by yourselves?? \n\nI was kinda taken back at the response I received as this is coming from a Manresa alum, but maybe all they took from D.Kinch was his cocky attitude.", "author": "Don J."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-03-19", "description": "Not authentic Mexican food and very overpriced. Pozole was overly salted and spiced, and pescado taco fish did not taste fresh. $10 for very small portion of guac that was pieces of avocado soaked in lime.", "author": "Age C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-03", "description": "This is a gem in the Dogpatch and dare I say the best tacos in the city? I know the mission gets all the credit but don't write this place off. It has a no nonsense menu, every ingredient is fresh & properly balanced. a+ 10/10 glenas ftw", "author": "Charlie H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-14", "description": "Grabbed dinner here after a shift at UCSF Children's. It's a great little spot with fast service and delicious tacos. The al pastor and the fish tacos were delicious and a good price for the size. I couldn't say the same about the margarita, it was on the smaller side for $12. All in all--- excited about this place for post-shift tacos but maybe I'll stick to a beer next time.", "author": "Kath L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-18", "description": "Delicious pozole and plantains. The ceviche was decent. Chill vibe, easy to order for sit down or to go. You can even bring food next door to Third Rail", "author": "Marc H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-23", "description": "Really good tacos!! Even if they were on the pricey side at $5 each. I had the carne asada and al pastor - they allowed me to switch to corn tortillas (both come served on a flour tortilla). Both were really flavorful. I live in the neighborhood so I will definitely be back for more tacos and I also really want to try the pozole.", "author": "Brie P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-09", "description": "Ignore all the yelpers who have and will complain about the prices being high.  Yes, if you're looking for a $1.25 taco, this is not the place to go.  But the food here is fantastic and worth every penny! \n\nWe tried the al pastor and pescado tacos.  Both were quite good, but the fish taco was excellent.  The fish was nicely grilled and the toppings complimented it without overwhelming the fish.  We also enjoyed the ceviche.  The chips + salsa/guac may have actually been the star of the show. The chips were delicious as were the salsas & guac.  The guac had a nice amount of lime in it and was nice and chunky.  I don't think there was any onion or tomato in it.  \n\nOn top of that, the owners stopped by our table to say hi when we're in. They could not have been friendlier .\n\nLooking forward to when the liquor license comes through and the margaritas get poured!", "author": "Joe S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-01", "description": "Yum! Friendly service and fabulous fresh tacos! I love the late hours and margaritas coming soon.", "author": "Vicki L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-19", "description": "The fish tacos are on point. I live right around the corner and Glena's is now my default for a quick bite when I don't feel like cooking dinner. Unlike the previous reviewer, I liked that the guacamole doesn't have tomatoes in it. The fried chicken torta rivals Rick Bayless for the best torta I've ever had. Service is friendly and efficient. The dining area is quite small, I haven't seen it overcrowded but I could imagine them quickly outgrowing the location. I certainly hope that they don't, I think this is an awesome addition to the neighborhood.", "author": "Elaine G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-01", "description": "Great taco shop. Fresh food, light and airy decor, and a friendly team. I'm pretty sure this place will be a big hit!", "author": "Kevin P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-11-17", "description": "$12 guacamole!?!  $5, simple taco!?  Worth it?  Not at these prices... that said, they make a killer margarita!", "author": "Donny M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-10", "description": "Their chicken torta is amazing\nVery cute decor\nPerfect service\n\nHighly recommended", "author": "Tony T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-12-03", "description": "Food is over-priced.  I'm used to that.  What I'm not used to is the staff who seem to think I am wasting their time.  Please be more courteous and patient for a first-time visitor to your restaurant.  I'm sorry if I did not understand the menu and I'm sorry to ask questions that seemed obvious.   Your employee said all the right things, but it was obvious from the tone of her voice that she was annoyed.", "author": "Michael C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-05-01", "description": "It's hard to write a review for Glena's without comparing it to the former resident of the space, the New Spot. New Spot was affordable, food was amazing, and while the decor wasn't modern/fancy, it was warm and homey. Glena's on the other hand is pricey and feels pretty cookie cutter.\n\nTacos at Glena's are good. I had the Al Pastor and the Fish. Pastor had really good flavor, fish was hit and miss. I had two fish tacos, one was overcooked, one was amazing. Good taco, but $5? Yikes.\n\nCeviche Tostada - if it were just the tacos I was reviewing, I probably would have given them 4 stars. Our order of the tostada was a general let down. Flavor was good, but portion size was tiny and it would be a stretch to call this a tostada. It would be better advertised as small bowl of shrimp ceviche with tortilla chips.\n\nI think the neighborhood lost a gem in the New Spot and Glena's, at least in its current offerings, doesn't seem to be carrying the torch.", "author": "Stephen W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-13", "description": "Steak taco was excellent. Fish taco wasn't very good. Guac was solid and salsas were all interesting. Great service, the place is clean, and has a relaxed vibe that I like. Would come again for steak tacos.", "author": "Abad M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-31", "description": "This place is amazing!!! My wife and I wanted to try a new place and Glena's hit the mark. First off, we walked in and thought the place looked great. From the tile to the tables everything was well done and we were greeted by very friendly staff. We sat at the bar and ordered a specialty drink in which was so good, I ordered a second. Lol. Then I chose the chicken torta from the menu and my wife got the pazole. I kid you not, if I wasn't so full I would have ordered another torta. You could tell the ingredients were the best and the flavor was perfect. I highly recommend this place.", "author": "Kyle C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-04-26", "description": "I really, really wanted to love this place. It's cute, the people are lovely and attentive. However, my pozole was just bland. After adding in all the sides and additional hot sauce, it still just tasted like oil to me. \nThe good news: they had great chips and good portion sizes.", "author": "Jen S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-09", "description": "Best plantains ever.  Such a tasty, light and fresh meal.  Friendly staff and lovely decor.  We will be back!", "author": "Mary R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-04-10", "description": "Glena's? Tacos specialist indeed. Decent customer service. Had fun and satisfaction with my order.", "author": "Jude M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-16", "description": "Glena's catered my party at Third Rail and it was awesome.  It was easy to organize, food was delivered on time, and the tacos were so tasty!", "author": "Shannon H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-01", "description": "They very definition of a hidden gem! Great Cali-Mexican with a full bar in the sunny side of the city? Count me in!", "author": "Ryan B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-11", "description": "Yummy; great addition to the neighborhood. Looking forward to when they're open for dinner!", "author": "Soo J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-22", "description": "I like this place, good steak tacos.  Guacamole needs to be more guacamole less chopped avocados.  Not too happy that I ordered two $7 tacos and paid online for pickup then when I get there they won't even give me a side of salsa.  They claim it's 50 cents yet every table in the restaurant has a bottle of salsa on it.  I had no cash and left without the 2 oz of salsa I wanted.  Every taqueria in San Francisco provides salsa for free. -2 stars just for no free salsa.  It's like charging for ketchup for French fries.", "author": "Tbone J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-14", "description": "I love this place.  I have tried all the tacos with my wife and they are delicious.  I just came back to try the chicken torta for lunch and it was possibly the best fried chicken sandwich I ever had.  Staff is friendly and service very fast.", "author": "Sylvain F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-15", "description": "Love the fish tacos, some of the best I've ever had. I usually get 2 with the pickled vegetables. Their salad is disappointing for how expensive it is- it's really only lettuce and dressing but it's still good. The portions are smaller than typical, but great if you don't want to eat that much. Also there tofu tacos are insanely good!", "author": "Selby C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-21", "description": "The best tacos I've had in California! Every item on the menu is delicious and the space in the dogpatch is beautifully designed. Highly recommend!", "author": "Kerry T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-05", "description": "I looked forward to the arrival of Glena's and am NOT disappointed.  I have already eaten there five times, and gotten takeout once.  DELICIOUS!  I love the torta, the chips are the best I have ever eaten (made fresh, right there), the tacos are fantastic.  They don't have their liquor license yet (just a few more days), but given how good the limeade is, I imagine the margaritas will be incredible.  They are super friendly and helpful.  And quick!  Everyone in my family gives Glena's five stars!", "author": "Dawn J."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-04-09", "description": "Sad that this wasn't better since I live one block away. Carne asada taco was cold and the \"soft\" tortilla was stiff. Staff didn't really seem to care when I pointed it out. When you pay $20 for one taco, a side of beans, and a drink, it should be really good. Next time I'll just go to Tacolicious.", "author": "Chris B."}
