{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-15", "description": "I have been coming to this place since the womb. The prices are excellent for this area and you still get a satisfying meal. The staff is VERY friendly.", "author": "Anna R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-08-08", "description": "I got the Godzilla roll, which had a good amount of fish stuffed in it, unagi, avocado, and burdock root/microgreens. The presentation was beautiful, and it was pretty tasty overall. Unfortunately, it was a bit too small, which is coming from a person who does not eat a lot (at least in one sitting). I asked the waiter how many pieces it came with and was told 6 or 7 in response. In actuality, it came with 5 pieces. I went home and ate some fries to fill myself up.\n\nTherefore, three stars for small portions and mediocre service, especially for the price point.", "author": "Rachel L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-08-03", "description": "If cheap value and a quick meal is what you're after, Godzila fits the bill.\n\nIn lower Pac Heights where sushi joints are as rare of sighting like Beyonce and Jay Z's twins, you'd be pretty hard pressed to turn this place down. Basic rolls are under $7, jive ass rolls that are drowned in sauces come at $12 - $14 and appetizers are $1.50 to $6, man!! I haven't seen these menu pricing in SF in long while.\n\nI ate beforehand, but hubby was starving: 2 miso soups, agedashi tofu, spicy tuna roll, California roll and the dragon roll was only $39 including tax. I'm not sure about the quality of the sashimi cuts, but the portions look generous.\n\nIf Tataki has a ridiculously long wait, this place is aiiiight.", "author": "Janice C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-23", "description": "I've been here a few times. The sushi is just ok. It's more of a small, casual place, which is probably what draws people in, plus it's in a visible location. \n\nThe service is hit or miss. Sometimes you get your rolls fast and servers check in with you throughout, sometimes it can take up to 25-30 minutes, which is what happened last night. They said they had a lot of orders, but the place wasn't full, the people who were there before us already had their food so why would that affect our order. Also, anyone else in the room came in after we ordered. I don't buy that it takes 25-30 minutes to make food that requires no cooking. Not to mention the people that sat next to us had no problem getting their food shortly after ordering. \n\nThere really is no reason to come here anymore. Servers don't check in at all tables, just certain ones. Food isn't even that good, and definitely not worth the poor service. I'm not a food snob and I don't need to be pampered when I eat somewhere, but last night really turned me off from this place. I'm surprised it even gets as much business as it does, but a good location with little competition nearby will do that I guess.", "author": "Stacey L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-07", "description": "I wanted to have lunch before by appointment nearby and was craving Japanese food. So, I walked in around 12:30 on a Monday and they actually were not as busy as I thought. I was seated immediately. \n\nI decided on the chicken teriyaki bento box. My food came out in less than 10 mins. So, service was fairly quick as more people were coming in for takeout orders. \n\nThe miso soup and salad were standard. The California rolls were decent. I want to say that they tasted like they used real crab. However, I was extremely disappointed in the chicken teriyaki. The chicken was very chewy and such a small portion. I literally only had about 2 bites and couldn't even force myself to eat the rest of it. \n\nMy total before tip was $15.14 and I felt like I wasted my money on mediocre food. I will not come back.", "author": "Fallon P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-24", "description": "Ok folks, after not being here for months I am reminded of just how amazing the sushi here is. REAL crab in the rolls. Super fresh fish. \n\nWe have eaten at many other sushi places both in SF and Marin and after one bite here, I realized how this is so vastly better that it is a no brainer that when we want sushi- we want Godzilla!", "author": "Lorenzo R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-06", "description": "With the many high-quality sushi places around SF (including several Michelin rated ones, none less), one could say there is plenty of fish. To be honest, I was somewhat nervous about trying a place named Godzila Sushi, since non-Japanese-sounding names are almost blasphemous from a sushi purist's perspective. \n\nHowever I browsed through some of the photos and starting salivating over the delicious-looking, Godzila-sized rolls--even if quality were not Micheliin status, an abundance of decent rolls was enough to warrant a trek to Pac Heights. (And get gas at the Arco while you're at it).\n\nGodzila is one of those places that's ideal with a somewhat larger group, but not too large because the place is small. Leftover sushi is no bueno and you want to order enough variety to satisfy your curiosity, so 3-4 people would be ideal. \n\nThings we've tried (Disclaimer: this is over 2 visits... testifies to how crazy I am over trying all da rolls)\n\n(++) Kaarage: Quite good, very crispy. The pieces are small so get a lot of batter per bite\n\n(++) Nasu roll ($3.95, Japanese eggplant): simple and light\n\n(+++) King Kong roll ($13.50, spicy tuna/cucumber/avo inside | baked salmon with special sauce/scallions/tobiko outside): Godzila's version of the Lion King; creamy and indulgent\n\n(+++) Tinky Winky roll ($7.50, scallop/salmon/crab/avo/shiso leaf/sprouts/tobiko): more complex than your typical maki, and I liked how the scallop wasn't too fishy. This seems to be a favorite among Yelp reviewers. Note that the diameter is quite big, so may not be the best for a first date night if you don't want to open your mouth to monstrous (Godzila?) proportions\n\n(++) Hodorah roll ($7.50, BBQ eel/crab/seaweed salad/tobiko/mango/special sauce): a bit too heavy on the sauce for my tastes, but not bad (GOT fans would also be amused by the similarity to Hodor)\n\n(+++) Mothra roll ($13.50, BBQ eel/cucumber/avo inside | sizzled white tuna/bonito/ginger/tobiko/scallions/ponzu outside): Oh man, so good. It's kind of a hodge podge mixing heavy (BBQ eel/avo) with light (ponzu/white tuna/tobiko) but somehow it comes together flawlessly.\n\n(++) Megalon roll ($12.95, crab/avo/cucumber inside | fresh salmon/wasabi/tobiko outside): like a giant California roll topped with giant pieces of salmon\n\n(++) Rainbow roll ($12.50, crab/avo/cucumber inside | assorted fish outside): Here's where the non-perfect fish could be an suboptimal if you are a die-hard sashimi fan, but should not a problem for the general population\n\n(++) Destroyah ($12.95, shrimp tempura/gobo/cucumber inside | spicy tuna/ponzu/scallions/tobiko outside): the guilty pleasure fusion type with tempura--adds a nice variety to the otherwise more zen-like rolls\n\nWith *real crab*, creative rolls that are not just all tempura and sauce, and immensely satisfying portions, Godzila is definitely a staple.\n\nService is excellent too, and the Godzila-themed decor is light-hearted and fun (reminds me of the eccentric, themed ambiance of Halu ramen). Just be aware that the lighting is a bit dim at night, so if food pictures are very very important to you, it may be better to go during lunchtime. Parking isn't terrible if you are patient to circle around the neighborhood, and unfortunately Godzilla isn't there to remove buildings and create more parking spots for you.", "author": "Edna C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-05-14", "description": "Saba\nUnagi\nRock n Roll\nU-nasu\nMonster roll\nMochi (red bean.mango)\nTea\n\nAll was underwhelming. Not spicy. Sketchy service.\nStomach issues within 35 minutes!", "author": "Kevin F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-30", "description": "The cute interior is perfectly appropriate given this small sushi restaurant's name. The speciality rolls can be on the pricey side, but standard rolls and the sushi-for-two combo are more than reasonable.", "author": "Sarah B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-15", "description": "It took driving by Godzila Sushi about 800 times over about as many years before I finally took the plunge.  When I did I learned two things:  1)  Godzila Sushi is about as I always expected and 2) Godzila Sushi is also better than I expected.  File that away for the future.  \n\nGodzila met expectations in being what feels like a dying breed, a casual street-corner cafe with reasonably priced Japanese fare.  Studying the menu (there's tables and a sushi bar) I was first puzzled by the offerings as so much seemed to be missing; it turned out I'd missed an inner double-spread of menu pages which, once found, made ordering more simple.\n\nDining with a friend who doesn't like \"raw\", she pointed me toward her favorite, a Godzila Salad ($7.95) featuring both shrimp and crab.  I dismissed the salad at my own peril.  When it arrived I thought it was both tasty and a good value.  As a light meal, it would work, especially supplemented with an additional offering (edamame perhaps, @ $3.50).  \n\nI like raw but wasn't interested in getting creative.  A combination sushi dinner ($17.95) was an excellent choice.  7 assorted pieces of nigiri, a California roll, and miso soup comprised the order, and it was all very basic, satisfying, and filling.  Sometimes that's all you're looking for and at those times this is a great choice.  This meal and this restaurant.\n\nGodzila Sushi isn't rewriting the book on anything, nor do they qualify as a very Japanese- looking Japanese restaurant.  Who cares?  The food was good, the prices reasonable.\n\nIf you too find yourself driving by this place on the regular perhaps it's high time that you stop in for a bite.  I doubt you'll be disappointed and perhaps even, you'll be a little more than that.", "author": "Tracey A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-29", "description": "SUCH A GOOD SUSHI SPOT!\n\nGodzila is my favorite sushi spot in Pac Heights. To begin, the food is solid. Their menu has lots of options and the fish always tastes fresh! I usually order a combination of miso soup, sake nigiri and spicy tuna rolls and I've never been let down. Second thing working in this restaurant's favor is their pricing..... pretty fair compared to other Pac Heights sushi options. Lastly, the staff at Godzila is super friendly! All in all, a wonderful place that I plan to continue frequenting!", "author": "Katie C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-16", "description": "Godzilla is my go-to sushi in the city. I've been coming for years and I've never had a bad experience. The staff is exceptionally nice and I'm always pleased with the service. The sushi is good and the food/drink prices are reasonable. My favorite is the 49er roll!", "author": "Emma B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-06-19", "description": "Ordered the spicy tuna roll and megalon roll last night. But not before a server brought me someone else's credit card slip to sign, before I had even ordered anything. The hell?\n\nWhile I was waiting for my order, couldn't help but notice one of the workers crouched behind the sushi bar eating something - totally against health code to eat next to a food preparation surface.  (I should have cancelled my order and fled at this point)\n\nI got it to go so didn't notice that the spicy tuna roll was actually a california roll with sriracha squirted on it until I was blocks away. Whatever. Ate it anyways. Both rolls tasted off, very not fresh tasting. I started to get a bad feeling about my choice of dinner. Roughly two hours later I had explosive watery diarrhea that wouldn't stop even after multiple doses of Pepto. Didn't sleep til 3am. More diarrhea after I woke up a couple of hours ago.\n\nI'm suspecting that they snuck escolar (the \"ex-lax fish\", look it up) into one of the rolls by calling it something else, a common tactic of unscrupulous trashy sushi restaurants trying to save money by not buying more desirable cuts of fish. Or, they served me rancid food. Either are unacceptable.\n\nI know this is a terrible neighborhood for food options and you might feel desperate but for the love of god DO NOT eat here. Take your money elsewhere, your bowels will thank you.", "author": "Brendan R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-30", "description": "My favorites are the Godzilla green roll and the sashimi combo. I always have fun at this restaurant. I go here mostly on Friday evenings with friends or coworkers. Everyone is always able to find something they like on the menu. Reasonably priced. If you still have room for dessert, try the green tea ice cream or green tea cheese cake.", "author": "Mei L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-07-13", "description": "Came here for lunch and had the chicken teriyaki bento. Nothing special but not horrible either. Service was fast. Sushi was tiny. Don't get the tempura roll.", "author": "Alice P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-14", "description": "I absolutely LOVE this sushi spot. Love the Godzilla theme. And even beyond this theme, it has the feeling of a small, more traditional sushi place that I love. The restaurant is ran by some amazing sushi chefs and all the employees are quick, friendly and efficient! And reasonably priced!\n\nMy family and I have been coming to this restaurant for the past seven years and it's been a pleasure to see this place improve over time. I remember when the salads were so tiny, but now the salads are HUGE and delicious with tomatoes, cucumbers and spinach even!\n\nI will admit, it's not really a spot for every type of Japanese cuisine food, but they do have most things like udon, donburi and bento boxes! The sushi is definitely where they excel. However, what this place really excels at though is the friendly community-like service. Their restaurant always reminds me of home.\n\nThe sushi chefs and servers even remember who we are, remember our strange dietary requests (i.e. like no cucumber in sushi rolls!) and as soon as we walk in they know how many of us are dining! \n\nThank you so much for the amazing food here. My mom, sister and family hope you continue to keep making the great sushi you do! Though I'm moving to NYC this fall, anytime I come to visit SF, I'll make sure that this becomes one of my spots to visit.", "author": "Aaron G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-19", "description": "Wow first time here.. found great parking across the street.. this place every very reasonable price.. n size of Alice fish wow.. perfect mouth full size lol.. sushi bar once walk in.. and few small tables too.. this place open way long few years.. but now I know what I been missing .. if anyone crave sushi like I do... come come people n piggy out.. yesss", "author": "Crisy G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-04-24", "description": "Sad to write this as my girlfriend and I used to come here all the time and used to love it. Popped in here recently to pick up a little nigiri to go. I hadn't been in several years and apparently it has gone really downhill. $7 plus tip for two pieces of the worst quality sake toro nigiri I have ever had; super fatty and obviously farmed, super think slices -- this was mostly rice and very tiny (which I don't mind when the quality is high). They also now have a $20 minimum for credit cards, just FYI. Looked at the fish in the case and nothing looked fresh. I had been told by the server that the sake I ordered was the most fresh. I won't be going back :(", "author": "Kristin S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-09-25", "description": "It's time for me to update my review here.  I still like coming here if in the area (like when going for after-work exercising walking up and down the Pacific Heights hill).  The sushi is still decent albeit not great, but more than will do for the price if I'm not up for something pricier.\n\nMost of the staff is nice.  However, there is one that creates an issue.  It's the young lady that wears glasses.  I've had a couple of encounters with her where I feel her attitude is bad.  One time a while back I came and signed in on the wait list.  I was called by a staff when a table became available and sat down as directed.  However, later this girl accused me of just sitting down without signing in on the waitlist.  I was so mad, especially after she didn't even apologize when pointed out that I was directed to sit down.  I didn't take up the issue further at the time.  However, on last visit I was given a \"have a seat\" by one of the sushi chefs (since they pretty much view and know me to be a regular), and so happens that same girl was working that night and again questioned by process of sitting down.  Again I was upset with this person (and still the only staff here I feel this way about).\n\nAnyway, I guess for future visits I'll come and just hope she's not working on the particular day.", "author": "H K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-25", "description": "Best sushi bang for your buck in SF\n\nOnly sushi place I've ever left legitimately feeling full", "author": "Lily T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-29", "description": "Quick and attentive service. Hot & delicious Miso soup. , really good sesame dressing on the garden salad. The  in general sushi was good but not unusually except surprisingly the eggplant sushi( that was delicious). Also the bento boxes are tasty and well portioned.", "author": "Terrance G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-10-05", "description": "This place is as authentically Japanese as Godzilla is real.  Anyone else notice that Godzilla is spelled incorrectly? Godzila? \n\nI've only been here multiple times on a lunch break from work and I notice a majority of patrons ordering a bento box, which is the generic and mainstream equivalent to ordering a pad Thai at a Thai restaurant or sweet and sour pork at a Chinese restaurant.\n\nI like things fancier.  I only order off the special menu written on the chalk board wall and usually there's three specialty rolls.  Last roll I got was the Warriors Roll which consists of mango and asparagus in the middle topped with toro.  I have to say this roll is better than the last rolls (49er, etc.) I've had.  Maybe their sushi technique has improved because the roll had the right balance of rice and fish.  I hate it when the rolls have way too much rice in proportion to the fish.  Also ordered agedashi tofu and wish the tofu soup was piping hot, not barely lukewarm.\n\nThe special rolls are pricey ($13-14) given that it's not top notch fish and this place is nothing particularly trendy or nice, cue Ozumo.  Service has always been friendly and while it's not the best sushi I've ever had, it fits the bill during lunch time (mostly for geographical reasons) when I get a sushi craving. \n\nMore like 3.5 stars.", "author": "Bailey N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-01", "description": "Good service, delicious food, small and friendly. Came in with my wife and we enjoyed our dinner with cero problems, the wait time for our food was pretty quick (reasonable wait time). Will b back again when I visit the city", "author": "Frank B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-11-29", "description": "Decent quality of sushi and good prices especially for the area. The service was nice and attentive and there is plenty of seating inside. \n\nMy boyfriend and I got the tempura shrimp and vegetable appetizer ($8). It was on the oily side but pretty good. We ordered the salmon skin roll ($5), eel roll ($6), salmon kamikaze roll ($6), and hodorah roll which had salmon, crab, and mango ($7.50). I liked the hodorah and salmon roll the most. Neither of us were too big of a fan of the salmon skin. It was drier than other places I've had it at.", "author": "Linda X."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-28", "description": "I was hungry and I wanted to eat and this place was next door to where we were hanging out at so we went inside and they weren't open yet! I waited though because at that point I knew I wanted a Unagi Donburi (rice bowl with eel), and they were nice enough to at least give us water while we waited.\n\nWhen I got the Unagi Donburi, I was a little sad. It was a lot smaller than I thought it would be. On the flip side, it was really good. The rice was warm, sticky and delicious and the eel was really good and I liked the seaweed as well.\n\nOverall, it was really good, but it was more of a large snack than a meal. I know if that's the case for other items on the menu, but any additions would have totally stacked up the bill.", "author": "Sophia Y."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-02-20", "description": "Mediocre. Overpriced sushi. It was really disappointing to spend way too much money for lunch and not be satisfied.", "author": "Priti K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-02", "description": "Previously ate here and ordered a couple rolls for take-away. I didn't really enjoy it, but I'm also realizing that in general, I should never order sushi for take away. It just isn't as tasty without the gobs of ginger and dine-in experience that makes eating sushi so enjoyable. \n\nThis time around, ate inside the restaurant and had a much better experience. Their chicken karaage was one of the most tender kaarages I've had. Tender, juicy, yummy. Also had the sashimi combination that came with an assortment of tuna, salmon, octupus, mackerel, yellowtail, and white tuna for a reasonable price of $21.95. The Godzila roll was also nice, with a bit of spice and good flavor. Good neighborhood sushi in the Pacific Heights area.", "author": "Will H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-04", "description": "Godzila Sushi is, by far, one of my favorite sushi places in the city. The fish is really fresh and the service is great. I highly recommend their sake, hamachi, and tomato sashimi. There's a lot of it, but it's so good. They also have a great selection of sake and beer. Next time you want sushi, try it. You won't be disappointed.", "author": "Erin D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-01-28", "description": "Cozy spot in a great location \nFriendly service. \nSoup had two tiny pieces of tofu. Not as salty as other miso soups which was good. \nAll the rolls we got were mediocre. Even the sake was mediocre.", "author": "Tina H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-24", "description": "Friday family sushi \n\nThey treat our family so good and we come almost every Friday now !!!\n\nWe live this place", "author": "Azikiwee A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-26", "description": "This Sushi joint has been around a long time.  I had not been there in 15 years.  My husband and I had Tempura, Dragon Rolls and Monster Rolls.  Just as delicious and melt in mouth as I remember.  Service was efficient and price on lower end of average for SF sushi.  We Reccomend this establishment.", "author": "Kenneth N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-14", "description": "This is on our way home and we finally stopped in to check it out.\n\nWe ordered gyoza for an appetizer, my husband had the Godzilla roll and I had the Megalon roll. For dessert: mango mochi ice cream.\n\nThe rolls were a good size and the food over all tasted fine. We left feeling satisfied, not over fed :)\n\nMay come here again since it is on our way", "author": "Jenny M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-05", "description": "this is our go to neighborhood sushi spot. sure it's no ju-ni, robin or hinata but it does the trick when you're looking for a casual dinner with quality fish and quick service. plus the value is great. two of us usually leave full and a little tipsy for $50 (with tip).", "author": "Emily C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-15", "description": "Came here with a friend on a Wednesday night just recently. It had been my first time trying Godzilla! We had been greeted by a nice server who sat us promptly. I ordered a avocado roll and spider roll, both are delicious! It's a cozy place with a nice size sushi bar fit for about 8 I would say.", "author": "Margarita R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-05-31", "description": "Stopped Godzila by for lunch with a group of friends.  This place was a solid 3 star (maybe 3.5 star) establishment.  I tried the spicy tuna roll.  It was decent.  No the best by any teams, but it certainly hit the spot.  I also tried the unagi donburi bowl.  It was also decent.  A couple pieces of unagi (with skin and bones) placed over some seaweed salad, rice, and pickled ginger.  \n\nThe service was fast and friendly.  The restaurant was clean.  Overall I would go back to grab some food for lunch.", "author": "Paul W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-27", "description": "One of the best value for sushi in SF. We have been regularly coming here for 4 years without ever being disappointed.", "author": "Theo F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-15", "description": "Love David and the crew.  Service is always good.  Sushi is the freshest.  The have a great sake or beer happy hour.  The BBQ eel roll is my favorite.  When go in say hey to David, the guy behind the sushi counter he is cool.  Enjoy!", "author": "Pam P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-09", "description": "Another one of my go-to places for lunch. I love the sushi here. The proportion of rice to fish is perfect. They only use real crab and their sashimi is always fresh. I have never craved another sushi roll more than I have their Tinky Winky roll (scallop, salmon, crab, avocado and tobiko). It must be the shisho leaf that makes it extra fresh and delicious - just love it! You can't beat the price at $7.50 either. \n\nI also get their Salmon Donburi. The salmon is never overcooked and is served with perfectly steamed broccoli. I ask for extra ginger on the side with everything. Theirs seems to be sweeter than other places. Overall, an inexpensive spot to satisfy my sushi and fish cravings! Thank you Godzila!", "author": "Rona V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-09", "description": "Their Godzilla sushi is really good and I tried their sashimi tuna and salmon and it tasted pretty good. They were really fast as well. I walked down the street and it was ready in 2-3 mins. However there was a price difference between online and stated on my receipt. I didn't bother mentioning.", "author": "Nino A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-23", "description": "Godzilla is not a 4 start Michelin sushi place, but they definitely aren't trying to be either. Godzilla is a neighborhood staple serving tasty, fresh sushi at a VERY reasonable price.  You could definitely get full for about $15/person, which is hard to do with sushi (or at least for my sushi loving stomach).", "author": "Spencer S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-07-28", "description": "I have a go-to sushi place in the city. I love that sushi place. But it is in another neighborhood, and I was feeling lazy, so I decided to try the one that is in my hood. \n\nThey just stared at me when I accidentally spilled an entire bowl of steaming hot miso soup on me. I had to ask them - twice - for a towel and extra napkins.\n\nAlso, the sushi is not great. Fine for people who like \"special\" rolls I guess, because mayonnaise and avocado can cover up the taste of anything.", "author": "Akemi Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-29", "description": "Their interior is rather small so you'd have to wait a bit especially if it's dinner time. My bf and I came around 8:30 pm and we waited for around 15 mins which isn't bad. The prices were great! We got the salmon donburi (main reason why I came here) and Tinky Winky (?) roll and it did not disappoint! Service was just average. Better than other Japanese restaurants services.", "author": "Tee N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-13", "description": "Great customer service and equally as great food. The staff is friendly and this establishment is very clean. Portions are a little small but everything is priced decently. This isn't a place to bring your whole family being as it's san Francisco and everything is cramped, but if you are in the area with a friend or two i'd check this place out. it's cutely decorated as well...not that that matters much. get the spider roll or godzilla salad if you come here! :)", "author": "Delano P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-04", "description": "Excellent! Always is. Friendly staff.  Godzila was looking everywhere. Reasonably priced. Sweet unfiltered saki was good too.", "author": "Fred B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-03-31", "description": "Overpriced for the quality and not consistently fresh. Convenient to where I live, but not worth it.", "author": "Janelle F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-02", "description": "I, unlike my friends for whatever reason, actually really enjoyed my food here. They use real crab meat instead of the nasty imitation crab, and the other ingredients tasted really fresh. I ordered the spicy California roll, and the sauce was not too overpowering, but it was definitely spicy. My only complaint with my food was that the roll was really tiny compared to their other rolls. \nBecause I got my food on time and because it was good, I had no other problems here.\nMy friends didn't like it because all of our food came out at much different times, and they were very slow to service our table. We all enjoyed our food, though.", "author": "Colby D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-18", "description": "Good service, fresh and big pieces of fish.  I was very well fed with 7 orders of nigiri off their special menu for under $50. \n\nI'll be back next time I am in the neighborhood around dinnertime.", "author": "Bearman S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-16", "description": "Came here with my coworkers for lunch on a weekday and really enjoyed our meals here. Fast and friendly service, meal prices are relatively cheap, and the quality of food is great for the prices.  It's not top-quality sashimi or anything, but my salmon donburi tasted fresh and delicious!  It even came with seaweed salad, a nice surprise! My coworkers orders some sushi rolls, tempura, udon, etc. and all seemed to really like their food. The ambience was nice- low key and decorated with cute Godzilla-themed paraphernalia. It was the perfect place to grab some sushi and/or other Japanese food for lunch. We showed up just before noon, and it did get crowded as we were finishing our meals, so it's helpful to show up early in order to avoid having to wait for a table. I'm looking forward to coming back for more delicious food in the near future!", "author": "Sarah W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-09-29", "description": "Sushi is so gross here and they hardly have any rolls to choose from. And my glass of water smelled like sewage.", "author": "N N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-30", "description": "Excellent food, well priced, a little cramped but a wonderful place for a truly delectable meal, alone or with friends.\n\nWent there with a friend for a late dinner, it was packed so we sat at the bar. We ordered 4 appetizers & 3 rolls, everything was prepared superbly & very quickly.\n\nThe tome was excellent & had me reminiscing my favourite sushi market in Hokkaido. The seaweed said was the best I have had in the US, and all the fish was very fresh & well selected! This is my new sushi spot in the bay area, plus who doesn't love the Godzilla motif!;-)", "author": "Ro B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-02", "description": "Delicious, reasonable priced, and really good service. Asked for some substitutions and they gave me no grief about it. Recommend for a decent weekday sushi experience. The decor is pretty amazing!", "author": "Jesus G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-10-09", "description": "Well. What can I say. It was terrible service. For a place with ok Chinese sushi. It was such bad service that I would never go here again. \n\nThey should fire the hostess. But I bet she's the wife of the owner. Which is why she has such a bad attitude problem.", "author": "Jesse J."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-04-23", "description": "Ordered a golden dragon roll to pick up and they gave me some pre-made roll that wasn't a dragon roll. Check your order at the restaurant.", "author": "Nathan G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-05-11", "description": "Came here on Friday and the sushi was descent. It was quite expensive, but that's how it is around here in San Francisco for some sushi. \n\nOrdered: \n-Godzilla Roll \n-Surprise Roll\n-Twinky Roll \n-Fried Chicken \nLarge Sake and a few beers to top it off. \n\nThey had two TVs and I sat in the sushi bar. The sushi chefs had no interaction with any of their customers whatsoever. \n\nThe service was alert and tentative. Fish was fresh and I would probably come back.", "author": "Adam J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-04", "description": "One of my favorite sushi places in SF. Love the spider roll and sashimi.  Has been around a long time which shows how faithful its patrons are.", "author": "Christian B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-27", "description": "This is my favorite go-to place for sushi. I kinda don't want to tell other people about it.\n\nI always order the salmon donburi, which comes with miso soup and a house salad.  $11.50.  Such a bargain.  I know it's not a good thing to use \"bargain\" when describing sushi, but in this case, it's really not a bad thing.  \n\nThe quality of the fish varies from visit to visit.  It's always pretty decently good (especially for the price), and on some visits, it's phenomenal.  My last visit included some of the freshest fish (salmon, tuna, white tuna) that I've ever had in SF, so I really needed to update my review. Maybe it was just the fact that they just had a new shipment of fish, or the fact that I sat at the bar.  Either way, it was amazing.\n\nThe service has always been fast.  There's never been a line or wait here.  (One of my few favorite places in SF where I can get a quick meal!)\nI much prefer this place to the other nearby sushi places (Tataki and Tsunami).", "author": "Jeanne L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-02-06", "description": "If there was a 3.5 stars option, I would use it in this instance. Decent quality sushi but not a high quality sushi restaurant or atmosphere. If you like cheap, hole in the wall sushi joints, you will definitely get your rocks off here. I would suggest the Godzilla roll, the spicy tuna roll, or any of the Asian soups. Being a sashimi freak myself, I ordered the sashimi sampler because of the amount of fish you get for your dollar. However, I was sightless underwhelmed, despite snapping a decent photo (see below). Get a roll, have a beer, and definitely grab some Miso soup. :-)", "author": "Garrett F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-26", "description": "Been coming here since 1995, and I am a fan. Is it the best sushi in SF? Heck no!  But, it is a great value for quality ratio, the sushi is solid and affordable, the staff friendly.  Sometimes new staff are young and inexperienced - read scatterbrained - but they mean well, and are ready to correct delays with a smile.\n\nNow that we have 3 kids, they are welcome and well fed here", "author": "Massimo M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-06-01", "description": "I am writing this review on behalf of my lovely wife. Who for the second time eating at this establishment became violently ill. She ordered teriyaki chicken and California rolls. Both times she ordered the same thing. We will not be visiting this place again. If you would like to get mud butt then be my guest and go and eat at this place.", "author": "Jay S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-23", "description": "You would never guess how good this place is just by peeking in. The portions are generous and the sushi is off the charts. A true neighborhood treasure.", "author": "Colin J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-06-03", "description": "Ordered the salmon skin roll, which came out hot and it wasn't crunchy. Would not recommend this roll. Seaweed salad and sake roll we're both OK/good. Overall, Godzilla is not the best or highest quality sushi in town but a solid option for those in the neighborhood. I thought the menu was quite limited- not many options compared to other places. Great ambiance but does get rowdy at night.", "author": "Sarem G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-27", "description": "Cheap, fresh, no fuss, yum. Perfect place for easy sushi. Def a local spot. I love their nigiri. Particularly their salmon is always good.", "author": "Julia M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-24", "description": "Awesome food, service is quick and to the point, prices are insanely reasonable AND fish is very good quality. This hidden gem is exactly what I'm looking for at least 2 nights a week. Highly recommend the 49er roll and the godzilla salad.", "author": "Erin K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-07-03", "description": "This place is ok for a quick lunch. \nThe service isn't the best, need to raise your hand a few times. \nClean but alittle raggedy looking. Sushi chef is very nice though. \nI sat at the bar today and the fan was placed on the bar very noisy. \nI got the King Kong roll it was good but I wouldn't say worth 12$. The salmon on the outside still had some skin on it, which I didn't like. Also there was something floating  at the bottom of my water glass. Didn't drink it. \nOverall, not my first choice for a sushi place.", "author": "Y R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-06", "description": "This is probably one of my favorite sushi places in the city. It's good sushi, it's not going to blow your mine but it's good, and it's not going to cost you your whole pay check. Definitely check it out", "author": "Barrett Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-04", "description": "Really good sushi for the price you're paying, and the restaurant is Godzila (with one 'L' for trademark purposes) themed. What more could you want?\n\nI also got a great t shirt from them.", "author": "Kiyana S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-28", "description": "Your review helps others learn about great local businesses.\nThe best sushi we had in 3 months\nPlease don't review this business if you received a freebie for writing this review, or if you're connected in any way to the owner or employees.", "author": "Mariana J."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-04-05", "description": "Horrible service from a server who seems to had a bad day with her attitude toward customers. I have ordered a miso soup and chicken teriyaki. I have received soup without spoon which I have to ask for. Chicken teriyaki taste really bad with no flavor and the 6 pieces of sushi that comes with it were not good. I would not recommend this place.", "author": "Yana Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-24", "description": "This place deserves 4 stars! I don't know why it's rated poorly. People shouldn't expect the best of the best, but it's the best for the prices!! I'm sick of overpriced sushi in the city, and so Godzilla is a good change of pace. Friendly sushi chefs, slightly slow service from the tables though. Silly cheesy decor. The fish is good quality and they have a variety of options! Happy hour for beer and sake too! Minus a star because they didn't have the fatty tuna my friend wanted, and because when we got to to go one time the temperatures were all off (but that could've just been from walking it home that night).", "author": "Jessica V."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-11-13", "description": "Have got unfresh 49's roll today. And the salmon had skin on it, so awful. Before it was great most of times. Very disappointing.", "author": "Lyubov S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-10", "description": "This place was delicious!\n\nI love sushi but I'm on a low carb diet so rice isn't something I love to eat. I have tried ordering sushi a few places with 1/2 rice or no rice and failed. But at Godzilla the server knew exactly what I was talking about! I would definitely stick with 1/2 rice next time. It was so good.\n\nThe quality was great. We loved the Godzilla Roll, the Rock'N'Roll and the Scallop Nigiri.\n\nThe sake is well priced, too!\n\nService was a little less-than. I had to raise my hand for 2 minutes before they came over, at one time.", "author": "Brie P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-03-28", "description": "The food was ok . We only came because my son is totally into Godzilla. There is a big mural on the wall and a few Godzilla figurines behind the but it isn't anything fantastic. I would have given it a slightly higher rating but when we wanted to order shirts, she refused to believe what size shirt I wore and insisted on bringing me an extra large mic to my embarrassment. I know what size I wear, much more so than a woman who saw me for 5o minutes. I am over weight. That is because I became disabled due to a home invasion where I was almost murdered. It changed my life drastically and I try to live with it but it really bothers me when strangers judge me without knowing my story- particularly in front of my 8 year old who only sees a fantastic mom.", "author": "Barbara O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-17", "description": "Who wouldn't like this place. The place is decorated Godzila style. Everything is fresh, reasonably priced, and tasty, but my favorite are the special rolls:\n\n1. Godzilla roll: (order this everytime)\n2. Surprise roll: (this is one of the most expensive on the menu but not my fav. The outside had scallops but the inside had mashed up stuff which I'm not a fan of)\n3. Tinky Winky Roll: fun-er to say than eat\n\nWill definitely come back! Street parking easy.", "author": "Logan N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-12-06", "description": "Have been coming here for over 10 years because of the excellent quality sushi...but they must have a new chef because the pieces of fish are now WAY too big.  The ratio of fish to rice is way off which makes it simply unappealing.  Sushi size matters!  It should be bite sized!", "author": "CH B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-06-20", "description": "Came here for a mid-afternoon sushi snack. A divey, affordable sushi spot - my roll was pretty darn good for 5.50. Not a destination, but if you live around the corner or are strolling by, worth a nosh.", "author": "Andrew K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-03-12", "description": "Great spot for large groups, sake, beer, and a ton of rolls. There can sometimes be a wait, good thing there's a bar across the street. \n\nCHEAP", "author": "Wendy K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-22", "description": "GODZILA!!!!!!!!!  I liked the mid lunch/dinner visit for a snack here.  We ordered Chicken udon and Spicy Tuna combo.  For $10, we got a nice helping of noodles and 4 GODZILLA-SIZED pieces of sushi.  Left full and happy.  Nice location too.  The service was fast and friendly.", "author": "Brian H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-15", "description": "Reasonably priced, great quality sushi with plentiful flavors and combos. Attentive sushi manufacturers, AMAZING (and cheap) plum wine, lots of ginger and wasabi. BF got the Rock and roll & Nigiri and loved it. I got the King Ghidor and the Destroyah. Solid, solid choices.", "author": "Shaymaa M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-12", "description": "I've been meaning to write this review for the past 3 years. Better late than never, amirite?\n\nI recommend this place to all colleagues, friends, out-of-town guests, people who ask for recommendations on where to get great sushi. \n\nI've been going to this place for 3 years now and it never gets old. You're sure to see me here at least once a week...sometimes 2-3 times per week! I highly recommend their Spicy Girl and Mussels for appetizers. Yum!\n\nTheir customer service is phenomenal and all employees are so personable. \n\nGodzila, I love you! Keep up the amazing business.", "author": "Kiara E."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-07-13", "description": "If you're a vegetarian, this place is not for you. Ordered a veggie tempura roll from the \"Vegetarian\" section and was horrified to discover I'd been eating fried shrimp! I've never had shrimp in my life, and I would have liked to keep it that way! :( Very disappointing, especially in such a vegetarian-friendly city like San Francisco.", "author": "Katie M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-14", "description": "Godzila salad is a MUST TRY 'if' you like salads with semi-heavy but uber delicious dressing! This salad consists of round lettuce, avocado, carrots, real crab meat, shrimp, spinach, tomatoes, and MORE! With a drizzle of creamy sesame dressing on top. *I am drooling as I write this review*---\n\nSpicy tuna roll; A-okay, not super stoked about it. I think its rather plain... eh?\nKamikaze roll; Yummy! Can't remember what's in it but..I will be eating this often when I come here for lunch.\nTempura udon; Love the broth and everything in it (even though its quite simple)\n\nI've been here about.. 4 times since I have started working in lower pac. heights. This place is decent pricing for Japanese Cuisine, customer service is GOOD, pricing is unbelievable and I always leave with a FOOD COMA! LOL.", "author": "Jo L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-09-23", "description": "I really wanted to like this place, because it's the closest sushi place to me. Unfortunately the sushi just wasn't that good. The fish wasn't super fresh and it was chewy. And spicy tuna roll had good flavor but it was enormous! Good sushi is bite sized, you're not supposed to have to take several bites out of a piece to be able to eat it. \n\nThe service wasn't great either, the waitress didn't understand most of what we said. \n\nOverall it wasn't terrible but it was still pretty disappointing.", "author": "Sofia F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-07", "description": "We've been frequenting this sushi joint for quite sometime. It's cheap, fast and the crew is nice. The portions are decent, and the sushi is good. It's not Nobu or Matsuhisa but then again you're not paying those prices. If you're craving for quick sushi bite and some Kirin then this is the place.", "author": "michelle z."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-12-13", "description": "Came here again for my moms early birthday dinner before we catch the Amaluna show at AT&T park and to my disappointment, the sashimi we ordered weren't fresh and were still icy, like it came out the freezer before they served us. Luckily service was good, and still the spider roll disappoints because the fried crab wasn't crispy and kind of soggy. Don't think I will be coming back here to try other things anymore, but will come just to eat the golden dragon roll and 49ers roll. Everything else could be better.", "author": "Amanda C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-07-05", "description": "I live close by this place, and used to go there frequently because I thought their sushi was good and reasonably priced. However, the last time I went, both me and my girlfriend got food poisoning! I was throwing up so violently for the next 2 days that my back was sore for the next week. I had never had food poisoning before and it was an awful experience. I'm obviously never going back and wouldn't recommend this place, unless getting food poisoning is your sort of thing.", "author": "Brendan B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-08-29", "description": "We had some tasty rolls here but out of all the fantastic sushi in this city, it doesn't exactly rank the highest. I must say it's one of the cheapest sushi bars I've been to in SF. The night we tried Godzilla they seemed to maybe have a new waitress because she really wasn't on the ball with service. We had to ask twice for a water refill and we had some spicy rolls. Not cool!\n\nThe one star of the menu was the Tinky Winky roll. Yum. Such awesome flavors going on, but only 4 pieces!? Make it 6 and we'll definitely order take out from you guys!\n\nWasn't really a fan of the sunset roll but that might be my own problem with shisho leaf flavor. \n\nThe takeaway: bad service, tiny place, cool godzilla artwork, decent sushi. Nothing to write home about. :)", "author": "Dana J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-18", "description": "Went here on a Saturday night and the place was packed. We had to wait about 5-10 min for out seats (sushi bar). I was happy to see a place that was busy because I find that means people think their food is good as was the case. We had the seaweed salad, miso soup, edmame, a dragon roll and a golden dragon roll. The sushi chef was very accomodating and customized our order. I'm used to sushi places that have a happy hour menu and they do not and my only other gripe is that the waiter was doing a poor job and getting our drink refills. But overall the place is pretty good.", "author": "Robert B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-12", "description": "Divisadero's 'cheap sushi' option. Great for the price. Fast & friendly service. Place could prob use a good deep cleaning. Will be back!", "author": "Harold C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-04", "description": "Sake toro, walu, hotatei, hamachi, sake, ikura, ika nigiris - all good. 4 stars\n\nGodzilla salad - 4 stars\n\nPlayboy and White Dragan roll - 2 stars \n\n3.33333333... we'll round up! This is a chill place to have dinner and was decently priced. It's not amazing and some of the rolls are redundant (I'm more of a nigiri person anyway), but the night we went the fish was fresh and everything tasted good. The Godzilla Salad was a really nice surprise, think the side salad you get in a bento but dressed up. No complaints for $5. Sometimes it's nice to not make reservations, wait, make a trek, or break the bank for dinner. A lot of people have said it already, this is a great neighborhood spot. We found it accidentally while looking for something else, but we'll be back.", "author": "Alan C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-04", "description": "The sushi rolls are filling, the large beers are deliciously cold, and the miso soup is delectable. Gozilla Sushi wins on taste and feels like a neighborhood hideout. It's a little spendy for sushi rolls, so try coming for HH.", "author": "Regina D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-05-02", "description": "I really like Godzila :)  Good, fresh sushi that is on the cheaper side with a bunch of Godzilla memorabilia around.  I've been here a few times already but can only remember my recent order that included:\n\nKing Kong Roll - My fave here thus far!  I don't usually like baked salmon but this one was very tasty imho.  \n\nTinky Winky - Not too bad.  It had fresh, real crab so that's a plus!\n\nNegihama - Negihama is negihama.  Something about yellowtail and scallions gets me drooling for some reason though.\n\nChicken Karaage - YUM!  It came out piping hot and juicy and comes with this delicious aioli dipping sauce.\n\nService was great.  Always came back to refill our waters without making us ask.  Super friendly people and clean bathrooms :)", "author": "Jane N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-18", "description": "Good solid sushi. Very busy on a Friday night with a half hour wait. Typical SF if you don't have a reservation.", "author": "Prescott B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-09-26", "description": "Solid sushi.  I've never had lettuce in my roll, I don't particularly hate it, don't love it.  It was more like \"oh, thats lettuce!\"\n\nThe surprise, spicy tuna, and gyoza all hit the spot.  $ 32 bucks without drinks gave us a nice light walk home.  P.s. The chef nearest door is so sweet. While he was training the waitresses how to write orders he continued to serve and be engaging.\n\nGood end to a horrible day of my cart being towed and $380 worth of b.s.!", "author": "Milan F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-29", "description": "Fresh and Amazing! Highly recommend the King Kong Roll and the Destroyah roll. Also very fairly priced!!! Try it!! Service was attentive and polite.", "author": "Leon C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-30", "description": "Best sushi this side of the city, nice cuts and always fresh. Great service & always friendly. Why we always come back", "author": "Ferdie L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-08-12", "description": "We've been going to and, lately, due to our toddler, ordering-in from Godzilla for many many years... But I'm updating my review because, while the sushi is good (not great), the service just ain't worth it anymore.  They're rude on the phone, they're rude upon entry to pick up an order, they're rude if you take a split second whle deciding which rolls to order, they're rude if you ask about new rolls or what's fresh or any normal questions for a sushi place, and now they even \"mandate\" a 10% tip for pickup orders which I'd be THRILLED to pay... but for the rudeness.  I've tipped 20 and 25% sitting there -- for years... And 10%+ on pickups... and I'll be thrilled to tip, for nice service from a nice person. \n\n(Also, don't demand that I tip you 10% on a pickup. If that's your policy, let me know on the phone when i call it in... and have it on the bill). \n\nWe have spent thousands of dollars here... and have recommended it to dozens of people who have also eaten dozens of meals... and, again, the sushi is solid, midweek neighborhood fair - rarely outstanding, rarely bad, usually good or very good.  But this is San Francisco and there's enough good or great sushi -- including places on Divis! -- to take Godzila off the list.\n\n(And a \"thank you\" wave from the chefs as you walk out is nice... but it doesn't make up for the consistent inattention, lack of help, and demands on the customer from the wait staff.)", "author": "Phil H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-10-31", "description": "Had a quick lunch here with my friend the other day and I will not be returning. \n\nIt's lunch time but the restaurant was not full at all. I arrived slightly later than my friend and immediately after I sat down, the server already wanted to take order from us. Told her I just got here and need a minute to look at the minute; shortly afterwards, she came up again and asked to take my order. I mean, really? It's not like there were people waiting for table and it almost felt like she just wanted to give us food and kick us out. So we ordered anyways - my friend's order came - I waited, thought maybe they need more time for my chirashi (raw fish with sushi rice) than my friend's teriyaki? I waited and waited and waited - my friend was finishing her food and I was like.. WTF?! Then the server suddenly looked at me and realized I didn't have my food and told the \"sushi chef\" to make my food immediately. Sooooo after rushing to get my order you forgot my order?! REALLY? \n\nFood is okay for the price and since there's no other Japanese restaurant around (unless you go to Japan town), it's somewhat a \"monopoly\". But no, would rather get a burrito next door or something from Starbuck.", "author": "Doris H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-16", "description": "Sushi was really fresh, rolls were well made and the service was excellent. Not being in a busy part of town made for a quick seating!", "author": "anil b."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-13", "description": "My go to neighborhood spot- very consistent, good variety of rolls, high quality fish. Sashimi is always good. Quick service and easy for take out.", "author": "Sarah G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-13", "description": "Love love love the King Kong Roll and the service is great! They are always accommodating, patient and informative. Best affordable sushi have had in SF.", "author": "Jessie B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-06-12", "description": "Food is good, service very unfriendly and slow as molasses, don't really call it service. Just like food", "author": "Amy M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-07-22", "description": "Super convenient location for me when I need a quick sushi fix.  Service was slow.  Fish was okay.", "author": "Vance O."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-01-15", "description": "Since this place is super close to my work, I wanted to give it a chance. But I've given them too many chances now and will have to give up. Although the owner (?) is friendly, says hello to patrons as they come in and thank you/bye when you leave, I've just had too many bad experiences with their service. Today for example, I waited at least 5 minutes to get a table or be seated (there were 2 empty tables when I initially walked in and no one in front of me). I was also willing to sit in the tight space in between 2 other diners at the bar. However, after I asked if I could sit at one of the just cleaned off (but still dirty) tables, and actually sat at the table, I was then asked by the same person I had just asked to move to the bar since there was a party of 3 coming in. He could have just asked me when I initially walked in to sit at the bar, but instead he let me wait, let me sit, and then asked me to move. He then asked his coworker to talk to me. Which at that point, I left. The hassle and embarrassment is not worth it to me, and neither is their mediocre quality sushi. Do yourself a favor and pass on this place and find better sushi at close by Japantown.", "author": "Caryll P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-07-21", "description": "Decent sushi, nothing super fresh or that will knock your socks off.\n\nAttentive staff.", "author": "David J."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-08-14", "description": "A three is generous... I kind of felt iffy about the quality of the sushi - and I never feel this way.", "author": "Katie D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-19", "description": "I've been going to Gozilla for 20 years. New ownership as of a few years ago, and it's ever better than before. The spicy tuna roll truly rocks. The hot mussels are the best I've had. Very friendly staff. David the owner always greets us with a big  hello and sends a little something over before we've even had time to order a drink. Love this place. Not pretentious...just very good.", "author": "Dan F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-19", "description": "I love this place and am happy to give it 5 stars! The fish is fresh, the prices are right, and the service is fast fast fast. The California Roll is made with real crab - refreshing! This has quickly become our go-to sushi spot when we have a hankering.", "author": "Convict T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-03-23", "description": "Eh, the food was alright. \n\nWe came here with a party of 5 for dinner, and I didn't like how all of our orders came out on a large plate. First of all, we didn't know whose was whose. We had to get the waitress over to help with the confusion. \n\nI ordered Tinki Winki and Voodoo roll, and they were okay too.", "author": "Jen H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-10-22", "description": "Just had the chicken teriyaki donburi. It's boiled chicken and 2 pieces of both brocolli and cauliflower atop steamed rice drizzled with teriyaki. Steamed rice was cooked perfectly. Everything else was gross. Service was fine.", "author": "Yelp O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-19", "description": "I work in the area and come here for lunch at least once a week. How can you beat a high-quality sushi combo for $10 (sushi combo A) or $12 (Sushi combo B)?? Though the service can be a little bit slow during the busy lunch rush the food never dissappoints and the sushi chef is very skilled and kind. This has quickly become one of my favorite sushi places in the city!", "author": "Maya C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-01", "description": "This is a great place for some good food before or after visiting someone at the UCSF Medical Center. (Definitely.... don't eat at the hospital.)", "author": "Clear B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-09-07", "description": "There are better sushi spots in the city for sure but it answers to those moments when you don't want to go far from the neighborhood but craving sushi. I will say I'm a roll person, so I can only base off of those. It is a little cheaper than other sushi locations. The service could be better. I haven't been back since my first experience.", "author": "Ashley W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-01-02", "description": "Finally got a chance to try the lunch.  They just started opening for lunch in '12.  They have the usual bento/sushi/teriyaki box lunches along with sushi and full menu.  \nOrdered a combo box and it came pretty quick.  The service was good and the food was decent but just average.  Nothing was bad but nothing was exceptional either.  They seemed to have a long list of custom sushi rolls so that must be their attraction.  Godzilla might be a better pick for dinner rather than lunch.\nParking is tough on nearby streets.", "author": "Pablo R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-01", "description": "New owner. Updated interior space. Looks like Godzilla has grown up a little bit with the new look...I dig it! They've got a brand spankin' new flat screen mounted above the entrance and took down some of the random decorations from before. The offerings have changed slightly - new rolls, updated menus.\n\nBest thing is that the service, prices and quality of food that you'd expect from Godzilla is still the same :) I really love this neighborhood gem.\n\nPS. The new owner is one of the main sushi chefs.", "author": "Yee-Shing W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-08", "description": "One of the very best Sushi restaurants we've ever been to--and the prices were AMAZING--especially for San Francisco! The nigiri/sashimi was out of this world great!", "author": "Jeanine C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-01-25", "description": "I had a hankering for uncooked fish, and this place is right across the street from my yoga studio - so I remembered it.  \n\nSince when does nigiri come with seaweed?  Since when does nigiri not have a slice of fresh fish atop a small ball of rice?  Since when is the diameter of the roll so much so that it's tough to keep it as one bite?  And what happened when I tried to bite through one side and make it a two-biter?  - it fell ALL over the place.  In the privacy of my own home, I still don't want to look like a cow chewing cud during dinner.  I have my own mental reflection of what I look like to contend with!\n\nThe fish wasn't phenomenal, but it wasn't terrible.  I usually don't get rolls, but I needed something substantial instead of just sashimi tonight.  I forgot that rolls seem to be where sushi joints disguise fish with a crapload of various sauces.  \n\nI couldn't get into it, and have no reason to return with any immediacy.  If I knew that I would get messy, uninspired sushi, I wouldn't have come.", "author": "Tamar D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-08-07", "description": "I love sushi - LOVE IT -  but this was only okay. My two coworkers and I thought we'd treat ourselves since it was a quiet Friday, so we called in an order for pick-up at Godzila. I got the Spicy Tuna Roll and it was...fine. It wasn't spicy, and it was sort of soft in the middle--like they used too much of the spicy sauce and not enough tuna. I buy a lot of sushi from Safeway, and my Spicy Tuna Roll was comparable to my typical Safeway purchase. In terms of cost though, this place is PRICEY. The roll at Safeway is $7-$7.50 for twelve pieces. This was $6.50 for 6 pieces - For more than a dollar per bite-sized piece, I want to be impressed. This felt like crazy expensive grocery store sushi. I could have lived with that, but what was really irritating was the the $6.00 in gratuity they added to our bill WITHOUT TELLING US. I understand including gratuity if it's a large party dining in. I understand including it for delivery. But we ordered for three people and we picked it up. When we asked why it was so high, the guy just shrugged and repeated back to us our order, verifying it was correct. My coworker paid for it with a credit card and tipped on her credit card. It was only an afterthought to get a detailed receipt and that was when we found the hidden charge. Not cool. They ended up getting tipped twice for mediocre food. I paid $10 for 6 pieces of sushi that tasted like it came from a grocery store. I will not be back.", "author": "Kelley M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-25", "description": "I think it is important to note that as of 8/15/11, Godzila sushi is under new ownership and there are many positive changes in the pipeline. The fish is fresh and delicious, the prices are fiercely inexpensive. Friendly, tasty, casual and fresh.\n\nMore later....", "author": "Fareed R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-12-22", "description": "The most interesting thing about this place is the Godzilla theme. Food is ok, but there are better choices at Japantown ( which is not far). Service is average. Good place for a quick lunch or quick dinner.", "author": "Erika Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-01-14", "description": "Came here with some girlfriends.  \n \nWow! The pricing of the rolls are fantastic! Ive always complained about not finding a good sushi restaurant in the city. I think this is good enough. There is a special page that has rolls for about 5-7 dollars. Not bad, right? It comes in about 5-6 pieces. Perfect for snacking or if you want to try a number of rolls without breaking your wallet. I ordered the mussel which I do not suggest. I like that its spicy and creamy, but I expected to bite into a whole mussel underneath all the cream cheese. My expectations were undermined by tiny bits of chopped up mussels. Definitely will not order that next time.", "author": "Becky Q."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-10-05", "description": "I might be overly impressed with this place because it was the first sushi joint I went to after moving to San Francisco, but I think the sushi here is pretty good. I'm not a \"sushi snob\" by any means and I'm pretty much game for trying anything. \n\nI really like the atmosphere here. There's nothing pretentious about it and the Godzilla posters/T-shirts that are hanging everywhere gives this place a cheesy/fun ambiance. The Led Zeppelin & Pink Floyd music that is playing in the background is a plus as well. It's small (there's a bar that seats about 15 people and about five or six tables) but people move in and out pretty quickly. I don't think I've ever had to wait more than about 10 minutes for a place to sit. \n\nLike I said, the sushi is decent. My favorite roll is the saki-asparagus roll. This place doesn't have a real extensive menu, but to be honest I'm not a huge fan of sushi places that have a ton of different kinds of rolls with just a minor difference here and there from one roll to the next. One thing that I have to say disappoints me about Godzilla is there spicy tuna roll, which is generally one of my favorites. Here though they chop up the tuna and mix it with some sort of mayonnaise base and roll it. I prefer my tuna rolls with whole tuna and spicy - no funny business. \n\nThe service isn't the greatest either, but since the place is so small, it's hard for a waitress to avoid you completely. \n\nSince I live close by and since it's cheap I always like to take out of town guests here (who mostly visit from AZ) just to say \"See, we're eating sushi in San Francisco so it must be good.\" However, I've been informed by several people who live in SF that the sushi here probably is no better than a decent place in AZ. Oh well, I still like it :)", "author": "George A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-05-26", "description": "Love their huge hamachi kama for $10.50 only. Their rolls are good and service is fast and great.  My friend and I enjoyed a large warm sake and a big Sapporo. It was just right to start our Friday night. Will probably come back and try their other rolls and chirashi.", "author": "Claudine V."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-02-13", "description": "I would do zero stars but yelp does not allow that. EVERYTIME I go something's wrong. Servers are distracted or rude, foods horrible, or it just flat out stinks like fish. I'm disgusted, angry and pretty sure I might have food poisoning. NEVER going again", "author": "Mandy W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-09", "description": "Nom nom sushi down the road from mi casa. Chill vibe except for the giant Godzilla mural. ROAR! Tried the seafood cucumber salad, spicy tuna handroll, and sashimi.  All yum yums.", "author": "Amireh G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-08-15", "description": "This will do in a pinch for sushi in the 'hood. \n\nSushi rice texture was not soft enough for my taste. I had a couple rolls and hamachi nigiri. Chefs and servers are Japanese, good sign.", "author": "Derrick V."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-09-06", "description": "The service was pretty bad. Getting dessert was unexpected for the waitress. The chef was nice, but the servers were hard to get a hold of and hard to get food on time. The sushi was alright: not something I've craved since I've come there last time, nor was it so bad I wanted to leave.\n\nThe place was definitely not crowded, so if you're looking to get a bite, at least there is no line to wait in.", "author": "Timur A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-18", "description": "I love this place!!!!!!! It's really good sushi, and great staff!! It's very casual (no thrills), and not expensive. Great place for dinner with a friend/date or by yourself. Highly recommend.", "author": "LeAnne C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-01-12", "description": "I went back here the other night because it was convenient to where I wanted to be geographically in the city, not because I had fond memories of this restaurant.  I have to say, though, that I had a MUCH better experience here than I have in the past!  \n\nThe food was reasonably priced for what it was, and while the quality was still nothing special, it didn't taste fishy or old the way it had the last time I'd come here.  The rolls were generally on the smaller side with less rice on the outside, which I actually prefer, because I don't like to get stuffed on rice:  I'm here for the fish!  The salmon nigiri was cut a little thin for my taste - I prefer a thicker slab.  The unagi nigiri was fine.\n\nTwo grouses about this visit?  The music was on the loud side, which made talking with my friends harder than it had to be;  Considering how small the restaurant is, it's unnecessary to have music that loud!  \n\nAnd we were informed that one table is supposed to sit 6 people...ummm, I don't know what planet the owners of this place are on, but those square tables fit four people comfortably.  Sure, 6 people could crowd around one, but it would be an uncomfortable dining experience for all.  Surely they must realize that this is a drawback to parties larger than four coming to their restaurant?\n\nAll in all, this experience with Godzila was better than in the past, so I felt the need to re-review and give more stars.  It's still just an okay place, nothing special, but if you need an inexpensive sushi fix in a neighborhood that doesn't have as many Japanese options on a fixed budget, this is not a bad pick by any means!", "author": "Amy L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-01-10", "description": "I have to agree with Brad W. The spicy mussels you get at Godzilla sushi cannot be found anywhere else.\n\nThe best part about Godzilla, besides the fresh fish, is it's affordable, casual, and friendly. The chef's are friendly and remember their customers. In fact, one of the chef's and I were in San Mateo for speeding violations. The chef pointed at me and was like, \"I know you, you come into Godzilla\". Yes, I am a regular. \n\nMy only complaint are the servers. I can never seem to get their attention. Every time I need my water filled or want to order dessert, the servers are drying/stocking glasses. Their focus needs to be on the customer more than clean up.", "author": "Fatima J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-07-21", "description": "Food: Sushi a little better then decent. Hefty sized rolls.\n\nAmbiance: Great little neighborhood sushi joint.\n\nService: Waitresses are okay, not overly friendly.\n\nPrice: Should be a little cheaper for the quality.\n\nOverall: Good place to grab some quick sushi before going out on Divisadero.", "author": "Binh D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-02-22", "description": "Came here on a Friday night. It was raining a ton so we didn't venture off to our favorite spots, but rather stayed in the neighborhood.\n\nSat at the bar, ordered a large beer. My brother and ordered a couple rolls. None of them were specifically tasty and the fish didn't taste or look that fresh. The food was fine but I doubt that I will be back in the near future.\n\nStaff was friendly but it took some time to get our check when we were ready to go. They didn't bring us plates either. We had to use the dishes that the sushi was served on, then when they did offer plates, we had already started using the serving dishes so we declined.\n\nThen the waitresses tried to take our \"plates\" away from us. It was somewhat of a disaster. I am sure there are other sushi joints around here to try before I call this play a local spot. The place seemed busy enough for a Friday night and there were take out orders being made left and right.\n\nFor my brother and myself with one large beer the check came for $36, $41 with tip. I thought this was a bit pricey for the quality.", "author": "sierra s."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-11-05", "description": "Stumbled upon Godzila because the wait at Tataki was too long.  Maybe if I had been more patient, I would have been rewarded with better sushi.\n\nI'm not saying that the food was horrible, but it wasn't so fabulous either.  But, I can't get overly excited about any sushi place that uses imitation crab instead of the real thing . . . \n\nWe sat at the sushi bar, and the chef was quick, efficient and super nice, so he saved Godzila from getting 2 stars because that's as high of a rating as I'll give for imitation crab . . .", "author": "Christina L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-13", "description": "Great Sushi!!!!\n \nFresh Fresh seafood.\n\nFun place with a charming hole in the wall atmosphere.", "author": "R H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-24", "description": "Surprisingly good sushi.  Great lunch specials for about $10.  Ambiance is just meh but the sushi is actually quite good for the price.  I'll be coming back here for sure.", "author": "Dj S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-01-07", "description": "Left Bestbuy and was craving for sushi so we decided to stop by Godzilla since it was close by. The restaurant has about 5 4-seater tables and an entire row of seating along the bar. I've been to a lot of sushi places and this has got to be one of the brightest- the lights really shine brightly!\n\nThe menu was very simple and featured sushi that were pretty cheap in price; however the special rolls were priced pretty comparable to other places. We ordered the philly roll, rainbow roll, dragon roll, and tinky winky. The tinky winky and philly were pretty good, but the rainbow and dragon were very small compared to a lot of other places i've been to- paying $9+ per roll I would of expected the sushi to be a little bigger at least.\n\nService here was good- we got greeted by the waitress and the sushi chef once we entered and got served tea right away. Would I come back? My bf says probably not.", "author": "M W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-06-11", "description": "Despite our cranky waiter, I'd come back again for the sushi and give Godzilla 3.5 stars.\n\nThe hamachi sashimi and half and half sashimi (selection of white tuna, salmon or white fish) dinner are good deals. For only $12 you can get 7 pieces of quality sashimi.\n\nNow back to the cranky waiter. He wouldn't let us substitute the miso soup for house salad. Fine. So we ordered our salads separately but he still managed to forget the order and then mess it up. After finishing our other dishes and still no sign of salad, I reminded him that I still didn't get my seaweed salad. He came back and handed me the house salad and my friend the seaweed salad which I quickly responded with \"no the other way around.\" He then slammed the house salad next to my friend's side of the table. That was really uncalled for! Service was definitely a miss tonite (yes we're talking 1 star) but given the reasonable prices and fresh fish, I will give Godzilla another chance. Hopefully I will have a more pleasant waiter during my next visit.", "author": "Helen Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-11-10", "description": "As a local patron of Godzilla sushi at least once a month, for five years now, I can honestly say Godzilla sushi is the best affordable sushi in SF!  The fish is always fresh, the rolls are inventive and delicious, and the spicy mussels are the greatest thing that ever touched my lips.\n\nOne hungry evening, I came to Godzilla and only ordered 8 orders of spicy mussels (that's 16 large mussel shells covered in mussels and spicy sauce!  You can never have too many.  They are the best, and no other restaurant makes anything comparable.\n\nSome of my other favorite Godzilla items are:\n - Hamachi Kama\n - Spicy Scallop Hand Roll\n - Voodoo Roll\n - The Lazy Monkey Roll was one of my fav's, but its no longer on the menu..\n\nThe staff is always friendly and attentive, and the place is casual and comfortable.  The walls are adorned with napkin drawings and movie posters of Godzilla in the Golden age of film.\n\nCheck it out if you don't like over paying for your sushi.  As for the spicy mussels, consider yourself warned - once you try them you will be hooked!", "author": "Brad W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-08-07", "description": "There was hardly anyone in the place and still we had a 30 minute wait--huh?  Not really sure why they only had 5 tables, even though they could definitely fit more.  Not super impressed by the vegetarian options (although I admit that the only thing I eat that isn't vegetarian is tekka/maguro because I love it so much).  \n\nAll the specialty rolls are non-vegetarian (!) so I ordered the Tekka Don.  When I went to eat it, I was surprised because I felt like I was chewing on rubber--wtf?  I actually had to spit it into my napkin!  Was it the vegetarian gods coming down to punish me for my transgression? No, actually--it was cut the wrong way!  How could they cut something wrong in a sushi restaurant?  I have no idea.  I don't usually do it, but I just had to send it back.  \n\nThey did make it up to me by sending out some well sliced tuna, so that's why I'm giving the place three stars instead of one.  But, overall it just wasn't my kind of place.  Especially since Moki's, my absolute favorite sushi place with fantastic specialty rolls (lots of veggie options) is so close to where I live and so much better.", "author": "Cassidy P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-04-11", "description": "Five years since I ate here last, and on a recent return, I realized I haven't missed out on much. This place isn't terrible, but it is terribly mediocre.\n\nIt seemed sauces, mayo, and fried elements lurked in every specialty roll. I tried the tinki winki, typhoon, and godzila rolls. Flavors were muddled, lacking harmony, and the rolls embarrassingly fell apart quite easily at my, albeit clumsy, chopstick grappling. Each roll had about 4-8 pieces.\n\nAdditionally, the nigiri comprised of sad flaccid thin pieces of fish, though they weren't un-fresh. \n\nThe food here is meant for sustenance, rather than transcendence.", "author": "Carolyn F."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-06-21", "description": "You used to be SO much better than this.  It's almost a shame for you to keep that name, you've gone so far downhill.  \n\nYou can't blame it on the neighborhood either; Divisadero is looking good.  Parking wasn't even hard.  But the food truly stank.  We ordered one mealy looking tuna roll and then high-tailed it out of there.", "author": "Laura G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-02-20", "description": "Ordered the unagi roll and ended up with food poisoning that put me out of work for a couple days. I've only been to this location twice and the service was horrible each time. No waters and straight to the check. So if you want to throw your brains up I suggest Godzilla Sushi.", "author": "Sarah T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-02-17", "description": "I come here once a week. I've had everything and most things multiple times. Its not fancy, its not a prototypical restaurant but it is a true sushi bar. Great quality, great staff, and very creative options. And, like most sushi bars in Japan, they are wide open to new things and letting them dictate the dinner. Love it.!", "author": "Z P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-08", "description": "This is a low key and casual restaurant to grab some good sushi and not overpay for it!  The place always seems to be nearly full, but usually there is 1 or 2 open tables. I've never had to wait to get a table there despite it always being busy.\n\nPrices are moderate and very reasonable compared to other places in SF.  And the sushi is pretty good.  It is definitely not  top notch sushi, but it is pretty good, and a GREAT value for the price, and it really does hit the spot. You can get a dragon or rainbow roll for $9 whereas somewhere else it'll cost you $15.   They have $4 rolls and $7 rolls as well.  This is my go-to place for takeout or really anytime I want sushi and don't want to pay through the nose for it (or wait an hour)!", "author": "Chris L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-04-17", "description": "This place is great for a number of reasons.\n\n1) It is close. As in, I can strap on some shoes, saunter over 3 blocks in some sweats and not mind the crowd across the street at Tortilla Heights.\n2) It is reasonable in price so I can get pleasantly full without breaking the bank.\n3) They are quick and they do take out.\n\nSo for being a sort of fast food\" sushi place, Godzila is great!\nIt is always packed which is a good sign, and every time I have had dinner with friends its been a fun place to head to.", "author": "Kathy K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-05-25", "description": "Bad. Popped in sushi into the GPS and thought this place sounded cool. I mean, 'Godzilla' is an awesome monster. Too bad his sushi was awful. \n\nFirst things first. Take a look at Bobby Flay making sushi on 'Throwdown' and then come to this place the next day. Me and my mother did, and it was like the exact same sushi! It was falling apart even before the first bite. My mom was so un-thrilled by the sushi she made snarky comments as we sat at the bar. \n\nUh. So, although my mom flew back to the West. I will not be back, no matter how cool Godzilla sushi sounds.", "author": "Angela R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-04-21", "description": "If your thing is specialty sushi rolls...then this is a very good place to check out.  My friends and I tried it out last night after waiting too long for a table at Tortilla Heights across the street.\n\nAmbience is kinda cramp and hole-in-the-wallish...definitely nothing to write home about.  But the service was quick and the sushi rolls were really good.  I sampled the Pink Dragon, Spicy California, and Spicy Tuna rolls.  I must say that all of them were great!...Very fresh & very generous portions.  Prices overall won't thin out the wallet either.\n\nOverall, would definitely hit this place up again the next time I am grabbing drinks in Pac Heights and need some good rollz to soak up the alcohol.  Thumbs up...i'm audi.", "author": "Justin L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-28", "description": "EXCELLENT SUSHI! My favorite sushi place in SF, hands down. Quality sushi at a reasonable price. Kamikaze roll is delicious! Give em a try!", "author": "Kali L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-05-08", "description": "I was really looking forward to hitting up this \" great sushi place\" by my new apartment.  I have to say I left sadly disappointed.  They state that they are open until 10:30, but arriving at 9:30 I felt like we were being rushed, and an irritation to the staff.  We had two different waiters, and they were equally rude.  The sushi was pretty good, but the staff ruined it for me.  They took the menus away after the first order when we asked to keep one, to order more.  When we asked for the 2nd order they said they would have to check and make sure they even had what we wanted left and reminded us that they closed in 15 mins.  \n\nThe thing that sent us over the edge was that after we paid and left, the rudest waitress chased us down across the street and said that we didnt leave enough of a tip!\n\nFirst off I do work in the service industry and understand how to properly tip.  You also earn what you receive and treating guests like they're a pain in your ass and rushing them out the door is not a way to earn a high gratuity.\n\nFurthermore, tips are extra, its not a requirement at all.   \n\nUnfortunatley, the first night out in my new hood was a flop and I will not be returning to Godzilla Sushi.", "author": "Therese H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-27", "description": "Good little sushi spot with great service! I showed up as they were closing and they didn't think twice to fill a to go order for me! I recommend the kamikaze and Godzilla rolls!", "author": "Vito F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-10-02", "description": "This place is affordable by San Francisco standards, but still a bit pricey for me.  I had the salmon sashimi which was nice and fresh, but a bit bland.  I'm not sure how to describe it, other than the fact that it wasn't the best sashimi I've ever had.  The rolls were good but not spectacular.  Lastly, the hamachi collar was tasty and juicy, definitely my favorite item of the night.", "author": "Le T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-11-10", "description": "This is about as \"3-star\" as it gets....\n\nThe sushi is average, but solid.  You're really not going to be disappointed with anything, but you're also not going to be blown away by anything.  It has the standard selection for your typical neighborhood sushi place.   Good, attentive service, no-frills atmosphere, and great hours.  If you're a local in the Pac-Heights neighborhood, I'd recommend it as your standard \"go-to\" neighborhood joint, but I wouldn't go out of my way to eat here.", "author": "Mike B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-03-22", "description": "As everyone else has hinted at, this is a no-frills, cheap sushi joint. \n\nGodzila (note: why they spell \"Godzila\" with only one \"l\" is beyond me, as all of the Godzilla posters in the store have two \"l\"s...) offers a smaller menu with lots of special rolls available off-menu. No roll was more that $9.75. \n\nI tried the Tinky Winky (good, but HUGE, four pieces), Pink Dragon (tasty, 8 pieces), Godzila (too big and mediocre) and the Lazy Monkey (best roll here, very delicious). Also, they run a $4 large beer special between 5-7, which is much cheaper than you seem to find at comparable places. \n\nNothing here blew me away, but it was cheap, the service was good and the off-menu items are certainly a nice touch.", "author": "Tom A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-03-23", "description": "I work across the street from Godzila, so I've gone there off and on for about a year and a half. When I first tried it (about a year ago) it was pretty mediocre. The rolls were very average, about on par with the decent spots I went to in Raleigh, NC. It then closed for many days during lunch and I stopped going. Within the last couple months they not only increased lunch coverage, but they added combo options for lunch that are a good deal. I've been about 5 times since the menu update and 4 of those times were great. For about $10 you can get sushi combos, a bento box, nigiri, udon, all of which include miso soup, many include a salad and rice. Those 4 times I sat at the bar/prep area. The owner is back there and takes a lot of pride in the place. He's really friendly and will chat if you're up for it. I stuck to the combo items and quality was good, and it's a lot of food for the money. \n\nNow to today's visit... I sat at a table today. bad move. Due to increased popularity, they hired more waiting staff, and the waitress I had turned things a bit sour. She could have been new and flustered, but the place wasn't that crowded and that doesn't really excuse attitude. She would throw a plate in my face while talking/taking an order at the table next to me. She forgot my water and despite several obvious attempts to get her attention, she ignored me until my meal was done. Then she got a glass for me as she clears my plate, nearly hits me in the head with it, and the glass was full of floaters. like unidentified white floaters... like a snow globe. So I'm normally not a complainer and hate to hassle waiting staff, so I let all this stuff go and figured maybe she is having a rough day... we all have them, just perhaps tip a bit less and move on. Then the bill comes. She rounded up to the nearest dollar on the check. It's not that I care about the 10 cents, it's the principle. I see the actual total and you just wrote something higher. She was pretty rude to me, ignored me, and then makes the assumption I don't care what I pay. I actually feel kind of annoyed I still paid a 10% tip, but I figured the loss is me not returning again. \n\nIn case the owner reads these (which does happen frequently on yelp and can be really helpful), you may want to address this with staff. You did a great job revamping the lunch menu and I enjoyed the meals I had up at the bar. The issue is that lunch spots are just too competitive in SF to let bad experiences slide. It's so easy to go elsewhere. I know you take pride in the food, but you may want to make sure your staff shares your enthusiasm and attention to customers.", "author": "Adam F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-31", "description": "First time here and not sure if it was the right place at the right time but a week later I'm still thinking how yum the sushi was. The Saba nigiri and the sake toro nigiri melts in your mouth. Can't wait to make plans to go there again.", "author": "Mellisa A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-25", "description": "Awesome no fuss, casual sushi spot.\n\nThe service was great- met a few friends here last night and our waitress did an awesome job accomodating everyone's needs. A friend asked for extra tobiko and luckily our waitress realized immediately that he probably wasnt asking for extra fish eggs...\nThe rolls were great for the price. Fresh, pretty creative, and tasty. The inside is filled with hand made art and napkin doodles of Godzilla- pretty kitschy and charming. I recommend that spicy california roll (only like $5!) and the pink dragon roll. Also- make sure to try the sake during happy hour, super cheap. If you're in the neighborhood, definitely give this place a try. Most affordable sushi with the best quality in SF I've had to date.", "author": "Kara L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-21", "description": "We visited San Fran this past week and stopped by here for some fresh sushi.  We loved it!  Not only was if really reasonably priced but super fresh and delicious! We also loved the \"local art\" on the bathroom walls.  We had the Kamakazi roll and the sunset roll. Both great!", "author": "Nikki W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-05", "description": "We ate here recently and I thought the food was good. It was fresh and they were FAST!! We ordered and our food was up in a jiffy. The servers are all young but very helpful.", "author": "Eileen R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-06", "description": "Cheap, casual neighborhood sushi joint with decent quality for price.\n\nPositives:\n-Friendly staff/quick service (prompt with drink refills, etc)\n-Laid-back atmosphere with some cool decor (vintage Godzilla posters.. but then again I am a fan, ha)\n-Rolls pretty good, inexpensive. U-nasu roll with eel and japanese eggplant for $5 is a favorite of mine.\n-Good green tea with your own little teapot they will refill endlessly\n- Exciting mochi flavors! I've really enjoyed the Guava, Chocolate/Peanut Butter, Chocolate/Coconut... mm.\n-Decent alternative to Tataki sushi if you're too hungry to wait.\n\nNegatives:\n-The music is the biggest turn-off for me! Mostly 90s top 40 Lilith-Fair-esque crooning from Sarah Maclachlan, etc.. with a few bland Japanese songs mixed in. If they played cooler music the whole vibe would be much improved. (Take a hint from Ryoko's! Sushi always tastes better with a side of cool beats. Fact.)\n- Most of the specialty rolls have the all-too-common problem of the pieces being WAY TOO BIG! I firmly believe you should be able to eat a whole roll without having your cheeks bulge out like a chipmunk or worse, make a mess trying to bite the roll in half. It's just not a good situation. However, the rolls are pretty tasty.\n\nOverall I'd give it a 3.5, but I still come here quite a bit.", "author": "Remi X."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-18", "description": "Always good and fresh.  Friendly staff and it's all fairly priced.  You can't go wrong here for decent, basic sushi and rolls.", "author": "Bob S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-09-12", "description": "My husband and I love this place. The sushi has always been fresh and the service has always been kind and courteous. I recommend it.", "author": "Mariam M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-17", "description": "My friend Katherine recommended it here. We got 4 rolls (all great and plentiful) and 2 miso soups for 20 bucks. My only complaint was that they would not allow us to split the 20 dollar bill on 2 credit cards because they have a 15 dollar minimum. I thought that was really tacky.", "author": "Julia D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-13", "description": "Been going here for years, really solid sushi at surprisingly low prices, especially considering the location. They're only open for dinner and it can get crowded fast but I've never had to wait more than 30 minutes, even at peak times. Sushi selection is pretty wide and the style is nice and minimal. Not much of a sake selection so I usually get beer when I eat here. There aren't many tables so if you have a larger group best to arrive when they open at 5:30.", "author": "Penitent M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-23", "description": "I think it will be one of my new favorite sushi bars.  I had the rainbow, tinky winky & Godzilla salad.  It was good.", "author": "Donna L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-01-22", "description": "not my favorite sushi joint, but its around the corner from me and does the trick when you're in the mood.\n\nservice is pretty womp and their hot sake tastes funny to me for some reason. All around, I go there but I'm not wholly satisfied.", "author": "Shayna M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-07-11", "description": "Just ate here for dinner and enjoyed their rolls which are well priced.  The two special rolls that stood out for my taste buds were the Godzilla and Tinki Winki (or something something) rolls.  Both were quite delicious and I think each had 3 different kinds of fish in it. Traditional rolls are cheap but also a bit on the smaller side. If you like Saba, try the Gari Saba roll, it's good. \n\nThe nigiri specials they had were pretty tasty, but the fish could be just a tad more fresh or maybe with a little less wasabi/ginger. Just seemed like there were too many flavors on top and under the fish that I couldn't really taste the fish itself. Nigiri prices weren't bad though, about $3.75 for 2 pieces of Aji or Bonito. \n\nTheir salads were cheap, simple, and very good. \n\nWe came exactly at 7pm (Wed.) and got seated right away as there were 3 empty tables and lots of room at the sushi bar. Right after we got seated, the place filled up. \n\nStaff was friendly...though they forgot to bring me the green tea I asked for and water glass was empty for awhile.  I didn't really notice the music at all.\n\nI was hoping this could be a closer alternative to Nippon but it lacked the fresh sashimi.  \n\n(Pictures to be posted later)", "author": "Mellie D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-08-04", "description": "Sushi---been dying to have some since returning from my trip, where I was deprived of other cultural food. \nSo finally got to eat some in which i have no clue where to go. Found this resturant in Bay Guardian, and have ALWAYS passed by it when driving, so decided to stop and give it a try.  \nIt was OK, not as exciting, and as yummy as hoped for. Altho, it is a nice dating stop, since the shop is small, and only have 2 chefs. It gets quite busy, but the ladies working in there are very helpful and friendly. Have to give them props for that!", "author": "Monika T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-24", "description": "Good, fresh, delicious sushi for the money. It seems there's no price ceiling on how expensive sushi can get but finding decent quality for good prices can be trickier. Look no further when trying to solve that little conundrum. Tinky Winky roll is worth the embarrassment in saying it outloud as well as the mussels. The Godzilla memorabilia all over the restaurant adds a cutesy touch to this solid around-the-way sushi joint.", "author": "Raven D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-05-18", "description": "My wife thought it was just ok.  She likes sushi a lot.  I understand that most connected folks think I should describe the meal or talk about a favorite dish.  Whatever.  This place is ok.  It's not bad.  It's not great.  It's ok.", "author": "Jeff P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-03", "description": "So this is my blue collar sushi place.  It gets the job done, nothing fancy, just really good fresh rolls that I can trust will be great every time I go and it won't break the bank.", "author": "Christian P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-07-19", "description": "The sushi was mediocre. For the price that they charged for it, it should have been some of the better sushi that I've had. The service was good though so all was not lost.", "author": "Iain L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-03-08", "description": "Godzilla sushi is what it sounds like, a Godzilla themed restaurant.  I've been making my round around many good sushi joints in SF and Godzilla was one that my friend nozomi and i went on a whim.  She had a friend that worked there, so we figured we'd try it since we were in the area. \n\nIt's a pretty small restaurant, with simple tables and a giant mural of godzilla and many movie posters, as well as customer drawn napkins on the walls.  This place definitely had personality, which is a big plus for me.\n\nI could tell just by looking most people in there were regulars, and knew what they wanted.  We sat at a table and looked at the small menu of what to eat.  I wasn't very impressed at the menu's variety, but it had some good choices for what seemed like reasonable prices.  \n\nWe were served by very nice waitresses, so i felt the service was decent.  however the main attraction was food, and of course, i had to try the godzilla roll, since that was the namesake.  Can't screw that up right?  We ordered a bunch of nigiri and also a sashimi platter.  \n\nWhen the food came, it looked decent.  Nicely arranged, looked fresh... but kind of small.  The salmon sashim was 7 pieces, but looked more like 5 pieces sliced into 7.  It looked more like an appetizer than a meal.  The godzilla roll was only 4 pieces unfortunately, so i wasn't happy with that.  I don't have complaints about the taste, cuz it DID taste good but it didn't jump out at you.  \n\nSo in closing, it passed my test, but, its not a place i'd go back over and over.  Although the prices seem low, the quantity is low too, so i wasn't that impressed, nor was i full at the end after already spending 50 bones.\n\nI like this place for its personality, and the people are nice, but the place is a little bit stingy, in my opinion.  \n\nStrangely enough, nozomi and i were the only asians that night.  We just found it a little funny that every single person waiting to eat and that was here before us, was white.  Nothing wrong with that, but we just felt we stood out.  ha ha", "author": "Evan T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-01-20", "description": "Good sushi (I'd give it 3.5 if that was an option). A little pricey for what it is though.", "author": "Rohan S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-04-10", "description": "This place was recommended by a friend. The three of us sat at the sushi bar. I ordered a spider roll, rainbow roll, and spicy tuna roll.\n\nI was a fan of the spicy tuna roll..i even ordered another. \n\nThe service was OK. The sushi chefs were very kind!\n\nI love the Godzilla posters everywhere!\n\nI think this place was pretty good. I'd go back if I was in the area.", "author": "Heather H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-27", "description": "Best salmon skin hand roll in the city. Good affordable sushi! The chefs are great guys", "author": "Jen H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-07", "description": "Godzila sushi impressed me. There is a reason that it's always crowded in this place and you might wait in line for a table, but that's worth it! I ordered a Caterpillar and Tiny Winky the two times I visited and both times they were delicious.", "author": "Sandrina B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-13", "description": "Boyfriend picked me up from a facial tonight and we went to pick up sushi-I looked so fucking nasty that everyone inside Godzila probably thought he was a saint for dating me. That or I had an AMAZING personality. ANYWAY. \n\nBeen meaning to come here for a while as many people recommend it as a cheap sushi place that's not nasty, and fairly close to my house. And I was pleasantly surprised tonight!\n\nHad 2 orders of miso, seaweed salad, 3 orders of nigiri, a yellowtail / scallion roll and the Tinky Winky roll-we were both satisfied for $32-which I was happy with. \n\nWe took the food to go, so cant really comment on the service. The food was very good though. As others have said, the tinky winky roll is while horribly named, frickin delicious-salmon, scallops and crab! The spicy scallop nigiri was excellent as well.\n\nDefinitely will go back, probably again to take out, because the ambiance was not my favorite-but good sushi for a good price.", "author": "Afton T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-05-30", "description": "The sushi itself was very good quality and I reccommend the voodoo roll. But there are only 4 rolls per order which is rather funny and the soft drink is merely a can and no refills.", "author": "Bil K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-07-09", "description": "3.5 stars:\n\n1 for great character of the sushi chefs\n1 for the music \n1 for never having to wait (i never go with more than two people)\n1 for having fresh Uni\n-.5 for the ice in their ice water being from the fish case and tasting really fishy and gross as the ice melts in the water.", "author": "John M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-03-01", "description": "Super casual, sushi spot. The menu is small but the fish is fresh and there are some good special rolls. I have a feeling that sitting at the bar and ordering straight from the chefs could result in bliss. \n\nPoor decor, service is ok (they got our order wrong three times), but the price is right for what you get. I wouldn't take a date/parents here, but it's good for a casual dinner with friends or a long-time bf/gf.\n\nMy favorite roll was an asparagus and tuna special. The seaweed salad was average (which means awesome, b/c seaweed salad is the best).", "author": "Rena B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-11-20", "description": "A friend and I ventured to this little sweet spot the other day to satisfy a sushi craving. While few place can compete with my local sushi joint, I must admit that Godzilla hit the spot. \n\nA mediocre, whole in the wall joint that serves basic rolls. They have the low-sodium soy sauce on all the tables so that's kinda nice. Food is pretty inexpensive but it definitely adds up. The rolls are smaller in comparison to most joints but then again you get what you pay for.\n\nApparently the spicy mussels are delish and a must try if you eat that sorta thing. =)", "author": "Alli J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-10-14", "description": "Stumbled upon this place randomly this week.\nWhat a great find.\n\nI really enjoyed the atmosphere and no, not the Monday Night Football on TV (although I did sneak a peak, over my fiance's shoulder a couple of times).  The fish was fresh and the rolls quite tasty.\n\nI wish this place was closer to my residence.  Their reasonable prices and friendly atmosphere would be plenty to earn my regular business.", "author": "David M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-17", "description": "This place is awesome. There are few places where I can feel at home, that have that certain giant reptile-friendly something, and a sushi place with a giant painting of Gojira-san is eligible for being one of them. The Godzilla roll itself, yes, spiky and meaty. Nice. What more can you ask of a sushi place, spiky and meaty. The service was nice, shiny and happy. The sushi chef knows what he's doing. I liked the lighting, and the Godzilla figures. And the posters. The Godzilla 1985 poster is one of my favorites, so I was glad to look at it as I ate the spiky and meaty. Spiky and meaty- That's all you need to know.", "author": "Miguel L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-06-14", "description": "... Not a fan. The tuna ginger roll was bland and dry, the seaweed salad overly corn syruped. My sister and cousin agreed that the overall fish quality was poor and the service mediocre. For some reason the place was fairly packed though, so who knows, maybe its convenient location makes up for the crappy sushi.", "author": "Zoey S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-03-26", "description": "Statistically significant other and I dropped in on a whim last night to Godzila Sushi. He swore by it and I, not really giving a crap because I'm easy (not in that way! pervs) said okie dokie. \n\nLoved the eel, avocado, cucumber, eggplant roll. Umm, eggplant in sushi? I've never seen that before but it was DAMN good. It may even replace my Rock 'n Roll staple! \n\nApparently this place is a neighborhood hot spot which means it's always packed! So come early, come hungry and with a few dollars in your pocket - you're sure to leave satisfied.", "author": "Julia N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-02-21", "description": "After living a block from this place for 3 years and frequently using it as an answer to the question \"where do you live?\" (\"ummm, right by...\"), we finally tried out Godzilla tonight.  I think I took so long to go here because it was a bit like not wanting to be up Christmas eve and find out the truth about Santa...hanging on to the belief that I lived a block away from the worlds best sushi place (which is what everyone told me).  The verdict: Santa actually wears flannel and was related to me.  \n\nThe sushi was OK - fish tasted fresh but the rolls were average and nothing to write home about.  The appetizer was definitely the tastiest and most interesting dish that we tried (some sort of grilled oyster - you get two tasty half shells).  The Godzilla Roll and some sort of spicy tuna type roll were OK, nothing great.  Couple annoyances - like the rest of the reviews say, the rolls are on the smallish side, but the prices are also accordingly low.  Also, the hours are annoyingly short - why would you not be open for lunch at this location?!?\n\nThe final tally: one star for decent inexpensive rolls, a second star for being a block from my place, and a third star for the giant painting of an adorable (I don't think they were going for adorable) Godzilla devouring a building.", "author": "Rosers M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-09-11", "description": "I'm quite surprised. I was coming in thinking it's a standard sushi place with fancy schmanz rolls. They have some what fancy schmanz,  but it definitely isn't standard and it's no frills and a lot of focus on the fresh fish. The sushi was super refreshing and cool - they took time to make the rolls and the minute I popped it in my mouth - it melted like buttah.\n\nWe had the Tinky Winky, Godzila, Spicy California and some other roll I can't remember. But I just remember everything that popped in my mouth was cold, fresh and delightful. Decently priced, that all the rolls came out to $30...\n\nSmall space with like 4-5 tables maybe and a sushi bar set up. I will definitely try this again.", "author": "Alyson C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-10-31", "description": "We waited for a long time for our order, very long time!  The sashimi is not fresh, average good, and very bad service!  I don't recommend this restaurant!", "author": "Helen H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-12-25", "description": "This place is a dive! It's become a tradition for me and some friends to go there and get hammered once a year during a big science event and I will always fondly remember seeing an MIT professor turn green eating his first Uni (and many other personal memories). \n\nRecently, I went back there outside of our tradition and, having become quite the sushi lover over the past years, I pleasantly realized that the sushi there is simply outstanding!\n\nThe venue is nothing to rave about, it has all of 4 little tables and perhaps 8 or so bar seats and if you get there too late, you're out of luck. I also dislike the heavy metal music (chosen by the chef!), but as I said: great place to be and fantastic sushi.", "author": "Jurgen L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-08-15", "description": "Hadnt been here for quite a few years, so I was concerned that things may have changed for the worse. I neednt have worried. Godzila is still an excellent choice for reasonably-priced sushi in a casual & fun environment.\n\nWe arrived at around 8:45 on a Friday evening, so there was a bit of a wait -- not to worry, we added our name to the list and hung out with a beer at the doorway to the little restaurant. The place is small, with just a few tables and about 8 or 10 spots at the bar. Finally, we got svery tasttyeated in a prime spot (under the TV adorned with the little Godzila figurines...!) We ordered some miso soup and Gom Ae salad (a bit heavy on the sesame, but very tasty. We followed with an assortment of sushi -- unagi hand-rolls, spicy tuna, tempura rolls, spider rolls. Fairly conventional selection, but all VERY good. (And some more Sapporo beer, of course...) \n\nI was so impressed that I actually bought a beer for the sushi chef (an unusually generous gesture for me!) All-in-all, a fun place, reasonably priced and very tasty sushi & friendly staff.", "author": "donal c."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-16", "description": "Okay, review # 1,999,999,999:\n\nThis place needs no review, even from Yelp.  The place speaks for itself from locals and sushi-holics across CA and beyond.  \n\nThe prices can't be beat, especially in terms of quality.  Not the best sushi I've ever had, not the most well crafted, but always better than the last sushi joint I've visited.\n\nAs you can read for yourself or hear on street corners, Godzilla is sushi done right in a city where prices are typically never described as budget friendly.", "author": "Deven B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-12-03", "description": "Godzilla is delicious again! This is my favorite (and affordable) late night sushi place. Tonight I power-walked from Union and Steiner, made it to Godzilla by 10pm, was immediately served, ate my rolls and was home before 11. The sushi is fresh, the portions are large, and the service is great!", "author": "Mitsi M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-03-22", "description": "Slow service and average sushi, at best. The rolls were falling apart and didn't look appetizing at all. I sat at the counter for an hour with an empty beer and was never asked if I wanted another. I won't be going back. Tons of better sushi places around.", "author": "Brian S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-05-14", "description": "French Toast Mochi.  That's right....French Toast.  And it wasn't just maple syrup flavored.  Oh no...I bit into it, tasted the powdered sugar, tasted the bread coated in egg, and the syrup.  It was incredible.  And that was just at the end of the meal.  \n\nBeing the closest, most reasonably priced sushi bar to my house, this is usually my first choice.  It doesn't disappoint.  I usually try to come after 8, cuz that's when this small joint loses most of the crowd, and it always satisfies my sushi craving.   They play the best music, and you can catch the staff singing along most times.  Sit at the bar.  The sushi chefs will do anything for you at the drop of a hat.  Need a glass of water?  They will stop what they are doing to get you one.  Need a business card?  Same thing.  Need a neck massage, maybe, you might have to bat your eyes and promise sexual favors later...but its always worth a try.", "author": "Lauren F."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-03-01", "description": "So... They had an awesome idea! Godzila Sushi seriously sounded like it was amazing. And for months while I was working at the Starbucks down the street, I wanted to try it.\n\nSo I did. BUT...\n\nTheir spicy tuna was bland. Why? I don't know, since spicy tuna is supposed to be full of flavor, and it usually is, even at Xiao's, which isn't the best sushi place ever. \n\nTwo stars for the prices though. If you live in the neighborhood and you're on a budget, this place will satisfy you. And also, since I did only try the spicy tuna, I might still give this place another try to taste some of their other options. Who knows, maybe it was just the spicy tuna that had no taste?", "author": "Catherine H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-09-03", "description": "Well wonders never cease.  Thanks to desperate sushi cravings and extreme laziness, I broke down last night and decided to give Godzila a try.\nThe staff. . . .was nice!\nThe sushi. . . .was not warm, tasted fine, and was ready in like half an hour!\nI'm pretty sure I should buy a lottery ticket while my lucky streak lasts.\nDo I think they've turned a new leaf and this regular service will continue?  No sir, I do not, but I sure had a good time being pleasantly surprised!", "author": "Jennifer D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-02-09", "description": "Godzila is a fun spot, first and foremost.  Total \"value\" joint that should definitely have a small place in the hearts of everyone on the quest for good, cheap sushi.  Unfortunately I can't entirely love the house that G built, because Nobu has so enlightened my fxxxin mind and my tastebuds.  I'm not sure whether this fish is fresh, or not, but it isn't very, very good.  Maybe just kinda good.  Fun sushi chefs, but these rolls are hiding something, and it's not great fish taste.  Miso was so so and even the seaweed salad was just a little off.  Not a lot off.  But my palate has been ruined for the jive azz roll and its not-quite-ready-for-primetime cousins.  And the one nigiri I tried, Maguro, was a nice slice, beautiful & bright red - only the flavor tasted glassy, if that makes sense.  As if something were opaquely obstructing the great, fresh-tasting mouthgasm-ready flavor you can find in Maguro at the fine,  5-star sushi joints inhabiting Ess Eff.  I guess I was hoping for a miracle, and the Holy Grail was not on location.  Don't get me wrong, if this was in my nabe, I'd be at least a semi-regular.  It is unusually fun for a \"value\" sushi place!\n\nAnd there's something endearing about all the Godzilla napkin art among the oh so many bright, festive decorations.", "author": "Ted R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-06-29", "description": "While waiting in line to eat at Godzilla, I overheard someone say that a tempura roll is authentic sushi followed by \"Japanese people invented Sake bombs.\" \n\nOkay, so the definition of sushi has been bastardized and historians are still debating the validity of such a drunken statement, but I don't know where else in SF you can feed 4 people, get hammered, and still come under a c-note for decent quality sushi. \n\nObviously there are better places, but Godzilla is tough to beat for the price and good times.", "author": "Jason C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-01-17", "description": "With a name like Godzila, you would expect extraordinary!\n\nLocated on the corner of Divisadero and Bush, Lorna D. was lured by its promising name and her love of all things raw, especially sushi.  We found ourselves here on a Tuesday night and wandered in.  \n\nAs we walked through the door, I asked her if she wanted to sit at the sushi bar or table.  This was quickly answered for us as the handful of tables were already occupied, so we climbed up onto the bar stools.  (You'll find nifty hooks to hang your purse underneath!)\n\nI went for the Chirashi Don ($9.25), which came with miso soup and a side salad.  The salad was basic with iceberg lettuce, cucumbers, and sprouts.  The dressing was a miso based type.  The soup was standard with tofu and seaweed.  At such a cheap price for a chirashi, I wasn't expecting too much fish.  It came in an average size bowl with two pieces of imitation crab meat, maguro, sake, hamachi, saba, some white fish, and I think something else.  Overall, it was okay.  Some of the fish was fresher than others, but not bad for a chirashi don.\n\nLorna went for their signature dish - the Godzila Roll ($8.25).  This roll had about four different kinds of fish wrapped inside the roll.  I forgot what kind of fish it was, but Lorna D. loved it!  \"It's hella good!\"  She also had the Tinky Winky Roll ($5.75).  She wasn't as impressed since it came with a mixture of crab and mayo.  It was okay for her.  She also added a Spider Roll ($6.50), which was soft shell crab to her dinner.  On their special menu, they also served Walu nigiri ($3.50).  Walu, also known as escolar, or butterfish, is a snake mackerel.  (It's actually known to cause gastrointestinal symptoms upon eating it, I have yet to check with Lorna D. to see if she experienced any of these side effects yet.)  The fish tasted more watery than anything, not a whole lot of flavor behind it.  Rather disappointing.\n\nI decided to add a Spicy Tuna Roll ($4.75) to my dinner and the ends were exploding with spicy tuna.  I did appreciate all the excess of tuna, but I had to request some mayo to 'creamy' it down a bit and take off some of the heat.\n\nThe big winner of the night was the Mochi ice cream!  At $3.25 for two pieces, you can choose among the different varieties they offer.  Last night they had Azuki, Blueberry Cheesecake, Raspberry White Chocolate, Pumpkin, and Chocolate Peanut Butter.  Lorna D. went for the Raspberry White Chocolate and Blueberry Cheesecake.  When I saw her face after she bit into the Blueberry Cheesecake, I knew I had to get an order for myself.  I had the Pumpkin as well.  But that Blueberry Cheesecake Mochi is FABU-LO-SO!  Yum yum!  It tasted so good!  The first bite being gentle and plain because of the mochi outside, and then you get the gentle sweetness of the blueberry, and then a wow factor hits when you taste a chunk of cheesecake.  Oh. My. Gawd.  So good!  We inquired about these yummy mochis since the flavors were so unique and discovered they were from Bubbies Homemade Ice Cream & Desserts in Hawai'i!  http://www.yelp.com/biz/regFkesM5XQLLYgs2qe7lA  I would go back to Godzila just for this mochi...actually, screw that!  I'm going to order some myself and have them ship it to me!\n\nService was okay.  We had to ask for our tea to be refilled.  They also served a brown tea that reminded me of eating at a Chinese restaurant.  The waitress also gave us our bill before we were done, which wasn't entirely her fault since it may have appeared that we were done already.  \n\nAmbiance...for such a small restaurant, it can get really loud in there!  I was rather surprised.  They have a TV on, which can contribute to the noise pollution.  \n\nGodzila Sushi - an average place to go to.  Some good rolls and some okay ones to boot.  But save room for their mochi!  Yum yum!\n\nSidenote: $10 minimum for credit card use; 10% gratuity will be added on to go orders of $50.00 or more.", "author": "Teri C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-02", "description": "Great bang for the buck neighborhood sushi joint. Ambiance is not why you come to eat at this local spot. Dragon roll and Godzila roll at the top of my list. The restaurant underwent a recent renovation, which I am not a fan of due to the new lighting. Good for small group outings.", "author": "Renard I."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-06-05", "description": "My go to sushi bar.\n\nReasonable pricing, friendly crew, and I really enjoy the fish they serve.  Can be crowded, so best to go during non peak times if possible.\n\nThey serve hamachi kama the way its suppose to be served... not like Nihon or Tsunami Sushi.", "author": "shaun l."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-11-01", "description": "I ate here for the first time since 2000.  It's alright.  The fish is fresh, but there are better cuts of fish out there.  I ordered the Maguro Nigiri and the pieces didn't melt in my mouth.  I had a few rolls too, they tasted like sushi, but not good enough to rub all over my face.\n\nThe prices were low, but if you ordered the \"special\" rolls you got into the $10+ range.\n\nThe crowd hanging outside reminds me of a slightly less Marina-ish Ace Wasabi's crowd.  Not really my scene.\n\nbtw, what's that smell?", "author": "Rob U."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-12-03", "description": "In-N-Out for $50 + tip! This included 2 LG Asahi's, LG hot Sake & Tons O' Sushi!\n\nNow that the dinero portion is outta the way let's get to the good stuff. Came in on a Friday night, even though it was fairly crowded there was zero wait time to dine at the bar...Yippy!\n\nAll of the rolls were delish and the fish was o so fresh. My fave was the Spicy Mayo Mussel special. I hate MAYO with a passion but there was no taste of the nasty stuff. In fact it was a simply divine Mussel served on the half shell baked with hot stuff that caused me to consume my own Asahi.\n\nFeel free to make your own Sake Bombs...very fun!", "author": "debbie h."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-04-21", "description": "The sky passed into night. The last sign of the birds were almost gone. Our legs burned and shot pain like fireworks. Looking at the hiking trail, with musing and irrevocable astonishment, we were almost home. He said, \"There's nothing else we cannot do after this.\"\n\n\"No,\" I said. Feeling very strong.\n\nWe could hear our stomachs, the acidity bubbling inside of us wrapping what felt like our intestines into knots.  \n\nI suggested sushi.\nThere were other hungry people among us at the small restaurant. \nHe grabbed my arm in earnest and eventually had to let go for us to sit down.", "author": "Jenny T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-08-07", "description": "Two friends of mine were getting married back in '05 and wanted for me to be involved in the wedding. Either the bride or the groom could've claimed me for their side. I didn't really have a preference and they rejected my suggestion of officiating the wedding. Apparently, they had tossed the idea around a bit, but finally realized that it'd be a problem. \n\n\"A problem?\" I wondered.\n\n\"You mumble. People won't hear you.\"\n\nTonight, my girl and I went to Godzilla Sushi. She wanted me to pick a place. I wanted sushi. Her good friend loves the place. I wanted somewhere we could walk to. So here we were. \n\nSo how do these stories relate? Well, she had to ask me more than a dozen times to repeat myself. I swear it was because the music at Godzilla was so loud that my normal speaking voice was drowned out.\n\nThe food was OK. The service was OK. There was nothing special here at all. I'm not sure how anyone could love the place, but that's OK. Some people wake up everyday and look in the mirror and remark how much they love themselves. If I can be OK with that, I guess I can be OK with this. \n\n(Note: I think people do this with mirrors. I'm not sure. I've never known anyone besides the sweater freak on SNL back in the early 90s. But that's mmm-OK.\"\n\nWe started with edamame which had no flavor. Followed this with a simple green salad with a sesame-miso dressing that turned the bowl of crunch lettuce into a soupy messy by the end. \n\nWe opted for rolls. Nothing to crazy: spicy California, spicy tuna, a spider roll, and a U-Nasu roll (BBQ eel, eggplant, cucumber).\n\nI washed it down with a 7-Up until the waitress re-filled my glass with water. She noticed her mistake and got me a new can. And, that was really nice of her since I was essentially done with it already.\n\nI wasn't expect much coming here. I don't expect I'll ever come back. It's just OK in a city that has much better sushi. We just have to find it!\n\nCan Yelpers Help Me? Please! I need good fish.", "author": "Dave B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-06-02", "description": "this is one of the few ratings that I'm confidently qualified to give.\n\nI've been going to this kitschy little sushi place since before I even lived in San Francisco, and I've never had a bad experience.  Their sushi is fresh, the price is right, and the energy is buzzing.  \n\nThe menu is simple and straight-forward, but they still have a few daily specials to keep things interesting.  A fun place to go with a few close friends (not conducive to large groups).  And if you go on the weekend, you'll most likely find a line.  Don't worry, it's worth the wait.", "author": "Zuzzi E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-01-15", "description": "This place is how sushi bars should be. \n\n-Cheap.\n-Tiny and packed, but this helps its authenticity--think Tokyo. (Drink beers and chat up strangers while you wait for a table. It's more fun that way.)\n-Sushi chefs who look like they moonlight in Japanese rock bands. \n-Sake bombs abounding.\n-Delicious to the point of near ecstasy. (For real. My eyes rolled back in my head at one point, you know, like in the good way.)\n-Get the spicy mussels. (I think I cried a little bit and may have tried to kiss somebody. I can neither confirm nor deny that rumor, though. Like I said before, sake bombs were abounding.)", "author": "Rachel F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-08-30", "description": "One of the few great places for sushi around.  Of course it's expensive!  Want cheap sushi?  Go to 7-11.  Yes, they have sushi.\nService is adequate.  Location is fine.  But since we are dealing with a food that is difficult to get right, 5 stars for my friends at Godzilla.", "author": "Patrick A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-16", "description": "Its not the best sushi, but its the best affordable sushi served by real Japanese people.   Loved the eel, avocado, cucumber, eggplant roll.", "author": "Wakako U."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-12-18", "description": "Reasons to go here:\n1. You like to listen to Led Zeppelin or Pink Floyd to get the full effect of your Rock 'n Roll Roll\n2. Places with new age music and modern furniture creeps you out. I mean, how serious can they be about their food when they spent all their startup capital on furniture and ambiance?\n3. You like good, no frills sushi.\n4. You finally scored a date with that cute hipster guy/girl and you want to show them that you are so not mainstream.\n\nReasons to not go here:\n1. You are trying to impress a date who shops at Barney's \n2. Highly recommend not going here if you sanitize your hands before and after you shake hands with strangers.\n3. It's not the type of place to wake up early enough to snag the top fish at the markets at 4:00 am. Instead, they'll get there at 5 am so they don't get stuck with the worst, but the best has been long gone. \n4. This is your first time eating Sushi - go to the place with the cheesy ambiance, then you'll appreciate Godzilla's charm.\n\nOverall, good place.  Not the best sushi, but the best in the neighborhood (which is kinda saying a lot considering how close Japantown is and all...)", "author": "Cindy W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-03-31", "description": "Pennies are being pinched, Bear Stearns collapsed like a 2nd hand beach chair. Somewhere out there, not quite in Pacific Heights, but not quite the Western Addition lies an Oasis in this chaotic time. \nGodzilla Sushi: improbably priced and consistently fresh delicious Sushi. \nTheir signature & namesake roll comes filled to the brim, hmm...do cut rolls have a brim? , well let's say brim with scallops, hamachi, avocado. Always satisfies. Simpler offerings such as the Sake Nigiri come fresh with thick salmon slices that at $3.25 you wonder if you may have stepped back a decade upon walking through the door. \n\nPac Heighters hop in your A4 and drive down, you won't be disappointed. Western Addishers, grab the BMX w/ the black mags and get North of Geary....\n\nGodzilla is your destination.", "author": "Gabe b."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-01-27", "description": "I've been driving past this place for years and tonight was the first night I've actually eaten here!\n\nWe arrived shortly after they opened and so were able to score a table.  This place is very small, so I imagine it could be difficult to get seating on a busier night.  There are only 5 tables and a small bar.  \n\nThe menu is pretty basic...mostly sushi, sashimi and nigiri with your typical sides of edamame, miso, seaweed salad, etc.  They have chirashi, tekka don, but no teryaki or tempura so you really have to be a lover of sushi to go to this place.\n\nI was really surprised at the prices.  For the area I would expect it to be a bit more expensive.  Most places I go to the seaweed salad is around  $5.00 but it was $3.50 for a very hearty serving!  I ordered the spicy tuna roll and it was very good although served a bit different than what I'm accustomed to....they put avocado in it and the spicy mixture seemed more creamy based.  I was a little disappointed in the edamame because I prefer it to be served hot and it was served cold here.  Not a major deal breaker, though.\n\nService was efficient and no frills.  It's a very casual atmosphere there...a mixture of college crowd to young locals.  The most exciting thing that happened was when I have a Pretty Woman experience (no, no hookers) and was biting into the edamame and a bean flew out of the pod and hit the guy at the next table....slippery little suckers! ;-)\n\nDefinitely will be stopping by Godzilla on a regular basis....I'm hoping they do take out since it's such a small place and would be good to pick something up and take home!", "author": "Melanie N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-02-12", "description": "Despite the bad service my family and I got last time we were there (there were just too many people, and part of the fault was ours because we were just not happy with the amount of time we were waiting for our food), I still give Godzila Sushi 5 stars solely on the quality of their food.  They don't have bento boxes and all that nonsense... they straight up give you sushi, sashimi, and appetizers... that is it!  oh yeah, they serve sake too.\r\nThe sashimi are so fresh.... they're like BUTTAH!  Whenever I put one in my mouth.. .it's as if my tongue is making love to it...\r\n\r\nAppetizers to get:\r\nHamachi Kama (grilled yellowfish cheek)---soooooo good!  Get this with a side of rice if you want to be on a budget.  They raised the price from $7.50 to $8 something I believe.\r\n\r\nSpicy Mayo Mussels--SO FREAKIN ADDICTING and very savory!  Get a side of rice too if this is all you're planning to eat.  A bit on the expensive side, because you'll get only 2 or 3 pieces per order (i forget exactly how many), and they don't come cheap when they're so addicting!\r\n\r\nRolls to get\r\nGodzila roll--very tasty and very reasonably priced ($8.50 i believe) because it has 4 different fish inside! luxurious\r\n\r\nSpicy Tuna roll--one of their top sellers ($7.50 I think)\r\n\r\nSpider Roll\r\n\r\nTinky Winky--I forget what fish is in this one, but I like it because they use shiso leaf.\r\n\r\nI've always been happy with the food at this place.  I used to go here after my volunteer shift is over at UCSF Mt. Zion.  \r\n\r\nI only suggest to go somewhere else if you see a huge line waiting to be seated.  You'll be frustrated more about the service and it will compromise your overall first impression about their food if this is the case.", "author": "Grace M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-10-21", "description": "This was easily the worst sushi I've had in San Francisco.  I asked for the chef's recommendation for a fresh fish and I got the Spanish Mackerel sashimi which was chewy.  There is nothing more disgusting than chewy fish that stays in your mouth longer than it has to.  They can't even drown out their un-fresh fish with decent flavorings.  I will never go back to this place.", "author": "Stacy S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-13", "description": "This is one of my favorite haunts in my old neighborhood. It seems like we used to go here every other weekend. \n\nAll of the fish is extremely fresh. Try the specialty rolls...Godzilla, Rainbow, Tinky Winky all are great in the mouth. \n\nAlso they often have different types of fresh fish, toro tuna, and other goodies to enjoy.\n\nI highly recommend this place. \n\nI only didn't give it five stars because the place is small so during dinner it can take some time to get a table. The service can be a bit slow at times, but it is well worth the wait.", "author": "Jonathan G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-06-06", "description": "If I ruled the world of Godzila sushi... the first 5 changes I would make\n\n1) There would be more staff....so the sushi would arrive less than 45 minutes after you order it.\n\n2) There would be more tables so you won't have to wait as long to be seated.... although this could increase the food-waiting time even more.\n\n3) The sushi would be just a little bit better.  It's not bad, it's just that all that waiting and all that crowd raises your expectation to crazy heights.\n\n4) They would be open during the day so that I can go at lunch.\n\n5) There would be an animatronic Godzilla that would tell stories, sing songs, and/or breath fire every 20 mins or so... like something from Chuck E Cheese.\n\nPoints though for there actually being a sushi place in this part of lower pac heights (don't doctors and nurses eat sushi? what's wrong with you people?)  and bonus points for going with the less-popular spelling of Godzilla using one 'L'.", "author": "Neej M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2007-11-18", "description": "You know how just about anything you eat after a post long work hard work week happy hour where you got more than \"happy\", tastes pretty damn good? Like plus two stars over my sober rating good? Yeah, that idea doesn't apply here.\n\nAfter getting \"happy\" with a few beers and shots of tequila, we ventured here in hopes of some good sushi.  No such luck. Instead we got overpriced, tasteless, I've-had-better-from-Safeway sushi. \n\nI don't mind paying for expensive sushi, but I at least expect some kind of pleasure from it.  Nor do I like to wait 30 minutes to be seated. And for damn sure, I don't like the bathrooms there to smell like bad fish. \n\nAbout the only thing I did like was the 13 inch TV there that was showing the Warriors win their first game of the year!!  ...\n\nWE BELIEVE!! ... that I'll never recommend this place to any sushi fan that is!", "author": "David B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2007-05-05", "description": "Gross. I don't know if this place actually qualifies as a sushi restaurant.\n\nMaybe it was partly that I was on a shitty date where I eventually asked the guy to drop me off at the 76 gas station rather than my actual apartment, but shit.. I know bad sushi when I eat it.\n\nRice was not really sushi rice, the tea had some wierd odor, the nigiri was from costco... even the miso soup was bad (a faint taste of miso with a strong hint of water).\n\nAlso the restaurant itself, physically, was really bad. The door opens to the entire seating area so if it's a windy day, you can FEEL it every five minutes that the door opens. They're also very slow and don't give a rat's ass if you're having a good time.\n\nUnless you're a real sushi idiot don't eat here. Or take a girl on a date here. Unless you want her to ask you to drop her off at a 76 gas station.", "author": "ting b."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2007-01-05", "description": "I've given this restaurant a few tries and have never left happy. Their Wakame salad is rubbery, fishy and just horrible (which is one of my favorite dishes that I always order when at a Japanese restaurant).\n\nThe sushi isn't the freshest I've ever had and there isn't anything original on the menu.\n\nBummer because this place is so close to my house!", "author": "Sarah T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-05-04", "description": "Little restaurant, big taste.\r\n\r\nI went with a friend for a quick dinner after yoga, and we only had to wait about 10 minutes which was good, because there is barely any room to stand.  It's one of those sign-up sheet places where you can't help but stare like a hawk at the other diners in hopes that they will give up their seat soon.  Good thing that yoga gives me the patience that I don't normally have!  \r\n\r\nI kept it simple since this was my first time there:  Unagi & white tuna nigiri, and the Tinky Winky Roll.  Don't be fooled by the silly/funny name - Tinky Winky is very  serious & sophisticated!  Shiso leaf, salmon, avocado, watercress (and another fish, I think...) = my new favorite.  The shiso leaf is the kicker - like a savory version of mint...it's sooooo goood.\r\n\r\nThere's no atmosphere to speak of, but it's not about that here.  This is more like a sushi diner:  dependable, neighborhood-y, no frills.  The service could be friendlier, but hey, the service at Ozumo totally sucks and you don't have money left over to buy shoes the next day!!\r\nI liked that they served black tea instead of green tea for a change, too.\r\nWell priced, quick service, very good sushi.", "author": "Liz S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-07-23", "description": "This is my preferred sushi spot. I have other 5-stars but allow me to go on record and say this is the spot. I always get there right when it opens: 5:30 and rarely go after 7PM if at all. Parking at that time is never an issue, and most of the parking (I'm confident is taken mostly by UCSF visitors) is pretty open and easy to get. There are always seats at the bar and the chefs are pretty nice guys. \n\nSushi is cheap. And good. Did you read that? In the same breath, children. Cheap and good. I always get ginger tuna, negi toro, albacore tataki and I'm a happy kitten. Husbandido likes the chirashi and sashimi. You'll appreciate the fresh fish and efficient service. Now keep in mind again that I only go right after work, and your experience might be totally different later in the evening, but you can't go wrong if you're here. Expect a waiting list if you come later in the evening. there are maybe only 12 seats at the bar (if that) and 5 tables. Damn, I forgot how many. Guess I'm going to have to go back soon!", "author": "Charlene L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-02-14", "description": "It's not clean, it's nothing fancy and it's really small, but the fish is pretty good.  And when you're talking about a sushi joint that's really 98% of the battle.\n\nBesides the fish, the #1 thing that stands out is the value you get for your money.  For what you're served it's down right cheap.  They're a little rice-heavy on the rolls, but the sashimi is fresh and good.  \n\nIf you go during prime dinner hours expect to chalk your name up on a hanging yellow notepad on the wall and then stand outside waiting for an hour.  However, if you get there early or you're willing to sit at the sushi bar, you've got a better chance.  Either way, a packed sushi place means high turnover, more eaters, fresher sushi!\n\nAnd don't order any type of regular wine (stick to sake). When I walked to the bathroom in the back (which was also a questionable decision), I noticed Franzia boxed chardonnay in the fridge (college tailgating flashback).", "author": "Holly M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-10-23", "description": "I actually received this recommendation from a friend who had lived in SF - moved to Austin - then NY when I was finally converted to being a Sushi connoisseur (yeah I was kinda grossed out by the raw fish and seaweed thing - but I got over it. \n\nGodzila is great -- but it's NOT fancy. So if you want to be catered to and bowed to and enjoy a nice quiet sushi dinner -- this is not the place for you. They usually play the Ramones and the chefs holler back and forth to each other. The servers are a bit surly -- but crap I would be too if I had to serve a bunch of people who were all grumpy from having to stand in the middle of a room starving watching others eat ... \n\nOK so here's how it works. You go in, put your name on the list (which they've RECENTLY put by the door -- used to be in the secret place only those in the know know about -- by the TV in the back), then WAIT for a table or seats at the bar. My suggestion is ... if you're hungry sit at the bar. You just get your food faster there. There is no waiting area -- so you basically stand in the middle of the room (see above) staring down those who are enjoying their sushi and sake trying to make them uncomfortable enough to eat faster. This, of course, doesn't work. This is San Francisco people -- we're USED to being around lots of people with angry looks on their faces ... but I digress.\n\nOnce you're seated you order your rolls. They have MANY to choose from - check all the boards!! A couple of my personal favorites are the Spicy Tuna and the Lazy Monkey - I know I know -- BANANA in a sushi roll -- TRUST ME this is GOOD!!\n\nSO here's how it breaks down in my opinion:\nthree stars for the food\nfour for the atmosphere\nfive stars for the sushi\n\nDamn I miss this place!!", "author": "Tabitha R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-10", "description": "By far my favorite sushi place in the city.  Everything about this place is super rad. \n\nThe servers are quick and very friendly. The sushi chefs are great and love to drink with the patrons.\n\nThe food is outstanding. I recommend the Tinky Winky Roll. All of the fish is very fresh and very reasonably priced.  Side note: I'm not a huge fan of spicy tuna but I like it here. \n\nAnytime a friend comes in to visit I always take them here. 1 hour and numerous saki bombs/sushi rolls at Godzilla is heaven.", "author": "Kris P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-01-18", "description": "Good value sushi.\n\nI was pretty annoyed because we did not get a seat for ages (way over the estimated time quoted)... but I guess that comes with the good-cheap-sushi territory.\n\nThe Maguro Nigiri was not the best I have had, but the Spicy California Roll was pretty delicious.\n\nNot the best sushi in the world, so the long wait definitely entices me to just walk to Fillmore to go to Osaka.  Slightly more expensive but much better sushi.", "author": "Adam O."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-12-11", "description": "Few things make me feel like as much of an asshole as standing in the front of a restaurant, waiting to be seated when someone walks in after me, picks up a clipboard and signs in on the waiting list.\n\nThat just happened to me at Godzilla Sushi. Another party of four beat our party of four to the clipboard, because I had no idea it was there. Apparently I should have looked a little harder because we waited for at least 45 minutes.\n\nAs soon as we were seated dinner was great. I was happy with my rolls and Sapporo, definitely a lot of food for the cost. They brought out all of the rolls at once on a giant platter, which was convenient.\n\nAfter dinner there was another awkward moment when a server (but not our server) came out and demanded, \"Anything else, anything else?!\" I'm assuming they wanted to turn our table? None of us really knew how to respond but she stormed off before we could anyway. And actually, yes...we wanted mochi and green tea ice cream.\n\nOur usual server came back and we ordered dessert - I have no idea why the other woman came up to us like that. I would come here again, but only if I were in the neighborhood on a weeknight, and it was early.", "author": "carrie c."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-05-14", "description": "Godzilla's an old standby when a craving hits and I'm near Divis! Don't expect this to be an authentic high-end sushi bar worthy of Sushi Dan's scrutiny. This place is General Hospital to Grey's Anatomy, but once in a while you need GH.  \n\nIt's no frills at Godzilla and sometimes that's refreshing. The chefs have their rock-n-roll cranked up: could be Led Zeppelin one night and then AC-DC the next. Better to get a table if possible, the chairs at the bar are somewhat uncomfortable and wobbly. But the fish is well worth it: Walu (Hawaiian White Fish), Sake or Maguro Nigiri. If you have to do maki, try the specials (Tinky-Winky is fun). \n\nGood, reliable place for a quick stop, otherwise head to J-Town.", "author": "Johnny C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-02-18", "description": "Extremely mediocre sushi with cafeteria-like ambiance.  Of course, these things could be overlooked for really cheap prices (even sushi lovers need their go-to cheap fix...) but they just were not low enough.  Godzilla is another typically priced sushi place with typical mediocre sushi.  But I suppose if you are nearby, don't mind paying mid-range sushi prices for what should be cheap-priced sushi and want to stick to the rolls - sure, go ahead... but the nigiri was sliced very thin and the fish quality was indeed sub par, and as with our Aji just plain Bad.\n\nWith the plethora of sushi places in this city, It is truly a task to find those ones that feel really special. I think Ejji is one of those. Check it out.  The bill will be the same but the freshness of both fish and the recipes is wonderful.", "author": "Zachary K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-06-20", "description": "I work across the street from Godzilla and am always pissed it only opens at 5:30, usually when I leave.  So on the eve of my 27+1 birthday after lots of wine at Solstice just up the street, my friends took me to Godzilla to sober up.  \n\nWe put our names on the waitlist and waited. \n\nAnd waited...\n\nAnd waited... for 45 minutes.\n\nFinally we were seated, placed our order, and waited.\n\nLooked at the Godzilla posters.  Heard a round of Rolling Stones songs.  Then waited.\n\nAnd waited... (see a trend here?!)\n\nAnd waited... for 45 minutes.\n\nThen we finally got all of our sushi and ate.\n\nAnd ate... for 10 minutes.\n\nGranted we were a bit buzzed and hungry, but still!  I'm no mathematician but 10 minutes of eating: 90 minutes of waiting is like... not so good.  But the sushi is cheap and not bad; their ginger (I only go to sushi places for ginger) is excellent.\n\nA few weeks later my gf and I went after a happy hour and we were immediately seated at a bar and our sushi was made in about 15 minutes.  I guess it depends on when you go- try to go closer to opening time.  Our favorites are Tinky Winky and Rock 'n Roll.  \n\nGo if you are in the area and if there is no line, but I think you can find a better sushi place pretty easily.", "author": "Lams L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-01-10", "description": "The sushi is good but they're turning tricks at this joint. We are all just sushi johns expected to order, eat, and leave quickly. So what if I wanted a \"double cup\" of some hot tea? I feel like I was begging for attention just to get a refill. \n\nMaybe I was upset the Warriors were losing on the small screen in back but I've felt this way at Godzila before.\n\nDecent spot for sushi if you want to eat and run.", "author": "Ryan H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-07-14", "description": "The service here was surprisingly very good! There is a chef that is really friendly and smiles a lot. He's very interactive, which is kind of nice. The waitresses and chefs all seem to be very close with each other as well, which made for a very comfortable atmosphere.\n\nIn terms of the sushi, it was very good! The fish was fresh; not the best I've had, but definitely up there. I got the sashimi half-and-half... Half salmon, half yellowtail. As a BIG fan of salmon (like the rest of the world), I was generally satisfied. We had four slices (not too thick or thin) of each fish. The spicy tuna roll was good- I liked that it had a lot of flavor in it. There are only four pieces in the roll, but each piece is cut really thick. And last, I also the salmon nigiri. \n\nJust minus one star for the rice, because it wasn't soft and fluffy! It was kind of stale. I would recommend that you ask for lemon wedges with your sashimi. My friend and I tried that, and it was really good. Overall, great price and good food!", "author": "Catherine C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-02-28", "description": "When we arrived, there were still open seats, but wow, it filled up after 8p. Looks like a neighborhood favorite sushi bar. I think I know why - cheap prices and decent sushi (for SF sushi anyway).\n\nWe tried 4 Specialty Rolls listed on the white board behind the bar:\n- U-Nasu: Eel + Eggplant (Nasu) (6 pieces) - this was different, and tasted nice and light.\n- Pink Dragon Roll (8 pieces): pink cuz of the Salmon on the top - first piece was pretty tasty but it starts to feel heavy cuz there's mayo mixed in the crab meat center.\n- Winky Tinky Roll (6 pieces): not sure of the name but it's scallops and another fish. This had the crab/mayo thing too. So a little overkill when 2 out of 4 are heavy. Can't really taste the seafood sadly.\n- Godzilla Roll (4 pieces): yellowtail, tuna with spouts and tobiko. This was my favorite of the set. Bigger pieces of fish, not heavy, had crunch to the texture from the tobiko.\n\nSo Godzilla doesn't serve the best cuts of fish, nor are the rolls Godzilla sized, but at about $5 - $6 a roll (there are cheaper ones too like spicy tuna), Godzilla serves a King Kong deal.", "author": "Cindy W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-03-30", "description": "This is another older review that I'm importing from a competing review site.  Although this review is nearly 10 months old, I believe that it is still relevant. \n\nOriginal Date - 6-13-06\n\nLimited seating, and menu is limited to a large variety of sashmi and sushi. Chose this restaurant based on Zagat's review. The fish was fairly fresh, and our experience with the wait staff was no where as bad as previously reviewed. Pricing is very, very inexpensive. Portion size was average. I would go back but certainly would not go out of my way to eat there again - unless I had an extreme craving for large amounts of raw fish", "author": "Dennis Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-03", "description": "After eating eel for years I can say that hands down this is the best eel I have ever had. We went to multiple sushi places in the area, many with higher ratings, but I have to disagree with them. BEST SUSHI IN SAN FRAN!!", "author": "Kitsune T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-11-28", "description": "We travelled down from the Haight, looking for more fish for our buck than we get on Cole Street.  We found it!\n\nGreat little place, but open so that when it filled up soon after we sat down, the noise level went up - into the ceiling.  Sweet.\n\nThe sushi was plentiful, the small rolls small but not too much so, the bigger ones big enough to fill the mouth, but not so big that we couldn't shove 'em in there.\n\nService was friendly, they were easy going and efficient.\n\nWe really liked the Sake and Asparagus.  The salmon was very fresh and light.  The special spicy mayo mussel was pretty good, good for one mussel each.  Our nigiri was generous and cool - always appreciated.\n\nWe had 2 lg Sapporo, 2 large rolls, 3 smaller ones, 2 nigiri orders, edamame and miso....all for $54 bucks.  Just right.", "author": "Lindsay B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-12-15", "description": "I went here on a recommendation from my roommate. My god, was I totally unimpressed. Mind you I love sushi and before this place I had yet to experience a bad sushi place. \n\nThe food is cheap, and it is really close to my place (definite perks). I order a spicy tuna rolls and a couple of veggie rolls for take out. I got home and ate the veggie rolls first (not bad). Moved on the spicy tuna... literally gagged immediately. The fish was so horrible I could not swallow. Didn't even bother finishing. I have had food poisoning enough in my life.\n\nNeedless to say, I have yet to return.", "author": "Diana R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-04-15", "description": "I don't think the ratings system works exactly right for a place like Godzila Sushi.  They're bringing more-affordable sushi to the masses, but without bringing it down to the level of a food-court or fast-food biz (not even nearly).  You're never going to mistake Godzila's food for the sushi of a $30/person restaurant, but at the same time you purposely chose $20/person sushi for good reason: so you can enjoy it more often.\n\nIdeally I'd be giving Godzila 5 stars for value, 2 for atmosphere, 4 for service (they're a little too busy or understaffed or unorganized to quite reach 5), and 3 for food.  In the sense that any 3 should be considered definitely good, enjoyable food, with 4 being uncommonly good and 5 just outstanding.  On this one-rating system I guess that works out to about 3.", "author": "Eric O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-18", "description": "I hadn't been to Godzila in probably over a decade.  We were headed to another sushi place in the neighborhood but we drove by Godzila and I remembered how much I used to like it.  I'm glad we returned.  The sushi is still very solid.  Fish is fresh.  Not much else on the menu besides sushi, so don't expect udon, etc.  I had the poke and thought it was quite good.  Obviously freshly made vs. having been made in a big batch earlier.  Generous chunks of tuna and nice firm avocado and mango.  Volcano roll was also quite good with an interesting and unique mix of hamachi, sprouts, gobo.  There is nothing fancy going on here, but what they do they execute well.  I thought this was a solid meal and we would definitely go back.", "author": "Mae O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-06-26", "description": "This is by far one of my favorite places in San Francisco. They're open about 5 hours a day and always packed. \"Why are they packed?\" you might ask....and I swear you'll know as soon as you step in through the door.  It gets 5 stars, hands down!\n\nTheir rolls are awesome and the spicy tuna is just how I like it....SPICY! The service is friendly and really quick. They always have a great selection of classic rock playing in the background. The huge mural of Godzilla painted on the wall makes you feel like you've been transported to the 80's with chopsticks. The Saki is well priced and we always leave satisfied. \n\n2 people - \n\nSapporo \nSeaweed salad \nTinkie Winkie roll \nDragon roll \nSpicy California roll \nSpicy Tuna roll \n\nAll under $40...amazing stuff! \n\nTry it, you'll like it.", "author": "Danielle V."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-03-22", "description": "This isn't bad but the fish is always just ok. Nothing special. The place could use a refresh on the interior.  I would order rolls, not Nigeria here. Some nice basic rolls.", "author": "kristin w."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2006-02-11", "description": "I'm not sure what all the hype is about.  While their prices are cheaper than sushi places in and around Japantown, my reaction to the food was \"meh\".  We went there early so there wasn't a wait, but I certainly wouldn't wait for a seat here during their busy hours when it's hella crowded considering the quality of the food.  I think I got food poisoning there because a few hours later I was feeling pretty nauseous and sick in general.", "author": "Karen W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-08-06", "description": "The service is just bad. Here's how our evening went...\n\nWe sit down and order two alcoholic drinks, a salad, and $60 worth of sushi. We get our drinks and our salad. The salad we got is nothing like the one pictured above (from Melanie D.) even though that is how it is described on the menu. Our salad was basically a plate full of Iceberg lettuce drowning in dressing with one sad piece of butterflied shrimp and a few very brown avocado slices (if you're going to pre-cut your avocado squirt some lemon on it for pete's sake). No crab stick, no sesame seeds, no cucumber. My dining companion has eaten here several times and ordered this salad before so he mentioned the missing items and the fact that our salad was way over dressed and requested a little more lettuce to even out the over dressing. The sushi chef refused but did send us a plate with half a crab stick nicely sliced.  It was totally pathetic. If you're going to serve a sad salad with only half the ingredients, either take it off your menu, stick to the description that's on the menu, or change the description. Needless to say, we asked for our bill and left.\n\nI have worked in restaurants and am therefore overly forgiving for common mistakes (forgetting I asked for water three times, etc.) usually doesn't faze me especially when the restaurant is obviously busy. But being rude about a mistake/poor quality is just inexcusable.\n\nI suggest going to Zushi Puzzle or Tokyo Go Go (both of which are more expensive but the quality of the sushi, service, and decor at both is MUCH better).", "author": "Dani D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-06-30", "description": "I've now been here for dinner twice and pretty much felt the same both times. not bad, basic sushi. if you've got a hankering but don't want to spend the big money, it suffices for a neighborhood sushi bar.  hamachi was good, sake good. the special rolls are okay, just make sure you ask how many pieces they come with since it's not all the same.  Don't expect to get blown away, but if you want basic, that's what it is.", "author": "Susan Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-04-11", "description": "While the blaring rock/punk soundtrack has never appealed to me, Godzilla is permanently in my top-10 list of sushi places in SF.  Described most accurately as \"best-value\" sushi; above average quality, reasonable prices, and offering some things I enjoy that I don't find at every sushi place I visit.\n\nHolding at 4-stars only because you can spend a lot more money for a little better quality fish.  The potential for 5-stars still exists if I only could easily walk here - perhaps a \"Godzilla 2\" could be opened in my dining room?  I think Tal K. and Chard M. would agree.", "author": "Ryan P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-08-09", "description": "Awesome spicy tuna hand rolls!!!!!!!!!!!!!!!\n\nUsed to crave them and get them take out.  I just may die of mercury poisoning I eat so much spicy tuna!", "author": "Chris P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-10-09", "description": "This restaurant should be listed as a $ not a $$\n\nCheap sushi in Pac Heights?!  \n\nThat's right. We always order tons of food and still haven't managed to rack up a pricey bill. \n\nI'm definitely not a sushi snob, nor am I big seafood fan--BUT I like Godzila and you should too. Especially, if you're on a tight budget.\n\nAlthough, if you are in a rush on a Friday/Saturday night expect a wait, or come early to put your name in.", "author": "Shel Z."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-09-22", "description": "Totally reasonable sushi.  My last dinner there was $12, including tax and tip.  And I was full!  Not many sushi joints can boast prices like that. \n\nTry the Tinky Winky and the Spicy Tuna.  Both are pretty delicious.  I like the way they pile the spicy tuna concoction high on top of the roll.\n\nThe ambiance is lacking, but its OK because the wait-staff and sushi chefs are warm and attentive.  They happily brought my crew a plate full of ginger when we asked for extra.  \n\nThat earns you points in my book.", "author": "Rachel G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-01-02", "description": "I came here for lunch as a group of 6 earlier today. The food was reasonably priced and not too bad, but I'm deducting stars because our bill was incorrect twice. The first time 2 of the dishes were over-charged by almost $10 total. After we pointed this out and they corrected it, the 18% gratuity they automatically add on for groups of 6 or more was more like 20%. If you decide you want to try this place out, make sure you have your calculators handy to double-check the math on the bill.", "author": "Helen C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-01-25", "description": "2 stars for the restaurant.\r\n\r\nThe service is mildly hostile, the atmosphere is not really an atmosphere you might expect. Its more toward the 50's diner genre.\r\n\r\nThe 3rd star is for the Unagi Don exlusively.\r\n\r\nI love eel.\r\nAnd for those of you who stay clear of carbohydrates, it has none.", "author": "Marz W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2006-12-18", "description": "** Update, 3/1/07 **\n\nFrom three stars down to two.\n\nCHECK YOUR FOOD BEFORE YOU START EATING.\n\nTHEY WILL CHEAT YOU!\n\nI've gone there several times in a row for takeout this week, and each time it's the same. Only 4 pieces instead of the usual 6 pieces of rolls. And that's regardless of which rolls you've ordered. \n\nI've ordered their spicy scallops appetizers on two consecutive occasions. (These are the rolls of seaweed paper shaped into a cylinder and stuffed with raw scallops in spicy mayonnaise). The first time I got it the way it should be. The evening after, they gave me one that was half stuffed with rice on the bottom!! It allowed them to use half the amount of scallops while giving the illusion that you were getting an honest serving!!\n\nVERY DISHONEST.\n\nUnfortunately, it's one of the few sushi places in Pac Hts outside of JTown, so if you must have sushi in that neighborhood, you might not have much choice. :(\n\n_______________________________\nNice, casual Pac Heights hangout for the neighborhood's young sushi loving crowds. Good eats for surprisingly good return on your money. I'd give them more stars if something could be done about the shortage of seating, and the rather short menu. Would also love to see the chefs get more adventurous with their creations.", "author": "Clar L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-04-15", "description": "Good sushi, good unfiltered sake!\nVery Affordable!\n\nTo get any more stars I would have to try their donburi. SF can do sushi, I am still not confident they can do Japanese food (udon, donburi, other dishes of my childhood).", "author": "Sara K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-06-30", "description": "Let me tell you why I would not go back even though they are the only sushi in our hood.\n\nFOOD:\n1) Menu is extremely limited and only sushi/sashimi.\n2) 8ish dollars for 4 piece rolls.\n3) Rolls are smothered in some kind of sauce that makes all the rolls taste the same.\n4) The rolls were overstuffed, hard to eat, and just not that good or fresh.\n\nSERVICE:  Pretty good, efficient, attentive.\n\nAMBIANCE:  Bare-bones, no frills type of place.\n\nOVERALL:  Not feelin it.", "author": "Stephanie W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-12-15", "description": "I really shouldn't be reviewing this place since I don't really like sushi. But here is my my 2 cents worth. I usually end up getting the vegetarian stuff or California rolls. I can't say i'm really impressed. The food is just ok. Sometimes the service is really slow, even when it's not packed. And they tend to take a while to make the food. Granted, precision might be key but they take way too long. The eggplant dish and the assorted veggie rolls are pretty good, but I've most definitely tried better. If you're in a group, be careful about who's ordering what, because dishes may get combined.", "author": "Alex E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-05-04", "description": "Great neighborhood sushi joint, cheap quick and the chefs are pretty cool.  My signature is a the California salad, yellow tail and green onion roll and the godzilla roll.  \n\nGet the Godzilla, it's absolutely the best for their \"special rolls.\"\n\nThere's definitely a steady crowd there, Tuesday/Friday night... both pretty packed but not an unbearable wait.\n\nI'm an optimist, because i really think this place deserves 3.5 but unfortunately that's not an option.  WHY am I against Godzilla?  The fuckin new credit card policy of $20 or more.  I was with a party of 4 and we wanted to divide the check... $18 per card and she wouldn't do it!  Seriously???  And wouldn't budge... I felt like i was being tauted by my little niece, sorry Charlie.", "author": "Laura H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-12-03", "description": "Always a good experience. Tasty, fresh, good service, and the price is right! Sometimes there is a wait that isn't terribly long- and as \"they\" say, good things come to those who wait. \n\nThey have really yummy mochi, too. Original flavors like coconut with pineapple *(mmMMM) or raspberry with white chocolate, Mmmm, tasty.\n\nAs for ambiance, it's cool to go to Godzilla for a low-key night. It's a no frills kind of place.... go to hang out with friends.. eat a lot, spend a little.", "author": "Amy J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-05-07", "description": "This is my go-to sushi place in San Francisco. If I don't have a lot of money and can't afford Live Sushi, and just have a crazy sushi craving, I always come here. The fish is fine, the food all around is always good, and the staff is really friendly. I probably come here at least once a month, and the price is definitely affordable.\n\nSome faves: the godzilla roll, the hamachi nigiri, the seaweed salad, and the hot tea is the bomb here. Yeah, I said it. It's the bomb.", "author": "Alyssa P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-10-02", "description": "Weird decor - I get that it's named after the monster, you don't need to put up strange posters and toys from the movie to remind me! Other than that, the decor looks just like a smaller version of my high school cafeteria, except the lunch lady is now several Asian men behind a sushi counter. I wish I could say the service is better, but its not. \n\nThe sushi is just ok. While its not expensive, I think you can get better for the same price.", "author": "Kelly C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-13", "description": "So we figured there would be no open tables on a Friday evening at 7:30, but to our surprise a table for 4 was waiting for us!\n\nThis is a very small place, probably only 7 tables in the whole restaurant. Atmosphere is just like a normal sushi place, nothing fancy. There are all kinds of Godzilla movie posters all over, which I thought was hilarious!\n\nThe servers were friendly and the sushi was good (wasn't the best I've had, but wasn't close to the worst either).\n\nYou definitely can't complain about a $20 meal in SF that included sake!!", "author": "Elaine S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-10-06", "description": "My sister and I hit up Godzilla since we haven't been there in a long time - shame on us for not going sooner!!  The fish is fresh and delicious - we had sashimi and nigiri til we couldn't eat anymore.  The price is great - we ate a ton and didn't leave with empty wallets.  The other disappoint is that I love speciality rolls and they don't have a big selection.  I will be back for all the nigiri and sashimi my heart desires!!", "author": "Arica V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-04-06", "description": "YUM YUM YUM!!!  Delicious and reasonably priced!  This is a great place to go for a few Japanese beers and good rolls!  Their specials menu is worth ordering from.  Last time we went, we ordered 4 rolls all of the menu on the little whiteboard behind the sushi chefs and were not disappointed!  There was some roll with Mango in it I wish I could remember the name but I am sure it's the only one with Mango....whatever it is....get it!", "author": "Jessica J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-08-18", "description": "Hmm... I was going to give Godzila more stars, but after reading other reviews I am kind of bummed out. I thought this place was really good. Maybe it has changed since I was there?  Gone downhill?  I remember it as being rather tasty and fresh.  I still say it is A OK in my book.", "author": "Devon H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-06-16", "description": "This is the first place I ever tried sushi and it's still my favorite place in the city.\n\nThe fish is fresh, the rolls well sized and the price is right.  The Godzilla roll and rainbow rolls are staples and they make the best Spicy Tuna hand roll.\n\nI don't get up there much anymore, because I live in San Bruno, but if I can make a excuse for sushi in SF, this will be the place.", "author": "Ken P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-16", "description": "Real good in most every way. Very reasonably priced, interesting roll variety, and Godzilla everywhere. Definitely worth a try.", "author": "tom s."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-11-16", "description": "Worst sushi place I've been to in the city. Rolls are, at best, sub-par. The Hamachi yellowtail, hard to mess that up as long as its fresh and you could tell it wasnt the freshest. \n\nAfter being told to go to Godzilla by a few friends, finally tried it and it was definitely not worth the hype. So many other places in the city with better more creative rolls, fresh hamachi/sashimi, and way better atmospheres.", "author": "casey p."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-04-21", "description": "An acquaintance brought me here since I said I'd just gotten into eating sushi.  I think we got the Tinky Winky, some unagi, and some tobiko [?].  Everything tasted fine, my favorite was the unagi though.  My tummy felt a little funny a little later on but then I was fine.  If I go back I'll try something different...", "author": "Paige W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-10-29", "description": "Tried it for the first time 10/29. I had heard much about the place and wanted to give it a try. I heard the service was poor but the sushi was really good. The service was just ok and the sushi was not good at all. Ordered the Spicy Tuna roll. which was not only not very spicy but rather than chunky the tuna was more of a puree. Very bland tasting. I have had far better at other places. The Rock and Roll was OK but nothing to jump for joy about. I was expecting to find them  to be rude as some many have told me, but found them to be very friendly. Over all we were very very disappointed and will not be returning.", "author": "david b."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-01-01", "description": "It was okay. Not too great, not bad either. My food was well made, my husband's not so much (and his sashimi was dry). In the end, for the price, I can go to another sushi place with the same food quality but get more food.", "author": "Katia T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-11-24", "description": "I can't even begin to tell you how many people I have turned on to this place.  Rather than bore you with all those details, I'll sit here and try to remember my very first visit way over a year ago...  \n\nA few of my skydiving buddies were in town after a long weekend of jumping out of perfectly good airplanes and decided sushi is the cuisine of choice.  Being that us skydivers are on a budget, I knew I couldn't go too far over the $$ on, ehem, City-Search... so that's how I found Godzila.  \n\nWe've all had good sushi, bad sushi and just OK sushi, but in no way shape or form expected to uncover our favorite spicy tuna EVER in what seems like a hole in the wall sushi joint!  The service is always better than average.  The sake is good and cheap.  Their Godzila roll is to die for and they always have this very special walu on the menu that will literally melt in your mouth.  The chefs?  Always smiling, love to toast with you and will hand you paper towels when you accidentally spill a glass or two.  \n\nMy only complaint?  I moved out of Hayes and now have to travel all the way from the Mission to get there.  Oh, and I mainly order rolls here and maybe some nigeri, but I leave the sashimi for, well... elsewhere;-)", "author": "Kim D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-07-10", "description": "I would like to say one thing before I continue this review because as obvious as it seems, in reading some of the other reviews it must not be that obvious. This is a sushi place. If you want something other than raw fish, do not come here. \n\nI love sushi, and at these types of prices this is the place to go. The fish is always really fresh, especially compared to other sushi places that have the same price range. The Godzila roll is probably one of the best rolls I have had. The menu doesn't have a ton of variety, but it relies on the fact that the fish itself is very tasty. \n\nI take my girlfriend to Godzila almost once a week. Every week we order our favorites and order a new sake. It's a great way to start a Friday night. They are always playing classic rock, which is my kind of music, and the decorations of drawings and posters of Godzilla make the place a unique, fun place. The chefs are really nice, and know me now.\n\nSo try it out if you like sushi and sashimi. If you don't eat fish don't bother, if you want teriyaki chicken, don't bother. The place is great and cheap to boot.", "author": "Jaron W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-08-18", "description": "I popped my sushi cherry at Godzila, so I've factored some nostalgia into my rating.  And that's not a bad thing.  In fact, if you go way back it might help others appreciate Godzila now.  Basically it hasn't changed.  15 years ago or so the place was the same as it was....the only thing different is that back then there were 1/2 as many (ok, 33% fewer) sushi restaurants around.  The ones that were were either stodgy traditional Japanese places run by commies who wanted to return to pre-Hiroshima days (they opened restaurants as a way of getting back at Americans) or they were tourist/American-jin traps with lots of fake crab rolls, with teriyaki everything and coke on tap.  Godzila was and is still? run but a bunch of crazy Japanese sushi rock star chefs.  \n\nFast forward to tonight, 2 hrs. ago....I laid my helmet down at the sushi bar and promptly had miso soup, hot tea and an order taken down....5 min later I was in an epicurean heaven....One Godzila roll (I'm American, yo!) and one 7 piece Hamachi Sashimi plate (I think I'm turning Japanese).  White blushing with pink hues....cold...fresh....jesus h. fucking christ it was the best god damned hamachi I've ever had.  The Godzila roll went perfectly with the Quiet Riot music in the background that should have been turned up a bit higher.  If you haven't noticed yet, the Godzila font is, I believe, Fender!  This place just rocks.  \n\nAfterwards I rode my Triumph up twin peaks and contemplated both the joy and misery of being single.  (Had there been two of us it would have been much more difficult to get a seat and chicks don't dig on 40mph 10 degree wind--even if the view is awesome ;))", "author": "Nobody M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-12-23", "description": "Note: My review of G-Bar will start off nearly identical to Godzilla's for reasons that will become apparent.\n\nSaturday, December 22. I'm supposed to be working the door at Solstice. My other friend is supposed to be serving customers. 'Thing is there is no one to open the door for and no one to serve. We had lots of bored employees so someone comes up with a game.\n\nEveryone throws into the pot. You have 15 minutes to get to any other bar with a teammate, take a shot and get back to Solstice with proof and you had to wear a Santa hat. Some people drove, some skateboarded, some came back with pinatas, some came back with bartenders, but everyone won. There were no losers in this game.\n\nMy teammate and I donned our hats and ran to Godzilla. We literally busted into the place and startled a few people. The lady was being nice and said, \"Table for two?\" We said \"NO NO. We just want to sit at the bar. WE NEED SAKE!\"\n\nSo the lady brings us a hot sake. I blurted out that we need a receipt and she says ok and brings another bottle of sake. AHHH! No! A receipt. I made the universal sign for receipt and she walked away. We start drinking this horrible hot sake and after six shots we realize, \"Why are we still drinking this?\"\n\nShe brings the bill for $5.42 and we ask for chopsticks to go as extra proof and we bolt out the door. I couldn't tell you anything else about Godzilla. We were there less than five minutes but it was fun. Three stars, five stars, two stars, I don't know. Just another excuse for me to Yelp.", "author": "Hunter G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-09-28", "description": "Pure sushi bliss!  It's nice to have a good, reasonably priced sushi joint in the neighborhood that offers reasonable prices, always fresh sushi, and The Ramones blasting on the stereo.\n\n\"I wanna be sedated...with sushi.\"", "author": "Casey R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-03", "description": "Best hamachi and unagi in town. Reasonable prices. Fun ambiance. I've been coming here for 20 years and they are still my fave after all this time.", "author": "Bret F."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-01-05", "description": "I went to Godzila on a whim and was rewarded with a massive case of food poisoning. Whether it was the Pink Dragon special roll or the yellowtail roll I can't be sure, but the results were spectacular. A painful lesson I will not soon forget. Thanks, Godzila.", "author": "JD B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-04", "description": "Great casual sushi spot. The sushi is tasty and fresh. Nice to sit at the bar and watch the chefs make the rolls. The prices are also very reasonable and the service is excellent.", "author": "Tyler S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2005-12-27", "description": "Godizila (with the untraditional one \"L\" spelling) serves decent quality sushi at a low price. The menu is not very creative, but does contain the standard sushi fare you'd expect.\n\nIt's Divisidero/Bush Street location is quite convenient for Pac Hts locals (myself included), but that also means there tends to be a wait.", "author": "Dave S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-03-01", "description": "This is what I call 'play it safe' sushi. A simple menu with nothing but your average california, spider and spicy tuna type rolls. It's nothing out of the ordinary, yet there's consistent food and service. And great happy hour from 5-7 with $4 large beers and 1/2 off all sushi.", "author": "Alex H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2005-04-24", "description": "Delicious! Real hearty sushi at a reasonable price. You'll have to wait for it. Amazing spicy tuna rolls. Other rolls to enjoy: Godzilla Roll, Tinky Winky Roll, and the Spider Roll.\n\nIf you go with 6 people, be prepared to be crammed into a table that seats 4.", "author": "Judy L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-02-27", "description": "Good for mid-week sushi craving.  They're really yummy, very insexpensive, and wide variety of rolls on special.  \n\nGood for 1 or 2 people - NOT for groups.  \n\nOnly 4 stars out of 5 for VERY slow service.  People were waiting to be seated and we were waiting for our server to come back from hiding to take care of our bill so it was uncomfortable for everyone... \n\nService aside, I'll definitely be coming back --  for take-out!!!", "author": "Alice H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-06-26", "description": "Good sushi, bad karma\n\nThe food is good for the price point.\nBut the service is terrible. I could go on and on about all the miserable experiences I have had there over the years. But like an idiot I keep going back. It's because the place became special to me and later to my husband when they had a great chef who subsequently left.\n\nTonight we had dinner there again, and they didn't accommodate my little requests for my current new mommy diet. Won't switch rice with salad on menu, won't swap octopus for some other fish from sashimi combo, won't do spicy tuna roll without the rice. Also, won't get more than 15% tip, and won't see very much of us either for a while, till we forget how unfriendly they are. Did I mention I have been going there for years? Oh yes I did. Did I mention that I always (not tonight) leave at least 20% tip? It makes us wonder why is it that some people are OK simply being rude to others? What is there to gain? That's why I say bad karma.\n\nBut in the meantime, the sushi is good and it saves us a walk all the way to Japan town. Grrr! I need to find new place close-by.", "author": "Elsa T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-08-16", "description": "Excellent little sushi joint for the money. Fresh, tasty, inexpensive and close by. Who cares if the service and ambiance isn't that great? That's not why you come here. You want ambiance, go pay twice the money for KISS. You want good sushi for not a lot of $$$ that's consistently good, come here and stop your bitchin'.\n\nMy only gripe is they don't do lunch.", "author": "Scott T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-12-24", "description": "This place gets a 3.5 from me.  The price is very good, particularly for this part of town.  However, the menu is  boring and limited.  The fish was good.  I will go here when I don't want to spend much cash but have some good sushi.", "author": "Elizabeth R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2005-12-27", "description": "Um, it's cheap. So there you have it.\nAnd I'm a big fan of the rockabilly sushi chef--he's super nice.", "author": "Autumn W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-01-06", "description": "Inconsistent sushi. Mediocre service and definitely don't go there for the atmosphere and decor.\n\nThe food is sometimes great but never pretty cuts of sushi, or just okay. The price is reasonable and some of the rolls they don't mess up, so we go there once in a while.", "author": "Bernard M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-09-02", "description": "Sushi is cheap and good for the price; service is pretty good. However, it's nothing to write home about. And, if you know anything about Sushi, this place isn't for you - stay away. \n\nThis place is good for a few cheap friends who are looking for some beer and American-ized rolls. Most people who love this place still have their sushi training wheels on...", "author": "Dan M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-06-06", "description": "GODZILA! AHHHHH!\n\nThe sushi  here is pretty good and cheap.  There isn't a wide assortment of other Japanese delicacies like Udon or teryaki, but it's just a sushi bar, so I suppose that's forgivable.  I would have to say my favorite things about this place are the music, (not the usual nauseating techno pop found at most sushi joints), the decorations (customer interpretations of Godzilla drawn on napkins and then framed, a wide assortment of Godzilla movie posters, including the classic staring Matthew Broderick, and of course the wall sized mural painting of GODZILLA!) and last but not least has to be the different flavors of mochi offered -- dark chocolate, blueberry, and cinnamon just to name a few.\n\nOverall, Godzila is a lovely little neighborhood joint with friendly service, good sushi, and fun atmosphere.  Best of all you get to shout GODZILRA!!", "author": "Jill W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-10-09", "description": "We love this place and frequent it whenever we're just in the mood for sushi.  It's not the best in the city - but it's very good, very high quality, at VERY reasonable prices.  It makes eating sushi affordable on a random Tuesday night.  \n\nCareful though - it's not open for lunch, and can get very crowded at unpredictable times for dinner.  We've always had good luck though.", "author": "Kelly M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-11-14", "description": "I had heard tales of Godzila sushi- of the innovative roll combos, the excellent mochi, and the awesome mural on the back wall, but nothing prepared me for the onslaught of delicious roll after roll that I got here.\n\nWe got there relatively early, only waited 5 minutes for a table and had a really hard time narrowing our choices down from their great menu of specialty rolls.\n\nI ended up with the Spider Roll, the U-nasu Roll, and the Philly Roll. All of which were amazing.\nA little nigori sake and a lot of mochi for dessert made it one of the best sushi experiences I have had in SF.\n\nThe peanut butter-chocolate mochi was sinful. Yum.", "author": "Jessica P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-04-21", "description": "with a name like godzilla sushi, i expected this place to be cheap, mediocre, and chinese run.\n\ni was partially correct on cheap, incorrect on mediocre, and incorrect on the ethnicity of the employees/owners.\n\ni showed up at 930pm on a sunday night and the place had one available table and 2 available seats at the bar. pretty solid for a sunday i suppose.\n\ni scanned yelp before visiting, and most people mentioned the spicy tuna roll, so i tried that. i also got the godzilla roll, and a few others.  all rolls were tasty. the spicy tuna was a very large 4 piece roll. the godzilla roll was the same size, however it had 4-5 different pieces of fish in it. i'd recommend taking the godzilla roll by pieces instead of jamming the entire thing in your mouth at once, it's just too much.\n\nrolls range from 3.50 to 8.50 and a large sapporo is 5 smackers. i'll be back :)", "author": "Ameer N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-25", "description": "Ok so I ate here twice last week. My first experience was better than the second but that had nothing to do with the sushi it had to do with the clientele. Their service is quick and their Sushi...is tight!! The staff is attentive and nice. The ambiance is a bit lackluster but who cares when you get some awesome godzila art...an old school tv and some serious classic rock going...oh let's not forget about their quality ingredients...the Sashimi has got me hooked and dayuuummm that Spicy Tuna handroll is perfect in every way.\n\nOn the first night I went over there right after work abou 5:30ish and it was a different vibe than at 8pm the \"upper crust\" of lower pacific heights were in full effect....I hate being around snottie bitches with attitude and new money if you get my drift...My hubs ordered a few rolls the pink drangon roll...the tinky winky and some other manly type rolls and he was in heaven. I am doing the no carb thing and tried to eat around the rice but you know that is no fun at a Sushi restaurant!! \n\nAnyway I will be sure to order take out from here so that their grossness does not in anyway tarnish my sashmi experience....oh how I wished they were open for lunch...but on further thought that is a good thing because I would have to get another job to afford to eat there like all week!!", "author": "T H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-04-21", "description": "There are the Koos and the Tatakis of the world, but if you're just in the mood for an inexpensive and super casual sushi joint, I'd recommend Godzilla.  I'd definitely come here again if I was around Pac Heights.  \n\nFriend and I went here before a show.  Randomly stumbled in Godzilla as Tataki down the street had a long wait nd we had to get to the Fillmore eventually.  I had a hankering for some sashimi (which is always risky ordering at a random Japanese restaurant) -- but it was solid.  I particularly enjoyed the hamachi.", "author": "Ralph N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-10-19", "description": "Godzila sushi has become my Friday night dining destination.  Aside from the close proximity to my house, my boyfriend and I can eat an ungodly amount  of sushi and still get out of there for around 40 bucks.  The unagi is amazing and I have yet to find another restaurant that can make a roll as tasty as the pink dragon roll.\r\n\r\nThe only thing that I don't love about this place is the fact that ordering takeout over the phone can be next to impossible - after 6:30 or on weekends, they tend not to answer the phone.  \r\n\r\nReally, though, why would you want to eat sushi without a giant painting of Godzila watching over you?", "author": "mini moog .."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-03-26", "description": "All I have to say is \"Naaah-sooooh\"\n\n\nDelicious Japanese eggplant with some sort of ponzu sauce. Even good for the person who despises eggplant, for whatever reason.  Get as many as you can, and enjoy. But, If I come out for some nookey-nookey and nasu has been 86'd from the menu...I'm gonna find you.", "author": "Inbal R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-07-09", "description": "\"Good value\" sushi/sashimi.  Been over two years since I was here.  I kind of forgot about it.\n\nOne of my \"usual\" joints was closed, so we trekked a short hop over this way to check out Godzilla again.\n\nWe weren't disappointed.\n\nThe fish was fresh and the beer was cold.\n\nIf loud music turns you off, get take out.", "author": "Barry A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-06-10", "description": "This is my favorite inexpensive sushi place is the city. Everything is high quality even though it's not priced as such... you can even get a whole bottle of Nigori for like $8 .. love this place! :)\nAlso within walking distance to \"The Fish Bowl\" for an after dinner cocktail and a little jukebox drunken fun.", "author": "Jeremy R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-01-14", "description": "Godzila not Godzilla? Hmmmm...\n\nHad the Combo A sushi platter, pretty standard, but I tasted fresher in cheaper places. My friend's Dragon roll looked good though, not service was good. Pretty spaced out tables and not too cramped, was still hungry and ordered the tuna ginger, which disappointed. I like Tsunami waaaay better down the street.", "author": "wayne s."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-10-15", "description": "3.5 stars....if you can give half stars on yelp I havent figured out how to do that yet so...there you have it...3.5 \n\nSo this evening i felt like some sushi and I didnt want to spend a ton of cash so I decided to take Boyfriend here for dinner. I have never been before, and I read the reviews, so I didnt have the highest expectations but I was hoping for some solid tasty fresh rolls. \n\nthere is nothing much that I can add about the deco except that even though there are not alot of tables it feels pretty spacious so even when it is packed you never feel cramped. It was pretty busy but we walked in at a good moment and got the only available table, a super score as I was starving. \n\nWe had two waitresses...the first one was a lot nicer than the second one who kept walking by the table and seeing if we were done with our plate making us feel a bit rushed but nothing too bad. \nThe Food: \nDrinks: we just had tea and it was the toasted brown rice green tea which I love but it was way overbrewed which is like...common its tea at a japanese place...\nAppitizers: miso soup, spinach salad, green salad, and spicy mussels. \nThe soup was okay and the liked the spinach salad a lot, especially because the portion was not super tiny like in most places and the sauce was super tasty.\nMINUS points because the green salad dressing wasnt that sesame dressing that usually comes on green salads and that was disappointing. Also. i ordered the green salad at Halu and it was so delicious for a green salad that my expectations are probably way too high for any other place. also,\nMAJOR MINUS points because the spicy scallops arrived at the end of the meal. Like...so late that we asked for our check and I told the waitress to make sure we were not charged and as she walked away they were ready at the window so she brought them over. Now I only ordered these guys because a previous yelper said they were good and let me tell you THEY WERE NASTY NASTY NASTY. First of all  they were overcooked and the edges were burned, second it wasnt like one mussel it was mussel pieces that were all chopped up and the mayo sauce was gross and I really wanted to spit it out. Actually the experience was so bad I had order another nigiri just to get the taste out of my mouth. so sad.\n\nNigiri: halibut, sweet shrimp, salmon, and spicy scallop. The cuts of the fish were good, not too thin and not too thick and all of it was fresh and delicious. \nMINUS points because I love the heads of the sweet shrimp. They come fried and delicious...but these heads were either over deep fried, or the oil was kind of getting old or something because they did not taste good at all. \n\nRolls: spicy cali with real crab and the kamakazi with yellowtail were both super tasty and delicious. They were not super huge which is what I kind of expected just from the name of the restaurant but they were not tiny or badly made so that makes me a big fan. \n\nTotal $46 with tip. Not too bad considering.  \nI think that I would most certainly come back for a quick bite but never ever order the spicy mussels...oh no...just stay away......", "author": "Yuliya R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-01-09", "description": "Really like this place; a friend of mine said she's been going there since 1989!  Well, that's quite enough for me...plus the Godzilla drawings (on napkins, no less) are very cool.  Good for a quick sushi fix.", "author": "M. H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-02", "description": "Our neighborhood staple. Delicious and dependable. Love the Tinky Winky roll. The dinosaur decor is pretty cute.", "author": "C E."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-02-24", "description": "This is really a solid 3 1/2 stars. The sushi here is good, but not great; the service is OK; decor is basically awful, but the prices totally justify it. It's also an OK place for takeout, though you might get yelled at for standing in the wrong place. All things considered, I'm glad I live two blocks from it, but on the other hand I'm definitely at Tataki more often.", "author": "Colin T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-04-11", "description": "Second time eating here- definitely pleased with the quality of the fish, and the roll selection. Can you say Lazy Monkey Roll? Banana & Cream Cheese = YUM!\n\nPrices not so bad either- This is my new spot for when our regular sushi place is closed! \n\nAlso, the mochi flavors were not the norm- Pistashio & Raspberry with White Chocolate!!!", "author": "sarah d."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-07-03", "description": "This is the place right around the corner from my home.  I could probably eat here 3/7 days a week.  I was wavering between the 3 or 4 stars but I'm putting my foot down with the 4 stars because of convenience and deliciousness.\n\nLast time I was there I decided to try the grilled hamachi cheek.  I had this dish once at Sushi Ran and didn't know what to expect since Godzila and Sushi Ran are not really even comparable.  I was pleasantly surprised.  It's not as delicious as Sushi Ran but yummy at the very least.  They have great rolls and pieces...pretty great overall.", "author": "cristina t."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-06-15", "description": "I feel lucky that this restaurant is so close to my house because I will definitely be frequenting Godzila all the time! \n\nThey don't offer the biggest selection of special rolls but the sushi is decently priced and fresh!  The staff is very friendly and accommodating.  Definitely a great place to grab a quick bite of yummy sushi that won't disappoint!", "author": "Candice M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-08-08", "description": "I've been here for several late dinners. Although it is a little expensive and there were annoying hipster dorks everywhere on all occasions, I absolutely will keep coming back. The sushi is delicious! Even if you feel like you're placing a small order, you'll probably leave stuffed. The food is also really fresh, and just as good as what you'd get in a more ritzy looking sushi restaurant (this is more like a sushi bar I guess). \n\nThe ambiance is kind of dumpy but for some reason I really like it. I usually sit at the counter. Godzilla is perfect for a late-evening sushi fix, and if it looked more like a frou frou restaurant, I don't think I'd like it as much! The next time you're in the neighborhood, try this place out!", "author": "Heidi G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-08-29", "description": "This place rocks!!! Yeah, it may not have the best ambiance and it might not be the most happening spot to eat sushi, but the price is always right and the sushi is always fresh. Besides, they are the only spot that I know of  that carries sparkling nigori. So refreshing and tasty!\nI frequent here at least once a week and have never been disappointed, except when they have a long wait!!\nTry the lazy monkey roll and the tinky winky. Those are some of my fave's!", "author": "Kehaulani K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-08-16", "description": "I love this place and have never had any problems with the service. Spider and Godzilla are good to go. The only problem is the wait. All the wait staff has always been nothing but nice. \n\nAnd lets face it, if the waiter was mean to you it was probably because you were a stuck up prick.", "author": "Brent R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-10-12", "description": "I really like this place.  Its a great hole in the wall sushi place and is just a couple of blocks from my pad.  Love most of their special rolls, and have eaten many a Lazy Monkey Roll.  Also, this is the first place I tried walu at and it is effing delish.\n\nPros - Cheap. Casual. And there are amusing napkins with Godzilla's drawn by patrons - in frames. And the sushi chef guys are great and friendly.\n\nCons - Bathroom could def use some work. The drain scares me and lack of professional handsoap dispensor is not cool in my book.  Also, sometimes the whole place can smell a bit fishy which bugs.", "author": "Lia W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-01-07", "description": "This is my favorite restaurant in SF. The sushi is freakin delicious, its a casual atmosphere, and the prices are reasonable.  I also really recommend the mochi-- they always have usually 4 different flavors and are usually really good, like blueberry, pistachio, cherry chocolate!  \n\nAlso, I recommend trying the godzila roll & kamikaze rolls in particular.", "author": "Jaya B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-23", "description": "Stopped here on my way through san francisco last night - made it in time for happy hour.  didn't have to wait - food was decent - and you can't beat the prices.  it's not the fanciest place in town but they do have a giant godzilla on the wall - which makes up for that.", "author": "nicholas w."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-07-13", "description": "This used to be one of my favorite sushi bars,  but last time we were there 7/7/10 it wasn't very fresh.  Their unagi is still awesome though.", "author": "David H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-09", "description": "I had a Spider Roll, it was pretty good, but I recommend the Rock n' Roll! Be sure to order some hot sake to accompany your meal, or some salted edamame. Service was ok. Went late night and had to eat at the bar. I enjoyed it, next time i'm in SF i'll more than likely stop by again.", "author": "Ana R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-08-15", "description": "I have eaten a lot of sushi in my time and I was pleasantly surprised to of had such a great sushi experience. The atmoshere was very casual and the food was awesone.\nI would highly recommend this place for tasty sushi!", "author": "Feliz D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-22", "description": "I'm a huge sushi fan so I'm fine with having nothing but sushi on the menu, but be warned for bringing friends who want tempora, etc. i finally made it in and really became addicted, affordable for the most part depending on what you order and good selections. my favorite roll is the asparagus and salmon roll, that with 2 pieces of maguro sashimi is my craving regularly.", "author": "Barbara C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-08-24", "description": "I think after reading the reviews Godzila is going back up the hill.  I had it 2 times this month and the fish was very fresh and the price right.  I even went on a Sunday and if you know restaurants they don't get deliveries on Sundays and the fish was still great.  For simple sushi this is the place to go!", "author": "Christy V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-06-13", "description": "Low-key, reasonably priced, fresh fish: Godzila is perfect for when you're craving sushi but can't afford the splurge. Worth it to swallow your pride and order the Tinky Winky. Certainly not high-end sushi, but well worth what you pay and ideal for a relaxed weekday meal out.\n\n**Full Disclosure: I absolutely have a secret crush on the bad-ass sushi chef with the ponytail.", "author": "Katie C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-10-15", "description": "Godzilla sushi is a comfortable sushi \"dive\" bar with friendly sushi chefs and mostly high quality fish.   In addition to good fish and some interesting options for rolls, the sushi chef has impeccable taste in music.  Every time I walk in he's playing Hendrix, Stevie Ray, the Stones, or something you can just groove to.   Sushi chefs are friendly, sometimes we trade stories on recent concerts.  I love going here hungry because each order comes out in less than 10 minutes and they never make me wait for the check.  For convenience, good sushi, great music and friendly low key atmosphere... Godzilla is smokin.", "author": "Rob W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-07-27", "description": "shame on you if you're a japanese restaurant that can't even make a half-decent california roll. the imitation crab meat tasted like plastic and had a mealy consistency. also, way to up your price for a 6-piece roll from $3.50 to $5. what a ripoff.", "author": "Stephanie C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-01", "description": "this place took forever to make shrimp tempura. but i had a lovely time there because of the atmosphere. it was super chill and the service was friendly. sushi wasnt the best, but i would still go back. if you do go, get the sake", "author": "Lexi H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-07-28", "description": "I don't know, man.  Man, I just don't know.  I've been wanting to try this place out ever since one of my co-workers came back with, like, damn near 20 pieces of sushi for $10.  So I went there today w/ some other co-workers and was excited to see what the restaurant had in store for me.  I ordered the Westcoast combo which included California rolls, a California salad, and miso soup.  My co-workers got the veggie combo and the spicy tuna roll/tempora udon combo.  My co-worker's spicy tuna rolls were HUGE.  I mean, HUGE.  I've never seen rolls this big before in my life!  Godzilla must be taking hormone injection advice from KFC.  My California rolls were miniature compared to the spicy tuna rolls.  My order included 6 rolls.  They were...decent.  However, when I began to work on my 6th roll, I felt like the other 5 were going to come back up.  I immediately put the 6th roll back down and just stared at it.  I just KNEW that I was gonna blow chunks right then and there.  I started concentrating real hard (this is what I do when I feel like I'm gonna hurl).  Just focus.  Focus real hard on....not puking.  The feeling went away.  However, 30 minutes later at work I felt the nausea hit me again.  I told the co-workers that I went to lunch w/ that I felt nauseous and they BOTH said they felt the same way.  I'm happy to report that I'm feeling better and didn't have to resort to concentrating real hard again, but Godzilla won't be seeing me again.", "author": "Andrea B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-10-12", "description": "I was joining a couple of girlfriends for dinner, and we wanted a decent priced, casual sushi place. I think, for our purpose, Godzilla suited us fine. I can't say the sushi was great, but it was decent. Though I do have to ask, what the hell is a crab stick? It was an ingredient in several rolls. I was afraid to ask... \n\nThe place is a bit too cold, cheaply furnished and bright for my taste though I really like the corner real estate. I thought parking would be horrendous--like it is when I go to Tsunami down the way, one of my favorites--but I parked just across the street!\n\nService was efficient and unobtrusive. We split 5 rolls, 3 seaweed salads, and 2 drinks each and we managed to walk away paying $25 each. So, definitely a great value. If I lived within walking distance I would probably stop by again to get my sushi fix without breaking my pocketbook. (It was packed on a wednesday night) But, otherwise, I don't see a reason to go back.\n\nScratch that... I saw, after ordering, the Lazy Monkey Roll on the special board on the wall. Banana in sushi? I'm intrigued. However, it wasn't just Banana, it was also Avocado, Cucumber and Creme Cheese. Huh? I'll have to try it some time for fun.", "author": "Eryn H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-08-25", "description": "It's a decent joint.  I go there cuz I live nearby, I wouldn't go out of my way for it.  There is never any wait, the service is friendly.  The menu is rather standard.  A word of caution - this is not the place to be exploring adventurous / non-beginner sushi.  That's what you get for ordering ankimo at a mid range sushi joint, i guess.  For all i know that stuff could've been fish bait or cat food, it had neither the look, taste, texture or price of ankimo.\nAll things considered, great neighborhood sushi place, perfect for the spontaneous sushi craving.", "author": "Mattman J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-07-04", "description": "Sushi is fresh and cheap.  A glass of wine for 3 bucks.  Can't beat that.", "author": "Ryan M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-06-29", "description": "Godzilla Sushi has really good rolls.  Fresh and reasonably priced.  I frequent this place at least once or twice a week, when I can convince my friends to come with me.  Initially, I came because of the name.  But now, it's purely the food.", "author": "Honey L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-07-31", "description": "It is a mystery to me how a place could charge so little for such great sushi, much the same way that Ryan Seacrest's fame is a mystery to me.  Godzila is more compelling.  Trust me; I would not lead you astray.", "author": "Pammy C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-02-16", "description": "meh. \n\nsushi is run-o-the-mill cali style hybrid stuff. what i really like is the rock n roll attitude and the godzilla paraphernalia. fun for a monday or tuesday night out.", "author": "May T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-11-23", "description": "Great neighborhood sushi place that my husband and I visit frequently.  The rolls are great, and my favorite sushi is now their walu (Hawaiian white fish) that simply melts in my mouth... *slurp*  The wait could be long if you get there late.", "author": "Shoyi C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-09-08", "description": "My favorite sushi joint in San Francisco. Note that I didn't say the best, just my favorite. This is where I head when I need comfort food. Miso soup for the soul you could say. This isn't a hardcore sushi joint, you can tell that just from walking in and checking out their choice of decor (Godzilla memorabilia, both amateur and pro) and the music on the house speakers (Ramones or Clash).How does a white boy from the midwest end up listing sushi as his comfort food you ask? I do live in San Francisco don't I? I used to live in lower Pac Heights and we would start off every Friday night here. Good sake, large Sapporo, edamame, miso, rolls, nigiri, and then end it with some mochi. Fish is always fresh and they do have some inventive rolls. Try the Lazy Monkey. Don't knock fish, cream cheese, and bananas til you try it.", "author": "Bucky K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2005-11-03", "description": "It should be known that when I go to get sushi, I only care about the sushi.  I dont care about the environment, or the staff, or the location.  I just want good sushi.  That said, I love Godzilla sushi.  Great rolls, highly reasonable price.  The edamame could be better, but...  you know... (See above).", "author": "Casey S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-04-04", "description": "Gojira! Listen all you complaining yelpers, the good service is at the bar. This is the best damn sushi you're going to get for your back in San Francisco, chums. If there's a wait at the door, get yourself a nice tall Asahi and chill. The yellowtail cheek is their true specialty and well worth the 20 minutes it takes to cook (after all, you can eat your heart's content of delicious nigri or sashimi while you wait).", "author": "Tal K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-07-19", "description": "i had been to godzila YEARS ago with a friend who raved and raved.  i don't remember being particularly impressed and haven't been back since.  until this week.  i have to say that i am still not particularly impressed and i suspect that it could be years and years before i am lured back.  \n\nmy first and biggest complaint is that there was an odor upon entering the restaurant that did not instill confidence.  i braved it anyway and have no real complaints about the food itself.  i didn't think that the menu was particularly interesting or diverse and i am not sure that it's any bargain, but what we did order was completely acceptable.  \n\nhowever, acceptable isn't enough for sushi in this city.  and the decor didn't save it for me.  they have some old godzilla posters on the walls, but it isn't bold or over-the-top enough to merit stars for decoration alone.  \n\nbasically, there are tons of other places to go for cheap, basic sushi, and a couple of great places for creative menu options, so i didn't find godzila to be worth the drive and parking (which were actually very easy on a monday night).  however, if you happen to be in the neighborhood or are lured in by friends who have been won over by something here, no reason NOT to go.  \n\noh, and why do they only have on \"L\" in the name?!", "author": "Kirsten F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-08-04", "description": "A hood staple for light fare and great atmosphere.  The bf and I come here all the time or order out (even though they don't answer the phone when they're swamped).  Yes, the service is a occasionally undesirable when every seat in the house is packed and only 4 or 5 people running things.  Must-haves:  Lazy monkey- banana, cream cheese, & bbq eel all go marvelously well together), Tinky Winky, spider roll, rainbow roll... haven't found a bad combo yet.  Old school godzila posters plaster the walls and I love how they play blues and rock & roll... you can catch one of the sushi chefs dancing every once and a while... a  welcome change from the usually bland sushi atmosphere.", "author": "Tara G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-07-07", "description": "Food's okay but the parking and the wait is such a pain that I seldom bother to come here.", "author": "Trixie J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-11-07", "description": "My go-to sushi restaurant. The fish is always fresh and the staff is super friendly. The chefs are always ok with changing things around and almost let you create your own rolls. I got introduced to Natsu here and I haven't found a better one in the city yet.", "author": "Doro P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-03-21", "description": "Great Sushi, Great Price, Speedy Service with a Smile.  Excellent choice for a dinner date!", "author": "Kenyatta D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2005-08-04", "description": "Hot and cold.\r\n\r\nThe price is great.\r\n\r\nThe quality is decent.\r\n\r\nThe service is pretty spotty and can range from tolerable to unbearable.\r\n\r\nWe have eaten there four times this week. \r\n\r\nThe first three were decent and that's why we returned.\r\n\r\nThe last was horrible. The portions were unbelievably small. \r\n\r\nLiterally the size of a quarter.\r\n\r\nUnfortunately, I can not recommend this place.\r\n\r\nWe had given it a second chance after several previous disappointing visits because of its convenient location.\r\n\r\nUnfortunately it has proven to be too unreliable to continue our patronage.\r\n\r\nAvoid to be safe roll the dice if you are feeling lucky.", "author": "estebe v."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2005-07-13", "description": "Some great sushi, relatively reasonable, but alway busy, so go before 7pm on most nights if you just want to relax and eat in peace. On a random note, what is your favorite Godzilla movie? Private message me and I'll tell you mine (hint: it wasn't the one with Matthew Broderick).", "author": "Nish N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-11-03", "description": "This place sucks and I desperately want to like it. The other day, on my way home from the gym, I, once again, tried to like this place. Seriously, who doesn't want to hit-up a sushi craving after a great work-out? The fish is just, well, OK. I am not even sure if OK is proper because this is San Francisco. Seriously, you can find better sushi in Hayward - that's right. So, it is all relative. I guess what I can not figure out is: \"why and where do any good reviews concerning this sushi bar come from?\" Are these people blind, lacking taste buds, or just desperate - in this case, desperate equates to lazy because you can get much better sushi, geographically speaking, with very minimal effort.? So, that said, can someone help me out; what gives because no matter how many times I try this place the sushi sucks in quality, cut, freshness, and selection?", "author": "Kiki I."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-08-09", "description": "I really don't understand the popularity of this place.  The food is not particularly fresh or tasty or cheap and it's kind of dumpy too.  There are plenty of better sushi places in the city.", "author": "Amina B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-01-24", "description": "Godzilla = Pretty Good Sushi for a Pretty Great Price.", "author": "Kathy Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-09-28", "description": "I met a few of my old coworkers here a few weeks ago for post-work dinner.  We met around 6 pm, pretty early still, so we got seated promptly.  It wasn't crowded at all.  The waitress took our order and served our food at lightning speed.  We all got sushi rolls.  I ordered the Chirashi and the Tinky Winky roll.  The Chirashi was a lot smaller of a portion than I was used to but also a lot cheaper.  The rolls were decent and I was impressed that they were decently priced.  I wasn't wowed by their food nor their ambiance but I wasn't turned off by anything either.  Overall, just a decent place.", "author": "Jean A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-12-06", "description": "Not bad, but not great either. The spicy tuna rolls were gigantic and awkward to eat with cucumber and avocado hanging out of them. The service wasn't anything great either... and then music was too loud to talk comfortably. What I did enjoy was the spicy california roll, the green salad, and the green tea ice cream. But the overall experience was just ok.", "author": "Sara R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-10-30", "description": "The sushi is good-never fishy but not super high quality either.  The selection is standard too.  It doesn't pretend to be a snooty sushi restaurant.  I like this place because you can eat sushi for less than a lot of other places.  Basically Godzilla is a good place to go when you want sushi but don't have super high expectations or a ton of money.", "author": "M M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-07-12", "description": "nothing overly fantastic about this place.\n\nits tiny - and even with the small space they do have, they dont have very many tables on the floor; maybe it has to do with capacity space due to exits or something, but there is plenty of walking room.\n\ni went because i heard the prices were very good for what you get, but i find Kitaro to be a better bang for your buck. the sashimi is hit and miss - some slices of fish are rather good, while others just taste old. the special rolls are your usual fare, but their tea was quite nice.\n\ni figure this is a better local watering hole - so if you live a few blocks away, give it a shot, it wont hurt your wallet much.", "author": "Darrell L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-02-07", "description": "There are several good sushi restaurants in San Francisco but this is my favorite.  The fish is fresh and the prices are inexpensive by comparison.  My favorite is the spicy tuna roll. It's unlike any other spicy tuna roll I've ever had.  They have several innovative rolls along with the more traditional ones.", "author": "Cindy B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-12-13", "description": "Back when I first moved to SF and was still getting used to the sticker shock on just about everything --Godzilla is where I would treat myself for a \"nice\" sushi dinner --which was about once or twice a week (I was an addict!).\nNot a lot of ambiance with the exception of GnR or Zeppelin blasting on the stereo...which I love.  That being said, they serve really consistent fresh fish --and the bill definitely won't break the bank.\nThank you for not bankrupting me and sending me away from SF w/ my tail wagging!", "author": "Amy C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-10-02", "description": "The food is damn good. The service is a  lil slack but then again we were towards the end of the shift and relaxed ourself. Once the order was in the the food got there quick. The prices are really reasonable($4-$10) but they do not have a crazy long list of options just the main ones and a few house specialties. I like that they are open on the  later side. A great stop specially if you have to visit anyone at Kaiser or UCSF.", "author": "Natasha M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-07-09", "description": "My gay boyfriend rants & raves how this is the best sushi place in town. But Godzilla Sushi proves that our common interests & shared love for all things fabulous (including but not limited too: gorgeous men, sweaty dance clubs & cute kittens) ends there. Only 4 items on the menu for the Veggie Only folks & flexibility with those items is limited. AND it was quite disappointing that they didn't have rice or soy paper.  Request after request made me feel like I was high maintenance... which may reflect on their level of customer service. (whatever).  I wouldn't go back to this place considering we live in SF and there are WAY better places with in walking distance.", "author": "Homechicken P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-01-18", "description": "Always crowded -- I've been to Godzila a few times, but I've never been blown away.  Their toro sashimi was quite chewy -- not really edible; although, the staff was very cool about the whole thing. If you're looking for a great hole-in-the-wall, perhaps Sushi Zone will fill that need?", "author": "Tim G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-04-01", "description": "decent cheap sushi, casual setting. sat at the bar and the chef was very animated and entertaining, making jokes at me such as, \"we're out of rice\" as he lifted up the huge empty rice cooker when i asked to add the spicy california roll (after being disappointed that the spicy tuna we ordered didn't have the spicy sauce).", "author": "Diana B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-04-02", "description": "Cheap, no-frills place. Love the Godzilla artwork on napkins in frames...priceless.\n\nGood sushi - no complaints here - have been here probably hundreds of times (or close to that) and have never been disappointed.\n\nService is hit or miss depending on how busy they are.  Sometimes the waitresses are snappy and try to rush you.\n\nClose to my house (about 2 blocks) so totally worth it. \n\nThe wait is either 45+ min or walk right in.  \nYou can always have a beer and wait, or head over to Tortilla Heights to grab a drink while you wait.\n\nGood price, good food.", "author": "Vanessa V."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-09-06", "description": "Sushi was good and reasonably priced.  Service super sucked.  We waited forever to be waited on and served and had to ask for water, which is annoying in itself, but the three times?  EACH? Not cool.  I went with my roommate who said she never had this problem so maybe I'll give it another shot.  But maybe I'll just wait until Yoshi's opens and review that.", "author": "Alexis B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-11-23", "description": "I love the value of this place and the sushi is pretty fresh.  The problem I have is that some of the food is a bit inconsistent.  The spicy muscles are my favorite thing on the menu, but everything else seemed pretty average.  For the price, this place is really hard to beat.", "author": "Simon Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-11-12", "description": "I am glad this place isn't any closer to my home.  I can't get enough of this spot.  The decor is ruff...but the sushi is spectacular.  And, the prices are the best I have found in the city.  I wish they were open for lunch.  :-(", "author": "Mike W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-10-10", "description": "I actually like the fact that this place is ridiculously crowded and that you often have to wait for a table.  Here's why.  The sushi is cheap, and in most circumstances, cheap sushi means sushi that has been sitting in a refrigerator for a day or two or six.  But because Godzilla is packed like a spider roll, you know that there is know way they can keep premade sushi stockpiled.  In other words the big crowds mean high turnover and thus fresh sushi.  They may not be the greatest rolls in town, but they're cheap and fresh and that puts it ahead of 98% of the sushi joints in town.", "author": "Dubs W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-01-28", "description": "I came here with a friend a while ago. I was pretty drunk so I don't remember how the food tasted. So I guess I really don't have an opinion for this review...\n\nI just remember that they had some Squid Sashimi that made me nauseous for the rest of the night. I kept burping and tasting it. After a while my stomach started to hurt and it ruined my evening.\n\nMoral of the Story: Don't eat squid. It's a game killer.", "author": "Chris K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-02-05", "description": "I'm happy to say that you don't get what you pay for at Godzila---meaning that you pay a lot less for some better-than-you'd-expect sushi.  Their rolls aren't anything fancy (discounting the banana sushi that always seem to be on the daily specials board (because Godzilla is a monkey, and monkeys like bananas?)), nor is the atmosphere, but I count Godzila among my go-to sushi restaurants.\n\n(I'm curious as to what happened to the second \"l\" in \"Godzilla.\"  Any guesses?)", "author": "Hannah J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-04-06", "description": "looooove it!!\n\ngreat fish, quick service.  can't go wrong.\n\nbest. spicy. tuna. ever.", "author": "Stacey S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-05-26", "description": "Once you go Godzilla you can't go back. I've got to admit it took me a little white to get over the decor and the loud music, but for the Tinky Winky roll I'd do just about anything. It's honestly the best sushi in the city, and you won't break the bank. The mochi ice cream balls are excellent - Pistachio is the best.", "author": "Steph B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2005-04-14", "description": "I think before I had even tried it I had high expectations from my friends gushing about it...maybe that's why I was disappointed? Let's just say the few times I ate there...everytime while I was eating the sushi I asked myself \"Why do I insist on putting myself through this again!?\" Presentation isn't the best..the rolls look like they're about to fall apart, the seaweed is chewy and sometimes the fish too...blugh.  It's in a fun neighborhood though with Fishbowl, Solstice and Lion's Pub a couple of blocks down.", "author": "Tanger T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-01-04", "description": "Good sushi at great prices.  Fun laid-back atmosphere.  Only drawback is there is usually a wait, and not a lot of space inside to lounge.", "author": "Cully W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-04-24", "description": "Went here with my cousin the other night, and we're both sick!  Not anything stomach related or such, just your run of the mill rhino virus.  Still, though it's kinda suspect, ya know.  I didn't think the prices were ridiculously low as our dinner bill came to $40, but the Tiger roll ($5.75) Unagi, crab, salmon, sprouts, tobiko was pretty fresh and tasty.  The California salad ($4) also had crab and a peanut buttery sauce, that got less delectable with each bite.  Try the Yemisu, malt liquor ($5), it was eastern ghetto fab.", "author": "Sam N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-07-01", "description": "Pretty good sushi, great prices.  It's small but they move you through quickly.  Good experience, went on a Thursday night at 7:45 so our timing was probably good.  No complaints.", "author": "Andrea R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-07-14", "description": "Best \"value\" sushi in San Francisco", "author": "Sarah N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-08-26", "description": "I haven't been to Godzila in a while,  but yesterday I tried the lunch special and was surprised by the quality and freshness. I had the spicy tuna donburi-Wow!!!! Usually Japanese food makes me hungry in a few hours, but this dish kept me going for a long time.  Great place to hide out at lunch.", "author": "Sharon C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-20", "description": "I tried Godzilla today for the first time.  Strolled in at about 1:15, lunch rush over, and ordered a bento box to go.  Absolutely perfect. Fast friendly service and easy to read menu. 4pcs of fresh Hamachi, california roll, rice, soup, salad - all terrific and tasty..I will be visiting Godzilla again and again...", "author": "chris b."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-11", "description": "Awesome little sushi spot.  Just moved to the area, always pass this place on the bus and have been dying to try it.  Good thing I finally did!  Completely satisfied the massive craving for sushi that I was having and will definitely be going back on a regular basis.  I ordered take out for lunch; amazing price (lunch prices but their dinner prices are great too) for both quantity and quality!  Ordered the california roll, kamikaze roll with yellow tail, rock n' roll, and the tiger roll.  All were excellent although the kamikaze roll was definitely my favorite.  Not quite sure if this is the place to go for an atmospheric sushi dinner or date night, but it definitely hits the spot for lunch, an easygoing dinner, and any time that you want some delicious sushi for a great price.  Planning on grabbing my lunch from here again tomorrow!", "author": "Nicole S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-08-22", "description": "Pretty good place to sit down and get a few quick sushi rolls.  The decor is pretty goofy, full of cheap Godzilla posters and toys, and it is pretty small, but overall the service was quick and friendly.  I sat at the bar since I did not want to wait for a table (there's usually a line past 7pm), so I ordered straight to the chef, who rolled me up a spicy California and a ginger tuna.  \n\nThe spicy Cali was tasty, although not really that spicy.  The ginger tuna was okay, nothing memorable, and a bit smaller than the other roll.  Overall the rolls were average sized, nothing that is going to blow you away; two rolls will probably satisfy most people.  The specialty rolls seemed to be a bit on the pricey side, and there is a $7.50 order minimum, so grabbing one quick roll is not really an option.", "author": "James S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-09-25", "description": "cheap, good, fresh. what's not to love? well, arriving at the WRONG time on a friday night. that sucks. we came in right after a rush and waited for sooo long for a table for four. my recommendation? come with just a date and say you're willing to sit at the bar. you'll get seated much faster and your server will most likely not forget your miso soup.\n\nin the end, it was still good. they are friendly and i appreciate their $4.50 rolls.", "author": "Joanna F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-01-12", "description": "My sushi cravings got the best of me and I have returned, despite my efforts to boycott.  The sushi is pretty good, the chefs are cool, and I haven't seen that one waitress in a while so I guess I'll just continue to enjoy my maguro kamikaze rolls.", "author": "Krystle S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-04-12", "description": "Not a fan of this place. At all. I thought the selection was mediocre, the service bad, and the food overpriced for the tiny pieces of fish you get in the nigiri and sashimi orders.", "author": "Jenny K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-04-10", "description": "i wouldn't go here on a night that i had a lot of time and money. but if you are with friends and one of you doesn't want pizza, and the other wants to start eating better, and well it's late and you're hungry...  the rolls are ok if you aren't a sushi snob. and i'm a sucker for black sesame ice cream!", "author": "Shirley L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2005-05-23", "description": "Cheap is the key word here ... and just so you know, you aren't the only one clued into this. Everytime I have been here there has been a wait, but do not get discouraged! the line goes fast, ans t's worth the wait. This place doesnt give you tons of fish in their sushi, but it doesnt matter ... it's just enough to fill the void. My favorite is the Spicey California Roll -- simple, yet deadly. Make sure you have a glass of water, or a large Sapporo, nearby.", "author": "Amanda C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-02-01", "description": "Good for a reasonably priced snack when you want some sushi and don't want to make a big deal out of it. Nothing too unusual/interesting. On the other hand, nothing was bad.", "author": "p v."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2005-09-30", "description": "This is a easy, cheap, no-frills sushi restaurant.  They keep the prices low but the quality is great.  A perfect spot to go if you want to grab a quick bite before going out on Divis or Fillmore.  If you want extremely loud music and wasted people running around while you eat sushi, don't go here but if you want good food at a reasonable price, this is a great spot.", "author": "Steven M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-06-20", "description": "Just went there for the first time the other night since it's in the neighborhood. Really fantastic sushi rolls. One of my favorites is their special on the board I think it's called the The Lady Monkey Roll.....its banana's with cream cheese and fish.....incredible! We were lucky to go at a time when it wasn't jam packed. Seating seems to definitely be a problem since this place is always busy.", "author": "K B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-07-02", "description": "nice to be back, its been a long while since we ate here, hub used to live in the area so used to come here all the time......\n\nnice to come in right at 5:30 & not have to wait in line (wanted sushi zone, but didn't want to deal with waiting that day), good alternative to sushi zone if we don't want to wait & be super casual, no scene.......\n\ngood sushi, good service that night, like the godzilla theme & the various sketches of godzilla now on 2 separate frames on the wall\n\nhad the following & all were good\n- spicy mussel appetizer \n- tai (red snapper)\n- suzuki (sea bass) -- hub liked this one\n- walu (hawaiian white fish) -- yumm --rich & tender, hub thought it was oily\n- spicy scallop -- yumm \n- nasu (eggplant) -- nice flavor (love sushi zone's version more)\n- u-nasu roll -- unagi, eggplant, cucumber (or was it avocado) -- yumm -- i love eggplant, works really well with unagi or by itself\n- sake (salmon) & asparagus -- another favorite combination, salmon was so moist & tender........\n\ngreat to be back, won't forget you again......", "author": "Cindi N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-10-09", "description": "Delicious, fresh sushi, and the sushi bartenders are really cool and friendly!  Only downside is that it can get pricey.  I got a couple rolls for take out one time and it ended up being like 25 bucks...not necessarily a cheap dinner.  The service is so-so, it can get really busy as there's not many tables in there and it's quite a popular spot later in the week.  Major plus is they always change up the mochi options with flavors that are hard to resist (blueberry, chocolate raspberry cheesecake, etc....)", "author": "Michelle L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-12-03", "description": "godzila is what it is . . . cheap and good. they don't have a lot of fancy stuff, and what they do try can be hit or miss. they are up front about using crab stick, which i admire, and they don't have appetizers or bento boxes or anything like that. its sushi, sashimi, and the occasional special. no problem for me!\n\nwe like the pink dragon and the kamikaze rolls. the sashimi combo is a good deal and they are often kind enough to substitute things we dont like. i also love the decor and the friendly sushi chefs.\n\ngo early or wait for one of 5 tables.", "author": "shaine h."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-02-06", "description": "Like everyone else is saying; good sushi for the price.  Don't go here expecting to have the best sushi of your life.", "author": "Janet L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-05-16", "description": "One of my favorite sushi places in the city. There is a limited selection of sushi choices, but the sushi is always really delicious and never off-kilter. \n\nThey play rock music and have lots of posters of the Godzilla movies up. my kind of place! Try the lazy monkey roll! It may sound weird, but it is frickin' delicious: cream cheese, banana, cucumber, and avocado. Thinking about it just makes me happy.\n\nAnd it's not too expensive in comparison to other sushi restaurants I like. Also, please try the black sesame ice cream, it's to die for :)", "author": "Ronnie B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-10-28", "description": "I had always heard good things about this place and last night I had a chance to try it out. A very simple decor with not much happening except their posters of Godzilla movies and a small color t.v. which had the World Series on it. We sat at the bar which had stools that weren't exactly new or level. I spend part of my time there having to slide back into position to sit straight...kind of a drag. However, the food was pretty good and very reasonably priced. I would go back if I could get a table next time but definately not my favorite sushi in SF.", "author": "Gabriel R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-01-11", "description": "Godzilla rocks. Reasonable price, great fresh sushi 90% of the time. It DOES get crowded in here. This place is authentic, Japanese owned, and used to be my favorite place to satisfy my sushi cravings,especially since I lived right down the street.", "author": "Anderson L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-11-03", "description": "After work dinner. Great sushi. Gets packed most of the time. Especially weekends. Godzilla roll is a favorite of mine. Too bad no teriyaki items.. =(", "author": "Juliane N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2005-04-14", "description": "Creative sushi at great low prices. Usually a wait but if you hit up the counter you might be able to sit faster. Service friendly and nice. No reservations, you put your name on the list.", "author": "Alyssa C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2005-08-25", "description": "2 stars only because it is one of the most affordable sushi joints in town.  Their sushi is decent at best, but this place is always crowded so don't expect to be getting a table right away.", "author": "Robert R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-02-10", "description": "Godzilla Sushi is a \"straight-to-the point' type of sushi joint. No reservations, walk-ins only and sign your name on the clipboard hanging to your right. Lines are especially long at this small place on weekends and during happy hour. But I give four stars for the good times I've had there with friends over some tasty sushi and sake! Good company always helps when the decor and service isn't great.", "author": "Anne E."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2006-03-19", "description": "with j-town so close by... why would you want to eat at this place? the wait is too long. the food is not comparable to that of j-town's and the portion is small.\n\nmy advice: go somewhere else\n\npersonal fave: errr... i'd have to think long and hard on this one... i can usually come up with something... something...", "author": "Mei N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-08-03", "description": "Went here for dinner. The prices were a little high. The decor was really lacking. We got in there just before closed. I thought it was odd that a spicy tuna roll was the most expensive 'regular' roll. I had to order it to find out. It was 4 pieces but large. The roll was pretty good. We also had the a spicy California roll and a special roll which I don't remember the name, but it had salmon on the outside. The food was pretty good, but pretty pricey. May go here again. After all, it is Zagat rated.", "author": "Andrew Y."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2005-12-09", "description": "I went here once.  The fish was of average quality and the price is high for  average quality fish.  In SF, you can do far better and for less money.", "author": "Eric X."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-01-22", "description": "Does anyone care about price? Seems like nobody includes prices in their reviews anymore. Well, this place was reasonably priced and the quality was a smidgen above ave. The appeal here is clearly the green monster ambiance.Small restaurant. Limited space.", "author": "Peter N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-03-26", "description": "Nice low key neighborhood sushi spot with good prices. Their special selection is lacking but they have several special rolls. I would consider this place similar to a good table wine rather than an expensive bottle.", "author": "Deepak J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-02-27", "description": "it's actually 3.5 stars... i don't want to knock this place too badly, since it's not like they're aspiring to be the best quality sushi place in the world. it's great for creative rolls that managed to be packed with 10 different ingredients that taste delicious together. americanized rolls, basically, but regardless, still good. and so big, i could barely put the whole piece in my mouth in one go. however, the sashimi was pretty subpar. it wasn't godawful or not fresh, but the fish was just not high quality or cut that well. on the other hand, for the price, i wasn't expecting that much.\n\ni would probably come here again for their rolls, but not their sashimi, since i'm willing to pay more for good sashimi.", "author": "Jessica W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-04-30", "description": "I've passed this place for years and always wanted to come here. I finally had the opportunity and can honestly say I wasn't disappointed. The grade of sushi was definitely better some places I frequented as well as the sashimi, so I can't complain about that. one thing is the price and portions. One roll was about $6-$10 average and it only came with 4 at the most 6 pieces. The portions were of decent size so I guess that made up for it. Sashimi was real good as well and I'd say it was priced fairly. Overall, I had a nice experience, and enjoyed my food.", "author": "Rommel N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-01-01", "description": "Ok I know that this place is cheap. And for what you get, its fine. Definitely not objectionable (in terms of food). Its usually packed and if you are in a no frills mood, it works. However, prices are comparable to Wayo Sushi on Van Ness (which is way more authentic feeling and just as good).", "author": "Jenica M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-03-04", "description": "Godzila's major drawbacks are a crowded entrance and sometimes long waits during the dinner rush. However, I attribute these drawbacks to Godzila's overwhelming popularity. They simply do not have the space to accomodate the amount of people that want to eat here. Why is this? Awesome value. The rolls here are some of the best in the city. All prices including drinks are surprisingly low. Yum.", "author": "insipidphishie P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-03-20", "description": "Godzila is a great neighborhood spot with cheap sushi and a few pretty special items.  I think it's pretty serious value for the money.  The Lazy Monkey roll, while containing so many non-fish items as to barely qualify as sushi (banana, cream cheese, avocado, etc...), is also scrumptious.  It's sushi comfort food.  The service is brusque, but it's part of the character of the joint, and we've now come to view our scowly servers with a skewed sort of affection.  Also, great spicy scallop!  Often a wait, so better to go early or late.", "author": "Jes H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-03-28", "description": "Godzila has had a place in my heart for the past 6+ years cuz it was the only place i could afford to eat sushi when i first moved to SF.  The quality has always been good to great with me leaving completely satisfied every time.  Recently, however, this place has gone TOP NOTCH on quality and selection.  They have a new sushi chef who I've followed for a couple of years that simply RULES!  Luca has really taken Godzila to the next level.  I love coming in and sitting in front of him and not ordering anything.  I'm just given the most amazing succession of fish and rare items all to my palate's delight.  Thank you!  Go now!", "author": "Chard M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-12-29", "description": "The best in SF. Don't even think about going their if you have more than 4 people in your party. The place is pretty small & only has a sushi bar plus 4-5 tables. On Fri & Sat nights the wait can be long....but so worth it.", "author": "Sarah M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-01-08", "description": "Not bad. It's very small and crowded, and the music is sometimes louder than the conversation so that one has to shout and crane one's ear. However, the sushi rolls are cheap and good for the price.", "author": "Faye S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-06-01", "description": "Godzilla Sushi is not bad.   Sure the service can be crap, and the portions are somewhat small but the sushi is fresh and passable for sushi.  I also enjoy the mochi for dessert.", "author": "Josh K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-11-29", "description": "As I wondered in on a freezing Saturday night w/ my bffe, we found this wee neighborhood gem.  We got a seat at the bar the minute we walked in.  Everything that we ordered was Delicious, the fish neck, which I know sounds heinous was succulent and delicious.  The only draw back is that the bar chairs are not comfortable and you slide out.  Also the ginger roll was a bit on the over powering as  you really were not able to taste the fish.  Yet I will go back anytime.", "author": "Nicole F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-06-15", "description": "Tucked away at the border of Pac Heights and Western Addition lies one of my favorite Japanese restaurants in the City. The sushi rolls definitely reflect the name of the restaurant, as they are humongous! And for the price and quality of the fish, one cannot go wrong with this place!", "author": "Sandy Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-01-10", "description": "Great casual sushi spot for some grubby rolls.  If you are a sushi traditionalist this isn't for you.  It's cheap, the beer is cold and the music is loud.  Tinky winky is my favorite and I love the spicy california with sriracha on top.  Yummm.  I really could eat at this place every night...in fact I almost do.", "author": "Em S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2006-05-31", "description": "I wasn't expecting much from this place, but the service alone will definitely will stop me from going back. The food was OK but I will certainly not go running back. My #1 pro...they gave each of us a pen when signing out our cards.", "author": "Lisa K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-06-20", "description": "Love this place! I've been going steadily for 8 years. I've never been disappointed. the only problem is that I'm not the only one who loves this small, fun, and GOOD sushi place. i don't bother to go on weekends unless it's super early b/c the lines are long. the sushi is fresh and tasty, the rolls are inventive, but not overbearing. and the prices are so reasonable!", "author": "Parisa M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-12-22", "description": "Walked in around 8 or so on a Friday and got seated immediately.  Our sushi made it to the table before our edamame, which was great, but I'm not sure I really liked the spicy tuna roll - the flavor of the lettuce kinda was a bit much and there didn't seem to be much taste from the tuna/mayo mix.  The dragon roll was really good though!  On another note, if you are picky about salad dressing, definitely ask for it on the side, because it was like soup with a side of lettuce.", "author": "Leslie U."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-01-16", "description": "When I am in the 'city' I always try to eat here. Great sushi, great prices...just a little too crowded sometimes but no big deal. Damn, I wish I was  there right now.", "author": "M. M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-03-17", "description": "This  was very cool, hole in the wall, hip place. You can totally feel the Godzilla theme and the spicy tuna roll was amazing. Not too pricey great place to catch a quick lunch.", "author": "Marcus M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2005-05-25", "description": "Godzilla sushi is nothing special, but the makizushi comes with a such a low price tag that it gets a reccommendation from me.  Just think sushi rolls from a grocery store in Tokyo, and you got Godzilla sushi.  I have yet to figure out why there is a line sometimes.", "author": "matthew w."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2005-08-05", "description": "A good, relaxed place that was made better by great company. It seemed a popular choice for a thursday, and we waited for a while before taking a place at the sushi bar. With only a few tables, you will feel slightly crowded... As for the food - It was good, but not great... the type of sushi bar that can be a local place, but not a fancy date place. The spider roll was normal, the dragon was quite good with bbq'ed eel that was nice and light. However the spicy CA roll was a bummer. The crazy monkey roll, with banana, was interesting but I am not sure banana and sushi go together for me. Find out for yourself. All in all, I will come back for a during the week dinner...", "author": "Mitchell W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-01-03", "description": "I think the sushi here is great, and to some music I like. Service is a little scattered at times and this contributes to the experience. Some Sushi chefs you find seem really boring to watch, as if they don't enjoy what they're doing... but these guys have passion that shows.", "author": "Kevin D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-01-31", "description": "This is one of the easiest and best-valued sushi restaurants in the city.  No Ebisu-like lines, and the prices are reasonable ($3.85 for a typical Nigiri pair).  The service is good, the chefs are very professional, and I just love all of the sushi.  I've never had a bad/smelly/grissled piece.  For a while during the dot com boom the pieces got small.  Now they seem to be back to normal size, though not large (if that helps you any).\n\nIt's very no frills, but I like the artwork of Godzila by the patrons.  Warning: small TV is usually on which I think dampens the atmosphere.", "author": "Frank C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2007-11-26", "description": "The first time I came to Godzila sushi the wait was long, the staff was unfriendly,   the food was ok. I was stupid enough to go back and experienced the same thing except this time I got painfully ill from food poisoning and couldn't even work the next day. I'm forever disgusted from this restaurant.", "author": "SHARON T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-04-28", "description": "Great sushi for an awesome price!  A little hole in the wall, but my husband and I have been coming here for years.  The sushi never disappoints, and worth the wait.  No frou-frou sushi, just good and to the point!", "author": "Marie F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-07-22", "description": "atmosphere was cool - pretty chill. Took a while to get served - when the sushi arrived it wasn't very impressive. Howeeever - there was a lot of it and it was very reasonably priced. The only reason it's only getting three stars is because in a town with so much good sushi - even having pretty cheap prices can't save it - especially when you can get happy hour rolls at tokyo go go for $3 a pop.", "author": "Sung P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-08-16", "description": "The ambience is ummm... well... lacking.  BUT, you can't beat this place for the price.  Seriously, the best  green salad in town and the mango mochi is super yummy!", "author": "Alexia J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-02-11", "description": "Great sushi. Fresh, substantial, authentic. I had such a good meal here. The prices are so reasonable and the staff is friendly, it is a really simple restaurant with nothing more than Godzila posters on the walls, which is why I like it so much. Came here with 3 other friends for sushi and sake and can't wait to come back! I had 2 rolls, 1 large saporo and a few shots of sake and payed $24 including tip, an amazing deal.", "author": "Laura Gardner S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-10-18", "description": "it's so good, because it's so close to my place.\n\nthey have some roll with a really weird name - tinky winky, maybe? but it's got unagi and nasu (eel and japanese eggplant).\n\ndelicious.", "author": "dave w."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-12-02", "description": "Fresh fish, delicious innovative rolls at a reasonable price is what this place is about.  Very few tables so get here early or prepare to wait.  The decor could qualify as a 'dive' but I find the ambiance very comfortable.", "author": "John P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-11-17", "description": "Great place, cheap and yummy sushi, they are a bit small so expect a bit of a wait. It's worth it though. Some of my favorites are the tinkie winkie roll and the godzila roll. It doesn't have entrees or bento boxes mostly sushi rolls, nigiri and sashimi. Great place to start out a night on the town.", "author": "Olga P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-11-04", "description": "I have been going here for years.  In fact, I first tried this place back in '94.\n\nThe California salad with crab has to be one of the best tasting salad dressings I have ever had.  So good....\n\nWe had a dragon roll (so so), Tinky Winky which was good, the Philly roll which was good and some inari.\n\nThe total bill was $35.", "author": "Brian L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-03-02", "description": "My favorite place to go for toro (fatty tuna) and does not dissapoint (well, of course its disappointing when they don't have any toro, but hey, not many places get it!) Good fish counts more in my book than other criteria, ya know what I mean? Plus it's fun to look at all the customer-created napkin art with drawings of Gzilla.", "author": "Michael W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-02-03", "description": "Cheap, fresh and delicious sushi. Couldn't ask for anything more. When we were there for a Friday night dinner, some live Aerosmith album was cranked, which provided a bizarre and amusing contrast to the food. With the cheesy mural of godzilla on the wall, it was all somehow oddly appropriate...", "author": "Colin B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-03-27", "description": "Low priced sushi in a bare bones atmosphere. If you want cheap sushi and will eat anything, this is your place.\n\nMy dining partner had a nigiri sampler and a roll prominiently featuring tobiko and in all honesty he was very happy. I expect that he would be ready to return any day of the week. I had avocado maki and a garden roll, which are some of the very slim pickings offered to the vegetarians. My attempt to pass on the seafood was a waste of time because my food was liberally sprinkled with tobiko. I would guess that this bonus was a result of the preparer not adequately cleaning his hands or prep surface after making my companion's food. The seaweed on my avocado maki was so tough that I had to pull on the roll while biting down to cut through it. The decor and ambience reminded me of Escape from New York Pizza on Haight. It was dimly lit with overhead fluorescent bulbs and a TV propped up in the corner tuned to an NBA game. And the service: I think I may have been piloting Wonder Woman's plane through the restaurant because I was invisible. It's a mile away but I would rather go to Nagano. Same prices, better everything.", "author": "Bovis P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-04-05", "description": "I think people come here more to drink than eat. Their sushi isn't that good. I had a spider roll and some sashimi. Spider roll wasn't even crunchy and sashimi was just ok.  \n\nThe only think I like about this joint, they got the white man fooled thinking the miedicore stuff they serve is great. Hats off to you...Its always great when a fellow minority decieves the wide eye. BTW neone who says this joint is cheap has $ to waste. price/value sux.", "author": "ant m."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2007-09-03", "description": "I give it one star for the price. Otherwise this place is just a train wreck. The sushi is not good. They usually put gobs of mayonnaise in most of the rolls. I have been there 3 times (it's 4 blocks away from my house) and on every occasion it has taken nearly an hour for the sushi to arrive. Always disappointing, but you cannot beat the price. I have no idea why the sushi chefs are so slow. Hmmm... lack of experience? The moshi is good, but you can get it a few blocks away at Trader Joe's, six pieces to a 3 dollar box.", "author": "Marcia B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-02-22", "description": "Consistently great sushi at a reasonable price. No frills; real Japanese folks making good food. I'm not a big sushi fan and really only like the basics because I'm allergic to shellfish. Sit at the bar early in the week for faster service.", "author": "Christina M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-17", "description": "Godzila is a neighborhood favorite of mine. I live close by and can walk there whenever I am feeling the sushi urge. Unfortunately, I dont feel like there is much variety of food, and the restaurant is usually always busy but if you dont mind a little wait and eating the regulars (which I do!) It is affordable and good size portions.", "author": "Jillian K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-03-25", "description": "Cheap and deleeecious. Some friends and I stumbled in here because there was a parking spot outside and we were starving. We didn't expect much b/c of the funky decor and extremely low prices, but we were proven wrong. It was great. My new go-to sushi for the norwestern part of the City. $70 (inc. tip) for 6 specialty rolls, 2 nigiri, 3 misos, and a lg. Asahi - can't beat that!", "author": "Caitlin M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-01-01", "description": "Had such a great experience last night that I created an account just so I could give a review.\n\nAnyhoo, wanted to get a quick bite, make sure there was food on the stomach before downing lots of alcohol, on the way over to the ALO show at the Independent.  Drove around the neighborhood and spotted this little hole-in-the-wall lookin' sushi joint.  Since it was one of few places open we said, \"let's go here!\"\n\nIt was perfect.  Immediately sat at the bar and perused the menu.  The rolls all sounded yummy.  Started with an order of seaweed salad which was very fresh tasting.  Had sake and unagi and the rainbow roll.  The unagi was probably the freshest I have ever had.  Very tasty.  I love unagi and judge sushi places based on their unagi (Hear that Ace Wasabi's?  You need to step it up!).\n\nAlso tried some funky named roll with the word monkey in it that had unagi, avocado, banana(!) and cream cheese.  It Worked!  Yummy, yummy stuff.  Not traditional but so what.  Fun.\n\nGot out of there in a good amount of time while barely making a dent in the pocket book.  Had a great food base on and we were ready to party.  What an awesome way to start the night!\n\nCan't wait to go back with a bigger appetite so I can try lots More!!!!", "author": "Kitty G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-05-13", "description": "Terrible, infuriating service.  I tried to order a sashimi combo which is supposed to come with rice and miso soup, simply without the rice, substitute some iceberg lettuce.  Absolutely would not just give me a side salad even if I paid extra for it.  Does that make any sense to anyone?\n\nWe debated this point for about two minutes to which I finally conceeded and just said, okay, fine, give me the miso and the fish and no rice.  Charge me the same.\n\nJust got home and I've got a container of rice, no soup.  Seriously.  Give me a break.", "author": "Nicole H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-02-24", "description": "Godzila does give you a really good sushi experience for the price. I can say I would be willing to pay a little more for the sushi here. All the sushi is really fresh and tasty. I can eat a lot here and not have to spend a lot. Listen, I have eaten at Nobu in NY and Morimoto's in Philadelphia, so I know good sushi. Godzila is not in that class, but price adjusted, it's pretty good. It also has a fun, funky atmosphere with rock music blaring in the background. Nice, young crowd.", "author": "Greg A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-06-21", "description": "We went here for the first time last night, and although the sushi was pretty good, we had a bad experience with one of the servers.  After eating a huge plate of sushi, we decided to order the \"Pink Dragon\" roll.  Apparently, the server must have misheard us and brought us a regular \"Dragon\" roll, which has shrimp tempura in it.  We took one bite of the Dragon roll and realized she'd brought us the wrong roll, so we called her over and nicely explained we ordered the Pink Dragon, not the Dragon.  (I generally don't like anything fried in my sushi, and the Dragon roll was not good).  She takes the plate and leaves.  A few minutes later, another server comes over and rudely tells us that we've already eaten a bite of the Dragon roll and that she will put in an order for the Pink Dragon, but that we will have to pay for the Dragon role.  Um, what?  We explained to her that we didn't order it and didn't realize it was the wrong roll until after we took a bite.  She got really huffy and rude with us.  My husband was very nice and told her the server obviously misheard us, and that we didn't order it.  She still demanded we pay.  It was their mistake, and she wanted us to pay?  Ultimately, after some discussion, she took it off our receipt, but it was just an unpleasant experience and she was quite rude and unapologetic about the entire thing.  I've been a server and the rule typically is that if a server messes up your order, they either take it off your bill or replace it with the correct order.  The other rolls were pretty good, but I won't be going back to this place.", "author": "mazzy r."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-10-17", "description": "A case of mistaken identity gone horribly right!  Indulge me for a story.  When I was in San Francisco about 4 years ago (yikes) with my ex (also yikes) we went to this fabulous sushi place where I had, at least from what I remember, the best sushi of my life.  And I all I could remember about the place was a really fun vibe and a huge picture of Godzila on the wall.  So last weekend, when I left the loving bosom of the Yelp Team to fend for myself, I tried, with the help of a good friend, to recreate my amazing sushi experience.  I searched for Godzila and Sushi and lo and behold I found...Godzila Sushi (see Russ, it's OK to find things in Search that are the name of what you typed in!).  So in I went only to discover that this was absolutely not the place I ate 4 years ago - I think it was Monster Sushi.  But Godzila was great and it gave me some great SF sushi and new place to Yelp. Try the Pink Dragon Roll.", "author": "Sam P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2007-01-12", "description": "This joint has some serious roll masters and my hat goes off to them.  The service however totally SUCKED!   This is a to-go place for sure.  We had a party of 6 with the potential of 8 and the tables they have only seat four.  So they squeezed us all on to a four sided table.  They said there was no room and they need to keep tables open for future patrons.  There were two empty tables in  the front of the place and by the end of the meal there was only one other party there.  It was not until then we said that we were expecting two more people that they were willing to put two tables together for us.  Our friends end up lagging and we finished eating before they got there and we were lectured that we should have really kept to a four seated table if there were 6 of us.  Our friends really were in route though!  I understand if the place is packed but it was around 9:15 pm on a wed when we rolled in there.  I can't and won't bring myself to go back there- they don't deserve the business.", "author": "Erin S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-05-26", "description": "a neighborhood sushi place where the sushi is fresh and the music is great. i cant say this is my favorite place but whenever i have that sushi crave its the place to go. i love the loud rock music they play and the sushi chef is hilarious. definitely good rolls and the chirashi isnt so bad either. peanut sauce salad is amazing. it can get pretty busy here but i usually never have to wait long. sure, godzilla isnt my first place to go but it definitely is good enough to recommend.", "author": "jane l."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-02-29", "description": "I've heard a great deal about Godzila and have always noticed that they had quite a crowd of people whenever I'd drive by so I was really excited to try it out.  I finally visited Godzilla with my brother and am now stumped as to why so many people go there.  We ordered the usual sushi items; miso soup, spicy tuna roll, spider roll, and we tried the godzilla roll.  The sushi came really quick with the speedy mastah chefs.  I tried the spicy tuna first and it tasted bland and it wasn't spicy.  Also, one end of the spider roll didn't even have any crab in it, just avocado.  I was feeling a little bummed about the sushi already.  My brother ordered two more nigiri orders because a lot of reviews say that the fish is fresh but he didn't even want to touch the salmon and hamachi nigiri.  They didn't look fresh and he said it tasted bland.  Overall, I don't think I would come here again.  The prices are really cheap but I would pay a few more bucks at Ebisu or Blowfish to get my sushi fix.", "author": "LittleBird 8."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-07-13", "description": "godzila is definitely among my favorite sushi places in SF.  i like the relaxed, casual atmosphere, although becuase they don't take reservations, be prepared to wait on a busy night.  i swear they could fit more tables in there!  sitting at the sushi bar is great too - i like to ask the sushi chefs about their favorites.  spicy tuna is a must - one of their best rolls.  they always have great special rolls too.  i also think their sashimi is among the freshest.  most recently i had the dragon roll, the spicy tuna, and the mixed sashimi.  they also have delicious mochi!!  my sushi dinner is NOT complete without mochi!", "author": "Carolyn B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-10-13", "description": "I'm really confused as to why this place gets anything over 2 stars. I came with a very optimistic outlook, considering all the reviews. The spicy tuna roll literally made my throat turn. When there are so many great sushi restaurants (Blowfish, Sushi Groove, etc.) I can't imagine why anyone would visit here twice.", "author": "shannon a."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-29", "description": "very good sushi!  this place is close to my house but for some reason it took us 4 years to visit.  now we're hooked.  friendly service, even when packed during dinner time.  not many vegetarian selections but what they have is wonderful.  topping the list is the nasu, or japanese eggplant.  adorable and so delicious.  and my husband loved their non-veg roll selection.  pretty cheap too!  we had sake, 5 rolls and edamame for less than $30.  only thing that could make it better would be if the miso was vegetarian--it bothers me that fish powder is always added to ruin a perfectly good miso soup.", "author": "kate s."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-01-04", "description": "The service is truly AWFUL - slow and impolite. The waiters must spend time working at being rude and inattentive. Clearly, people eat here (including me) because it's one of the only sushi restaurants on Divisadero. It you want average fish with attitude, I highly recommend Godzila. If you can venture a bit further, I would try Tataki on California - great fish and service.", "author": "Tamara B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-05-04", "description": "it's not the best fish i've ever had nor is it the most authentic sushi bar i've ever been to. it's not decorated fancy and it's not one of these wild-n-crazy, rowdy places. but how i wish this is in my neighborhood!  this is a good place to go when you're just craving some decent raw fish but don't feel like emptying out your bank account.", "author": "Angi C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-11-26", "description": "Love the ambiance. Its uniquely tacky, yet super cool, with a huge Godzilla Motif on the wall, along with other forms of Godzilla art, that adorn the walls. I happened to stumble by Godzila on my way to Tortilla Heights. TH was about to close down, so my friends and i decided to go across to Godzilla. Getting down to the food, the menu is pretty limited. They only serve Sushi/Sashimi/Rolls and have an even tinier selection for vegetarians. I was disappointed at first, but we stuck around nonetheless. We ordered the Dragon roll, Garden roll, Philly Roll, Cucumber and Pickled Radish roll. I was pleasantly surprised by how good the food was. I usually hate Japanese food, but the sushi was flippin insane! The ingredients were fresh and the service was pretty quick. Maybe because it was a Monday night and we walked in around 9:30 pm. Anyhoo, i know there are better sushi places out there, but for the price, the food is really good and you get to hear some awesome Classic Rock!...Oh, and their plum wine is decent as well, give it try will ya.", "author": "Tushar V."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-03-22", "description": "Pretty solid sushi place, but it didn't get me too excited.  Everything was very fresh as it should be, and the Sashimi was good.  I forget what it was called, but we had a roll with banana in it that was surprisingly good.  The atmosphere is about par for the course for sushi.", "author": "Luke P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2005-12-01", "description": "i heart godzilla!! seriously. and it's conveniently located in my neighborhood. their rolls are yummy...and at a decent price. you might have to wait a bit though since it's a tiny place. it's always crowded so watch out!", "author": "Beth W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2005-04-14", "description": "I've already complained about the lack of quality sushi in SF (compared to sushi in LA), but I'm not quite done. Godzilla Sushi ranks at the bottom of my list of SF sushi restaurants. Godzilla, which has been around for 30 years, attracts the young, the trendy, and the not-so-sushi-savvy.     The good news is that if you're strictly in the mood for rolls, Godzilla has some good things to offer. My absolutely favorite was an eel and Japanese eggplant roll. The combination of the eel and eggplant elicited appreciative sighs from me with every bite. Second best was the mackerel sushi, which was surprising since all the other nigiri I had was terrible. See, I have a thing about stringy sushi: it indicates sub-par fish as well as a sub-par sushi chef. Imagine my disappointment when I discovered that both pieces of my toro (fatty tuna) contained hard-to-bite-through strings. Gross. I hardly understand why I didn't stick with rolls but continued to order risky bites such as amaebi (sweet shrimp), which the chef insisted was delicious but in reality was quite forgettable.  Read more on The Ballyhoo: http://www.ballyhoo.us/restaurants/review.cfm?review=20", "author": "Baochi N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-05-04", "description": "decent...nice and local but I wouldn't suggest a long commute for this spot.", "author": "Andrew T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-08-12", "description": "oh my god i am so addicted to godzilla! the fish are so fresh and fatty (which i looooove). the service staff is friendly. it's a great neighborhood restaurant. i love its godzilla decor. my favoriate at godzilla is its twinkie winkie role & the kamakazi hamachi roll. and i recently got hooked on the ginger and white tuna roll, surprisingly good combination. but pretty much everything is really yummy. hands down one of my sushi places ever (and i am fairly picky!). but i do need to warn you, it gets really really really crowded at night. i would recommend going early.", "author": "Cindy L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-12-23", "description": "good sushi, good price. we came on a sunday night at 8pm and the restaurant was decently busy but we didn't have to wait for a table. all of our food was tasty and the noise level afforded good conversation. the best part was the very reasonably priced bill.", "author": "lisa w."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-06-15", "description": "Good cheap sushi. But is small and tends to be crowded. Be prepared for a short wait if you go at peak dinner time.", "author": "Will C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-12-14", "description": "I used to live in the area and would walk down here quite a bit.  You might look at this place and think \"hole in the wall,\" but as they say, looks can be deceiving.  The sushi choices are creative and everything seems fresh.  This is also the first place I've had a roll with banana (weird, I know) in it and I thought it was great!  You get a lot for your money here as well.  Gets crowded so get there early or sit at the bar if there are seats.", "author": "Glen E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2005-02-17", "description": "Godzilla serves fresh sushi and is a great value given the extremely reasonable prices.  You can end the dinner with a yummy mochi icecream too.", "author": "Barbara K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-06-11", "description": "Good sushi especially considering the prices! I have been going here for years and they still deliver decent rolls and nice service. This is a great place for a quick, yummy, cheap night of Sushi!", "author": "CC C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-08-13", "description": "good sushi - service has always been brutal. They never answer their phone so take-out is tough", "author": "roger m."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-08-25", "description": "decent sushi, mellow atmosphere, easy. good neighborhood place.", "author": "Michael C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-11-28", "description": "pretty good sushi.  but the real question is, how can i get some of my godzilla artwork up on the walls?  i drew some sketches on my napkin with my soy sauce, but somehow i don't think they're going to put it up.  even threw down some wasabi green scales.   maybe i'll increase their stars if they put my pictures up.  or send me free sushi.  that'll do it...", "author": "Margie N."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-04-09", "description": "I really wanted to give it a one star since I have been there a few times, but I did not want to lose credibility as a first time poster (but long time listener)...the sushi is ok (thus the second star) but average.  The most recent visit spurred me to write in though--each time I go for takeout, one needs to ask permission, for if they are too busy, you will be shunned.  Well, this time, it was not too crowded, so I ordered takeout for my wife and I.  The bill was $45 but I knew it would be a long wait for the sushi, so I figured I would order a $5 glass of  Sake while I waited.  So, by the time the sushi came, I got a new bill that had the sake plus gratuity on the whole takeout order added.  When I asked why, they said that takeout over $50 is subject to gratuity--WHAT??? My order was only $45 but  the bill came to $60 due to having a drink at the bar (standing up, mind you) while waiting...that is JV and not what one should do in this economy.  I do normally tip on takeout and support local businessess but this was fleecing.   Oh, and the sushi was average again.  I am a small business owner and really hope that the owner lets the staff know that this is not acceptable.  I paid the full bill plus tip, but felt the need to write the review since it really seemed unfair.  Good service begets good reviews.  I know you can do better.", "author": "Ty G."}
