{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-05", "description": "Excellent service. Great staff. Great food. Beautiful location. Interior design is fun.", "author": "Rob L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-10-21", "description": "Got fliers from this place in at least 2 different names. I remember getting for the longest while for Golden Wok and now the fliers changed the color and the name to China Delight. Like before there is no difference in price of anything else.\n\nI just don't know how people can order from a place where they don't know where their food was coming from. \n\nI came here once when I was working at Ocean View Library down the block. After looking at what it looked like inside over 5 years ago, I walked right back out.", "author": "M C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-10-14", "description": "Absolutely repulsive. The orange mock chicken was dirt dry + the sauce tasted like a Tang/Sunny D reduction. Do not eat here.", "author": "Adrian D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-10-10", "description": "NASTY FOOD - RUDE BAD SERVICE - DON'T TAKE A CHANCE WITH THIS.  Flyer left on my gate with a different name, thought I would try and give it a chance. Part of my food was not delivered and the food that was delivered was horrible. Ordered the green onion beef and 75% of it was onion. I called to tell them about the missing items and the dish that had hardly any meet. The man that answered the phone was very rude with me and said he had a customer and he couldn't waste time taking to me. There is no excuse for this poor customer service or the horrible quality food. Pure disgusting. Will not ever go to this establishment again and neither should you", "author": "Ronette B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-10-03", "description": "Absolutely awful experience. Found a giant caterpillar in my food. The food did not taste good either. One of the worst Asian food experiences I've had.", "author": "Tiffany D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-04", "description": "I don't know why they have bad reviews here. I ordered for delivery and I had good experience with them. The food was much better than I expected. Thank you!", "author": "Benz S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-01", "description": "Really good Chinese food, and fast delivery. Called me to clarify questions, and I like communication instead of assumptions.", "author": "Gabrielle R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-11-11", "description": "ZERO STARS!!!! I i typically come to my own average based on other reviews, but believe the reviews here. Where do i start?!? \nCUSTOMER SERVICE?WHAT!! \n1) took over an hour to get our delivery that was placed at  1am. We definitely beat the nightlife crowd, and this was way past dinner, so why?! \n2) they have our food to the wrong people at the hotel. They didn't even bother coming in the lobby either. So, there goes my husband to the curb at 1AM!!! \n\nTHE FOOD \n1) they put eggs in my fried rice that i asked to not be included. And yes. It looks just like the picture, spotty and missing soy sauce much?! \n2) the orange chicken my husband ordered had a foul taste. I hope he doesn't get sick. He had a face he's never had while eating because the guy seriously loves eating. And who doesn't after a night of drinking. \n3) same foul taste in the egg rolls. Just don't!! \n\nAll in All, $40 I'll never get back. For a big city, late night delivery shouldn't be so hard. NYC has SF beat on this one!!! ZERO STARS & two thumbs WAY DOWN!", "author": "Deia S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-01-05", "description": "I keep getting menus from them but each time it's a different name - super sketchy. And there's never an address. What business operates using different names?", "author": "Jocelyn Zada C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-23", "description": "I ordered here, like two weeks ago. It was like 9pm in the night. But food was delicious. I loved the chowmein, and te Mongolian beef. Definitely recommend.", "author": "Cecilia G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-16", "description": "Do NOT order from here due to sanitary reasons.\n\nI found an one, whole fly at the bottom of the soup under the all Wonton. That's one fly too many. Delivery time was not a problem for me unlike what many other customers had experienced.\n\nDo not order from here if you read this review. Spend your money elsewhere.", "author": "Keefe T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-07-02", "description": "This place does business as China Delights and Golden Wok. Very suspicious business practice. Open late for delivery business. Beware. Their delivery time is advertised as 'fast' which can vary widely from over an hour or more wait time. Their menu is not clearly written (over 151 items and no descriptions) insofar as if entrees come with rice or not, for example...making it easy to over order rice as some entrees come with rice.\n\nUnsuspecting late night victims order at your own risk. Food is one note, under spiced and oily. Not high quality. Bad and not recommended. 7-Eleven food is more satisfying if you're that desperate. Or open a can of soup - it's cheaper and better. Morning will come soon enough then you can go out for breakfast. THAT'S where you should spend your money!", "author": "Van D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-03-06", "description": "If I could give negative stars, I would. \n\nThese people do delivery business as China Delights and they are terrible, terrible people. Here are the facts:\n\n1. I placed an order with them through GrubHub - expected delivery is 45 minutes to an hour.\n2. An hour passes and the GrubHub indicator shows that they haven't even dispatched the food. \n3. I call the restaurant and they say \"Oh yes, the driver is already on their way, they will just be another 20-25 minutes\" (Obviously they had forgotten my order, but I was a fool and decided to wait.)\n4. I wait another 30 minutes before calling again - and apparently their driver had just decided not to deliver the food because he couldn't make it in 20 minutes. And I had to find this out by calling them. I wonder if they were going to refund me my money if I hadn't?\n\nAnyway, don't order from these people. They're poor excuses for human beings.", "author": "El B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-09-05", "description": "I had hope a small mom and pop Chinese neighborhood restaurant. would be better than this grease trap - But I still gave it a try - I ordered Chicken fried rice - it had little or no taste\nand didn't seem that fresh. It wasn't that underpriced --\n\nI am very disappointed with this venue diner   - The costumer Service was weak and the setting of the dinning room was un clean and not friendly - I think this is a locals only spot - that includes a dinning room with not a restaurant in mind but more like a garage to fix cars or build home items --\n\nA local guy out front was angry at me because I used the small trash can at the small market next door to toss away my napkin. He told me \"Take your garbage with you\"\n\nsounds good - I have no plans to return to this diner and recommend you avoid this place - V", "author": "Vince V."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-04-23", "description": "WARNING!! They have a new menu going around called \"China Delights\"  (also one as Chef Mings ) they are using different menus with different restaurant names to try and lure people into purchasing food. Do not order food! You will get sick and who knows if they're even a legal resturant because they won't let you pick the food up, and won't give you their location either...uh sketchy.", "author": "Moira F."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-10-22", "description": "Beware of the flashlight wielding 40 year old Asian slob who delivers your food and harasses you for tips. \n\nTheir spicy fried rice is amazing paired with the 10 piece fried chicken they offer.", "author": "Alan N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-01-18", "description": "This place seems to have changed its name at least twice in the past two years - surely not a good sign. They spam my neighbourhood's front doors with  paper advertisements about once every two months - hideous and annoying. The flyer says they're called \"China Kitchen\" (same phone number).", "author": "Kayla M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-01-06", "description": "I am giving up on this restaurant because the food quality varies a LOT. Also, if you order a beef dish from Golden Wok, it will arrive almost raw. You have to recook it. I like the delivery till 3:00 a.m., but the individual dishes taste alike! I once ordered potstickers and the wrappers were so thick that they were inedible.\nI've ordered many times, hoping they'd improve, but one of every four items ordered goes in the garbage. This gets to be expensive and discouraging. What a mess.", "author": "Cherry S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-04-07", "description": "If I could give you less than one star I would. I ordered fried rice from you and just got rice, not even well cooked at that. I hope you go out of business", "author": "Antonio S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-11-04", "description": "This place is horrible......I know Chinese food well. I am born and raised in San francisco.bive eaten in at least 70 Chinese restaurants in the city. I am African American but m favorite cuisine is asian food. Anyway this restaurant is the worst quality Chinese food I have ever had.  No lie but I am a hypocrite because when I get home from a long day of work I want to drink a few beers or wine. Then I get hungry and call Golden work when I am wasted because their the only place that delivers. Long story short I wake up the next morning depressed and with diarrhea. As of 11/04/17 I will never order fo\nod from there again. I put that on life", "author": "Shaleek F."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-03-30", "description": "**disclaimer: I ordered past midnight since it was the only place open and still are the food because I didn't want to waste my money. But I did feel sick after eating. Not good at all. \n\nThe food was very oily and just had one flavor throughout the whole meal. \n\nI ordered Peking spareribs, beef chow fun, steam rice and crab cheese wontons. \n\nThe rice was so dry, I was so pissed! Being that I eat rice with everything, it was so disappointing that it was dry and almost inedible. \n\nPeking spareribs were eh. The sauce was good but the meat was so hard to chew on, total turn off. Especially since Peking spareribs are my favorite  \n\nBeef chow had a weird taste to it. Couldn't put my finger on it but the beef looked disgusting and the noodles were all stuck together. \n\nVery sad meal that was put together half assed. At least I didn't get charged for delivery. But still. \n\nNever again. Save your stomach and order something else. Anything else.", "author": "Alaia L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-08-11", "description": "Worst service ever. Ordered delivery. Driver said he was here twice (wasn't) and gave the food to some random person at the wrong address and when we called the restaurant twice they didn't care because they were closing soon. No food for hungry people who ordered, paid, and waited an hour for nothing. That driver should be fired.", "author": "Danielle C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-02", "description": "I ordered some items, they didn't have a duck in stock. They called immediately to let me know. They offered me to pick a different item, I asked if I could refund the whole order. They said yes! And I am now refunded. Wonderful customer service! The woman whom I spoke with was wonderful!", "author": "Stacey T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-06-14", "description": "Only ordered from here because it was open late and still delivering after the bars closed. New to the area and didn't know better. Typically rice comes with entrees, unless New York is the abnormal one? Food was bland, but for drunk food, it did the job. Was also delivered an hour past when they said. Will be looking for a new drunk Chinese take out place.", "author": "Samantha E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-27", "description": "have my food deliver at work place, ordered 4 small party trays.\nHouseSpecial Fried Rice , Salt & Pepper PorkChops,\nPineapple Chicken & BeefBroccoli.\nEverything was delicious \nevrybody loves it.\ndelivery time was a", "author": "Maria R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-08-09", "description": "So I usually eat here but not anymore. My delivery was 30 minutes late and I found a piece of metal in my food. I was told they would give me $5 discount for the tardiness and $5 for the metal. \n\nI am a health care professional and I know that, that piece of metal could have cut my mouth open and I could of had an infection.\n\nIf you want to eat somewhere that tolerates metal being in your food and saying they will only give you a discount, we'll be my guest and enjoy.\n\nThe manager was over talking me as well. He did seem to listen though when I mentioned the health department.", "author": "Jacquis B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-04-15", "description": "I reviewed the reviews and my only request was please don't put bugs in my food. So I asked for the simplest thing ever. Scrammed eggs over rice. They gave me the food from an exit door, fine. Only delivery ok. After doing the transaction in the parking lot, I was still excited to get some eggs and rice. Ummmmmmm yeah... no rice!!!! Just eggs. Ok fine, let's cut out the carbs..... happy no bugs. The only thing they could mess up is the eggs.... shells alllllllllllll in my eggs!!!! Who doesn't know how to crack an egg?!!!!!! Gross just gross!!!! $10 for scrambled eggs with shells , awesome! This place should be shut down!", "author": "Gfunk G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-04-04", "description": "This menu was in my hotel room. I thought it couldn't be that bad. I was so wrong. \n\nTo begin the menu says Golden Wok but is identical to the photos posted. No address listed on the menu. I ordered crab wonton, honey walnut prawns, Singapore noodles and BBQ pork buns. \n\nThe prawns were decent and by far the highlight of the meal. I never got the crab wontons, instead some kind of soup that I never ate. The Singapore noodles were so bland, which is a saving grace, because I decided to not eat them after a few bites. Upon further inspection I found several long black hairs and a few short curly ones. I can't believe I'm even writing this, but I was ready to be sick at that point. \n\nJust awful. Stay away. Also odd, when delivered the delivery man took my receipt. Charged my card under the name China Cafe.", "author": "Kiki M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-09-04", "description": "Ordered takeout and thought the rice was really good. Orange chicken had a weird taste to it, nothing like any orange chicken I've had. Delivery was free so that was cool but the crab wontons were soggy and not crunchy. Was about to give three stars and then I saw other reviews about having cockroaches in their food and I couldn't continue to eat. Never again.", "author": "Ali S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-01-10", "description": "I have never written a yelp review...but Golden Wok really prompted me too...\n \nFirst off..crab wontons are just really all cream cheese and no crab...ok NBD, they still taste ok..However, moving on from there, I found an ant, and hair, in my noodles. Not ok. \n\nI forgave the weird orange candy flavored noodles, but bugs and hair in my food...seriously not ok. \nDon't waste your money, don't order from here. \nAnd, Grubhub, seriously consider your late night delivery options.\n\nReally disappointed with this meal :(", "author": "Reem E."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-02-18", "description": "We stayed at an Airbnb in San Francisco and found a menu for this place. We should have checked Yelp! Golden Wok was terrible. The guy on the phone told us they would deliver our meal in about 45 minutes. An hour and a half later, we called the restaurant to see what the status was. They told us the food was on its way. Finally, fifteen minutes later (and hour and 45 minutes after the order was placed), the delivery driver called us to come on out. That's right, he said he doesn't get out of his car. \n\nThe food was barely warm. It was slimy and lacked flavor. We didn't feel too great after eating it. The cheap plastic forks had hair on it. They gave us two cheap tiny napkins. I don't understand their money-saving ideas here. We ordered three entrees and three sides. Why only two fortune cookies?!\n\nIt's unfortunate that so many people (like us) will find the menu and order without first checking the reviews. If you're lucky enough to have read this before you order dinner, do yourself a favor and eat somewhere else. Anywhere else.", "author": "Koren Y."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-12-03", "description": "OMG!! This place should seriously be shut down. If I could give it a ZERO star rating I truly would.\n\nIf you failed to see the CONSUMER ALERT that states POOR FOOD SAFETY SCORE, like I did cuz I ordered through grubhub, then consider this your HUGE RED FLAG.\n\nHere are the facts:\n* The restaurant delivers\n* Open late\n* Delivery orders are not expected to include rice.\n* They accept Credit cards\n* Delivery driver was 45 min late on top of the 1 hour delivery wait time.\n* Delivery driver dismissed any knowledge of the contents of my order.\n* My order clearly asked for rice - it was not delivered nor was I contacted regarding the request for rice to be an additional charge.\n\nHere are my opinions:\n* Food Quality is undeniably horrible. The meat in the wonton soup had obviously gone bad. A quick bite out of it and i could tell that it wasn't \"fresh\" anymore.\n* Customer service level: Let's put it this way, when i called in & offered a reasonable resolution to my problem (ie. willing to wait an exorbitant amount of time *3 hours* for my dinner for the promise of rice, that was NOT included) the girl on the phone accepted that offer & countered it with an additional $3 charge.\n\nhere's the long & short version of the story:\nI work graveyard & my co-workers and I have been to this place before so i figured it was a safe bet. \nStandard order & apparently it my fault for \"ass\"uming that a side of white rice would come with the entrees, however I did put a comment on the online order that would have triggered some kind of action. \nPlaced order at 10:30pm\nQuoted delivery time: 11:35pm - 11:45pm.\nWaited until 11:55pm to call - it rang multiple times then rerounted to a fax called again at 12:02am - went through this process & was told that \"it's on it's way\"\n\n12:30am THE DELIVERY SHOWS UP. NO RICE, SOUP was spilled.\nIn my attempt to give this place the benefit of the doubt I called up the restaurant & of course I got just as bad attitude, attempting to place me at fault. Apparently this place just can't handle constructive criticism & had the nerve to accept my offer for a reasonable resolution to counter with a cheap trick and wanted to charge me.\n\nSO: \n1) 5 hours is what I was going to have to wait in order to eat a meal. 1 of those hours is your expected delivery time. OK Fine. but to charge me $3 for not only a cup of rice but to wait an additional 4 hours - SERIOUSLY!?!?!\n2) Blaming me that I didn't order rice & so now it's an inconvenience for you to pick up the phone in attempt to possibly up my order an additional $10 bringing the grand total of a meal for 1 up to $30. ARE YOU SERIOUS?! a simply phone call...\n3) The FOOD had gone beyond it's expiration date & then....THEN\n4) The claim that they are SO BUSY they are unable to deliver another meal my way is just RUDE for rice when I've already paid for a $20 dinner, but you'll offer me a discount??...OMG.\n\nI will say this -  Yelpers will NOT be the only ones to hear about this review.", "author": "Riz B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-02-22", "description": "WHY DID I NOT LOOK AT THE REVIEWS TO THIS PLACE BEFORE?\n\nI got food poisoning from them after ordering delivery from them on Friday night. I ordered their BBQ Pork Fried Rice and Beef Brocolli. Please shut them down. So many people have got food poisoning from them. I'm still in recovery mode right now. I threw up, had diarrhea, and a fever this past weekend. Still feeling the symptoms right now. :(\n\nDO NOT ORDER FROM HERE.", "author": "Kyle S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-19", "description": "My favorite is the salt n' pepper anything really, accompanied with beef or shrimp chowfun you just can't go wrong!!! A must try if you like authentic cuisine!", "author": "Eustace B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-19", "description": "Just ordered salt n pepper pork chops and honey walnut prawns with spicy house fried rice one of the best meals I've had for a long time ordered delivery came in 30 min polite driver great place for late night food", "author": "Alan S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-08-29", "description": "The food I have ordered and received has been delicious. Their hot and sour soup has made me an addict (MSG?) and my hubby loves their curry clay pot chicken. We haven't had any roaches in our food (that we know of) but after reading other reviews, maybe we just didn't notice the extra protein... \n\nI loved this place, I really did. Delicious food, good prices, free delivery. And then there was last night. \n\nOrdered food on GrubHub around 12:40, was told it would be delivered around 1:40. No big deal. By 2 o'clock there was still no food, so I called GrubHub and sat on hold waiting for customer service for over 30 minutes (still never talked to anyone, but that's a different story.)\n\nAt 2:30, the delivery guy calls and says he'll be here in 10 minutes. He calls at 2:45 saying he's outside. Husband and I go outside and wait for a minute, no one is there... I called the delivery person back and he says he's around the corner. He calls back a few moments later and says he's going to be another 10 minutes. \n\nAt this point, I had emailed GrubHub and they contacted me asking if I wanted to cancel the order. I said yes. The delivery guy then calls me again at 2:50 saying he is 10 minutes away. I told him the keep the food, that I didn't want it anymore. \"OK OK 10 more minutes. Be there fast.\" English is definitely not our best... 3:05 he calls and says he's outside... Thank God I just took a shot or else I probably would have done something that would have landed me in jail. \n\nI'm asking GrubHub for a refund because being over and hour and a half late is ridiculous, especially with delivery persons who don't seem to know what 10 minutes or around the corner actually are.", "author": "Sandi L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-02-06", "description": "Food is great but service sucks waited 10min on the phone rining for them to answer and then the guy tells me i gotta wait 10min until they open??? Bruh its says opens from 3pm to 2am... its 5pm how are you not open", "author": "Steven S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-02", "description": "Good food. Fast delivery. They do a good job on their honey walnut prawns and beef chowfun", "author": "J H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-08-12", "description": "Ordered sweet and sour chicken today. Chicken. Little did I know that chicken also comes with roaches. I found a dead roach in my meal. Disgusting. I would give zero stars if I could.", "author": "Saidhbh M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-07-28", "description": "If I could give this place 0 stars I would. The food is atrocious. The orange chicken that I ordered didn't even look like orange chicken and the chow mein was cold when I got it. Do not eat here.", "author": "Felix T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-10-28", "description": "We have ordered her so many times through Eat24. Usually the food is ok if you order what you know. This place is more about convenience than quality becausenit isnopen until 2 am. My wife and I ordered a 10 piece pineapple wings 10 pieces and only received 8. She ordered sezchuan 10 piece wings and got meat that didnt really look like chicken at all. Smelled like chicken but it sure wasn't wings like it said. She didn't eat it in fear of it being something other than chicken. Both boxes of wings were in the tall fried rice boxes and half full of boiling hott marinade from each wings. Burned myself decently bad in the pineapple wings sauce.", "author": "John B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-01-09", "description": "This place isn't closed, not sure why Yelp is saying that it is. I ordered from here on GrubHub because it was the only non-pizza place delivering at 3:30am. Well, I appreciate that they're open that late, and the delivery guy was polite enough, but that's about all I can say that's positive. \n\nI ordered Moo Shu Vegetables with no egg. I said, \"No egg\" and the person repeated back to me, \"Okay, no egg.\" It arrived with egg in it. I ordered Cashew Imitation Chicken, and did not receive that at all. Instead, I received a veggie beef dish that tasted okay. I ordered Sesame Imitation Chicken and that tasted pretty good, until I bit into a sharp piece of plastic. Yikes! If you're really desperate for delivery Chinese food at 3am, make sure you're flexible about what food you receive, and watch out for non-edible hazards in the food.", "author": "Yala F."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-07-13", "description": "I never received my food that I ordered over the phone. I called the delivery man and they said they tried but no one answered. I didn't receive any calls or rings to my apartment. I call the restaurant for info about my food and I get nothing. They never even bothered to contact me about my order that I never received but was charged for.  Now my bank is looking to refund my money for the food that I paid for that went to giving the delivery man my food. \nP.S. All the prices on the menu are not updated! \nThis place really needs some changes. Never ordering from here again.", "author": "Edgar H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-10-03", "description": "This is hands-down, the WORST place i have EVER ordered from. \n\nThe drinks never came, the orange AND sweet sour chicken tasted like death, and the person on the phone was terrible, the worst customer service I have EVER received in my LIFE. He seemed amused at the idea that I was forced to wait an HOUR AND A HALF for overpriced drinks that SHOULD HAVE COME with the meal, drinks that NEVER EVEN CAME.\n\nIf, for some reason, you MUST eat here, order the salt and pepper chicken wings appetizer and any of their fried rice options, they're okay. \n \nBut avoid if at all possible. This place is the very definition of the word terrible.", "author": "Daryl S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-03-31", "description": "This place is sick, I found a cockroach in my salty fish chicken fried rice! I called back to get a refund and they said they'd refund me, BUT they never did! This place should be shut downnnnn!", "author": "Junior O."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-04-22", "description": "AVOID AVOID AVOID. Just got take-out from this place and it's inedible. Veggies limp and tasted like ass rubber. Couldn't choke down one. Thought the egg rolls would at least sort of save this awful meal but those were tasteless tubes of grease. Really. They messed up EGG ROLLS. Geeze.\n\nThankfully I threw the crap away before I discovered a cockroach or some other atrocity as other reviewers have stated. Not sure how they're able to stay in business. \n\nKinda miffed at Grub Hub for listing this place at the top. Should've read the reviews before getting screwed. \n\nThe microwaveable chicken pot pie I had to settle for from the hotel lobby seems like a 5-star meal in comparison. \n\nSad food makes me sad. :(", "author": "Sharon R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-04-27", "description": "First time I try this place and last I assure you. Delivery was on time though but it was little consolation when I saw my order. I ordered shrimp fried rice and generals chicken. The shrimp fried rice looked more like white steamed rice. No color and No shrimp at all! Yes I said NO shrimp. And I had to add tons of soy sauce just to give it some flavor. Ok now the generals chicken was more like orange chicken, and nasty orange chicken at that, with pieces of raw broccoli for garnish? LoL \n\nI don't know how these people are still in business.\n\nNever again.", "author": "Cesar B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-04-20", "description": "Ordered food on grub hub from this restaurant for the first and last time. There was a cockroach in the chow mein which is completely fucking disgusting. Needless to say DO NOT order or eat here.", "author": "Araceli M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-05-12", "description": "They left garbage at my house. Looks like they changed their name to China Delights - maybe because of the bad reviews? It's the same phone number however.", "author": "Josh W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-06-05", "description": "For your own safety, DO NOT ORDER from this place!!! I ordered delivery for chicken salty fish eggplant and discovered a cockroach when half way through!! I almost ate that roach!! Thankfully it is quite big and caught my attention. R.I.P Mr. quite big roach.", "author": "Lee M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-23", "description": "Always fast, very accommodating, They take you're order and tell you delivery in 1 hour, but always deliver faster. Food is fresh, fast and inexpensive, + they're are open for delivery late like 2AM! everyday.", "author": "Frank R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-02-09", "description": "What a horrible experience. Im sure by me writing this they won't care!!!! Goes to show how these people treat people. I'll never order from them again and I won't tell people about them. I order at 12 something. 1:30 comes around and still no order. I call 3 times and still no order. Wow!!!! All she can say is sorry sorry sorry. Why don't you quit saying sorry and give me dang good. Horrible place", "author": "Rodney J."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-02-15", "description": "Nasty nasty nasty nasty I got food poison for a week and my taste buds are not the same no more I can't believe there still open for business", "author": "Tycoon B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-08-22", "description": "Handbill Hooligans Still At It!\n\nAmazing!  These guys won't stop their unlawful posting of flyers even after a complaint to the Department of Public Works!  So I wrote the following to Grace Moore at the DPW:\n\nTo:  grace.moore@sfdpw.org\n\nDear Ms. Moore:\n\nI am writing to file another complaint under Pub. Works Code Art. 5.7, 184.70(b) against The Golden Wok, an establishment which persists in leaving handbills on my property in violation of law and despite repeated requests to cease and desist.  \n\nAttached is a photograph of a handbill left today on my residence at XXXX Street, San Francisco alongside of a duly-posted notice prohibiting such handbills pursuant to the ordinance.  \n\nYour investigation of this complaint is mandatory pursuant to Pub. Works Code Art. 5.7, 184.73.  Please investigate this complaint and advise me if you require testimony to support.  Please advise me also when this establishment is fined pursuant to this complaint.  \n\nMany thanks for your attention to this matter.\n\nYours very truly,  etc.\n\nAnyone else disturbed by Golden Wok's business practices is welcome to send a similar letter.  In my opinion, a restaurant that so flagrantly violates city laws does not deserve your business.  Presumably they care as little for the Health Code and various fair employment laws as they do for the Public Works Code, which is to say not at all.", "author": "Paul S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-01-20", "description": "Delivery came in 18 minutes. IMPOSSIBLE. Food was reheated and not fresh. It is unhealthy to serve old food and I would not order again.", "author": "Charles S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-04-14", "description": "Just got general Tso's chicken from there, rice was fine, chicken tastes spoiled. Health department needs to look into this place.", "author": "Casey K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-01-17", "description": "AVOID AS MUCH AS POSSIBLE Orange chicken didn't taste like chicken  smh really wanted to give this place a shot but ....nope", "author": "Frank R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-07-19", "description": "In a word, NASTY! DISGUSTING!\nOrange chicken was gross, the generals chicken was so cold it was a brick! egg foo young was a huge lump of over deep fried burnt egg with a sauce so salty I got thirsty just pouring it! The rice was dry, as was the chow mein & what little oil was used seemed old & dirty. DO NOT EAT HERE!\nIt also took 1 1/2 hours, when they said 45 mins! The only edible thing was the egg rolls. Bill total was almost $50 & we threw it all away! That bad! Oh & I called to complain & they didn't seem to care! They got their $$!!  I would give no stars, but yelp made me put at least one!", "author": "Shelli G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-09-01", "description": "Eh. My mom decided to try this place since it looked cheap (3 dishes for 22.99) and they deliver. I think it's kind of sketch that they don't advertise their location, but I guess they primarily deliver.\n\nAs for the food, it was nothing impressive. At first I thought it might be because I was eating this about 45 minutes after they delivered, but man some of the stuff really wasn't good.  I know the dry fried noodles are supposed to be dry and crispy...but these legitly tasted like cardboard. The flounder was flavorless and not tender at all. If fish could be stale, that's what it was. The sweet and sour pork was mostly hard breading.\n\nI also was not impressed with serving sizes here.\n\nIt wasn't inedible, but I mean come on. We live in sf, there are many better Chinese food places than this.", "author": "Denise C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-08-15", "description": "The food is ok, ordered salt and pepper pork chops, chicken, and fish. However the delivery time after 10pm on a Wednesday night was well over 90 mins. But the driver did call to apologize and that he was on his way.", "author": "Pickle R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-11-15", "description": "Golden Wok is a misnomer. They were rated just as poorly as the other Chinese of equidistant from me, so I took a gamble and chose them because they had the \"any three items for $22.\" I should've gone with the other poorly rated restaurant. \n\nI ordered three items. Out of the three items, they only got one item right. I ordered chow mein just plain noodles, which they made the order standard and screwed up that one. Their seafood and tofu claypot made no mention of shellfish, so I couldn't eat it when it showed up because I'm allergic to shellfish. \n\nSeriously, not disclosing shellfish is a huge liability, and getting two out of three items in an order wrong is a dismal pass rate. Never again, your food is disgusting and your margin of accuracy is deplorable. Ick!!!\n\nUPDATE: It appears that this restaurant and Chef Ming are the exact same restaurant. They share the same address, and they share the exact same poor rating. Thanks for messing up chow mein, probably the easiest staple of Chinese food to make.", "author": "dAvid s."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-03-03", "description": "Full disclosure: I was drunk when I ordered. \n\nIt was Sunday (funday), I awoke from a mimosa/brunch coma at roughly 9pm and was starving. Being lazy, I popped open my Eat24 app and low and behold, golden wok popped up. \nThe ratings weren't the best, but the menu looked promising, inexpensive AND they delivered to outer sunset at no additional cost. Sure, why not?\nI ordered with my eyes and kiiiiinnddaaaa over ordered, but that being said, I got a little taste of everything.\n\n- Eggrolls\n- Orange chicken\n- Salt and pepper ribs\n- Combination fried rice\n- Two gatorades\n\nEggrolls were large, orange chicken was a little on the bland side but edible, salt and pepper ribs were heavy on the salt and light on the pepper, the combo fried rice was HUGE and was really good.... But to be honest, the saving grace was the Gatorade. Imagine being drunk, dehydrated and need to clinch your thirst only to find that they DELIVER GATORADE! The delivery took about 40 minutes from start to finish, the food was hot, the delivery guy was nice and the bill came out to just under $40 which isn't too shabby seeing as I have leftovers for a few days. \n\nThis isn't the best food ive ever had but it definitely isn't the worst. Think: mall food court quality, healthy portions and did its job. I would definitely order again but doubt I would ever go out of my way for it.\n\nBut serious, Gatorade delivered! Do it!", "author": "Ryan L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-01-05", "description": "I'm giving a star because they brought something.\n\nFood Quality: seafood mixed vegetable soup , steamed rice, crab wontons.\n\nThe soup only has imitation crab and snapper particles in it. Chinese broccoli, celery, and a sliced carrot. \n\nThe steamed rice was rodent free.\n\nThe soup had more imitation crab in it than the crab wontons did... go figure.  They tasted like I ordered cream cheese wontons. \n\nI wish I had noticed the 5% rating", "author": "Kwanza G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-05-01", "description": "The food was alright but the delivery guy was very very rude. He handed me my food and gave me a dirty look when I asked for a extra pair of chopsticks because I'm sharing my meal with some friends and then he pointed at the receipt in my face and told me I owe him a tip. You need to fire him or have him learn some manners.", "author": "Nick N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-03-04", "description": "Honestly don't order here. I don't care how late, I don't care how bad your drunchies are, its really not worth it. I got the imitation orange chicken  and veggie fried rice and it was inedible. The fake chicken had a gelatinous odd tasting sauce and was the worst texture. The rice was oily but not as bad as the chicken. THE FOOD TASTE LIKE METAL! \n\nAlso, I am with the yelper that thinks this is an illegal home operation. They freaked out when we said we would come pick up the food at their \"store\"", "author": "Shelbie B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-12-10", "description": "So my family and I ordered our food from Golden wok like we always do when we're craving chinese food we've never had a problem and we're always satisfied today we waited over two hour's and when the driver got here he was rude refused to give me my copy of the receipt for I was paying by credit and then he had the nerve to get crazy and hostile and yell NO F@#king!!! tip when I questioned him and insisted we call his manager he became more hostile drove off cursing me taking the food when I called Golden wok to tell them about there driver they put me on hold driver came back started shoving food in my chest telling me to take it all golden wok could say was sorry we will discount you 20 dollars  which you will receive in three days... neighbor's watching...feeling embarrassed and to top it off my order was wrong....I highly suggest you never order delivery from here..", "author": "Dao N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-25", "description": "Probably a 3.5.  Ordered delivery from here without checking reviews, which is probably good looking at everyone's reviews.\n\nThe food was pretty good.  We got the 3 dishes for 19.99 deal which has A LOT of food for the money.  We tried the orange chicken, sweet and sour pork, and lemon chicken.  I wasn't a fan of the sweet and sour pork because the pork seemed a bit dry, but the sweet and sour sauce itself was quite good.\n\nSauces were all very good and flavorful.  Chicken was good and meaty... not chewy.\n\nThe did listen to my requests that I wrote for no vegetables or fruit in the dishes, which doesn't always get listened to.\n\nThe egg rolls and crab wontons were good (would've liked some sweet and sour in a cup on the side for these, though).  Wontons were a bit cold by the time we got them, though.\n\nComplaints:\n-Menu through Eat24 really didn't explain if rice came with the 3 dishes deal, so we ordered an additional rice and then ended up with too much rice because it did come with a medium rice.  Not sure if they just gave it or it always includes.\n-Kind of expensive... some how our bill added up quite quickly with eggs rolls and crab wontons, but it just seemed to get expensive quickly... \n-Our estimated time was 45-60 minutes and it took about 80 minutes to receive... so a bit slow.", "author": "Lyndsey C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-04-25", "description": "This was hands down the worst Chinese food I've had in my entire life.  \nI paid 25 dollars to wait an hour and half for cold food to arrive. The crab wontons were burnt to a crisp. The fried rice wasn't fully cooked. The chow mein had shrimp, beef, and chicken that were all undercooked. \n\nNot to mention I got no napkins or utensils, no fortune cookies and no sauces. \n\nNot only that but when I called the store to ask for a refund (and possibly a puke bucket as I probably got food poisoning) they told me they \"don't do refunds.\"   \n\nIf I could give this place zero stars, I would.   Awful.  Absolutely cringe worthy.  \n\nNever.  Ever.  Order from here.\n\nOh, and update: its been 10 minutes and my stomach is doing summersaults. Time to make myself throw up.", "author": "Laura D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-06-14", "description": "My Go to place for Chinese food when I'm in the neighborhood. I work a block away so I may often grab them for lunch\n\nMy usual orders are Shrimp fried rice (shrimp seems a little overcooked), Chicken fried rice, Salt & pepper chicken, Beef & Broccoli, Chicken Chomein, & Shrimp dumplings (I've had better dumplings from other places, but I'm addicted to them)\n\nThe bummer is that they don't open until 4pm on weekdays usually.\n\nI would say they're Alright especially for the pricing.. Not too bad.", "author": "Denisha D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-28", "description": "I ordered (using Eat24) at 1:48am so that was 12 minutes before they closed. Food came within 30 minutes, and was pretty good! Obviously you can't expect gourmet quality from such a place, but for the price and the convenience of having hot food coming to your door that late at night, I think this place deserves 5 stars.", "author": "Michelle B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-13", "description": "This is my second time ordering delivery and they are so fast and so delicious. For reference I ordered the vegetable fried rice and orange imitation chicken. Super delicious. I would 100% recommend this to everyone.", "author": "Alexis G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-08-18", "description": "SCAM!!!! RUN Menu hanging on gate. Ok yes food until 2:00 am. First order Yes 3 items for $19.95 cool. next order 3 for 21.95 ooookk next order 3 items for 27.95 really in a month and the attitudes get worst each time no  thanks toooo many other Chinese restaurants and I'm stupid restaurant is down the street and it's called something else no one is ever in there and the workers are always outside doing nothing glad we haven't had food poison", "author": "Linda S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-09", "description": "Okay, so I'd read a lot of bad reviews about this place and wasn't really sure if I should. But it was late and nothing else was open and they had easy online ordering. And I was hungry.\n\nThe food was really inexpensive. In order to meet or slightly exceed the minimum, I ordered chicken egg rolls, brown rice and pork with green beans. It came pretty quickly, as I recall. I ordered online and I didn't have any problems with the order taking a long time or being wrong. The food was good and hot. The chicken egg rolls had a really good egg roll flavor to them. I could actually taste the flavor of the egg roll as well as the chicken and vegetables in it. The meat in the pork and green beans was really savory.\n\nI'll be ordering from here again. This is a decent place if not as good as any other Chinese place in Ingleside but they deliver later than anyone else.", "author": "Kurt W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-22", "description": "We ordered from delivery.com and was skeptical \nKung Pao Chicken is very good has a nice sauce and the veggies are fresh and crispy not over cooked and soggy. They use all white meat and I am not sure if it was due to the request or this is normal I just ordered it that way to be sure. \nGeneral's Chicken is very good also. I think it could be better it tasted like they use ketchup and not their own special recipe? I am not sure but if they would take this and enhance it with a special sauce not ketchup I think it would be a winner. It was not bad but it had that flavor of ketchup to it. The level of spicy was just about right for both dishes. \nThe pot stickers were apparently good my hubby ate them all but I didn't try them. He felt like there should have been a sauce with them and not just the soy sauce in a package. \n\nThe fried rice is good I tried a bite of it and it was okay. How can anyone screw up fried rice right ? Well I have seen it done but this place does a good job. \n\nDelivery was quicker than I expected but that could be delivery.com and not the restaurant? Not sure about this. \n\nNot sure I will order again but it was edible food and delivered so I think it was a good experience all around. \n\nStill looking for that perfect Chinese food delivery though....", "author": "Lynette D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-08", "description": "Just ordered from this place and like someone else said, I'm glad I didn't read the yelp reviews before ordering. \n\nIt was 1:30 am and of course drawn by the munchies I ordered through Grubhub.. I got what I would typically order from any Chinese restaurant.. \n\nChicken Chow Mein \nBBQ Pork Fried Rice\nChicken Eggrolls\n\nHonestly, it tasted just like any other Chinese restaurant.. The delivery was very quick and the lady I called to confirm my order was very friendly. Chow Mein was on point.. Only downside is I wish I had more sweet n sour sauce for my egg rolls :(\n\nP.S all my friends enjoyed the food as well..", "author": "Carlos R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-10-03", "description": "Vegetable fried rice? More like white rice with a quarter cup of frozen peas and carrots. I celebrated when I found a small floret of broccoli. No flavor, not even fried. So disappointed. Zero stars plus one star simply because they are open late. However, there was absolutely nothing in that package worth waiting an hour for late at night. If you're hungry and its late, find some pizza joint or just go to bed. Don't order from this place. Yuck.", "author": "Megan K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-09-15", "description": "It's literally been two hours since I ordered and have spoken to the restaurant twice and they said the same thing each time, \"The driver is on the way.\" \n\nBull****", "author": "Giana S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-05-28", "description": "This is the rarest of combos-deplorable service plus REALLY bad food. I ordered for delivery, waited past the delivery window and got a phone call asking me to come down to the street to pick up my food. I refused and the driver just dumped the order with the security guard and left. When I called the restaurant I was told to go pick it up if I wanted it. The point of delivery is that I don't want to go out. Every other delivery I have ever ordered had no problem.\n  The food was cold when if got it and I thought it tasted funny and threw it out. The BBQ Pork had no BBQ sauce and a bad taste (old meat).  This is the worst experience I have ever had with food delivery.\n  I should have believed YELP.\n What ever you do-do not order from this terrible greasy spoon dump. I will dispute this CC charge.", "author": "Richard L. D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-07-23", "description": "Just ordered some late night food. I'm super hungry and I just broke down and ordered. Waited the expected 45 minutes for my food. I ordered from a dorm, and the dorm from the parking lot is like a three minute walk. I got the call that my food is here, and I say \"Cool. I'll come downstairs\" because not just anybody can enter the building. I'm hoping he's outside the building so I don't have to go to far, or at least meet the delivery guy halfway. No one outside. Okay. Whatever. I have to walk to the parking lot. No big deal. I get out there, and I'm like...okay...where is he? So I'm walking around looking for this person, thinking maybe they'll stand outside their car and wave. Nah. So I called, trying to figure out where he is parked. Is he right in front of the dorms? Or is he alllll the way down away from the dorms? I DUNNO. Then he says he's on the other side. GREAT. Now I gotta walk over to the LARGER parking lot on the OTHER SIDE of the building. This is a great place to be at 1am where no one can see or hear me. I just want my food. Don't see him there, so I call again and say, \"Okay just meet me by this building address.\" I walk BACK to the other parking lot and finally he pulls up. Kinda blames me, saying where I should have been standing. I was so irritated. Maybe it's the PMS. Maybe cause I'm super hungry. Maybe because this was ridiculous. Whatever. Give the guy his tip. I just wanna eat.\nMy Walnut prawns. LMAO. Thanks for my kinda of warm walnut prawns with lettuce as a bedding. Sprinkled with like six walnuts and then some prawns. AWESOME. \nAnd then my vegetable chow mein. I like the temperature, but it's bland, to be quite honest. I am just so irritated. My $18. Me walking around in the dark for someone who could have done something as simple as just STAND outside their car. My sort of warm food with my wee bit of walnuts and prawns and chow mein that needs more salt. I'm not that hungry anymore but I'm just tense from writing this. Thinking that I should have ordered pizza.", "author": "Danielle R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-06-02", "description": "We ordered almost $60 worth of delivery. It was 11:30pm (they close at 2 am). \nWe waited about 90 minutes. Nothing. Then 2 and a half hours went by. We called Seamless. No answer. Then we called the restaurant. No answer. At least AMEX reversed the charges. Nice scam they got going here.", "author": "Otto V."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-04-07", "description": "Why does this restaurant have like... 4 different names?! Golden Wok, Chef Ming, Hong Kong Delights, and Kenji's Sushiya? Different names won't fool people into thinking the food got better. If I didn't have a discount on Seamless, I wouldn't have bothered. \n\nThe location is away from the cluster of restaurants and business so they probably don't get much business, which seemed to be true on the afternoon I went. I hoped it would be a decent hole-in-the-wall restaurant but it was the opposite. There were no customers, just 2 guys cleaning utensils or whatever at a table. By then, I kinda already knew the food might be bad.\n\nI ordered the seafood pan fried noodles, deep fried flounder, and half a duck. It was neatly packaged and piping hot so I thought it would be fresh but the duck was dark brown, meaning it was old and they just reheated it. The noodles were bland and the flounder had a weird stinky smell. I know there would be some degree of fishy-ness smell but this smelled like it was fermented for centuries.  \n\nThanks for greeting me and thanking me but I will never come back again. I hope I don't get food poisoning.", "author": "Annie N."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-07-28", "description": "It's pretty bad. The meat is rubbery at best, and nothing with vegetables is good.\n\nThat said, I'm tossing them two stars because they at least manage to make their fried dishes edible, and it's open late. Unless you really really want general tso's chicken at 1AM, there's no reason to order from here; other places are better and a bit cheaper.", "author": "Bill H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-02-22", "description": "delivery order online...thirty minutes dogpatch wait...six dishes $fifty-four plus delivery tip...some bag leakage...containers opened with care...fried rice slightly dry....spicy fish and salted tofu sauced dark and heavy....spicy, saucy and salty...bitter melon scramble decent...large portion with bitter melon in every bite...heavier sating, but acceptable...spicy boiled beef similar in spicy and salty...sweet and smooth chicken corn soup to mellow...vegetables cooked fine and dandy...no problems with delivery, no food poisoning and nothing horrible to report...", "author": "Hen A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-05", "description": "The chef is very professional. It is a good experience I ordered from there.\n\nThey are really fast and also their foods are clean and delicious.\n\nI wonder why they only got 3 stars in yelp. SUPERFAST and SUPERCHEAP.\n\ntaste is good.\n\nThe only thing I gave them 4 stars is their cuisine has only some meat. Thanks", "author": "Ryan S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-07-03", "description": "I am Asian and in my 30 years, I've never tasted Chinese food so bad. I ordered the orange chicken and wonton soup...terrible mistake. It is just a disgrace to Chinese food.", "author": "Edward S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-10", "description": "perfect execution on the order!\n\nReviewed the order on the phone and the girl that i spoke with was patient to answer all questions. +1\n\nDeliver the the food in less than ETA. about 30 min early +1\n\ncustomer service- The delivery guy was very prompt and nice during arrival 1+\n\nFood - I ordered the Spicy House fried rice and the curry pork chop. For a Chinese delivery and still serves food past midnight I would give the food 2 thumbs up. The Fried rice was very generous and it was perfect. The pork chop could be better but it was still good. 2+\n\n5 stars good job", "author": "A A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-08", "description": "The bbq pork fried rice and lemon chicken is so good at 2 am. Idk how they do it but it works every time", "author": "Raymundo F."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-08-22", "description": "I'm so sad, I ordered at 1am vegetable fried rice, vegetable chow mein, and orange chicken.. They said they word delivery in 45mins and I never received a call, text, or my order! I was looking forward to my meal! I waited almost two hours. Right now it's 2:30am and I still haven't gotten it ): I called 5times then deci", "author": "Moca O."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-10-09", "description": "I ordered Prawns and lobster sauce, Fried chicken, and Mongolian beef chow fun, sweet & sour sauce, with 5 fortune cookies from the menu. My daughter, pointed out to me that meat was in the Prawns dish & its PORK.. I said in anger, i didnt order meat. I called the the Resturant, no manager available, I told her my problem, she checked with the with chef & it was pork in this dish. I told her that I didn't order meat & I'm allergic to pork, & I didn't get sweet & sour sauce, & only 2 fortune cookies. She report \"well on the menu it has pork in the prawns dish, what's online doesn't always get corrected\", then she gets indignant, \"I'll give you your money back, with no option. \"I ordered the dish to be replaced & requested sweet & sour sauce, and more fortune cookies. And for the inconvenience I'll accept a free dessert. She declined the dessert & said we don't do that. I received the 2nd order, but no sweet & sour sauce or fortune cookl ok o 2nd time around which I specified. So for the replacement I received the Prawns with lobster sauce 1 hr & 10 minutes later, no sweet & sour sauce, & no fortune cookies that I specified the second time around. I won't order from this place again. 3 errors with the first order, & 2 errors for the 2nd order. And I paid over $25, thats a lot of money today to receive errors like that, plus the second time around. I will report this to the manager ASAP.", "author": "Janean S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-12-29", "description": "I'm glad I didn't read YELP first, because we had a good delivery experience and so many people out there do not like this place. \n\nThe food was fine/good - the quality was better than average. My favorite was the Curry Chicken Clay Pot.  Only one complaint was the large veggie pieces. Would prefer more cut-up veggies. But the they were good on the phone, delivery was on time, driverwas nice and polite and the prices were about the same as most and the food was decent.\n\nNo complaints.", "author": "Karen L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-02-03", "description": "This place is super bad. I don't know why I order here, I've been here and been disappointed every time, but somehow, my shitty brain goes, \"hey, they're close, and not THAT bad\". No, they are that bad, and shouldn't be fucking ordered. Never make my mistake. I'm writing this review, just so I remember to stay the fuck away..", "author": "Joseph O."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-06-21", "description": "OMGOSH!!!! their food is so m-f**king salty!!!! why does chinese food always have to be so greasy, oily and salty???", "author": "p f."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-07-07", "description": "Quite possibly the WORST Chinese food Ive eaten!! Rehaeted duck and bbq pork nearing gray colors, the most tasteless noodles, and overcooked mushy greens.\nThey've changed the name from what I hear, quite possibly to keep the take out customer guessing.\nTrust me, dont give this place a dime. AWFUL FOOD!", "author": "Eksel P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-05-31", "description": "1970 called and they want their advertising campaign. I can see why you feel the need to put your menus on doors when your ratings are sub 2 stars, but seriously FUCK OFF with all paper and rubber bands wasted.", "author": "Tomas C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-01-31", "description": "no good,fucking food .the smell of shit, onion beef is bite less than steak... Don't order a meal, order a meal is stupid, life is the most wrong is to eat the food of the restaurant. Please don't let your life have regret", "author": "Sherman F."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-08-07", "description": "I dont even want to give them one star. I placed an order using GrubHub. My order was over 30mins late, AND after eating started getting severe stomach cramps. Those cramps amongst other problems occurred for the next week. I visited with my doctor as well and he confirmed that I had food poisoning, and also was severely dehydrated. \n\nGrubHub and I have both attempted to contact the restaurant to speak to the manager/owner and always get that they are no there, but will call back. No one has called me back or GrubHub. \n\nDO NOT EAT HERE.", "author": "Akhila C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-08-08", "description": "Hey let's make this simple....  \n\nIf it's midnight and you need delivery this place is the best thing since sliced bread.  Go for it.  You might not die, and you will be filled.  \n\nif it's 5pm and you have options, go elsewhere... The fried rice smells like a urinal......", "author": "Johnny C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-10-31", "description": "Wow, what a RIP-OFF!\n\nI ordered once from these guys a long time back, and the food was great. Last night, however, was a total disaster. So bad, in fact, I don't think I'll ever be ordering from them again. The food was expensive ($40 for three dishes), the order arrived incomplete, omitting my free item for an order over $35 completely, what was there was ridiculously small in size for what their charging, it tasted literally like MEDICAL WASTE, and the service was atrocious.\n\nThe driver was obviously lost and my house is extremely easy to find. After arriving somewhere in the ~2-HOUR range, after a hideously long wait, and a rude phone call asking for me to come outside to get my food as opposed to the driver coming to my door (WTF??!!), the driver hung up on me mid-sentence. Then, after finally finding my place, just handed (more like dumped) the bag of food with me, and without even asking me if I needed anything else or if I was satisfied, just spun around and ran back to his car. Some way to treat a customer guys!\n\nThen, we get the food inside, only to find our soup we asked for was missing. I ordered brown rice, and got white steamed rice instead. What else was there, was small. VERY small. And then then final horror; the HIDEOUS FLAVOR. There were mostly green beans in our three mushroom dish, but what was there definitely had a plastic 'sharps syringe' medical waste box flavor to it, the rice noodles in our mongolian beef were literally glued together in a massive mound at the bottom, and there was about an ounce of beef in there anyway that also tasted like plastic. The kung-pao prawns and scallop dish had shrimp in it (know what your calling a prawn please at least people, I mean really!!), there were only about 5 or 6 of both in there anyway, with mostly green bell peppers and onions to take up space and make it seem like there was something besides just the vegetables in there to eat.\n\nWhat a s**t hole!! I wish there was a negative-star option and a quick refund button. If I knew I wasn't going to waste half a day and a lot of stress, I might actually try to get a refund for this outrage.", "author": "Yuri G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-01-02", "description": "I have not eaten at this place, but I just wanted to let people know that they are distributing menus as \"China Cafe\" as well. We got them at our apartment complex a few days ago.  I'll go ahead and assume that's because of their extremely poor rating and continue to not eat there.", "author": "Charity S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-06-14", "description": "I wish I could rate their food. But I can't. I literally can't. \n\nI can say this though: If you're thinking about ordering from this place for a late night meal, don't. Mine never came (it was delivered to the wrong person... I don't know how that happens either). And after almost 2 hours of waiting all I got was a \"sorry. Please call the restaurant back for a refund.\" Yea, too bad the restaurant isn't open this late for me to take the extra step to get back the money I spent for food I never got. Thanks, Golden Wok. You're terrible.", "author": "Doug D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-01-17", "description": "Service is up and down with this place but food is a bit better. Great house fried rice!", "author": "Bella B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-12-10", "description": "Tired, hungry and slightly still drunk after the SF Bulls game, I decided to try this new chinese delivery service from a menu hanging from my doorway.  I ordered like I would any other chinese delivery service but after hanging up I noticed an entire Szechuan section - realizing my error I called them back and changed my main to \"Szechuan spicy boiled fish fillet\".\n\nWhile this is no Z&Y, this was really solid for delivery. The fish fillets were lightly breaded and fried and the szechuan oil was really tasty and solid and it was accompanied by baby bok choy and some thinly sliced bamboo shoots (no bullshit cabbage or american broccoli here). While i could do with more of the \"ma\" it was sufficient and the \"la\" aspect was fiery.   \n\nI am excited that I can get szechuan delivery (looks like they deliver througout the city and beyond) I look forward to trying the other Szechuan dishes like the tripe w/blood pudding and their mapo dofu.  I did not see any dan-dan noodles though but maybe if i ask nicely enough (maybe brush up on my mandarin) I might get hooked up.\n\nEDIT\nI have gotten chef mings two other times with less spectacular results but it is still solid.  the Szechuan spicy boiled fish fillet is still the thing to get.  Had the \"Szechuan Steamed Bacon Cut Pork with Pre-Served Mustard Green Hearts\" which was ok but pretty fatty but not something ill get again.", "author": "Mark G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-04-25", "description": "Never again. I always order from one place and I decided to be \"venturous\". My hubby and kid were on board. We order delivery and it's like 35 bucks for 3 entrees and a won ton soup. Whatever. But the portion were so small!!!! Wtf. Lol maybe I'm used to my usual place. The Orange Chicken was foul. Like I don't even understand why or who likes that flavor. It's like \"Splenda\" sweet. And the fried rice was HARD. The Mongolian beef was ok. But I asked for no peppers and I got extra peppers lol. That sucked. Only thing I haven't ate was the Won Ton and that's out of fear that it might be disgusting lol. Just stay away. If you like it, you have some rare taste buds.", "author": "Cindyjo O."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-10-16", "description": "Beware!\n\nI have ordered from Golden Wok numerous times and enjoy the food. I loved this place for the past 2 years since I moved to SF! Something has changed and the last 3 times have been very disappointing. \n\nThey send all the food without the sauces which you need with the food! I don't know if they're cutting cost but it's bad business. When you spend $50 plus in food they should give you everything that you ordered including the drinks.\n\nI asked if they can send the missing food and I was told when the driver comes that way which may be a few hours. Seriously, where is the customer service? I ask to speak to the manager and I am told to wait for 5 mins and he will call me back.\n\nHe did call back saying a new person is putting together the orders and he will personally delivered fresh food in 15 minutes. I received the order and it was 3 hours later. I started at 8pm they fixed it around 11pm.\n\nJust be aware that your food may not have all that it needs missing entrees and drinks.\n\nAlso, the lady taking orders doesn't know streets in SF and you will repeat herself 3 to 4 times. \n\nI had this review written then never sent it but I decided to give it one more chance, 2 weeks after this event described above and tonight I received the same service. Just a HUGE DISAPPOINTMENT!!!! WOW, 4 times in a row.\n\nI'm officially no longer going to Golden Wok.", "author": "Brian V."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-11-03", "description": "This place should be avoided at all cost. The food is terrible and Yelp indicated it is even a health hazard for poor food quality. I wish Grubhub cared enough to do the same. Do not eat or order from here.", "author": "Danny D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-08-11", "description": "Worst honey walnut noodle ever, the shrimp taste like chemical. The hot sour soup look like diarrhea water, and taste like it too. The chaw mien is ok, but again the shrimp in it is bad...", "author": "Kingta L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-05-22", "description": "Ordered chicken wings and fried rice for delivery.  Received food 2 hours later. Everything was cold and chicken wings was soggy. Very poor srrvice and i will not order from them again or recommend.", "author": "Thomas W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-06-15", "description": "Came home found my front yard littered with Golden Wok menu fliers. I dont appreciate having my front hard littered with trash. Never been here, Will never go here- customer service is part of having a restaurant, if their goal is to get customers to come by making their front yard look dirty with their fliers they have done a great job.", "author": "Nina M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-03-09", "description": "PLEASE HEED MY WARNING AND STAY AWAY.\n\nThis place has got to be on my top ten most disgusting restaurants I've been to.. and I've been to third world ghetto restaurants with flies swarming everywhere. Unlike everyone else, I actually step foot inside this restaurant. There were so many red flags, I know it is only a matter of time before they give someone food poisoning. DON'T let it be YOU. Read on to see I am not exaggerating.\n\n1. The first thing I noticed in this restaurant was the old grandpa and grandma separating the egg roll wrappers.. directly touching the dirty table full of ribbon trimmings and ripped up plastic packages. The grandpa even had the wrappers directly touch his pants. Kind of disgusting right? Read on. \n\n2. There were cigarette ashes on my plate set. What, not that bad? Read on.\n\n3. When the waitress got the plate sets for the other members of the party, they were ALL dusty. Like, abandon building dust. D-U-S-T..Y U NO CLEAN YOUR PLATES?!\n\n4. We smelled an overwhelming odor of cigarette smoke at the beginning of our meal. I thought it must be from the outside. It IS next to a liquor store after all. Then at the end of my meal I smelled it again. This time one of us went outside to check if anyone was smoking. No one was outside. Where could the smoke have gone? Read number two again. Yes, I believe one of the cooks was smoking IN the restaurant. Double U, Tee, EFF.\n\n5. Now the rice. Luke warm and there was a piece of plastic trimming in it. Are you guys seriously competing to be the worst restaurant ever? \n\n6. Half the restaurant had boxes scattered around, taking up sooo much space. Paintings were unhung. The dishes were also awfully beat up for a \"new\" restaurant.\n\n7. Then, there's the ambiance. You can tell no one gives a damn about this place. I don't even understand why they opened it.\n\nSo yes, if you order take out, this place is \"fine\". You'll keep thinking everything is all clean and dandy. If you set foot in this restaurant and experienced the things I have experienced.. You'll never order from here again. In all fairness, the food was pretty tasty. I feel awful for giving this place such a bad review. The service was inexperienced (the waitress clearly didn't know what she was doing but was trying hard). I also understand how hard and how much money it costs to have a family restaurant. I'm less sympathetic because it seems like they never even put in any effort. Why do you open a restaurant when you have random boxes scattered on the ground. Your plates are DUSTY. Hong Kong Delight, you fail.\n\n\nBottom line: I honestly feel lucky that I didn't eat a bug or get diarrhea.", "author": "Theresa N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-04-29", "description": "Love this place so far. I've only ordered for delivery twice, so I can't speak to the experience of the restaurant itself.\n\nAs for delivery - they are speedy and reliable and the food has been great so far.\n\nI've had all of the following and loved them:\n\nPork Fried Rice\nPotstickers\nGeneral's Chicken\nKung Pao Chicken", "author": "Marc C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-05-24", "description": "DO NOT EAT HERE!!!\n\nThe food is horrible and the service is even worse! Don't waste your time and money like we did. It was a $26 lesson that we will not soon forget. \n\nI will never order from here again!", "author": "Jonathan S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-05-07", "description": "This place is AWESOME! \n\nWhen I called I spoke with Aaron when ordering take-away, and not only was he funny but very helpful as well. He hooked us up with the coupons when ordering and the food got to my place super fast!\nWhen ordering i recommend getting anything \"House Spicy\" because its wicked good, the portions are huge and super tasty.", "author": "Timothy H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-12-30", "description": "First of all, they got part of my order wrong. I ordered veggie beef and instead got veggie orange chicken. I also got steamed rice, spicy garlic eggplant, and veggie potstickers. The food was edible, but definitely not worth the $30 and hour wait. I would definitely not recommend getting the veggie potstickers though--they definitely fall pretty low on the \"edible\" spectrum.", "author": "Kiara D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-11-25", "description": "Are prawns supposed to have an ammonia aftertaste?? I think not!\nThe Golden Wok is NOT golden.\nWe ordered for my bonus daughters sleepover, lots of food was left over, though my bonus daughter thought it was great. I thought it was below mediocre. \nCame home tonight to see they had ordered again, and 2 orders of the walnut prawns, which we love from other places, but hadn't gotten from them before.  ok ... the walnut prawns looked promising but were obviously old, because they had an ammonia aftertaste. \nSo I called the restaurant to tell them the prawns had turned. After not listening to me and putting the phone down in search of our order and then assuring me they would call the driver I finally asked them to please listen to what I was saying. After explaining the prawns they used had gone bad, she told me \"that's the way we make them!\". I explained again. She spoke to the the manager and offered us a free appetizer next time. I then explained there wouldn't be a \"next time\" and that they should know that the prawns they are using tonight had gone bad. She then argued with me telling me nobody else has complained.  This was the exact response I had expected.  I hope I don't get sick, Thanksgiving is 2 days away and I would hate to miss it because of bad prawns. Keeping fingers crossed.\nThere are some fantastic Chinese places in the bay area, geeze just in downtown San Bruno alone you can find some really great Chinese. Don't waste your time with this place. I doubt the ingredients are fresh.", "author": "Tammy B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-12-03", "description": "Ordered at 8:00 PM, got here at 8:23 PM. Fast delivery! (I live in SFSU/Parkmerced area).\n\n3 dishes for 19.95 (w/ tax = $21.xx): Beef chow fun, honey walnut prawns, and orange chicken.\n\nAVOID ORANGE CHICKEN LIKE THE PLAGUE, I opened up the box and the smell that came out of it resembles..wait for it..fruit loops. Yup. Had one bite and it was WAY TOO SWEET--no tanginess of orange at all. Had to recreate it with salt and pepper and whatever else I could find in my kitchen for it to be edibly decent....Chow fun and shrimps are good! Overall, three stars. Will order again :)", "author": "Cindy D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-01-22", "description": "Got a flier on my door. Was hungry. Tried this place.\n-Delivery was 45 minutes \n-Food tasted so bad though (Chicken Noodle Soup/Beef Tomato Fried Rice/Clay Pot Curry \n-The packaging and wrapping was pretty bad. My curry had spilled. \n-The fried rice was flavorless AND two (2!!!) times there were egg shells in my rice.. that I bit into. T____T \n-The curry was decent. Little chicken and about 85% of it was green peppers and onions. Okay, seriously? \n-The chicken noodle soup was just w/e.  \n \n\n2 stars for the cheap prices and the no msg.\nWon't order again.", "author": "Suzie B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-02-08", "description": "I ordered the lemon chicken and it was made out of rubber chicken. Even worse the hot and sour soup made my head hot and my stomach sour.", "author": "Yevgeniy V."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-12-23", "description": "Ordered takeout. Variety of nine different items. Most items tasted okay. Lemon chicken overcooked. Spicy garlic fish had mostly yellow onions. Delivery roughly one hour. Their flyer did not have their street location so took a chance on this place.", "author": "Clifford W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-05-18", "description": "I don't think I've ever ordered chinese food so bad. It took almost an hour to deliver food to me less than 5 minutes away and food was COLD!! Disappointed I paid money for nasty chicken and stale rice", "author": "Azziz I."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-03-07", "description": "My favorite thing about this place is when they litter my apartment with flyers that end up on the ground.", "author": "Kelvin B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-10-08", "description": "Horrible service and food! We ordered from here not to long ago and the food was gross AND cheaply made. Portion sizes were awful too, not like I'd want to eat it all anyway.\n\nPlus, they forgot a drink we ordered. We called, asked if we could get it delivered back to us, and they said NO. really?\n\nDo not eat here.", "author": "Ashley R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-02-10", "description": "ABSOLUTELY DISGUSTING.\nFlyer on the door a month ago, wife out to dinner with girlfriends, home with our 7 month old son, I'll order some Chinois.\n- Order took 1 hour and 25 minutes to arrive (not 35-45 minutes, as I was told)\n- Opened the containers to find everything cold and soggy\n- No sauces for the items that should have come with\n- One appetizer was advertized as 10 pieces, showed up with only 8\n- Composted the bulk of the 'meal' and learned a $25 (with $2 driver tip) lesson\nFool me once, shame on you.  Fool me twice ... nope, aint gonna happen.\nDo yourself a favor and steer clear, seriously.", "author": "Cy L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-03-20", "description": "Gross. Ignore your late night Chinese craving. Go to the Mission, grab a burrito and find decent Chinese the next day. \n\nWe ordered delivery through GrubHub and were totally disappointed. The GrubHub experience was great but the food was terrible. We couldn't ignore our hunger. This was so gross. I've never been this turned off by something this badly. \n\nMy stomach is now punishing me for eating what I did. Bleh.", "author": "Autumn B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-03-23", "description": "i found a cockroach in my salty fish chicken fried rice!!! i am beyond repulsed that until now i have goosed bumps. when i called them to complain, they had the audacity to hang up on me. this is my first review ever and i made this account specifically to write this because i felt the need to get my message across and warn others of this disgusting place. the public health department should inspect this place because i am concerned that this restaurant is infested with pest and is violating multiple health regulation and food handling procedures. i would post the picture of the repulsive creature that decided to join us for dinner but that is disturbing. however, i would if i have to.", "author": "Danica G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-02-10", "description": "Ordered at 1230 am. Still haven't received. It's 3am. Was told I'd be contacted tomorrow as to what happened. Meanwhile I haven't eaten and have been charged $30.  Negative stars if I could.", "author": "Scott H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-11-21", "description": "Food was late and cold, driver was rude. No customer service,  if I could have returned the food I would have!", "author": "Tom H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-05-30", "description": "I ordered this last Sunday at 1 AM. I had a flyer on my door and figured hey why the hell not? It's cheap, and they deliver til 2 AM. Man what a mistake. Did not taste very good. I usually go to Jade Cafe but being that it was super late and I was hammered and hungry....well that explains everything. Anyway, learned my lesson.", "author": "Sofia F."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-09-30", "description": "This was the first Chinese food I ate that was disgusting . Chow mein was dry, Peking pork chops were soggy but the only thing I can say there Crab ragoons were decent ! I Wouldn't order again tho", "author": "Gwendolyn H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-05-01", "description": "Dont order for delivery unless you want to wait 2 hours! We called 3 times and every time it was 10-15 minutes. Absolutely ridiculous. Dont order from here! A waste of time!!", "author": "Jenny T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-12-18", "description": "Poor service bad food! We decided to try this place for delivery last night, and found it extremely disappointing. Our meal arrived on time, but when we open it up we discovered that the Kung Pao chicken was not included even though we were charged for it. We immediately called the delivery person, and he asked to see the order to verify that item was missing. He told us he would go back and get it, but called a few minutes later, to tell us that his manager said to just refund the cost of the entrée. That is not good customer service. On top of that, the eggrolls were limp and greasy, we ended up throwing them away. Also, the onions on the Mongolian beef were undercooked and the dish had virtually no flavor other than the onions. I will not be calling them again.", "author": "Joseph A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-26", "description": "5 star for here, second time order, fast delivery and they open late until 2 am. Their general chicken and Mongolian beef are really good! They even have vegetarian food! What can u expect more!", "author": "Zoe W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-03-14", "description": "They deliver, the food was on time and was reasonably warm, and the quantities were good, but the food itself eminently forgettable. I don't plan to order from them again, since there is other, better food we can get.", "author": "Sophie L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-01-07", "description": "Wow...so bad. We should have checked reviews before ordering. They were late..claimed we misspelled our own street. Then the foot made us sick. We ordered 3 dish special - Peking ribs, Beef  and then a chicken and vegetable. Disgusting. We both feel sick.\n\nDo not order..they pasted a menu to our door and we fell for it.\n\nSpecifically, the ribs were not really ribs. The chicken was the nastiest ever.", "author": "Julie T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-03", "description": "Ate here today and it was great! We got the vegetable rice noodles and they were amazing. When they say (must try) on certain items on their menu, you really must try them! So good", "author": "Calisse G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-26", "description": "Delicious beef chow mein. Ordered for delivery and they called to kindly tell me that they were out of steam pork buns, so I subbed with egg rolls. Was expecting the kind of egg rolls with meat, but inside was just oily lettuce. The order came with three fortune cookie and a menu for future reference. Definitely satisfied my craving for chinese food. Will probably order from here again.", "author": "Li C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-10-02", "description": "Have had good meals from this restaurant in the past but won't be ordering from them again. Chicken dish had the off taste of meat that is almost spoiled. Egg rolls were soggy and vegetables tasted old. Wondering if this restaurant has changed management?", "author": "Jeff Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-07-07", "description": "I actually never been to this location so I wouldn't know the ambiance of its establishment.  But I do order from them on the weekends whenever I'm craving for their BBQ pork.  They actually sell 1lbs of this, that's awesome!  The food is not cuisine and it's not bad it's actually pretty dam good.  I would consider this place a cheap eats, nothing on the menu is above $10 except the Any 3 Dish category but other then that the prices are very reasonable.  They have a big menu with allot of goodies to eat from Szechuan Fish Fillet, BBQ Pork, Curry Beef, Steamed Mixed Vegetables, Szechuan Steamed Beacon-cut Pork w/ Pre-served Mustard Green Hearts and Leaf Tripe w/ Blood Pudding, (that was interesting type of soup.)\n\nTwo major factors that defines this restaurant is they are open late till 12AM Mon-Sun and their \"impeccable delivering times\".  I live about 5+ miles from this restaurant and my orders always come within a 30-35 minutes.  Most restaurants won't even deliver past 3 miles moreover, deliver all the way till 12AM. (except maybe pizza.)  Besides the fast ass deliveries they also pack their food well.  They have my 5 stars!", "author": "Rom S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-08-23", "description": "always send wrong order, bad cooking steam rice, bad phone calling service! And taste really bad! Don't try this one!", "author": "Kelvin L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-11-10", "description": "Just placed an order tonight and it was the worst ever! I called to place an order at 1:15am. The driver didn't arrive until 2:55am. No call nothing. Of course when I open the bag there's sweet and sour sauce spilled all over the inside. Funny thing is nothing I ordered had sweet and sour sauce. When I finally get to open the containers guess what?? The food is cold..... On top of that the meat is undercooked and is disgusting. After trying to attempt at eating the food I gave up and threw it all away in the trash. Horrible first and last experience. If you don't want to prepare the food properly don't stay open so late. If you are ever desperate for Chinese food late at night don't bother. Order a pizza.", "author": "Lionel F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-24", "description": "I love it when someone sticks a menu on my door, as it means there's a new place that delivers to my neighborhood; Hong Kong Delights is the newest one on this list.\n\nI've ordered carryout from them twice now and been totally delighted that the orders arrived within 20 minutes -- that's exceptionally fast!\n\nFood quality is good.Last night I ordered salt & pepper prawns (they don't travel that well, but were delicious), lemon chicken, fried chicken wings, and sauteed 3 kinds of vegetables (actually 5 kinds).... so I  have meals for two more days now. All this for $30 -- it seems like a good deal to me.\n\nI've previously ordered \"Sauteed Tripple Mushroom\" and found it bland and boring, and the garlic noodles/chow mein was nice and garlicky but not very interesting.\n\nWe're going there for lunch on Friday, I think, because I want to try those salt & pepper prawns fresh from the wok!", "author": "Gretchen B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-08-10", "description": "Delivery took two hours & the asparagus in my Chicken Asparagus was brown, unappealing & mostly stems.", "author": "Duo C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-06-25", "description": "The food was a bit pricey but it was definitely worth it. I ordered the three dish special which gives you a list of 40 dishes to choose from for $19. We got the orange chicken, the beef and broccoli, and the Mongolian beef. The portions were decent but some were incredibly lacking, I'm looking at you Mongolian beef! From the time we called to when we got the food was about half an hour, which is not that decent decent for free delivery to the Balboa Park area. If I got a menu taped to my door, I'd expect that this place would be close by and quick to arrive! Additionally, I can drive to SFSU in less than ten minutes and I know Chinese doesn't take longer than 20 minutes to cook so why the wait?\n\nThe orange chicken was not what I was used to. I expected small pieces of chicken deep fried in orange sauce. Instead, it was cut slices of breast or rib meat swimming in sauce. There was plenty of chicken though and the sauce wasn't too sweet. The beef and broccoli was your standard Chinese fare but there was a lot of beef AND broccoli. The Mongolian beef wasn't too spicy and didn't come with too much meat. Additionally, I think there's supposed to be crispy noodles that come with the dish traditionally that this place eschewed. \n\nIt was pretty decent food, although I wish it were a bit cheaper and arrived sooner. The food, while somewhat plentiful depending on the dish, was pretty decent but could be a bit more better heated.", "author": "Rick C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-23", "description": "A chinese restaurant that has Jarritos sodas? That's a good restaurant in my book! Had the potstickers, they were delicious :)", "author": "Sami Y."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-07-29", "description": "Food took (1 hr 15 mins) to arrive. Tofu was leftover and cold. Egg Foo Young was a Huge, Greasy, Burnt disk of SH@T infested with chunky red onion and four tiny shrimp. Egg rolls were again, grease bombs with No actual filling!!. Steamed brown rice was edible. Booo.", "author": "Amber W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-19", "description": "This place is really under appreciated. There food is delicious and you can not beat the price. Delivery was speedy and all staff I engaged with were extremely friendly.", "author": "Charles T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-03-06", "description": "Hong Kong delights me! I love the light oil/salt and MSG free menu. The prices can't be beat for the high quality of food and large quantities. The fast free delivery is awesome, too!", "author": "Teresa G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-06-19", "description": "horrid egg rolls, bbq pork is ok, walnut shrimp is almost undercooked", "author": "John D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-09", "description": "Fried cheken wings are crispy,Ma por tofu and Bbq pork both  taste good! All of food I order were not  too sweet or 'oilly'. I like it!", "author": "Jojo F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-26", "description": "The guy on the phone was very patient with my orders! He recommanded me strewberry cheese cake for dessert. I am very suprise that how tasty it is considering that its a Chinese resturant!! \n \nTip: They also open till 2 am in the morning, a great place for your midnight craving!", "author": "Pui L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-06-14", "description": "Meh....not great. Three stars but then, we ordered three dish special on Grubhub. One dish was what we ordered. The other two were not. Food was luke warm and pretty bland.  No more...", "author": "Jeffrey O."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-08-31", "description": "I ordered my food at 7:30pm and I got it at 08:37pm.  My order was $21.65 total with tax for the 3-dish deal.  I planned to pay him $26, but I took out $2 because the delivery took more than an hour.  Also, I ordered Seafood & Tofu Claypot, Dry Fried Flounder (whole fish) and Fermented Beancurd with On Choy, but no seafood in the Seafood & Tofu Claypot!!!  I looked at the menu after, and I think gave me the Fried Tofu with Mixed Vegetables.   Will never order from them again.", "author": "Crystie Nicci S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-26", "description": "The food is so good. I dont how to  find one more awsome chinese restaurant like this! The Honey Walnut Prawn is so amazing! And I like the Fish so much. I will order again and again!!!!!!!!!!!!!!!!!!!!!", "author": "George T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-08-31", "description": "I have never written a review in my life... I literally signed up for my own Yelp account just so I could write about just how horrible the food is from this place... Eggplant with garlic sauce = steamed eggplant pieces without any sauce at all, Singapore rice noodles = yellow tasteless glob, and Mapo tofu = some of the most tasteless, absolutely poor quality excuse for tofu I've ever had. I'm honestly NOT a picky eater, nor are my other two friends, and when the hotel front desk handed me the menu, we were excited just to eat ANYTHING. 95% of this meal went into the trash and considering how hungry the three of us were, that's saying a LOT.", "author": "Di G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-07-15", "description": "OMG, never again. I ordered my food around 9:00pm literally got it at 10:40pm not even that my totally amount was $22.00 NOT EVEN worth $22 horrible. The manager was very nice for giving me half off my total amount because my food was going to be cold & surely it wasn't warm when it arrived. The rice was stale & only ONE shrimp in the seafood \"combo\". Ridiculous.", "author": "D M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-09-04", "description": "Tummy troubles the next day. I should have checked Yelp before ordering from this place.", "author": "Patrick S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-01-08", "description": "These people paper your door step and never answer the phone. Food is crap. Please just stop papering my doorstep with your menus.", "author": "Loren S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-09-22", "description": "If I could give negative 5 stars, I totally would. We ordered from this place last night and it was absolutely horrible. Even though we were post-bar starving, we didn't have more than one bite of anything we ordered ~ everything was SO gross.", "author": "Shannon K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-23", "description": "The Salt & Pepper Tofu was crispy, spicy and generous. \nThe Sauteed Broccoli w/ Garlic was garlicy and cooked just right.\nThe Egg Fried Rice had a great subtle flavor and wasn't greasy.\nFast. Hot. Best Chinese delivery we've had in a while.", "author": "Jack M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-03-12", "description": "Order Bravo Pizza Instead. This place may make you sick.\n\nLast night after a long day at work we decided to order out Chinese to quench a craving we'd been having for a while. The food tasted of propane. Ewww.\n\nWe ordered late which was great because often we can't get food in our area that isn't pizza after 10pm.\n\nWe ordered the Beef Chow Fun and the Honey Walnut Prawns. Unfortunately I was very very disappointed by what was delivered to me. \n\n1. We had to call after the 45 minute window that we were given to see where our food was?? \n\n2. 45 minutes after that our food arrived. 1 1/2 hours WOW!\n\n3. Our Beef Chow Fun tasted like propane. Yuck! We didn't get past the first bites. How does my food taste like propane anyway???\n\n4. All of our food was cold. I'd get a tv dinner if I wanted to microwave my food.\n5. The prawns had a great flavor but, were cold and soggy.\n6. The food tasted like it sat at a gas pump for an hour before it made it to us. \n\nThis is all very unfortunate because I could taste some really great recipes under the cold, propane infused food. \n\nI will be talking to grub hub and the restaurant today. I feel like I got cheated out of a good meal that I paid good money for.  :(\n\n** Update after speaking with management: They dont care about your service. I was told that an hour and a half after being told 45 minutes is normal for them. And when they called me back to discuss the service they offered me a portion of credit for food that wasnt eaten because it was poorly made. I will actually be calling the health department re: this restaurant. Food should not taste of propane. EVER! They hung up on me when I told them that I had written a yelp review.", "author": "Airika A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-09-05", "description": "Not having anything in the fridge to eat or the desire to cook, I decided to go ahead and give those restaurants who leaves their menus in front of my door. I had a lot of restaurants to choose from but eventually settled for Hong Kong Delights since they offered the best deal, and the prices were cheaper than the others. \n\nThe lady I spoke on the phone with said that it was going to be a 40 min. wait but the food arrived within 30 minutes or maybe even less so that was pretty fast and the food was warm like it just came out of the kitchen. \n\nAs happy as I was with how fast my food was delivered I can't exactly say the same about how the food tasted. I got the three dish special for $19, ordered sweet sour pork, chicken fried rice, and steak onion.\n\nThe portions were a bit small... I definitely expected a bit more.. \n\nThe chicken fried rice was okay and it was the only dish I finished. As for the steak onion, it was a bit salty but would probably have tasted better with regular white rice. Though both weren't the best dishes or come even close to it, it did satisfied my hunger and I have tasted a lot worst so over all, the dishes were decent. However, the sweet and sour pork was just gross.. I couldn't eat it nor could my sister, it tasted weird, the texture was just completely off, not to mention the pork didn't even look like pork.. \n\nSo!\nFast Delivery- 5 starts\nPrice and portion- 3 starts\nTaste- 2 stars\n\nSo overall 21/2 stars- not the best but does satisfy you. \n\nI'm not crossing this place off of my list of restaurants to order from yet, considering I know there are worst restaurants out there and this place is not that bad. When I do, I will write a review again, and hopefully the experience will be better.", "author": "Arianne D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-05-02", "description": "Where should I start? \nThe food is not that great. Lack of flavor and too salty. Portions are small.\nWe ordered some beef crispy noodle and sweet and sour chicken because my son is allergic to seafood.  He ate the noodle and had immediately a  rash. This means that they cook in dirty woks. They must have cooked some shrimps and used the same wok for the beef crispy noodle. \n\nI did not want to go out. I did not want to cook. I did not cook and I still had to go out to buy some benadril for my son. Someone else could have died while eating a beef noodle.\n\nQuestion.. If they don't even clean their dishes, what are the odds that they clean their hands after going to the bathroom? especially after the big one? Bon appetit and enjoy their food.", "author": "Jean-Yves F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-02-10", "description": "The food is ok. I do mean ok. It used to taste really good when me and my Patna ordered from here the first time. But; however, I always ask myself where can you get 3 Asian dishes for 19.95 that's a win win situation.", "author": "Relly P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-11-27", "description": "So we ordered online and got a confirmation email and everything. we placed our order in at about 1 am, at 1:45 we call and say \"where the hell is our food?!?\" they calmed us down and said it would be there any minute. at 2:00 we call again and they practically hang up on us, saying that they would call the driver and get back to us. its now 2:15 at this point we are very angry!! we really need to get to the bottom of this. it turns out...... they never even got our order!!!!! um hello... HAVE WE NOT BEEN CALLING YOU FOR THE PAST HOUR?!?! we're so hungry now, we dont even fight with them, we just want to place our order again. oh wait, THERE CLOSED. never ever ever ever ever ever go here.", "author": "Andi B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-07-07", "description": "Eating it now... Starting to feel the same as others... ever since Ha's closed down, there is no good delivery in the city.\n\nI judge Chinese delivery on two things (always): is their steamed rice hot, and can they make a decent Kung Pao Chicken?\n\nEpic failure on both.  The rice was cold and stale, as was the rest of their food (I also got beef chow fun and lemon chicken).  \n\nThe flavor was decent on the beef chow fun and they actually didn't over sauce the lemon chicken (so kudos there), but the kung pao was terrible.  Huge slices of ginger (and um, I'm sorry... but why are you putting ginger slices in kung pao chicken?) no peanuts - literally not one, very little peppers, almost no sauce.\n\nIt also took 20 min longer for delivery then they said.  \n\nAs yelp says \"Eek! Methinks not\"", "author": "P K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-19", "description": "Ordered delivery for the 1st time today from here. It took a while to get the food delivered but in the end it was good. The steamed riced was nice and fluffy, the chow mein was amazing, the noodles were a little thicker than I'm used to but they tasted great and not generic but legit chinese noodles. The potstickers were nice and pulp and tasty as well. The orange chicken actually tasted and smelled like orange, however unlike big brand panda express orange it was moist and covered with a delicious orange tasting sauce. The food was amazing and even more amazing was the ability to order online. I see myself order more food from them in the future", "author": "Luis P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-05-10", "description": "This place is by far the worst Chinese food I've ever had!! The fried rice looked like mashed potatoes. It was so tasteless, I still can't get the fact it looked like that. DO NOT RECOMMEND!!! Then the orange chicken, it was almost as tasteless as the rice. On eat24, it said \"must try\". More like must pass. The beef & broccoli was horrific, the beef was tasteless. TASTELESS TASTELESS TASTELESS. When I called the restaurant, I was told that no one ever calls back to complain about the food. I talked to the manager, he 'we have hundreds of orders' & can't afford to refund or exchange the food. $30 down the drain. Makes me feel like never trying new Chinese food but I know there are places that do serve good food. Like china wok!!!!", "author": "Sabino R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-01-28", "description": "The food was dry and tasteless I called in for delivery and it took forever. On top of the they have the worst service ever! The driver was super rude and yelled at me!", "author": "Gabriela R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-01-26", "description": "The food was nasty. Egg rolls were stuffed with slimy cabbage, the \"vegetarian option\" contained meat, and everything was leaking all over the bag when it arrived at my house. Totally gross. Don't order from here.", "author": "Joni S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-26", "description": "Just ordered from here last night, it was pretty good.  We ordered the 19.95 special: Chicken Curry, Walnut Prawns and Whole Crispy Chicken.  They got here when they said they would and found my building (which is not easy).  So far, no stomach cramps!!", "author": "Tolbert J."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-01-31", "description": "I ordered chicken egg rolls and I got veggie egg rolls instead. When I called to tell them, they assured me it was chicken. WTF? I'm pretty sure I can differentiate between chicken and vegtables, but yeah thanks -.-", "author": "Elizabeth Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-05", "description": "I am so surprised by all of the negative reviews on this restaurant. We ordered (via delivery) the pot stickers, Mongolian beef, spicy fish with garlic and the egg foo young and totally loved the food. The food arrived promptly and was warm and tasty. Granted, we were very hungry but would order from them again based on our initial experience.", "author": "Diana A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-04-05", "description": "After waiting 1 hour and 35 minutes, the food was finally delivered. It was lukewarm so I'm not sure if they tried to keep it hot in some container. The wonton skins separated from the meat in the soup and the salt and pepper spareribs had lots of fat. The char siu had no flavor and was fatty.  I also did not get a receipt. I will never order from this place again. If you do, they charge $2.50 for delivery but they don't tell you that.", "author": "Teresa O."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-11-27", "description": "Is it impossible to find good chinese food that delivers?\nPerhaps.  This isn't it.\n\nHad people over, wanted to order in, and they had left a flyer.\nGot:\nSweet and sour chicken, Spicy basil beef, Beef with chinese brocolli, Chicken Chow Mein, Honey Walnut Prawns, Crab Wontons, Egg rolls.\n\nAll very sub-par, except the egg rolls, good flavor, perfectly cooked, in the paper thin wrappers, not the thick ones.  This was the only thing to  be finished.\n\nAgain, when we want chinese, we just need to head into the city to Erics. It's just not worth it to waste our time or $ on stuff we are not going to enjoy.", "author": "Mom Of Three L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-05-29", "description": "The food is not so great but delivery is available late night if your really craving so/so Chinese food.", "author": "Lloyd A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-12-23", "description": "Get their Cantonese rice noodles and hot and sour soup!!! Really good food, fast service.", "author": "Kira H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-09-23", "description": "Two bit operation. Not too bad for the price. Dirt cheep. You get what you pay for.", "author": "Evan N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-11-03", "description": "UGH. I ordered from here because I love chow fun. I was eating it and felt a hair in my mouth, pulled it out and it was like several short black hairs (about an inch ?) attached at one end. How completely disgusting, I ran straight to the bathroom and gagged for 10 minutes. WTF was that? rat hair? eyelashes? Ew ew ew ew I can't eat any of my food now, I'm so disgusted. calling in the morning", "author": "Jasmine G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-09-08", "description": "Not out of this world but exactly what order out Chinese is supposed to be.  Cheap, big portions, tasty while hot and fast!!  No idea where these guys are but they got over in 25 min and that was perfect. I had the salt & pepper tofu, spicy fried rice and orange chicken. They were all good and I'd order them again.  The portions were huge which explains my fat ass!!!", "author": "Ramon L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-06-10", "description": "If you like half eaten chicken wings, gross salt and pepper chicken, or want to catch food poisoning this is the place to order from. I ordered from Eat24 hours and they delivered. However, what I uncovered was gross. The chicken wings looked half eaten, the salt and pepper chicken did not look fresh and had a rather funky smell to it, and the Chowmein was very oily. Not only was this a heart attack waiting to happen but it was also food poisoning at it's best. After uncovering this, I contacted Eat24 where a rep called the place. They refused to deal with my complaint and simply would not come to an agreement for a refund. Since I hadn't paid with CC, they simply said that I was the ONLY person to every complain. I highly doubt that, was my response. And what came next was rather unpleasant. The person who answered whom I believe was a girl named Katie said that I was just being picky. I said, \"I will come over to you now, and I will bring the food over and watch you eat it, and you tell me if you love it\"! Yeah she didn't want that either, I can tell by her stuttering. At any rate I called the SF Dept for Health and food (I'm oblivious to their name right now), but they did call me right away. They told me that this place was closed down several days ago in connection with some food violation. WOW! Imagine this. So if I have helped you shed some light on this establishment I beg that you choose carefully.", "author": "Pamela A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-07-03", "description": "I made the poor choice of ordering from this Chinese Food Delivery Restaurant and it was awful!!!!  I ordered potstickers that were burnt and very small. The orange chicken should be called orange colored sugary dried chicken. The alleged chicken chow main had three little morsels of what could have been chicken or I hope to God it was. Then the fried rice was dried and flavorless and to add insult to injury they got the order wrong, I ordered chow fun and they sent the poor excuse of chicken chow mein. It is so sad and appalling that they are still misleading customers with their false advertisement that they take the time to deliver to the northern peninsula and San Francisco. I think they should the time to improve their food, hire a decent cook before they continue to disseminate their lousy food", "author": "Lizzie C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-01-30", "description": "DO NOT ORDER HERE ! I ordered the 3 entrees for $20 . The Salt and Pepper Chicken was the only DECENT food i received . The rice was EXTREMLY salty & it only had TWO TINY shrimp in it , i called to complain and get a refund and they argued for about 30 mins sayin they would not give me my money  * back because they didnt wanna waste gas bringing it back to me . Im extremely irritated and tried to keep my composure . Finally after making a couple legal demands , they decided to bring me my money . . I will NEVER order here again .", "author": "Myleesa F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-16", "description": "Haters are gonna hate. But I love this place. And so did my sisters. Is this the best Chinese food on earth? Probably not. But all three items we ordered for delivery to our hotel was DELICIOUS! We got sweet and sour fish, Singapore noodles (with BBQ pork and shrimp), and the best mapo tofu!", "author": "Yon S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-11-27", "description": "Good value, esp with the 3 for 19.95 plates. One of the few places in the area that delivers that doesn't serve americanized chinese. Delivered to parkside area in about 30 minutes. Looking forward to trying more Cantonese style favorites...", "author": "Amina B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-04", "description": "I don't have any idea why some scores are so low for Chef Ming.  We have been exceptionally pleased with the food. Try the Spicy Basil Beef, Black Mushroom veggies,  yum", "author": "Leon W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-02", "description": "I like this place because of the fact they use white meat in the chicken dishes, and it seems like the ingredients are of good quality. \n\nMy only complaint is the sauce and flavorings, many of the dishes are just covered in orange chicken syrup of sweet and sour sauce etc... the same sauce you get at cheap places..\n\nI did notice they have a seperate chinese menu, i will definitely have a chinese friend order for me next time and see what thats like.", "author": "Mark M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-08", "description": "We tried Hong Kong Delights at least 4 separate times using home delivery before deciding they deserved a solid review from some very happy customers.  Our food arrives almost immediately ( less than 30 minutes), piping hot and still obviously prepared to order.  Vegetables are fresh, al dente and flavorful.  Special requests to add chilis or Extra spices are always spot on.  We've been ordering takeout from all the usual suspects for years and this place seems to nail it every time.  Our advice is to give it a try  and tell them you saw this in Yelp, and want the same great experience.", "author": "Roy D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-09-22", "description": "So sad. Delivery tonight was probably the worst I have had in SF.  Food tasted of nothing.  Potstickers were a doughy mass.  Three veg. seemed like frozen reheated. Shrimp tasted like dirt. Which I realize happens sometimes. Unfortunately the shrimp were also tortured with basil stems. Big thick unchewable stems.  So sad sorry food. Im sad I tried to eat it. One star for the nice phone.", "author": "Michelle M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-08", "description": "Sometimes you just want good old fashion Chinese takeout.  The greasy, hearty and always flavorful Chinese takeout that people often so fondly talk about.  Hong Kong Delights is just that--comfort Chinese takeout food.  I got the crab rangoons, tofu mushroom veggie dish and pork fried rice.  Each order was legit, like the real stuff, no corners were cut.  Crab rangoon, good crispy texture with enough crab meat and cream cheese to satisfy yet not overwhelm.  The tofu and mushrooms? Fab.  Many places will skimp on the mushrooms but this dish had enough for me.  Finally, the pork fried rice really hit the spot.  It had good quality bbq pork (I was very surprised but pleasantly so) and the portion was generous to last me several days.  Mmmm day old Chinese takeout.  Delish.", "author": "Karen N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-05-07", "description": "Mediocre food delivered late, so lukewarm that we had to reheat it in the microwave, rendering it even more mediocre. I ordered online: mu shu vegetables (overly-salty, hardly anything but cabbage); 3-entree special of chicken/asparagus (ok), eggplant in garlic sauce  (underspiced but ok) and sauteed vegetable mixture (mushrooms good, snow peas way overcooked, canned water chestnuts); and steamed rice (hard). The website informed that most orders for delivery take 45-60 minutes. After an hour 15 minutes, I called looking for our order. I was told that it was very busy (fine, I get that), given an apology (nice, appreciated) and told the delivery person would be there in 5 minutes. Another 20 minutes passed. I was just dialing the number to cancel the order when it arrived. Lessons learned: do not order from this place; think twice about ordering online; don't pay beforehand, as it may compromise any recourse one has; always tip the delivery person.", "author": "Suzanne M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-23", "description": "This place is pretty amazing! I always order through grubhub and it always comes within and hour and is steaming hot.  Kung Pao Chicken and Wonton Soup - delicious! I don't understand the 1 star reviews.  I've ordered probably about 30 times in the past 6 months and every time it's the same and great!  Can't wait for it to get here again in about 15 minutes!", "author": "J P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-08-04", "description": "I ordered dinner tonight through eat 24: pepper steak, large rice, egg rolls, and 3 sodas.  I got 1 soda, pepper steak with no peppers, and meat that was just about RAW.  The egg rolls were sitting in about an inch of grease in the container and completely soggy.  It was a disgusting mess.  I placed a complaint with eat 24 and the contacted the restaurant, which authorized a credit for the 2 sodas I didn't receive and the order of pepper steak.  So, I was left with soggy egg rolls and a large rice for dinner.  Really?  What am I supposed to do with that?  And yes, go ahead and keep that $4 tip as well.....as I sit here....without dinner.  Never again!", "author": "Sherry S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-01-28", "description": "Great BBQ pork for for 4$ a pound delivered! Other stuff is not that great. Fast delivery at lunch time anyway. Good luck. Someone take pictures please!", "author": "Boxxxman J."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-12-16", "description": "I will give no star. I ordered tomato beef over rice, and they gave me a fried rice. I called them and the woman told me to put the order into a bowl and there will be tomato in it. However, they send me was beef fried rice and refused to even apologize. Really bad attitude and totally impatient over phone. Hope they shut down ASAP!", "author": "Jeff H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-02-07", "description": "Oh man, this place was great the other few times we ordered from them but last time I got sick from it. They are always pleasant and quick, and the food tastes great, so I'm really sad about this! Hopefully it was a fluke but I thought I should warn people.... :(", "author": "gretel k."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-01-20", "description": "DO NOT order delivery food from here -- especially if you are a vegetarian.\n\nMy housemate and I were hoping to try a new Chinese delivery place. We live in the Mission, and Hong Kong Delights had left a delivery menu on our front door. We called, placed our order, and were told a price. Then so many things went wrong:\n\n- Once we hung up, we realized the price was much too high. We called back, and they gave us a bullshit story about how their prices had just gone up -- despite the fact that they were cheaper on the menu they'd just left on our door, and online.\n\n- They also charged us a delivery charge, claiming that we were just outside their range of free delivery -- again, despite the fact that they were intentionally advertising free delivery in our neighborhood.\n\n- Given all of this price hiking, we asked them to please cancel our order. They got mad and told us the driver had already left, even though we had only placed the order a few moments before: another clear lie.\n\n- When the order got here, the portions were small and the food mediocre.\n\n- My dish, the sweet and sour tofu, had stray bits of pork in it. Not. Cool.\n\n- All three of us housemates ending up feeling sick after eating. We all had very different dishes. We don't know if our food was tampered with, pumped full of MSG or what, but it was not a fun experience.\n\nIn short, DO NOT order delivery food from Hong Kong Delights. It is not a neat, yet undiscovered gem. It is a recipe for lies and sickness.", "author": "Bonnie R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-05", "description": "This was my first time ordering from this place, and the food was great!!  Best orange chicken I ever had,  The chow mein was also great!  The service is a little long.  Delivery came as promised, though, in an hour.  And the food was not so hot, but so what, we just popped it in the microwave and it was delicious!  I ordered from GrubHub. I will be ordering from Golden Wok SF again.  :-)", "author": "Irene T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-09-16", "description": "I GOT FOOD POISONING! This food looked/tasted like it was cooked in a microwave. It was a piece of shit.", "author": "Preetman S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-12-22", "description": "They are in the ok range for Chinese food. I ordered through eat24 for delivery and 2 orders were wrong. I specifically said not spicy for salt and pepper fish and they put Jalapeño on the food, and the House Chow mein which I have ordered in the past a few times was made into House Spicy Chow Mein. I emailed and spoke with 24 online assistance from eat24 and they said somebody from restaurant was going to call me. Somebody called and said they were going to send a replacement salt and pepper fish so not spicy , but not chow mein as he said cook did not make it spicy and did not add anything - I told him are you kidding me there are red pepper flakes all over them and so after I got pissed off he said he will send the 2 dishes not spicy. I am still waiting right now for the food to be delivered. Anyway, I don't think I will be using eat24 and Golden Wok after today. I will just have to take my business somewhere else. They will not credit items. I don't know if I will tip the redelivery guy as I am still upset as those orders were for my kids, so I ended up cooking anyway for them from what I have in the fridge, which I was trying to avoid and could have done on the first place.\nAddendum, after about an hour from the call, the delivery guy came and called me to pick up the order from his car instead of going to my doorstep. I went down from my 10 step stairs to the street and he got out of the car to give me the food. I was going to give him $2 for the redelivery but changed my mind when I had to go down and get the food on the street and skipped the tip. I gave the first delivery guy $5. That's it never again from this place.", "author": "Jose D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-18", "description": "very good food...fast delivery...I recommend ordering online, because ordering on the phone seems to cause confusion. but nevertheless, I am satisfied.", "author": "Makana Y."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-10-11", "description": "Nasty worst resturant ever. Do not order from this place. I ordered the tomato egg there was like barely any egg just a soup of tomato sauce...The potsticker was nasty not taste, looks and taste like straight out of the freezer. The curry chicken was average at best. Our rice was the only good thing but then again how to mess up rice lol. The snapple.... it was an opened one and someone drank 1/4 of it...Never again wanted to throw up, should have just starved and ordered in the morning lol.", "author": "Eddie K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-11-01", "description": "Nice place. I was kinda skeptical at first cuz its a hole in the wall and it looks like shit from the outside. Once inside though, its pretty decent. The food was decent, nothing to get too excited over. Id probably eat here again but only if I coujldnt ind something better or closer.", "author": "Erik S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-08-09", "description": "What's wrong with this place? I got yell at by the deliver driver couse I didn't pick up his call for deliver! I already wait for 1 hours for the food already and still need to face this sh*t!! This place can go F**K yourself! Never will order from here again!!!!!", "author": "Kevin C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-04", "description": "Delivered all the way to potrero, quickly. Very good value. The fried rice and chow mein basically taste like Panda Express if that's what you're looking for late at night!", "author": "Alex R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-05-19", "description": "We have yet to find a Chinese restaurant we really like that delivers to our neighborhood (Westlake), so when a new menu was slid under our door this week we decided to give it a try.\n\nThe phone order experience was good. It is nice to not be put on hold forever and have to repeat everything you say three times. THey accept credit cards by phone, and the food arrived hot and ontime (in 30 min on a Sat eve).\n\nThe crab rangoon was adequate; the potsticker about the same (why are they always so doughy in this town?).  The moo shu beef was also pretty uninteresting. While the fried rice was free with a $20 order, besides the chicken and the rice, there was little else in the dish.The star was the salt and pepper chicken wings; thus the 3rd star.   Lot of meat, just the right amount of coating, juicy, with a mild heat in the background. That one I will definitely go for again.", "author": "Tom C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-04-28", "description": "man! make sure you read ll the fine print on the throwaway menu. they wrote it up with alot of hidden clauses. And they don't open till 2am, they close the doors @ 10. delivery only till 2. ordered anyway, since nothing is open after findind that out. haven't eaten their food, will post on anther review after i eat it. how can u in this day & age try to nicle & dime you to death on all these fine print cheats?\namendded review, I have alittle to add after my first post, the drive is kinda of goofy as to finding his target, he called & i asked him where he was, he said outside, i said ok & opened my door looking for him, he was parked 5 houses up the block, he hasn't learned that he should find his house/apt before parking his car, some advice he could use! after fuming about their hours & tricky ass menu, my order arrived. i have to say for a restaurant that opens till 2 am (delivery only after 10) pretty good food & w/o MSG! Just read the fine print/ call with questions stated in my post! To the guy who said he was charged $2.50 for delivery, I was worried so we called & yes it doesnt state that charge but it does say within 4 miles, no charge, they do a mapquest on your address & they know exactly what the mileage is. Go For It!", "author": "david c."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-03-17", "description": "I went out to get a burrito at Ethel Mae's, but upon getting there found out it was closed. Rather than trying my luck at Diala Pizza which never looked good or trying to catch the M somewhere else I wandered down Randolph St. hoping to find somewhere else to eat. While I'm new to the area I've walked down the street before and Randolph is pretty lean. Aside from the Ocean View library and the occasional convenience store there isn't much there aside from houses. Reaching the end of the street at Orizaba I was thinking about my next move and wishing that I'd just gone over to Mission instead where at least I'd have a chance to find an alternate when, upon turning the corner I found a Chinese place with a Grand Opening sign up. Taking this as fate (or more likely, a convenient coincidence) I decided to try it out.\n\nI tried the Orange Peel Chicken and my girlfriend got the Vegetarian Delight. Both were pretty good, nothing really special, but good enough for a neighborhood place. The Vegetarian Delight had a light sauce with a strong note of ginger that didn't overpower the vegetables. The Orange Peel Chicken was crunchy and spicy, not as much orange flavor as I like, but I've always been partial to the horribly Americanized style that comes drenched in syrupy sauce (i.e. Panda Express).\n\nAll in all it's a decent enough spot to stop in if you happen to live in the area already. There's a dearth of restaurants nearby unless you head over to Mission or up to Ocean Ave. or West Portal. There's also delivery with a $10 minimum.", "author": "Mark S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-11-10", "description": "Okay I just moved into the silver terrace neighborhood and as I came home from work, this big menu was on my grill.  I knew that I'd be ordering food somewhere but I didn't want to drive to pick it up after I had a couple of beers.  Low and behold I gave this so called restaurant a call.  I ordered the 3 item special, pepper steak, basil spicy prawn, and pepper fish.  So I gave a generous 2 stars for the price and the as promised 45 minute delivery.  The food was terrible.  I didn't get sick from it it just lacked taste and the quality was poor. The fish was chewy, the beef was so overcooked it was like jerky.  The so called prawns (small size shrimp was the frozen kind) was watery and again no flavor. I cannot understand how a place stays in business with quality of food like this.  They disguise there name as \"chef Ming\" with the golden wok in tiny print .  I don't think this is an actual restaurant that you can pick up, I'm certain it's a shady residential house that doesn't even carry a biz license.  They should get audited, need to pay taxes like everyone else.  Overall, skip this place by all means.", "author": "Pedro N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-12-14", "description": "BEWARE!! This is golden wok, read golden woks reviews for a more information.  This place is bad.", "author": "Patrick F."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-09-18", "description": "Terrible.  40 min delivery promise on a Sunday afternoon took 1.5 hours to Noe Valley.  Who the hell makes salt and pepper prawns with the full shells on so you basically peel away all the salt and pepper and shells and have left mealy shrimp with no flavor and greasy hands.  Chicken fried rice should look brown not white with anemic eerie white chicken pieces  inside and obviously veggies from a frozen packet.  Throw away the menu they left at your door and hope they never deliver another one.", "author": "Matt W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-05-28", "description": "worse chinese restaurant ever!! not only that but the service is awful!! i will not be eating here ever again. i hope they get shut down", "author": "Matthew O."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-10-07", "description": "While I do love the vegetarian chow mein from this place I can definitely say it is not at all worth the trouble I went through to get it. My roommate and I ordered food from their place and first off it took them an hour and a half to deliver our food and that too because we called them an hour after they said they would be here to see what happened. They then proceeded to say oh we'll have your food their in 15 minutes. Then when I got my food I saw they had given me a chicken chow mein instead of a vegetarian chow mein(honest mistake right?). I thought so, so I called to let them know of their mistake and ask for them to replace my order(BAD IDEA!!), they refused to bring me a replacement dinner because their restaurant was \"too busy\"(um hi then don't have a delivery service), they offered me a store credit instead. While I was upset because I clearly still did not receive food I thought it was nice of them to give me some sort of compensation but it sadly does not end there. I called the next day to order food and discovered that I had only received a $5.00 compensation for a meal of $6.50. They said that there boss only lets them give a $5.00 compensation for all meals and i had to pay $1.50 for the meal they gave me the next day. WOW HORRIBLE SERVICE OR WHAT??? I know the food is not worth all that hassle. I now paid an extra $1.50 for food that I should have received the day before and still waited about an hour the next day to get my food.", "author": "Joan C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-04-21", "description": "Our order was confirmed for delivery in 45 minutes. Then we received an updated delivery time 15 minutes SOONER. After an hour (30 minutes after the revised delivery time) we contacted GrubHub Support. They contacted the restaurant and told us it would be another 10-15 minutes due to the weather (light rain). Finally, an hour and forty minutes after we ordered the food arrived lukewarm. Adding insult to injury, the food wasn't good before it got cold so by the time we got it was almost inedible. We through out most of what we ordered and I went to sleep hungry.", "author": "Jacob W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-11-11", "description": "im not sure whats worse  the chinese food or the pizza..neither are delightful", "author": "Kim R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-14", "description": "Seriously the best Chinese food I've had in a LONG time. Saw the flyer on my gate a few days ago so I thought why not give it a try and I called. Got the three for $19.95 and we got house chow mein, kung pao chicken, and honey walnut prawns. Most delivery spots have really shitty kung pao so I've basically given up, but 45 minutes later when it got to my door I devoured the whole damn order in one sitting. It was ridiculously good. No peanuts like most kung pao but I hate peanuts so that was a plus for me. Then tonight we decided to order again. We got the kung pao (obviously), as well as the beef with Chinese broccoli, and sweet and sour pork. Egg rolls, too. I've never liked sweet and sour pork but I tried my moms order and it was actually good. The beef with Chinese broccoli was super flavorful and the beef sauce wasn't thick and slimey like a lot of other places make it. The egg rolls were crispy and awesome but they were kinda oily so that's my only complaint. After laying them on a paper towel they were great though. I seriously don't understand the negative reviews because my prayers have literally been answered for a new go to spot!!!", "author": "Melissa C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-12-26", "description": "Worst customer service ever.  (Not surprised to read review citing worst sanitaion standards ever.  Or to see from the new menu that they now only do delivery and have changed their name based surely on so many bad reviews--now \"Chef Ming,\" so beware.)  They completely botched up our delivery order, which took an hour and 15 min.'s to deliver, and when I called them to tell them that I had not been able to eat much of it because of their multiple mistakes and to ask for a refund on the dishes that had not arrived, not only did they not apologize, but they kept arguing with me and passing me on to other people, saying, \"Oh, that wasn't me,\" or \"Well, it says here you ordered something else, so I don't know what happened\" (no comment on the one that was at least written down correctly.)  Finally I was told that I could be refunded on the appetizer only (egg rolls arrived instead of pot stickers) ONLY if I RETURNED the egg rolls!  (I had already explained that my toddler also was unable to eat much--it wasn't just me, the pregnant woman.)  At this point it was all I could do to tell them that they're horrible people and hang up.  I don't know how they've managed to stay in business in SF, but they shouldn'e be.", "author": "Rebecca C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-12-18", "description": "my regular place, Crazy Pepper, was closed so I tried these guys. no flavor.  even the szechuan spicy chicken was bland. truly disappointing.", "author": "damiana s."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-19", "description": "I've only ordered delivery from here. Good Chinese food, not too greasy, big selection, big portions, inexpensive, no MSG, and they deliver. I dig it.", "author": "Lisa M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-09", "description": "wow i'm impressed. not only do i love their late hours, but the quality of their food is really good! and i ordered special instructions (less oil, not spicy at all) and they did it so well. the fish is like the best i've ever had! #39 fish filet w/bok choy. incredible. and the chicken for the kung pao chicken is totally high quality.", "author": "Tornado G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-03-22", "description": "This place is great!  Totally tucked away behind sfsu, for when I don't wanna drive and deal with parking they deliver free!  The food is standard Chinese food but done with less oil than usual. I really enjoyed the walnut shrimp and BBQ pork here.", "author": "Ben C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-09-14", "description": "My girlfriend and I both really enjoy this place. It is a small little place off all by itself and I assume it is family run. The food is quite good and up to par with most of the other stuff in the immediate area and more reasonably priced as well. Additionally, the people who work there are super nice and very polite. Quite good service. We would definitely recommend.", "author": "Clay N."}
