{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-05", "description": "Bison are cool looking but poor conversationalists. They tend to be aloof. Some are good dancers.", "author": "jeff e."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-10", "description": "Also called the Bison Paddock. \n\nIf you have extra time this should be on your list of things to see in Golden Gate Park. This Bison range is visible from the road. Although not as close as Yellowstone, the views of the animals are cool. Touching or feeding us not possible and not allowed. \n\nThe easiest way to get here is with a car. Parking is available on the street. You could also bike here. Or walk if your coming from Ocean Ave.", "author": "Alan H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-15", "description": "Golden Gate Park is full of little pocket gems like the Shakespeare Garden and magical, grand swaths of green grass and trees like Hellman Hollow. \n\nAnd mystically, a Bison Paddock!\n\nI purposely took the long way across town through Golden Gate Park to the outer Richmond and reveled that we're lucky to live in such a beautiful city with its green, undeveloped expanses and quirky things-\n\nLike Buffalo. In Golden Gate Park. \n\nIt's kind of crazy and a little cool, much like its residents.", "author": "Jennifer O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-02", "description": "One of many gems at Golden Gate Park is the bison herd just north of JFK Drive and in between North Lake and Spreckels Lake.\n\nThe herd was originally established to preserve a feeling of the wild West here in what was then the developing West Bay, especially at a time when bison were being decimated. The current 6 bison, however, do not descend from the original herd and are instead a newer generation of chill, laid-back females, as males tend to get a bit randy during mating season. They usually won't go charging at you like the ones at Yellowstone unless you provoke them, so go ahead, watch, and snap pics from the sidelines.", "author": "Vincent L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-30", "description": "Well worth a visit if you're already in the western end of Golden Gate Park. Just check the map closely, and don't be too disappointed if all the bison are far from the fences; just plan a return visit and hope for better luck.", "author": "Carl B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-08", "description": "cool view and hella interesting that there is bison in SF!", "author": "Jray M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-03", "description": "I love all animals, so sitting on a bench watching the bison, birds and gophers poking their little heads through their gopher holes was a treat for me.  The gophers might be quite destructive, but they're so damned precious.  This part of the park is also quiet and peaceful.  It's a great place to stop and take a nature break.", "author": "Teresa L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-05", "description": "REVIEWER # 113\n\nGolden Gate Park? Bison's? Yes, put two and two together and there are bison's at the Golden Gate Park!!\n\nEvery time I come to this park I always have to make a stop to see these herd of real live bison's that reside in the G.G. Park!\n\nI do a couple of events at this park such as marathons and AIDS walk. After I trek around a few miles at this park and I start getting tired I start losing hope that my car is too far away and I may not make it! Whoa, but once I turn that corner my face glows as I look up and see the massive bison right over the fence. It is always such an awe moment for me as many times they are so close to the fence that it makes the view THAT much amazing!\n\nDID YOU KNOW: The bison's have been at the GG Park since 1890! This was when the park commission brought the first of them from the Great Plains where there were only about 1,000 bison's remaining! The last of the old bison died in late 2014, and now only younger bison remain. There are currently only female bison in the herd. They are taken care of by the SF Zoological Society.\n\nYou can find the bison's near JFK Drive near Chain of Lakes Drive! They are not at all active but I have to be honest that it catches people's attention once they see it because bison's are the last thing you would think to see at this park!\n\nREVIEW 104/196", "author": "Porsche C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-06", "description": "\"Oh, give me a home where the buffalo roam,\nWhere the deer and the antelope play,\nWhere seldom is heard a discouraging word\nAnd the skies are not cloudy all day...\"  \n\n-- John A. Lomax (1910)\n\nWhen I saw my friend, Alana's, check in, I couldn't believe it!  Bison at Golden Gate Park?  In all the years that I have visited San Francisco, I hadn't known about this phenomenon!  This was on the top of my list of things to see!\n\nOne misty, overcast, and chilly day in March 2016, my cousin, Marilyn, and her husband, Philip, drove my Travel Buddy, Yuri, and me through Golden Gate Park to see the Bison!  Woot woot!  They were out in the pasture, calmly nibbling at the lawn!  \n\nIt's so amazing!  I want to visit them again!  There's free parking along the street and no admission fee!  Let's go!", "author": "Nadine C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-13", "description": "A very fun, clean environment to visit with the family, especially on a sunny Saturday morning. My father and grandmother used to take me to see the bisons when I was a child, and I have very fond memories of it. Sometimes you have to look hard to find the bisons, and other times they are everywhere! During the summer there are equestrian policemen and women who gallop in the park, sometimes giving children police badge stickers and taking pictures with them. It's also a great place to sit on the benches and eat a sandwich, but beware of the (rather aggressive) geese.", "author": "Jenifer J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-15", "description": "Real live bison just chilling in San Francisco, how is that not awesome? Totally worth stopping by to say hello.", "author": "Nate C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-07-14", "description": "July 10, 2016 Sunday at 3 PM \n2 adults and a kid\n\nAtmosphere - 2 stars\nAnimals - 3 stars\n\nYes a 3 which is Just Okay.\n\nBackground - How cool is it that Golden Gate Park has bison.  I think I saw this with one my Yelp friend's check-ins or it was the ROTD for the day.  But I got my interest peaked as bison are such amazing animals.  Their size and beauty is special.\n\nAtmosphere - Best part it is free, and parking was not much of issue in this area of the park.  It is a good size pen which we saw six bison.  The grass was tall and dying.  So the bison all lying down in the tall grass blended as if they were in the plains of South Dakota.  Take some binoculars to get a better view as the area goes back a distances.\n\nAnimals - We saw six, one that actually walked into another corral out of view.  \n\nFuture - Probably not.  Living in North Dakota I had a bison farm walking distance from my dorm room so it was an everyday occurrence.  Living in Reno I have a bison farm about two miles from my house as I live on the edge of the city.  I was hoping for a better setting than a farm.\n\nBison are just cattle but that fact they are in a major city is cool.  An experience most people do not get when living in such an urban area.", "author": "Paul S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-11", "description": "Crazy to think there is​ Bison in Golden Gate Park! I recommend visiting.", "author": "Richard M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-09", "description": "BISON IN SF. Must see. They are enclosed in a large area to graze in. Friend said there was more when she went a while back, there were about 6 when we went today. Cool spot to drop by and check out while in the SF Golden Gate Park which offers many other great places to see: Japanese tea garden, california academy of sciences, museums, lakes, biking trails w/ rentals, botanical gardens, etc. Free parking in the park, usually 4 hours maximum time limit.", "author": "Wendy T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-20", "description": "So, Bison in GG Park?\nWho knew, right?\n\nEvery time I told people about it - they never believed me.\nBut yes, yes - There is a place where the Bison's roam in Golden Gate Park.\n\nWe went on a Saturday so I would think it would be the busiest.\nThere is street parking right by the fence & tons of it!\nThere are also benches that you can sit on & watch the bison.\n\nThere are gopher holes all over - we saw a gopher while we were there! \n\nThere is a little information plaque on one side - very informational. I was trying to see if there was the exact number of bison in the park but nothing.\n\nThe bison just graze - very interesting to see that this is located in Golden Gate Park in San Francisco.\nI think you should check it out - sort of like being in a zoo (not my fave - if you know me)", "author": "Camille C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-15", "description": "Hard to imagine that there were millions of these beautiful beast that roamed the heartland of America roughly a century and a half ago. Now we are lucky to see 6 cooped up in a pen in Golden Gate park.\n\nStill it is an awesome place to visit and when the Bison are out it is really cool. Please keep your dogs on a leash as one startled a baby Bison and caused the death of it.\n\nIf you are in GG park definetly head over to the Bison!", "author": "David G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-13", "description": "Fun place to go explore. Try to find the hidden water falls. They are all around Golden Gate Park. It's a magical place", "author": "Kayla G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-09-06", "description": "My out-of-town guest and I were exploring Golden Gate Park and she noticed on the map that there are bison. We went out of the way to the area they roam and walked over to check them out. Maybe they were all napping or they were too busy for us. They were all so far away and most of them were in a barn. Only one was close enough to be interesting to look at. I was hoping for more but for a free \"attraction,\" this isn't a bad way to kill a few minutes for your time.", "author": "Yi Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-21", "description": "I've always heard that there are bison in Goldengate Park, but had never actually seen them. Today we made a special trip to see the bison (located in bison paddock). There were six bison visible on the day we visited. It's a quick stop to look at the animals and read the informational placard. There's only one exhibit so it doesn't take long to visi, but the surrounding park is beautiful and there's plenty of free parking. There are also walking trails along the fenced enclosure and biking paths. (3 stars for the bison exhibit, higher stars for the surrounding area)", "author": "M D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-27", "description": "One of the many great things about Golden Gate Park. We saw about 5 or 6 bison roaming around here. There are placards with information about the paddock.", "author": "Carrie L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-18", "description": "It took me a long time to find them.  I had seen that there were bison in Golden Gate Park and I wanted to see them.  So on trip after trip I hiked either up or down the park looking.    Finally one trip I found them.\n\nThat first sighting they were on the far side of their pasture.  Since then I have seen them closer up.   They are big!\n\nIt is cool that  San Francisco has them.    Bison were an important part of the history of America and this is the only bison I know of that you can see in a city.    Very cool.    \n\nBy them selves it might not be worth finding them,  but they are in Golden Gate Park.    I always come and walk around the park anyway and they make a great stop on a park hike.", "author": "Mark B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-07", "description": "\" I thought bison were extinct\"-my boyfriend\n\"The eductation system obviously failed you\"-me\n\nEmbarassing but that's truly what he said when I first took us to this spot. That being said, once here, we found it extremely enjoyable to take a gander at these guys-they are pretty magnificent. A few times we've arrived around feeding time and they are patiently gathered while the keeper sets up their trough. We were there recently right around noon and got to see them up close. Other times they were spread out further back. If you bring binoculars, or just curb your expectations, it's a lot of fun.\n\nPretty easy to find off JFK Drive if you're coming from Ocean Beach. A few times we parked near Sutro Heights Park, walked around there, then headed towards the Windmill and then made our way through the park to the Bison Paddock. Definitely an enjoyable and not too challenging of a walk. It's free and wonderful.\n\nNot sure what else there is to say, except HOORAY!", "author": "Jennifer N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-10-03", "description": "Bison have been at Golden Gate Park since 1890 when a bison cow (named Sarah Bernhardt) and bison bull (named Ben Harrison) were transported from the rolling Great Plains. They started transporting more bison to the Park until there were 30 bison in 1918. Unfortunately they then had to deal with bovine tuberculosis and many were transferred to a different location. When I went to see them I could only spot a total of 6 bison.\n\nWhile there is nothing all that exciting about watching bison just graze or walk around or sometimes run, it's still pretty cool to see them roaming in their paddock. And they can move pretty fast! They ran around a couple of times and it was pretty cool to see. Apparently they are able to go up to 30mph.", "author": "Esther K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-26", "description": "How does this not have five stars? Are you serious - They have real live Bison! \n\nNow according to the locals we were really lucky to be able to see two of the Bison so close. They were in the shady area right next to the fence! Since we were so lucky in seeing the two Bison and snapped a couple of photos. We stayed here for about ten minutes.", "author": "Mallory E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-31", "description": "Where else can you walk up and view some bison - for free to boot! The hubby and I were driving through SF on our road trip. He mentioned going to see the bison. We stopped, parked (ample parking), crossed the road, and saw the bison from a distance. Just amazing they are located at this park. The hubby looked up some information and found that the bison are taken care of by the SF Zoo. Nice 5 minute visit and off we went to look at the windmills!", "author": "MrnMrs G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-23", "description": "Once you are nestled inside Golden Gate Park, it's hard to remember that you are in the middle of a major metropolitan city! This is an amazing beautiful part of the park that seems overlooked by those wandering around the massive expanse in the middle of the city. \n\nWe parked across the street from the placard outside the paddock, which is the only indication that anything is behind the fence as all of the bison were in one of the back pens. We walked along a sand path that ran alongside the fence and after a short distance, started to make out the outline of the massive beasts among the grass. We were among three other people, all of whom were in the same group, and were pressing their phones against the chain link fence trying to get the best picture of the bison. One kid tried to scale the fence and was met with a slap from good ol' gravity. Not too surprising, the bison were not bothered at all by the human presence although there was quite a distance between the outer fence and where they were located.\n\nOn our way back to the car, the husband decided to walk along the opposite end of the paddock from whence we came. Mistake! The other path was significantly longer as it stretched along the back and side of the paddock which is quite massive- so they are not pinned in a small enclosure as they would be in a zoo. We were walking the dogs who became increasingly exhausted and I ended up carrying our little one back to the car. On our long loop back to the car, we passed by a dog park and public restrooms so if you are in need of either, turning right at the paddock is the direction for you. Make sure you wear appropriate shoes- you will get dirty between the dirt and sand from the trail and if you take the long way back to your car, comfortable shoes are a must! It was a lot of fun and was the first time I had ever seen bison in the flesh.", "author": "Nicole I."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-10", "description": "And finally too, I saw the Golden Gate Park Bison!  It was interesting to read the history of them as they were brought here to stimulate their population as the number of bison were dwindling to almost nothing in the late 1800s (if I remember the year right).  Their numbers are much better now thanks to this program.  In fact, one of the bison tried to mount the other while I was there so they were trying to increase numbers right in front of me LOL!  They seemed quite tame and content, enjoying the Sunday sun after it had rained the day before.  Happy bison!", "author": "Maile N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-24", "description": "Once upon a time, I went on a date at Golden Gate Park with my then-boyfriend.  He was driving and I was staring out the window.  Suddenly, I did a double take and said, \"Whoa, I think I just saw some bison!\"  The following dialogue then proceeded to take place:\n\nBF: Um, what did you just say?\nMe: There are bison in this park!\nBF: Uh, yea, there are no bison in San Francisco.\nMe: But I just saw some back there.  Let's turn around!\nBF: No no no, you probably just saw some horses.\nMe: I'm.... pretty sure I know what horses are supposed to look like.\nEX: Maybe you're just seeing things.\n\nIt only went downhill from there.  That conversation haunted me for the longest time, until I stumbled upon this Yelp page dedicated exclusively to the GG Park Bison.  Hey ex-bf, if you're reading this, I TOLD YOU SO!\n\n5 stars for the vindication.\n\nYou go, bison.  Keep bein' real....", "author": "Alice C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-17", "description": "The bison don't do much. They just seem too grazed or rest in their paddock. I did not spend much time watching them. Still, it is a worthwhile stop to see these magnificent animals that once roamed the plains in large numbers. \n\nTheir decline is written in many books. The chance to see them in an urban area like San Francisco it a treat", "author": "Terry T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-31", "description": "They're giant and majestic and it's free!  Not your average city park.", "author": "Phillip N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-09-08", "description": "I am fascinated with the Bison paddock.  Although not much goes on, these creatures are mesmerizing. It's reflective and transports you to a piece of the Wild West that  you otherwise would not experience. These creatures move slowly behind the protective fence. Deceivingly so, as they have been reported to be able to run up to 40 miles an hour.\n\nThese are among the last surviving species of the American Bison or Buffalo. The park has a successful breeding program which has contributed more than 100 calves to the remaining 200,000 North American Bison population.", "author": "hayley t."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-02-21", "description": "Oh, give me a home where the buffalo roam \nWhere the deer and the antelope play \nWhere seldom is heard a discouraging word \nAnd the skies are not cloudy all day \nHome, home on the range \nWhere the deer and the antelope play \nWhere seldom is heard a discouraging word \nAnd the skies are not cloudy all day... \n\nI wonder if these bison know about the Bullshead Restaurant in West Portal. My friend Maggie and I were taking a less-than-brisk walk through Golden Gate Park last weekend when the weather was very nearly perfect. As we passed by the cement pool that is Spreckels Lake, I was starting to get worried that they would stampede knowing that I have enjoyed eating a buffalo burger at Bullshead. \n\nWhen we walked past the paddock on our way to the Park Chalet, we saw them lounging way in the distance under the shadow of a mammoth tree. Ah, the drawback of natural habitat areas is that they naturally habituate. Coming back from our minuscule burger at the Park Chalet (just beef, not buffalo), they were up close and grazing as a group (see photos). Much better though they couldn't be bothered by the gawking families strolling and cycling by. \n\nSince there were only five head in the herd, I wouldn't expect a replay of \"Dances with Wolves\" here. No, that would be \"Avatar\". Let's just hope the Park or Beach Chalet don't start serving Buffalo Steak Bearnaise on the menu. Or else it will be one empty field with a lot of petrified manure. By the way, for old movie trivialists, that's Ralph Bellamy and the crush-worthy Irene Dunne singing \"Home on the Range\" from the classic 1937 (yes, 1937!) screwball comedy, \"The Awful Truth\". Respect, kiddies.", "author": "Ed U."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-09-24", "description": "Bison in SF!  Crazy as that sounds we found it!  It's in Golden Gate park and not many people know about it.\n\nWe were looking for it and asked some pedestrians and they gave us a super puzzled face.  Then we saw the fencing for it so they must have walked by without even noticing them!\n\nWhen we were there they were resting pretty far away on the other side of the padlock but it was still cool just to see them!\n\nThe Bison are native to SF and its great to know that they are being preserved!", "author": "Esther S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-22", "description": "Take your out of town friends/ family here. No one will believe you when you say \"lets go watch the buffalo roam in the middle of a city\". SF is the only city (that I know of) to have a mini buffalo enclosure within a park. If you live in the Sunset or Richmond easy location to walk the dog to (there is even a dog park behind the buffalo enclosure) or walk your human friend to. Everyone likes to look at small buffalo and most people could use more exercise. Then you can go get some bison burgers and think about all the great things about buffalo - such as taste!", "author": "Catherine H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-29", "description": "Loved the Buffalo Park. Reminds me of Buffalo Rock State Park back in LaSalle County Illinois. I was watching Dirty Harry movie,  where he chases down the serial killer Scorpio circa 1971 and they clearly show this same Park near the end while in the the high-jacked school bus with 7 children inside.", "author": "Aric S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-09", "description": "I drove by once and one of the Bison was running around all crazy with his tongue hanging out. He ran from one side of the paddock to the others, did a little dance move, and ran back again. This happened for about thirty minutes. Then he went back into the shade like nothing had happened. \n\nYesterday we came to visit the new tiny bison. They were hard to see but I had a huge zoom lens so I snapped a couple good photos. The tiny bison are adorable.", "author": "Jordan P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-20", "description": "Given buffalo and bison have all but gone extinct in America it's pretty neat to be able to visit live bison right in Golden Gate Park! \n\nThere's a nice enclosure for them so you're not guaranteed to see them right up close but if you go regularly you may get lucky. You can even walk around the back and get a better view sometimes.\n\nThere's also a nice-sized herd, I want to say approx. 8-10 bison?\n\nBeautiful creatures and always fun to swing by and take a look.", "author": "Allison R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-13", "description": "Very cool to see bison in the park here. The park was a nice little oasis to escape the hustle and bustle of downtown.", "author": "Elizabeth F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-07-18", "description": "Live bison in Golden Gate Park; pretty cool.\n\nIf you are nearby definitely stop by and see the bison. However they don't tend to be very active so staring at them for more than 5-10 minutes can get a bit boring. Still cool that they have their own enclosure though!", "author": "Sam F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-26", "description": "YAY FOR BISON. \n\nI was really excited when I heard about these bison. I went to go see them when I could've and let's just say, I was kind of disappointed. There were about 6 bison roaming around the area and they don't do much. I waited a while to see if they'll do anything and they didn't. They were pretty far from where the people can see them, so that was kind of a bore. I would recommend people to come here to see them, but tell them to make sure to have other plans afterwards because you're most likely not going to stay long.", "author": "Vernice T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-02-09", "description": "As excited as I was to see the bison, I was sort of sad to see that from my view the would be only be the size of my palm or so depending on how far I went around the pad. This is definitely a cool thing to check out if you happen to be at Golden Gate Park. The bison seemed to be just chillin and rather calm when I visited. I'm happy to see that the bison have a considerable amount of space to roam.", "author": "Tammy T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-31", "description": "It's pretty surprising to see bison roaming around in the middle of Golden Gate Park.  (They are fenced off, no worries)\n\nMost people don't seem to come this far into the park nor do they stay too long, so parking wasn't an issue.  If you're an animal fan, it's pretty relaxing to take a seat on a bench and watch the bison sleep, chomp on grass, or just mosey on along in the field.", "author": "Jennifer A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-30", "description": "At first it was a little underwhelming I will admit. I guess I was expecting to have a Dance with Wolves moment where the ground is trembling before I spotted my first bison. It seemed odd and out of place  to see 6 bison laying over in the far corner  of man's constructed confinement but then I thought to myself \"don't get caught up in that\", think about the opportunity. I will admit, I hate zoos with a passion so why should this be any different.  What was different though was, I thought about how this was probably my only chance to see these creatures up close and after all I am a U.S. History major and have read and heard time and time again about the beauty  of these great creatures so maybe I should count myself lucky to gaze upon them as they ruminated in the sunlight awaiting there 6 o'clock feeding hour. I mean who am I not to find them significant? They were after all sacred to Native Americans and became nearly extinct. In the end I can to appreciate the Bison Paddock as a small ode to these lords of the prairie, the Wild West's welcoming committee, and the importance of trying to re-build America's once great bison herds.\n\nBison are a strange looking creature-they remind me of some creature you would read about in Greek mythology with there skinny little legs and huge heads and yokes with lion tails. All and all maybe seeing the bison isn't for everyone, but I thought it was pretty cool, maybe it was the sunlight shining in one their green pasture, maybe it is the novelty of bison is San Francisco. Anyways it is free so why not make a quick stop if you are already in the area.", "author": "Sabrina D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-19", "description": "I'm a little confused by the Bison having poor reviews for being boring or sleeping a lot.\n\nHey Bison,\n\nFive stars for being animals!\nFive stars for doing what you do (standing,walking,sleeping) so well!\nFive stars for being shaggy!\nFive stars for being quadrupedal!\nFive stars for still being on the planet!\n\nGreat job all around, guys!", "author": "Torey B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-05-10", "description": "Crazy bison! These guys are so WOOLY and awesome!\n\nMake sure to stop by and check them out!", "author": "Liza P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-27", "description": "Where the wild things are.\n\nMaurice Sendak probably wasn't thinking about Golden Gate Park.\n\nBig field. Big fence. Big bison.\n\nAwesome eclectic addition to our awesome and eclectic city.", "author": "Jason B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-24", "description": "Be patient. Bring binoculars. It's very zen to watch these creatures.\n\nAnd if you can, try to catch their lunch time when they will surprise you with zest.\n\nWatchers -- A FAVOR -- please consider that others have come to enjoy this and don't shout (really the parents were worse than their kids) or bounce the fence like crazy. Be respectful.", "author": "Ziggy J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-06-29", "description": "Finally went to go see the bison! It's pretty awesome that we have bison living in the middle of the city. Their paddock is actually pretty large so you might have to do some walking to figure out where they are hanging out. It was fun to see them, but a bit underwhelming.", "author": "Kate D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-08-22", "description": "I specifically go to the Bison Paddock in Golden Gate Park specifically to go to the Bison Paddock. None of this \"happened to pass by and there they were,\" or \" the other day I encountered a pleasant buffalo-like surprise\" nonsense. The buffaloes themselves warrant an intentional trip.\n\nThe Ancient Bison Paddock (circa approx. 5 months ago when I first went there) began with about 3 large buffaloes, roaming about, consuming grass. This paddock later transformed into a paddock ruled by many, smaller bison; however, despite the various political and social changes that occurred, these smaller buffaloes still maintain their general charge of roaming about, consuming grass. \n\nThe ultimate fate of the ancient 3 remains unknown to this day. Minus 5 from 10 stars then, Bison Paddock.", "author": "Julie N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-12-09", "description": "What kind of pathetic crotch rocket would rate a public park stocked with a bison adventure zone less than five stars?\n\nThree stars because the bison are boring? If you write a review of bison on the internet YOU ARE BORING.\n\nAnyway, I give the park bison five stars because it was clear that the creators of the bison enclosure only did so to help members of my generation remember the hunting screen from the Oregon Trail computer game.\n\nI wish my parents loved me", "author": "Ryan L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-22", "description": "This is probably the most unique thing that I've ever seen at a park in my life.  As an animal lover especially, this was one of my \"musts\" when going to Golden Gate Park during my trip to San Francisco over the summer. When I was there in the middle of the day, the bison weren't too active, but I still enjoyed seeing them. If they want, the bison can come right up to the fence and be very close to you. I read that the San Francisco zoo maintains and cares for the Buffalo Paddock here. Overall, I recommend checking out the bison even for just a few minutes because of the uniqueness of this.", "author": "Michael G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-12", "description": "An utterly random quirk of Golden Gate Park. Fun to watch the bison...for 5 minutes. But seriously, when do you get to see live bison?", "author": "Elizabeth L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-09-01", "description": "They're REAL in SF! I remember always hearing stories about them in San Francisco, but somehow I never believed it.  I forgot about it for a while, until I was cruising down (today) with our group of USF students biking through the GGP.  I looked right and saw a big field and tiny 'brown furry dropping' things in the distance.  I got closer and closer then to realize that they were Bisons! I was ecstatic! They were in the distant part of the park just resting in the nice morning grass.  It definitely added on to the GGP's list of awesome reasons for people to come! We had the chance to stop for a bit, but had to go.\n\nNext time I will definitely hang out a bit longer and see if I'll be lucky enough to have them approach us!\n\nThanks Bisons for a cool day!", "author": "Lisa L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-06-21", "description": "This review is dedicated to my DAD on Father's Day!  The best dad in the world!\n\nhttp://www.yelp.com/biz_photos/aBXHGZmzSnskDjEITdrwoQ?select=hUk6-epf03sdfQIuFetl7A\n\nhttp://www.yelp.com/biz_photos/aBXHGZmzSnskDjEITdrwoQ?select=fOYPlUMtrLYf8eEjq8n8Bg\n\n\nI stopped by  the Bison Paddock with my 75-year old dad and much younger mom at 65 while visiting the Golden Gate Park.\n\nThere's something about the bisons that always make stop, park my car and just stare at them for few minutes or so. It must be their gentle beauty -- powerful yet calm. They don't do anything but  just gently graze on the peaceful green Golden Gate meadows.\n\nMillions used to freely roam North America centuries ago but they were hunted for their meat and fur.  They almost became extinct.  Now there are about 200.000 in existence all over United States.\n\nI was just thinking, nature, just like our loved ones, should be cherished while they are still around--because they are not going to be with us forever.  Maybe the bisons remind me to slow down and focus on what will really count in the end--families, loved ones and friends. \n\nIt is becoming more rare that I can spend time with my old but youthful mommy  and daddy.  This visit at Golden Gate Park watching the bisons together will be forever embedded in my memory.\n\nIt was a beautiful sunny day that I will always cherish.", "author": "Leah E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-04-25", "description": "Reasons bison are awesome:\n1. They wallow. \n2. They have beaten extinction! Whooooo!!! Go bison!\n3. They are usually lazy but but if you piss one off they can run fast. This is highly entertaining. \n4. They remind me of childhood trips to Custer State Park. \n5. They are cute. and tasty. \n\n5 reasons = 5 stars. Anything less is an insult to mother nature.", "author": "Sara P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-06-18", "description": "Why in the world is the consensus that the bison are only \"4-Star Bison\"?  Are they not bison-y enough?\n\nNo, they don't perform circus tricks and they aren't the kind of animals you cuddle with, but they are awesome.\n\n1. It's really great to have them so nearby.\n2. it's fun to see what they're up to.\n3. They are pretty much chilling out in their paddock and they are fine with you doing the same outside of the paddock.\n\nThey can't be set free - especially not in GG Park, so let's just love them as they are.", "author": "Shari G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-07-05", "description": "A friend told me there were bison in Golden Gate Park so we drove around trying to find them.  Then we found them and they just sat there.  They seemed to be happy.  I enjoy the whimsy of seeing bison in the middle of a big city.", "author": "Ryan L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-23", "description": "Huge animals, roaming and active, and no entrance fee! What more could you want?!\n\nAlways amazes me how many people in the Bay Area have no idea they exist here, have have for more than 100 years! \n\nThe bison paddock is a GGP staple, there are informational signs in front, and it's a place to stroll by or stop on your drive through. Easy parking, great low-key entertainment for the family.", "author": "Gary S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-04-17", "description": "First off, if you don't give the Bison 5 stars, then you are an assdouche. \n\nNow that that is out of the way..... I LOVE YOU BISONS! You guys are the definition of \"Stayin' Alive.\" Making a comeback for your species, look at you guys go! I can't say I'm not proud of you guys. Not a bad location to be locked up either. \n\nAlthough tasty in a burger, I now refuse to eat you after regularly visiting the Bison Paddock. \n\nGo learn!", "author": "Barry H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-01", "description": "There are bison. IN Golden Gate Park. How did I not know about this. Sadly, you cannot pet them.", "author": "David A R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-01-10", "description": "I feel so sorry for these girls.*  I love coming here, especially when there are people in town who did not know that San Francisco has famous bison.  But it's just kinda sad.  They're out of place, but with their spotty pelts and general lackadaisical attitudes, I don't think they'd survive too long on the cold cold Great Plains.^\n\n*They're all female!  So when you go to check them out, it's like going to a Donnas concert, and if you're into the drummer like I am, you'll also feel a little bit weird ogling these females, as she looked all of 14 on their first album cover even though she was older than that and even thought I wasn't that far from 14 at the time and even though she's legal now, but you know.\n\n^I know it doesn't snow or freeze over in San Francisco, but at least the Great Plains are warm some of the time.  These poor girls must deal with fog year-round.", "author": "John S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-02-19", "description": "I'd never really taken the time to stop and watch the bison. I knew they were there, just didn't really have the time. \n\nIt wasn't until we were sitting down at a local cafe where the cook leaned out to tell us about the greatness that is watching the bison paddock that we decided to give it a shot while we were in the area. \n\nAs he, and the kind waitress, explained it: You have the bison; the bison fertilize the grass; the ground hogs eat the grass, and the foxes try to eat the ground hogs. \n\nHe chuckled mentioning the ground hogs and how you'll see the grass seemingly move on its own and then get pulled down from below. On top of that he full on guffawed saying that should you play golf nearby, the foxes steal your ball thinking it's an egg. \n\nWith all of this amusement over the Circle of Life happening RIGHT NOW in Golden Gate Park, we had to check it out. As others have mentioned, the bison didn't really do much. They mostly graze and sit in the shade. Didn't see any ground hogs or foxes. \n\nI'm sure if we had a couple hours to stand by and meditate, we'd see this unique eco-system at work, but we didn't. \n\nPerhaps another time.", "author": "Christine A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-10-18", "description": "Easiest $5 I ever made was when I bet my new roommate (who had just moved from down south) that there were buffalo in Golden Gate Park.\n\nThe look on his face when he realized I was right was pretty priceless.\n\nI enjoy watching the buffalo because of their slowness. Reminds me that I should take in each day with purposeful steps. \nAlso a good reminder that I'm not caged in like they are. \n\nTho...let's be real...if they weren't happy there - animal rights activists in SF would be all over this place. So I give this place 5 stars! I'm sure I'll wave at them while I ride by again soon.", "author": "Katy A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-01", "description": "Love me my bison.  As a Daly Citizen and an SF weekly church goer, and a Blackfeet Indian, I've been swinging by the buffalo paddock regularly since 2011.  At that time, there were the three old bison and then they got 7 new teenagers added to the group.  One of the young ones died when someone's dog scared it into the electrical fence.  So, the herd went down to 9.  I noticed that the herd has only had 8 for a while so I called the zoo.  They said a 31 year old (a ripe old age for a bison) died in July of 2013.  They line up in single file at about 2pm to go into the feeding shed.  That's my story.", "author": "Maria D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-02", "description": "It pains me to not give the bison 5 stars, but I can't in good conscience until I see them AWAKE. \n\nHowever, sleepy bison are still adorable in their own way. \n\nI came with a few friends and we walked the entire perimeter of the bison enclosure (don't do this) and only three of these guys were to be found. But it led to a golden gate park adventure so no complaints.", "author": "Alyssa G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-18", "description": "If you like seeing bisons grazing in the middle of Golden Gate Park, you must check out the Bison Paddock. #KindaAwesome to see something like this in an urban setting like San Francisco.", "author": "Kwoky L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-02", "description": "I have wanted to see these bison for a really long time. Finally made it there today. I got to see a couple of them get down and roll, or wallow. They were in a smaller subsection of the paddock at the top of the hill, so it was pretty hard to get a good look or appreciate their scale. I will come back again, hoping they will be closer to the edge of the fence next time . . . \"Bring binoculars\" is a good tip.", "author": "Renee K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-27", "description": "Came by and saw the fellows on Sunday.  God I love them.  They werw quite spry and happy roaming in their pen.  A couple walked right over the fence as if to say hello. \n\nLove them.  love them love them. What a neat treat to have so close by, and available for everyone to see.", "author": "Samanta V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-10-21", "description": "Yayyy!! I love these little bastards.... well there not so little...\n\nEvery time I show guests around SF, we always find ourselves driving through lovely GGP, and then we turn a corner and I say... \".. and here are our pets! \" and they're ususally like, WTF!!! lol, love the looks on peoples faces...\n\nI love it how they call it a paddock - kind of reminds my of the \"raptor paddock\" from Jurassic Park. I mean, I totally have eaten buffalo many a times in my life (yummmy), but these guys are totally cool.\n\nYes it is a wondrous day when they are littered accross their paddock, however most of the times i've been their all scrounged up in one corner, or resting in their zoo-like pen.\n\nI heart the SF Bufallo!!!!\n\nTATANKA LIVES !!!!\n\nPS - theres a cool display showing alittle history on SF's and our nations Buffalo's in front!", "author": "Bruce N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-06-15", "description": "It was about 6 bison roaming around a pasture inside a chain link fence.  Kinda cool, definitely not a must see.", "author": "Bob B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-05-10", "description": "The bison kept me thoroughly amused for about 5 minutes. But they were just sitting around and basking in the sun. Still, its prettttttty awesome that there are bison in GG park!", "author": "Sarah S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-08", "description": "I've only seen them penned up, but they're pretty rad. One of my favorite things about GGP!", "author": "Kellie T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-02-01", "description": "The first time I saw these guys, I was at the tail-end of my first Bay to Breakers. The fog was breaking and after a morning of walking revelry I thought I was hallucinating. I remember asking aloud, \"Are those buffalo?\" just to be certain. \n\nMany years later, I am here with with some 'tweens. They seem completely unsurprised that there are bison hanging out in a park in the city. Either it seems like a completely natural thing for them (like ducks in a pond) or my talking it up hours before took the thrill away. \n\nWe pull the car over and they proceed to watch them for a couple seconds. One of them attempts to taunt the bison while the other resumes texting a friend. \n\nNote to self: Next time, I won't mention what we're stopping for... and I won't feed them sugary stuff... ever.", "author": "Loli L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-20", "description": "real bison! so random! super cool!", "author": "Oulie T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-04-17", "description": "They are a pretty cool site to see. Its a bit erry considering you are in the middle of SF but seriously cool. I love that we help keep them alive and happy.  I love that they still exist and are really cool to see a historic creature up close and in person.\nGranted after you read, chilled and watched them for a bit there is not much to do. This is why it doesn't get crazy great stars.", "author": "Natasha M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-01-26", "description": "Golden Gate Park Bison...I love you!\n\nThank you for hanging in with the fine folks of SF...you seem to be far from home but you just keep on truckin' and we LOVE that about you!!\n\nMuwaaaaaaaaaaaaaah to all the Bison of GG Park!!", "author": "Karen S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-09-11", "description": "Ah, Golden Gate Park. Home to many, many non-native species. Like Eucalyptus! And Bison!\n\nActually, the Bison are a great, if bizarre addition to the park. They don't do much, but that doesn't make them less interesting. And of course, they are certainly less happy than living in Yellowstone National Park, where they are more or less an indigenous species, acclimated to the climate and seasonal cycles. But that doesn't make them any less an asset to Golden Gate Park. \n\nI must say that some of the previous reviewers might want to bone up on their American history. They weren't actually hunted for fur or meat, at least once the \"Manifest Destiny\" took hold. They were in fact slaughtered by mercenaries hired by the railroads in order to deprive Native Americans of one of their cherished sources of food and sustenance (not to mention spiritual icons). Shot from trains and stagecoaches as the European settlers expanded westward, they were left to rot all over the great plains by the tens of thousands. Basically as a resolute \"F-You\" to the tribal people that depended upon them.\n\nAnd now we pump water from the dwindling aquifers to water crops that could never grow in the high plains to feed to cows who can't actually eat the crops, but are much easier to domesticate than Bison, even though Bison meat is far healthier than much of the Cattle Beef Americans consume. Furthermore, the Bison (having survived on the Great Plains for millenia) migrated constantly and never consumed the rhizomes (thus destroying the root of the grasses), thus ensuring a healthy high plains ecosystem. Unlike grass-fed beef, the historical record of these enormous migrations are a testament to the magnificence of the American west that has nearly been subsumed by the homogenizing influence of Ag giants like Monsanto and ADM.", "author": "Damien S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-01-23", "description": "There really isn't any stars for this. There's only about 5 bisons left!! =( I thought they were here in gg park to be preserved. Well, they were kept so far back then you need binoculars to see them.", "author": "Serena F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-09-30", "description": "I hung out with these guys and gals today for a bit. It's amazing that they are in the middle of the city like that! It kind of blows my mind that I can take a bus to see bison. \nI hung out by the fence and drew for a little. One lady bison was scratching her back on a tree trunk that was pretty close to the fence and I got some great little drawings.\nThe enclosure is beautiful, with tons of natural vegetation. I will definitely be a regular visitor.", "author": "Jen M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-06-04", "description": "So, so disappointed.  First we kept driving trying to find them.  We found them... but you could barely see them.  It was almost not worth spending the time to find them.\n\nI LOVE Bison, I grew up in Nebraska, and loved Bison.  In order to see them, I had to use the zoom on my camera.  Maybe we were there at the wrong time.\n\nI gave it three stars, because, I love the fact that they are there in the park.  That someone is trying to preserve these wonderful creatures.  I just hope whenever you go to visit, that they are right there!\n\nThe park was beautiful, and full of trees.  Keep in mind it was free to see them.", "author": "Cyndi S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-04-29", "description": "This little spot of the park is right by my apartment, so it's an easy stroll across Fulton on a beautiful sunny day. When I first stumbled upon the bison here, I was surprised since I wasn't expecting to see these creatures just hanging out in the fields of San Francisco. I would expect to see bison in Montana, but not in California (in this day and age anyway).\n\nIt seems that the best time to view the bison is early in the morning/day. By afternoon, they're not moving around as much, and by early evening (before the sun sets), they're already asleep/at rest. I like coming here on days when I feel like taking a break from the day-to-day frenzy of the city. It's calming and relaxing to me to see the bison just going on with their lives, not seeming to have a care in the world.\n\nIt's not THE ideal escape from the city for me (the most ideal is, of course, going somewhere else, i.e., Montana or somewhere else a little more natural), but it's a good alternative for the individual on a budget.", "author": "Helene K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-01-26", "description": "The first time someone told me there were bison in GG Park I thought they were pulling my chain. What is this, Dancing With Wolves?! \n\nWell they were right! There actually are Bison in GG Park (minus the American Indians and soldiers that dance with wolves)(actually, it's GG Park, you never know!)\n\nIt's pretty random, but also pretty fricken awesome! I could sit there all day watching them. Their 10 ft. long tongues are crazy!", "author": "Casi C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-11", "description": "I'm giving the bison 4 stars because sometimes the bison aren't always out roaming around. However, when they are walking around, it's pretty amazing. They have a couple benches over looking the park. Nice place to read a book.", "author": "Beverly D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-11-30", "description": "This place is FREE!...Coming from California Academy of Sciences...I pulled over to admire the Bison's that looked bored to some but to me looked very at peace.  Their HUGE but look so gentle.  I wouldn't ever go near one though..they may look cute but I'm sure can eat me alive.\nI suggest anyone who passes by GGP to just pause and admire these N. American beauties.  Definitely a cool site to see  AND it's free.", "author": "Blue S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-11-23", "description": "So, me and my girlfriend called ahead of time and were unable to get a reservation. Undeterred, we decided to soldier on and try to get a seat. A short bus ride and a bit of a hoof later (no pun intended), we were there. \n\nService: 2 stars\nShow: 5 stars\nAmbiance: 5 stars\n\nThere was a twinge of pity for these grand ol' creatures, but I buried that feeling with banana bread. We continued on towards the ether, a brisk wind at our backs.", "author": "Roy M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-12-11", "description": "Random huge creatures roaming around grassy pastures in the middle of a major American city?   How crazy is this but SO true.\n\nYeah they are fenced in and in Golden Gate Park but it's still hard to believe that in the 21st Century they are still around after millions were killed for their hide not too many years past.\n\nWhen in the park, stop by and pay homage to the former kings of the prairies.", "author": "Mike J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-10-16", "description": "This park is really beautiful! It is huge! We biked here and it was hard coming back uphill!", "author": "GreenDay R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-11-15", "description": "I've been excited for quite a while to get a chance to see the bison at Golden Gate Park.  The park is always beautiful but somehow we never make it over to the bison paddock.  I finally got my chance last weekend.  Maybe I'm spoiled from spending many weekend at Northwest Trek http://www.yelp.com/biz/northwest-trek-wildlife-park-eatonville  but the bison in GG were a bit of a let down.  Three lazy looking beasts, none particularly large and one concerningly anemic.  It was fun to see them but I was wishing for more.", "author": "Ivan L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-04-29", "description": "I've never understood why tourists think that Fisherman's Wharf is THE place to go in SF. It's just a disgusting overpriced tourist trap. Okay, sea lions are cool, but the rest is crap.\nIf I have people coming to town, THIS is what they need to see. Real live california bison living it up in GGP.", "author": "Rennie L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-01-18", "description": "Sunday and the kids want to stay home and watch television. No way! So I take my son (my daughter was sick) to see the bison (or buffalo) in Golden Gate Park. He can't believe there are buffalo in the city and has never seen one in his life. We park on Fulton and 35th, walk in Golden Gate Park, admire the remote control boats in Spreckels Lake and walk on John F. Kennedy Drive heading south. A fenced meadow comes into sight, and lo and behold! Six bison, huddled together, ignoring the humans and enjoying the midday sun.We hike to the back of the paddock, where we can get a closer look and take some pictures of these huge, imposing, yet gentle looking animals. It was a unique way to spend a Sunday afternoon in the city -- wait 'til he tells his friends who he tells me hardly ever leave the suburbs, \"My mom took me to see buffalo in San Francisco\"...\n\nPS I remember as a child that the buffalo were in the back of the zoo...???", "author": "Lulubelle L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-08-16", "description": "Poor bisons! Maybe I've experienced watching wild bisons at Yellowstone that the sight of these bisons makes my heart ache.  These bisons at GGP looks sad, depressed, and bored to me.  \n\nJust came back from a trip at Yellowstone and decided to pay a visit to the bisons here.  I think these bisons are skinnier in size compared to the wild ones I saw and in my opinion, they don't look very happy.  Now I understand why some people complain about having animals caged up.  The wild bisons at Yellowstone were galloping around going from one field to another while GGP bisons had to be caged up on one field.  \n\nThis paddock is definately a great way to show the history of SF but it sure is sad the wild lives of the bisons has to be sacrificed.  Who knows, maybe they are happy since they don't have to worry about being preyed on.  Going to GGP is not my idea of watching bisons though.", "author": "sidney c."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-26", "description": "The elusive Bison... sometimes they feel like being out there... sometimes they are in seclusion, but when you do get to see them, it is pretty cool.  I am glad they have these in SF, but I wonder if it is a large enough area for them.", "author": "Amelia M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-10-19", "description": "When I was little, my dad would talk to the buffalo whenever we passed them in the car. That was weird.\n\nStill, I enjoy my fantasies of them breaking down that pathetic little fence and stampeding around the park, scaring ducks and perhaps smashing a model yacht or something. Four stars for that and an extra star for smelling better than my 10th grade English teacher.", "author": "Liz A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-01-13", "description": "Now Sex in the City is a common thing, but buffalo?\n\nMy boyfriend, a San Francisco native, thinks nothing is funnier than telling me, a newbie to the city, all kinds of untrue stories about the home of the only moving historical landmark (trolley cars!) and the first China town. This is the guy who recently tried to convince me that he never had earrings, but was born with strange holes in his ears. I didn't believe that one anymore than I did the night we were driving through the park and he pointed to the \"buffalo pen.\" Suuure baby. Buffalo pen. And the guy I saw standing on the corner of 18th and Castro in a pink bunny suit in the middle of January really is the Easter Bunny and not some lunatic with, ahem, unconventional social skills.\n\nNo, really, there are buffalo in the park. Yes, I Yelped it when I got home.\n\nAll in all, I love the big guys, and while it does seem strange that the \"home where the buffalo roam\" happens to be not far from a duck pond, row houses, a few bus lines and hippie hill, they're just another reason to enjoy such a unique city.", "author": "Kat E."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2006-12-31", "description": "I'm an animal guy.. but Bison.. come on. I see the poor S.O.Bs sitting there in the fence pretty much bored out of their minds. You can't get close to the animals because most of the time their are away from the fence. For all the kids I bring to see the Bison they want to leave after a minute. \n\nDon't get me wrong..I'm not giving the Bison 2 stars.. they deserve 6 stars out of 5 for hanging in their mangy area. But as an activity there's not much really here.", "author": "Dan T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-01-12", "description": "I used to bike or walk my dog around the fenced area regularly.  The buffalos are rather boring.  They don't seem to be scared of anything.  I'd like to see them run, but they barely move.  *yawn*", "author": "S F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-05-28", "description": "you could really spend all day exploring golden gate park. gardens, trails, paddle boats, BISON? yes. the big burly beings. they were feeding when we got there, so not too much excitement. though, it's not as if they're fast-moving creatures even when allowed to roam the fenced field.", "author": "Sarah Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-01-24", "description": "I like the big fur balls, don't get me wrong, but as something to do in San Francisco, is it worth the trip?  Depends.  \n\nThey're way out at one end of the park.  If you start at the other end, by the time you get there you're babbling incoherently, or maybe that's the crazy guy that lives in the park standing next you.  Anyway, you're tired and you're cranky, and you want to see some great american beasts galloping across a wide open plain.  \n\nInstead you get... rocks, big furry rocks, not moving rocks, but very very still, caged-in and probably sad rocks.  So the excitement that you hoped for is not really there, for you or them, and that's a little sad for both of you.", "author": "Trevor F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-07-14", "description": "THE BISON ARE AWESOME! It's a really nice stop on my usual jog. Coming here brings some zoo nostalgia back, it's pretty cool", "author": "Kevin L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-12-10", "description": "BISON! ( and for once, I don't mean the superset of YACC)\n\nAs I was growing up in the city I played soccer from pretty much the time I could run in a straight line. This entailed many early morning soccer games at the polo fields across the street from the bison. Ans of course, the soccer entailed carpools, which entailed stupid childhood jokes. Well, my friends and I would always tease each other. \"oh look *** there's you're family!!! don't you want to go out and eat with them?\" and similar things. \n\nWell the sentiment changed, I consider the Bison as part of my extended San Francisco family, because we spent so much time together. I noticed when they were gone, or shedding, or disliking the rare hot day in the city. I still get very excited when I drive by and the bison are out to play.", "author": "Allyson S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-12-22", "description": "The Bison are awesome. I used to live close enough to walk to see them and I would take that stroll regularly. \n\nThe Bison are huge, smelly beasts that like eating and sleeping on the sloped grassy area of their pen. They live in a big caged area that seems adequate since they appear to be lazy 'tatankas' (and yeah I did do that whole hand gesture thing right now to represent horns).", "author": "Jessica D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-12-18", "description": "There are buffalo in Golden Gate Park? SHUT UP. We came across them on our hike through the park and I took a lot of pictures. They arent very entertaining and they refused to pose and run valantly for me, but nevertheless, it was cool. Apparantly they've been there since the 1800's(not the actual same ones, obvi. those would be some damn old bison, eh?)\n\nStar off for not giving me the photograph I wanted. And for the fact they look so sad.", "author": "Erin F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-06-19", "description": "I am writing this review to support the consensus that the bison shouldn't be given anything less than 5 stars.  Come on, its bison, in SF.  Pretty cool in my book.", "author": "Brianna T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-05-26", "description": "Not a lot better than walking the length of GGP with the Bison as one of the last highlights of the walk. It's not only watching the bison chilling out, eating, rambling, whatever; there's also a lot of bird watching activity!", "author": "EE C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-07-22", "description": "Tatanka!  \r\n\r\n(The five stars are for the bison themselves not the the area/conditions in which they are penned).", "author": "Nathalie L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-12-06", "description": "I know they are in a cage, but they look pretty happy being there.\n\nAwesome animals.\n\nSort of a mythic part of the GGNRA experience.  I know people who have been looking for them for years.\n\nI want to be a bison whisperer, but I hear they only like to talk about the old days.", "author": "Uncle Fishbits Aeneas X."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2006-06-02", "description": "So if you are looking for cuddly megafauna in San Francisco, here they are.  I can't help but feel sad when I see the bison in their enclosure. They always look kind of moth-eaten and mangy. When I think of them once roaming the western US in giant herds, I can't help but think this must be a little depressing for them by comparison.\n I try to see the positive, like maybe if they weren't here they'd be made into a buffalo burger or something.  But they just have the saddest faces.", "author": "Kathleen B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-08-07", "description": "Okay seriously, all those people giving negative reviews...these buffalo live in the middle of GG park, in the middle of a CITY and they're outside a zoo! This is one of my favorite places in the park! Where else can you go see wild animals in the middle of an urban area? These guys are a part of my childhood!", "author": "Erica S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-05-01", "description": "Got love these docile furry big creatures roaming the meadow. (History has it that the first herd was transferred in the early 1890's in light of their endangerment.)", "author": "Brandon H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-08-07", "description": "I just moved from Philly, and we did not have anything this cool.  It's hard to get over the fact that there were buffalo in the middle of a huge city...\nThe bison also seemed to have a decent amount of land to graze in--so I heart SF just for that!", "author": "alex t."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-04-05", "description": "One star for the bison. We spent fifteen minutes looking for a herd of wild bison grazing through the green grasses of Golden Gate Park only to be left disappointed at the sight of ONE camouflaged miserable bison, inactively laying up against a metal fence in a confined yellow grass section. I think my visit would have been more satisfying if there was a herd of bison actively wandering the park that weren't restricted to such a boring confined area. I felt really bad for that one bison. He didn't even have any friends to mingle with or join him in his misery. We didn't even get to enjoy the fresh smell of stinky bison let alone get a glimpse of a humongo heap of buffalo poop like you do when you visit the zoo. They might as well ship this little fellow off to the San Francisco zoo where he won't have to look like the only miserable caged animal.", "author": "Ally C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-03-22", "description": "Apparently when I was a baby, I cried a lot.  What can I say, I already knew what the world had in store for me.  The only way to calm me down was either to beat me into submission* or drive me to see the bison in Golden Gate Park.  My dad told me that the buffalo were actually in Wyoming but he happened to know an excellent short cut to get from San Francisco to Yellowstone in 15 minutes.  Essentially, from what my 5 year-old self understood, we were going on a cross country road trip.  I seriously believed the man until I was 8 years-old at which time I got into a fight with Marc Fransen about the location of said Bison and when I was proven wrong, I bloodied his face.  I never cared much for facts, I just like to be right.  Anyway,  the whole thing was fucked up.   To this day, I have a totally distorted grasp on geography and if you ask me where Michigan is, I'll point to Seattle.  Thanks, Dad!   I wonder if it's any coincidence that this was around the same time that seeing the bison in that small, crappy enclosure started to make me sad.  \n\n*Thank god my parents have been afraid of the law since their run in with the IRS in '82.  The one time my dad tried to spank me, i ended up screaming, \"I WILL CALL CPS!  I WILL CALL CPS!\" even though i had no idea what it meant other than some parents at my school were in big ol' trouble with them and anyway.  My dad ended up just sending me to my room and when i asked him about this years later, he said that he and my mom laughed at me for like an hour because i was so g-d dramatic.  Whatevs, I totally would have called CPS even if I thought it meant \"Candyland Patrol Services\".    Man, thinking back.  My parents let me get away with waaaay too much shit.  I should totally be a serial killer or something.  Oh well, they have my brother for that. \n\nTwo informative bits about the GG Bison Heard and awesome Buffalo in general: \n\n1) In 1908, a train that was carrying a carload of buffaloes from Yellowstone to Golden Gate Park crashed and all of the Buffalo escaped.  Cowboys had to be engaged to coral them up and get them to San Francisco!  Crazy town, right?\n\n2) There is a small but committed group of citizens who care deeply about the safety and well being of the heard and who fight constantly for them to have improved conditions (i.e. more stumps to rub on, better quality food, more enrichment) and they are always at city hall hooting and hollering for these gorgeous creatures.  And honestly, they usually get their way.  If that doesn't show you that a small group of thoughtful, committed citizens can make real change, I don't know what does.  There goes your Margaret Mead bumper sticker in action, baby!  You, too, can go down and volunteer through park services, if you want.   And you should.  Maybe, for Bison, being in SF is better than being at Yellowstone where Since 2001, the State of Montana, the National Forest Service and the National Park Service have slaughtered more than thousands of wild bison as they migrate to lower elevations in winter and spring. American taxpayers fund this slaughter to the tune of $3 million a year simply because the politically influential Montana livestock industry says bison compete with cattle for grazing resources.    Yes, let's kill off the animals that were here first so that we can fatten up more cows so that Americans can get their cholesterol laden, chemical filled 3 burgers a day!  What will Junior do without his Burger King Super Meal Deal?!  Oh, that's right,  he'll live a lot longer.  Ugh.\n\nMore info on this here:  http://www.hsus.org/wildlife/issues_facing_wildlife/yellowstone_bison_hazing_and_slaughter.html", "author": "Laura B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-07-16", "description": "As a true city kid who has spent precious little time in the great outdoors, being able to see some bison whenever I feel like it is kind of exciting. There have been bison in the park since the late 1800s and they're now managed by the SF Zoo. There's nothing to promise that the bison will do anything exciting while you're watching them--I've yet to see them stampede--but it's pretty peaceful to just stop and watch the bison for a few minutes whenever you're in the park.", "author": "Katie I."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-08-30", "description": "Having no idea there were even bison in Golden Gate Park, imagine my surprise when my mum and I saw them on my apartment hunting trip to the area. It was a dream come true to see such beautiful creatures so closely. I simply agree with Nathalie though - not the best conditions for them to be in (hence only 4 stars). I could easily trail into talk about how horrible it is that there are so few bison left in this country and how the government f*cked the Natives ... but that is what you expect :)", "author": "Victoria K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2006-12-08", "description": "All of my life, I've become excessively sad when I pass the buffalo. They're in a pathetic chain-link pen, in a part of the world they don't belong. Crab grass, dust and mud don't do it for them, nor for me. I never see them getting much attention either. I wish that they had handlers to play them music and give them showers. Maybe that'd make them happier. I hope one day they're donated to a ranch out in wyoming.", "author": "Jack O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-12-08", "description": "Buffalo in GG Park. Yeah they look like they need hugs but it's pretty amazing to see them. Who knew they had such aerodynamic bodies?", "author": "Ms K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-09-30", "description": "So random, especially when the bison start to shed. After about 2 minutes, the bison are a bit boring. They don't really move much. Still nice to see real bison - in San Francisco!", "author": "Judy L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-09-18", "description": "It's both sad and amazing to see these beautiful animals in the park.  It's great that our heritage has been preserved from extinction, but I wish they were roaming free.", "author": "Surf R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-09-07", "description": "I was amazed to find these bisons while walking around Golden Gate Park when I visited San Francisco about 10 years ago. I was even more amazed when I told about them to a guy who lived in the SF bay area, and he said he never knew they were there!", "author": "Nadav H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-03-21", "description": "my boyfriend saw these once while exploring during some epic mushroom trip years ago and has been trying to convince anyone that will listen that buffalo exist somewhere in golden gate park.", "author": "Sushi K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-04-03", "description": "my dad told me about the time where many bison were in this spot. some killed each other after fighting each other. there are only a few left. not a nice spot. go to yellowstone but remember what they do there too, hazing, kill them for food or cause they brusilosis? spelling. etc. if they migrate outside the park. what a lousy life the bison have always had!", "author": "RODGER B."}
