{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-08", "description": "Awesome 9 hole golf course. My husband and I have been here a few times, twice for an anniversary golf trip and to hang out in Golden Gate Park.  There is a relaxing vibe at this course, good rates and nice people.  We like cool weather and have a good time every time we come here.", "author": "Erin C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-14", "description": "I've been taking golf lessons with PGA Pro Tom Johnson at Golden Gate Park Golf Course and he has been an amazing instructor. He is very detail oriented, patient, and easy to work with. As a result, my swing has improved significantly since my first lesson. I definitely recommend taking lessons with him.\n\nAs for the golf course itself, Golden Gate Park Golf Course is beautiful and the staff is very friendly. If you decide to stay for lunch, I highly recommend the delicious pulled pork sandwiches.", "author": "Evan C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-11-09", "description": "Played this course in the early afternoon one day and it was fine. A couple of the greens need some loving, but for $19 it's hard to beat. My problem occurred today when I showed up for my 3:50pm tee time (spending $20 on an Uber) to be told that they don't rent clubs after twilight. This policy is nowhere on their site or booking app. If you have a course frequented by out-of-town guests, you need to make these polices very clear. Really unprofessional.", "author": "Jason L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-03", "description": "Love this par. Great food, cheap golf. Fun time in the park with nice greens and a great place to learn or take your friends.", "author": "Rick S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-04", "description": "Great prices, challenging par three course, best hot dog in the city, friendly staff, ocean views", "author": "Tom J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-10-15", "description": "A good par 3 course.. The staff seems like they're always annoyed at you or something though. You can't bring your own alcohol, but it's pretty affordable there. Decent for the price and rental clubs are pretty good.", "author": "Olivia R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-07", "description": "Golden Gate Park Golf Course is our happy place. Awesome staff, beautiful park setting with peeks at the Pacific, draft beer from Beach Chalet, and a smoker that turns out mouthwatering pulled pork sandwiches and tacos on (most) weekends. Bonus: they let you play golf here, too! It's a compact 9 holes, with tree-lined fairways that are challenging if you have a tendency (like me) to send the ball anywhere but straight down the middle. Take advantage of the online reservation system. They keep tight tabs on the tee sheet so you'll most likely be heading out on time -- but if you choose a popular time, don't expect to get around in an hour.\n\nEven before the First Tee organization took over management, this has been a kid-friendly spot. We've been bringing our son here since he was 1.5 years old to hit buckets at the cage and putt. Now that he's 6, we play a round here most weeks. (Don't worry about teeing up behind this 6-year-old, though. We always keep pace.) He's recently started leaning new tricks from Kyle, the resident PGA pro, during summer camp and group playing lessons on weekends. \"When can I see coach Kyle again?\" is a question we hear quite often, because Kyle knows how to keep it fun and engaging while the kids work on different skills. He takes them out on the course, so they learn how to make better club choices and take better shots, in real golf situations.", "author": "sari o."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-30", "description": "I stumbled upon GGPG when I was a new golfer looking to take lessons. I was lucky to begin working with Kyle Winn, their PGA pro. I can't say enough how great he was to work with. Not only did I learn how to play, I learned to love the game. He has a crazy good sense of humor, his patience is unmatched and I sincerely believe he wants every student he works with to find as much joy in golf as he does. I would highly recommend him if anyone is looking to start playing golf or wants to brush up on their game.  \n\nI have to say I really love playing at this course. I like the unpretentious, comfortable vibe that you get when you play here. I have met great people, people who have turned into great friends. Everyone on the staff is all so friendly and nice and it's the perfect place to spend a day! \n\nIf you haven't played here check it out - and grab some lessons with Kyle if you can!", "author": "Amy P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-07-23", "description": "Even for a beginner, this is barely a golf course. As a friend put it, \"this is a park which happens to have holes placed here and there.\" Even though it is cheap and the attendants are very friendly, I'd say skip it.\n\nAlso, play was very slow on the weekend.", "author": "Amit M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-13", "description": "This was my home course for when I started playing in October 2014. I played it regularly until about mid-2015 which is when I switched to playing 18 hole courses. I still visit every now and then (I live only 5 minutes away). \n\n+Justin, Kyle, Candice, and the rest of the staff are always superb. Friendly, nice, and respectful. \n\n-The staff is too nice. Sometimes it's jampacked and people tee off 2 times every hole because it's a beginner course. I kind of wish there was a marshall to push golf etiquette.\n\n+Easy course, great to practice par 3's of all ranges.\n+Greens are usually slow which makes it easier for new players to practice.\n+I've lost a wedge here before and returned the next day to play it. Kyle had it tucked away and saved for me.\n\nI plan on playing here Saturday morning 9/17/2016 as a single, if anyone is looking for a friend hit me up through a Yelp Message or something.", "author": "Dylan L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-08-08", "description": "Although my friend had to sell me a bit on going to Golden Gate at 7:30 in the morning, it was definitely a good idea.  With relatively few people out on the course, it was nice being able to tee off on our own and move at our own pace (typically, you get grouped in fours with strangers).\n\n\"Dude, I told you it was worth it waking up this early.  Not nearly as busy, and no one hanging around waiting for us to finish.\"  \n\"And no one watching as we hack up the course?\"\n\"...and that.\"\n\nTucked away in a corner of Golden Gate Park (who knew?), the course is a par-3, nine hole with distances ranging from about 110 yards to about 195.  While having drivers might be handy, irons are more than sufficient (golf bags are required on the course though).  After all, a good swing with accuracy would likely serve you better than just trying to hammer the ball.\n\n\"Mike, did you see where your shot went?\"\n\"Off to the right by the tree line.  Yours?\"\n\"I think it went through to the other side...\"\n\"Nice.\"\n\nWhile the quality of the course clearly falls short, Golden Gate is great for anyone just starting out since most of the other people out there are beginners as well.  They have a driving \"range\" (a half dozen stalls with netting to hit into) where they run golf lessons, along with a putting green to practice on.  At the clubhouse, they have the usual array of golf supplies (balls, gloves, tees, markers, etc.) as well as a BBQ/grill with some outdoor seating. \n\n\"Yeah, it's lost in that giant bush...no way I'm getting it out of there\"\n\"Here, take this one.  I found it while I was looking for mine.\"\n\"Neon yellow?\"\n\"Yeah man. it's so ugly, you can't miss it\"\n\nWhile other courses out there offer more and are better maintained, Golden Gate is still pretty decent.  It's a casual course (for better or worse), beginner friendly, and uber convenient for a quick round before breakfast.\n\n*overheard from two guys passing by in the parking lot*\n\"Man, I still can't believe I lost that one shot.  I swear I saw where it landed.\"\n\"Seriously Frank.  It was neon yellow...how could you not find that ugly thing?\"", "author": "Mike L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-01", "description": "Well I have to say that the new regime has given the place a huge face lift. The club house is brand spanking new. Brand new rent-able clicgear push carts. New young fresh employees. (Bruce needed to go. He was old, crabby and stuck in his ways). A face lift to the mini driving range, nicer manicured fairways. less mushy roughs. \n\nBut I want to commend the staff. I had my mini little gopro with me. Getting some cool shots. Well when I was done I hit the benches, and began putting my stuff away in the bag. Well I left my camera sitting on the bench and walked away. When I got home, I realized the gopro was missing. The following morning I called the pro shop and found out that the staff grabbed it and put it away for me. \n\nI have lost things in other courses, only to never see them again. It shouldn't shock us when society does the right thing, but unfortunately that is the way of the world though. The staff should be commended for being honest, and doing the right thing.", "author": "Tony C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-07-09", "description": "It's a fun little course with a low cost and a friendly staff.\n\nI get out here every once in a while when I want to work on my short game or just get a quick round in.  On a quiet day I get get 9 holes done in slightly over an hour.\n\nIt is a great place for kids - which is unfortunately one of the problems.  It is great to see a father out there with his 6 year old son - unless they are in front of you.  Most people will let me play through so it's not much of an issue - unless the group in front of them is just like that one.\n\nThe other day I got through in 1:15, but had 2 holes where the flagstick was not in the cup thanks to the 3 teenage boys a couple holes in front of me.  I caught them and played though quickly.\n\nSnack bar bar serves hot dogs and beer - Siera Navada Torpedo is in the cooler along with some other tasty options.", "author": "Jeff H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-25", "description": "Did the 9-hole Golden Gate Park course with my friend and both of us had a great time!\n\nSituated in Golden Gate park, it's a beautiful location, and you even get views of the city from some of the holes.\n\nWhat's interesting about this course is that every hole is par 3, and all the distances are relatively short (ranging between 100-180 yards). This makes it a great course for beginners like me. That being said, the course is still enjoyable for golfers of all skill levels.\n\nOther features include a driving range, a putting green, and a small shop, where you can rent clubs and buy snacks and gear. Just a tip: everyone on the course has to have their own bag and clubs. The guy at the shop was really nice though, and let me borrow a bag and throw a couple of my friend's clubs in it.\n\nOverall, I really enjoyed the course and the friendly staff that works there.", "author": "Chelsey P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-09", "description": "Under the windmill; \nFriendly players, coastal views;\nhidden golf jewel;", "author": "Brian J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-08", "description": "GG golf course has become my home court advantage. Ever since I began playing 8 months ago this place has been swallowed more of my balls than a hungry hippo. All jokes aside, excellent staff and cheesy sticks and a beautiful 9 hole course for a quick round at anytime.", "author": "Anton G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-18", "description": "I learned on this course, played golf here with my father, then introduced my wife and then my son to golf on this course.  I can't think of a better par 3 to learn and teach on.  No pressure to be great.  It can be slow, but if you want a more serious 9 holer course round, then go to Fleming or up to McGinnis Park.  I'd recommend this course for 1st timers all the way up until you can consistently hit 150 yards reasonably straight before going to the other courses mentioned here.\n\nEvery September there is a 3-week Family alternate golf tournament (Northern California Family Golf Championship) for all skill levels and teams (Grandparent/Grandchild, Father/son, Father/Daughter).  Highly recommend for a great bonding time with your child and a great way to get your son/daughter introduced and excited to the game.\n\nThe course is owned and maintained by SF park and rec with a master lease to an independent operator.", "author": "Erik H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-04-07", "description": "This review is for one of their staff. \n\nCame in at 10:40am as a solo player. After paying, Justin asked if i was ready.  I said in 5-10 minutes cause i wanted to finish drinking my coffee. He seemed a little annoyed by it but i just brushed it off. 10 minutes later, after finishing my drink, i said \"let me know when you want me to tee off.\" He said \"okay\" without looking at me. I sat outside the bench waiting for him to give me the go signal. Sitting outside i kept looking at him to see when he will let me tee off. 15 minutes later i got a little bored so i decided to putt for a bit. 30 minutes later he still hasn't called me, so i decided to ask him again. This time Max greeted me and Justin was standing next to him. I asked when can i tee off, and Max said i can go right now. \n\nI asked. What took so long for me to tee off since there were noone else waiting to tee off and i was the only one waiting. Max apologized and said i can go right now. \n\nI understand waiting if there were other people ahead or if they were booked but this was on a thursday morning. What i dont understand is how unprofessional Justin is. \n\nTo top it off, i asked what his name was, and Max said that's Justin and i'm max. justin butted in and said \"you can grab one of my business cards\" \n\nI come here at least once a week and this is the kinda of service i get. Because of this experience my game got thrown off cause i was pissed. Thanks a lot Justin you are a douchebag.", "author": "Joremel A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-08", "description": "This place is a hidden gem! The weather is always great. It's very sheltered no wind!", "author": "Chris L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-01", "description": "I wanted to learn to play golf casually, and chose Golden Gate because they were low key, welcoming and close to my place. I then met Kyle and my world changed. During a few months of weekly lessons with Kyle we covered everything from basics to course etiquette. \n\nKyle is an amazing teacher, which can be seen from his passion for the game and for sharing this love for golf with others. If you're new to the game or want to brush up on your skills, I highly recommend heading over and meeting Kyle. He'll change your life!", "author": "Grace Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-02", "description": "Huge thanks to Kyle Winn and the staff for turning our kids into legit golfers!  Granted, they have a way to go, but so far, great progress.  Kyle's approach worked really well for my two boys.  He taught them patience and discipline.  It helped boost their confidence and self esteem as well as opened them up more socially when Kyle brought together foursomes.  The camp sessions he offered this year were perfect to gain consistency and kept them outdoor all day long.  The kids especially loved ordering their own food from their cafe (which is really tasty).   \n\nMy biggest reward from these lessons happened last weekend when we were at a carnival playing a golf game where you had to putt through these tiny holes to win tickets.  There were three holes about 18 inches apart.  My son took the putter, used everything he learned and made 2 of 3.  His friend behind him made a remark about how well he did and my son said back to him, \"I take golf lessons, I know how to play golf\".", "author": "Monique U."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-28", "description": "I have been golfing at GG golf course for years. This course and the staff are jewels. Every interaction with staff has been a pleasure. I am always greeted with professionalism, courtesy and encouragement. We even love the food!\n\nBut I also write this review particularly about Kyle Winn, the golf pro who has provided golf lesson to my 10 year daughter for 3 plus years. While it's humbling (and heartening) to have my 10 year old play better than me, it is a testimony about Kyle's talented teaching as well!\n\nKyle has a terrific ability to bring his considerable teaching talents to his students while holding the student's full attention and at the same time by providing a fun and appropriately challenging experience. \n\nI too have enlisted Kyle for providing me lessons and sure enough, I am now keeping up with my daughter !\n\nIn essence, I unequivocally sing the praises of Kyle Winn for golf lessons for our kids and for us adults and kudos to the staff for enhancing the experience of golfing at this quaint course.", "author": "Sunny S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-08-15", "description": "3 1/2* Golden Gate Park Golf\n970 47th\n9 hole course off Kennedy \nThe course had green fairways in spite of the drought conditions\nFriendly, pro shop\n$17 per person for non-residents before noon on Fridays; otherwise, $21 for weekend rates\nHilly; course in good shape; rough cut back\nThe greens were sanded and that made life difficult\nHave a small snack concession", "author": "Rosquete B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-16", "description": "I posted a pretty bad review of golden gate gold course recently.  The owner was rude and the insulting.  \n\nThen I got an email from the new owner offering me a free round of golf if I gave the pace a shot under new management.  I'm glad I did.  Nicely manicured greens, courtesy staff, and a beautiful day all came to get her for a great morning round.  GGGC is a decent par three course at a very reasonable price, don't miss out.", "author": "Ryan C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-04-11", "description": "Be forewarned.  Do you like playing where you can barely locate your ball?  Daisies are indicative of springtime.  And the entire course were full of daisies.\n\nWe paid inside the pro shop.  And right away we're told \" watch out for the daisies'.  \n\nBut it was such a lovely sunny day that it compensated for them.", "author": "Shirley N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-08", "description": "An amendment to my earlier post:  The staff at GG Park Golf Course has been just fine since my last post.  In fact, Justin Moore (general manager) went out of his way to introduce himself and offered to help if I had any future concerns or problems.  Nice guy & very professional.  Thanks Justin; I'll continue to play your course & recommend it to friends and family.\n\nGolden Gate golf course is a fine little par 3 track; it's great for working on low to mid irons between 100-193 yards.  It's not good for working on your putting, the greens are hit or miss.", "author": "Adam S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-03", "description": "This course is a great and quick little 9 hole course. It is interesting and offer great views around sunset times. It is one of my favorite spot in the city. There is a short driving range that lets you practice into nets. The owner is really nice!\nThey also have amazing BBQ sandwiches!\nThe only reason I did not give a full 5-star is that to play everyone needs to have his/her own series or half series...", "author": "Romain D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-30", "description": "Golden Gate Park is a special place. Just when you think you've seen everything there, another part of it will surprise you. That's what the golf course did. It's tucked deep into the western portion of the park, only a ten minute walk from Ocean Beach. It's lined with beautiful Cypress and Eucalyptus Trees, and for mid summer, the conditions were great, save for the tee-boxes being a bit too shaggy. This course is no \"pitch and putt,\" with many of the holes close to 200 yards long, it will test your long irons, short irons, and putting. There are many elevated tee boxes, which provide great views, and for $20, you get 9 really fun holes. I'll definitely be back. Glad to hear the course is under new management, and I hope they keep getting this course into better shape.", "author": "Marcel M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-08-07", "description": "An excellent value for a quick nine holes of par 3 golf.  A great place for beginners.  Tom, the Head Professional at Golden Gate Park is also an outstanding individual", "author": "Patrick K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-27", "description": "Update from my 3/2/2014 review: \n\n I have taken lessons from Emily. I have purchased a new set of irons, I have met Candice and Ivan, The driving range has been refurbished and looks awesome. They have painted the club house and are constantly upgrading the grounds . My game has improved tremendously and I am addicted to this game. These guys make it feel like a golfing camp. They are constantly busy with training youth groups. They host leagues on Tuesdays eve, which i have not been to, but I will go soon. I really enjoy playing at this course and will continue to do so. If you run into Arturo on the course , take time to listen to his wisdom. He has three holes in one, he is probably in his early 80's and just by looking at him you know he has many stories regarding the GGGC!! Its magical. Quoting a line from the book Golf In The Kingdom, \"Each game is an incarnation\" Shivas Irons\n\nStill waiting for that hole in one., I will certainly post when that happens. In the meantime, I am enjoying the serenity of the game. \n\nIt is powerful. \n\nGGGC is one amazing place, we are lucky to have it in our backyard!!", "author": "Felipe R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-19", "description": "GGPGC is where I pretty much learned to play. It's fantastic but you need to understand it.\n\nThis is your basic only-casually-maintained MUNI par 3 course. But there's really immense charm to that. Some people want it to be nicer--well go to Lincoln or Fleming then guys, come on. This place has charm and its own personality--and it's the least intimidating place I've ever golfed at. Oh did I mention it's insanely cheap with a resident card?\n\nAnd then there's Bruce. He's not \"a colossal prick\" like some people have said. He's just got his own way of doing things which sometimes isn't what you'd expect.\n\nI'll always love this place--especially the last four holes.", "author": "Paul C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-07", "description": "A diamond in the rough. Love this place; I play here often. Grounds are nicely maintained. Staff is very friendly, courteous and always helpful. Weather is usually nice, as it is tucked in and protected within GGP. Rates are very reasonable. A fun 3-par course with narrow fairways; perfect for beginner/intermediate golfers. Range is medicore: mats and net. Decent putting green; no area for pitching. Simple snack bar with occasional BBQ items. So why does it earn my 5 *'s?  Easygoing vibe, great location, decent weather, nice scenery, terrific staff, good course conditions.", "author": "Chris E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-30", "description": "Really fun par 3. Great for a short stop to play golf! Course was nice also! I would go back any day and not to expensive!", "author": "Alexandra A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-05-08", "description": "I played this course for the first time the other day, and I was amazed that I was seemingly strolling along on my own. No one waiting for me, no pressure. The greens were a bit rough, as were the tee boxes, but that's a municipal course for you. I am totally ok with that.\n\nA lot of people say this course is \"great for beginners.\" While I think that is true in terms of a relaxed environment, and the fact that people won't be too backed up behind you getting mad that you play slowly, I don't think it is true in terms of course difficulty.\n\nThe course par is 27, but the rating is 35. This course is pretty challenging in my opinion. The fairways are quite narrow, and there are lots of trees with branches hanging over in places you want to hit the ball. When you combine that with the fact that there are lots of elevated tees, and wind, it is pretty difficult to land a green in regulation.\n\nIn short, it's a great course to go play, and it's cheap. Just don't expect it to be easy since it is a 9-hole executive course. Your ego might be bruised when you walk in from the 9th hole.", "author": "Casen D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-12", "description": "Golfed here today with my kids.  Had a wonderful time.", "author": "Kevin B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-08-29", "description": "It is a municipal 9 hole course, you have to keep that in mind playing here. \nIts not in great shape, but not all that bad either. Last time out the greens were in great shape. \nThe course itself is fun and nice to practice on. \n\nHOWEVER, Bruce, the head idiot in charge, makes going there a nightmarish experience. The past 3 times there I have been yelled at by him. \nI know golf etiquette, I am clean cut, polite, dress well, etc. \nEach time I am there though, he has some minor complaint about what I or someone I am with is doing. He then blows it way out of proportion as if it was the end of the world. \nI have gotten in trouble for talking with my friends after in the parking lot as we were leaving, he said this was \"tailgating\" and had to leave immediately.\nLast time a friend of mine and I were there he tells us to play with another 2-some. As we are walking to the tee, the last guy is driving. Okay, there is no-one behind us, it is twilight, we will just play our 2-some and let them go. Nope, he got mad for not making sure we made 4. There was no-one behind us for 4 holes the whole time, it was 7pm. \n\nMost of my golf friends refuse to go there anymore. Not because of the course, but because of Bruce. \nI would give it 3-4 stars if it was not for his rude behavior ruining the whole experience. \n\nHey Bruce, your working at the MUNICIPAL 9 hole course. Its not the Olympic Club.", "author": "John N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-22", "description": "This place is great. The fairways and greens are well maintained- way better than Lincoln's to be honest. It's a perfect course to learn at, shorter par 3's for the most part. The new management is awesome and they have made some great updates in the past year.", "author": "Amanda A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-10", "description": "GGPGC may not be the perfect golf course, but if you know what you're in for it's a fun ass time. 9 holes of par 3 goodness (101-192 yards), it's beautifully set among the trees of Golden Gate Park with a few of the holes having spectacular views. I'm also not one to complain when I can get a 4-pack of tallboys for $12. And as someone else said the pulled pork sangy keeps me coming back (that buttered bun tho). 3-4 clubs is all you need and when we were in need of an extra bag on a couple of occasions they provided one in a pinch. Management is accommodating, food is good, beer is cheap, fairways are well maintained and twilight rounds are $10? Count me in!", "author": "Justin H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-28", "description": "4 stars\n\nLong story short: Great course!  Lots of fun and great way to get in some exercise\n\nLong story long:\n\nOn my friend's bachelor party weekend, after breakfast, we had the brilliant idea of going par 3 golfing, so looking it up, we found this place and made the trek from Berkeley.  After almost getting lost because Golden Gate Park is quite massive, we found the place and walked up.  A round of golf ended up being about $20.\n\nWe hit to the course and there was a lot of uphill and downhill holes.  The clubs weren't anything to brag about, being used however many dozens of times, but we couldn't complain.  This isn't the kind of place you come to work on your golf game, well, maybe you can, but it was pretty chill.  I guess being really close to the shore facing the open Pacific, it was REALLY windy as we were trying to play.  Though, only the last hole, going into the wind, I killed it right down the middle about  of the way up the fairway.  Needless to say I did well on that hole.\n\nI would definitely come again.  Now to find a par 3 course here in Kansas City.", "author": "Austin S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-05", "description": "This is a great place to tune up your short game but there are some longer 160-194 yard holes too. The course is in better condition than a few years ago. It's always a lot of fun to play here and the food is good and the staff friendly. Can play 9 holes in about 1-1/2 hours. Good to be a straight hitter because the fairways are relatively narrow.", "author": "Mike M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-07-31", "description": "I heard Bruce was gone?  YESSS !  I haven't been there since Bruce left, but for $11 it's OK. Fairways are no differ from the rough. Luckily U could land the green with a 5 or 6 iron on the longest holes.  \n\nAll par 3s.   \nPutting green\nand CAGE driving range.", "author": "Paul J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-08-07", "description": "The Golden Gate Park Public Golf Course is an amazing benefit to SF residents and the public. With many public golf courses closing their greens, and local politics threatening public access to the game throughout the U.S., including access to THIS course, we are blessed to continue to have this course available to play on.\n\nI am a new golfer, a San Francisco resident, and by no means a man of \"means\" enough to afford other non-public green fees. Without this course to play, it's doubtful myself, and many other San Francisco residents would have the oppertunity to learn, and enjoy the game as it is played at the Golden Gate Park golf course.\n\nContinued access throughout the year to this course for all level of players should continue as long as the Golden Gate Park exists, continuing it's tradition of offering residents, and the public, a beautiful recreation area to enjoy in the heart of The City.\n\nCurrent management has been excellent, friendly, and courtious, not to mention patient with my questions, play, and patronage of the course. Following the rules is important, as it is with any golf course, and enforcement here is fair.\nMore then once I have been paired up with golfers of simular level, due to the friendly nature, and knowledge the current management has regarding it's patrons.\n\nI have yet to be disapointed playing here, and hope to continue to enjoy learning the sport at the Golden Gate Park Public Golf Course for many years to come.", "author": "Enoch K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-10", "description": "This municipal course is a city gem. It's a good spot for beginners as well as anyone looking to hone their short game. It has a few surprisingly long par 3s and the wind is almost always a factor.\n\nDespite some reviews to the contrary, Bruce has always been cordial to me. He does ask that everyone obey the course rules, but that doesn't seem too much to ask. Oona, the other manager, also always makes me feel welcome.", "author": "jon c."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-14", "description": "I think this is a very solid course for the price, especially if you've got the SF resident golf card.\n\nIt's important to set your expectations. This is a par 3 course, most appropriate for beginners and intermediate players. Some players here are just learning the rules and how to play. The course conditions are in line with the price. There are a lot of daisies all over the place, which is why I like to use yellow balls on this course. Sometimes, the owner asks you to start on hole 5 instead of hole 1 because it'll get you through faster; not a big deal to me. I just go here to practice my short game because I have a lot of room for improvement!\n\nI've never had a bad experience with the management here like some other Yelpers, so can't comment on that.", "author": "Jang K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-07-30", "description": "I played GGP golf course on a beautiful sunday, however i was treated like total crap. BRUCE-the guy in charge was extremely bitter right from the get-go and continued to ruin my golfing experience. I have lived in SF for 4 years and attend San Francisco State University. I asked BRUCE for a discounted rate seeing as i was a student and a local---DENIED. I expressed my wish to share my friends clubs---DENIED. he stated that i needed to pay 90$ and go to civic center to obtain a residence card, and that every golfer is required to have their own equipment (forcing me to purchase a shitty rental set for 8$---no balls or tees). After enjoying the first 8 holes i hit a lousy teeshot on 9, missing right of the green. i used a range ball on my first and only teeshot and up the hill drove BRUCE who, when he reached the tee box, immediately yelled during my friends backswing \"ARE YOU USING MY LAST HOLE AS A DRIVING RANGE?!!? YOU NEARLY KILLED SOMEBODY!!\" he continued to ridicule me for having A BEER (one can) that i brought to the course. it was my first and only tee shot, at an unfamiliar course, with a shitty rented 5 iron---you cant expect much brucy. \n\nClearly BRUCE believes his beloved 9 hole course in GOLDEN FREAKING GATE PARK should be run like a country club. (who doesn't bring their own beer to the park??) I came expecting a relaxed setting for a lovely day of golf, and felt PARENTED the entire time.", "author": "Robbie E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-12", "description": "Come here if you are a complete newb and just want to hit golf balls. $6 for large basket. Perrfect.", "author": "One L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-12-14", "description": "I've been here a few times and always had fun. This course is great for beginners or a quick casual game and the owner Bruce seems like a nice guy. I especially liked the unusual terrain, being in Golden Gate Park.\n\nBy the way, try their pulled pork or beef brisket BBQ sandwiches and the scalloped potatoes. Bruce recommended Memphis style and it really caught me off guard how good it was. They make their own homemade bbq sauce and you can tell the meat was slow cooked the way it should be. Not what I expected from a golf course. I'm getting hungry again thinking about it..\n\nFYI last time I was there I heard that they might be closing the course down if business doesn't pick up. Really hope they don't so if you like the place, now might be a good time to show support.", "author": "Paul S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-29", "description": "Let me start off by saying I barely ever write reviews, but now that This Course is under new management, its like a brand new experience. All the staff is helpful and kind! You can really see the effort they are making to rebuild this gem! Its a great place to work on your irons or get in a quick nine with your friends. I have been spending a bunch of time there lately and it seems they change pin placement every day. I  always feel challenged! I can't wait to start teaching my kids to play golf here!", "author": "Joshua G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-06", "description": "Just inside 47th and Fulton on the north side of the park, behind the archery field, is a perfect Come Along golfer 9-hole course. I am a Come Along golfer- I'll come along if someone wants to play but wouldn't go by myself. \n\nIt's first come first serve, no frills, super casual. You won't need a collared shirt and plaid get-up here. Pay inside, get your scorecard and head to hole #1.\n\nIt ain't super manicured but the greens are pretty nice for $19 (f-sun rate) per person. I saw signs for cart rentals but no one was using them and it's really not necessary. It's a fun and pretty quick course (all Par 3 holes, longest is 193 yds), but you may get held up trying to find the next hole. They're not marked. I'm not sure if I completed the holes in the right order, but I did hit 9 different ones. \n\nIf you get hungry, I found some edible mushrooms under a tree by the last (?) hole. As I was walking by. Not like I was looking for anything under a tree, of course.", "author": "Kim K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-01", "description": "That's right YO!! I'm a girl and I know how to golf better than you ))\n\nFun and friendly little par 3 course.\n\nBring a hard hat though.  \n\nSerioulsy.\n\nI actually saw someone get hit by a ball last weekend here.  It looked like it hurt.\n\nI mean honestly, how much time do you REALLY have to move after someone yells \"FORE!\" on a short course.\n\nNot much.\n\nJust ask the guy next to me that got the &%$# knocked out of him.\n\nResident's Card?  $10 Green Fee and $3 Beers.  You'll need all of that money you save to pay your hospital bills from the hackers out here trying to kill you.\n\nBut all the jokes aside - great place to golf, my boyfriend taught me how to and now I'm like a republican... )))", "author": "Veronika A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-16", "description": "NOT PEBBLE BEACH, BUT STILL A-OKAY\n\nYou're not going to find any first class amenities here. The driving range is rinky dink, the bathrooms are rough around the edges, it's a par-3 course.  But heck!! It's less than $20 for 9 holes.\n\nThis is the perfect place for beginners, if you've not played for a while, or you're a duffer that doesn't need the pressure.  A nice, relaxed atmosphere to practice your game.  The pro, Bruce, can come across as a crusty sailor type, but if you're cordial, he's fine.\n\nI came here with my women's group (25 in all) and Bruce put together a nice clinic for us.  We learned the basics, hit a bucket at the driving range, did a 4 hole scramble, then had a BBQ chicken salad afterwards, all for $29.   It was a super positive experience for everyone.", "author": "Rita S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-05-17", "description": "If your a beginner, I don't recommend coming here. I have played courses all over the world, some more fun than others, yet GGPGC is one of the worst run I have ever played. Nice designed course, terrible customer service, un-friendly and I hate saying bad things about public courses. I became a very good player, growing up on some great public courses. I recommend paying more elsewhere, this place, In my opinion, needs new management or someone who cares. I cant believe they have \"First Tee\" here.", "author": "C W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-08-27", "description": "The management here is incredibly rude. I recently took two family members who are newer golfers - and I'm not sure there would be a  better place to have them get a feel for the links than than this 9-hole public golf course. \n\nFor some reason the white-haired guy managing this place decided to go into attack mode and drove his golf cart out to us not once but twice to yell, yes, yell, at us to hurry up our game. Not only did this take any fun out of the day for us, but it was also completely baseless. I made it clear when he harassed us the first time that we were playing as quickly as we could and then he swooped in on his cart again 20 minutes letter barking the same BS.\n\nWe were so fed up with the rudeness and attitude we went in afterward to talk to him in person. I explained, again, that we were playing ready golf, golfing as fast as possible, and that we were NOT holding up play had he actually been watching us vs. just assailing upon us with his attitude. I also explained that we were waiting (with another foursome) so it was not us who were slowing down golf. Probably because we were in earshot of other customers he was much nicer and even apologized. But in reality the guy (and his wife) are total jerks who have completely the wrong personalities to manage this place. When we walked in to talk to him, he said,\"Oh, congratulations, I see you finally finished.\" Major, major, condescending a-hole. \n\nI have golfed here several times before and thought it was just his wife who tried to suck every bit of fun out of golfing here with her snobby attitude and hovering. \n\nThe other foursomes we talked to were having equally bad experiences. They do not let you share clubs and his wife kept coming out and making people rent their clubs if two people were trying to share saying \"it's the rules!\"- and she even gave one guy ( not in our foursome) left-handed clubs. They could care less if you are really using them, so it seems they just force them on everyone to more money. \n\nAnd - between Dr. Evil and Golfzilla, they must have asked my poor cousin 5 separate times to take the small backpack she was carrying into the clubhouse (yes, they hover THAT MUCH). She politely refused time and again. I still don't get what was going on with that. Oh - and the guy also started harassing my cousin that she didn't have her own clubs (her husband was carrying them) and he wouldn't let it go until she started carrying them herself. \n\nIt was a completely un-fun experience. It's too bad such a great park with such a great amenity as this little course has to be ruined by the jerks running the place. Ick.", "author": "Lance B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-10-28", "description": "You'd think a place as beautiful as Golden Gate Park would also have a well maintained course in this extremely expensive city.\n\nI wasn't exactly impressed. I've played here once and practiced twice.\n\nThe practice greens are in horrible shape. It's scarred and beaten up. Hard to actually tell where the ball will break, or sometimes it just gets misrouted with one of the divots. Pro shop is pretty crummy, but the guy who works there was friendly. He wanted to charge me $16 for a half rack of ribs and actually charged $1.50 more for coleslaw. I was pretty famished and thought that something that expensive must be good. Wrong. Crap quality and with a touch of KC Masterpiece cheapo BBQ sauce. And they actually charge for coleslaw? That's pretty cheap. I hope they don't charge for ketchup if you order fries. The course is \"okay\" but not amazingly well kept. I guess it's average for what you'd expect for a public course. The bathrooms were gross. There is a driving range but it's just a huge net. Whatever, it's nice to have, tacky or not.\n\nI had the pleasure of playing behind a foursome of people with downs syndrome. Most of them were nice but when we all left, and I was driving out too, one of them starting getting at me hard with some road rage. It was kinda funny, but damn unexpected.\n\nIf you're short on cash and low on standards, come check it out. I'm getting spoiled with being invited to tourneys in East Bay so I find myself rather critical of courses that have to suffer this crap SF weather.", "author": "Ryan E."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-03-20", "description": "Every review here about Bruce is correct.  He is a complete asshole.\nI went there last week and this guy tries to peddle you 5 dollar beers and other stuff that no one needs.  \n\nHe hates credit cards and always ask for you to pay cash.  When I paid by credit he actually charged me 1 penny more.  NO ONE cares about the penny.  BUT I asked, \n\nMe:  \" Why are you charging my credit card an extra penny?\" \n\nHim:  \"My credit card machine does not work properly.\" \n\nAnd than he made a big deal about it.  \n\nHim: \"Do u want a penny back in cash?\", \n\nMe:  \"Sure.\"\n\nHim:  \"I do not have one in the cash register.\"  \n\nI felt like I was on hidden video and some guy was going to come out any moment.  But no hidden video just an ass named bruce.\n\nI have learned that Bruce rents the golf course from the city of SF and that he pays them a percentage of green fees.  Everyone says in the posts below that he cheats the city on all the cash transactions and that is why he acts like you are taking his first born when you use a credit card.\n\nIf you ever play at Golden Gate Park Course pay by CREDIT CARD PLEASE!", "author": "Zoe G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-26", "description": "the Teddybear has brought me to a lot of scenic and wonderful golf courses so my expectations are always high whenever i go to new ones, and he usually brings me out of town so i never really had the chance to see the courses here in sf.\n\nCholo has a good strategy in training me, he knows that i get bored at the range although he bring me there regularly as i need those drills to practice (just like your tennis Malou, you do your drills right????), but to make sure that i dont lose interest on the game he loves...he takes me to 9course ranges, just to get the feel of things. I have been playing for 6 weeks now and its good to know, especially when i hear other people complimenting my game...not bad for a start.\n\nI missed reviewing this the first time I was here a couple of weeks back with my cousins. its good to have the SF Resident Golf card because we get discounts.\n\nThe course is much more better than Cypress (sorry Cypress) and more challenging...becuase it has hills.\n\nGuy at the counter (forgot his name) is pleasant always with small talk. I am hungry (like always) and told Cholo that i want a quick bite, he said he wasnt that hungry but wil eat with me. He got the hotdog while I got the Memphis style bbq (both sandwiches). We ate and hurried to tee.\n\nCholo wants me to always beat my previous score, when I started it was 66, then 56, then 55...then 50 and here i made 49....Yay! he said, you can see his eyes beaming and his all smiles because he's happy that i am improving. \"Malou, you're a quick learner at times i thought that you are not listening to my coaching but clearly you apply everything that you hear from me\"...\"You are my best student\".  I can only smile back.\n\nGood thing is he said, you may not have the distance yet but your aim is always straight, your ball doesnt go to the left or right....hmmmm.\n\nLike I said, it smells more greener here, the pars are more challenging.\n\nIf you just picked up the sport like me, this is a good place to start.\n\nWill come back.\n\nBtw, the sandwiches are good, the hotdog is not Oscar Myer...;-)", "author": "Malou C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-11-27", "description": "5-star disclaimer:\n\nDo NOT expect to:\nA. Play a serious round here.\nB. Play a quick round here on the weekend\n3. Be able to dodge that little white ball when you hear \"FORE!\"  (seriously, I rather just get konked without knowing, then at least I won't be looking up for it and take one in the eye.)\n\nWith that said, I like this course because it's incredibly laid back, which is the way it's supposed to be, especially if you want to get beginners excited about the game.  With that said, on top of the other things I've said, I'd also like to say that I've been playing for over 20 years, but still enjoy this beginners course because I set my expectations appropriately (hint, hint).\n\nDefinitely get a resident card from City Hall if you live in the city and plan to play more than 10x a year.  The cards are only $42, but save you at least that much if you just play one round at Harding!  Also, once you've gotten tired of this course and want to move on to something a little more challenging, Fleming and Gleneagles/Mclaren are also great 9-holers in the area . . . FORE!", "author": "Jeffrey H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-05-04", "description": "Ahhh it's that time of year again. Golf season. I love it when the rain clears up and I can actually head out and play on the course. It isnt that the rain necessarily stops me (remembering playing in the pouring rain in Burlingame last year), but it's nice that I don't have to play rush golf. \n\nOk to be honest, before playing here, I haven't played since my birthday, which was 7 months ago. I was rusty and my friend and I didn't want to play a full 18 that day. Just a casual nine was perfect for us. He tells me it is one of his favorite courses to play. After playing here, I can see why.\n\nI have played Fleming (another nine hole golf course) and while Fleming is fun, Golden Gate is chill. It's perfect if you want to go out and play a chill nine holes without the pressure of being on top of your game. It's small, but it still gives you a challenge between the hills and those damn daisies all over the course (FYI: I highly recommend investing in an orange ball for this course). This course is perfect for someone who is just starting out or is a bit rusty.\n\nI was actually surprised that more people weren't on the course because the weather was perfect in the city. But to my benefit, there was no one in front of us when we teed off on the first hole, so we decided to play even more leisurely than normal. We even caught up to the people in front of us by the end. \n\nTo the old guy who decided to yell at my friend and I at the end. 1. I'm really sorry we hit your friend. 2. In all honesty, we didn't know you were over there and we thought the ball hit the tree. 3. You don't need to make a big production out of it. We screwed up, we're sorry, but you need to remember you paid $19 ($13 if you have a residents card) to play on a nine hole municipal golf course. I have been hit by a few golf balls in my life and I never made such a production out of it. It happens, you run that risk playing. You are not at Harding Park so please, get over yourself.", "author": "Diana R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-04-14", "description": "I struggled with this rating.  I really like the course - I do.  I've played there three times now, and it's just right for me and my wife, as a couple of fairly novice golfers.  The holes are short, even for par threes, and that's fine as far as I'm concerned.  I need a place to help build my confidence before I'm willing to shell out the bucks to play at Harding.  Every time I've gone has been a Monday or Wednesday morning after my 8:00 AM golf class (can't beat the cheap lessons through City College!), and we've rarely had much of a wait (no surprise there).\n\nToday, though, was a bit miserable at the start.  The guy who runs the place, as it turns out, is a jerk.  Not friendly, not welcoming, giving a group of new golf students a hard time because one person didn't bring their bag (though they did bring a handful of their own clubs), treating us like idiots, continually pushing us to buy buckets of balls to hit in their lousy driving nets... ugh.  When the person who forgot their bag went home to get it and came back, the pro shop guy actually CAME OUT TO CHECK ON US after taking our money, just to make sure all four of us did in fact have our own bags.  He made a big deal about keeping up with the group in front of us, even though that group was a foursome of nice old gentlemen who were quite slow.  We had no problems keeping up.\n\nSee, the course is great for beginners, but the proprietor apparently doesn't want them.  Know your audience, pal.  It's a par three municipal course.  It's not fancy.  It's short.  Pros will not want to waste their time here.  Lousy golfers like me will love it.  You have to cut us some slack and be friendly to us.\n\nSo, five stars for the course itself.  Negative stars for the proprietor.  I'll average it out to two.  I'm sad, because I really like playing this course, but I just can't support this guy with my money any more.", "author": "Michael I."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-01-09", "description": "Bruce is a total and complete asshole.  So much so that I now rarely play at GGP and will pay the extra at Fleming to get in 9 holes.  Hey Bruce: we play at GGP b/c we are trying to learn golf.  If you had any fucking brains you'd actually be nice to your customers so that they would come more often and maybe take lessons from you.  But no, you continue to be a complete dickhead.\n\nIf you want to play 9 holes for $13 (prices just went up) then this is actually a scenic place to play.  That is if you can stand the complete shithead working the joint.  I no longer can.  Golf is supposed to be fun.  I feel like shit at work - shouldn't have to do so on the course.  \n\nHey SF City - how about a goddam audit of this place?  The city's budget sucks.  Fire this asshole and bring in somebody personable and you'll increase your fees.  Go fuck yourself Bruce.", "author": "greg f."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-07-09", "description": "Fun and friendly little par 3 course.\n\nBring a hard hat though.  \n\nSerioulsy.\n\nI actually saw someone get hit by a ball last weekend here.  It looked like it hurt.\n\nI mean honestly, how much time do you REALLY have to move after someone yells \"FORE!\" on a short course.\n\nNot much.\n\nJust ask the guy next to me that got the &%$# knocked out of him.\n\nResident's Card?  $10 Green Fee and $3 Beers.  You'll need all of that money you save to pay your hospital bills from the hackers out here trying to kill you.", "author": "Matthew R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-17", "description": "A great par 3 course!   The greens are all well kept and it is just $20 to play.  The best part about this course is they have great food as well.  Great course for beginners or casual players.", "author": "JT N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-07-11", "description": "What a great little course!  People complaining about slow play should go early.  I've gone the last two weeks in a row at 6:30am and it is great, just walked right on and played without ever waiting.  I've finished both days in a little over an hour.\n\nFor a pitch & putt, it also does a really nice job of using the terrain of Golden Gate park to give you some really different shots on each of the holes.  There's no water to worry about, but there are nice tree lined fairways and some hills that provide some interesting off balance shots.\n\nI think it's a great little value at $13 and just a fun little course.  One last thing about the staff.  Both of my experiences have been absolutely positive.  Getting there early they actually let you just start play and then pay as you come back around, which was just a very nice customer focus.", "author": "Scott W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-09", "description": "Perfect place for beginners and you can't beat the price. With a resident card the cost of one round is $11 weekdays and and  $13 on weekends. The course is short so you will never need a driver and being in Golden Gate Park is plus. If you are a beginner or have never played before this is the course for you. \n\nI'm not sure why everyone picks on Bruce but he has always been cordial to me. Its true he does like cash instead of credit cards however he has always processed my card without issue. \n\nThe only two drawbacks to this course are not really related to the course. The driving range is really nothing but a cage made out of a netting and being only a few blocks from the beach in San Francisco, it can get really foggy. On sunny days though it's a beautiful place to play 9 holes.", "author": "Benzee B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-07-02", "description": "Very cheap with resident card.   The layout is really good for a par 3 course.  The play is VERY slow, and the wait is really long, and the grass is poorly maintained.", "author": "Michael E."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-01-06", "description": "This is a fun course, let me just say that.  However, you need to be on your toes.  There are lot of people here who aren't all that accurate so it can feel like you're deer hunting with a bunch of blind folks.  \n\nGolf is an adventure.  Golf is fun.  Golf is best played in the company of good friends.  Golf is good here.", "author": "Daniel O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-04-10", "description": "Okay its a municipal 9 hole, par 3 course.  There are a lot of reviews here which are not about golf.  This is not one of them.  I have played golf for 40 years.  At times I have played a little better than I do now.  \nThis is a short challenging course with small greens and a few bunkers.  There are no fairways on a par 3 hole.  There is the tee, the green and through.  The course is well treed and consistently maintained.  It drains remarkably well and is playable in most conditions.\nI play here twice a week and use it to work on my short irons, pitches, chips and putts. I currently shoot about 7 over par.  I enjoy playing with and behind the kids learning and with anyone else I am paired with who wants to play.  I play early if I want to finish in 1:15 and if i play later i expect it to take longer.  I find the staff to be friendly, professional and helpful.\nFor the uninitiated:\n1. It is illegal to bring beer or alcohol from off site to any location with an on sale liquor license.\n2. It is illegal to smoke in a San Francisco park.\n3. Golf is played by a simple set of rules which involves one ball per player and no do-overs.\n4. Practice is important to the game but the course is for playing.\n5. Courtesy is a two way street however you can only control one direction, focus on that.\nI love this game and I love the part of it for me that includes GGPGC.  I play Harding, Lincoln, Sharp and Presidio and one day when I feel up to it I will play Gleneagles again.  So come on out, hit a shot or two, make a putt and have some fun.", "author": "John D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-02-29", "description": "Bruce lost the lease. First Tee will be running the place come May. This is great, great news.", "author": "Evan M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-01-06", "description": "It's 9 holes of \"the rough.\" Really bad maintenance. \n\nThe owners at the clubhouse are shady and when we called for the Twilight time/price. They said come at 4PM to get that price. We arrived and the guy changed it to 4:30PM. We know it was the same one, because there is only one old guy that works there. He wouldn't honor the twilight price. It was already getting dark at 4PM when we arrived. His response was why don't you hit some balls for a fee when there was NO ONE THERE.\n\nThe guy's name is Bruce. I hope the city fires him. I used to always come here with at least 3+ people at least 4-5 times a week for a beer and BBQ for each of us. \n\nThese people would rather lose a good customer and her friends, then honor a twilight price. SHAAADY", "author": "Katherine F."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-08-02", "description": "This is where I played my first game of golf. This is where I take my friends to play their first game of golf. The course is not bad -- even better than some I've plaed out in the East Bay. Great low key place where you can bring a six pack in your golfing bag without thinking twice. Definitely a great time. BUT....\n\nLike what most of these reviews indicate, Bruce, the guy behind the counter, is a complete prick. It boggles my mind that such a grade A asshole could exist in the real world -- I thought characters like this were made for the big screen. It really blows my mind. \n\nWhat is worst of all and the reason why some reviewers say \"I don't know why people have gripes with Bruce\" is that he chooses who to be rude with. If you're a resident golfer, he'll probably treat you with respect -- but anyone else, he could give a shit. I was nothing but polite, yet he is incorrigible. That is why while I'd love to give this place five stars, I give it one. Yes, he is that bad.", "author": "Edward Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-03-30", "description": "I love playing here! My friends and I play usually at least once a week.  It's great for beginners, the people you play with are usually pretty cool, and the scenery is great. \n   \nNow as for Bruce, I don't understand why everyone is hating on him so much.  Sure, he doesn't want you to smoke on the course or byob.  Yes he prefers cash payment, but he will take cards.  In the end, he's a good guy and an integral part of the GGP course.  He's always good to my friends and I, knows us by name, he even drove me around the course when I thought I lost my wallet last week. (of course it was buried in my bag)!  Show Bruce a little respect and he'll take care if you. \n\nIn the end this is one my favorite courses, it's like the home field for me.", "author": "Matt P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-10-11", "description": "I played a 3 hour round. \n9 holes, 3 hours. \n\nWhy? B/c some genius decided that it was a good idea for his 4yo son to play golf. Not only that, but he kept telling the kid \"take your time\".\n\nPros: great views. especially when sun sets. also from top hilly parts. good elevation changes. well placed bunkers. decent length for Par3 course. The holes have a lot of character. \n\nCons: slow, greens in poor shape. fairways are kinda thick. Bruce. XD", "author": "Walter M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-09-16", "description": "This is the perfect spot for your first game of golf or if you're just starting out.  Since we are in San Francisco, of course its cold, foggy and windy - but thats not the courses fault.  THe location is really beautiful, right in the heart of Golden Gate Park.  I played my first round here twilight so the scenery wasn't too great.  Some parts of it I felt were a little ghetto, like the Tee signs and the group of men smoking outside the pro shop mocking people.  Thank goodness there weren't too many patrons on this particular evening cause I didn't want to embarass myself!  \n\nI will definitely be back here next week for my second try!  Oh and I was really nervous about talking to the infamous \"Bruce\" but I dont think he was there because the guy behind the counter was SUPER sweet.  \n\nTip:  Wear pants/long sleeves OR bring a ton of bug spray - ALL the mosquitos in the entire world seem to have moved onto this course.", "author": "Tiffany L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-12-28", "description": "For a quick 9 holes, with easy access and parking, GGPGC ain't half bad.  The course isn't in the most fantabulous shape, and the driving \"range\" is a net, but with my resident card it's cheap and they've got decent food to cap off a round.  \n\nI do have to say that they're not always the most pleasant folks, but no one compares to the absolute putrid redface at Gleneagles.  He lives to hate.", "author": "Tamar D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-07-20", "description": "This guy, Bruce, is the worst.  He and the woman with an accent are just too dismissive and rude.  It's like they have some sort of God Complex.\n\nI don't understand.  Is it run by the City?  Is the clubhouse actually their own business?  I think he charged me $4.25 for a can of Bud.  Then again, I've been charged different prices for the same thing.  What a scam!  Look at the books!!!\n\nI actually like the course, but dealing with this couple is such a pain.\n\nI was trying to negotiate a few minutes one night at 6 to get the twilight rate, and he was just an ass about it.  Then, the next person in line, he says \"why don't I charge you for a half rack of ribs and give you the full rack?\"  I turned around to see if I was on candid camera or something.\n\nAlso, he acts like a stickler, but there were 6 golfers out last night playing 6 balls.  It was a 6-some... right in front of him, and he didn't say a word.  Probably because he knew the guys.\n\nThis guy should get fired or the city should be doing business with someone else...  whichever the business relationship is....", "author": "John R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-05-10", "description": "A little update to my previous review...\n\nWent to the GGP this morning, beautiful weather, great day for a little round. If anyone knows their system, you're familiar with the \"pay and play\" thing they do. Meaning they only have you pay right before you tee off to discourage having to do refunds for those who are too impatient to wait. So, our crew goes up to pay, and our cashier is the head pro, Bruce W. Olson. That's right--GGP has a pro. The SF golf course that is literally one step above a miniture golf course has a pro. Ridiculous.\n\nSo, Bruce does all of our transactions, not a problem. Well, I forgot to get a drink so I grab one while I'm still in there and try to pay for it. All I have is a $20 and two one dollar bills. The water is $2.25--just my luck. So, I go to give him the twenty, and he asks if I have a quarter. I say no, and he sees my two one dollar bills. So, he demands those (asshole points: 1). I give them to him but I don't have change. He tells me to go ask one of my friends for a quarter (asshole points: 2). He refuses the twenty. I go outside to ask the crew if they have a quarter to appease Bruce. \n\nAs I'm walking out, Bruce follows me and sees one of my friends putting on sunblock. He then yells at us and tells us to hurry up (asshole points: 3). Then, says they don't have time for people to put on sunscreen and that we should know to do that before we're called to tee off (asshole points: 5). Well, maybe if GGP's system wasn't so effed, it wouldn't be an issue. He said our wait would be 20 minutes, it was half that. We weren't ready. So, we \"scurried\" along to the 1st tee of what Bruce thinks is Augusta Effin' National and eventually cooled down after three holes. The stupid thing is that the group ahead of us had a 4 year old who was definitely slowing the group down, which is perfectly fine. Kids gotta learn too. But Bruce, don't rush us along when you know the group ahead of us is going to cause a log jam.\n\nYou know--I really like this game. I can't think of a better way to spend a beautiful weekend morning. But people like Bruce Olson really put a damper on the game. This arrogant pompous shit isn't acceptable. If I wanted to be verbally harassed, I'd be at work. Golf isn't a job for most of us, Bruce. But there's a lot of us that wish it was. I hope you do realize that your job, a certified PGA professional, is one that many wish they could have. Consider yourself fortunate and try to realize that your job isn't as bad as you might think it is. Asshole.\n\nEveryone else, please reconsider taking lessons from here or from Bruce W. Olson. Golf is a great, rewarding game, and if you're wanting to get into it, your instructor makes a huge difference on how you perceive the game. Today's interaction with Bruce tells me he doesn't have a lot of patience and doesn't appreciate his job like he should. I wouldn't let him in my foursome let alone teach me how to play one of the most storied sports ever.\n\nThat being said, I'll be back at GGP, it is a fun couple hours and I'm not going to let this asshole ruin that for me. Don't let him ruin it for you either, so avoid him if you can.", "author": "Josh B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-06-02", "description": "Sunny day, good friends who cheer you on with helpful tips, a couple of irons with a nice wood...what more can you ask for on a Friday afternoon.  \n\nI love this game because it humbles me...everytime.  \n\nThis public course is 9 holes and Par 3.  Cost $13 with a resident card, about $16 without.  It takes two hours to walk through it.  I hear the snack bar smoked ribs are delish here.  They allow private parties on their outdoor deck.", "author": "HY L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-09-05", "description": "This is a hidden gem.  Short course that's really laid back.  Great for a golf newbie like me.  For the money, it's a really fun 9 hole course.\n\nThe greens were a little rough.  But, for around twenty bucks on the weekend, who can complain?\n\nApparently, they have some good BBQ at the clubhouse.  But, I didn't try.", "author": "Dusty B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-10-10", "description": "Great family golf course.  They also have private and group golf lessons (Which I took).  This course is not pretentious at all.  Great for beginners and families.  Usually not a long time to wait.  The grounds are well kept.  And best of all, plenty of Golf Course ONLY parking.  The bus goes there too and I think you can rent clubs for 8 bucks.  There is a small practice range and a putting green.  There is a small club house where you can get something to eat and or have a beer.  I have not tried the BBQ yet but I hear it's good.", "author": "Don J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-28", "description": "-$19 Green fees for 9 holes. \n- exclusively par 3s\n-somewhat hilly\n-fun course!", "author": "Saquib P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-05-24", "description": "A good course for beginners and I really want to give this more stars but the service here is TERRIBLE.\nEvery time I come here Bruce Olson (the dick behind the counter) treats my friends and I as if we were some kind of scum sent to the course to inconvenience him. He always gives us a hard time when checking in if one of us has a credit card and then one by one he hassles us about buying a sandwich or something else as if its not worth it for him to open the register for just the green fee. I know we're just college students so we may not be the 'ideal' clientele but we pay as much as everyone else so he could at least pretend to be a little friendly.\nOther than that the course is fine when its maintained but beware of the weed patches when its not.", "author": "Greenman A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-09-14", "description": "Update.\nI played at GGP yesterday, luckily, asshole Bruce wasn't there.\nThe course was in good condition  so i liked, besides the fact i was joined up with 3 people who couldn't play golf for shit. anyways, for golfers my level, i'll still recommend fleming (for 9 hole, not for 18) once it opens up on 11/1/09 after the presidents cup.", "author": "Shawn I."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-07-01", "description": "We had a really great time here yesterday afternoon.  Enjoyed a nice lunch on the sunny patio, and the food was surprisingly good (http://www.yelp.com/biz/ironwood-bbq-san-francisco#hrid:mktPb_5OnmTlvbr6sn74yQ).  Hit a bucket of balls to warm up before our round, popped back into the clubhouse for a cookie, and then hit the course.  It was my first time ever going beyond the driving range, and I can enthusiastically say I'm now hooked on the game.\n\nAfter skimming many of the other reviews, I must add in a word of defense for Bruce.  He was nothing but pleasant, agreeable, and friendly towards us.  Maybe being there on a lazy Wednesday afternoon helped?  \n\nOne minor negative bit:  Towards the end of our round, play backed up a bit due to a slow group of four ahead of us (not the negative bit since we were in no hurry).  Two kids who had caught up to us got impatient at the seventh hole, and one of them almost hit me when he teed off while we were still finishing up on the green.  Bf was furious.", "author": "daphne w."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-07-11", "description": "This is a great place for a non-intimidating introduction to the game of golf.  I'm no expert on the game so I can't speak to the quality of the course, but you certainly can't beat the price.  The food's also surprisingly good.\n\nAs for the negative reviews about the resident pro, Bruce, I have to say that I've never had a problem with him (or any of the staff, for that matter).  I've even had some lessons from the guy and it's been totally fine.  Maybe some people think that because it's 'only' got 9-holes and it's 'only' par 3 and it's 'only' a muni that they can act like complete asshats.  Every course has its rules, even little ones like this.  Just play along, don't be a dick, and everything will be fine.", "author": "Stew M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-12-29", "description": "Great golf course for beginners.  Confidence building short holes, with a few challenging slanted greens thrown in.  GG is also a good alternative to driving ranges when you only have a few hours and want to practice your short game and putting, because you can finish the 9 holes in around 2 hours and with a resident card cost is only $12.\n\n4 stars for the course as a beginner's/practice/fun course.  Minus 1 star for the sometimes sloppy maintenance, and minus at least 3 more stars for the dude in the golf shop who pretends to manage the place.  I'm not even going to call him a pro.  He's rude, sarcastic, makes fun of any beginners in your group, and just makes the entire clubhouse and first hole experience miserable.  Don't take my word for it -- read the other reviews here.  Ringing up your golf fees is a pretty simple low profile job with relatively little customer contact -- how can one person doing this simple job have made so many golfing patrons of Golden Gate Golf Course so miserable?  The mind boggles.\n\nStill, this can be a fun spot if you focus on just paying him the fee, get out of the shop asap and commence golfing.", "author": "Jack H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-01-23", "description": "Very ignorant management. This is a dumpy 9 hole par 3 course. $19 a round. $13 if you are a resident. I just took a lesson up north last week and needed to practice the irons b/c I'm working to break 90. Figured I could work on my game here. There was a twosome in front of me, and a five-some behind me. The five-some was 2 adults and 3 kids under 10. So I was able to take my time and really wasn't rushing or being rushed.\n\nWhen I got to the 5th hole, the lady working there asked if some dude could start his round w/ me. My response was sure, but that i was practicing and replaying shots - so i wanted to make sure he didn't mind (he said no problem). The lady flipped out. I got a 5 minute lecture on golf etiquette and the course rules. After telling her to bugger off, and being quite pissed off, I continued. I get to hole #7 and the green is closed. The flag is on a hill of weeds planted in the middle of the fairway. So there i stand, 10 feet from the hole reaching for my wedge instead of my putter since there is no green, and the jerk off manager shows up w/ his entourage...\n\nAnother 10 minutes of being lectured I came to understand that apparently the golden gate park golf course takes practice vs. 'precision play' very seriously. That's what this guy actually stated on 7th hole...where the pin was driven into a hill of white flowering weeds with a bum smoking crack in the background. The course was for 'precision play', while the practice area was for practice. I apparently didn't understand the difference....\n\nIn short, the folks that operate this place are idiots and have no understanding of golf or golf etiquette for that matter. The course itself is what i expected for par three and unfortunately it is city managed.\n\nI\"LL NEVER GO BACK AND WILL DO EVERYTHING IN MY POWER TO CONVINCE ALL MY COLLEAGUES TO BOYCOTT THESE FOOLS AS WELL.\n\nThis isn't the San Francisco I love and even sadder they have no passion for the sport.", "author": "Bubba M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-05-05", "description": "While not the best course in the world this little 9 hole course is a ton of fun to play - all Par 3's make it perfect for the beginning golfer or the once a year hack (*cough* Phil H.) I've played this course at least 12-15 times and must say that right now it is in the best shape I've ever seen it -I love the new layout of the holes and we actually walked right on with no wait on a sunny Saturday morning.\n\nBut my absolute favorite thing about it?  For the first time in my life I got a legitimate par that didn't involve a clown's mouth or a windmill.\nThanks, Golden Gate Park Golf Course!", "author": "phil h."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-08-06", "description": "This place isnt bad at all. Four of us were able to get on with no wait on a tuesday afternoon a few weeks back. \nThis isnt the course for Tiger Woods, Phil or even a pro like Me, but it is perfect for the neighbor kid who loves leaving presents in your backyard or your boss who thinks he is the shit at golf, when deep down he knows hes a hack and is probably sitting at home playing with golf gadgets he thinks will be 'fix' his game. \nThere are a few tees to choose from and the tee boxes are fairly well maintained.\nThe course is in considerably good shape and greens run true. (remember the OCEAN break :D )\n\nTip of the day: \nKeep the head down, through impact.....and after the 8th hole, you can loop right back around to the 6th tee for a few 'mulligans'.", "author": "Jason W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-11-16", "description": "Course design/playability: 4 stars\nWalk-Ability: 5 stars\nCondition/maintenance: 4 stars\nDriving range/practice area: 3 stars\nPace of play: 2 stars\nAvg. wait for tee time: 2 stars\nPro shop staff: 2 stars\n\nThe course is fun for what it is. Expect a crowd, celebrate those rare occasions when you get the course to yourself. Weekdays, early Sunday morning, or any time it is raining = course to yourself.\n\nBruce, the course pro, leaves a lot to be desired. I scheduled a lesson time with him three weeks in advance, only to find the day of our lesson that he was the only one working the pro shop. He kept leaving me on the \"range\" to go inside and ring people up. Far from professional, it was a waste of my time and money.", "author": "Greg Q."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-10-10", "description": "***Should be named Clusterf*ck Gate Golf course\n\nThis course has the following things:\n\n1. Super short fairways.  Take out your low irons and your drivers.\n2. Jackasses who walk in the middle of your shot because they have a \"wicked\" slice\n3. A driving range, which consists of a net 20 yards away\n4. Lots of freaking people who bought the Target \"cougar\" $99 special clubs on sale.  \n\nEven after a month of playing on a regular basis, you want some of the luxurious trimmings and wish they charged a bit more to keep out the \"Cougar\" special golfers.  \n\nAnd don't even try to get the twilight rate before its pretty much completely pitch black.  All in all, the course is fun and its nice to get that fake boost of confidence getting par on half of the holes.", "author": "patrick o."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-08-25", "description": "You are so funny, GGPGC, aren't you?\n\nYou love to show me just how bad i am at golf, all the while playing the innocent, \"I'm just a little ol' 9 hole - Par 3, I'm not that difficult...\"\n\nWHATEVER! Then why have i lost so many of balls in your trees huh? Ugh.\n\n...No but seriously, this course isn't all THAT bad. It's actually a nice walk... just make sure you're wearing your golf shoes if you play in the morning because it can get pretty wet out on the course. The fresh air from the trees and the rolling hills are really nice and the course seems well maintained. Plus, i can't even count the number of strange characters I've played golf with here. Mostly older people, in there 60's and 70's, who love sharing their stories with me. Nothing is funnier than watching an old person cuss when they miss a shot.\n\nI've come back here several times and do enjoy this spot. I only play in the morning, so it's usually pretty quiet and not too crowded. The only problem here is the \"driving range\", which is just a net you hit into... it looks bad and they should just get rid of it. It's probably not a 4 star golf course, but for beginners it's a clean, challenging round.", "author": "Greg G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-08-21", "description": "This is where I lost my golf virginity and it was great! Gorgeous day, views of the ocean, I was averaging a par 17 on every single hole. \n\nBe warned- people like me play here! \n\nIt is still fun. And I didn't even care that 10 year old boys were on our ass the entire time. People aren't allowed to play through there, so they had to just cool their heels. I actually dug seeing youngsters on the course, then drinking beer in front of them at the clubhouse. That's right Tiger Juniors! You totally kick my ass at golf, but I can buy all the alcohol I want!", "author": "Krismet C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-03-11", "description": "This is a great course for a beginner like me. All par 3's and people on the course that are patient and don't take the game too seriously. I'm not that good at golf, so I appreciate this. The rates are cheap, the green's are well enough maintained, and they have a little grill there where you can get a pre or post game snack and a drink. The highlight of my experience was when we got to the 9th hole, the sun was setting over the ocean and it was so beautiful! A great way to end a day of hacker golf. \nDon't expect much from the driving range. It's basically a net that's about 20 feet away from where you set up to drive the ball. If that net weren't there, I would have hit it really, really far though ;)", "author": "Julie F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-03-20", "description": "Drinking and driving is legal here.\n\nOrange golf balls welcome.\n\nDid you just post an 8 on that par three... play it again then. No one is watching.", "author": "Steven M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-07-24", "description": "With a golf resident card, GGP Golf Course is the best way to spend $10 ever!  No one cares what you're wearing or what kind of clubs you're swinging.  What's more, no one really cares how many times you whiff before you hit your towering tee shot that goes 30 yards and makes a sharp right mid-flight.\n\nIf you haven't been to the course, it's a nine-hole par-3, with only one sort-of long hole.  No reservations, so head over, get on the list, have yourself some barbecue and beer, then get to hackin'.  Hardhats recommended.", "author": "Gene G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-05-26", "description": "I consider this my home course...however,  today I was dealt a shocking blow by management.  The red face in the clubhouse caused me much grief.  He complained about credit cards.  He complained about me wanting a hot dog.  He bitched wayyyyy to much.  Hey man... we are spending money at your course.  This place is full of hackers and you think that by me eating a hot dog is going to slow down my play?  Why complain about the 3% you pay the credit card company when you get the $18 green fee +balls+beer? That was a bunch of crap.  I'm on the lookout for another home course.  Please let me know if anyone knows about another course that sells anchor steam in a plasitc bottle, has bums hanging out at the tee on hole 7, and has a super crappy driving range where you cannot even tell which direction you hit the ball.  I will be happy to change home courses.... \n\nThanks", "author": "Arlen L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-03-14", "description": "I just love the Golden Gate park golf course!!\n\nThis is a first course I ever played on and it's special to me and my friends.  We just always had a good time here.\n. v\nSo the course is not in a PGA condition, but it is a course that's full of locals and regulars that enjoy this course for what it is.\n\nBig thanks going out to Bruce for giving me and my friends free golfing tips.  We really appreciate the stories and reference behind the art of swinging.  Most important, thank you for finding and return my wallet.\n \nIt all happened after a round of morning golf with my honey, I found that I had lost my wallet and I don't remember where it happened.  Bruce suggested that we start walking backwards from the 9th hole and trying to retrace my steps and maybe I will get lucky.  After walking through the 8th hole and not finding anything, I just felt helpless and frustrated.  Luckily, Bruce started checking the course in his golf car and met up with a group of golfers that found my wallet in the 6th holes sand trap. Bruce then drove to 8th hole to hand me the wallet, and then drove us to the club house.\n  \nBruce, thank you again for saving my day!\n\nMy friends and I never had a problem using credit cards there. \n\nShout out to my crew, Avis, Erich, James, Masud, Matt, Gordon, Wayne and my beloved Kitty Kat.  I want to play with you all for years to come.", "author": "neldog W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-07-19", "description": "I'm a horrible golfer.  I think there should be a moratorium on building golf courses.  Golf is boring to watch. \n With all that said, I love going to a good par 3 course and blowing a couple hours outside drinking beer and smoking cigars.  There is nothing better.  GG Park's par 3 is great.  It's cheap, pretty well maintained greens and $3 beers.  Not to mention you can see Coyotes and skunks run across the fairways.  Seriously, I just saw them last night.  They were attracted to the scent of my horrible game.", "author": "Corey V."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-09-16", "description": "So my kids are taking First Tee lessons here since the most of Harding is quarantined for the upcoming President's cup, so I thought I'd kill some time playing a quick round.\n\nDid I say quick? Why does it take sooooooo long to play here?\n\nI know that this is where you come to \"practice\" or when you're just starting out, but 8 strokes on a par 3?  Really? How is this fun or relaxing?\n\nThis might be okay if you could grab a beer, but at almost $5 each ($4.75 for an Anchor Steam), this is even more expensive that Presidio and Harding.  I spent more on my two beers ($11.50) than I did on the greens fees ($11).\n\nThinking about putting? The greens also are slow and incredibly bumpy. Again not a confidence builder for the kids and newly minted hackers out there.\n\nThe one saving grace always seems to be the other people playing.  Always pleasant, nice to be around.  That's a good thing too since you'll be spending quite some time with them.\n\nMy suggestion, bring your own beer, a book to read while waiting and do a two putt maximum and it might be fun.", "author": "Michael M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-04-28", "description": "Not bad for beginners like me.\n\n9-hole ranging from 109 to 193 yards, I love the location of this place but the conditions are just not very impressive. It's open during most of the year as far as I know, but the course can get beat up especially during cold or foggy weather. Fairways can be unkept with weeds (once found a mushroom growing while looking for my ball), greens can feel like you're putting over sand, and tees can get muddy at times.\n\nPace can be really slow (2.5 hours) during peak hours.  Can wait well over 1 hour for a tee time during nice weather and weekends. Does not have a full range (just netting) to practice/warm-up swings.  No area for chipping.\n\nWill group together individuals into foursomes to speed up play. They are lenient on attire, but fairly strict on \"every golfer must have clubs\" and \"only paid golfers allowed on course\".\n\nThis is a good course to practice short games for residents, beginners, and juniors. If you don't own a SF golf resident card, it's $18 on F/Sat/Sun for adults. Ironwood BBQ on-site is decent from what I gather.", "author": "King L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-06-27", "description": "I am very pleased with their summer golf camp for kids at Golden Gate Par Golf Course.  My 8 year old son has gone to their camp for two weeks and it is very good.  They run it from 9 to 12 and then give them lunch.   They are very customer service oriented and will even pro-rate your days if you cannot attend each day of the week.   Five stars to them for their summer kids golf camp.", "author": "Jeff W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-03-11", "description": "I just started playing and have found that this is a great course to go to. I am slow and i have never had anyone being rude or rushing me. People are very helpful and i had some BBQ today that was really good. I would recommend playing with a  yellow ball because i have spent a good amount of time playing wheres waldo with my ball and the daisies.  I have learned a lot playing at this course.", "author": "Gavin R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-09-01", "description": "My late father-in-law Dell had a friend who played this course every day, and did it completely with only a 7 iron.  I can believe it.  \n\nThis is a great course for hackers like me -- relaxed, relatively challenging fairways, well maintained greens, and really rough roughs (bring lots of balls -- they disappear into the black hole of lost socks or somewhere...).  \n\nTuck in a sweater or jacket.  Even if it's sunny when you tee off, the fog can roll in and you'll be hating yourself if you're not prepared.", "author": "Bevy M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-10-06", "description": "So sad that the Rec & Park Department put their financial interests ahead of the public's well being. Limiting public access doesn't sound fair. This course is great not only for kids, but for beginners of all ages.", "author": "Ricardo L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-08-14", "description": "I enjoy going here and pay a quick round before I go to work at 10am.  I find it a better course than Mariner's Point which is also a par 3 course.\n\nI recently took a friend for their first time to play a round over there and they had a good time despite having a high score. It's a pretty well maintained course and the danger of getting hit  by on coming golf balls is at a minimum(unlike Mariner's).\n\nI suggest to every SF resident to buy the resident card because it saves you a ton of money in the long run.\n\nSo to summarize this course, it's good for a warm-up round and for the beginners that want to try and hit on an actual course not just smashing golf balls at a range.", "author": "Mario O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-04-26", "description": "This is one of those great SF finds.\nI have no clue how to golf (read = can barely hit the ball) but have had a great time golfing here.  Totally unpretentious, totally low-key, and very affordable.  The crowd ranges from 5-year olds in frilly skirts to very serious older chinese women to grown-up frat boys.  \nThe BBQ smelled amazing and I wish I'd shown up hungry.", "author": "Heather C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-01-20", "description": "By the time you get to this review, I'm sure you already know about BRUCE ... no not Springsteen, but the control freak Pro Shop guy.  Here are a few tips to get on easily.\n\n-  Bring Cash... for some reason or another Bruce makes a big stink abount paying with credit cards, even though it is 2010 and everywhere else in the world does that.  My suspicions are that he's too cheap to pay for credit card fees, or he is skipping out on some taxes.  Either way bring cash.\n\n-  Hide the beers in the bag before walking up to the clubhouse ... do that for all courses actually\n\n-  If a friend is walking with you, then DO NOT MENTION IT TO BRUCE ... just start your round; no questions asked\n\nCareful on the 6th hole ... it is easy to hit long here and right into the 7th teebox.  \n\nDont get impatient with beginning golfers slowing the round up ... thats why you bring dank!  Yea you like that BRUCE! DANK!", "author": "Buddy Garrity L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-12-21", "description": "Bruce is a douche. He refuses to accept credit card payments... my guess is so that he can pocket the green fees. The city needs to run an audit on the course and this clown.", "author": "Michelle R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-05-07", "description": "A nice little course with decent variety for a Par 27. If you're a beginner this is a great place for you;  I essentially learned to play golf on this course. It can get crowded, and the wait can be over an hour on busy weekends, but let's be honest folks,  you need time to drink beer and work on your putting anyway.\n\nD.'s Tip of the Day: Keep the head low, watch it go.", "author": "Dustin E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-06-11", "description": "Par three, sound easy rightj, fuck no.  fairways so narrow you can barely walk down them let alone hit a tiny little ball accurately.  a challenge for even the most gifted golfers.  i am not such a golfer so i struggle like a fat man on a diet trying to do well.  but that is the challenge of such a madding game such as this pearl from the scotts.\nso uncle al says", "author": "Uncle AL J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-21", "description": "A short 9 hole course in the beautiful Golden Gate Park.  the Resident can enjoy a very cheap rate $14, my friends told me it is good for beginner practice, as the price is equal 100 balls at the driving range in presidio. Still small challenging here and there. Relax environment not push and rush from the following group.", "author": "Jacqueline X."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-04-21", "description": "As par-3 courses go, this is a pretty darn good one.  GGPGC has become my Sunday night sanctuary.  I've started to head out here for a quick practice round of golf, a few cold ones and a stroll in the outdoors.\n\nThe course itself isn't amazing, but its nicely situated just off ocean beach and even has a few ocean views if you stretch your neck enough to see!  It provides some great practice for the short game.\n\nTips:\n- Go later in the day, the course can get busy on weekend days and it's only $8 if you go just a few hours before sunset.\n- Leave your woods at home -- longest hole is 190 yds or so.\n- Try the food!  I haven't, but looks and smells delicious every time I go.", "author": "John R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-03-30", "description": "The best Beef Brisket/BBQ sandwich I have had since I lived in North Carolina- try the \"Not So Veggie\" with roasted peppers, onions, fresh spring mix greens, cole slaw, and melted cheese on a fresh sourdough roll combined with the steak (beef brisket) they make on the bbq is so good, it falls apart in your mouth and the sauce is all homemade - it is amazing. \nCourse is decent, fun layout, challenging for a par 3, 9 hole course. \nGreat service, fun atmosphere. I'm going back often, even for just the food.", "author": "Jordan S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-04-06", "description": "Hey i am a rotten golfer...Michelle Wei has no worries. That's why I have no shame in looovvving this 9 holers...(around $12) going gang busters with alll the other 9 holers, that don't know the usage of fore except have to look it up in the Joy of Golf...thinking that it was equivalent to fore-play, which it is not ...hit me up bro'.\n\nSo the other perk is the food from ms. culinary academy graduate with the kiddies. Good food for a municipal gig.\n\nI will improve, I will get the stamina for 18...holers....molers....", "author": "miriam b."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-06-23", "description": "I want to begin by mentioning that I learned on this course 25 years ago and still love playing here.  I think it is a great place for beginners and anyone who wants to play a quick 9 holes.  However, it comes at a price... You have to deal with Bruce and his wife.  I can relate to all of those who refer to the negative vibes they give off. I initially felt that from Bruce's wife the first 6 or so times I had to interact with her.  My golf buddy and I could never figure out what it was we were doing that was pissing her off.  Was it the fact that we didn't have a resident card?  Who knows?  She seems to have mellowed out and now there is Bruce, the \"pro\".\nUp until a few weeks ago I thought he was a pretty nice guy.  He was usually polite during our our transactions and then I decided to inquire about junior golf for my child.  He made me feel like I was bugging him for asking about their junior golf program.  It would have been a quick 3 minutes to answer my question about availability, hours and price but he couldn't maintain eye contact or stand still long enough to make that happen.  I left thinking he was having a busy or bad day, maybe even adult ADD but still wanting my child to try the golf camp.  \nSo, here's the feedback my child and his friends gave about a session with Bruce, \"He called us Idiots!.  All of us. ( there were 8 kids ). Bruce overheard and came over to clarify.  He said, \" I didn't call you idiots.  I said you were acting like idiots.\". My kids:  \"he got in the golf cart and chased us with it.\". I asked the other kids and they said it was true but Bruce was driving super slow.  Unbelievable.  I had a talk with Bruce just to see if any of this was exaggeration but it is not.  In spite of Bruce, they had fun playing golf and want to go back but asked if they could have a different instructor. \nConclusion:\nGolf course : 3 stars\nBBQ and scalloped potatoes: 3 stars\nBruce's wife: 2 stars\nBruce: 5 star A$$HOLE", "author": "Jeannie S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-09-30", "description": "It's a good 9 hole course, but I don't care - I'm still docking it 1 point because of my debacle on the 6th hole. \n\nMy ball was stuck in a deep muddy rut just off the green and well over half of it was buried. I kept hacking at it only to move it an inch or 2 closer to the green. Then I finally managed to swing thru the mud and sent my ball flying way over the green and into more mud on the other side.  @#$%^&!\n\nCan I blame it on the rain? \n\nAnyway, all in all a good course and a fun afternoon.", "author": "Josh B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-04-17", "description": "the golf range is a joke. Most golf shops have a better \"golf range\" then this.", "author": "Lawrence Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-09-08", "description": "What a gem.\nDon't play here if you expect luxury.  \nDo play here if you want a beautiful little par 3 in the middle of wilderness.\nWe grabbed a bagel and coffee before hitting the course.  The owners are very nice.  $18 weekend rate for non-residents isn't too bad.\nEveryone on the course was friendy, and most were mediocre golfers (ourselves included).\nThey serve BBQ and beer, which hit the spot after a neck-in-neck contest.  \nOne of the best pitch n' put courses I've played on.", "author": "Eric S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-03-27", "description": "Great Par three course in The City\n\n5 Stars when its not crowded and nice out\npretty good bbq too\n\nPhony when its crowded almost 2 hrs to play after waiting to tee off\nDont want to be negative so read other reviews on the pro shop they are pretty accurate and sometimes they act like your at Harding\nPrices went up on everything recently\n\n\nIts still GOLF though and that can never be bad", "author": "Scotty B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-04-22", "description": "Yeah I have to second Logan R's emotion, in my experiences Bruce has been nothing but helpful, he just won't put up with bullshit, and what I have found Bruce treats you with the same respect you show him, which as a patron of the GGPGC I really appreciate.  I showed up on a monday, Bruce recognized me, and without a word he scooted me out onto the course so that I, a single, could get ahead of a threesome getting ready to tee off, he only said \"just pay at the turn\".  that is some serious trust and respect, thanks Bruce.\n The course is beautiful and fun, if you need to work on your chipping from 25-45 feet this is the course for you.", "author": "Hapless C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-18", "description": "Love GGPGC.  We love this course, the folks who run it are great, the course is challenging enough for beginners, like us, and as long as I bring brightly colored golf balls so I don't lose the white ones in the clover I'm a happy duffer.", "author": "Lynda W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-27", "description": "Ahhh...yes...my fave 9-hole PAR 3 golf course in SF!  Nestled in GG Park near Ocean Beach...this course rocks when you just wanna stay in the outer Richmond and hit up a few holes.  $19 green fees...go on weekdays and no wait!!", "author": "Patrick C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-09-23", "description": "It's a great course, well kept up and nice for a few hours of fun. Watch out for Junior Camps on weekdays during the summer around noon, they bog the entire course down. \n\nWhat people say about the management is true, though. Bruce is alright in small doses, but give him any reason to have to deal with you for longer than he wants and he'll be a colossal asshole. His wife Dora's a charmer, though, and will work with you the best she can if you've got some sort of problem rather than just shrug you off.\n\nIf you're sending your kid to summer camps there, make sure to check who's teaching them on the second and third days there. Bruce likes to hire someone for the first day who is a great golfer, then just have his teenage son supervise it afterwards. \n\nThe food is delicious, but pretty limited in scope. They home-make their barbecue sauce, home-cook their meat, and don't use microwaves if they can help it. The hotdogs are overpriced and less than great, spring for a sandwich. Coffee's good, but pricey. \n\nGet to the course as early as possible, it opens at 7 and sometimes a bit before. Other than a few seniors who'll talk kindly and let you play through, you won't have much hassle, and watching the sun rise over the course is a much better experience than racing against it at dusk for twilight rates. \n\nAll in all: Golf is cheap and fun for the non-professionals, management is less than satisfactory, and food is okay if you make sure to get the okay food. A solid three stars, or a 4-4.5 if you don't count the management.", "author": "Tyler B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-08-30", "description": "Remember, the higher your score is, the less you pay per stroke.  :-)  It's okay to be a beginner, especially on this course.  The fee is pretty decent and it's relatively easy to walk on to the course.  There are no water hazards which is great but there are pretty narrow fairways for a beginner course.  Generally, a great place to learn how to play golf in SF.", "author": "Wendy L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-08-18", "description": "I played GGPGC a few weeks back, and I was very disappointed.  I heard from a few people that this was a nice course, but I have to disagree.  First off, when my buddies and I parked, the parking lot reeked of weed.  When we went to get started, the guy in charge told us that it would be at least a 30 minute wait.  After killing about 40 minutes at the putting green, we finally were able to tee off.  From the first hole I knew it would be a bad experience.  The tee box grass is so long that it shouldn't even be considered a tee box.  There is no fairway at all, after the \"tee box\" it's all rough until you get to the green.  I've never played a course, even an all par 3 course that didn't have fairways.  The one bright spot is that the greens were pretty well kept.  If you like hitting from the rough all day, then this is the course for you.  OR if you're good enough to get from the \"tee box\" to the green in one shot every time, this is the course for you.  This is one of the cheapest priced courses I was able to find in the area, and for good reason.", "author": "Christopher M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-04-30", "description": "A Hackers Delight! You here FORE on every hole and balls are flying. It is a pretty nice little Par 3 course to practice on though.  Played on a Sunday ($18) and had a 20 minute wait, not bad. Beer Prices at $4 are reasonable.  The tee off areas are a little shoddy and manicuring of fairways are not that great, but for the ambiance of GG Park and the nearby ocean it can't be beat.", "author": "James H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-02-06", "description": "This course is perfect for what it is built to be: an accessible, 9-hole, par 3, simple course in the city for weekend golfers.  For the ease and the price it is hard to beat.  Sometimes it gets a bit dangerous with random Sunday duffers taking wild swings that could potentially ruin your day, but hell... it makes the game more exciting.\n\nThe driving range is disappointing given that the net is 20 yards in front of you, but you can't expect much from a driving range in the middle of the city.  Also, the pricing for the driving range is still a bit steep given they don't really use much overhead to pick up the balls.", "author": "Adam O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-11-09", "description": "Another 4 star review from me.  Shocking, I know.  \nGG Park Golf Course is solid for what it is.  It's a small par 3 course made for beginners, but tough enough to frustrate seasoned golfers.  I kind of love it.  In fact, whenever I can I head out to this course and get in 9.  There is often a wait, but once that is over play typically moves quickly.  I can usually sneak in 9 holes in under two hours.  \nThe course isn't that well kept and there is the strong  possibility you will be hit by a ball...but who cares?  Buy yourself a beer and keep walking.", "author": "Blake W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-05-06", "description": "Is there another golf course in the City where there's a guy walking around the course with a bag of beers, Budweisers no less, ready to sell you one right in the middle of your swing? NO! \n\nOne time a fox ran off with my ball when I was on the (short) fairway. Thanks, pal. Good thing that was an X-Out.\n\nThis course is charming. A great pitch and putt. Fun for a weekday afternoon when you're playing hookey from whatever it is you normally do.", "author": "Valerie V."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-06-17", "description": "The course is what you get for your money and I guess the service is too.  So I'm going to do this review in two parts, one for the course, and one for Joe Cool aka Bruce Olsan.\nThe golf Nazi Bruce Olsen had my friends and I on the defensive before we even made it to the counter.  I had one of those plastic rings that hold 6packs together and he was instantly all over that, questioning me if I brought beer and if I didn't than how come I was holding the 6pack rings(I had just stuffed a sixer of Buds in my bag)  I felt like I was getting interrogated by David Caruso.  Then he wouldn't let us sign up until our 4th member showed up ( wouldn't even let us pay in advance) In Bruce Almighty's own words it's his 'control mechanism.'  So by this point we are fuming waiting around when Brucey Olsun walks back out and begins questioning my buddies girlfriend, telling her she can't walk the course with us unless she pays, and furthermore can't walk the course unless she has clubs.  What is this Torrey Pines?  There's public trails throughout the course, it's in the middle of Golden Gate Park and she can't walk the course with us? Wow, we should have left right then but we had limited time so we stuck it out.  Then there was the credit card deal (read below reviews for that)  It only took Bruce Oslin ten minutes to ruin our good moods and get us bitter and heated, which is not what I come to any golf course for.\nAs for the course, its not bad-all par threes.  Its only $14 w/out a resident card and the COURSE is well worth it, but not the b.s. you have to put up with to get on it.  I will probably try to avoid ever going back here solely because of Bruce Ulcern.  If you do decide to go, just know what to expect, pack away your own beer and wait until you get to the 2nd tee to crack em.  Oh, and congratulate Brucey on his lifetime achievements on being a golf pro at the luxurious GGP Golf club.  The unbridled power associated with this job must be immense - we can only imagine.", "author": "Scotty A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-04-29", "description": "3 par golf course, 9 holes....super fun!!!!\n\nLove the cute little club house.  Anchor steam in a plastic bottle.... awesome!  Definitely a first for me.  And the hot dogs were pretty banging as well!\n\nI was here Sunday late afternoon, what a great day to play golf!  My date loves golf and totally surprised me with this course and the idea of playing golf on a date.....  I had a BLAST!!!\n\nSuper mellow environment, great place to bring a beginner, someone rusty like me or to just get a practice round in.\n\nI am definitely coming back!", "author": "Inga B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-06-08", "description": "For a par 3 course, this place isn't bad. It's cheap and close to home. It's good for a quick afternoon game. The only thing that it's lacking is a proper driving range. The one they have is just a net and isn't much better than the kind you use to test out clubs at the local sporting store.\n\nThe course is fun though. You'll find me back here again soon.", "author": "Michael T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-11-16", "description": "pros: place is cheap, quick, peaceful, might give you confidence on your game (hole 6), great for beginners\n\nCons: staff is awkward, pro/owner is exclusive, pitch & put, driving range is non-existent", "author": "tony b."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-08-21", "description": "This is where I got my basic introduction to golf.  The price is right at $10 with a residents card, and the course is kept in pretty good shape.  The crowds are unpredictable but the wait times are never too long.  They have a nice putting green to kill the time.  Best of all, everyone that I've been paired with has been cool and there is a really laid back attitude, a great place to learn.\n\nI have to agree with Stew M., I've read and heard a lot of negative things about Bruce.  In my own experience he has been nothing but friendly.  I guess he's different towards everybody, but I haven't seen anything like whats been described here.  My only gripe is that the beer is over priced, but that seems to be true of any golf course.  \n\nBottom Line:  If you live in the city and haven't been here check it out, there is not a better way to spend 2 hours on a nice afternoon for $10.", "author": "Jim O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-04-07", "description": "Dooder, come on!!!\nWhat's everyones gripe with Bruce?! The guy probably deals with more smug assholes(read other reviews) in one day than a glory hole in the Castro! first off: I saw bruce drive that guy that lost his wallet around to look for it, would an \"asshole\" do that?! Second: as I was grinding a tasty pulled pork sandwich from the pro shop,(which is his BBQ, and quite good, btw) I watched him, as the afternoon crowd showed and overwelmed, take care of them, stop,  go to the putting green where a lady who was putting with a wedge was,  ( and destroying the green) and politly gave her a rental putter and showed her how to use it.\nTalk about managing expectations...\nAs for the credit card issue, I wouldn't kno, I pay cash, but if I was a betting man, id say that he probably hates dealing with the card machine and all the paper work that comes with it.  He's oldschool man, and in this world of newschool pussies, we need someone like that keeping it honest,(watch caddyshack for chrissake) \nAs for the course itself.  I live for the 6th. \n\nP.S.\nIf Bruce gives you shit, don't get your panties in a bunch, how are you going to shoot a low round if your already psyched out dummies!", "author": "Logan R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-10-14", "description": "Beautiful views and challenging golf holes here, but they don't offset the snippy, borderline rude behavior of the man and woman behind the counter in the pro shop.  From now on, when I want to play a short course in S.F., I'll head to the Fleming nine at Harding.", "author": "Dan W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-06-07", "description": "what the god damn fuck? ive been playing since i was 9. sure i havent picked up a club for 5 years or so. \n\nehhh.\n\ntheyve improved the place shit  fuck tons. i remember when this place was a dirt course.\nbetter fitted for motocross than golf........\n\nhey did i ever mention im a member at lake merced country club? why dont i play there? i shot a 55 on a 9 hole, par 3 course. yeah puck you too. pops would beat me ass if he hears this.\n\nplastic bottles of anchor? wow. coolio", "author": "Euge L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-07-01", "description": "For what this place is, I liked it. The \"driving range\" is only a cage, but at least it serves as a place for warming up with a few shots. I spent the day teaching my girlfriend how to play golf and this course was perfect for that. I was able to work on my short game, too. Overall the course was in nice condition and offered a decent challenge and some nice scenery. We didn't have any issues with Bruce, so no complaints there.", "author": "Greg J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-10-23", "description": "I'm always amazed that this place isn't packed.  I've never waited more than 10 - 15 minutes to play here.  The course is extremely well kept and beautiful.  The price is super cheap.  And Bruce (manager) is a friggin' great guy.  We love this place.", "author": "arlo h."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2005-11-04", "description": "I love this place. Take that with a grain of salt; it's not like I'm a serious golfer or anything. But for my money (which isn't much, since I have a resident's card - get one of those at Harding Park), it's one of the best ways in the city to spend a few hours. Most people don't even know it's there (turn left into the park at 47th Ave and Fulton) which means you can often get a few minutes alone on the course. Especially when it's foggy. It's tiny, only 9 holes, and feels like a cozy little hideaway behind the tall trees. A great place to learn to play.", "author": "Megan W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-09-27", "description": "This is a very nice par-3 course, right in scenic Golden Gate Park. The course is great for beginners - the longest hole may require a 3 wood, or a long iron off the tee. While this course can play quickly, it is not uncommon for long delays on the tees. It is a muni course and typically tends to attract the beginners and mid-tier golfers. The course is very inexpensive and an enjoyable way to spend 1 1/2 on the course vs. 4+ hours... If you're from out of town and looking for other nine hole choices - try the Fleming course at Harding Park, which is a longer, more difficult 9 hole course. Golden Gate offers a fun golfing experience in a beautiful setting.", "author": "Stanley K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-05-09", "description": "This is a tough course. Especially if you're sixteen and drunk.", "author": "Nicholas E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-04-13", "description": "This is a great, short Par 3 course. Perfect for beginners. this place is super casual - people had on jeans and sneakers. Very affordable too.", "author": "Heather M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-05-21", "description": "my favorite \nperfect with fiends. great decor. great service \nask for bruce or his wife", "author": "germain m."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-06-26", "description": "Golden Gate is the ideal beginners course. Beware however as your score will almost always be higher than you think at the end of a round. The course is not in the greatest condition, but thats why the price point is where its at. I would play here much more often if it weren't for the infamous \"Bruce\" who controls all aspects of your golf outing from the range to the course to the food. When not behind the counter yelling at you for paying in 20s, hes out patrolling the course as a marshal speeding up play even though your running to avoid him. All in all, this is a great course but you've gotta escape from Bruce to have a great time.", "author": "Kerry C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-09-05", "description": "I'm not a golfer, but I stop by this little 9 hole course hidden at the western end of GGP practically every weekend in the middle of one of my bike rides.  All the holes are par 3's, the longest being a modest 189 yards.  Lots of people carry  just a light rack of irons and a putter.  City residents can get a \"residents\" card at City Hall, and play at a discount ($12 per round, i think).  There is the Ironwood Barbeque there with great sandwiches, soda, sport drinks and beer.  The fairways are narrow and bordered by Monterey cypress trees which have been trimmed to all sizes and shapes. .  Somehow, many out-of-towners  have discovered this spot, and arrive by cab from downtown hotels!  It's a beautiful spot.", "author": "Gordon J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-05-23", "description": "It's like the movie Anchorman.  For what it was (another sophomoric Will Farrell movie where he has undeserved confidence), Anchorman was great.  That's like this course.  It's well maintained, cheap, and has always been fun.", "author": "A. S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-09-05", "description": "There is probably no better golf course in the world for a beginning golfer.  The atmosphere is great.  Pretty much fun, fun, fun.  I brought my wife here since she is not comfortable playing normal regulation courses with me.  I had a great time.  We were paired with two guys who didn't know what the hell they were doing, but all four of us had a fun time.  The pro shop consists of paying the cashier in the restaurant who will give you your tee time.  Expect to wait an hour or more on the weekends.  Get one of their crazy food bowl combinations.  They're awesome.\n\nNow for the two star part, which really only relates to the course itself.  If you're the type of golfer who expects incredible service, immaculate fairways and gets upset when your playing partner accidentally steps on your line, then you are at the WRONG golf course.  This place is about having fun and nothing else.  The fairways are atrocious, having been completely overrun by clover in many cases.  The greens roll about as true as putting over gravel, simply because the newbies don't know how to properly fix ball marks.  (I tried to fix as many marks as I could, but the task was overwhelming.  I probably fixed 100 marks and left 1,000 untouched.)  Even the tee boxes are beat up with one interesting caveat being the bizarre number of directions the divots point.  (I've seen some 90 degrees to the correct line of flight.  Hmm.)  So, for anyone who is even a remotely decent golfer looking to do some serious short game practice, you should probably look somewhere else.  \n\nHowever, if, regardless of playing ability, you are just looking to have a great time, drink a couple of beers and not care about course conditions, you'll really enjoy this little gem.  I'm sure we'll go back here many times over the years.  \n\nOh yeah, there are a couple of total whack jobs who have been sitting at the clubhouse every time we've been there.  They constantly argue about who is the better golfer and how great they are compared to everyone else.  One knucklehead was talking about shot-shaping...on a Par 3 course...no one can be THAT stupid.  Dudes...Get a friggin' life...you're at a nine-hole Par 3 muni.  No one is impressed.  Now  go drink a beer.", "author": "Robert M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-03-02", "description": "It is what it is.  A cheap, muni par 3 intended for beginner use.  Great place to learn if you've never played golf before in your entire life.  That said, it also means it's one of the slowest, most torn up, hazardous golf courses in the country.  Oh, with regards the expression \"FORE!\"  At GGGC, the people playing here (I'm not a golf snob, but seriously, no way you should be calling them golfers - kinda like calling that kid on a bike w/trainers a bicyclist).  either don't yell \"FORE!\" at all -or- yell it 10 seconds after the ball has already hit somebody.  Wear a helmet!", "author": "Sy K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-09-26", "description": "Golden Gate is the perfect golf course to practice your short game for the experienced golfer. It is a short par 3 with the last hole being the longest hole in the course, probally needing a wood to finish of the game. It is a nice and quaint course which can be crowded with locals during sunny days. The staff is great and the course has a cozy and laid back demeanor. With it being a municipal course, it is well maintained and the clubhouse serve killer BBQ! All in all, if you want to play a quick golf game with no hassles, this is the place to play!", "author": "Michael S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-09-26", "description": "The pro is kind of a jackass. The course is what it is. Bring beer. Good place to play if you're teaching somebody to play for the very first time. Otherwise, you're 100X better off going over the Fleming with the resident card.", "author": "Dangerous J."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-02-09", "description": "I stopped playing here.  I refuse to pay good money (even though it's pretty cheap) to put up with Bruce.  The guy is a compleate dickhead!  I like the course and sometimes only have time for nine holes but I abuse myself on the golf course, I don't need it in the clubhouse also.  Even worse when school gets out, his son, Bruce2.0, will be out of school and back to belittle you while Bruce is busy on his laptop.", "author": "steven a."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2005-04-29", "description": "This place is a true hacker course. Wear a helmet because there's a good chance you'll see a few balls zip by while you're teeing off. Not a very well maintained course, but it's great for practicing your short game, and knocking the rust off your game after a few months off. Get a resident's card, and it's dirt cheap.", "author": "Nishan K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-03-30", "description": "This is a short par three executive course.  For what it is it is decent, but it's not a true golf course.\n\nPros:\n- cheap ($10 for a resident)\n- good for beginners (you'll feel out of place if you aren't a beginner)\n- in good shape, the greens were consistent, the sandtraps were solid\n- a few challenging holes - there are 4 legitimate par threes on this course (by that i mean, 140-180 yards, and some challenge - protected green, two tier green, tree blocking potential tee shot etc.)\n\nCons:\n- Fivesomes, sixsomes etc.  i was flying along then waited 20 minutes on one tee due to a group of five and six.  \n\nReally you get more than you pay for, at $10 it's a good value but I'm not coming back here unless I have a first time golfer or pre-teen kid with me.  I can't give it any more than 2 stars, it's all relative and this is a relatively bad course.", "author": "Fred J."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-09-13", "description": "So i've heard they improved the place, but i don't really care. i'm not trying to sound mean but i hate playing at a course that attracts mostly beginners because it slows everyone's game down and there's nothing but par threes so it's not very challenging. If you can't hit your drivers or woods and are looking for a short course you can play by just using your irons, then come here. I just won't be there.", "author": "Jen Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-21", "description": "This place is a gem. Inexpensive. Generally in good shape. Management, are very welcoming, and do an excellent job of taking care of the course. I play here frequently and will be very pleased if little changes there. Plus, I would agree with those who say that the BBQ here is terrific. Lovely to sit with a beer and a plate of food and look over view of the 5th hole.", "author": "randy b."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-12-09", "description": "Fun and easy (is golf ever easy?), this place is a great little 9 hole to take your beginner friends.  It is casual and has great bbq, doesn't sweat the crew loading up our bags with their cheap beer pre round. When the weather is nice it is gorgeous and signature SF because of the ocean views and cypress trees. When the weather is bad it is just fun to be out in the thick of it. I'll go back and back and back. And I'll probably also keep sneaking over to Park Chalet for drinks post par performance. The combination is winning for sure.", "author": "Val G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-07-20", "description": "It's sad to see this place go downhill.  It used to be so welcoming here and great to watch older kids play.   These kids were really good and well behaved.  The last time I was here Bruce was grumpy and making negative comments about people under his breath.  The women who works there ran out and was threatening a group of kids to behave \"or else\"!  I had played with these kids before, not only are they nice kids, but play better than most adults who play at GGP.  Too bad management sucks.  Parents are now paying for Bruce's son to teach golf camp.  This kid is far from being qualified to teach youngsters.", "author": "Flog G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2005-04-11", "description": "This is a great course for a beginner.  Pretty much everyone at the course is a beginner so you don't feel bad when your ball lands on another holes green.  The maintenance on the course could be improved but otherwise a fun casual place to learn.", "author": "Diane R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2006-11-07", "description": "Their driving range is essentially the size of a tennis court.  It doesn't give you a good feel for how far you're driving the ball or if it's hooking or slicing at the end of your drive.  No thanks!", "author": "Tim G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-05-01", "description": "For how cheap it is, you can't go wrong.  Weekday twilight rounds are $8, full price on weekend is only $18.  Fairly boring course layouts, not too challenging, even for folks like me who've only been playing a short time.  You can drive the green on almost every hole.\n\nGG, like Lincoln Park GC, struggles with dandelions in the fairway.  As such, it can be a challenge to find your ball.  Consider playing with a yellow or pink ball if possible.  Also, waits on the course can be considerable, as players tend to take practice shots, mulligans, etc.  \n\nGreat way to spend an evening.  Go elsewhere for your weekend rounds.", "author": "Josh B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-06-27", "description": "This is my home course so it's hard to say anything bad about it... but the greens are fucked and the price on the weekend is way to high....", "author": "Noah T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-08", "description": "Love this place. A nice 9 holes for people who want to enjoy some golf but can't finish traditional 18 holes.", "author": "Christine C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-10-07", "description": "i have golfed here when the #1 tee was by the putting green.  I recently went about 2 months ago to give it a try again and I like how the new set up is now.  It is a great beginner course which is perfect for me.  The greens are so so, the so called \"fairway\" is basically rough, which I like to hit off anyhow.  You can definately knock down 2 or 3 pars on a round.  I think the course is worth it if you have a resident card.  I think  it is a bummer that on friday, they charge you the weekend rate.  Still, not bad to just hit and have a nice walk, I have encounters mostly beginners that play on this course.", "author": "Pedro N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-01-19", "description": "When I do have time for golf, this is my favorite in the city.  9 holes is just perfect on a Sunday afternoon.  \n\nThe place is kept up real nice and I get a big discount being a SF resident.", "author": "James B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-05-13", "description": "Well, Josh B., you've inspired me to follow up. First off, I love the course, the price, the location, everything (except the driving *range*). But truth be told, Nobody likes Bruce Olson, nobody. In fact, I play there once every couple weeks, and 9 times out of ten some random person I team up with has something to say about him: \"I don't like that guy\" or \"what's his problem\" or \"what a dick\", and without me bringing it up. People don't understand why he's there, why he keeps his job. The younger guys are waaaaaay cooler to deal with, even the European lady is better (and she's barely competent, sorry). It's like, you cringe when Bruce is behind the counter, you're just waiting for the simple transaction to be done with, but even on a *good* day, the prick is trying to push a beer on you. \"No, thanks, maybe later.\" And he'll say, \"You can get one later too.\" or something to that effect. I GET it Bruce, you're trying to UP-sell, but you're so pushy about it, every time. Old Abe knows when he wants a brewskie, believe me, if I want a beer, I'll let you know, but I won't be putting a tip in the jar, because you're a douche. Everyone says so. Should we be honest? You should be fired. FIRED FIRED FIRED. I've been fired for being HALF as much the douche you are, and for one TENTH the amount of time on the job. What's the deal, man? All that aside, I think the course is a fantastic addition to the park, an outstanding use of public lands.", "author": "Boom Z."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-07-22", "description": "This is a pretty, very nicely maintained mainly par 3 course right in Golden Gate Park at the northwest end.  The rates are reasonable although the weekday green fee of $15 , $19 on weekends (unless you have a resident card or are a \"junior\") is only for 9 holes; you must pay again if you want to play again. One thing is that the people who run it aren't very nice. They act like they are doing you a favor to let you play there, as opposed to treating you as a valued customer. If you have questions they will act impatient with you.  Most of the time they will insist you play with people you don't know if you are a single. Also their twilight deal is unreasonable; they will not let you go out until one hour before dark to get the $8 weekday twilight rate, which does not even give you time to complete 9 holes.  (Compare this to Lincoln Park, another San Francisco City Course where twilight starts after 3 p.m.) It also costs $4 to hit a small bucket of balls on their practice range, which is not even a driving range, but an enclosed area with a net about 20 feet away, artificial turf and those tacky rubber built in tees. If the people who ran and work in the facility, including the little luncheon grill located in the clubhouse, were nicer, it would be a really sweet experience all in all", "author": "Alfred D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-04-03", "description": "i felt really comfortable here and was even more happy when they didnt even bat an eye at my sweat pants and college tshirt. although this place doesnt have a full on driving range, the practice range does just fine for fine tuning your accuracy.  -1 star for having to dig my own range balls out of a giant bin. ewwwwww wet grass hands.", "author": "Aly L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-02-01", "description": "I'm giving five stars just for the food. That's right, best sandwiches (BBQ) in the city. Good place to sharpen up your short game as well.", "author": "Jeff B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-04-12", "description": "this is a very fun course and the staff here are very nice.  you can practically use a pitching wedge for every single hole.  the price is the best for bringing your kids here, because it only costs 4 bucks for juniors compared to the 10 bucks you spend at harding.  The food here is delicious, but very expensive; no worries, you can drive 4 blocks and eat at burger king :)", "author": "l h."}
