{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-22", "description": "Awesome park. The set up is creative and gives kids lots of things to do. The cardboard slide is awesome!!!!! Also lots of room to sit and chill for parents and guardians.", "author": "Anne B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-02", "description": "The slides are fun (and scary) even for adults! At the top, it's almost vertical! I climbed up with my 4 yo and 2 yo. It was a fun ride down! There was plenty of cardboard at the bottom of the slides. Tip: someone dumped a pile of sand at the top, I guess it makes the ride down more smooth. \n\nThe carousel was closed (Wednesday)\n\nThere was a section of the playground that closed. \n\nMy kids liked the swings, the wave wall, and the play structure. There was also a spinning chair that the kids loved.", "author": "Jenny L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-26", "description": "This was a great playground for the kids.  The concrete slides were super fun and unique.  Or should I say unique to me.  Plenty to climb on, swing and have imaginary playtime.  My daughter got a much needed play day here.", "author": "Zen D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-22", "description": "TEMPORARILY CLOSED FOR REPAIRS UNTIL MID MARCH 2018\n\nBeen going to children's playground since the 70's. While it is completely different than it was back then I've brought my kids here many times.", "author": "William S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-16", "description": "This is really a wonderful playground for all ages! It's large and spread out with plenty of space to run/play/climb/dig. The cement slides are always a hit as is the actual playground equipment.", "author": "Nikki R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-23", "description": "When we went last year, a section of the park was closed because it was dilapidated and needed to be rebuilt. Otherwise, it's easy to park and have kids walk around. We paid for the carousel ride too.   I suggest packing a lunch for the kids and eating it there.", "author": "Jboogie L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-17", "description": "This place is outstanding!  Beautiful, lots of activities, free and free parking! Strongly recommend as a must visit to give the kids some time to stretch their legs and explore!", "author": "Kelly D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-21", "description": "We came here on a gloomy, Monday morning and the girls and I still had so much fun.  $2 carousel ride (the girl attendant who wore tie dye shirt and purple hair was so nice and cute), we got ice cream, climbed, slid down using cardboard, you have to make the most of crummy days! We will def be back. We love it here.", "author": "May A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-28", "description": "#81/2016     \n\n\n**500th Yelp Review**\n\n\nOne lonely check-in belies the scores of times I've taken my little boy to The Koret Children's Playground in Golden Gate Park since he was three years old. \n\nUntil I switched to near-exclusive mobile access on Yelp and stopped chasing an active then-toddler/preschooler, I guess I never noticed.\n\nFrom the age of three we've been coming here for rides in the saucers, rocket rides on cardboard squares down the hillside slide and clamoring up the netting pyramid where, despite my pleading, my preschooler kept climbing all the way to the top.\n\nAnd if you saw how tall that structure is, you too would've been having heart palpitations and yes, I needed help to get him down!\n\nAll this anxiety, it's a perpetual state when your child is that tiny and even small spills produce buckets of tears and a crumpled little face.\n\n(Your heart hurts and you hug them tight.)\n\nPushing him for hours on its swings, taking turn after turn on the carousel as I parceled out dollar bills, gulping down hotdogs, rescuing from places too high to have climbed, weekly soccer practice and school parties at the little red barn.\n\nIt's all been here.\n\nThis child I wanted so dearly and God blessed me with, this is the place of dear and bittersweet memories.\n\nIt all goes too fast....but there is still more time.", "author": "Jennifer O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-28", "description": "One of the best playgrounds for kids within Golden Gate Park of San Francisco in general.\nThere is many things to do here at Koret Playground, whether going to the structures that are built in sections for Big/Small kids, Recreational Structures near the Play Structures, Swings, a stone slide where you sit on a cardboard and sway you way down the rock slide or even a look-a-like spider web christmas tree that many kids seem to climb on.\n\nAside from the play structure and sand, there is plenty of green grass to sit on and enjoy your surroundings. Have a picnic, have a family gathering, plan an event, or just sit down and relax and take in everything that is happening around you. \n\nThere is also a Carousel which you do have to pay for, but who doesn't like a good Carousel ride on top of cute intricate designed horses and carousel medley's???\nNext to the Carousel is also a snack station, snacks for purchase. \n\nMy little sister's classmate held an adorable little farm birthday that had a fence full of adorable little farm animals at the Koret Playground. My point is, birthday parties are definitely nice here and I find Koret Playground to be one of the perfect park areas to hold a birthday.\n\nOf course, there are also public bathrooms that have a good amount of stalls. It is decently clean inside.\n\nParking can be A PAIN and i mean A HUGE BIG PAIN. Parking is very limited here....you would have to find parking on the street which is hectic as well. \n\n**My only tip and concern about this park is that it is huge, therefore you really need to keep an eye out on your kid.....especially the little ones. There are honestly so many different places within this park that your kid may run off to.", "author": "Stacey M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-24", "description": "Awesome huge playground located in the beautiful Golden gates park. It's such an awesome playground that even my cousin and BFF wanted to play....and we did. When you first arise at the playground area there is a sign that says \"Adults must be a companies by kids.\" Which is awesome so you can weed out the creepers. We need one here at home in LA to warn the creepers supposedly going to the park their niece/nephew, children they babysit goes to without the kids because that's just....CREEPY!. The kids aren't there why are you? Looking to take someone else's? Yah no thanks!\n\nAnyhow this awesome park are separated into multiple sections; one for the playground for little kids, and one for the bigger kids, the cement slide on top of the hill with multiple cardboard for you to use to slide down (So fun!), a carousel, seasonal concessions stands. The play ground had this rope climbing pyramid spiderman is contraption which was awesome. Their was wave like structure that kids would climb on to. It's like thee most awesome play ground everrrrrrrrr! I always bring my kids at least once when we're in SF. This is definitely a must go place if you're visiting with kids (^_^) Be prepared to meet your inner child as you squeal with excitement at the park", "author": "Marilyn C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-15", "description": "Nice park for kids to play. Need more food vendors in the area to eat and seat down area. Not enough parking spaces.", "author": "tim t."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-02", "description": "This place is amazing !! So clean , as well. They have slides for all ages . Will definitely be back when in SF.", "author": "Lupe A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-06", "description": "What a park! This playground could possibly be one of the best I've ever seen--something for kids of all ages and abilities. Swings, slides (the cement slide was too much for my 4 year old but the 6 year old couldn't get enough). There was plenty of cardboard sharing and he also spent half the time without cardboard so don't make a special trip to get some. \nBathrooms are huge and clean and there weren't really any suspicious looking people around. The grass is great for picnicking too! \nPlan to spend a long time here because once the kiddos start playing, it'll be hard to get them to leave! \nFair warning: lots of sand here, be prepared if you don't like sand in your shoes.", "author": "Carmel M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-13", "description": "Cutest park for my baby plenty of swings , slides and play area for kids of all ages. \n\nWill definitely visit again", "author": "N S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-23", "description": "This is a fun playground with some interesting features.  \n\nThe very unique concrete slides alone are fantastic.  Kids grab a piece of cardboard and zoom down these suckers into the sand below.  And up they go again for another slide down.  And another.  And another.  \n\nThere is also a nice play structure but the best part of the playground, other than the slides, is the structure/feature made of rope.  It's the biggest rope structure I have ever seen and looked to be great fun for the many kids (and some adults) on it.\n\nKiddos could easily spend a couple of hours here.", "author": "Craig W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-28", "description": "This playground is AWESOME. Even I want to play in it! (Actually I did... I went on the concrete slides and spinning pods with my 2 year old niece.)  This playground is only a hop, skip, and a jump away from the carousel.  \n\nThe playground has many features which makes this park THE place that kids of all ages want to come.  Slides, swings, climbing stuctures, spinning pods, sand boxes.. such a fun park!  Must check this place out yourself with your little ones.  They will have a blast and you will too!", "author": "Betty H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-05", "description": "This review was for our visit during our family vacation in March. My sister and her family live in SF and raved about how they visit often, and even joined some kind of club associated with the park.\n\nIt was super crowded they day of our visit, but my kids enjoyed the different play areas and slide. We also enjoyed the merry go round. I would totally recommend if for anyone with kids under 12. (Bring $$$$). They also have hotdog/pretzel stands for snacks. \n\n-1 for parking. Street parking was very hard to find at the time, we circled around and around, and ended up parking and walking almost a mile away from the children's playground. Good cardio, but not great with a 1 and 4 year old. I wish I had a double stroller. LOL.\n\nIf we are in SF again, I'd like to bring my kids here again. :)", "author": "Karen B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-18", "description": "So fun! The carousel for kids, the slides, the swings and the nice benches for parents make this a great place to go to with kids.", "author": "Alex L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-12-05", "description": "Nice park. Came for the carousel but it was closed. Then we saw the big structure and wanted to climb but it was under construction. Oh well we had fun with what we had.", "author": "shawnie m."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-06", "description": "Awesome playground that accommodates the young minds. \n\nOur 6 1/2 year old loves playing on the climbing the pyramid rope structure they have as well as running around the big playground. This playground also has 2 cement slides where you can kinda race with a friend on cardboard paper that we thought was interesting. \nOur almost 2 year old son loves the Carousel ($2 adults, $1 for children above age 6) that is close to the playground. Huge grass area next to playground to set up picnics and or benches around the large playground to sit, mingle and watch the kids play! \n\nAwesome way to spend a day in the city!", "author": "Lynda S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-06", "description": "Nice family park. The huge carousel makes a great addition to the fun. You can bring your own blanket and snacks but if you don't they have many seating areas and a food stand.", "author": "Brenda C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-11-01", "description": "This is definitly a clean, open playground with some fun play structures. The carousel is also an adventure in itself, although we only got in one ride before they closed. \n\nThe negatives for me were the sand my newly walking 10.5 month old occasionally slipped on and tried to eat numerous times. Also, very little shade over the play structures.", "author": "Amber L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-29", "description": "Good for family time! The tickets for the carousel are sold in the dog stand ($2 age12+, kids $1) (pretzels are $3) there are plenty of space to do picnic.", "author": "Florence D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-20", "description": "Golden Gate's Children's Playground is a decent sized playground in Golden Gate Park. It took us about 5 minutes to find parking (metered). There is also a carousel in which toddlers can ride on with their parents which is awesome! I didn't get to see the park in its entirety but the entrance of the park is the least appealing as you are greeting by an army of homeless people and musty odor. The park is very green and lush but it's hard to see all of it in an hour before you have to go feed the meter. I will update my review next time I visit again.", "author": "Itati V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-22", "description": "I don't even have kids and I love this place. Took my nephews here and they love it. Bring some cardboard for the slide and money for the carousel ride. Parking can be difficult if you don't arrive early.", "author": "Dee Dee R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-08", "description": "You could spend all day in that park. Open areas, secluded nooks, playgrounds and cement slides. Must do for any age but especially w/kids.", "author": "J C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-27", "description": "The carousel is still here and the snack bar is in full swing! I'm a nostalgia filled soul so taking my offspring here is a true tear jerker! I love the new playground set up especially the spider Web rope climbing structure... I think I'm on it more than my kids are.\n\n*** And the cement slide that has brought so many knuckle scrapes and ripped jeans into my life, I thank you for standing the test of time and being the reason why I look out for \"the best pieces of cardboard.\" I love thee.\n\nI just wish that there was rubber vs. sand as the surface... cat poo is not cool.", "author": "Tiffany D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-01", "description": "Great cement slide bring your cardboard playground area is filled with sand happy smiling yelling kids, the ground is soft made from that recycle spongy stuff. Has a carousel that goes round and round with horses only couple bucks. Concession stand available for hot dogs drinks , and ice for the occasional fall. Parking kind of hard to find but you should be walking anyway.", "author": "Jesse S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-16", "description": "This is an awesome playground for kids.  The highlight is the slide off the hill that you need cardboard to go down. Slightly dangerous,but that is part of the fun.  The Mister took the LO on it and she had fun. The playground equipment was cool, but it was too hot to play on them too long.", "author": "Rochelle R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-14", "description": "This park's main attraction (barring the 100+ year old carousel that is!) is definitely it's narrow, concrete, side-by-side slides! These slides look like they've withstood the test of time & seen more than their share of little booties! LOL! The kids go down them on pieces of old cardboard & with the help of some sand, they just fly down! It looked so fun that I wanted to take a turn! The whole park has a beachy feel to it complete with some really cool statues opening up the opportunity for some cute photo ops! There's 2 big \"tidal  \", some hermit crabs, a sea turtle & a gorgeous sea serpent all decorated with little pieces of multi-colored tile! Beside all the requisite swings & other neat playground equipment there's also an enchanting carousel from 1914, with all the original, hand-carved wooden animals from a huge giraffe down to a dainty frog! Plus, all the horses have real horse-hair tails & best of all - tickets for a go-around are only $1 for the kiddos! Unfortunately, when we were there almost half of the playground part of the park was cordoned off by S.F. P.D. after someone tried to scorch a huge chunk of the equipment! Included was a huge pyramid shape formed out of what looked like a bunch of thin, strong, green rope! My kiddos were dying to get on it, but obviously weren't allowed. We'll definitely be back to this park again though! If only for the slides...", "author": "Erika O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-06", "description": "The best playground around. The epitome of why the NorCal playground dwarfs our so cal ones. A cement slide is the highlight of every trip but don't forget to stop at a local grocery store to pick up a cardboard for your kids. This is necessary gear. My other fave is this very high netted apparatus the kids climb on, and this parent often climbs on too. Next door to this playground is a carousel. Everything is beautifully maintained!", "author": "Allison M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-02", "description": "Really big and nice public park. we came here for the kids playground, really nice, there is a concrete slide, parents use cardboard for their kids to sit, was lucky to find a parking near the park.", "author": "Henry P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-19", "description": "What can I say about this playground that hasn't already been said. It's huge, fun and amazing. It gets really crowded on the weekends, which is expected, but it's very manageable on weekdays. \n\nNot only are the kids totally entertained when they are here, the lounging parents/guardians are also really friendly.", "author": "Mariko F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-05", "description": "LOVE LOVE LOVE this park! Its really clean, they have a carousel and best of all they have a sand pit area. My daughter loves the sand and she also loves the baby swings so I love that this park is a \"one stop shop\" for all that my daughter likes to do.\n\nThe weather is always a little better in this part of San Francisco and parking never seems to be a problem. Granted, I have only gone on weekdays for this specific reason.\n\nIts a little funny to me that this gorgeous and awesome children's playground it RIGHT next to \"hippie hill\" where all the kids go to smoke weed. Its never a problem really besides when I was going to the restroom and there was a young man smoking weed right outside where there are tons of kids running around. Come on!", "author": "Andy S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-25", "description": "what can i say. i grew up in SF and this is the park where my parents would bring me and my siblings to when we were younger. Hold many fun memories for me. Of course many play structures are no longer there when I was a kid. Even with that some of the popular one still remain and enjoyed by many children. The slide made of cement, the only way you're going down is use a card board box. Yup! Still great. My kids had a blast. The park are well kept and maintained. The kids and families that go here are friendly.", "author": "Vuoch. L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-29", "description": "Carousel is so fun, adults $2, child 6-11 yrs $1, child 0-5 free but must be companied by paid adult. One ride is around 3.5 minutes.", "author": "Jinhan Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-09", "description": "Amazing place for kids of all ages. The Golden Gate Park is a gem. You could spend days perhaps even weeks exploring everything it has to offer. We focused on the children's park and our daughter had a blast!", "author": "Craig P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-31", "description": "Cement slides!!!\n\nThey don't make playgrounds like they used to.  Yes, I ended in a preposition.  Whatever.   This playground has SAND, a ginormous dome climbing structure that's actually kind of high for kids to be climbing and hanging from upside down, a carrousel, and just a great grounds for hanging out.  It's like the old school playgrounds before they got ripped out and replaced with plastic and wood chips. \n\nGrab some wine from Whole Foods, enjoy the beautiful park, and lay.  If all else fails you can go across the meadow listen to hippies play drums and get a contact high.   OOUT.", "author": "David O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-06", "description": "My kids loved this park very big and spacious but the only down fall is the restroom was so far", "author": "Princess V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-22", "description": "This is a great park for the whole family. My son loves the concrete slides. I love that it's a great source of exercise going up and down the stairs. They also have snacks you can buy and an awesome playground. It's near the Japanese Garden so you can make a day of the experience. The only down side is it can be crowded.  Have fun!", "author": "Amanda J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-28", "description": "Memories... all loving and so full of warmth. Playgrounds are my type of thing, and I try to see and experience all types of playgrounds around the world. Korea has great playgrounds, for ALL ages. In my hometown, San Francisco, this is the place to play on sandy and green grounds.\n\nTalk about where do I start? Which thingy ma jig do I want to tackle? The swings are always a never fail option, because you feel like you're soaring up into the sky, and you can hear the slush of wind wooping next to your ears.\n\nThe monkey bars... yes they are difficult, but so much fun. The circular contraption where you hold on for dear life, as someone strong pushes it to go merry go round, and you come out dazed and confused, and sometimes you hit the ground.\n\nThe deep concrete slides, where you get a flat cardboard box as your vehicle of choice, are scary at first, but when you begin to slide down, oh it's so much fun!\n\nThe circular swing, where one person sits on one side, and the other sits opposite from you, is soft and caring, and you can't help but to smile. :)\n\nOh I miss my childhood days at this great playground, situated among green giants of wonderful oxygen giving trees.\n\nI will go back very soon! This time around with other adults, who haven't forgotten their youth.", "author": "Hannah Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-04", "description": "Fun for adults and children. Bring several old cardboard boxes for you, your child and another family to slide on down the concrete slide.", "author": "Dorothy B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-14", "description": "My kids love this playground! It is clean and safe. Carrousel is available for a small fee. After playing at the park, I like to go to restaurants that are around the area. Very convenient!", "author": "Mila N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-05", "description": "What can I say, I enjoy bringing my daughter here to enjoy the sun, playing on the swings and meeting other parents and children in the area.  It can be a bit chaotic with the crowd of children, but then again, this is great for a playground!  The carousel is just as much fun, although, I think I'm getting old, because I walked off feeling a little dizzy.  We visit at least once every two weeks and pack a picnic after a quick trip into Whole Foods.  \n\nThe only reason I'm not giving 5 stars?  Depending on how you access the park (i.e. Haight and Stanyan) be prepared to walk by a number of homeless people with their dogs.  It's really that dogs that make me slightly hesitant about accessing through this entrance. I've witnessed two instances of aggression from the dogs towards visitors. I don't mind the community, having owned dogs all my life, the area is their territory and it makes me just a tad bit uneasy.", "author": "ERICA G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-02-24", "description": "Awesome playground, beautifully located BUT there are a ton of homeless people very close by, it doesn't feel very safe. No real shade to play in.", "author": "Louise S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-05", "description": "Golden Gate Park's Children's Playground is pretty awesome. Located next to hippie hill (Haight entrance), the playground is surrounded by beautiful landscaping and has a great mix of more nostalgic equipment (like the cement slides) and newer equipment including swings, slides, climbing walls/nets, and more. Hint: a little sand and a flattened cardboard box will help the kiddos get down those cement slides quickly and minimize shredded pants.", "author": "Deborah K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-25", "description": "Good playground for all ages. I bring my pre-crawler here to enjoy the many sand areas, the seat swings, and the toddler play structure. There are many grassy areas where you can sit and relax and plenty of benches. \nMy only complaint is that there is no lighting so you need to come before the sun goes down, which can be a challenge on short winter days.", "author": "Rocio G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-12-31", "description": "Not sure what the big deal is about this kids park. Its just like any other park. Nothing great. You can visit with your kids if you have never been there.", "author": "Manoj N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-28", "description": "At first sight, you want to turn back before your kid sees the place. Don't let the chaos intimidate you. There are so many great play things, and the toddler area wasn't that chaotic. Sand, climbing structure, musical pipes, turning ball-maze. It was so fun for him! And we just explored that area. \n\nI admired the tall spider web climbing structure with a friend who said it was built to catch kids if they fell. \n\nWe'll be back to ride the carousel and at again. Wonderful city treasure!", "author": "Kristy L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-23", "description": "This is a nice big park nestled in the city.  There are so many wonderful activities to do in the park.  Really, there is pretty much something for everyone.  There are nice paths for walking or jogging, a nice playground area for the little ones, a little lake, and places to rest a bit if needed.  \n\nOne thing... yes, it is San Francisco.  There were plenty of homeless people enjoying the park as well.  Generally, there is no problem with that but on occasion you can encounter a person that may make your visit somewhat unpleasant.", "author": "Belle B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-06-17", "description": "It is a beautiful and large playground. Great fit for all ages 3 months old to 40+ yrs old.\n\nIt is close by the carousel and the hot dog stand.\n\nThe best is the slides and the rope climbing structure.", "author": "Van T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-30", "description": "This playground is vastly different than the one I grew up playing in and still very much the same. My favorite structure (the metal triangle pyramid) has long been torn down, but there is now a green rope pyramid that my little cousins had a blast climbing. I'm glad they kept the stone slides, I taught my cousins how to slide with a piece of cardboard and a handful of sand. They raced up and down those slides until they were completely exhausted! And it's great that they still have the carousel and little snack bar.", "author": "Elaine Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-08-27", "description": "Wow! Just wow! Huge play structures for every age, cute undersea sculptures, sand, water, a carousel, you name it.\nThe day I was there, somebody had set up a DJ booth in Sharon Meadow and were playing techno music really loud for the enjoyment of the bums and addicts lolling on the grass over there.\nThe freakiness didn't get into the playground, but that great music sure did, and my little one got DOWN with his bad ass techno self.", "author": "Lisa T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-12", "description": "I'm well into my twenties, and coming here made me feel like a kid all over! Where was this place when I was growing up, and why didn't my parents ever take me here!?!? This place tires you out! There's so much to do, but I guess for adults, the slides and the climbing rope structure would be the main attraction (well, at least for me). \n\nThe slides were so cool! You have to bring your own cardboard (or just use one laying around) to slide down! Walk up the steps, wait in line with all the kiddos, throw some sand on the slide, and away you go! Super cool!\n\nThen there's the huge climbing rope structure in the middle of the playground; the centerpiece. What took those kids less than five minutes to climb up seemed like it would take an hour for me. i only made it up half way before my fear of heights got the best of me, but nonetheless, it was fun.", "author": "Wendy K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-28", "description": "I'm super ashamed to admit that I lost a kid here once. This is what I get for thinking that I could multitask and get some book reading done. I showed up with two kids. One moment I had both of them in sight and then just the one. Luckily, I found my fearless wanderer by the swings.\n\nAfter I'd found her, I let her continue her fun on the condition that she be within eye and earshot of me and my heart eventually went back to a normal rate\n\nDuring my frantic search for her, I checked though all the other play equipment, the climbing wave thing, the concrete slide, the grassy knolls, the climbing rope thing, and even the path that lead up to the hot dog stand. All in all, it's a great place to hang out with your young charges- if you actually keep an eye on them, that is.\n\nWe ended our day with a ride on the carousel.", "author": "Loli L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-23", "description": "Huge and nice playground for kids and big kids to enjoy, this one even has a cardboard slide, pretty fun thing to do when its not muddy :)", "author": "Jasmine C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-13", "description": "FANTASTIC PARK! \n\nCan't wait to have kids so I can take them here.  So many activities and lots of play area.  There's also a nearby grass area for a family picnic.  I actually went down the cement slide using the cardboard boxes however maybe I'm too big and the board kept slipping from underneath me.  Just a warning for those attempting to slide down it.  Kids were not nice to me about that haha.", "author": "Tammy N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-25", "description": "How can you not give this park 5 stars? I'd give a million if I could. First off, everything about the park is free including the parking. Even if they charged, I'd pay because my two-year-old daughter loved every aspect of this San Francisco gem. This playground is a bona fide tourist destination for anyone with young children.\n\nThere is a private lot within the confines of the park next to the art studio, but it's pretty limited if you come during the afternoon. However, there is street parking available which can obviously be a bit taxing on the legs for some. Also note that because you're in the heart of the city, it's very, very cold (even during the Summer months). So dress accordingly.\n\nThe playgrounds are architectural wonders that kids will undoubtedly enjoy and remember for years to come. The structures are clean, ingenious, and exhilarating (even for adults). Parents do need to monitor their kids since the larger structure can be dangerous if one is goofing around. The cement slides atop the playground is a must for anyone, including adults. If you can find some cardboard lying around (or bring your own), the slide experience is even more spectacular. \n\nThe two drawbacks for myself is the large crowd in the afternoons (overrun with strollers and moms chatting with each other about lunch plans) and the bathroom location. To get to the restrooms, you'll have to basically walk back towards the private lot, past the carousel and snack stand. It's probably better to \"go potty\" once you arrive.", "author": "Andy P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-03-24", "description": "I pity this soft generation.\n\nWe had super-high swings that could launch you into orbit, regular swings and the baby swings. We had a static cable car and a static locomotive that we could climb on, in, and over to our heart's content. We had the circle swings that would make you a little loopy. We had chickens and goats. We had a snack bar in the Sharon Building's street level to refuel on ice cream sandwiches and bricks of pink popcorn. We had regular slides, longer wavy slides, and TWO corkscrew slides. We had a kid-powered spinning disc ride. And the carousel ran all the time.\n\nI was here today as friends planning an event don't know the difference between Hippie Hill and Sharon Meadow, and I figured taking some photos would be less painful than beating some sense into them. Then I wandered into this sterile \"play\" area and was disgusted.\n\nFor you Yelpers who are waxing nostalgic about the cement slides, those weren't even there. We didn't need 'em! We had the corkscrew slides! And guess what, NOBODY DIED!\n\nYou will never know.", "author": "Tammy A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-14", "description": "Awesome and creative beyond imagination but a bit frightening to see the children climbing three stories high on rope ladders...", "author": "Mr B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-02-26", "description": "Wow!  Impressive park.  I took my little one here today and he just loved it.  This by far is the nicest playground I've been to.  This playground is located in Golden Gate Park and those who are not from the area may find it quite intimidating as this park is HUGE, so you have to kind of know how to read a map to get around and find the children's playground itself.  \n\nWithin Golden Gate Park, there is a botanical garden, Japanese Tea garden, lots of fields, tennis courts, and a science museum.  The walk is pleasant and it's a beautiful place to take photos and to soak up the sun and breathe in the fresh air.\n\nThe playground is awesome!  I must admit, I may have enjoyed the park more than my son as I spent every minute of my time there climbing, sliding and running around with my boy.  What's also cool is that there is a place near the playground to grab a bite to eat, though I didn't buy any snacks, so I can't say if the food is good or not, but I'll have to try it next time and give an updated review.  There is also a carousel near the snack stand. The carousel ride is lots of fun and it's worth it considering the cost to ride is only $2 per adult and $1 per child, kids under 5 can ride free, but they must be accompanied by an adult.  \n\nIt is a pretty busy park for a Sunday afternoon, but it's definitely a great park with lots to offer for children of all ages.  We will be back most definitely.", "author": "Ivy P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-18", "description": "OMG!!!  Our 4 and 10 year old girls had a blast here!  Beautiful park with various levels of play equipment to choose from.  Even the restrooms were clean and fully stocked!  It was our first time here, but won't be the last...we loved it!", "author": "Liena K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-06-04", "description": "Me and the wife love Golden Gate Park, but the 1st time here was this past Wednesday with our niece. She knew exactly where it was! We got the last parking space in the lot.\n\nThe carousel  was closed, but the rest of the park was clean and kept her occupied. I liked that the floor was \"cushioned\" and \"bouncy\". \n\n***Spin the kids on the funky yellow chair and have them walk right afterwards - very similar to adults when cops make them take a sobriety test by walking a straight line!***\n\nSince she had a blast, this place gets 5 Stars! I an image that it's a madhouse on the weekends.", "author": "Peter L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-16", "description": "Great place for the kids and also for adults. My kids love this playground from the giant slide, to rope climbing, rock climbing and just plain exploring.  This is a must visit for families  with young ones or for someone who is still a kid at heart.", "author": "Lisa S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-04", "description": "Remember to bring a piece of cardboard for the slides.  It will make you go faster.  \nGreat vibe at this place despite all the talk of the homeless and drugs nearby.  Big plus the carousel and hot dog stand is close.", "author": "Michael N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-05", "description": "I've lived in Berkeley, Oakland, Belmont, SF, Petaluma & San Rafael & this is by far, one of the best playgrounds not just in SF but throughout the entire Bay. Love this place! The carousel is an extra special touch - cuz really - how many kids playgrounds have that?! And amazingly - even though it's in SF & they could easily overcharge you - it's super inexpensive. The slide that's built into the mountain brings out the inner kid in every adult.", "author": "Lita L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-30", "description": "We had originally planned to spend Memorial Day at the newly reopened Exploratorium, but after seeing the $25 per adult price tag and considering the fact that we wanted to get home at a reasonable hour, my husband balked and we quickly changed plans. All this in spite of the fact that it was forcast to rain and that was partially why I planned an indoor activity. So I quickly googled playgrounds in Golden Gate Park and was routed to this area, which I vaugely remember wandering through in my college years, long before kids. I knew my kids would get a kick out of the carousel at the very least. \n\nWhen we arrived we lucked into an amazing parking spot on Kezar right next to the playground. Typically I think parking may be challenging, so you may want to park in the garage near the musuems and walk though the park. I think the threat of rain was keeping most people away from the park on this day. On the way down to the playground was a fairly nice bathroom for a park, it even had a changing table, soap and paper towels! \n\nWe made our first stop the carousel, which was reasonably priced at $1 per child over 5, free for under 5 and $2 for adults. Because both of my kids are under 5 we paid $6 for the three adults in our party to ride with them. We could have got away with only paying $2 since kids only have to be 40 inches to ride alone and my 3 1/2 year old beats that by 2 inches. However, we wear our \"helicopter parent\" status as a badge of pride and we had a parent hold onto each kid, while grandma took pictures, which was good since the carousel did not have safety straps. The outer ring of animals are stationary, while the inner two rings go up and down. They have a couple of benches where extra timid kids can sit with their parents, too. I was happy to see that the animals varied and weren't just horses as my older son was requesting a zebra as soon as we told him we were going on a carousel. \n\nAcross from the carousel is a small snackbar for food emergencies. We did not eat there so I cannot attest to the prices or quality. The main playground area is huge, with both a toddler playset and one for older kids, along with some playhouses, sandboxes and some other play structures. Everything was very safe with the soft surface on the ground rather than just sand or woodchips. There is also a large cement slide that kids were using pieces of cardboard to slide down. My oldest decided he wanted to go down it and I let him, but it definitely goes pretty fast and it is hard to get from the top to the bottom in case they injure themselves on the way down. There is no way I would have let my younger son (1 1/2) go down it, luckily he did not express interest. I did see some parents going down with younger kids on their laps, but all the stories about kids getting their legs broken that way made me too nervous to try it. Believe me, my kids (and me) are a bit accident prone and if it could happen to anyone, it would happen to us. \n\nOn this particular day the play areas were not too crowded, although it was not empty by any means. It started sprinkling after we were playing for about an hour and that cleared the playground pretty quickly. We also decided to head out for lunch not too long after that. We walked to Cole Valley for lunch, which was about a mile away, but there are many places about 1/2 mile away if you just check on your Yelp app. Do be aware that homeless folks do congregate in certain areas of the park, so keep your kids close and don't let them wander into the bushes. Oh and lock your car and set the alarm, I saw lots of glass on the sidewalk where we parked and actually had my car broken into along Golden Gate Park, once again, back in my college days.", "author": "Lisa H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-20", "description": "Have you ever thought to yourself, lets build a giant slide out of concrete, the kids will love it.  Imagine no further.  The trick is to use some cardboard as a sled and a hand full of sand as the ice.  Not in the habit of carry pieces of cardboard around.  No matter, there were several pieces at the park.  Add some large play structures, two swing sets, a green spider web (that takes me back thirty years), a splash pad, and a lake of sand.  Fun and fun!!  Hungry?  There's a snack stand with hot dogs.  Yum and yum.  Bored?  There's a carousel.  Bathrooms?  They've got them.  Parking?  Ahhh, best of luck if  it is a weekend or holiday.", "author": "Mark W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-30", "description": "It is so great to have this resource in the city.  I took my nephew here and it was the highlight of his trip, and mine!  It is safe, clean, and full of friendly people.  If you have kids and are visiting town, this is a must do!", "author": "Howard G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-26", "description": "I have some great memories coming to this park as a kid. Now over 20 years later, I still look forward to coming here. Can't wait for my next trip down the cement slides!", "author": "Tiana K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-04", "description": "sliding down a cardboard box on some sand down a cement slide!!!\n\nwooooo- childhood!", "author": "Kimberly A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-20", "description": "The area seems safe-at least during the day.  The park is clean.  My daughter loved the cement slide.  Make sure to bring cardboard to sit on--a piece about 18x18 should be good.  Even though they'll want to hold the cardboard (like a sled) to go down, make sure they lift their arms so they won't get \"cement burn\".", "author": "Kimono G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-28", "description": "First time here and really enjoyed all the different playground equipment, then we are used to.  the concrete hill slide is a real winner with kids and adults alike. Don't forget your cardboard to go down the slide!", "author": "Ruth M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-27", "description": "Was in the area and the kids got to check it out. Was surprised San Francisco had more magnificent play structures than out in suburbia.  The climbing structure was a big hit with our oldest.", "author": "Chris K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-08", "description": "You can still drive into the South side of the park if you need to", "author": "Timothy W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-02-20", "description": "I don't know how many years it has been since I was here, but it's still awesome!\n\nThey updated it as the years have gone by but it still brings the same feeling of excitement it did when I was a kid. Walking into the playground and seeing all the kids running around and having so much fun, just makes you feel like a big kid.\n\nThey have slides for babies, slides for big kids, and slides for adults!!! The concrete slide is pretty crazy!\n\nThey have blue bottle coffee. They have hots dogs. They have popcorn. They have It's-its ice cream. They have a carousel. They have a grassy area. They have a small parking lot. They have it all!", "author": "Mai H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-09-30", "description": "Had our car broken into in the middle of the day, right in front of the park entrance. Came back after having a very nice time at this beautiful playground to a smashed glass all over my baby's carseat. Turned out to be a pretty expensive playdate!", "author": "Masha M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-28", "description": "I love this playground. We live in Tacoma, WA and visit my in-laws 1+ times a year. My husband came here when he was  a kid. The concrete slides are still here. Bring a piece of cardboard (white with a picture on it is better). The playground equipment is nice, there is a high rope tree for the kids to climb. A cool wave sort of sculpture the kids can climb. We got parking, but I imagine it can be challenging on weekends. The bathrooms were clean, but I have seen some tweakers in there in the past, so be careful. There is a carousel with cool animals, not sure of it's hours but it is inexpensive. There are places for parents to sit, and grassy areas nearby. It is worth a drive to Frisco to visit it.", "author": "Tracy M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-04", "description": "Love love love coming here and unleashing the kid in me... Oh, my son and nephews love it here too. There is a toddler play area and one for bigger kids. A vertical maze like rope to make you feel like Spider-Man and little yellow bowls that self propel using your weight shifting... Awesome!!", "author": "Nicole G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-01", "description": "This is an awesome park, but very crowded. I turned into \"helicopter mom\" when I saw how the kids fight over cardboard scraps to slide down the concrete slide... fyi", "author": "Amy P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-07-25", "description": "We ran towards the kids. We scared the kids. We climbed with the kids. We slid with the kids. Lastly, we made friends with the kids.\n\nGGP's Childrens Playground was scavenger hunt task #1 completed. As soon as we (illegally) parked, we bolted towards the children's web structure. Ignoring the sign that states \"use of the facility REQUIRES a child\", 3 of us girls climbed the structure all the way to the top. Picture taken= task completed.\n\nThe next task was to go down the slide, w/ the rest of the kids, while sitting on a measly piece of cardboard. While in line, one of our other team members formed an alliance w/ some of the kid sliders. She warned them that there would be \"others\", but to keep special watch over the \"guy\" team. \n\nOne team member filmed the whole thing.\n\nBottom line: Scavenger hunt or not, Children's playground is a great spot to take your children. There is plenty of parking, slides, sand, & play/web climbing/slide structures to amuse its visitors, especially the young at heart.", "author": "Joy A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-01", "description": "best free of entertainment for kids!!  used to come here every weekend with my parents get a card board and ride the cement slides and run around the grassy fields fun!!?!", "author": "Sandra S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-16", "description": "I took my niece and nephew here for a SF day, the weather was perfect, parking was horrific but once we reached the playground suprisingly it was very clean the \"ropes\" structure was different then the other parks I've been to. Along side that was a plastic/metal structure with lots to do. Other kids were friendly and parents were involved with what was going on. On the otherside there is a junior version of a rock wall to climb which was nice.. The kids had a great time and wanted to stay but we had to move on, again be prepared to search and search for a space but once you land it's a nice park to have the kids play.", "author": "Wil G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-22", "description": "This is a great playground for all ages. The cement slides were a huge hit with my 6 y/o. There are pieces of cardboard laying around that you can use. The key is to have some sand to help make you go faster. The steps going up to the top are a little steep so little ones do need help. Unless, the want to go the long way around. The rest of the playground was clean and the equipment new. There were plenty of options for everyone. We brought our kids' bikes and my 4 y/o was tooling around in her trike. The paths are nice and wide. The layout of the playground is nice because it's like a big circle with a path in the middle. The only reason I gave it 4 stars was because the carousel is under renovation. My daughter is a carousel nut. It's  supposed to be one of the top 5 in the world with real hair for the tails, etc.\nNext time.", "author": "Judy C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-01", "description": "Best park ever. Great equipment, rolling hills of grass, water feature, hot dog stand, Ice Cream, picnic and play with the kids... whats not to like?", "author": "Ann B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-03-06", "description": "As someone who remembers the suredly lead based paint coated, 70's looking playground equipment, this newly renovated and updated Children's Playground is an ENORMOUS improvement!  It might also initially appear larger than the original playground at first. I think this is because the newer equipment blends into the park's landscape more while the original stuff was huge and shall we say, colorful.  (Anyone remember the purple and orange circular climbing structure?)\n\nWORD OF ADVICE: Supervision in this playground can be challenging if you have two kids on two different developmental levels wanting to hang out in two different areas of the place. Do take a back up adult with you to manage such a situation.  We give this upgrade high fives all around though! My kids LOVED it.", "author": "Kristine D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-17", "description": "There are times when I dream about going back to this place, and I just wake up laughing. If EVER you want to escape a dull adult day and let your inner kid free, bring your own cardboard and zip down these bad boys! Beware- if you happen to slip off your toosh-protector, you MAY JUST burn a hole in the back of your pants.... Just sayin.", "author": "katie v."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-11-24", "description": "We rounded out a trip for the kid in San Francisco this weekend with a few hours here at the Playground.\n\nI love the cement slides, and remember them from my childhood (although they seem a lot smaller to me now, then they did when i was 5. )\n\nWhat a great renovation!  There is a play area for smaller kids (under 5) and one for 5-12 ish.  A wave structure and awesome swings to swing on.  Then there is the large rope pyramid, which you can't just climb once, no, you have to do it like 25 times and time your self each time to see if that trip was faster, and then you have to go back down and do it again, and race someone else up it too.  \n\nWe missed the Carousal by 5 mins  5 mins!! - which was a little sad, because everyone had 'their animal' all picked out that they wanted to ride (there WILL be a next time very soon!)\n\nClean restrooms, clean and safe area, well designed.  Love the picnic areas and the little red barn too.  \n\nA MUST for anyone with kids coming to SF and in the GGate park area.", "author": "Samanta V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-06-25", "description": "This is by far the funnest play ground I've been to, In San Francisco.\n\nIn Germany, Kids playgrounds are littered across the residential neighbourhoods, one every 100meters... which is.. 328 feet for Americans:)\nThey are dynamic, large and often times, have the capacity to serve their needs up to your teenage years.\n\nYes I'm in my 20s, but I'm also a towering 5\"1. So, I do fit right in. Unlike some sexual predators looming around.\n\nBack to my favourite toy: the Ropes Pyramid. I know it's not the tallest one you've seen. But it's definitely Fun to take off your shoes, sink those toes in sand and work those thigh muscles. Try hanging upside down from one of the higher ropes, then tarzan and jane it down the lower ones, before taking a leap into the 'swing' (the ones that go between your ass and crotch.. : / ). Or, you could try the alternate get down, by flinging yourself across the ropped draw bridge like hammock net on the north? side of the pyramid. \n\nI find myself sitting in one of the leather pouches by the top. At night, when all the kids are gone, it's nice to just breathe and think.\n\nI know it's not an ideal place for a girl to be at, 12am through the night. And the Park *is* officially closed. But if you want, there are certain parking spots that your car will less likely to be towed, and certain venues and positions you will less likely to be noticed. And yes, one time, a bunch of homeless ppl started to knock each other around. But then again, i can sit through anything. \n\nInterested?\n\nOh, there are also some GREAT trees to climb there. On the same afternoon, i saw 2 drug dealers doing their rounds. Maybe they're undercover cops. A homeless dude asked to sell us bud. His dog looked like it's never taken a shower since birth. Shady park?\n\nIf that doesn't scare you... Behind the cement slides in the Kid's section, there are used condoms, I counted 3 before I took a deep breath to suppress the vomit and disgust. \n\nSo mothers and fathers, this is a friendly heads up. \n\nOn a lighter note, cement slides are hella fun - the kids will teach you all you need to know. \n\n\"No! not like that, hold the card board like this!\"\n\"Like this?\"\n\"NO! Watch me! Watch carefully!\"", "author": "Ying C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-06", "description": "First time to the park. WOW- I had no idea that it was that BIG!!! I do plan to go again, and try to go walk around to see everything! If you plan to go make sure that you have all day to go and explore!!!", "author": "Leanna E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-03-01", "description": "Recently brought my 4-year old son here and he loved it! This area is nestled right inside of Golden Gate Park and is extremely easy to find. Parking was pretty easy on a warm Sunday afternoon. The play structures look as though they've been recently updated and there's TONS for kids to get into. This park is perfect for children of all ages. There's also alot of paved areas in the surrounding area, my son rode his scooter when he was tired of playing. We wrapped things up by taking a ride on the gorgeous Merry Go Round - $2 for kids:)", "author": "Krystal C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-07-27", "description": "My friend and I stumbled upon this place a few months ago while meandering through Golden Gate Park, and were instantly enthralled.\n\nI love the \"ocean\" they have there. It has the SPONGIEST turf I've ever walked on, which feels SO cool, and I love climbing up the giant wave sculptures to sit on the crest. Check the back for little footholds you can use to boost yourself up to even the tallest point on the bigger wave. :)\n\nI really enjoy what I call the buttercups -  the small yellow cup-like things that you sit in and spin around. Strangely addictive.\n\nThere is a HUGE cement slide, the bottom of which is usually littered with spare pieces of cardboard to slide down on. I recommend being careful of your hand placement - if you don't watch out, you can end up getting some nasty scrapes.\n\nThe rope structure was by far my favorite part. It's this massive pyramid of green rope that you can monkey about on, although if you're a \"big kid\" like I am, you might want to be careful if there are young'uns climbing, too - the ropes tend to sway if you get a bit too enthusiastic, and you don't want to knock a child off into the sand and draw some tears and an angry parent's attention.\n\nThe people I've met there have been really friendly. When my friend and I wanted to race to the top of the rope structure, another couple cheerily offered to stand in as referees. And when I dropped my cell phone in the sand, someone was kind enough to bring it to my attention. :)\n\nEven if you just want to lay around and relax, this is a great place to do it - there's plenty of beautiful grass space.\n\nThere is also a carousel which is open between Memorial Day and Labor Day...I haven't been able to go on it yet, but even just peering in the windows and checking out the animals is fun.", "author": "Aubree T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-07-07", "description": "I must be getting old. You know how I know this? Because I'm starting to say shit like, \"When I was a kid...\" or \"I remember when...\" a lot more. \n\nLately I've been hanging out at a lot of playgrounds with The Kid and have noticed a trend. The old playgrounds that I grew up with have been torn up and given facelifts. The massive, rusty steel jungle gyms that ensured any kid so bold as to climb to the top of and play a rousing game of \"King of the Mountain\" a broken limb or at the very least a nasty sprain or bloody nose, have been replaced by lattices of rope. The old splintered wooden play structures that would give Dracula Jr. pause have been replaced by ones made of space age polymers. And the metal slides that heated up like  sautee pans in the sun have been replaced by cooler plastic ones. This is the case with the newly reopened Children's Playground. \n\nThere's nothing wrong with that. It's very modern and still massive so, naturally, it's a great place to let your child run buck wild. It's pretty cool but for some reason it lacks something. I guess I won't be satisfied until it's christened with the blood of a pop rock addled six-year old. And good luck drawing blood in this joint. Is this kind of stuff going to lead to a generation of soft, whiny punks? Time will tell. Don't get me wrong, I'm  not advocating for broken glass in the sand or anything but every once in a while a nice set of bloody kneecaps can help build character.\n\nOh, they still have the concrete slides on the hill so bring your cardboard. And, yes, I DID walk twenty miles to school in the snow, uphill, both ways.", "author": "Josua P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-05-26", "description": "Reminiscent of big city playgrounds in Europe. The big difference is all the liability-limiting features such as the rubbery covering around the jungle gyms. (I always slip on the rims of those covering around sandboxes.) Also, everything is made of plastic and metal fittings with special nuts and bolts that don't stick out. In Europe, many of the parks have lots of wood, stones and big bolts sticking out.\n\nThe ensuing chaos, head bonking, confusion, contusions and crying conclusions is the same as any European playground. \n\nNow if they could only put in a beer garden overlooking the park; then I would really feel like I was back in Germany.", "author": "David P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-11-12", "description": "Wow.  This place is really cool.  Even if you don't have kids, you should come here.  If you're a guy, you shouldn't come here by yourself; people will just look at you weird.\n\nI would say that this is the best playground I've ever been to, but that would be a lie.  Seaworld used to have a huge play area called Captain Kidd's something or other.  The ziplines there were amazing.  Beyond that, there were many cool playgrounds when I was a kid.  A lot of them were custom-made, so you wouldn't find the same equipment at every single playground.  That led to some interesting--and dangerous--play equipment.  When people started suing, schools and cities began removing their unique equipment and installing boring stuff.\n\nThankfully, some of the boring stuff at this playground is still fun, and here's a secret--some of it is dangerous too!\n\nThis place is usually a zoo when the weather's nice, but that's actually good for your kids.  It helps them socialize and, more importantly, learn how to focus on themselves when there's a lot of other stuff going on.  Watch your kids, though.  I'm one of those conscientious people, so when I feel like someone else's kid is about to fall, I'll try to help.  Do me a favor and stress out about your own kid so I can pay attention to my nieces and nephews.", "author": "John S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-07-16", "description": "Woah... we hit this place up on day 2 of the opening and I think just about every kid, new parent and stroller in all of SF was present. I should have known better.\n\nAside of that, it's new, shiny and clean. And unlike some of the other parks I've been to this one seems to have a jungle gym that's fitting of a toddler who has just mastered walking and stairs. You know... challenging but reasonable for a curious two year old.\n\nThe cement slides are pretty sweet. Definitely made for kids though. The kids flew down the slides on cardboard - how cool... Um.. parents (adults) seemed to get stuck midway - which ruined the \"I wonder how hard this guy is gonna wipe out\" factor - as it slowed them down.\n\nThere are a few final touches they need to make to the park, (hiding a couple of exposed water pipes) but other than that it makes for a nice place to let the kids run wild.  \n\nOh and for all you dog owners I think that they ask you leave your dog outside the premises. I saw a few tied up at the perimeter of the park. But you might want to double check that. In a city where the number of dogs out number that of kids, I'd say it's a nice gesture for the little ones.", "author": "Stephanie I."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-01-23", "description": "nice beautiful place... until you come back to your car thats broken into and all your belongings are gone... even the glove box that you locked was pried open and byebye New Ipod Video...bye bye.. bye skateboard in trunk, bye deck with no faceplate, bye digital camera w/3 memory cards... oh memory memories  =...l\nWahh Wahhh.. *debbie downer..sorry", "author": "JASON L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-05-29", "description": "Great playground with a few drawbacks.  The first is the wide-open, unfenced,.and sprawling area.  We were there on a weekday, but I can only imagine how absolutely insane it must be to keep track of your kids when it's busy.\n\nThe second is the cement slides, which prove that there is a direct correlation between the amount of fun kids have and the likelihood of severe head trauma.  In this case, they're 30 or 40 feet of polished cement with a pretty steep drop at the top.  It looks like people bring cardboard along to slide on, which makes things go even faster, and there's plenty of scraps lying around.  Our 5 year old had to be pried away from these slides.", "author": "Nathan C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-08-02", "description": "GONE!!!! ALL OF IT, GONE!...........\n\nI cannot begin to describe to you all how much fun i had on this plot of land in my younger years. \n2 cement slides you slide down on cardboard\n1 giant maze PERFECT for tag (with 4 tube slides coming out of it)\n3 tire swings\n2 tire tunnels you can go down or up\n1 wobbly bridge\n1 spinny thing that always made me barf\n4 double wheel swings which sometimes made me barf\naaaaaaaaaand the puppet show by the carousel! \n\nso they are currently reconstructing this and apparently its supposed to be the shit. When its done I will update my review and perhaps a few of you dorks would like to come play.\n\ni will never grow up.\nnope.", "author": "Helen N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2005-10-14", "description": "My kids adore this playground, but it kind of freaks me out. The thing that troubles me most is that it's enormous. There are at least three different climbing structures, tons of places to hide, and no gates or fences to make sure kids don't run off. Even though I tend to be hyper-vigilant when we're there, more than once I've had the heart-stopping experience of not being able to immediately locate my four year-old after looking away for a moment.\r\n\r\nBeyond that some of the equipment is quite old and clearly not up to modern safety standards. There are all kinds of places where a child could fall and get seriously injured and there is even a sign warning about possible lead contamination. \r\n\r\nNonetheless, we still go to this park occasionally because my kids enjoy it so much. My recommendation to parents is to only use Children's Playground for children who are preschool aged or older and be prepared to follow them everywhere they go. If you have more than one child, bring along another adult because there's no way to keep track of two or more kids on your own.", "author": "Karin T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-07-20", "description": "Wow! This park is absolutely ah-mazing!\n\nNo seriously, I went with the school I teach at today for a day trip and despite the park being insanely crowded with children -- I mean insanely crowded -- I fell in love with this place!  I want to go back tonight when the crowds die down. I guess they just reopened this month so the kids just keep filing in [word is they closed it down after 27 years to remodel after some kid got seriously injured.]\n\nThis is one of the coolest places for kids in the city hands down!\n\nThe spider web crawl is tight.  I wish I could have climbed all over the damn thing today what a blast that rope scaling tower looks like. And the two cement super slides they kept from the original park layout looked so fun as well like the seward street slides for youngins.  Just remember to bring your cardboard [though there is plenty of cardboard sprawled across the playground.]  The toys and various jungle gyms all are unique reinventions of older classics and basically this playground just rocks.  They really cater to children of all ages in that I saw children as young as newborns up to I'd say 13 - 14 years old.  With the carosel near by, it's the ideal location for a family with little ones.\n\nSeriously, go check this place out.", "author": "Kat R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-11-12", "description": "What a grrreat park.  Bring a piece of cardboard for each kid that they can use to slide down the giant concrete slide.  Otherwise their britches will get frayed and dirty.  But never mind, they had a ball!", "author": "Maria S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-02-23", "description": "This park is UH-MAY-ZINGGG! Also, it's the most challenging park I've ever been to, and I wouldn't even consider myself extremely unathletic. SF kids must all be gymnasts and/or take steroids, because I don't see how else they could maneuver these structures.\n\nMy roommate taught me that for maximum speed on the concrete slide you should bring some sand on your cardboard and pour it on the slide first. Not gonna lie, I was prettyyyyy scared.\n\nI spun on the yellow chairs and got dizzy and high on life.\n\nThe \"jungle gym\" if you can call it that, is a true test of flexibility, strength, speed, and courage. A little girl totally showed me up by climbing all the way to the top while I was stuck on only the second level...\n\nBrownie points for swings, zipline-thingy, free bongo beats from Hippie Hill, and being in the beautiful Golden Gate Park.", "author": "Claire C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-09-24", "description": "The reconstruction of this park has ruined every last bit of my childhood (along with the cliff house). Cement slides used to be twice as high &they got rid of those multiple person swings. Now when I look at it, its just plain sad. Kids nowadays have no idea what they're missing.", "author": "Elaine L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-07-24", "description": "Good to know this place still exists.  I used to play here when I was young (probably on fieldtrips and stuff) and there are a lot of things that they ripped out & replaced (probably because of safety hazards).  My 3 year old liked this place - it was big enough for the big kids and had enough activities for little kids.  The carousel is still here, which is nice - it's $2 cash to ride it.\n\nMy son really liked the big kids area (where the rope structure was).  They have fun slides and great bridges, although there are a lot of parents standing around and yapping on their cell phones.\n\nNot  a bad place - lots of room to run around & lots of benches & patches of grass to sit on.  Most of the ground that surrounds the little kids play area is made of that rubber composite material that is bouncy underneath, so if a little one scrubs, they're not too badly damaged.  There are even places where you can host birthday parties.\n\nMy only complaint is that, you can't come here and have a peaceful afternoon of watching your child, you always see 5-6 people you knew from high school and they wanna catch up and \"do lunch\".  Oh yeah...and don't even try and come here on a Sunday...good luck with the parking.", "author": "Nathalie C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-03-16", "description": "This was great when I was little, although totally remodeled now. I still enjoy playing here and might I mention I'm 19. There is a huge rope structure which all the kids loved climbing. I didn't think the city would make the structure that tall for kids, but I haven't heard anything tragic happen yet. But I wouldn't let small kids who are uncoordinated climb that, unless you can describe the kid as a monkey, then they'll love it. \n\nThe stone slides that have been there since...FOREVER are still there. The cardboards you go down with are still around the sand and climb those wooden steps to slide down. It was much funner when I was a kid, but now it seems much shorter, but it's such a great memory. Bring your kids here at least once in their life. \n\nThey've updated everything so it's a big artsy park. It's also a very nice play to have a picnic and sit back and watch your kids play.", "author": "Kimberly S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-03-17", "description": "I haven't gone here since I was little and they had those huge round swings! You old folks know what I'm talking about. Came here with a friend's kid a few weeks ago and WOW! The park has changed dramatically. The only memory left is the carousel and the cement slides! They did a wonderful job renovating this park, it looks like an amusement park for gods sake. Love It!", "author": "Karen T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-06-04", "description": "i don't know about you but back in my day if you fell off the jungle gym then you landed on sand or cement.\nwhy are kids so cushioned these days, a few bumps and bruises won't kill 'em. in fact it might build character\neither way playgrounds are still fun. i love that web thingy and the swings\nslightly strange that a playground covered in bouncy, hurt prevention astroturf has a seriously dangerous cement slide over in the trees.\nit's awesome and fun but even getting to the top is a little if-y\nit's a great place to play after a food coma nap or in the early evening after a few beers", "author": "kiki b."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-04", "description": "This park should be called..\"Where's my kid park?\". Due to the immense size and small condensed play structures with 100 kids in one small section, it is very hard to keep an eye on your child because if you blink for a second they're lost in the mass. I recommend putting your child in brightly colored clothes. Luckily my kids aren't small but I did notice it wasn't just me walking around one small area to find my kids. Nonetheless it's the biggest park for kids and always their favorite.", "author": "A M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-04-09", "description": "They did a great job with the new park and left the cement slides! \n\nWe have been going there a few times a month and there is a great vibe there.", "author": "James T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-19", "description": "Best park! It has great jungle gym structures, slides, a sand area and the ambiance of San Francisco.", "author": "Gina B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-06-22", "description": "God, I've been coming to this playground before I could walk. It's a huge park with plenty of open space to play catch, throw a frisbee to your dog, or have a picnic with family to celebrate a birthday. \n\nAfter playing in the park we'd go on the Merry-Go-Round (which was $0.25/ride back then) and grab an Icee. Cherry please! My favorite part of the park are the concrete slides. But you have to ride down them with a piece of cardboard, otherwise you'll end up with more than one hole in your ass, if you know what I mean. I wasn't old enough at the time to feel bad about the fact that i might be sliding down those slides on some hobo's house. Tip: first throw some sand down the slide for an even smoother ride ;) The tire swings are awesome too. \n\nI haven't been here since they remodeled but I hope they didn't take away any of the park's old-school charm and character that I have such fond memories of. It's the best playground in the city for sure. If you have kids you should definitely take them here. In the future I hope I'm lucky enough to take mine.", "author": "Jen Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-03-18", "description": "awesome playground...my son really loves it here too bad we live so far away from San Francisco we'd go here everyday, but oh well ...once  in a while would do it!!!!but its a great childrens playground...", "author": "Shea S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-04-11", "description": "I'm almost hesitant to give this 4 stars...\n\nFirst off, I think this is a well designed playground to a point. I love the toddler area is separate from the big kid area. I love the little versions of the jungle gyms and slides for the little ones. Mine really loves that. \n\nThe problem is... it's huge. There is no real barrier between the playground and the rest of the park. You have to be constantly on guard at all times. Especially when large groups of kids show up, like when I was there the other day. It was a pretty day and then at least 50 kids showed up at the same time to the playground from some school or something. It was overwhelming. At least they were in the big kid area. \n\nIt's nice and clean, I'm sure its a madhouse on the weekends. I'll be back if I'm in the area. And it's early. And it's a weekday...", "author": "J B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-09-07", "description": "OK, so I've spent a fair amount of time here over the summer, and I have to admit that there are a few things that still rock about this place. \nLeast of all not being what really counts; tons and tons of kids having a GREAT TIME!!\n\nIt ain't the same, but it's a'iight.", "author": "sofia p."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-10-20", "description": "Awsome, wonderful, Fantastic.  \n\nTook my two year old son here during the week and he had a fantastic time.  \n\nFor starters its a great layout.  Two play structures with soft ground....a concrete slide area ( bring your own cardboard), a water feature and swings  .  \n\nAlso, there's lot's of green space to lay down and relax ( if that's even possible with kids).\n\nThe best part?  There's a carousel!!!  And the other best part?  Your in Golden Gate Park.....what else can one ask of a kids playground......", "author": "Poncho M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-04", "description": "This place has nice new slides and swings, and is not sandy like a lot of older playgrounds.  But it is often very crowded, and you will need to keep a good watch on your children.  The carousel is beautiful.", "author": "Sharon B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-05-17", "description": "Probably the coolest playground I've found in San Francisco (if you know of a better one, send me a message!).\n\nThe ONLY word of warning: if you like to sit on a bench and \"sorta\" watch your kids, this probably isn't the park for you. It's huge, and it is a MADHOUSE.", "author": "Ezra C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-11-18", "description": "Love this place.  The sound of all the drummers in the field beside sets the tempo.  Walking by the old carousel makes you feel like you're in a movie. Ice creams await for later. And then... what a place!  You can't stop thinking that a kid could really get hurt or lost here... and then... you settle into the chaos of watching them careen down the concrete slides and race quickly around all the play structures.  You will be tired when you go home. You're kids will be too. And you'll feel very pleased that you took them there.", "author": "G O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-04-18", "description": "Good times, I used to slid down those big ass concrete slides. It was like something out of a dream and fun as hell.", "author": "Keit K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-09-11", "description": "i was walking through the park checking out the scene.  i haven't been in this area in so long.  i can't even remember when the last time i was here, so i decided to check out the new children's playground.  omg...i can't believe it.  it's suited for every child and every need.  if your child is in a wheelchair or uses a walker, it's the best.  like most playgrounds it has two levels.  you could get to the second level by walking up the stairs; or there's a sidewalk on the side of the structure and you could wheel right up there and go down the slide.  i do want to stress, that it's not suitable for bikers/skaters.\n\nthe playground also has a special swing for children who needs assistance sitting up.  if you have a child who needs a lot of assistance, i would suggest to bring your own straps for the swing.  yes, they do have slots to insert them.  i can't wait to go back.  \n\nfood for thought:  stay awhile...pack a picnic, go down the slide and just chill :)", "author": "aundrea a."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-09-16", "description": "Wonderful children's park.  Where all the Tarzan babies go to play. It's also an excellent place to go when you want a reminder of why it's so great not to be a kid owner.", "author": "Dee I."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-04-28", "description": "i took the kids here for the first time a couple of weeks ago.  i remember coming here as a kid on one of my 3rd grade field trips.\n\ncoolest thing has to be the cement slides.  basically, you take a piece of cardboard, put it under you bum, and you slide down these concrete slides...the slides are pretty high up there, so coming down is sooo fun.\n\nthere's a giant spider web to climb, lots of swings and slides, and enough room for lots of kids.", "author": "Ray R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-08-03", "description": "Finally, a nice place to play for kids at ggp. Bathrooms are still yuck, but over all what a breath of fresh air compared to what it used to look like. Moms walking around in heals and running after their kids in the park, priceless...haha!  Love all the options to eat in the area after a day at the park.", "author": "Dee D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-09-01", "description": "We took the kids (almost 2 yrs old) and they had a blast. There was plenty of parking even on Labor Day! There is so much for the kids to do slides, swings, climbing, water, sand. Next time we will bring stuff for a picknick because the grassy shady area around is so beautiful. The equipment is great and they have the big kid stuff away from the little kid stuff. This park is great for all ages.", "author": "s c."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-06-09", "description": "I love the yellow spinny cups, the cement slides, and the giant spider web of ropes to climb all over!", "author": "Full T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-04-17", "description": "Stopped by the carousel on Easter Sunday and were disappointed it was closed. It is only open between Memorial Day and Labor Day. So we had to explore the playground next door. Most of the park has an awesome spongy moon ground material not to mention a zip line, giant rope structure and a huge cement slide!! Too much fun! They hooked it up at this park. I was sad the sun went down", "author": "Adrienne G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-10-21", "description": "this was the playground of my youth; my parents took my brother and i here every weekend. so as soon as i took off my shoes and plunged my feet into the sand by the cement slides, i knew it will always be one of my favorite destinations...ever.\n\ni must test the new equipment next time when i wear my play clothes. i can't wait!!!", "author": "May T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-10-25", "description": "My Family and I just went to the park for our second time today.  I decided to take some of my photography equipment I use for virtual tours - and I produced some great shots of the day:  http://bayareavr.net/?p=91", "author": "Eli P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-07-06", "description": "Ahhhhhh!!!  Do you hear that?  That's the choir of angels I heard when my family finally found this playground.  I had read that the playground was awesome.  Our hotel was 3.5 miles away in the Marina district and no joke, it took us over an hour to find it.\nThe husband driving, me with my iPhone and GoogleMaps, more than a little tension because the husband was listening to about 25% of what I was telling him to do, but somehow it was my fault he was taking wrong turns because I was the f'ing navigator, my parents trying to ignore the tension, the kids whining for snacks but me ignoring them because I didn't want them puking from the erratic driving on the crazy SF hills...  it was all forgotten when we walked into this haven of a playground.  \nMy 4 year-old was in absolute heaven.  I won't go into every aspect of the playground, but I will say my favorite was the cement slide that my usually shy 4yo scampered up without hesitation.  The place is huge, the largest playground I've ever seen.  We have some great ones in Chicago, but honestly nothing like this.  \nThere is plenty to do for a large range of ages.  It's spread out so even though there were many people there, it didn't seem crowded at all.  I'm so happy we made the effort to seek it out.  My kids loved it, and were very sad to leave.", "author": "L T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-03-01", "description": "my 5yr old grandson had a blast on the slides & jungle gym. He loved the sound of the drums from \"hippie hill\" Yes, there are no fences,  just have to keep an eye on them. My granddaughter loved the carosel, as did my grandson.\n There is a sign @ the entrance to the park that says \"no adults allowed without children\"", "author": "L W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-08-03", "description": "This park is next to a large meadow for other sports and tennis courts, which makes it a more popular location.  The scenery is quite good, but the weather is often cloudy.  \n\nThe stone slides have got to be the major and classic attraction of the park, where you use the cardboard paper that magically always available around the slides to slide down.  However, you have to be extremely careful of not scraping your hand on the stone.  \n\nThere is also a large climbing structure connected with ropes, though this can be dangerous when people are shaking it on purpose.  \n\nThere is a play structure with the usual metal slides, steps, and such.  However, there is a sign on this play structure that says \"No Adults Unless Accompanied by Children\", which may apply just to the play-structure itself or may apply to the ENTIRE Children's Playground, so if you are an adult, you might get fined for playing on the stone slides or the small rock climbing structure or on the rope structure.", "author": "J L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-10-11", "description": "it's not as good as it used to be, but it will keep the kids happy for hours, and that's worth a fair amount!  it is a big place, so a little hard if you're tryng to keep track of more than one child, but i believe the old one was even worse for that.  so, the kids love it, i'm happy:)", "author": "sarah b."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-05-25", "description": "Not sure why there different listings for the Children's Playground in Golden Gate Park and the Koret Children Quarter with different addresses, they are one in the same.  We went there on Sunday 5/24/09 with my 5 yrs old and she had a blast.  The rope structure was awesome and the cement slides were fun.  Do bring your own cardboard to go down the slides.  The carousel was free for 5 and under but requires an adult ($2) to go with them.  It is a huge playground with many things to do.  We can easily spend hours there.", "author": "Amy B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-07-19", "description": "Because the school district has banned kids from flying, I try to take my class here as often as possible.   They have swings, a short zip line on one of the structures, and a very tall rope structure.  It has different structures and equipment for different ages.   It's a place where kids can be kids in relative safety.  Besides the usual dangers mentioned by others, watch out for the food stealing squirrels!", "author": "J T."}
