{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-23", "description": "Wow! Incredible food at a great price. This is my first time at Gordo's, very impressed by the food. Fresh and delicious like it was made at home!\n\nThis spot has a nice well kept interior, very homey. Simple to understand menu, no price gouging.\n\nStaff is friendly, explained a few things to me. Honestly really impressed by Gordo's. Great value for college students like myself.\n\nI would definitely come here if you enjoy great Mexican food.", "author": "David B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-28", "description": "Holy hell who knew you could get a bomb salad at gordo?! I've always thought gordo was mediocre at best but it's all we got out here so it gets the job done. But the taco salad I just had was fantastic. Tons of delicious ingredients, the poblano dressing was amazing and it's the perfect lighter option if you don't want a burrito. \n\nGet the salad, people!", "author": "Taylor B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-09-28", "description": "DO NOT EAT HERE. Just spent $30 on a taco that was half decent, a steak quesadilla that DID NOT HAVE A SHRED OF CHEESE, and a super all meat steak burrito that came with some carnitas that tasted days old and watered down.\n\nThis place is a joke, how could you screw an order up so bad? No cheese in a quesadilla? Are you kidding me? Wrong meat in a burrito? All of this for the sweet price of 30 bucks. Ya right. Never coming back. Go to one of the other excellent options in the area.\n\nDON'T WASTE YOUR HARD EARNED MONEY ON THIS PLACE!", "author": "Blake P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-10-25", "description": "This place is lame now. So sad. I grew up eating gordos. You order A regular size burrito and you get a tiny kid's size. Meat is skimped as well. They are trying to make it like a chipotle with all the new bowls they are adding to the menu. \n\nNew ownership is definitely taking advantage of the new SF Richmond district crowd. Higher prices, smaller sizes.", "author": "Monica R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-18", "description": "After a long day of disc golf and beers in the park, Gordo Taqueria is just what I needed. \n\nThis place is small, like it only seats seven, so more than likely just order it to go. I got the grilled chicken burrito with rice, beans, guacamole and house hot sauce. This gut bomb was amazing; the chicken was tender and full of flavor and the rice was the perfect addition to soak up all of those burrito juices. \n\nThis burrito was huge which is good, but was also pricey. It was just over eleven dollars with tax, but worth it since it filled me up for a good five hours.", "author": "Nate M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-25", "description": "In looking for a restaurant to cater an event over the weekend I came across Gordo Taqueria. With less than 24hrs Luis, the restaurant manager had sent me photos of trays and follow-up with prices. A day later I was there picking up food for 80. Everything we ordered was delicious, they neatly packed everything and even helped me to the car. Extremely satisfied and great service from Luis and their staff. Thank you!!", "author": "Carina L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-14", "description": "The place got more expensive over the year, but it's still a quick fix for my burrito crave. After traveling for a while, I am home sick for a little of San Francisco local food. The place comes to my mind because it's a childhood restaurant for me when I studied at Washington High school. There are multiple locations of this shop, but I see them mostly in outer Richmond. \n\nThe super burrito has a gigantic amount of rice, beans, salsa, meat and cheese. I like to add sour cream and Guacamole, but they do come in as an extra charge. The tortilla is freshly steamed before making into the burrito. It's dense enough to keep the burrito from leaking sauces. The taste is fairly light, and that wrap up a very good balance of flavor from the beans, rice, and meat. There are usually a long line for lunch, but the chefs are very quick and skill to make the dishes. I recommend taking the bus here or walk if you live local.", "author": "Vincent Manjin L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-27", "description": "I'm glad to report that the problems outlined in my review below have largely been fixed.  A few of the original staff are back and they seem to have spread their professional magic to the newer people. I don't even see the burrito maker with the questionable attitude working there anymore.  \n\nThe burritos are back to slightly above mediocre, but that's good enough for me when I'm in a rush. \nAs cautionary advice, I'll remember my first review every time the big holidays roll around each year. I still go to Gordo's when my options are limited, and I probably won't bother during those holidays.", "author": "Jackson B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-08-20", "description": "Holy crap. Rudest staff I've ever encountered. Female wrapping burritos was full of nasty glares and \"really? You want extra tomatoes?\" style attitude throughout the entire ordering process. She even finished it off by slamming the burrito on the counter. The whole vibe of this place is nasty. Male staff are constantly glaring at the 14 year old girls that walk in. They used to be the only option in the Richmond for years, but the Richmond has grown. We no longer have to tolerate Gordo's.", "author": "Jamie S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-16", "description": "Last two experiences were very solid and maybe Gordos is back on track with a consistent product!", "author": "Alan S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-09", "description": "Looked for a quick place to manufacture a delicious gut bomb for cheap. Well, it was quick, it was delicious, but it wasn't cheap. I didn't expect a place called Gordos to ask $10 for a burrito. It was tasty though ‍. Although they weren't particularly friendly, I didn't encounter any of the bad attitude mentioned in other reviews.", "author": "Matt S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-08-27", "description": "I have been a customer there for almost 10 years and the food has been mediocre, but today was really cold and windy and they had a door open so it was REALLY drafty in there!  I have a 2 year old who gets febrile seizures so we first closed the door then this guy opened it, then we closed it again, then he goes to open it and we asked if we can please keep it closed he barked at us saying it gets foggy in there... I suggested they have management do something about their ventilation and we left. Never coming back there again! Rude!", "author": "Tony L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-08-19", "description": "It's blah. I mean, it has all the components. But it isn't the mission. In Tahoe, (no not even Tahoe) in Oregon I'd be stoked for one of these. But I've been to mission street. I know what a burrito is supposed to taste like b\n\n\"Yo B. They killed killer B.\" I think of this movie every time I do that.\n\nAnd a super burrito is supposed to come with all these things for which you charge extra. Why even call it super!? Meh. But they've been around more than half my life. So I'll go there. But I won't be thinking about THEIR burrito while I'm eating it.", "author": "Brett R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-29", "description": "These carnitas tacos and bowl were sexy! Fresh, flavorful, and big portions.  The price is right and the sauce is SPECIAL.  Go.  Now. \n\nThis was a recommendation we took from word of mouth and I'm so glad we did.", "author": "Meagan M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-06-20", "description": "Their burrito wrapping skills are not as great any more. It's not wrapped tight. Loosely wrapped so all the rice and sauce started coming out of the foil and onto my clothes. Disappointed.", "author": "Christi S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-02-16", "description": "\"Do you ever walk into a restaurant, and immediately feel full? That's Gordo\" - my girlfriend.\n\nGordo is a standard S.F style taqueria. Cleanliness is questionable, portions are huge and food is good. This particular location is slower than molasses and I've had to wait twenty minutes in a 5 person line to get a burrito that takes literally 30 seconds to make. It's downright kafka-esque. \n\nThe food is very caloric, and hits a certain \"I want to feel stuffed\" craving very well. \n\nHeads up, their guac is literally purée'd avocado with minimal flavor. Not worth paying extra. Food usually sits out for hours and it's hit or miss depending on who assembles your food.", "author": "Ben S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-11-13", "description": "I'll preface this by saying my family of 5 has been going to Gordo's for about 25 years now and I've been going my whole life. Amongst my whole family it's safe to say that we've ordered probably a thousand burritos from Gordo's at its various locations in the last two decades.\n \n One of the great things about Gordo's that we loved was the consistency, the relatively short time to get a burrito, the price, and the location. The only thing that is the same convenience for us is the location. I'll go into detail below.\n \n I don't know why the old burrito makers left, but they've been replaced by a newer, younger worker. This hasn't done them any favors. The consistency of a Gordo's burrito is no longer there, whether it be a ripped tortilla, too much rice and beans and not enough meat, I no longer know what to expect when I open up the the tin foil of a Gordo's burrito I've opened up hundreds of times before.\n \n Another thing I've noticed in the last few months is the fact that they only use one of the two available counters to make burritos. I'm not sure if this is because they do not want to pay for second burrito maker, but it has cost them in long lines that often reach the door of the restaurant. Now fortunately you can order online at this location which I do and I recommend anyone who wants a burrito in a timely matter to do so as well.\n \nNow this probably goes without saying as it's becoming increasingly pricier to live in San Francisco, but they've recently upped the price on a super burritos from about $7 to $10. If my family of five once they each get a burrito for dinner, I've gone from paying $35 to $50. For what you get it's just not worth it for me anymore. It's very unfortunate but it is what it is and I'm happy for others who are able to afford their new prices.\n \n So the location obviously is the same, and that is now my thing about the Taqueria. Living in Pacific Heights, it's much easier to get to get to the Richmond then it is to find a spot somewhere to park in the mission. If someone has any suggestions for a new Taqueria whether it's near me or near Gordo's, please let me know.", "author": "Patrick M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-15", "description": "Seriously Gordos is so great! Their tortillas are so yummy and chips are a bit greasy but that makes them so much better than your other places tortilla chips. I love to eat here, and my only negative thing to say is I get a pretty simple order when I'm here and the price is always different for the same meal. Anyways....their ingredients are so tasty!", "author": "Hoku L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-12-17", "description": "I've been going to Gordo for over 20 years, frequently or even daily at times.\n\nI think this Gordo used to be better. I'm talking 10 years ago though. Lately the meat is not the quality it used to be. I still find it acceptable, but I often find myself ordering the meatless burrito with Guacamole after numerous disappointments in the past few years. This can also vary by location, I mostly go to the Geary and 19th and Clement and 24th location. This review is specifically for the Geary and 19th location however.\n\nFirst of all the burrito. If you like burritos, you'll probably like this place, especially the guacamole which, most of the time is fresh and tasty. All of the food uses a very high amount of salt in my opinion. The green hot sause is pretty good too if you are into that, but not very spicy (just a little). I'm not going to go into all the food connoisseurs language about how the meat was succulent or the tomatoes were ripe with flavor and had a nice refreshing finish, but overall its good if not great, at the expense of the high sodium factor. I tremendously enjoy the burritos here most of the time (95% or more of the time).\n\nThis particular location has a restroom as well as a handful of tables. If you choose to sit here to eat, there is usually a place to sit without having to wait, and is a comfortable place to have a chat with some friends afterwards for a few minutes without feeling pressured to leave due to it being crowded.\n\nDuring peak times, there is a line, but usually no longer than 15 minutes at the very worst as they have 2 burrito making stations here. You can watch them make the burrito as you customize it to your liking. They will ask you in this order - #1 your order, which they will then prepare by either steaming or otherwise preparing your tortilla(s). After a short pause, they always fill the burrito in this order - beans, rice, meat choice, tomatoes, extras which cost money (guac, sour cream, jalapeños (free), etc.). They also often have an optional \"red\" hot sauce, but if you don't specify, they will give you \"green\" which I think is better anyway.\n\nGuacamole is a must unless you absolutely cannot stand it. Its also under $1 unlike Chipotle which is $2 or much more.\n\nNow one more thing...\n\nI also have an experience with the douchebag working the register. Granted, this is only one of their staff and other cashiers have been ...average or passable and I don't expect anything amazing from an affordable burrito joint.\n\nFirst of all, this place has a history of charging meat burrito prices for their bean and cheese (meatless) super burritos, so look out and be sure to question them if the charge doesn't seem right. I'm sure many of you won't lose any sleep over a 50 cents to a dollar higher charge per super burrito, but its about the principle. If the price being charged doesn't reflect the charge on their big wooden overhead menu, I think you should say something about it. ESPECIALLY because of the douchebag at the cashier I encountered at least twice about this same issue A FULL YEAR APART.\n\nMakes up some bull poop about it being because of the tax. Regardless of what my math level is, I'll tell you I can use a calculator which is on every smartphone ever and quickly compared the cashier charge to what should be charged based on the big wooden menu. Douchbag cashier REFUSES to double check and insists its tax related, then I challenge him to press the buttons for a bean and cheese and immediately notice the first charge for the burrito itself is too high. I usually get bean and cheese with guacamole, so that is 2 buttons - 1 for the burrito, and 1 for the \"extra\" guac. He says the machine just charges that amount and is basically being a gigantic prick about it.\n\nNow I'm not going to go bankrupt over a dollar or less difference, but its about the principle, and the reaction to my challenge. LEARN SOME BLEEPING CUSTOMER SERVICE you entitled piece of poop! If you just got off your high horse and walked over to the menu, then pressed the button on the cashier, you could CLEARLY see the charge was wrong.\n\nHe begrudgingly gives me a dollar back from the tip jar and makes a remark that \"you probably need it\". Was that really necessary? I was only rude to him because he was rude to me first. Also, that was TIP that someone else left FOR THE STAFF, WHY ARE YOU GIVING THAT BACK TO ME, A CUSTOMR\n\nLuckily this place is a low cost place and so many people don't expect any service, and burritos are good if you avoid the meat (some people find the meat good even). For this reason, and mostly overlooking the douchebag casher, I give this place a more than fair 3 stars. But they really should correct that overcharge for meatless burritos. I just hate to thinK how many people they have overcharged over the years because just recently I think its happening again at a nearby location on Clement (yet to be confirmed)...sigh. Thankfully not all Gordo locations are staffed with douchebag cashiers.", "author": "Ken S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-20", "description": "BOMB dot COM ! on the go - quick authentic burritos! It's not fancy, super quick with limited seating. Good luck with parking! Your typical bay parking", "author": "Ashley M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-29", "description": "Gordo taqueria is a nice place for a quick bite or a huge superburrito if you feel like it. It's conveniently located in the busy intersection, there's always a line, but it seems to move quickly. Their food is good, real Mexican food for solid 4. Their burritos sometimes don't hold together and are a little bit too moist. And the real minus is their restroom which is \"out of order\".", "author": "Oleg K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-09-10", "description": "What's good? The quality of the meat (I got carnitas), and the prices aren't bad...IF you don't want anything extra.\n\nWhat's not so good? What you get for the money. The burritos are smaller than most SF burritos, and about the only things on the regular ones are meat, rice, and beans...it makes for a very dry and plain experience, although all of the flavors in it are solid. \n\nThey also don't even offer nachos, which is sort of my mainstay. And the service was inexplicably slow for 445PM on a weekday. \n\nSo, would I rather have a $7 one-meal, pretty plain burrito? Or a $11, 3-meal, loaded set of nachos with scrumptious, perfectly-seasoned meats and plenty of toppings? I think that question answers itself.\n\nIt is not, at least, the worst burrito I've found in the city...that dishonor goes to Chino's in the Outer Richmond, which serves larger but amazingly-tasteless burritos.", "author": "Chris S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-08-26", "description": "Been going to gordos for a long time ever since high school decade(s) ago jk. It was always that place like, \"man that's the type of food thatll hit the spot\" place to damn it's either I grew up or the workers changed. BE ADVISED! Bring a tampon or pad when u come here. Not for yourself but for the cashier. I went in with my wife ordered 2 burritos and a side of rice and beans for my daughter. Didnt say anything to us when we got to the register but human nature taught me to look at the screen that showed the price. Handed my wallet for my wife so she can pay it since I was holding my shoeless daughter. Got the card back. Female cashier turned away....waited......I think the jeapordy song finished playing. \"Can we have our receipt,\" \"Did you wanted that!?\" Head turns away....\"Yeah we do.\" Not tryna get scammed for tips. But we got our receipt and left. No customer service no thanks. That's why I'm never tipping here. Bye Felicia!!!", "author": "Jordan S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-02-13", "description": "I've been coming here for some time now on and off,  and I must say this is the most stingy restaurant I've visited. The burritos are small everything is measured to have the least amounts as possible, even though the service us great the food portions are a joke. I paid $10 for a small burrito that had more beans than anyrhing. Would not go back again.", "author": "Jose N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-01-26", "description": "I've been coming to this place at least twice a month for the last 8 years but unfortunately I won't be back. It's a completely new crew and they're awful. The proportions are all off and they don't even bother to wrap the burritos. They just cover it in tin foil and leave you on your way to eat your four cups of sour cream. Bummer. This place used to be the best in the city.", "author": "Caitlin N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-27", "description": "I used to stop here every so often around dinner time for some takeout burritos. Sometimes the line is out the door, and the service can be slow. The last few times there have only been one or two guys working which means each order can take twice as long. The food is always decent, but after a rude encounter during my last visit I won't be coming back to this Gordo's location. The server asked which type of beans I wanted, and I could not hear him over the noise so I said chicken, thinking he was asking what meat I wanted. He then rudely asked me if I spoke English and asked about beans again.", "author": "Larissa S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-12-03", "description": "What is happening Gordo? I just ordered a burrito for delivery. I know you knew what I paid for since it was printed on the burrito wrapper. So why is there no sour cream in my burrito? Also, the green sauce goes into the burrito not on the side!  Since when is it a side piece? Please go back to normal and make your burritos like they're supposed to be. K, thanks.", "author": "Irina M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-28", "description": "Carnitas Burrito Supreme ...\n\n... that is all you need to know when you go there to eat! Don't waste your time reading the menu! Just asked for Carnitas Burrito, pick your favorite bean, and whatever it is you like to add, and maker sure .... here is the trick, so pay attention! .... make sure to ask them to put some of the crunchy carnitas in there for you too! You will not regret it!", "author": "Afshin A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-12-05", "description": "This place used to be my favorite place to get my burritos, but they recently changed their staff and now it just doesn't taste as good. They lost their consistency they had with their old employees and now they are constantly changing new people. I still come here for convenience, but the food is not as good.", "author": "Ryan Z."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-03-10", "description": "Do not eat here.  It's gross, sloppy and inedible.  How do you screw up a quesadilla? Oh that's right, by not putting any cheese in it.  Carnitas - flavorless and not even crispy.  Honestly I didn't mind how they left items out of the order because I threw it all in the trash anyway.  Disgusting.", "author": "scott P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-10-30", "description": "people say i'm so mexican my blood type is \"tapatío\". well i'm only part mexican. because the other half of my blood is called GO GIANTS.\n\n\nand that's why every even-numbered year i go here for a burrito. super. all-meat. the funky green wrapper.", "author": "Dan B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-18", "description": "I love Mexican food and I'm picky sometimes!\nBut Gordo is above average. I love it since it's near my house!\nThe portion is great and it's not too expensive!", "author": "Candice L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-16", "description": "I know Gordo's gets a bunch of flack for not being real Mexican food, but to me, it is in it's own category. Portion sizes are decent. It's quick. Their guacamole is pretty decent. It's a different kind of burrito then from a real taqueria. It's always a quick go to for me if I'm in the Richmond district or in any of the other areas where this is a Gordo's.", "author": "Julie L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-06-20", "description": "Been to this place on 3 separate occasions and every time I think they could work on their carnet aside seasoning.. it's flavorless. \n\nThe only reason it's a 3 star is because they have friendly enough service and it's quick.", "author": "E A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-26", "description": "Currently, this is my favorite Mexican restaurant in the city. The food is amazing and made very quickly and conveniently.", "author": "Beth S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-08", "description": "I've been coming here for years. Gordos was my favorite taqueria growing up. The prices were low, the meat and fillings were flavorful, and the portions were huge. I remember countless weekend mornings when I used to eat super Gordo burritos with my best friends in college. It was the perfect aid to our hangovers. We would run home because we were so excited. I also came here during my time in grad school to reward myself after a midterm or final exam. Lately, I feel as though the quality has gone a bit down hill and the prices, just the opposite. Today, I ordered a super steak burrito with everything. The price was around $10.50, a little more than I'm used to. For that price, I'm expecting a really juicy and delicious burrito. However, the steak tasted bland. The beans and rice tasted fresh, but lacked flavor. I couldn't distinguish the sour cream from the guacamole. I was pretty disappointed. Maybe there was new staff? I didn't recognize anyone there. When I review Gordos, I think it is fair to compare it to other nearby taquerias and restaurants. For $10.50, I would rather go to Taqueria Los Mayas or use that money to get some pho. The curry restaurant next door is also a great, delicious alternative. It will definitely be hard for me to go to Gordos anytime soon with all of the tasty options nearby. Gordos was 5 stars back in the day. Within the past 4 years, it lowered to a 3 or 3.5. I hope it will get back to that 5 star level. I will give it a few more tries. If it is consistently a 3, I will have to say farewell to Gordos.", "author": "Petunia M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-02-13", "description": "What's up with the changes?!? I always get a simple quesadilla with rice & chicken and  it's the best! This time it was barely left on the griddle to get crispy & melt and barely any rice was added, which was flavorless and dry anyhow.\nThis is mainly a review for management and hope things get turned around.", "author": "Taylor T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-03-27", "description": "Service sucks, people are rude. You can definitely get wayyyyyyyyyyy better Mexican food than this place in the city.", "author": "Ada H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-03-24", "description": "Jalapenos on the side? i asked for (2) on the side...ordered 2 plates and a quesedia. When I got home i only found (1) jalapeno on the side with...4 slices inside.\n\nThe food tastes good and seems relatively healthy/clean. However, doesnt make up for the lack of everything else such as pricing inconsistencies and the stuff they put in your order, which seems shady small at times.", "author": "HJ C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-12-13", "description": "Good local food place but sadly they just implemented online ordering. So if you're a walk in during busy times expect the wait to be double than what it used to be prior.", "author": "Mike P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-04", "description": "We were visiting from LA and we didn't know what would come close to the food from here so we found Gordo Taqueria and it was so good! I got a simple quesadilla which I loved because it wasn't greasy and everyone else got burritos. We were all satisfied and it was not expensive at all and the employees were kind! Definitely going back next time we're in SF.", "author": "Angie M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-01-31", "description": "The place itself  is a nice Mexican restaurant, Im a regular  customer,  the food is okay, but they recently closed their restroom for good - it's  \"out of order\" forever.", "author": "Siarhei F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-22", "description": "Our go to in the outer Richmond!!\n\nMe and my boys always have a great time here !\n\nThe food is solid and they treat me and my sons nice", "author": "Azikiwee A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-10-01", "description": "The food is great, affordable to go food.  They were recently closed for remodeling, when they reopened it looked the same except for a fresh coat of paint on the walls.  I have been going to gordo's at this location since they opened the location in the late 90s.  The people who work here are nice and friendly.  \n\nI took two stars off of my review because they ran out of black beans tonight and were running out of food at 8pm on a Saturday night when there is a music festival going on in golden gate park this weekend, they should have ordered double their normal food order rice, black beans and etc.  The price for a burrito had gone up to almost $10, they claim that it is the cost of living here in San Francisco.", "author": "Alix J."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-11-14", "description": "Went here based on Yelp and a friend's recommendation. Something much have change. Greasy, tasteless, poorly wrapped burritos that immediately fell apart. Equally greasy quesadilla that we couldn't finish. Was looking forward to a good neighborhood shop.  This isn't it.", "author": "Jay D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-03-13", "description": "Not sure I like this one as much as the one on Clement.  Although they have more space for seating, they are frustratingly slower,  also I a\nSaw the guy break so many tortillas by overstuffing.\n\nThe guy saw that I saw my tortilla broken so he doubled wrapped mine.  I didn't\n see another guy  get the same treatment", "author": "Erik H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-15", "description": "I don't know why this place has bad reviews ! It's great for a burrito/ huge quesadilla craving . And I'm Hispanic ! Hispanic approved ha. They also let you call in orders for pick up which is great ! And give you huge things of guac and salsa if you order it on the side ! Great quick Mexican stop after the beach :)", "author": "Linda G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-21", "description": "Having Gordo's in the neighborhood or actually having moved back to the neighborhood after  8 years this spot was on the top of my list .. The flavors just mesh together so deliciously.. I prefer the grilled chicken on anything , a burrito, a quesadilla, even in a small cup with little rice and beans when you need a snack but don't want to eat a whole burrito , which I can hardly do..The guacamole  is wonderful and the prices fit every budget.. I did try the steak the other day and that was my only complaint..I think the guy was new not enough meat and lot's of grissell So back to my chicken.. It's Not the Mission but is it real delish!!! Never leave me Gordo's..", "author": "LeeAnn L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-11-09", "description": "If a Gordo's burrito were a gesture, it would be a slowly unwound middle finger. To wit:\n\n* Disinterested employees who have long since dispensed with trying to seem even remotely affable? Check. \n\n* Thrown together burritos with the classic \"Single Sour-cream Splotch?\" Check. \n\n* Guacamole of a shade of green you've never seen before? Check. \n\n* Inspecting every bite for the knuckle hair that you are  sure is in there somewhere? Check. \n\n* Lackluster flavor, pricing and size? Checkity check check. \n\nSeriously folks, unless you are literally in some sort of Saw-esque type situation in which you must eat one of these burritos to save a loved one or a favorite appendage, do yourself a flavor and head to the mission. Your tummy will thank you.", "author": "Andrew W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-10-08", "description": "I actually prefer the Gordos on Clement Street, but this location has the all meat burrito! And I love variety! Typically the roommate gets the Carnitas super burrito with refried beans while I get All meat super burrito.\n\nService here is inconsistent. Sometimes I get someone that's super helpful and accommodating, while other times, I get someone who seems to be grudgingly making my burrito. I normally get no beans, no rice and no sour cream, so at times I get a weird look for ordering a super burrito. But it's my burrito! I can do what I want!\n\nOne time, I ordered the all meat burrito and was told that meant I get all of one meat and nothing else on the burrito. Why does it cost more than a normal burrito then?! I tried correcting him and telling him that meant I get all the meats avail, but there are no descriptions on the menu, so it was a he said, she said kind of situation. Instead of arguing, I just said okay since there was a line behind me. So apparently, I paid more for an all meat burrito cuz it had more meat and nothing else. It didn't make sense, but whatever, I had no choice but to let it go.\n\nWhen I can get an actual all meat burrito, I enjoy their offerings. Otherwise, I'll swing by the Clement Street location instead.", "author": "Elena N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-09", "description": "Always get the Gordo plate, extra rice in place of beans with grilled chicken. Plus the chips and spicy salsa. My go to lunch 2x a week. Quick easy and cheap.", "author": "Iaintworried B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-11-07", "description": "The worst burrito I've had in 15 years in San Francisco.\n\nCome to Gordo if you want a cold, soggy burrito featuring two ***slices*** of \"cheese,\" swampy beans, watery tomato salsa, clumps of bland rice and \"guacamole\" the color of store brand mint chocolate chip ice cream, slopped together by a worker who doesn't seem to care at all.", "author": "Sam S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-11-20", "description": "Most frustrating quesadilla I've ever eaten. \n\nIt was not even wrapped tightly at all so when I got home and tried to bite it it fell apart and basically I had to use a fork to eat carne asada and sour cream mush. \n\nI think this place is just convenient but not really good quality because the quesadilla was not flavorful at all. \n\nI'll stick to El Farolito and Pancho Villa from now on.", "author": "Amanda R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-06", "description": "A friend brought me here because we were both craving good Mexican food. But she said the thing to get is the carnitas. She was so right on!!!  Asked the man behind the counter in Spanish if I could try a little spoonful. Wow so tender and delicious. Melts in your mouth!\n\nMy friend got the burrito but since I'm low carbing, I decided to just get a container of carnitas and some guacamole. I now have to go at least once a week it's that good! \n\nI hope to try the burritos or tacos at some point because everything looks delicious.", "author": "Stephanie T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-04-30", "description": "Just ordered delivery burrito from this place and it is probably the worst In the city. My quesadilla had no cheese in it, but was filled with rice and shitty pinto beans. Why the F are there rice and beans in my quesadilla and no cheese? Maybe it was my burrito? Oh no, my super burrito was the exact same thing....just rice and beans. And the other order was incorrect. The most disappointing food order EVER!", "author": "Kristin G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-20", "description": "Really good Mexican food made to order. I love their super burritos, and their carnitas are awesome. If you're looking for good Mexican made fast come here!!", "author": "Katie G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-17", "description": "This place has always been a local staple for late night bites for me.  The food is always super good, reasonably priced, and service line moves quick.", "author": "Steven H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-09-15", "description": "The burritos are decent taste-wise and size-wise. The service can be a bit better though. Came here last evening at 5:45pm with a line out the door. Didn't get to actually order til about 6pm...you would think that with a line out the door, they'd have an extra person helping make the burritos but no. \n\nCashier guy stood there taking people's money. Another dude just kept wiping the same spot on their fanning system above the stove for about 10-15 min. Burrito maker guy doesn't talk and doesn't make eye contact. He will give you whatever he feels like giving you unless you speak up. I don't even want to go into that right now.\n\nGot my burritos and left. Thankfully it was good so I'm not too irritated. There was also a guy who came in right before I did. I thought he acted very suspicious but came to find that he was mentally challenged. It was entertaining watching him talk to literally everyone in front of him, all the while cutting them in line. I'm glad no one got pissed at him and just let him through.\n\nNext time though, I think I'll head over to the Clement one. I paid $18 for 2 super burritos, no drinks and nothing extra.", "author": "V M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-05-15", "description": "Gordo Management - we got poisoned yesterday from your burritos that we bought at 6pm. We got 5 burritos, beef/chicken. 3 out of 5 people in my family got poisoned and had bad stomach ache all evening and night. Both beef and chicken burritos had something bad in them - so it wasn't the meat, probably either Salsa, Sour Cream or Guacamole was bad!\n\nI love Gordo and this is the first time i got poisoned there in 15 years that i've been going to this place.\n\nPlease - make sure that your ingredients are fresh and clean. I love this place and will be back, but if you poison me once again, i will not comeback.", "author": "Serge U."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-04-09", "description": "Ordered a chicken burrito with a spinach tortilla, chips, and no rice. Instead, I got a flour tortilla, no chips, and rice. If they can't get an order that simple correct, I won't be back.", "author": "Christopher M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-09", "description": "Ok, I'm from San Diego, and i know my Mexican food partly because i am one, not food, unless you travel in a certain circle in which case please don't follow me, anyways. ... really deliciously made carnitas in what they call a quesadilla prepared like a goddammed burrito! \nGod bless you, even though I'm atheist, seriously shit is DELISH YO!!!!", "author": "Tommy L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-16", "description": "Huge fan.  I've been going here for the past 15 years, this is always a stop.  I love there boiled chicken, and their burritos are consistently moist and flavorful and their quesadilla are scrumptious.  Sometimes there's a bit of a wait (10 minutes max), but at those prices its well worth it.  I've ever had a bad burrito from this place. Definitely get the hot sauce if you're not sure. It isn't that hot, but it adds a lot of flavor.", "author": "Howard G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-12", "description": "A neighborhood staple. Decent burritos at reasonable prices. Quick and casual. One of our go-to places. \n\nIf they were a bit cleaner and had a few more interesting items on the menu, and perhaps some good beers, they'd be a five star in my book.", "author": "Al S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-28", "description": "Gordo's was always one of my favorites when I lived in the city 4 years ago.  Chose to stop by while visiting for the weekend and of course did not regret it!  Ordered a regular carne asada burrito with guac and sour cream and my gf got the same but with carnitas.  It was her first time here and she loved it!  The regular burritos are a good size, but I regretted not getting the supreme for a dollar more. \n\nThe taste is great!  I prefer black beans, but im sure they all taste good.  Guac and sour cream cost a little extra but adds great flavor to your burrito.  \n\nGf loved it so much that she insisted on going back the next day!  Next time I'll be sure to get the supreme.  We will be back, GORDOS!\n\nBiggest downfall of this place.......parking -_-.  Spent 30 minutes just trying to find a stall on Saturday night and Sunday midday.", "author": "Bryce W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-08-18", "description": "My tummy was rumbling, Jeremy P was about to curl up and die on the sidewalk. Brew Fest, too much Tequila, and a serious lack of sleep were getting the best of us. We needed a burrito, STAT. \n\nAs we made our way to Blarney Stone to watch a meaningless preseason loss, we stopped off in Gordo's to replenish ourselves. I've had Gordo's plenty of times, and am always moderately satisfied with it. I tried to Chili Verde Super Burrito yesterday (around $7.50) and had the same feeling as I've always had about Gordo's: it's mediocre, but edible. \n\nNo hot suace on the tables, or really anywhere. Their green housemade \"hot sauce\" is very mild and lacks flavor, kind of like the Chili Verde. My mom used to make this dish before her vegan days, and hers was always amazing: spicy, tender, made-by-mom-goodness in each bite. I would give my mom's Chili Verde 5 Stars, hands down. But Gordo's, methinks not. But it was filling, and cheap, and sustained me for the rest of the afternoon. The guys who work there either hate me, or hate their job, or a mix of the two. Gordo's is what I expect Mexican food to taste like from the Richmond. Nuff said.", "author": "Crystal C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-13", "description": "Totally worth the wait in line. Everything is DELISH! \n-They have a spinach tortilla choice \n-They melt the cheese on tortilla before filling it.\n-Salsas both green and red gave a great kick to them. \n-Great prices \n\nWe will for sure be return customers.", "author": "Monique F."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-11-18", "description": "Horrible experience for the last time!!! These assholes have been rude, and/ or internationally overcharged me for the last time!!! I've caught them pulling this bs at least 3 times now... I get a super burrito with bean and cheese no meat. Came out to OVER 9$ this time because of guac and sour cream. This always comes with the super burrito and is the difference between the reg and super. I complained but they had their thumbs up their asses and had no idea what i was talking about. This has happened several other times when i catch them they say oooh oh yea \"sorry about that\" look at their coworker like well i tried and reverse it. (keep in mind I'm always out if my way nice to them, i always ask how they are doing, and thank them an unnecessary amout of times (and they are still incredibly rude to me))... Today there were some new people working who were actually pretty nice. There was a very nice woman working (it was her 2ed day) so i didn't want to make a scene but i was noticeably upset and asked about the charge. She asked them and they agreed with the charge. I'm tired of being screwed out of 2 extra dollars unless i point out that they overcharged me.... Also the food is very meh. If it was a good burrito I'd be ok with paying 9$ but this is shitty fast food.", "author": "Joshua H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-01-26", "description": "I just don't love gordo's. The price is good but the food isn't my favorite. I don't really like the rice they use, and the cheese isn't visible where the display of food is so I forgot to include it!! I also didn't think the quality of meat was amazing.\n\nIt's easy and fast so if you are looking for that, then go for it. But I wouldn't go out of my way to eat here.", "author": "Jenna G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-08-06", "description": "Probably my least favorite taqueria I've been too. Soggiest steak burrito I've ever eaten. The steak didn't have much flavor and they didn't even have red salsa, only green and the pico de gallo kind. The way the guy put together my burrito and the food before me was so haphazardly that it kind of gave me anxiety. It was 20 minutes before close and I waited in a long line,only to find out as I was paying that they didn't have chips left. It wasn't the worst but I'll probably never come back here.", "author": "Fab E."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-12-30", "description": "Gordo has really gone downhill since I left the neighborhood. I used to walk from my home on 10th Avenue all the way to Gordo Taqueria because the burritos were that good. I came here on Wednesday and regretfully ordered an asada burrito. The burrito just fell apart as soon as I opened it. They didn't have spicy salsa and their hot sauce selection is non existent. The guys who make your food now are rude and act like they're doing you a favor.", "author": "Darius A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-12", "description": "Gordo's is one of my favorite spots to grab a burrito! They are always consistent with their food and the price isn't expensive! They also have jalapeños for free if you like your burrito with a kick like I do. They also have a plate option which I like to order sometimes and it comes with a few tortillas so you can make your own taco!", "author": "Gordon K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-09-11", "description": "They don't have avocados. How do you have guacamole if you don't have avocados? Where is this guacamole coming from? Suspect! As a Mexican and a Californian  I find this to be a deal breaker.", "author": "Scarlett C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-06-29", "description": "Gordos is an abomination. \n\nTotally flavorless. Everything tastes boring and bland. \n\nSometimes the paper wrapping gets folded into your taco, but you don't notice because it tastes the same.\n\nSolidly mediocre. I've eaten here maybe half a dozen times, and I'm always disappointed in myself for returning. But it is the only place for tacos in the Richmond and it's just so convenient! Low blood sugar makes bad decisions.\n\nI think they charge for each additional ingredient beyond the filling listed on the menu. My two tacos came out to $8. They're supposed to be $2 and change each. Once you see your sad rice tacos, garnished with a few strings of carnitas and some limp, soggy pico, you can't fight the urge to hide them beneath guacamole and sour cream. Good up-sell tactic, Gordos.\n\nPositives: while not good, the food is edible, and and you can wash them down with Jarritos. And the kitchen staff is entertainingly rude.", "author": "Kelly T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-08", "description": "This location is as good as any other Gordo's, and usually not too difficult to park.  Sometimes there are lines at very random times, but they usually do an efficient job of adding another person for food prep, and things generally move along well.  As with all Gordo's- my call is the carnitas.  All of their offerings are good or better, but carnitas if the 'most exceptional' from my perspective.  I'll be back frequently.", "author": "Andy S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-08-18", "description": "Decent burrito place. The regular all meat burrito cost me 7.34.\nNo salsa bar but you can ask for extra sauce. I prefer the red sauce over the green sauce. The cool thing bout the all meat burrito is that they put all the meats into one burrito...so that includes carne asada, chicken, cartnitas, and chile verde.\n\nI would recommend getting the quesadilla. It comes out like a burrito since its stuffed with so much stuff, but the tortilla comes out flaky/crunchy since its also fried instead of jus heated.\n\nOverall its nuthin too special but its good and quick.", "author": "Frank L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-07-28", "description": "for some reason this is not as good as the one on clement and 24th ave.\n\nDo not know why? They are merely blocks from each other.\n\nStick to the one on clement!", "author": "David G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-07-21", "description": "Ive only tried their carnitas tacos and rice here. Overall its good for a quick fix, the tacos are a good portion. I ordered them with sour cream, beans, salsa, and hot sauce. The carnitas is pretty good and seasoned well. The rice is bland and taste like its lacking alot of things. Service isn't bad. I just wish they wore gloves, the older man used his bare hand to scrape the extra meat that fell off when making it and put it on top off my taco..", "author": "Alyssa C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-08-24", "description": "Came in and there was no line. Couldn't decided what to order so we stood there deciding, but no one even asked us if we were ready yet after like 3 minutes. Stood there waiting for about 5 more minutes, already decided on what we wanted to order and then finally someone came over to help us. He was a bit rude and spoke super quick and was hard to understand with his accent and over the loud grill in the background. Ordered the Super Burrito and a Regular Burrito. If you're hungry, get the super burrito as it is quite large. But if you're not too hungry and don't have the appetite for the super Burrito, but still want the cheese (as that's the only difference besides the size) get the regular Burrito and add cheese for only 65 cents. A little overpriced, but a decent Burrito not in the Mission district.", "author": "Courtney D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-24", "description": "Huge fan. I've been going here for the past 15 years, and even though I don't live in the area anymore, when I visit, this is always a stop. I love there boiled chicken, and their burritos are consistently moist and flavorful. I don't understand the complaints about the service; I've never had a reason to complain. I don't think I've ever had a bad burrito from this place. Definitely get the hot sauce if you're not sure. It isn't that hot, but it adds a lot of flavor.", "author": "Michael K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-26", "description": "I had never been to a gordo before last night. The line looked long but it moved along quickly. I ordered a super carnitas burrito. They loaded it up. It was big cheap and flavorful. \n\nThe location is far from me but if I'm in the area I'm definitely going to stop here again. Friendly staff also. Did I say its cheap??", "author": "Marty J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-08-06", "description": "Shared a carne asada super burrito with the BF on the drive home from SF and it was yummy. The rice was cooked perfectly and the sour cream made everything super creamy and delicious. My BF ate most of the meat parts of the burrito but from what little I did have it was good. \n\nCan't say much about the service cuz my BF ordered but IDK why you would complain when you're paying $4 for a burrito", "author": "Ingrid L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-15", "description": "My go-to in the neighborhood since I can walk here from my apt. I had originally gone to the one back home in the east bay in Berkeley so it was comforting to see one so close to me. I always get a super carne asada burrito with everything, extra salsa, and a side of chips and guac. Their guac is incredible. Works every time.", "author": "Thielson D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-01-18", "description": "FACT: THEIR BURRITOS SUCK!\n\nOut of all burritos I've tasted (approximately over 1,000 burritos nationwide) this place is the worst. Far worse than a microwaveable burrito since you would expect a microwaveable burrito to taste like gargoyle balls. But this place, your expectations are completely shattered by how much you pay and how much cardboard-like their food tastes. \n\nIf I made a burrito, which I suck at cooking, their burrito would STILL taste like cockroach piss compared to mine.  \n\nI can't stop saying how much this place sucks. If this place can still have customers, then time for me to start my own burrito place!", "author": "Mike D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-23", "description": "I literally eat here almost every week... not very healthy but sooo delicious....their green salsa is what makes this gordo better than the one on clement imo. Hits the spot everytime :)", "author": "Kasey O."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-08-27", "description": "The super burritos here are just terrible and lazy, especially for nearly $10. The meats are so-so, they dump the beans on with lots of liquid, and the entire thing is consistently sloppy and bland. I really want to like it because it'd be great to have at least a mediocre burrito in the neighborhood.\n\nLa Espiga de Oro on 24th St. And Taqueria San Bruno are consistently the best so I'll have to make the trip and stick with those.", "author": "Patrick C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-07-07", "description": "The burritos are worse than average. Cheep, sloppy ingredients. Lazily thrown together. Only go here when I have NO other quick calorie options in the neighborhood. Close your eyes and swallow", "author": "Mark K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-29", "description": "So I did the mental math and looked at my yearly budget and have come to realize that I spend a solid $1500 a year on Gordo Super Burritos. Why? Because bar none, these are the best burritos in San Francisco. Screw what anyone says, forget, La Taqueria - this place is the best bar none.\n\nAs an added bonus, only local SF-types even know this place exists. Take a date here and she'll act like you played her a Rolling Stones record for the first time.", "author": "Steven B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-11-06", "description": "Constancy A\nParking always a nightmare C (doesn't effect star rating)\n\nHere's the deal,  I like this place I do it's cheap it's fast and there are a few locations around SF. That being said \ncleanliness D\ncustomer service C-\nthe food is consistent which is great. Maybe it's me I don't know but when I SEE you handling my already cooked food with what appears to be dirty hands I instantly want to vomit. I know that all chefs touch our food. I've worked in many kitchens. Maybe it's the dirty hand towels left on the cutting board maybe it's the sweat. All I can think about is dirty fingers on my food. Is it just me? I kinda want the work space to at least look clean! \n\nWill I go back ......yes. Do I do a little ritual asking my ancestors to keep me safe and not let me get E.Coli yes times infinity..", "author": "Nena L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-03-05", "description": "Amazing for people who have only had Taco Bell.\n\nAbove average for people who like Chipotle.\n\nOk for people who like roach coaches.", "author": "Sam W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-08-28", "description": "So, I heard this place had some good food and stopped by to check it out. There were so many flies in the dining area I just walked out without even approaching to order or look at the menu. Won't be coming back to this place. That was super gross.", "author": "Patrick M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-10-29", "description": "Have gone here for year. \n\nAlways liked the food and the friendly service until today. \n\nWhen I went to pay the guy at the register, have not seen before, pointed at a paper sign taped to the register that said Cash Only. I asked when did that change happened he just pointed at the sign and said cash only with a scowl like he was mad. \n\nOne of the other guys said it is just today. The machine is not working. The guy at the register just kept scowling at me. I ask him why didn't you say that. He just kept with the attitude. \n\nI did not have any cash and also I don't need to support bad customer service. \n\nNo longer going to this shop.", "author": "Peter W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-06-22", "description": "Eh, really not a great place. Nothing particularly noteworthy about Gordo, except that it isn't very authentic, and there's usually a decent line there. Not many Mexican food options in the neighborhood, but I would go elsewhere if you're craving a burrito.", "author": "Ryan Y."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-07-19", "description": "We have been in the Richmond District for 4 decades. We started at the Gordo's on Clement and then switched to the one on Geary after it opened as it is closer.\n\nOver the years the quality-quantity-price was just fine.  What the hell happened yesterday!\n\nMy wife stopped in to buy to regular burritos. The size dropped to something as small as a small hot dog from a cheep vender cart! Then when she went to pay they wanted $18 for the two burritos. She was very tired after working all day on keeping people alive in the ICU of a local hospital and with the long line she did not want to make a stink so she paid it and left.\n\nThe burritos were watery, small, had almost no meat in them, and generally were sub-par for Gordo's.  If you need to charge more then by all means do so, but don't fall into the trap of making things smaller and charging more.  We go here because it is always the same and that is what we expect.  \n\nGet your act together or loose two customers who have been loyal for 4 decades!", "author": "James D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-04-24", "description": "Okay food, borderline service, no atmospherics. My backup plan when all other Mexican restaurants are closed. \n\nI have eaten at their other locations too and all are about the same.", "author": "E F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-03", "description": "If you didn't know, Gordo means fat in Spanish.  \n\nThis place is thebest mexican in SF.  I've been coming here for over 10 years and they have definitely begun to recognize me.  The chicken plate, the tacos and the burritos are some of the best.  The authentic and friendly staff make this place one of my favorites.", "author": "Kaylee A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-15", "description": "Gordo, Gordo, Gordo... One of my oldest and best friends. I've been eating at this establishment my entire life. What can I say? It's basically the definition of comfort food for me. There are multiple Gordo restaurants around SF and Berkeley - I have been to all, I have never been disappointed. This is traditional Mexican food at it's finest. \n\nAs a Gordo veteran I feel obligated to let you all in on a few secrets - ask for both sauces - red and green, get the jalapeños, try the refried beans, and for god sakes, mix meats! Otherwise, you can never go wrong with a carnitas super burrito in a spinach tortilla...", "author": "Philip B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-04-22", "description": "It's good for what it is, a quick burrito. I would rather come here than chipotle any day as it's a better value and decent tasting I guess. I'm not saying it's the best burrito, you can find way better spots in the mission but this is practically all there is in the Richmond. \n\nThe burrito is ok but my only gripe with it is, why is the guacamole so thin and almost like a spread?  It's like they liquified the avocado or it's a powdered avocado mix. \n\nCustomer service is lacking terribly. No greetings or acknowledgement of your presence until you're in front of their face ordering. They barely listen to what you want in your order, just assume and put stuff until you tell them otherwise. They have conversations amongst themselves while you're ordering and even when you're paying. I don't care that much, just give me my food and I'm fine but damn, if I'm not rude to you and have manners enough to say please and thanks, don't treat me like I'm an inconvenience to you providing you with business.  I never have that kind of issue at other taquerias, just this one.", "author": "Hiroki M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-03", "description": "Stopped by and got the carnitas quesadilla with guacamole. YUM.\n\nParking sucked and the spot was busy!", "author": "Roger A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-03-02", "description": "food is ok at best, but i think these guys make a lot of \"mistakes\" on the bill. other reviewers have the same complaint on yelp. \n\ni see them ringing up people before they get their food. the receipts are not itemized. interesting right? then i saw them ringing me up and i saw $.10 charge being included. i did not ask for a plastic bag and they are charging me for it. of course, its not on the receipt.  simple math confirm. other times ive been here i got the wrong change. i gave a $20 bill, i got change back for a $10... i got correct change back after i asked, but the cashier did not apologize and acted like it was not an issue...\n\nive been here on and off 15+ years. service keeps going down and these guys dont look like they give a eff. plenty of better places around, INCLUDING the other GORDOS 3-4 blocks away from this location.", "author": "Jason C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-02-27", "description": "I use to like this place a lot. Went there last night and to my surprise did not enjoy it. \n\nThe food for starters was off, doesn't have the same taste as before. It lacked flavor. Also they only offer one type of hot sauce which was bland. \n\nAlso the service was not nice. Everyone working there seemed depressed, quiet and apathetic. Not one smile, or a thank you for coming or how are you. I having experience in the restaurant industry can tell you that saying those things makes a huge difference. The cashier was kinda rude too.\n\nBut overall, the food was poor, not what it use to be. It's probably missing something.", "author": "Serge C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-15", "description": "I love the carnitas quesadilla, but if you're hungry, go for a burrito.\nGreat, friendly staff!", "author": "Evan W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-09-30", "description": "Had the carnitas quesadilla with guacamole and sour cream. Overall pretty good and filling, just dont think it matches up to anywhere in the mission or even Papolotes. Would come back and try other options.", "author": "Josue V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-16", "description": "A must go to spot in San Francisco! No need to over spend on food at fishermans wharf or downtown. Just take the 38L and boom! You're here! 100% delicious!", "author": "Javi P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-18", "description": "Gordo Taqueria on Geary blvd between 18 and 19th avenue comes through for me every time. Today, tonight they ran out of tortilla chips and made more... Brought a bag of warm chips to each one of us grubbing on our meals. Very nice of them! Bought my fourth of guacamole to go with them. Beautiful classic Mexican music played in the background tonite and not loud. As usual my chile verde regular burrito made with a spinach tortilla, no sour cream but black beans, white cheese, rice, tomato mixture, guac, lots of jalapeños and picante sauce, and of course chile verde which is made with the other white meat was delicious and warmed me up. Got to watch news and Jeopardy as well! My tummy thanks you guys for my yummy burritos, always.", "author": "Artemis R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-11-10", "description": "Gordo's is just a convenient go to for me if I want a burrito that is not from Taco Bell and I can't go out to the Mission for one. I always get the chile verde with spicy salsa, sour cream and jalapenos added inside. I would say that the one on Clement St does not run out of the chile verde as often as the one on Geary.", "author": "Yvonne T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-06-26", "description": "I like this little cheap and simple taqueria when I want to grab a burrito in the Richmond District. You have your options of burritos, super burritos, quesadillas, and combination plates. The prices are reasonable and you can see them making the food right behind the counter. I like when I can see the meat that I'm choosing to eat.\n\nGrilled chicken burrito- juicy chicken and a good mix of all the ingredients (beans, rice, guac, salsa, sour cream, hot sauce)\n\nIt's not the most amazing mexican food I've ever eaten (and I'll never find another burrito place like the one in my home town) but for the price and speed that I get my food I can't complain. The employees could be a little more friendly and have a smile one their face but I always order to go so it doesn't bother me that much. There is a small sitting area with tables you can eat at but I only see 1 person eating at the table each time I go inside.", "author": "Ashley M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-09-02", "description": "I only go for a Carnitas plate.  Customer service runs the gambit depending on when you go.  If you can avoid the rush the insanity is not as bad.\n\nDecor: 2\nFood:4\nService: 2  \n\nWould I go back? You bet your pastrami I would!  Slim pickings in this neighborhood", "author": "Kelson H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-12-20", "description": "I have been eating at gordos for 30+ years.  I have been to all of their locations, I was in line at the Geary street location behind three kids who ordered in Spanish with probably 12 people behind my self, I watched three of the biggest burritos come off their line  watched three or four scoops of beans and rice, delicious stacks of carnitas go on and all the goodness.    I ordered the exact same thing.  Except I barely got a half scoop of rice, a measurably tablespoon scoop of refrained beans, they were almost out and instead of having some ready the gave me that)  barely a noticeable amount of either guac or sour cream,  it was a horrible display of customer service and was probably the smallest \"super\" burrito, I have ever seen.    I have had tacos bigger than that!   And tried to charge me full price,  where are the standards between stores?????   Walked a few blocks to the clement location,  normal good size good carnitas super burrito!", "author": "Nathan K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-10-05", "description": "Not bad but not great. Sour cream and guacamole cost extra and not included in the super burrito which is minus. Burrito is made right in front of your like chipotle which I like because you can make sure it's made correctly. Place is super small so don't expect to be able to eat inside.", "author": "Matthew G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-12-05", "description": "I have been a customer of Gordo's for several years now, and they have yet to disappoint me with the quality of their food. \n\nThe pros:\n--They have kept the good quality of their food consistent\n--Good and quick service\n--The restaurant is always clean and tidy\n--Convenient since I'm only a few blocks away\n--Nice selection of tortillas and good hot sauce\n\nThe cons:\n--They have not changed much over the past 10 or so years--other taquerias in the city have added more things to their menu, or have offered a larger selection\n--They charge extra for single ingredients in addition to the basic--c'mon now, lots of other places consolidate this little hassle into the much loved \"super burrito\"  for a smaller premium\n\nNonetheless, the food here is very good quality, and great for a quick and tasty meal", "author": "Victor R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-10-08", "description": "Gordos is a burrito place like a \"rebound booty call\" after a long term relationship. Not really good, but its there, and it kinda does the job...and later you feel kinda gross.\n\nToo bad mission is too far from the richmond district.", "author": "R S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-16", "description": "I have been going to Gordo's for nearly 20 years...wow, putting that in print makes me feel a bit old all of a sudden. I was away from SF for about 13 of those years, but nothing has changed. Their super burritos are still the best burrito I have ever had. EVER.\n\nI like their boiled chicken with guac and sour cream. My better half recently introduced me to the carnitas and refried beans, which is also fantastic.\n\nEveryone who works here is very nice and extremely friendly. I have never met anyone who hasn't like Gordo's.\n\nIt should be noted that there are differences between the different Gordo locations and many feel that this Geary location is the best.", "author": "Ben B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-01-27", "description": "I go here a LOT, but only because it's close, fast, and convenient.  Nothing special.  The super  burritos are quite large (like, as big as my forearm), but most of the other items on the menu seem like fairly poor value given the number of other (better) burrito places, taco trucks, etc, in this city.   I stop by once a week for lunch, but immediately turn away if there is a line, and find something else to eat.\n\nFood here is 'fine,' not good, not terrible.  My favorite item for value/low cost is a bean and cheese burrito on corn tortilla.  The thing I order most consistently is a carnitas super burrito with a spinach/wheat tortilla.   Portions (particularly how much meat is included) really vary from day to day and by who is making your burrito.  There is a younger guy who always makes me HUGE burritos. Trying to fatten me up, are you? A couple of the older guys are pretty stingy with portions though.\n\nThe guys working here are nice, they seem to remember everything I've ordered in the past.  It's true that when their regular cashier (a woman) is not there, and one of the other guys is working the register, they tend to over charge you.", "author": "Heidi M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-05", "description": "I'm going to say 5 stars for price, 4 stars for variety, and 4.5 stars for the counter people. I love Gordo's, though it's mainly because their burritos are, on average, $2-3 less than most places (at roughly $6 each), and because Gordo's itself is unassuming and relaxed. It's not some trendy chain with two tables and a huge line. I like that.\n\nThe chicken is good (not too spicy, but tender and chunky), the guac isn't spread too thin, and the end result is a big, fat, good burrito. It's totally solid food that anyone can appreciate.\n\nJust remember, Gordo's is nothing fancy. It's a bare bones burrito establishment, and that's what most people like about it - myself included.", "author": "Jiordan C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-09", "description": "They make tasty, flavorful, inexpensive burritos, with great texture and a good and surprisingly light-feeling hot sauce. An easy walk down Geary too, in Outer Richmond.", "author": "Sharon G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-09-18", "description": "Not the best, but not the worst. We tried the burrito, tacos and an enchilada and all were okay but but up to the hype. I would recommend others on Geary!", "author": "Julia S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-11-02", "description": "I would recommend the carnitas quesadilla or the carnitas super burrito.\n-Carnitas quesadilla: You have the option of flour or corn tortilla.  I went with flour.  It comes with cheese, carnitas = very yummy, tomatoes/salsa.  I added guacamole for an extra $0.75.\n-Carnitas super burrito: It comes with your choice of beans, rice, carnitas, salsa.  Extra cost for items such as guacamole, sour cream, cheese etc.\n-Taco were just okay. Wish they had the hard shells instead of the corn tortillas. \nI would not recommend the chips and salsa because the \"mild\" salsa had no flavor.  It tasted just like chopped tomatoes...very plain", "author": "Roxana L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-09-08", "description": "I only go to Gordo's because it's convenient. (I only live a couple blocks away).\n\nThe good:\nDecent food.\nDecent prices.\nSpinach tortilla.\n\nThe bad:\nNo free chips/salsa.......sometimes. Wtf? Sometimes they just give them to me with no charge when I buy one burrito. Sometimes I grab four burritos and I get nothing.\nInconsistent pricing: I usually get the EXACT same thing... and get rung up a different price every time.\nThe service, or the lack thereof.", "author": "Munnie T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-08", "description": "Gordos is the most amazing fresh little taqueria wrapping up huge flavors in some super elastic steamed tortillas dripping wet with mexican love juice! Please do yourself a favor and get the carnitas super burrito, ask for extra yummy green sauce to heat things up, find a place to get drippy, sticky, gooie, then step out the door feeling real raguie... OOOOOEEEEIIII!", "author": "Dustin G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-02-24", "description": "A pale imitation. Residents of and visitors to the Richmond district deserve better burritos than this. \n\nNo salsa bar, either - you have to pay extra for chips and salsa! I never! Though I must say the chips and salsa were pretty good.\n\nThe burrito was a solid meh. Certainly edible, but nowhere near what you can get in the Mission.", "author": "Mike G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-06-07", "description": "TACO BELL HAS BETTER FOOD THAN THIS DUMP!!!\n\nHorrible service, rude staff, downright nasty food, and disgusting dining room. I live in the neighborhood and have tried to go here for years now, but every time I do I swear it will be the last. I went there yesterday, stood in line and waited for my turn, once I'm up I order 1 Carnitas taco, easy order right? You would think so, but the 3 clowns behind the counter (only 1 working) just throw a couple of tortillas on the grill, take the next persons order, then forget all about my order and just keep going. After a while one of them asks me what my order was, I repeat the 1 Carnitas taco, and they all start yelling at each other like it's someone else's fault. Wow, just wow. So then the one guy actually working asks me what I want on my taco, I say just refried beans, and he's like \"What? Nothing else?\", and I say no, so then he dumps a double heaping of refried beans like that's all that I'm going to have, and I say \"You're going to add Carnitas right?\", and he acts like I'm giving him a hard time, for real?\n\nI don't know who the manager is at this dump, but Yo, you should be F'ing Fired!!! I can't believe how rude you losers are, you don't even pay attention to the customers' orders, screw them up constantly, and overcharge for things we don't order like Guacamole and Sour Cream, I don't know how many times I've ordered a regular taco and you charge me for the Supreme, I don't even like those and never order them you jerks!\n\nAnd would it kill you to clean up the garbage off the tables for the next customers? All you do is stand around hiding behind the counter, 3 or 4 of you, but only 1 working, pathetic. The surface of everything is covered in grease and \"Mystery Specks\" of old food no one will ever bother cleaning. I can't believe your Health Score is even in the 80's, that's shocking! LOLZ!\n\nI would give you negative stars if I could, you're a disgrace to Mexico and fine Mexican cuisine, I hope the Health Department shuts you down.", "author": "Grace S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-09-06", "description": "Cashier refused to take two steps to hand me salt when they ran out up front.  He told me, \"If it's not out there we don't have it.\"  I'm like \"It's salt.  Just put some in a ramekin and hand it to me.\"  Hes like \"we don't have any.\"  I'm like you're running a full kitchen.  You have salt.  He refused and denied again.  \"Everything we have is out there.\"  I say, \"Are you refusing to give me salt, that you have, for my meal?\"  He walks off with a huff, fills a ramekin in two seconds with enough salt to choke a horse.  Nice guy.", "author": "Seth C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-14", "description": "Grew up going to this joint on a regular basis, so I'm first and foremost biased. \n\nVery well done, simple burritos. Meats are quality but not show-stopping, same for beans - friends say their refried beans aren't as good but I think they're fine. Super burritos are bigger than their regular counterparts and come with cheese steamed on the tortilla. They charge extra for sour cream and guacamole, but not outrageously so. \n\nJoint is usually empty. If there is a line it goes quickly. Decent amount of seating, no bigger than 2 seater tables though. This place gave me affordable, tasty burritos as a high schooler as well as a quiet environment to talk to friends, and even if I'm not hitting it up day to day I'm always thankful it's still there if I want to stop by.", "author": "Ian S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-10-29", "description": "Had it for the first time yesterday to try it out, got the super buritto with chicken, and I got a say I never had an upset stomach after eating anything before.  Will not go here again, noticed the workers handling food don't wear gloves so not sure how santized this place is but diff not my list to come again from first experience here.", "author": "Nawid A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-05-30", "description": "Paraphrasing: \"Dorothy, we're not in the Mission (or even the Sunset) anymore!\"\n\nSo I found myself deep on Geary, wanting a burrito.  I'd heard good things over the years about Gordo's, so I thought I'd give it a go.\n\nThis is not what I expected at all.  The burritos were only about a dollar less than the ones I get in my neighborhood (the Excelsior, map it, it's in SF), but I guess that's the dollar pays for the flavor.\n\nSliced cheese? I'm not exactly sure that that was sour cream, though I know it sure wasn't crema.  And really? $1.65 for chips (that weren't homemade) and salsa (that tasted like watery tomatos?).\n\nWe had both a carnitas burrito and carne asada, that I couldn't tell the difference.\n\nAt least they had the birds in the restaurant like they do on 24th street.\n\nI used to feel sorry for the people that lived out here because of the weather, now there's something else.", "author": "Michael M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-06-30", "description": "You don't have to be a pretentious Mission hipster or an idiot like Brad K. says to be really, really unimpressed by this Gordo location. Gordo gets 2 stars because I'd eat there if pressed by circumstance but their food is far from A-OK. \n\nTo start positive, I'll join the dissatisfied throngs that will vouch for the carnitas. That is some good pig!  But the beans and guacamole are not bad in that they are not like the Mission (my favorite taquerias aren't in the Mission anyway); they are bad in that they are a lot like Roseville.  \n\nWars about pretention, the Mission, and authenticity v. \"You're an asshole\" aside, everything but the carnitas just tastes boring--including the hot sauce. \n\nThey might earn 3 stars if I only consider the food. But there was also some visible problems with food safety and hygiene. I'm not a germophobe, but please go through the effort of pretending my food is clean...for my apatite's benefit at least. \n\nAnd I also noticed some of the \"unusual business practices\" others wrote about. The \"levels\" of their burritos and tacos aren't explained on the menu. You don't know what regular is and what super is. So their game appears to be offering you things that aren't included without disclosing the extra charge at the time. \n\nAnd with this tactic your first visit will be way more expensive than the low prices on the menu board suggests, and NO ONE wants to haggle over a taco. That's not what tacos are for. \n\nGood carnitas though. I would come in to get some a la carte if I wanted to make enchiladas or something and I was already in the RIchmond.", "author": "Luke M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-04-05", "description": "We have eaten here a couple of times before when we have visited our family. The food has always been great. My concern is cleanliness this time. There was a rag on the counter, next to their cheese. The worker made my super burrito and then right after that took the dirty rag and cleaned the counter and then continued to make the next person's food without washing his hands. The rag was left on the food counter.", "author": "Sabrina M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-16", "description": "Yum. When I went in on Sunday evening this place was packed. \n\nThe guy making my burrito was funny. The service was fast and friendly.\n\nVery Clean Environment. Nice mix of People. \n\nMinus one star for the really uncomfortable chairs.", "author": "Meghan L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-03", "description": "Best super burrito ever, carnitas is tender and juicy, the hot sauce has the best flavor and heat and the beans have been well cooked that they drip with gravy. I go back to SF every few years, and they haven't lost their touch.", "author": "Mickey L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-07-12", "description": "I am not even sure if my review will even count since Gordos is pretty much the most manufactured taco place in existence but here it goes. Usually I would get the spinach super burrito pretty hard to mess up but today I didn't feel like getting much so I tried getting two chicken tacos. The man making them was very lazy about making my taco. He loaded it with too much beans and all the juice literally saturated the entire taco. Instead of draining it off the guy just folded the parchment into the taco. I always believe a person should prepare food exactly how they would want to eat it. I only had four bites of my two tacos everything fell out the bottom. 6$ for four bites. I will not be back.", "author": "Brittany W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-05-20", "description": "I stand by the Gordo chain both here in San Francisco and over in the East Bay.\n\nBut not this location.  NOT this location.  NEVER AGAIN, this location.\n\nSteak should never taste like fish.", "author": "Michael D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-01-07", "description": "The burrito, a regular bean & cheese, no meat, with guacamole, 3 stars in my book, it wasn't that warm, salsa was bland.\n\nThe service, food prep guy was fast and efficient.  Gave a good portion of guacamole.  The Cashier, he is the reason why I give one less star.  I did the calculations in my head before i got to the register:\n\nRegular bean & cheese burrito is $4.05+$0.65 (Guacamole) + $0.40 (8.5% tax) = $5.10.  \n\nThe cashier rings me up $5.53.  I question him if that is right and he CONFIRMS that it is the charge for a regular bean and cheese burrito with guac.  I pays hesitantly and get a table to begin eating.  My friend who has gone to gordos for years does the calculations and finds that the cashier charged me for a meat burrito, which is $4.55.\n\nWe go back up to confront the cashier, who stubbornly argues that the reason why it is $5.53 is due to tax.  I also never knew San Francisco had a %17.65 percent tax on burritos, thank you for educating me Mr. Cashier!  \n\nSo my friend goes up and tells him to enter in the burrito again on the register, and the $4.55 flashes across his register, and we tell him that is wrong a Bean and Cheese burrito is $4.05 which is the price that is listed clearly on the board.  He states again it is due to tax but grudgingly gives me a dollar back.  \n\nTo make things worse, he gives me a snide remark saying how I need the dollar.  I will not come back to this store again. \n\nIf you ever get a regular bean and cheese burrito, watch out, do the math your self and save yourself from getting RIPPED OFF.  To me, it's not about the $0.40 cents, I don't care, it's about the principle.  Stop ripping ppl off.", "author": "Ben S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-10", "description": "super burrito all meat.  cheap, fresh and fast.  NO COMPLAINTS...", "author": "Kevin L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-10-30", "description": "Girl who grew up in the Avenues grew up with Gordo's.  \n\nI remember it clearly.  Fifth grade.  My classmate Stevie Jo mentioned Gordo's being awesome.  She was one of my closest friends, so I was like heck yeah I wanna try this!  \n\nSo I came here one weekend with my dad and sister when I was 10 years old, ordered a chicken burrito, and liked it.  A lot.  I mean, it was a Mission burrito, and I was just a kid who didn't know the names or the hypes; I just knew I liked good food, and this was good.\n\nAnd all the way till my college years, I believed that Gordo's was the best in the City.  \n\nThen, I discovered the Mission.  And man, oh man, was THAT a discovery.  Y'all know what I'm talking about.  \n\nAnd so, it was GOODBYE Gordo, HELLO El Farolito, and Taqueria Cancun, and everything else in between.  Plus, in your early 20s, what's not to like about the Mission?  It's where everyone wants to be, right?  Food, culture, Dolores Park, everything.  \n\nSo, I stayed in the Mission.  Kept eating those Mission burritos.  Lovin' those big, cheap rolls of delicious.  Who cares that it takes me about 45 minutes to get across town to the Mission.  Hella worth it.\n\nAnd then tonight, I was walking past Gordo, revisiting old haunts.  It was around dinnertime, and I was hungry.  \n\nI hadn't had a Gordo burrito in years.  Should I revisit a ghost of my burrito past?  Sure, why not?  Plus, I'd forgotten what they tasted like anyway.\n\nThere was a line forming, since it's that time of night, but I only waited about 5 minutes - not bad!  As I'm standing there in line, I check out the menu.  Hmmm....super burrito vs. normal burrito.  Well, I always order super burritos everywhere I go, but I always leave a bit at the end because those things are just so damn BIG.  Let's go with the normal size.  \n\nAite.  It's my turn, I order a regular burrito with chicken.  The guy takes the tortilla, slaps on a big piece of cheese, and warms it up.  Takes it out after a minute, and slaps on grilled chicken, salsa, beans.  I add cheese and guacamole for an extra dollar or so.  Pretty quick service.  \n\nThe base price is $4.25 for a regular burrito, but since I had some additional stuff, I pay $5.86 and walk outta there.  Open it immediately, take a few bites.  Take another few bites.  And another few bites.  \n\nYou can tell how this is gonna turn out.  ;)\n\nI get home, finish off the rest while watching some baseball.  The burrito was expertly wrapped - no mess at the end or fork needed to pick up pieces that have fallen out.  I dig that.\n\nAnd the verdict?\n\nIt was delicious.  \n\nWell, Gordo, I just gotta say it's good to be back in the hood.  \n\nThanks for representing.  \n\nI'll represent too. :)\n\n*Minus one star because they charge for chips and because of the charges for the extra fillings which should come standard.", "author": "Vivian C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-01-13", "description": "Been going here since I was a kid--mainly because it's the only option in the Richmond for a burrito. When you're paying for your order, make sure you watch the register carefully. Last time I went, he charged me for sour cream & guac that I did not order (I quickly saw the little register mark the price of my burrito and then $.45 and $.65) From reading other reviews, it looks like I'm not the only person this has happened to. Will no longer be going here. If you want quality and honesty, go to the mission for that burrito instead.", "author": "Miya Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-01-11", "description": "The service was slow (only one guy taking orders, even though the other station was open and the line was almost to the door). They were also out of salsa for the chips, and the cashier didn't really seem to give a shit. The carnitas super burrito was good, but with all the other stuff + lack of parking, it's not really worth it.\n\nOne thing to note, there was an employee cleaning the kitchen and looked like he was doing a really thorough job. Loved seeing that.", "author": "eric c."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-10-29", "description": "This is a really simple place. Burritos, tacos, quesadillas. These are not the American kind- there are no veggies here. This is meat, rice, beans, cheese and salsa. You watch then make your dish in front of you from the ingredients you can select, $6 for a burrito. $2.75 for a taco. They taste good but very simple. Their credit card machine stops working sometimes so make sure you have cash. I suggest getting it to go bc the seating isn't the prettiest place to be. Good for a quick bite.", "author": "Viktoriya Z."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-12-08", "description": "I can't believe I waited in line almost 15 minutes for this mediocrity.  \n\nGranted, being a vegetarian I'm all about the Super Vegetarian burrito wherever I go.  For many tacquerias its an afterthought, basically a regular burrito without the meat.  And that's fine.  But if you're going make a burrito with everything but the meat then those ingredients better be damn good.  Sadly at Gordo they are not.\n\nThe salsa (actually pico de gallo) was completely flavorless, made of underripe tomatoes and lazily cut giant chunks of onion.  The bland rice made up about 50% of the filling--as did everyone elses burrito I watched being made--indicating this place has an agenda to keep their costs down.   The beans were forgettable and there was inadequate cheese to hold the whole thing together.   Guacamole was so-so, but the sour cream was so thick it curdled into chunks quickly.  And no lettuce available?  Come on. Insult to injury, the roll up was badly done and the entire burrito fell apart after two bites.\n\nI really feel that the only reason there is any line in this restaurant is because its the only tacqueria in the area, so they are popular by merely existing.  Sadly that doesn't cut it in this city.", "author": "SFnativeGal .."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-08-27", "description": "Ive always heard great things about this place, but i have to say tha I was disappointed. The taste wasnt great, service was not good, they barely undestand what we said, and when my boyfriend asked half of the beans they are used to put in the burrito, the guy put half of the burrito with rice and the other half with beans...that was terrible. \nSo, try to be as CLEAR as you can, and if that doesnt work, speak spanish!", "author": "Danielle S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-29", "description": "I always get the chicken burrito. It is so filling and I love it.\n\nREALLY wish they sold carne asada fries though. My life would be complete.", "author": "Justine O."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-09-24", "description": "I got a chicken and a steak taco here. Though it seems like orders are really a loose suggestion here as the guy put whatever he felt like on it. The man making my food was rude and hard to understand (not a language barrier - he was just mumbling the whole time as the line grew behind me).\n\nThe salsa and everything else was pretty flavorless and bland. \n\nWith so many tasty hole in the wall taco joints in SF, I'll pass on this one next time.", "author": "Christina K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-09-22", "description": "Bad news burrito! This is visit #2, after the first bland tasting experience I decided to pick up a quick lunch the other day. 2 hours after finishing carnitas burritos my boss and I are both bent over in pain. This continued until the next day. To say the least, don't risk it, they don't even taste that good and I would have paid double for a burrito without the bacteria!", "author": "Kyle S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-07-05", "description": "The pendejos who work there must hate their jobs. They are straight up rude, slow and @holes.\nLast time I went there, I ordered a beef burrito. The guy started making something, what it seemed to be a burrito, and added cheese on, but I never requested cheese, so I told him. The @hole acted like if I was dumb or something and said \"have you ordered a quesadilla?\" Well, no @hole, but you are attending me right now, so I assumed you were making my F-ing burrito.\nAfter he was finally done with someone else's food, he asked me for the 10th time - I guess they are also deaf as well-, what I wanted. I replied \"beef burrito with everything\". \nThe guy at the register is rude as well and doesn't even say a thing, just ring the food up and get my money.\n\nOnce I arrived home, my burrito was rice and beans ONLY. WTF???? Was that guy messing with me? I went back there, obviously pissed and requested a new burrito. I just threw the burrito on their trash can and the same guy who did my burrito told me I was supposed to tell him exactly what I wanted on my burrito. Well, pendejo, I told you before and I am telling you again, I want a F-ing BEEF BURRITO WITH EVERYTHING! Is it too hard to understand? Do you want me to draw for you? Should I make a diagram? Should I spell? WTF?!?!?!\n\nThey had the audacity to charge me the difference for the beef burrito.\nThey never apologized. They never threw in something extra, such as chips and salsa to make up for the inconvenience of making me going back there at night, on a cold and raining day (this is back in February).\n\nBtw, their burrito is WEAK! Dude, I lived in SoCal, and I am telling you, burritos there, even in the weakest place is way better than Gordo's. Plus you ALWAYS ALWAYS get free chips and salsa. Those mfuckers need to learn something with the real Mexican taquerias in SoCal.\n\n\nAnd yes, they do talk hell of crap about their customers. They are lucky they get any business, I wish S.F. was floating with Taquerias as it is in SoCal, they would go out of business real fast.", "author": "alice a."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-11-28", "description": "This place is really not that good. The prices are great, but the food isn't. My boyfriend and I ordered a cheese and chicken quesadilla, a super burrito with steak, and a bean and rice burrito. \n\nThe bean and rice burrito and the chips and salsa were the only things that were okay and that we were able to finish. The meat and beans in the other burrito tasted weird and off, and something told me I should stop eating it. The chicken in the quesadilla also tasted weird and was very, very, very, dry. Not to mention there was a pound of chicken and no exaggeration one small slice of cheese on the quesadilla. \n\nThe service was also atrocious. I felt rushed by the guy who was making the burrito and the restaurant was empty. The girl who cashed me out seemed annoyed that we had placed an order", "author": "Adrian S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-10-09", "description": "Little off today, I stopped by on my to get massage and ordered the regular plate but it was so small portion and messy. The place is a bit dirty too today. What happened Gordo???", "author": "Ty N."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-09-21", "description": "I usually check to see who's working before going in since some of the workers really skimp.  Portions might not be consistent, but the flavoring is.  Make sure to ask for extra hot sauce on the side!  Makes everything taste even better!", "author": "Tina L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-30", "description": "Real good burritos. Don't be afraid of the line as it is most definitely worth the wait. Yes the wait times can get to the novice hunger affected burrito craving individual but every burrito master knows these burritos are on point!", "author": "William H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-09-02", "description": "Haha.. You guys wrap burritos all day and it falls apart when i start unwrapping the foil.   I ate my burrito with a folk and spoon. Wrapping a burrito is not rocket science.  Wrap it with like its for you.", "author": "E T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-05-20", "description": "This place sucks........ Why u ask..... \nCause they have the oldest person making the food... And he only takes one order at a time......while mr cool stands by the register and just stare while people line up........ \nI ask for two tacos... Not to hard....... Btw they was kinda gross....\nDude at da register didn't even break a smile....\nDidn't even try to up sale.....\nDidn't say thank you...... \nMan wha kind of customer services is this... Crappy....", "author": "jeannette L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-04-30", "description": "These burritos suck. The only reason I would get them is because they are so cheap. But the super burrito is weak. \nDudes are hella rude here too. Its a burrito shop so I shouldn't expect anything but it seems like they hate their jobs. \n\nAnyways, I barely got any carnitas in my burrito. Its 80% rice and beans. Half scoops of guac, sour cream and salsa. The burrito basically tasted like beans and rice and tortilla.\n\nSpend a couple more dollars and go to any other burrito shop. This place is terrible.", "author": "Aron L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-06-26", "description": "After eating my last burrito at Taqueria El Sol it was time for me once again to explore another burrito joint and so I did... I went over to Geary street and went to try Gordo Taqueria for the first time just to try their super burritos \n\n\nThis place wasnt that bad at all and it was a little crowded in the begining during the lunch time hour at Gordo Taqueria ... When, I got inside I didnt have to worry that much because the line went really fast after when I ate up the entire steak burrito... Gordo Taqueria for me makes the super burritos really good!!!", "author": "William B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-03", "description": "Fast service, you choose what they add, not the best burrito I've had but it is up there in my top 5. Enjoy.", "author": "Samuel M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-07-27", "description": "Service sucks and if the service sucks the food don't taste right.  \nThe Clement location is better!", "author": "Sherrell D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-05-19", "description": "Gordo's is my favorite burrito place in the city. I've eaten at all of their locations (Clement, 9th Ave., Berkeley), and have always gotten great service and tasty burritos.\n\nThe menu is simple, with speedy counter service. I like being able to watch them make my burrito (it makes sure that no offending onions or cilantro sneak their way in). Also, when ordering at the counter it's apparent that the staff cares a lot about cleanliness, always wiping down counters and cleaning the grill.\n\nThere are a few tables to eat at around the restaurant (with the same funky, woven-seats with no backs they've had since before I was born), but I prefer to get my burrito to go and eat in Golden Gate park or at the beach. Make sure you grab enough napkins!\n\nFor the last 15+ years I've ordered the Carnitas Super Burrito, always with cheese, whole pinto beans, rice, and sour cream. The carnitas is moist and flavorful, and I love the simplicity of these burritos. The quesadillas are a big hit, too. And the sodas are really cheap.", "author": "Umilia M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-01-11", "description": "Good lord, why did I subject myself to this place?! I knew what to expect but I guess I must've been pretty damn hungry and impatient yesterday.\n\nIt doesn't help that there aren't too many viable eating options for a quick lunch in the area.\n\nStill, this place is \"meh\" on its very best day. No option for refried beans? WTF? No legitimate taqueria eschews the refried beans. The ingredients are incredibly flavorless - it boggles the mind. You see all the ingredients in the burrito but everything becomes an amalgam of \"blah\".\n\nAnd they fail to list that the guacamole and sour cream are extra with the super burrito option. Don't most super burritos come with the extras?\n\nI have no idea why this is even a chain in the Bay Area? Sorry, but it goes to show you that folks in the Bay Area wouldn't know what a good burrito was even if they were slapped in the face with it.", "author": "Art O."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-01-02", "description": "TAKE HOME: GO TO THE ONE ON CLEMENT INSTEAD.  They are nice and accommodating, as opposed to the arrogant pricks at this location.  As another reviewer put it, \"There is a palpable air of 'stupid gringos' going on behind the counter.\"  But it's even worse than that.\n\nBACKGROUND: This place is known as being the only affordable restaurant in the Richmond.  I'm not talking, \"Oh, $9+tax is a great price for Pad Thai!\" kind of affordable, I'm talking, \"I can afford to eat out at these prices about once a day.\"\n\nTHE POINT: We bring in our own containers, so we don't contribute to their insanely wasteful paper, aluminum, fake-compostable-really-plastic container frenzy.\n\nEvery time we go in, we get major attitude and rolling eyes from the muscle-memory-only food assemblers there.  Today the mid-twenties guy with his cutesy beard literally looked at me and shook his head.  \n\nNOTE to the small-minded: If you don't approve of something someone does that fits outside the one-square-inch box in your tiny head, either think it through or shut the hell up and accept the glory of knowing you have another customer who made the poor decision to keep you alive another day, and save you money on your expensive wrapping.  Assume that maybe someone's doing something different for a reason, and think for three seconds about the consequences of adding up even one hour's worth of the wasteful containers and pissy attitude you dole out.  \n\nI dislike them.", "author": "Auspicious T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-07-12", "description": "Somehow I seem to follow Gordo's wherever I find apartments. I used to live by the one in the inner richmond, then we moved to a place 2 blocks from it in the outer richmond. Now that i have a find a new place I'm scared I'll go through withdrawals unless i move to the sunset by the 9th ave one...\n\nGrumpy middle-aged mexican men are running this joint but hey, nobody comes here for the service. We come here for a cheap and tasty burrito that happens to be a 5 minute walk from our place of residence. I've asked for a burrito with the spinach tortilla and received a death glare like i've just requested to take his right kidney, I've ordered avocado and not received any, and I've ordered a quesadilla with a spinach tortilla and received a burrito with a regular tortilla. Hahahah but you just dont argue with the Gordo Guys. They run the joint. And they know that when we are craving mexican food and are too lazy to head to the mission, where will we go? Down the street to Gordos of course :)", "author": "An-Nhien L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-03-03", "description": "Anybody who thinks this is a good taqueria hasn't been to any taqueria in the Mission District.  Seriously.  \n\nI like Gordo's.. don't get me wrong.  It's relatively cheap, quick \"service\", not bad for fast food.\n\nOne reason why it's not as good as Mission taqueria's?  Order a \"veggie\" burrito from Gordo's.  What do you get?  Rice and beans unless you add cheese, guac, sour cream, salsa.  Give me some F'ing veggies.. carrots, corn, lettuce anything.  They don't offer actual vegetables other than whatever beans you order and that to me isn't a worthwhile veggie burrito.  \n\nGo to a Mission taqueria and order a veggie burrito and its full of all of the above and it tastes SOOOOOOO much better. \n\nI go to Gordo's because I live down the road but I always crave a better taqueria...", "author": "Phil S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-06-24", "description": "I enjoy Gordos cheap, fast, bland food. I'll be back", "author": "Andrew V."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-02-28", "description": "First of all I am graciously giving 1 star because there is no option for a BIG FAT 0!!!  This brand used to be good, growing up in SF I used to go to the location on 9th Avenue.  Now that I live in the Richmond district I have been going to the Geary Street and Clement street locations and lets just say will not be anymore unless all the other burrito places in SF close.  I ordered a regular burrito which was like a \"baby Burrito\" of which I had to ask for more meat.  This burrito was $6 plus some change.  Then I ordered a super burrito and again had to ask for more meat.  After they put beans, meat and cheese they asked what else I wanted on the burrito and I said everything that comes with the super.  Usually a super burrito means that you have sour cream, guac, cheese, salsa, hot sauce. Here you have to order everything extra.  When it was all said and done the super burrito was only a dollar more than my regular burrito.  As I was paying I noticed the people right behind me had a huge burrito and asked the cashier what kind of burrito that was they told me a super.  I then had him look at the difference between the super burrito they made me and the burrito they were currently making and how much bigger it was.  He then told me that's because you have to ask to make it bigger.  WHAT?? INCONSISTENT ALL THE WAY AROUND.  My suggestion: go to Street Taco and El Faro on Haight street.  Way better food for the price.", "author": "Merrell D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-02-20", "description": "\"Meh. I've experienced better\" is a good way to describe this business.  For the price, the food is good but for the customer service and quality of the food, you might as well skip this place.  I mean if I have to feel shameful in making someone prepare my food, something is wrong.  \nI never felt welcome entering this location, more of a melancholy atmosphere.", "author": "Jesse C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-22", "description": "Went to Gordo's again as it's my number #1 burrito place in the city.  I opted for a whole wheat tortilla, cheese, pinto, grilled chicken, tomatoes, jalapenos and extra hot sauce.  The hot sauce has great flavor but isn't overly spicy.  I've frequented Gordo's many times over the past few years and believe the grilled chicken and carnitas are by far the best meats.  Overall if you are looking for an authentic Mexican burrito, with high quality ingredients, Gordo's is your spot!", "author": "Stephanie B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-01", "description": "Awesome and delicious. Get the supreme burrito. I had chicken always good. The guys that work there are amazing too", "author": "Madie H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-04", "description": "Quesadilla:\nTortilla - light and crispy\nCheese - not overloaded\n\nSide of Guacamole - no tomatoes,still very tasty\n\nOverall, light and filling.\n\nIf you and a pal need a light lunch with lotsa flavor, I recommend Gordo's quesadillas!", "author": "Em L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-01-31", "description": "I really want to give this place more stars, but I can't. At most, it probably only deserves 2.5.\n First off, the meats here are pretty darned salty (I've had both the carnitas and beef here) !! For the prices that they charge, I can't believe that burritos nor quesadillas come with chips and salsa (they have them, but extra charge for them,along with everything else like sour cream and guac)!\n\nSecondly, the workers mumble here. I'm sorry if I don't know what goes into a taco or quesadilla because some places are different, but mumbling sure doesn't help. I didn't want the darned sour cream (i thought he said salsa) and still had to pay extra for it!\n\nI think the only things worth eating here are the corn quesadillas or tacos.\nThe corn quesadillas are worth checking out, though they aren't your normal ones! I consider them more like tacos. They melt a slice of cheese into it, and the tortillas are toasted crispy. Do try, it's different. \n\nHowever, stay away from the flour tortilla ones. The tortilla's not as crunchy and when wrapped in foil, got soggy and tasted disappointing.\nThe only reason I keep coming back is that it's close by work and easy enough to grab some quickly to go. \n\nYou can def get better tasting and more value elsewhere.", "author": "Ly T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-18", "description": "Great quality for great value!\n\nThe burrito is a pretty decent size and the ingredients are fresh. The salsa and guacamole = yum! This is the equivalent to an authentic chipotle. The set up is the same. You get in line, tell them what you want, and then pick your fillings. I prefer cheese and bean, but chicken is ok too.\n\nSuper burrito with everything but beans! Add hot sauce and jalapenos. Es muy bueno :-)", "author": "Stine H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-01-06", "description": "This review is not about the food. We all know what you get here. It's OK. It's not expensive. It's convenient. BUT GORDO GUY, WHY ARE  YOU SO MISERABLE? It's like you suck the life out of everyone in there. You are rude, you are stupid, you are lazy and you talk shit about the customers. HELLO, it's not like we can't understand you. You F#$ up the order and then keep it to eat! To the owners of GORDO...get rid of the GORDO GUY at the GEARY location. He is a kill joy for customers and the entire staff.\n\nThe Clement street workers are faster, smarter, friendlier and charge the same amount, for the same exact thing, every time! \n\nI know this may seem harsh, but it's year after year after YEAR and we all know it, so WHY?", "author": "C. S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-04-18", "description": "Good burritos, but literally every time I go to Gordos they mess up my order.", "author": "Dan S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-28", "description": "Gordo Taqueria, you are thee ISH!  \n\nAlthough you make me feel gordo, you make my taste buds and tummy happy.  I will gladly run several miles just so I can engorge in your super burritos afterward.\n\nBased on reviews, I was wary of them skimping out on meat and filling the burrito with more rice and beans.  However, this was not the case.  My super burrito got a hefty portion of meat and equal amount of rice, beans, and accompaniments.\n\nCarnitas= BOMB.  So delicious, flavorful, tender.  \n\nGrilled chicken= Delicioso as well.\n\nI did ask for their \"spicy\" salsa/sauce but could barely taste it.  If you need a spicy kick, you probably will have to ask for extra.\n\nThe guacamole is super creamy and fresh!!  \n\nService was ok.  This is a cheap, no-frills place.  Get in line, order your food, pay, and eat.  Simple and good!!", "author": "Abby D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-13", "description": "Best burritos in SF. Fast service. \n\nSimple menu. Everything is awesome. \n\nInexpensive.", "author": "Ohhh Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-05", "description": "Better than expected. Chipotle style flow with more authentic ingredients. The dining room itself is nothing special hence the four stars but if you want a really good burrito Gordos is great.", "author": "Ron G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-11", "description": "I usually get my burrito to go.  The staff is super friendly and their carnitas is the bomb!", "author": "Nicole W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-07-17", "description": "Pretty good vegetarian burritos. However, the guys that work there are always rude and act like they are doing you a favor when serving you. Whoever manages this place should become aware of this terrible dynamic because it most definitely hurts their business.  I avoid going there just because of the rude reception.", "author": "Patufla P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-02-02", "description": "Gordo is my favorite taqueria in SF!\n\nVery good burritos, but I started ordering a corn quesadilla instead (for portion control). You can still load it up with rice, beans, etc... but it's a smaller meal over all, and under $4.\n\nDelicious carnitas! Their chips + guacamole make a great snack.\n\nGeary location: The older guy with glasses and mostly gray hair, usually wearing a hat, is super stingy with ingredients. Don't let him get away with it.", "author": "Wendy M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-10-12", "description": "In terms of Mexican restaurants, this place is the equivalent of a dive bar, which isn't necessarily a bad thing. The food is filling and copious, the prices are low and the guys making your food are surly. Contrast that with a dive bar where the pours are large, cheap and the bartenders are surly. Both are there when you really need to get your fix. \n\nGet my metaphor? I don't really care if you do.", "author": "Casey U."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-05", "description": "I decided to explore out to the outer Richmond for good Mexican food after giving up on ever finding good Mexican food near Laurel Heights. Boy do I not regret coming here....\n\nI got a Carnitas burrito and it was DELICIOUS! The carnitas was made to perfection with excellent flavor. The burritos are also very reasonably priced. I like that I do not have to order a Super Burrito just to get sour cream and cheese to it. You can get the burrito in a regular size or super size if you want more toppings and it doesn't cost much to add on toppings. \n\nI definitely recommend this place to anyone in this area!", "author": "Annie L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-14", "description": "Best carnitas in the City! Service is quick, restrooms are clean and service is great!", "author": "John P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-10", "description": "Ok, if you are hungry and want a lot of good mexican food, eat here.  This must me  a stoners paradise.  I mean seriously, easy to read, everything looks and is delicious.  \n\nI would take it to go because I am not crazy about the vibe, the tables or much about being there at all.  But pick it up to go and have the best take out :) Cheap as well!\n\nI always get the plates because you can pick 2 kinds of meat, great rice, beans, salsa, cheese - whatever, they don't mind.  Then you need to get corn quesadillas with some meat and open them up and put different things from the plate in these perfect tortillas.  I mean what more could you ask for?", "author": "Alexis B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-07-14", "description": "This place is pretty good. It's not like your typical burrito from the mission. Gordos is a bit more clean tasting. Meaning... Not greasy and a sloppy mess. One key thing that stands out is they don't water down their guacamole and sour cream. I hate restaurants that do that. Come on... Don't be cheap.\n\nI always get the flour quesadilla. With boiled chicken, rice, guac, sc, salsa, and jalapenos. It's basically a burrito but crispy! That's the little secret. Whenever I come back from Asia this is my first stop to get my Mexican fix. This is definitely one of my fav. quick eateries. I highly recommend this place.\n\n1 bad thing.... PLEASE DO SOMETHING ABOUT THOSE FLIES!!!", "author": "Karen L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-10-08", "description": "Someone told me this was the best burrito in the city. If that's true, this California city with a spanish name is severely lacking in quality mexi food. This was just plain weak. Asked for guac, got no guac. Loaded with bland and tasteless rice and beans, which is just filler. The chicken itself was ok, but not enough to redeem this thing. The hot sauce? Ok. The pico? Bland - like old tomatoes and barely any cilantro. Why can't I find a decent freaking burrito in this town that costs less than $8?\n\nMaybe I was spoiled growing up in LA and living in San Diego for 3 years before moving here, but so far I've been pretty disappointed. Sure, Papalote is good, but I wouldn't call it authentic (and who the f@*k charges 50 cents for a tiny extra dollop of salsa anyway?)\n\nWhere's my real burrito?!?", "author": "Josh G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-06-17", "description": "I've been eating burrito's here since, oh before you were born.  Back in my day we didn't carry around cell phones.  We had to use these things called \"pay phones\".  Cell phones were only good for two things, melting your head and bringing down aircraft and they cost over $1,000.00.  That would be $1,000,000.00 modern dollars.  And we liked it!\n\nOne thing I've noticed about this Gordo Taqueria is that it has been consistent over the years.  They consistently don't put enough salt in their salsa or their meat.  They consistently have a mild to moderate air of unfriendliness... okay, there have been a few times they were friendly.  They also make tasty burritos and very tasty quesadillas.  I have yet to find a place that services the outer Richmond with this calibre of mexican food.  Just remember to grab some salt packets and napkins on your way out the door.\n\nI am torn between this being A-OK and being a fan, but to balance the digital cosmic forces I will rate this A-OK.", "author": "Theron L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-17", "description": "Oh Gordos, how I miss you. I first started going to the Clement location while I was in grade school. Since then, I haven't really been back, but I still remember the burritos and quesadillas, so I dropped by here over the weekend, so I could get a cheap lunch. I got the chicken quesadilla, so, nothing fancy. The food is exactly how I remember, and the prices really haven't changed too much either. I paid a little bit under $5. Fantastic.\n\nOh, service was a little slow here though, not sure if I just came on an off day, but the guys behind the counter seemed to be more interested in talking then in serving...", "author": "Steph G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-05-03", "description": "Whaaaa Mon!?!?!?  Fi Real!?!?!?  No flavor whatsoever!!!   Carnitas = Bland, Super Burritos = Weak sauce Batty buoy Babylon Dem!!!\n\nSpend fi hard earned money elsewhere, like maybe an actual authentic Mexi spot, i.e. El Burrito Express, Los Coyotes, Taqueria Cancun, Ocean Taqueria, and on and on.\n\nBun deh Gordo Heathens Dem Babylon Shitsyem!!!  FYAH BUN!!!", "author": "Ubique K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-27", "description": "I'm here at least 3-4 times a week. I just, I can't...it's so good. Fresh, tasty, friendly.....all those good words that drive my point home. In a perfect world, I's eat one of their chicken quesadillas (corn tortilla, sour cream, and hot sauce) for every meal.", "author": "Liz A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-05-22", "description": "My favorite burrito joint of all time. I always get the grilled chicken burrito with tons of guac, sour cream, salsa, and hot sauce in a spinach wrap. All in this perfect blend gives the most satisfying and delicious bite. \n\nI don't understand why people aren't crazy about this place, but really I don't care. This will be and always will be the #1 place I come to for a delicious juicy burrito.", "author": "Denise W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-09-21", "description": "I had it with Gordo's. I can't believe they just made me register on Yelp... \n\nThe food tastes ok, but pros end there. Parking is really bad in that area, but my much larger beef with them is that the place is dirty - they have a procedure where food prep person sometimes hands your burrito to the cashier who then rolls it in the foil with his dirty, money handling hands. \n\nNow, I was aware of that so I asked the food preparer to wrap the burrito himself, unfortunately seems that English is a hard language to understand and the cashier ended up wrapping my burrito.\n\nI won't be going back. Wish that Yelp allowed 0 rating or even better a negative one...\nOh well.", "author": "Mike M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-03-22", "description": "There are people who love Gordo Taqueria, and there are people who absolutely hate Gordo Taqueria.\n\nBeing a true southern California girl, I must say that this \"Mexican food\" really sucks.  The guacamole is blah and bland, the chips, tortillas and taco shells were really greasy and oily for some reason (like OVERLY greasy, and it was leaking through the foil - YUCK), and nothing in my tacos or burritos have ever resembled anything tasty.  Put them all together, and you get one crap-tastic waste of money.  YESSSS.\n\nThank you, but I would rather drive down to San Diego or Los Angeles for some real Mexican food.  Road trip!", "author": "Tori S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-08-21", "description": "I have never had a complaint about the service.  Even with a long line, it moves fast.  I know people say you can get cheaper and more authentic burritos in the Mission, but I'm not Mexican.  I'm Irish, and to me, these taste pretty great.  \n\nI also like that, unlike some places in the Mission, it's super clean.  And I can get it however I want.  I usually don't like beans or rice on my burritos (I know that's weird) and I request extra cheese and extra pico.  And they never make me feel like that's the wrong way to order a burrito, even though it totally is.\n\nFinally, all the haters who say they'd rather go to the Mission, when I'm hungover on a Sunday, the last thing I want to do is take an hour long bus ride just to get a burrito.", "author": "Theresa H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-07-10", "description": "For what it is and more importantly where it is, it's not that bad.\n\nPros:\ncheap\n+ Fountain Soda\n+ decent sized seating area\n+ 5 blocks from my house\n+ 2 kinds of beans\n+ 2 kinds of chicken\n+ huge burritos\n+ the \"quesadillas\" (which are actually more like tacos, but ok, Gordo, we'll let you have your fun and call them \"quesadillas\"\n\nCons:\n- disgusting pidgeon that roamed the dining area\n- NO HOT SAUCE options (wtf?!)\n- less than enthusiastic service\n- the whole \"quesadilla\" thing.  I know, I know, I said I'd let you have your fun.  But I lied! There will be no fun!  You can't just go around calling something a quesadilla when it's clearly a taco!\n\nI am actually really suprised that I didn't hate it here.  Granted, I like my burritos a little on the simple side, and I am a fan of green sauce so the fact that there is no red sauce was only a minor flaw in my eyes.  I feel like if Gordo added a selection of hot sauces, or at least some Tapatio for cryin' out loud, it could really take it to the next level.\n\nAnd they should shoo any pidgeons that enter the place.  There should be a strict shoo-ing policy in place.  Because pidgeons are, well...gross.", "author": "Courtney N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-02", "description": "Best burrito north of Los Angeles, fast service too", "author": "Luis C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-10-19", "description": "I was out visiting a friend and it was lunch time so we headed to Gordo's.\n\nThe food is relatively cheap and they prepare it right in front of you with your choice of fixings. The protions are pretty large as well. I got a carne asada burrito and it tasted pretty good overall.\n\nIf you're gonna be picky then head elsewhere, but this is your only choice for a burrito in this neighborhood. Nuff' said.", "author": "Gary T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-10-27", "description": "Standard Mexican fare. Good decent size portions no matter what you order. Service is slow and unpredictable. I am in a line with 10 people and no one is in a hurry. \n\nI do come here a lot and I do like their guacamole and chile verde. Something cheap, quick (sometimes) and filling.", "author": "Lingo L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-25", "description": "After 20 years, Jay (The Prince) and Mike (Cold Money) got together for a burrito. I haven't seen Jay since High School when burritos were a 3x a week habit (La cumbre made a lot of money off of us). I frequent Gordo's on Clement, 9th Ave, and Geary. and the food is consistent all the way around. Carnitas, Chile Verde, and Carne Asada! All good!\n\nThe food was great, the conversation hasn't changed in 20 years...and we finally caught up. We turned out alright.", "author": "Michael G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-08-06", "description": "Dudes, c'mon.  First strike, no tap anywhere on the tables.  Second, the lazy burrito technique.  It's filled with apathy and despair.  Those two ingredients make a lazy burrito.  Third,...hmm, third...well I just don't like it.\n\nIf you like uninspired burritos, go here.  Plus it takes forever to get a meal in your mouth.  That's a better \"third strike\" right there.", "author": "Pouria Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-13", "description": "The past 8 hours have been filled w/ The Beatles; be it Rock Band on the PS2 or actually learning to play the songs on guitar. \n\nBut it's time to eat. We need something easy/substantive so we make our way to Gordo Taqueria. I have never eaten here before and I'm skeptical about Mexican all the way out in the suburbs, but I'm told the place is good. The staple for me in terms of meat is carnitas so I must try that the first time here. \n\nI order the burrito and I'm given pinto beans as I wasn't even asked what kind of beans I want....hmmmm *skepticism rises*. I pay and it comes to $7 and some change. \n\nThe burrito itself was HUGE. The first thing I noticed was the freshness of the guac. You could taste the sweet buttery chunks of avocado. Yum! Carnitas was good too, it has not been sitting on a steam table that long. In the end, I would come back, definitely if I'm in the area. So fitting to find a good Mexican place all the way Across The Universe.", "author": "Angelo F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-30", "description": "3.5 stars for Gordos?? No. FIVE, thank you very much!\n\nFAVORITE burrito place, hands down. My one friend called their burritos \"dry\", but definitely not! I always get the Super Chicken Burrito with everything (minus beans and spicy sauce) and ah, heaven! Me and my friends come here ALL the time. Whenever we can't decide on food, I'm always down for Gordos! \n\nCheap food, super close to home, always serving fast ... what more can I say? I love Gordos! The one on Clement St. is good too, but this is definitely my favorite (:", "author": "Chrisy Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-28", "description": "Gordo Taqueria has the best burritos in the Richmond neighborhood! When I need a Mexican food fix, I can't go anywhere else but to Gordo. \n\nI always get the quesadilla or the crispy tacos. If you get the crispy tacos, get two because one won't fill you up. Surprisngly, I haven't tried their burritos yet. The quesadillas are cheaper, yet just as BIG and filling. They stuff their quesadillas with your choice of meat and just about anything else that can go in a burrito! Plus, I like quesadillas more since they are grilled. The quacamole dip is also very good - fresh and rich! \n\nAlthough the food is worthy of five-stars, the service is alright. They're a little rude sometimes and pricky. I recommend taking your order home or go to the Gordo Taqueria on Clement - they are more cheery and friendly!", "author": "Linda T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-09-22", "description": "I've lived in sf for nearly two years. There's two Gordo locations, I tried this one twice. I'm officially unimpressed. Since when do you have a super version of a burrito and you pay extra for guacamole??! It was a vegetarian burrito!!? Born and raised in San Mateo, lived there till 18.  I KNOW what good taquerias consist of and by far, I've not a clue why this place can find the balls to charge extra like they do for SUPER.  Never have I seen such a thing and I was thoroughly annoyed especially when it's SF and there are hundreds of options.  There's nothing special about this place and they have VERY limited options all around.  Won't return.", "author": "Maddy B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-05-15", "description": "We've been going to the Gordo's on Clement street since we were kids! We'd get Carnitas in a cup!  These days, we go to the one on Geary since it's convenient with parking or on the way home. We've always loved the Carnitas! I like the all meat plate, rice & bean quesadilla, grilled chicken tacos, and the chips with guacamole are pretty good too! For burritos, I always get either the spinach or tomato wrap (regular or super) and it tastes so much better than the regular wrap. Their house salsa is the only thing I don't like, it tastes weird. Their hot sauce, could be hotter.  I always have to tell them to keep putting more so that I can taste 'some' hot!\n\nVery affordable and will fill you up!", "author": "Christina C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-10-28", "description": "Gordo makes good burritos and their trademark is that they steam a whole slice of cheese into your tortilla instead of putting shredded cheese in with the rest of the fixins. Other than that it's your average California taqueria. Prices for burritos are very reasonable but I felt that taco prices were a little high (lowest price was $2.50 or something like that.) I'm used to a taco from a small taqueria being no more than $1.50-$2, and since I usually get a couple, the price adds up. I liked their carne asada a lot at their Berkeley location so I'm hoping to come back to see if it's as good here.", "author": "Josh K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-02-13", "description": "I like going to this place cause it fills me up and it's tasty. I usually get the grilled chicken burrito w/o beans, with extra salsa, guacamole and sour cream. \nQuesidilla is good there, I love how it's crunchy...mmm. I get it with a bit of rice and either grilled chicken or carnitas with the condiments.\nAh it's yummy, my bf gets it this way and he has made my friend who hated burritos into loving it.", "author": "Mandy D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-18", "description": "Their carnitas is fantastic, and they're pretty generous with it. Unlike most taquerias in the city, though, a super burrito just gets you cheese (sliced, rather than shredded, and steamed into the tortilla). Guac and sour cream are extra. The salsa options were a little disappointing, as pico de gallo is the only one you'll get by default. You can also ask for a splash of salsa verde, but the burrito could definitely be spicier.", "author": "Doug T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-03", "description": "This is one of my fav burrito places. The carnitas burrito with refried beans is to die for. The chips and salsa are great also. Only thing is I can't tell the diff between the regular burrito and the super burrito. I would stick to the regular with the extra... Sour cream or guacamole.", "author": "Sean W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-16", "description": "Clean, friendly and good burritos!  One of my favorite burrito spots in SF.  Ignore all the Mission snobs, there can be good burritos in other parts of the city!", "author": "Tim T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-03-03", "description": "Gordo Beef Plate is just what I needed to have a satisfying meal of authentic Mexican food!  \n\nTheir portions was very generous.  The plate consisted a choice of meat,  rice, beans and salsa with 4 corn tortillas.  For extra, I added guacamole and sour cream.  The meal came up to be a little over $6!  This is pretty awesome! \n\nOn a side note, they sell individually packed salsa for $1.25.  Get the spicy one b/c it is so delicious and burns your tongue in a good way! \n\nI am so glad this place is around b/c it is so hard to find decent Mexican food at an affordable/cheap price.", "author": "Deborah C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-03-14", "description": "Decent burrito. Good carne asada.  Definitely have had better burritos.  First time there, but you can tell its authentic.", "author": "Zack G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-12-03", "description": "I go here almost every week - 1. It's convenient 2. Their bean and cheese super burrito with everything is Bomb!  I'm not a fan of their meats as other Taqueria's have better flavor, which is why I go veggie, but I highly recommend the veggie, super burrito! Burrito Mondays!", "author": "Natalia H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-09", "description": "Great food for good price. they are always consistent and fast. go here for a fast meal that taste good", "author": "Jonathan T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-08-15", "description": "Gordo is a good option for people living in the Richmond/Sunset Districts. Their burritos (Carne, chicken, and chili verde) are great. Not much of a dining experience inside but it is a place for pick up. 3 stars is good enough for Gordo although they are usually busy from 5-9pm daily with long lines... People know what they are getting themselves into..", "author": "Spencer R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-09-03", "description": "It is definitely fast-food Mexican.  Not bad/great food (never had a bad experience), very filling and if in a rush a good and convenient spot.  Parking around this location call be near impossible on some days/nights.", "author": "Des D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-12-31", "description": "This is one of my favorite places in the city to get burritos. Everything is fresh and tasty. The hot sauce can be a little inconsistent though. Sometimes it's spicy and other times it's like there is just flavored liquid in my burrito. For the most part, though, it's great.\n\nI live near Japantown, but I still go out of my way to get Gordo's burritos. I'm rating this four stars out of five for the lack of ambiance. Although, it doesn't bug me since I always get my burritos to go. So, come for the food, not the ambiance.", "author": "Kristina C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-04-18", "description": "Never again!!  Why didn't I listen to myself the first time I decided to never eat here agin?  Why can't we have a decent (and yes, that means I can't even classify Gordo's as \"decent\") taqueria in the Outer Richmond?  Who steams tortillas??  And what gives with the whole no lettuce thing?  And howzabout some kick ass salsas to choose from?  I'll make the schlepp to Pancho's henceforward, thank you very much.  No gracias, Gordo.", "author": "Radha K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-09-01", "description": "I went in there to get a large burrito.  After I purchased it  and took it a  bite of it, I discovered the cashier accidentally mixed my order with another customers.  I told the cashier and he grabs the burrito and just throws it hard against the trash can giving me attitude.  He angrily tells me  he will remake it for me and asks me what I want it.  \" I want a super beef burrito with everything on it and no sour cream\".  He states \" I won't give you guacamole\"  I'm looking at him confused and I stated i would like to have  guacamole and no sour cream\"  He then explains there is sour cream mixed in the guacamole.  I'm looking over at the food counter and i see  a big tray of guacamole and next to it another large tray of white sour cream.  I asked him again what that green stuff is.  He said guac.  I then asked him what the white stuff is . He replies with sour cream.  Again , I ask let me have the guacamole.  Then this dummy goes\" NO, it has sour cream inside\" . What then is the point of having seperate containers for the guacamole and sour cream in the first place. Then he goes off saying I have no clue what im talking about. This cashier is a complete idiot.  We argued for 5 minutes  and me trying to convince him to please put the quacomole on the burrito.  Then there was one of the cooks looking on the phone, puts it down, doesnt even wash his hands and proceeds to make burritos for other customers! I will never go back there again!  This place is a health hazard and a rude staff.  I will never come here again.", "author": "Elliott Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-02-16", "description": "I'm a big fan. I've been going here since I was child living in the presidio. The food is wonderful! The chili verde is particularly good and a hidden treasure.", "author": "David G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-08-05", "description": "A satisfactory burrito. I really only eat here for the sake of convenience, as it's just a short walk from my apartment. On my last visit, the middle of my burrito was kind of cold - which means, dear Yelpers, that Samantha S. has learned her lesson: now I rarely venture outside the Mission when I need to satisfy my veggie burrito cravings.\n\nI mean, if you're going to do it, do it right.", "author": "Sam S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-17", "description": "A staple in any budget conscious San Francisian's list of top places to grab a burrito. Mind you the portion size has gone down slightly compared to some years ago. The quality of carnitas and carne asda is worth the mile walk to Gordos. Try their real and authentic Mexican soft drinks with your tacos or burrito. There are few better deals in Mexican food in the whole city. Now I anticipate a line or new and curious vistors to Gordos. Ah well, we all have to share the wealth of little gems sometimes.", "author": "Jim H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-03-30", "description": "this place sucks. this is the only time i have drafted a review whilst still in the restaurant. that's how disappointed i am with gordo, and here is my list of grievances: \n\n1. no chorizo. that's unforgivable. \n2. no lettuce. no lettuce? what the hell. it's so cheap, there's no reason NOT to have lettuce. \n3. only one type of shitty, watery salsa. they have green hot sauce, which isn't bad, but not good for chips and salsa. which brings me to...\n4. shitty, stale, yellow tortilla chips that they probably bought in a bag from Food 4 Less. \n5. none of the meat looked appetizing. i'm not a huge meat eater right now, and nothing they had (since they didn't have chorizo) looked good. \n\nhow does this shitty CHAIN continue to exist in the burrito mecca that is san francisco? blasphemy!", "author": "Shannon C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-04-19", "description": "I hate eating sucky burritos, it's such a waste of time and money. I'd rather drive to south city and go to el farolitos or la tapatia's! And yes, I could go to the Mission for el farolito, but I hate driving in circles for parking.", "author": "Christy V."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-01-20", "description": "Somebody wrote \"best carnitas in town\". They were the most bland carnitas I have ever had. The texture was good, but that was it. I make pork shoulder in my crock pot all the time. One time, I didn't use any spices or rubs, and it tasted like theirs. A lot of carnitas are put under a broiler to crisp up, or reimmersed in ther own natural juices, or both. These were tender, but lacked any other flare after that. Overall the rest of the ingredients in the \"super burrito\" (I think it was called) were middle of the road. Even the guacamole was, meh. The staff were completely uninterested in working. (there was a soccer match playing on their tiny tv that everyone was consumed with watching.). \nIt is close to my house. I'll probably eat it again when I am to lazy to cook. \nMy two star rating reflects this one outing alone. \nThe place was clean and easy to order. \nIt might be better at another outing, but I am not planning on going back any time soon.", "author": "Phillip H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-02-04", "description": "Bland food.. salsa is watered down and the corn and flour tortillas are hard and taste old, the beans dont taste fresh either. Their chicken plates arent that bad though... i guess its not bad for a quick fix... Sucks cuz I love mexican food and this is closest to my house.", "author": "Frank T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-09-17", "description": "This place is Cheap as hell and that is exactly what you get with your food here. I'm not really hatin I'll still come here, but not for taste but because I'm feeling cheap. \nI was a little surprised to see some stuff people said about this place Yelp  is starting to lose some leeway for me when it comes to using it as a decision tool for restaurants. \nAs I was saying before this place is cheap theres no doubt about that. But food wise it doesn't taste bad, just doesn't have much flavor.\nAnother thing, no orchata? Come on that should be a mus. and pay for chips? but again cheap.", "author": "Josh E."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-12-18", "description": "I have gone here multiple times and it is usually pretty good. I ordered the carnitas quesadilla lastnight and woke up with a horrible stomachache and have been puking allll day. I had to leave work. Not sure if it was a bad night for their carnitas or what, but I am not going back there.", "author": "Ashley F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-07-12", "description": "There are two kinds of cheap Mexican places as far as I'm concerned: the kind whose food tastes as bad as it looks, and the kind that has some strange inner quality that manifests itself in the food they produce. I'd have to say, Gordo's fits the latter bill.\n\nIt's not often I have a craving for a burrito, but ever since I was introduced to this place a few weeks ago I've gone back for more. What can I say? Their food is superb, simple, and downright cheap - where else can I get a filling super burrito for $5? Other items, like their quesadillas, Gordo plates, and tacos are just as good and just as cheap.\n\nService is nothing to write home about, but they take your order diligently and efficiently, so you're good to go in no time. I've had a couple of mistakes in my order (salsa when I asked them for none), but it's usually nothing major. The fact that they're open somewhat late is nice when my friends and I head farther out on Geary and need a quick dinner, and despite how small the place is there usually aren't many people there in the evenings.\n\nJust thinking about Gordo's kind of makes me want to go there again for lunch. Mmm... maybe next time.", "author": "Will C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-11-08", "description": "Went here again because we were craving and starving for a mission street burrito. And my last review came alive. They are so skimpy with the meat. I was watching as he scooped the meat a small size and did not dump the whole scoop in my burrito. I wanted to scream on mission they give us at least 2 full scoops of meat in comparison of there scoop. Super burrito and small bag of chips with no salsa =$7.79. I'm done with this place.", "author": "Jeff C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-02-27", "description": "This place is just ok..nothing special.  The food was very bland and the were out of several of the toppings.", "author": "Michael K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-06-08", "description": "Used to go to the Gordo's on College Ave. in Berkeley and would have given it three stars.......but at this location the employees were so rude. They barely addressed me and my friend when we came in, talked to each other the whole time they were taking our orders, looked at us as if we were stupid when we didn't understand their questions to us, and made fun of us in Spanish, thinking we couldn't understand. Minus one star for that!", "author": "Kimberly K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-06-06", "description": "This gordo is not as good as the one on clement.\nordered a carnitas burrito and it was dry as hell, the tortilla was hard.\n\nThey get 2 stars because the sour cream and hot sauce taste like the one on clement\n\nIl be back to the gordo's on clement", "author": "DOM d."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-09-01", "description": "Fast, Cheap & Delicious! \n\nExactly how I like my mexican food.", "author": "Chrissy L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-06-08", "description": "Not bad for a burrito fix. Get the chicken or carnitas (their carne asada is so-so).", "author": "Alex M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-01-04", "description": "I saw Robin Williams here once on a late Friday evening. Did you know he enjoys Super carinitas burritos, black beans, with everything just like me? Yep, seriously. \n\nAs my staple go-to Mexican joint in the outer Richmond District, this place has outlasted the likes of the corner Alexandria Theater and 35 cents Muni fare for the 38 line. Gordos pulls my childhood heart strings when I need that burrito fix. Ask for a Super and you'll get one massive tortilla blanketing heaps of your favorite ingredients, all for around $7. Fast, cheap, and appetite-quenching. And unlike its sister store on Clement, seating is more abundant here. Parking, unfortunately, is still a pain.\n\nNow living in SOMA, I've yet to find another Mexican place in the area that rivals the true and tried value of Gordos.", "author": "Jay D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-09", "description": "Born and Raised in the City and remember this place opening on Clement St.  Wow!!  Just came home from a visit to the City and the FLAVOR is still the same.  Keep up the good work cause I will be BACK!!!", "author": "Duane G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-05-04", "description": "Thanks to a free coupon I didn't have to pay a dime for this subpar burrito. Oh wait, yes I did. I had to fork over two dimes for a wheat tortilla surcharge. Um, OK. How about you state that on your menu if you are going to tack on extras? Or put it towards some lettuce, which was something you don't offer. But you do offer bags of chips that have grease soaking through the bottom, though I didn't get one as part of my order. No offense taken, though I do wonder how much you would have tacked on.\n\nEnding on a (sort of) positive note - chicken verde was tasty. Too bad it amounted to a burrito about 2/3 the size of your much better mission cousin.", "author": "Jason B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-02-13", "description": "I like Gordo Taqueria a lot. The burritos are more moist and less burnt-tasting than the more authentic ones I've had. That's great. I like abundant salsa, sour cream, and guacamole. I get that here. The two chicken choices are good. Prices are very reasonable. The customer service is a-okay.", "author": "Paulina F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-03-17", "description": "I used to come here all the time 15 years ago--Gordo's was a mainstay in my college days! Coming here yesterday, I noticed some changes since i was last at this location so many years ago--first thought was that the line seemed to move waaaay slower--granted the guy in front of me seemed to be ordering for his entire office--but, i did notice things seemed to be way less efficient then they used to be! When i went to order--i noticed that things seemed a bit less hygenic--like the staff using a less than clean rag to wipe the counter after chopping up some carnitas--couldn't help but wonder how many germs were on that rag! yikes! Then, I went to pay and asked for chips and was told they were out....really? Ughh.. and then, lastly, eating the burrito that was so coveted by me in the past (and granted...i get that sometimes, our memories play tricks on us and make us think things are better in the past than they really were...) but, i just didn't get that---yum, comfort food feeling that I used to get! It was just meh....kind of broke my heart a little.  I mean, it was not awful, though--and it did have that certain flavor that I associate with Gordo's--but, it didn't wow me like it had in the past...maybe it was the turn off from checking out? Not sure...but, I think the torch that I carried all these years is starting to flicker out.", "author": "C Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-06", "description": "My frequent lunch stop. They keep the place clean and they have fast and polite service. cons- their menu doesn't change and once in awhile their salsa is off and not very spicy.", "author": "Steve S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-18", "description": "I always come here with my husband and eat burritos which are always great !!! :) I will come here with my sister who's visiting me this year. I love Gordo!", "author": "Kimberly K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-11", "description": "Love me some chili verde and the carnitas. Don't forget the flour quesadilla. bomb diggati!", "author": "T L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-02-25", "description": "Yesterday I read a review of Gordo that I disagreed with at the time and it made me decide to get a burrito from there.  One part I took issue with was the idea that guac and sour cream cost extra in a bean and cheese super burrito as I was pretty sure it was included.  I thought wrong.  My $4.95 burrito was $5.91.  I still like this place, but knowing I can get more for cheaper elsewhere has made me rethink the rating, even if it's way on the other side of town from me.\n\nThe quesadillas are still a great deal though, and I like their chile verde, so it's still a solid 3.5 stars - if they start selling crinkle-cut french fries maybe I'll bump it back up.", "author": "Sus... B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-03-23", "description": "Came here last friday night for a quick bite before McKenzie's--havent been here for 4 years. But now, i remmeber why! or maybe its just this one time but...\nI ordered a super burrito-steak and my tortilla tasted raw, like flour, it was gross. Blehhhhh!\n\nMaybe I should have came, AFTER going to the bar--then I probably wouldnt have noticed!", "author": "Amy S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-05-23", "description": "We wanted a cheap, filling dinner before heading out last night.   Our order came to about $14, which was odd, b/c when we walked in I read the menu and it clearly stated burritos were under $5. And, from their website menu today: \nBURRITO - Chicken $4.25 \nSUPER BURRITO - Chicken $4.95 \nSo how, exactly, did our order for this amount to over $14? The website menu says that guac is a $0.65 increase and sour cream is $0.45.  She got both guac and sour cream. I only added sour cream. That's $1.55. So that still doesn't add up to $14. Oh, we both got jalapenos and spinach tortillas... but those aren't posted as *extra* items on the website. \n\nI got the Super and she had the regular - and when the guy finished wrapping them, he laughs and says, \"hey look, they're the same size.\" \n\nService: Slow, not friendly. \nFood: passable if you really want mexican. \nThere's a small dining area, which was clean. \n\nThis place will leave you burping for about 3 hours.", "author": "Meg W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-02-05", "description": "Horrible.  What a sorry excuse for a taqueria.  If the staff was aggressively rude (think Soup Nazi) then it might be entertaining.  Instead, they just take up space behind the counter showing zero interest in doing jack shit for a customer.\n\nIt was deathly silent in the restaurant today...there were 9 people eating and two flies hoovering around and not a peep from anyone--just people silently chowing down on what I had hoped would be good eats.\n\nWhen my quesadilla was ready, the woman just yelled \"here\" and threw the yellow basket down on the counter.  Also, I had a very specific request for what to leave out of said quesadilla which they completely ignored.\n\nDeciding to soldier through it and eat it anyway--I discovered that most of it was barely luke warm.\n\nRarely do I have a \"fuck this place, I'm outta here\" moment, but I sure as hell had one here.\n\nTry taco bell a little further down Geary--or for that matter, ANY OTHER TAQUERIA.  You will be guaranteed better food and better service.", "author": "Eric E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-19", "description": "Get in, get full. Fast service. Staff isnt outwardly friendly, but not rude either. -1 for the fruit flies.", "author": "Taylor S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-05", "description": "I only expect one thing here- cheap and grubby carnitas burrito- and they deliver every time.  Anyone whining about service here needs to remember they're paying under $6 for that burrito and then cry all the way over to La Urbana.", "author": "Chris T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-13", "description": "This is what a burrito is supposed to taste like.  Options are limited, but that's fine because what they do they do very well.  Love the burritos and the guacamole is good too.  This is my go-to place for a quick bite of Mexican food.", "author": "David S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-04-27", "description": "The burritos here aren't anything special, but Gordo gets four stars based on their carnitas alone.  Sit me down with a plate of their carnitas, rice and beans and I'm a happy Jew.  \n\nThe staff here are generally pretty awesome, but there is that one guy who skimps on the meat as if you're taking food out of his kids' mouth.  Then there's the other guy who gave my friend a super burrito when she naively asked if they served \"baby\" burritos.\n\nStill though, I love this place, and the other locations are more or less fantastic as well.  Reasonably priced and delicious.", "author": "joe p."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-06-09", "description": "I can't really make up my mind about this place.  It is cheap and fast and so so close to my house.  But the food is just \"meh.\"  Not bad, not good.  They use sliced cheese on the burritos.  That weirds me out for some reason.  I order cheese-less burritos it weirds me out so much.  In the 7 years since I moved away from SoCal, I've learned to appreciate the Mexican(ish) food they serve up here, but Gordo isn't even good by those standards.  \n\nIf you're hungry and only have $5, this place will do the trick.  If you want mouth-gasms, you'll have to go elsewhere.", "author": "Carmen R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-06-26", "description": "The 2 star rating is purely for their tricky business strategy and I still like their food. I just bought a regular burrito from them and was charged for a price of a super one that would cost. I realized that after I had paid.. I asked why and the not so nice cashier said \" because of the cheese, regular burrito doesn't come with cheese.\" Well, i did NOT ask for cheese. It's not the extra $ that pissed me off, I'm disappoint about their \"special operating strategy\". I still like their food and probably will go back for more orders but definitely will be more cautious on how much being charged at the register.", "author": "Stef L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-12", "description": "I read some previous reviews here and I think some explanation is in order. \n\nFirst: Cheese comes standard with the burrito. Gordo's puts the cheese on the tortilla before heating it, so it's already melted before they throw in all the fixings. Not a cheese fan? Tell them before you order.\n\nSecond: Service is fine here, unless you're expecting the folks behind the counter to take you to your seat and serve you some wine. The folks behind the counter want to get you in and get you out quickly. Because the lines get big here, especially during lunchtime. \n\nAnd the lines are here for a reason. This is a quick, inexpensive burrito joint of the highest order. Beans. Rice. Meat. You can throw in some some pico and hot sauce. Guac and sour cream if you want. \n\nI'm a fairly big eater and Gordo's super burrito has always provided a perfectly filling meal, placing me at the apex of satiation without plunging me into the nether-regions of cuisine-induce slumber. No need for chips or some combo stuff. \n\nI bounce around the carnitas, chile verde and carne asada. I've heard about the glory of the all-meat option, but have yet to experiment. Try to look out for whatever is just off the grill.", "author": "Kevin L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-04-24", "description": "Went here with the roomie today.  We needed to get the hell out of Daly City for some grubs.  Originally Americana was on our pallet, but we ended up going here, because the sign attracted us.\n\nIt wasn't too bad.  I mean definitely are better burritos out there and it totally had a fast food feel to it, BUT the burrito itself is pretty heavy, which is good.  We both ordered the Super Meat Burrito, though I really have no idea what that means.\n\nAll in all, not a bad place, and damn cheaper than the Taquerías near our house.", "author": "Clayton R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-02", "description": "I've been eating Burrito's from Gordo's since middle school, though originally at the Clement location. I prefer the Geary location as it has more room to sit down and eat. Granted, on busy days, it can get a little scattered and messy. (Especially, when lazy people can't throw their own crap away.\") The burrito-assembly area is ALWAYS clean. They clean even when the burrito is steaming, and always between your order and the next.\n\nThe burrito's themselves are big, juicy and tasty. The best part is that the price hasn't changed all that much over the last 10 years or so. They make the largest taco's i have seen, and the heaviest Quesadilla i have ever eaten. I can also feed my family for around 18 dollars with drinks.\n\nSo if you want a great, inexpensive burrito that doesn't require a reservation, a vegetarian need, or some isolationistic requirement to not be surrounded by working class people, then go get a Burrito!\n\nI recommend the Chicken and Carne Asada in the AM/Noon and the Chile Verde in the PM. Don't shy away from the Sour Cream or Jalapeno's...mmm", "author": "Edward P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-01-30", "description": "I use to LOVE Gordo's and come here often after school. But Everytime I actually opt for Gordo's, they just keep disappointing me! The burritos are always loose and falls apart ALL OVER me. I mean, I'm already a messy eater, I don't need people to think I'm a kid and can't even eat with my hands. \n\nThe rice was dry and bland. No flavor what so ever. No enough sour cream in my burrito, TOO MUCH guacamole which took over everything else in the burrito. Steak was... wait, I hardly had any in there! When I did get a piece of meat, it was way too salty and chewy..\n\nI doubt I would ever come here for my burritos anymore.. It's just not worth my calories..", "author": "Juliane N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2007-01-24", "description": "Defenition of a bad combo; \n\nOnly good when drunk, not open late", "author": "Drue C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-06-19", "description": "This place is well below average. The old guy who makes the burritos could care less about what you actually tell him. He just slops shit on there in a haphazard way and can barely pretend to listen to you. The burritos are sloppy and wet with bean juices and are barely wrapped tight enough. The fact that you pay for chips and salsa on top of it is a slap in the face. I watched him make my four burritos in disgust (and these weren't obnoxious custom orders either) and almost told him to forget about it halfway through. Eating them was just as much of a disappointment. There is nothing good about this location.", "author": "Adam F."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-03-12", "description": "This place obviously has what every other taqueria should have.\nBurritos\nTacos\nQuesadillas.\nWhen I watch these fools make my food, they might as well get a scale and measure how little they add guac. and meat.\n\nThe next time I ever run into a top manager or Owner at either El Farolito or Taqueria Cancun in the mission , I need to get in their heads that opening one of their taquerias in the inner richmond, would be genius.\nObviously Gordo's wouldn't close down, but they would be no competition for El Farolito or Cancun Taquerias", "author": "Andrew Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-09-11", "description": "So I've been going to Gordos for the past 15 years.  In high school, we would get a Gordo's Cup for 1.25, it was a small cup filled with rrice, cheese, sour cream, guac and your meat of choice.  It was awesome for the price!\n\nNothing wrong with Gordos... The same people have been working there since the start... They have the same recipes for the meat... the carnitas is always cut to order, which increases that freshness... portions are nice, price is decent... and they got something for everybody!", "author": "ryan l."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-08-29", "description": "Lack of properly marinated meat and their disgusting slice of cheese in their burritos makes this place a loser in my booked.", "author": "David A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-09-16", "description": "I said no cheese. You say ok no cheese, continue to make the burrito with cheese and then look pissed when I tell you I cant eat it, as the burrito now has a layer of steamed melted cheese.  Being vegan isnt like a switch i turn on or off buddy, so dont be pissed when i tell you something and you decide to go agaisnt it.\n\nThe salsa, beans and rice are good here. I pick them up and go home and make my own burritos now.  The guacomole is not vegan as it has sourcream as a base.  One of the guys workign there was nice enough to tell me that(thats why it gets two stars, honesty). So unless you want a rice, bean, salsa burrito, Gordo's is strictly for picking up items for home.\n\nService could be better, usually a line of people, and of course the fact that this place is in the russian barrio, kinda makes it a bummer", "author": "Justin W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-12-30", "description": "What I cannot figure-out about this place is the absence of ANY amenities on the tables ... no Cholula Sauce (you know, the one with the wooden cap on the bottle) ... not even Tabasco. There is no \"salsa bar,\" where you can load-up on salsa for your meal. There are not even salt and pepper shakers on the tables! WTF? (Yes, yes, they have the little packets of salt and pepper by the soda machine - but those are for take out, not for eating a meal there.) What could it possibly cost to put some hot sauce on the darned  table?\n\nThe menu is about as basic as it can get, but it is all quite good; you get what you pay for.\n\nI was in there tonight, and there was a continuous line of people. This place is a \"Cash Cow.\"", "author": "John H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-09-01", "description": "I must tell them \" Thank you, Gordo!\".\r\nIt just great to have them for a single Father like me.\r\nI have 2 boys. I used to make  their lunch and dinner very often.\r\nbut Gordo helped me a lot.\r\nThey are fast, big-size and reasonable.\r\nAnd, pretty good food.\r\nThank God!\r\nWe all love Gordo.\r\nI like their grilled chicken Tacos.\r\nMy older son loves their Qesadilla.\r\nspicy pork is good too.\r\nsometimes I have dinner box.\r\nI've never eat there, Just take out.\r\n\r\nI go to the other Gordo on Clement and 24th Avenue also good.\r\n\r\nThank you again Gordo!\r\nI can not survive without you.", "author": "Nobu K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-04-14", "description": "Gordo's is a decent burrito. It's probably the best Mexican option west of Park Presidio and north of Anza.\n\nIt's my go to option when I want to go home and don't feel like driving down to the Mission.\n\nI'm not excited about it, but until there's a Farolito West, this is the spot.", "author": "Jason R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-04-01", "description": "The hype killed this one for me.\n\nMy roommate claim that these burritos are to die for, that she grew up on this, and nothing else.  With the line forming at the counter when I arrived, I thought \"Hey, this place GOTTA be GRRRRREAT!\"\n\nSadly, I had to take that thought back.\n\nIt's a good burrito, but I'm not dying for it, nor will I make another trip out to the Richmond to get this (I live in North Beach, so it was definitely A TRIP!) \n\nIt tasted good, but not authentic enough for my taste.  It's a bit too \"American\" for me.  The menu is short, and everything cost extras.  Even the chips are another buck or so.  Come on now!\n\nIt's a cool place if you live close by and want to get a quick burrito fix.  I just rather go to my local taco truck for mines, that's all.", "author": "Maggie L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-12-20", "description": "I live 20 minutes away from Gordos, and whenever I'm in the mood for mexican (which is quite often) I drive my ass all the way over there and spend 10 minutes finding parking so I can get an amazing burrito.\n\nMy usual is a spinach burrito with cheese, with carnitas, rice, black beans, tomato, guacamole, and a little hot sauce. It is the best burrito I've ever had. It's ALWAYS solid and a mexican place you can definitely rely on. It's cheap too. I just wish I lived close to it!", "author": "Ashley H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-10-14", "description": "I love going to gordo's I am always super full after a regular burrito!  I live the employees too because they are so friendly and always give me a super stuffed burrito!  I got a chicken burrito with guacamole and it was $6.02.. I was satisfied!", "author": "Jennifer H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-06-24", "description": "My wife and I went to Gordo's for the first time ever(6-23-06). I tried the Chicken super burrito and she had the Carnitas super. There both average burritos. One of the few taquerias, in the Richmond district, can't complain about it. I'm hungry, I'm there.", "author": "Matt G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-10-14", "description": "This should really be two reviews.  I have lived two lives at Gordo Taqueria. The first lasted over ten years.  Since high school I've been frequenting Gordo, always a favorite of my eldest brother and for obvious reasons.  There are fresh ingredients, it's tasty yet clean, they have a transparent preparation process, a variety of flavors, and the service is pretty impeccable.  By that I mean the one thing I've come to expect, and really require, in a burrito place is that they get my order right.\n\nANYWAY, the first life I lived at Gordo was a life of grilled and boiled chicken and carne asada.  I don't have an aversion to pork - I love bacon, I love pork chops, etc., I just never tried fried, seasoned pork at a taqueria because, well, I hadn't.  But it was a good life.  Boiled chicken is better with black beans.  Grilled is better with pinto.  Steak is better with refried.  I was in mix and match heaven.\n\nThat all changed last year, though, when I started my second life at Gordo.  I tried the carnitas.  They don't do carnitas like this anywhere else.  I've looked.  It's fried pork.  Let me slow down.  FRIED.  PORK.  Oh sweet Jesus (pronounced \"Hay-Zues\" - we're in a Mexican restaurant after all...) that stuff is good.  I get it with the spinach tortilla for an illusion of healthiness but really it's pretty terrible for you.  Which means it's really gooooood.\n\nGet the carnitas.  Please.  You too can have a new life.", "author": "Tim K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-01-26", "description": "Meh.. it's decent enough, the ingredients are fine. for me the deal breaker is that the salsa verde contains no tomatillos.. WTF? I give them an extra star for letting me slide when I was short a few cents a couple of times.\n\nOh yeah this place is tiny and loud kids hang out there and talk at a table without eating and don't get tossed!! WTF again?", "author": "Dre D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-01-26", "description": "No matter where I visit in the city, maps or no maps, I seem to have a built-in directional finder for this Gordo's on Geary. It is one of those \"hole-in-the-wall\" places that has great eats. Dismiss the service, and the decor, here it is all about the food. \n\nMy recommendation is the Carnitas Quesdilla because its basically a friend burrito and it is messy!! The food is relatively inexpensive because as they make it for you, ask for everything in it or not, it doesn't matter because its the same price in the end. \n\nTo-date, this is the best Mexican food (quesadilla) I have ever had and that is saying something for me. This is a must go-to stop for me every time I visit the city, even if it was just for a day. \n\nMy friends bug me always asking me to freeze something and bring it down so they can remember it ... I don't know if it would work. \n\nMy favorite dish: Carnitas quesadilla with rice, black beans, salsa, guacomole and a little sour cream.\n\nGo out and EAT!", "author": "Anthony C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-31", "description": "Hey, don't compare this place to the \"Mission Burrito\"  it is not a Mission Burro... Just eat and shut up.  Old stand-by spot.  You know its there, you know what to expect and there you go...", "author": "Christopher F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-20", "description": "I am so glad I live next to this place!  For 8 bucks I can get a super burrito and chips with salsa!  The burrito itself is so filling and the joint is hella cheap compared to Papalote, those money grubbers.  So far I've just tried the chicken burrito.  Next up, steak.  and if they have fish, ima get that too. awesome!", "author": "Alex G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-11-18", "description": "Some people hate it.\n\nSome people love it.\n\nI tend to like them a lot. Its conveniently located in my neiborhood which makes it all the better and is really cheap. They are super quick and I've never been disappointed. \n\nOverall we all know there is much better Mexican food to be had in the city but when you are in the Richmond and don't want to trek all the way to the mission to get food then this place often hits the spot.", "author": "Patrick B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-12-04", "description": "Anybody who knows me, knows that me and my brother and mom loves gordo's. Lately this one has been slipping though. I've been a fan for more than 10 years when this one didn't exist and you had to squish into the clement store.\n\nI'm not sure what I did, but the fat (yes, fat) burrito maker guy is always so stingy when i order. \n\nThe older guy is great, makes huge super burritos aka 'footballs' but this fat guy just hates us! The person i went with ordered a quesadilla. Granted that you don't expect a 'football' when you order a quesadilla, but you expect something a little more than the tortilla, oil and melted cheese. she asked for meat, rice, tomatoes and hot sauce and it barely covered the cheese!!!!\n\nhow can you fill a quesadilla but still see the cheese on the bottom? obviously you need not be so stingy. So she asked if she could have a little more rice and that's exactly what he gave her......maybe 10-15 KERNELS of rice........ we joked after that next time 1.) avoid that guy, 2.) ask for a lot of more rice haha\n\nI got a super burrito and this burrito had nothing SUPER about it. . . . it must have been the size of a small regular burrito made by any of the other workers. There was more tortilla than anything. My first 3 bites (normal, not little mouse bites) were ALL tortilla.....maybe some cheese, but you get the point.\n\nI don't know how to review this one.....everyone is normally nice and gives good portions but that fat guy would seriously make me stop going to gordos. I hate to be mean, but a guy that big making food would expect to give you hearty portions. I'm sure if he made a super burrito for himself it would be 3x the size of the little dinky taco-sized super burrito that he made me.", "author": "edie t."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-01-24", "description": "for what it is Gordo's kicks an unbelievable amount of ass.\n\nWhat a load of beans.", "author": "Nicholas E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-08-25", "description": "The best Gordo's is the one on Solano Avenue in Albany, which ALWAYS has a line out the door, at all times of the day. However, this one is also pretty damn good.\n\nThere is really only one way you should order a burrito here: a super burrito with chicken (stewed chicken, not pollo asado), extra tomatoes and extra extra hot sauce. This will get you a humongous steamed burrito with melted gooey cheese, pinto beans, rice, meat, pico de gallo, guacamole and sour cream, which when it all comes together, is a symphony in your mouth.\n\nOf course, I always opt for a \"healthier\" version and get whole wheat tortilla and hold the cheese, sour cream and cut the rice and beans in half. But then steal a bite of the person who ordered the better burrito, usually my brother, and spend the rest of the meal regretting getting the healthier option.", "author": "Deb I."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-08-08", "description": "I think any native SFian would agree that Gordo's has the best burritos in the city\n\nI also love their Gordo cups... cheap, tasty, and the best snack ever!\n\nGordo's turned me gordo.  Poop.", "author": "S L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-02-20", "description": "Lets be truthful here.  Once in a while you want to wear something ugly cause you don't give a shit.  Maybe an old t-shirt, some ripped jeans, or the sweathshirt whose original color is a mystery.  Wearing something nice sometimes is just too much effort.\n\nThats what going to Gordo's is like when you know what a burrito is supposed to taste like.  Funny thing is, from time to time, I go back.  Usually the decision making goes something like this:  what should we eat for lunch?  I don't know, what do you think?  I'm not sure.  Maybe...nah thats too far.  What about....nope, they're closed Monday's.  Fuck it, lets go to Gordo's.", "author": "Pete M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-06-23", "description": "This place does not seem to value customer much. When ordering my grilled chicken burrito with everything on it, the cashier seemed to be hating his job and just wanted the day to pass. The expression that he was showing made me feel like  I was giving him a hard time. The burrito i got wasn't all that special too, just like any other burrito, but I guess for $6 it wasn't so bad. I don't know if the cashier just had a bad day and I so happen to be there at the wrong time, but I still won't come back for another visit.", "author": "Philip T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-11-25", "description": "Yummy and affordable.  Guac is pretty good.  Boiled chicken is great.  Put it all together with rice and beans, wrap it up as a burrito, pay about $5 and -- you you get a great, satisfying meal.\n\nToday, I noticed that Gordo's posted its recent health department evaluation - it scored wonderfully - 98!!!!   Yeah!", "author": "Cara C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-08-12", "description": "The first burrito I ever had was from Gordo's, and I have been a customer ever since.  When in doubt over what to eat or when I discover that I have no food in the refrigerator, Gordo's is a no-brainer.  When I was younger and coming home from school, I had to walk past Gordo's and it became a constant temptation.  Usually, Gordo's would win.\n\nI love to get the super burrito with either the Spinach or Tomato wrap and the grilled chicken.  It may sound like a standard burrito, but the nostalgia I feel each time I bite into a Gordo's burrito makes it anything but standard.\n\nRecently though (maybe because of the down economy), they have been making the burritos smaller, but I still go back for more.", "author": "Andrew M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-02-10", "description": "I started coming to this place when I first moved to San Francisco and was still crashing with my brother way out in The Avenues. The burritos are good; the ingredients are fairly fresh, and the staff will do anything you want without asking you twice or charging you too much.\n\nThe only downsides to this place are that there's usually a soccer game blaring on the TV and if you come around dinner time you're likely to have to wait a really long time to order.", "author": "John S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-08-04", "description": "After braving the windy conditions, seeing way many unanticipated twigs and berries, and enduring a lengthy wait at Baker Beach to capture the Golden Gate Bridge at Sunset, I was ready to head back to my buddy's place in the Twin Peaks area. Not having any sense of where I was going, I relied heavily on my more important than oxygen GPS to get me around. I crossed Geary Street on the way back and decided that Geary would be a good street to hunt for food. I used the Wells Fargo as a stopping point and surveyed the surrounding areas.\n\nAt close to 9:00 pm, I figured most of places would be lacking for patrons but not Gordo's Taqueria. I walked by, the whole time thinking no more Mexican food cuz I nearly OD'ed on it in the previous few days, and decided, okay, any place with a significant line at this hour must be pretty decent. I had to wait nearly 10 minutes to get my order in as the there was only one gent assembling the food there. It was worth the wait. I order the Carnitas burrito and even after a lengthy car ride back, the burrito held up and along with a Sierra Nevada Pale Ale, it went down smoothly.\n\nThere were a few choices of meaty fillings and the rest of the toppings/fillings were pretty standard. Nothing of special note but leave it to the locals to help me filter out the good places from the less than good places. Apparently my landlord/buddy knew of this hole in the wall place as well. I'd thought I'd give this place a thumbs up. Happy dining world!", "author": "Bill G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-09", "description": "Fantastic burritos and quesadillas. Both great portions at affordable prices. You can't go wrong with my meat here.", "author": "Graeme B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-10-24", "description": "I have never really understood the lull of Gordos. But then again, I am not a huge burrito fan. It's a good source for a cheap eat down the road though when I am just too lazy to do anything else.", "author": "Sarah A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-04", "description": "These guys know what they're doing.  They keep it simple and create good tasting burritos.  I tend to do a simple pollo asado con todo.  The place doesn't have much character so not going to give a full five stars.", "author": "John W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2005-12-23", "description": "What kind of taqueria doesn't have refried beans and is out of chips at 9pm on a Thursday night? A crappy one in the Richmond. \nI wanted to satiate my refried beans+salsa+chips craving and was denied. That's what I get for seeking out taquerias in the Richmond.", "author": "Candice L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-12-16", "description": "BANG FOR YOUR BUCK!!!\n$5 FAT BURRITOS!!!\nI love it!  The carnitas is greasy but a good kind of grease!  YOU MUST COME HERE!\nNo frills menu!  Easy to order.  The staff is great!\nThis is not Pancho Villa (san mateo) but that's ok.  I know what to expect.  Fast easy service!  In an out I go!!\nOK I think I am going there tmrw.\nIt is a good thing that I live near this joint!!!", "author": "Elisa O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-07-28", "description": "Gordo's is always a solid burrito.  The bean and rice have good flavor the grilled chicken is authentically seasoned.  And the price is right.\n\nI ordered my burrito with lite beans and rice (because I'm watching my figure) which is usually a risky move, sometime you end up with a tiny ass little piece of burrito.  Gordo's hooked it up.  Lite on the carbs meant that I got hooked up with a bunch of everything else, which is nice.  \n\nThis isn't a five star burrito but it's never a disappointment.", "author": "eric f."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-27", "description": "I love this place.  It's close to home and they're fast and cheap.", "author": "John B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-17", "description": "I so love Gordo.  Yeah the cheese the put on a burrito is just a slice of cheese (but that's where the comparisons end with Jack in the Box).\n\nThey load your junk up and don't even apologize.  All of the ingredients are authentic, simple, and well made.\n\nYou really can't go wrong with anything on the menu.  My particular favorite is any meat quesadilla, add beans and rice and everything else (salsa, guac, sour creme, jalapenos).\n\nThis location is the biggest, and it's right next to Cards & Comics Central.  Try not to let the attitude of the comic shop workers affect you all the way over here while you're eating a great burrito.\n\nThere is no great taqueria - everyone has their own opinions and their own likes.  Generally speaking Gordo is it's own thing.  It's not a Mission style taqueria, and it's not a taco-truck, and thank God it's not Taco Bell.\n\nGive it a try.", "author": "Josh L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-05-14", "description": "I was at Gordo's on Saturday May 10th. You missed me. Ha! \n.....anyway\nGordo's success is in it's simplicity.\nSimple burrito, simple prices.\nI got the regular size grilled chicken burrito but I added sour cream and guacamole and that little green hot sauce he offered  - thanks guy!\nMy burrito made me so happy because it wasn't trying to be special or unique or famous; it was just trying to be it's natural self. I think my burrito had a soul. And I ate it. It was sooo good.\nI would recommend this place to anyone, and especially people who have been hanging around too many \"boutique burritos!\"\nIf you're a hungry man, maybe you should get the super burrito.\nAlso, we ordered chips and salsa and if you like jalapenos, that salsa has 'em. It was hot! I hurt myself.\nMexican sodas were like $1.15 and I got grapefruit! Thanks guy!\n\nBut, alas, the guy gave me grief when I asked to try the carne asada, he had to get approval from senior management and sh*t. \nAnd that's why you get 4 stars  - guy!", "author": "Tianna R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-01-15", "description": "Gross... guy wiped the grill, then the counter, then his hands with the same filthy rag. Then he made my food without washing his hands.", "author": "Heather H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2007-03-02", "description": "ummmm....this is for people that moved here from the east coast and party at Ruby Skye, who have never set foot in the Mission\n\nI met Mr Gordo himself when he was in Marin.  I had to ask about the finger.....i know...i know... but I was just a kid on a bmx bike and was spending my hard earned money on a burrito.  I just wanted a story to go with my expensive burrito. He was a very nice memorable guy.  I don't feel bad about this review, because he's making a lot of money no matter what I say for this place.\n\nstinky tofu", "author": "StinkyTofu S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-12-07", "description": "the seats are a bit uncomfortable, but if your taking it to go then there's no problem.  the food tastes a bit more healthier than other mexican places i've tried; which is a good thing.\n\nthe service is ok, they aren't very friendly ... but they do get the job done.  also the place looks fairly clean.\n\nparking is SO DIFFICULT!!\n\nthe line doesn't get too long, and even so, it moves pretty fast.  you don't get free chips with salsa which is a con, but ehh ... you win some, you lose some.", "author": "Pia V."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-01-17", "description": "Just got home.. eating a carnitas burrito... it's reliably good with an off chance of being great.  Three stars only because the workers have never, ever, evvver made the slightest effort to actually give a sh*t about the food they are making.  I've never seen any of them even smile.  It's a quasi-miracle the food is actually good considering they could clearly care less.", "author": "Alex R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-07-21", "description": "I've been going to Gordo's ever since I was in 6th grade. Maybe that's why I was a fat kid growing up? Every time I find myself in the Richmond district, I always tend to stop by, even if I'm not hungry.. to get something to go.\n\nI typically get a flour quesadilla with the following:\nrice, black beans, grilled chicken, salsa, guacamole, sour cream, cheese and hot sauce. \n\nIn my opinion, Gordo's is the best Mexican food I've tasted in the Bay Area. I've tasted better Mexican food in San Diego, but that's a given. The food is fresh, the prices are fairly cheap, and they are quick to make your order how you like it. I don't normally give out 5 stars, but Gordo's definitely deserves it. I'm hungry now!", "author": "M L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-12-01", "description": "Best Carnitas in town, Bar None!  Been eating at this place my whole life, great prices, a bit greasy, but very good!", "author": "Joe E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-03-24", "description": "did you know you can order a burrito cup at gordos?  this recent discovery has made me crave gordos even though i may not be hungry enough for a gigantic burrito!\n\nmust order if you cannot devour a super burrito!", "author": "Carli F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-02-26", "description": "Even after having many delicious burritos all around the city from El Farolito in the mission to Nicks Crispy Tacos to the a delicious chicken gumbo smothered burrito i had in Corvallis. I will always remember and come back to Gordos. They are super quick and delicious and the good part is they are close to my neighborhood and I have been going there for many years now. I realized i haven't wrote a review especially since i came here twice this wk :X. I almost always get the same thing a Super Chicken Burrito with everything! so i may discover new and better burrito places but Gordo's will always be a part of my stomach! :D", "author": "Jonathan W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-01-29", "description": "Gross. Really gross. Like, I thought I was going to puke and threw away the rest of my food after choking down one taco gross. Rubbery tortillas, mushy rice, chalky beans, bland pico. Stomach continued churning the rest of the day. Maybe it was an off day for the place, but I won't be back to find out.", "author": "Kerry S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-09-04", "description": "First off, please allow me to LMAO @ Danie B. below.  This is precisely the type of person that busts me into hysterics at Gordo.\n\nThis place is off the chain terrific-O, Carnitas fiesta of pure dope-ness.  Best carnitas anywhere!!!  ANYWHERE!!!!  Their guacamole, although a bit light on the avocado and heavy on the... (sour cream?) has really grown on me.  All-in-all, it's pretty well priced, the staff is chill and knows how to serve it (assuming they don't hate you - coughcoughDanie B.!!!) and the burritos are straight dream-laced salty goodness.", "author": "Philippe N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-29", "description": "Gordo is me and my girlfriends favorite taqueria...I always order the super burrito with boiled chicken..you can't beat it! Although I wish they had more items on the menu..what they do have is good as F***! Inexpensive, Good Quality, Delicious...", "author": "Allen K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-11-18", "description": "Hands down favorite burrito place for me.  Close second to El Farolito.   I know, some will disagree but I gotta go with my gut on this one. \n\nQuick service.  Great tasting burrito with the right combination of rice, beans, and carnitas.....  AND, if you order extra sour cream, well dangit, you get extra sour cream.  Not sure why a lot of other taquerias don't give you the extra but I'm glad that Gordos obliges my craving for a high calorie meal.\n\nSometimes, it's the simple things in life that make things so much better.", "author": "Kenneth K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-03-22", "description": "They have the best guacamole in town.  They don't wrap the burritos, tight like I like them, but most of the time because they add so much meat into mine.  I've always gotten service with a smile and too much stuffing.\n\nLove it!", "author": "Susan C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-09-23", "description": "Taste is relative. We all know that. One woman's \"go to\" joint is another's \"avoid at all cost's\" category.\r\n\r\nI love coming here for my flour quesadilla with rice, beans, chicken, salsa and a little hot sauce. To me it's a little slice of heaven. And sometimes I'll even order a little cup of rice and beans to nosh on as a snack or for lunch tomorrow.\r\n\r\nIt's simple no frills fare. They don't have a salsa bar. They don't have random mariachi bands wander in. They don't have any aguas frescas. But they do make my favorite quesadilla. And that's all I need.", "author": "cyndi L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-10-13", "description": "oh man\nwhere do I begin\nI used to live on 21st & California\nand I took Gordo's for granted\nI would go there about once or twice a week.. and now that I live in marin, I CRAVE Gordo's for breakfast, lunch, and dinner..\nI can't live without it\nI can almost TASTE the beautiful burrito right now\nI'm getting hungry just thinking about it!\nDear Gordo Owner,\nPLEASE OPEN A LOCATION IN MARIN, PREFERABLY IN THE LARKSPUR LANDING AREA!!!!!!\ni will work there for FREE!!! \nBut you probably won't make too much of a profit because I will make myself about 14 burritos per day... god what I wouldn't do for a Gordos BURRITO right now!!!!!!! i love you gordos, I LOVE YOU", "author": "Brianna B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-12-05", "description": "I always say I don't like Gordo's but I do.  I quite like Gordo's.  They are the only fast food mexican restaurant in the 'hood so that might be a big factor but they're not bad.  They have carnitas.  They make fat burritos.  They have Jarritos.  Unfortunately you don't get free chips and salsa.  Unfortunately it's overpriced.  Unfortunately their salsa is either bland and not hot at all or really f'ing hot although I do enjoy the really f'ing hot one.  I wish they had fish tacos.  Why don't they have nachos?  WTF?  Gordo's you could EASILY make me nachos.  Why won't you make me nachos Gordo's?  Hmmm?  It's so easy and you have all the fixins.\n\nSomeone should start a mexican food joint that delivers.  I would order from you regularly, even if you weren't that great.  Seriously, you'd have a monopoly.  I'd do it myself but don't want a mexican food joint.", "author": "Dee K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-08-23", "description": "The first place I checked out when I moved out to the Richmond, decent for a quick lunch and dinner, best enjoyed as a hangover food. The carnitas is very tasty and tender. If you are really hungry go for the Gordo plate, it can leave you full all day.  A good bang for your buck.\n\n**I was there today and it seemed like a zoo... birds and flies everywhere, didn't bother me too much, but I could go without the battle with nature. On the other hand it made me feel like I was in the Mission... go figure", "author": "Chris F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-09-14", "description": "There's something about vegetarians and burritos that makes me scratch my head. \n\n\nThen I realize I had tofu ice cream and a shot of wheat grass yesterday. Who am I to talk? Hey, tofu is freaking delicious. I'm chinese, tofu was practically my baby formula. That and jok (porridge). \n\n\nAnyways. Gordo's my lovely gordo's. I remember when I was a wee lass back in middle school. You served me well back then, when I was indiscriminate about what I put in my stomach. Then I took spanish class and realized Gordo = fat. Let's just say I went from una niña pequeña to....not.\n\nWell, not really. I never really liked this Gordo's for some odd reason. When they say that their quesadilla was an appetitzer, they mean it. it's small, albeit filled with enough beef to make me happy. \n\n\nNot somewhere I would go if I'm in a hurry to finish my food (more ends up IN my brown take out bag than on my food), or if I'm not willing to talk to the people behind the counter. \n\n\nSeñor Burrito man: You want beef or chicken?\nMe: Beef, please\nSeñor: Salsa?\nMe: Yeah.\nSeñor: Beef?\nMe: Yeah.\nSeñor: Salsa?\n\nnever fails. \n\n\nI just realized, I have never finished a whole burrito from them at one time...half always ends up in my fridge, which disappears the next day. Who the hell is the one idiot who put Gordo's good for \"dessert\"? You're a riot.", "author": "tammy m."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-05-23", "description": "Good food, good value.\n\nYou'll probably have to ask for jalapenos and hot sauce. The hot sauce is a green chili sauce, more spicy than hot.", "author": "C G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-06-15", "description": "the burritos are pretty yummy but is it just me or does it smell funny in there?", "author": "Ashley C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-09-23", "description": "If you're looking for a quick burrito, Gordo's wouldn't be a bad place to make a stop. While not nearly the best burritos I have eaten, they are well priced and should satisfy the average person.", "author": "Barrett I."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-12-30", "description": "Good ass burritos in the Richmond District.  Ya, I like Farolitos and the Mission places better, but really, its like the only place in the Richmond for Burritos (or tacos, also good, and the quesadillas are bomb, they probably lard it up cuz the outside gets all crispy etc).  And its BOMB.  I almost always get the Chile Verde.  Super Delicious.  And like many places, only around $6-$7.  The carnitas are nice too.", "author": "Sage S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-05-17", "description": "I have been going to Gordo Taqueria for years and I can't imagine going anywhere else. The food is wonderful and is always spot on. They give you plenty of everything...leaving you nice and full for hours to come. My favorite meat is the boiled chicken, but the carnitas is just as tasty. Hands down, I think they have the best burritos in San Francisco.", "author": "Holly F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-09-14", "description": "Gordo's burritos are the greatest burritos on earth, and the burritos against which all others are compared.\n\nThere are fine burritos in the Mission, but nothing comes close.", "author": "Colleen B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-09-19", "description": "It gets one star for being brave enough to have a mexican restaurant in Outer Richmond...\nand another star for being slightly edible, and at least not making me sick.\nNo more stars past that... I have already been too generous. The meat is dry (apparently). The cheese is in nasty processed slices.  And ordering 'Super' doesn't mean you get sour cream OR guac extra.. OR that it is even bigger! Pretty lame. And the food isn't even tasty. bland bland bland. Guess I'll hit Panchos or Chinos, if the craving takes me...", "author": "Tiffany M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-03-16", "description": "Update: Finally cracked the code. Just stay away from the meat and beans and rice.  Got a tasty quesadilla with guac only for 3 bucks. Pretty good, actually.", "author": "Robert K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-04-23", "description": "Yes, they make a big fat burro.  Sometimes they skimp on the meat portion of the recipe, but that can be cured by asking them to alter the ratio of rice/beans/meat or simply asking for all-meat.\n\nEveryone behind the counter is friendly, and tolerate well all the gringos who will practice their taqueria-spanish here.\n\nUsually plenty of uncomfortable seating around, and the satellite dish is usually showing futbol.  \n\nBe sure to get there about an hour before closing if you want a selection of meats though, they run out towards the end, don't bother replenishing as it gets near closing time.", "author": "Ken B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-28", "description": "Gordos is great! Most everything is pretty good here! Not sure about the quality of some of the ingredients but It is fresh due to the high amount of people coming in and out! \n\nI don't know what people are talking about service wise!!! The place is freaking busy and its all about business! And how can they mess your order up when your watching them make everything right in front of you?", "author": "hel la m."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-07-13", "description": "For those that care nothing for quality service, ingredients, or preparation, then Gordo's is the place for you. \n\nThe food is prepared soullessly by disrespectful employees. Upon my last visit, my little brother was served a quesadilla that was sloppily put together, and his friend, given a terrible burrito carelessly put together with beans and cheese that were specified to be given in moderation. All the while, the servers, unaware of my fluency in Spanish, insulted the hell out of us as they made our food with ennui. Needless to say, we won't be going back anytime soon.  \n\nTake the Geary or Balboa street bus a little farther to Chino's for some quality Mexican food in the Richmond. Cheap, plastic-tasting food doesn't warrant this kind of disrespect.", "author": "Marcello W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-10-14", "description": "The burritos here are soggy, messy, overly salty, and lacking in flavor.  Unfortunately, the Richmond District really lacks a good burrito joint.  If you're really craving one, head over to El Farolito on Mission and 24th instead.", "author": "Anthony H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-20", "description": "Gordo's is two things: tasty and cheap.\n\nSure, they steam their tortillas when they have a flat top right behind them.  Sure, they dip their quesadillas in oil and proceed to shallow fry them and stuff cold ingredients in them.  Sure, their staff is absolutely indifferent about their customers... These are all reasons WHY I go there (minus the steamed tortillas).\n\nIf I don't want to be bothered or chat with anyone or be convinced to buy a bunch of extra stuff, Gordo's is where I go.\n\nSome tips for going to this location of Gordo's:\n\n1) Decide everything you want before you get to the counter.\n2) Try their refried beans and carnitas.\n3) Their guacamole has pico de gallo and sour cream in it already, so it's kind of an all-in-one.\n4) Always get extra green sauce.  It's super flavorful and has little heat.\n5) Steer clear of the quesadillas.  I hate to say, they make them really bad.\n\nMy favorite thing to get from Gordo's are the tacos.  Simple, fast, cheap, delicious.  My personal favorite is grilled chicken and guacamole.\n\nOn a final note, this is the CLEANEST burrito place ever.  They are beyond serious about their food safety.", "author": "Gavin S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-11-14", "description": "This would have been 4 stars, but I think I had one too many burritos to maintain a high rating. On top of that, I've actually been to another Mexican place that I like more. \n\nI'm not even going to bother writing about the service, so i'll jump straight into the food. The burritos are a hit to me and it's probably the most popular order for me. It doesn't matter which meat you choose, but the best ones are grilled chicken and the carnitas. The salsa seems fresh and the guacamole is awesome. Add beans at your own discretion. \n\nAnother alternative to the burritos is the Gordo special dishes like the Gordo plate, which is essentially every part of a burrito or taco in separated sections of a take-out tray. There's plenty of rice, meat, salsa, sour cream and guacamole that would make the Gordo plate a feast for anyone. It includes some flour tortillas, so you could make your own soft tacos if you like, or do what I usually do and take everything and turn it into Mexican fried rice. \n\nThe other alternative is the Gordo cup for the budget minded individual. Similar to the Gordo plate in terms of content, but in a \"cup\" or a small tupperware-like container. It's usually packed to the rim, so be careful when you open it. \n\nGordo's is a good place for Mexican, but I see it as fast Mex. Whether you like a big meal (Super Burritos, Gordo Plate) or like smaller fares (Tacos and Gordo Cup), there's always some thing that will fit your stomach.", "author": "Jeremy L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-04-19", "description": "Simply fantastic. I'm a pretty simple guy, with pretty simple tastes, so maybe die-hard Mexican foodies will disagree with me on this... but Gordo is my number one pick for Mexican food in SF.\n\nWith good portion sizes at good prices, a clean sitting area and kitchen, you can't go wrong. I'm sure that some people will argue that you'll only find good Mexican food in the Mission, but if you're just a poor, uncultured schlub looking for A+ Mexican food in the Richmond District... go here!\n\nA couple of notes: This location is far superior to the one on 9th Ave. I haven't been to the one on Clement in about 6 years, so I can't vouch for that one either. If you're in the East Bay, check out the Gordo on College in Berkeley/Oakland!", "author": "Alex C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-01-15", "description": "A solid Mexican taqueria.  Hefty burritos, overflowing tacos, greasy quesidillas - what else would you expect?  I wish they had horchata, but nonetheless, it's a spot I frequent.\n\nMix it up by going for the spinach or tomato flour tortilla.  Man up with all meat (one kind of meat), no rice.  Very tasty.", "author": "Qyon G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-01-26", "description": "My native-San Franciscan friends and I lovingly refer to this as the \"good Gordos\". Actually the Clement Street one was the \"good Gorods\" until about a year ago. One must not have high expectations of fancy burritos with lots of extras, Gordos is a straight burrito/quesadilla taqueria--\nthe chips aren't great and there are no sides to be had, but the burriots and quesadillas are to die for.\n\nAnd for those of you not in the know, here's a little fun fact. The steamers used at Gordos and some other San Francisco taquerias are in fact native to San Francisco as well:\n\n\"The San Francisco burrito is distinguished partly by the amount of rice and other side dishes included in the package and partly by sheer size. A food critic working for the San Francisco Chronicle counted hundreds of taquerias in the San Francisco Bay Area, and noted that the topic of which taqueria makes the best burrito can 'encourage fierce loyalty and ferocious debate'\"\n\nAlso:\n\n\"Two key technologies that made the San Francisco burrito possible are the large flour tortilla and tortilla steamers, which together increase the flexibility, stretch, and size of the resulting tortilla. The tortilla steamer saturates the gluten-heavy tortilla with moisture and heat, which increase the capacity of the tortilla to stretch without breaking. This in turn allows for the size of the San Francisco burrito.\"\n\nFrom Wikipedia.com (http://en.wikipedia.org/wiki/San_Francisco_Burrito)", "author": "Michelle D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-10-02", "description": "In my house, there is an ongoing conversation about creating the perfect San Francisco burrito using ingredients from all over the city. My perfect burrito would include many ingredients from Gordo Taqueria. \n\nI was wary of Gordo when I first started coming almost 5 years ago. I was raised on authentically Mexican taquerias (an upbringing that still leads me to order my burritos sans rice) and wasn't accustomed to the San Francisco burrito experience. Let me tell you, I am now. This fine cuisine has grown on me and I now get cravings only Gordo can satisfy.\n\nI want to say it's all in the steamed tortilla, but that doesn't work because I love the quesadillas as much as the burritos. Giant flour tortillas fried, packed with as much filling as a super burrito, and then folded in thirds. Oh, and the corn quesadilla. The dear, dear corn quesadilla. The beef corn is a family favorite, but I recently became addicted to a veggie version - black beans, guacamole, and pico. Juicy, messy, lard-soaked goodness. \n\nOh, and I must mention the boiled chicken. Really, most of the meats are great (beef, carnitas, boiled chicken, or grilled chicken - I stay away from the chile verde because of a chile allergy, and avoid like the plague the al pastor offered at certain locations, but must admit I don't like al pastor at any taqueria), but my usual order has become two corn quesadillas (one black bean, one boiled chicken) when dining there, and a boiled chicken burrito when taking it to-go. The black or pinto beans are firm and flavorful and I did a lot of research deciding which beans to pair with which meat, but the refried beans are flavorless and should be skipped.\n\nBut, more than anything, my love belongs to the Gordo guacamole. Not as pure as the mashed avocados found at La Taqueria in the Mission, but my favorite part of any order. Something about this goopy green mess has become a part of my soul. I want to slather my body with the stuff. One of my worst memories is when we went to the 9th & Irving location just before close and they were out. Out of guacamole. At first I thought the guy was joking. How could it be? A nightmare! Good thing we go to the Geary location a couple times a week, so my craving was satisfied a couple days later, or I would have continued in a distraught state indefinitely. Phew. Disaster averted!", "author": "Veronica L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-01-07", "description": "The only thing that is good here is how they throw your tortilla on the grill and let the cheese melt. Other than that this place is pretty ehhhhhh. It's lame how they make you pay for each add on. It's like hey, why not just offer a bigger menu like every other damn Mexican place?\n\nWe really do need better Mexican places in the Richmond.\n\nWe need cooks like Nacho Libre.", "author": "Lee M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-07-14", "description": "My new mantra needs to be that if the staff of an establishment makes you feel like you are ruining their day by walking in, it's time to turn around.  The burrito didn't have much flavor and the taste profile was dominated by the soggy tortilla. The place was dirty and the seats uncomfortable.", "author": "S L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-10-19", "description": "Not a huge fan of burritos, but this place can be one of my favorite...Decent portion. I usually order the chicken burrito with everything but beans in it. And I'm usually able to finish the regular one.... I guess that means something from someone who doesn't like burritos right? I like the chicken, it's not too dry. I'll come here if I am around the area and craving for burrito....which is rarely but occasionally I would, but it's always busy around dinner time, there's a loooonggg line, so if u can just call in to order and pick up or go earlier or later....because parking can be horrible out there....", "author": "Helen T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-07-03", "description": "Take out anyone? Good ! Fast!  Carnitas, Carne Asade, Chile Verde all too good and cheap! How can you feed a family of 4 for under $ 15.00 dollars? \nService is okay- just a little smile and por favore and thank your lucky stars this Richmond delight is here!", "author": "Grace A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-10-08", "description": "This review is only for CARNITAS. If you dnt like carnitas youre seriously delusional. Gordos has great carnitas burritos and for 5 bucks what have you got to lose? \n\nI come here often and once they were out of carnitas. The carne asada was mediocre and i left without even finishing half. \n\nIt can get annoying that the line is always out the door but hey itll be worth it.\n\n Minus a point for the immature mexican guys talking smack behind the counter. soy mexicana! i understand what youre saying!!!", "author": "Jasmine M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-05-20", "description": "Im pretty sure this place is named after the guy who served us. Anyway, this place was dirty, napkins and trash on the floor, dingy and dark inside, and the food in the metal trays looked like it had been sitting all day. The carnitas were dry and the rice tasteless. Not to mention our burrito maker stared at the t.v. the whole time and kept forgetting what we were telling him to put on our burrito while yelling in Spanish to his coworker. With all of the asian places in the hood its hard to find something else to eat. I was hoping for a good mexican joint and all I got was a bland taste in my mouth and bad gas.", "author": "M K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-02-08", "description": "I'm a native San Franciscan, I love my unauthentic super burritos wrapped in foil, and Gordo is THE place to get them.  I don't give a shit what people say.  I've had the rest, but I still consider them the best.", "author": "Jenn C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-30", "description": "not sure about bad reviews , been coming here for years and food consistently ok, i can agree with one of the yelpers about the stuff (just need to have smile ones in the while) but otherwise great , inexpensive place to grab quick bite.", "author": "SF G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-03-16", "description": "Great burritos, BUT watch out for the cashier. On three occasions they tried to charge me for sour cream when I did not order it. Once is a mistake, twice is a coincidence, but three times is an unethical business strategy.  Good food, but watch out at the cash register.", "author": "Gary S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-06-27", "description": "Gordo's is a Bay Area classic and as usual the cooks do a great job providing quick service and quality meat (try the boiled chicken!). I eat here once a week and the quality is consistent but so are the long lines. Call your order in ahead of time.\r\n\r\nI'm a Bay Area local and Gordo's has been on my A list since I was a kid...", "author": "Mike M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-05-18", "description": "One of the BEST burritos' I have ever had...and I am from South San Francisco where there are HELLA taqueria's on just one street.\n\nThe burrito is a pretty decent size and they pack it with an overage of food. \n\nThe only two complaints I have is that chips and salsa don't come complimentary and my burrito wasn't wrapped very tightly...but with that I did go there after Bay to Breakers and they were SUPER BUSY...so they might have been rushed.  This is something that I am going to be craving for!!", "author": "Jazmine S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-01-08", "description": "It took me a while to get around to reviewing Gordo because I have such mixed feelings about the place.\n\nFirst, after spending so much time in San Diego, it's hard for me to call any burrito up here really \"good,\" but I guess Gordo is close enough. I guess.\n\nThe service is slow. Somehow. It takes 30 seconds to make a burrito, but I've stood in line here for 15 minutes. Seems impossible, but it happens. I also get really pissed at customers, yea, you all, who come in with a list of 10 burritos you want made, except you really don't know what you want. So you argue with the guy over the glass in Spanglish for 5 minutes about what kind of beans you want. Burrito after burrito. If your buddy isn't with you, they shouldn't get to eat. But I guess that's not Gordo's fault.\n\nAnyway... A slice of cheese? In a burrito? I feel like I really should be giving the place 2 stars, but where the hell else am I going to get a burrito in the Richmond.... oh yea.... a different Gordo. The guys aren't really all that nice either. There's no smile or hello or emotion whatsoever. \n\nThey're not \"good\" burritos. They're burritos you eat because San Diego is too far to go for lunch.", "author": "jared c."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-02-01", "description": "Great food.  Questionable hygiene.  One of the guys making burritos goes to the bathroom with his cell phone.  He comes out  -let's assume he washed his hands.  He goes back on cell phone again.  Then he makes my burrito.  No gloves.  No gloves is fine, if I know hands are clean and not touching the surface of something that is probably not clean.    Ewwwwwwww.", "author": "Paul G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-12-15", "description": "The measure of a great taqueria is the delivery of a great bean, cheese, and rice burrito. It is simple, so it shouldn't be hard to F*ck up. However,  this place manage to do just that. First, the beans we de la olla, which is not bad, but they should have been re-fried. The rice lacked flavor, and the cheese looked like a kraft single before it was launched into the \"heat press\" to warm the flour tortilla. It was reminiscent of chipotle; however, at least chipotle has flavor! Then the guy asked, \"would you like tomatoes?\" I said, \"no.\" He proceeds to add them anyway. As I was paying for my burrito, the guy starts talking sh*t in Spanish. Little does he know I that I know Spanish, fluently. Now, how did it taste? Just imagine chef Gordon Ramsey on kitchen nightmares tasting a god awful dish and picture his facial expression. IT WAS MIERDA! I will not be coming back.", "author": "Adrian G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-12-18", "description": "Location, location, location.  If Gordo's were on Valencia, it would be in trouble.  But it's on Geary.  In the Richmond.  And so the burrito matches the neighborhood-- solid, dense, but a little bland in spots.  It shouldn't be a destination, rather part of the journey.\n\nExtra star for the salsa-- which you have to pay for (booo), but they give you so much you can take it home for later, or use to liven up your burrito.", "author": "Jeff M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-02-07", "description": "So-so service. Decent-sized super burrito.  I had a veggie burrito here and they were able to honor my requests for a veggie burrito, although, I got the feeling that the big guy behind the grill felt a real-man must eat meat!  \n\nIn fact, as I recall the server's first inclination was was to scoop some char-burnt black beef cube substance into my burrito had I not insisted on no meat.  I sat down and ate in the smallish dinning area where a TV was on the news or something but in Spanish. Overall, this wasn't quite as authentic as going into the Mission on 24th Street by Folsom where on a weekend you'll like see them serve up food into the wee hours of the morning right out on the street in front of their shop.", "author": "Ed M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-09-10", "description": "Honestly I go there when I'm in a rush... and sometimes I regret it... the last couple of times the tomato tortilla have been staled :( and the spinach ones too... \n\nI went there a couple of weeks ago and after an hour... the burrito was a brick in my stomach\n\nThe bigger dude I find is rude... and just slops the stuff on the burritos... the other guys though do a better job", "author": "Peta C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-12-06", "description": "Ooh Gordo's, my first burrito love. I started coming here my senior year of high school and since my friend Antonia lives only 4 blocks away on Fulton and they are perfect for us lazy, broke college students that know you better walk instead of hoping to find parking anywhere along Geary!!\n\nAnd I believe they have finally started accepting cards sometime earlier this year. Thweet. I just wish they had horchata. Every time I go and ask, but alas, none yet.", "author": "Daneca V."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-12-13", "description": "A few months ago I was eating at Gordo 3-5 times a week, at about $5-6/ visit.  That makes around $90 per month.  Now?  I just went there for the first time this month and it sucked, as usual.\n\nI should probably rate Gordo 1 star, the way it's tasted lately, but I have strong memories of amazing, 5-star burritos I've had in the past that prevent me from doing that.\n\nThere is no problem with the decor, the employees, the presentation.  There is no problem with selection, and they are very fast.\n\nThe only problem is the food is crap, possibly literally.  I'm eating my burrito and a bite or two are delicious, and then suddenly you feel like you've bitten into... something rotten.  Either the meat tastes like it's three days old, or the beans do.  It's always something.  The carnitas are insanely good one day and crap the next.  Same for the carne asada (beef).   And the problem with getting a burrito at a place that uses shady ingredients (or keeps good ones for too long) is that there are so many ways it can go wrong.\n\nWith a quesadilla, at least, there are fewer ingredients - less can go wrong.  I love the corn (tortilla) quessadilla.  They can't mess up the tortilla or the cheese, really, so all you need to pray for is that the meat isn't \"off\" yet.  Of course, that's usually the first thing that goes off.  And when they can't even get the corn quesadillar right, I give up.  I would rather spend my $5-$6 per day somewhere else, where I don't consistently develop facial twitches of disgust when I'm trying to provide my body with essential nutrition.\n\nA couple more things:  someone else mentioned stinginess.  They have been WAY STINGY lately as well.  I pay extra for guacomole, and they barely put any on the burrito.  Can I bring my own? They also skimp on the (rotten) meat (which could be a good thing).  I assume that their boss is trying to cut costs.  The best guy to get to make your burrito would be THE NEW GUY (whoever hasn't yet been told that the best way to run a burrito joint is to keep the customers hungry).  But none of this matters when the food quality is crap.\n\nGordo, pay up.  Buy fresher ingredients.  Throw away old meat.  Apparently, the lines have gotten too long lately and you needed to scare some people away.  I'm gone, until you need me again.", "author": "Nick B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-21", "description": "Being a generic Geary street Russian I've been coming to this gordos since I was 14 , 22 now and nothing has changed, it's as good today as when I used to skip 5th period at wash to get my Super Steak W/everything fix. 95 % of the time it's good and hits the spot, once in a blue moon I'll get a dried out tortilla or not enough of a certain ingredient. Gordos isn't El Farolito, it's a different type of burrito, more wet ingredients, I would love to go to the mission for a great burrito but let's be realistic I'm an avenue ruskie and my Armani jeans and leather jacket don't fit in there, so gordos thank you for providing me with 8 years of memories.", "author": "Sergey A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-03-20", "description": "I pretty much never give negative reviews ...\n\nso this is the only location of gordos I've been to. the first time I went was last year and I thought it was bomb. \n\nI've been going to gordos recently because it's close to my gym. don't judge, after a workout the black bean and chicken taco is perfect for refueling! anyway, I don't have that many bad things to say. the taco gets the job done. the chicken isn't dry like some places and I basically love anything with sour cream on it. \n\nthe problem I have is 2 specific employees working there. it's so weird. they are rude, but in a subtle way. \n\nit's like, \"WOULD IT KILL YOU TO SMILE!?\" I want to scream at the woman taking the money. I'm sorry you hate your life, but I didn't choose your job for you. \n\noh, and the guy making my food? ... this is usually how the conversation goes:\n\nhim: -staring at me blankly\n\nme: \"chicken taco with black beans please\"\n\nhim: -turns around for 5 seconds to put my tortilla on the grill\n\nhim: \"what kinda beans?\"\n\nme: \"black beans\"\n\nhim: -speaking over me in spanish to the cook\n\nhim: \"what kinda beans?\"\n\nme: \"black beans\"\n\nhim: -again speaking over me in spanish to the cook\n\nhim: \"what kinda beans?\"\n\nme: \"BLACK BEANS!\" \n\nand I'm not exaggerating, this actually happened. so fucking ridiculous. I shouldn't keep going back, but there aren't many taqueria options in the richmond. grrrr.", "author": "Leslie S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-04-07", "description": "People who come to Gordo's usually either find it bland or great. I, obviously, am in the great camp. \n\nI'm a chicken super burrito kind of person. I pretty much order the same thing no matter what mexican place I'm at. When it comes to the Richmond, let's be honest - there aren't a lot of choices. Gordo's consistently delivers warm, moist super chicken burritos for not a lot of dough. You can also order different tortilla or call ahead and pick it up. (Recommended if you are in the after work crowd)", "author": "Astrea W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-09-03", "description": "Yum yum and yum. I'm actually mad at my roommate for introducing me to this place since it is on the other side of town. Fresh delicious homemade burritos for a GOOD price! Pretty much like a healthier and more delicious Chipolte.", "author": "Jenny I."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-05-11", "description": "Believe it or not, but my Rabbi turned me onto this place. The Carnitas are to die for, and one taco is all you need to feel well fed. the food is great and the portions are HUGE for not much money at all.", "author": "Thomas E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-08-20", "description": "Gordo is the spot for burritos in San Francisco.    I started my relationship with Gordo 7 years ago when I first moved to the city and found myself in the Richmond.   I happened upon Gordo's my first week in town and have never looked back.   I moved away from the hood for 5 years, but now I'm back and have hit Gordo's twice in as many weeks. \n\nPersonally I recommend the Super Carnitas burrito.    \n\nBTW - the same people are still working there from 7 years ago....", "author": "Craig D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-09-21", "description": "service sucks and everything is really watery. They keep all the meat and beans in a pool of liquid of some sort, looks gross. normally they cook burritos in front of you but this place they just place the foods that are kept warm for god knows how long into your meal.", "author": "Jack L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-03-15", "description": "You cannot compare this burrito to a Mission burrito. But its in the Richmond, and they are reasonably fast. Two recommendations: \n\n1) Get some Chorizo!\n2) Don't make me watch you put the burrito together!", "author": "Gary B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-06-02", "description": "This is my default taqueria. The burritos are descent sized, they have pinto, black, and refired beans for those of us who like to switch it up, and their hot sauce is pretty bomb. The carne asada burrito is my fav. However, their salsa is only mediocre and their carnitas suck. And I wish they would use shredded cheese instead of sliced. \n\nAll in all I give them a B+ to an A-.", "author": "Nicole T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-10-16", "description": "Gordos is an excellent value for people who want something decent on the cheap.\n\nGet the super Buritto for around five dollars, and be full without the stomach pain other fast food offers.\n\nIt's a no frills restaurant with minimal indoor seating but who cares? It's a bargain in a city where ten dollars or more is frequently the case.\n\nI'm a vegetarian, so I can't speak for the quality of the meat, but occasionally the food gets old sitting in the tubs, so try to time it if you can :-)\n\nEnjoy!", "author": "Jonah R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-01-26", "description": "Gordo Taqueria.  What can I say ?  Service, or even a smile, completely non existent.  Food quality, standard, nothing stands out.  The clincher, no complimentary chips and salsa.  Not recommended, the good reviews are probably by people that a) never had a burrito before, or b) love bland food served by unfriendly folks.", "author": "Mark W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-06-28", "description": "Large , yummy burritos that hit the spot. My only complaint is that they do not have chopped onions and cilantro on the side- only in the salsa. The service is quick and generally friendly. Great for grabbing a bite on the go.", "author": "Melinda Q."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-10-03", "description": "Ok food, but the guys are jerks. Second time my burrito had \"BTCH\" written on it. (And no, there were no confrontations, disagreements, etc. when ordering. I think they just think it's funny.) I know they would say \"Beans, Tomatoes, cheese\" but the nicer guy at the register actually crossed it out and wrote \"BB (black beans)\". Anyhow, it bums me out when people are jerks for no reason. Won't be going back...", "author": "Kristy H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-11-12", "description": "mmm not so much.\n\nconsidering that the best mexican food in the city is a 20 minute bus ride from my house, i guess i might be back if i'm feeling really desperate. but, considering that i have lived in this neighborhood for a year, i crave mexican food everyday, & have only been here twice, i'm just not THAT desperate.", "author": "Lizzy L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-08-04", "description": "ok the food is good blah blah blah.. Customer service is also important and that fat dude there doesn't have one. When i get my lunch there i always make sure i go to the guy on the end coz he's more reasonable than that customer hatin fat guy.", "author": "Eddie 'bhong' V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-01-04", "description": "Whenever I go back to the city, this is one stop I have to make. I usually get the carnitas quesadilla and it is sooo yummy! Gordo's is my favorite place to satisfy a craving for mexican food. You'd think I'd be able to find a comparable place in socal, especially with santa ana being right around the corner but not yet, I'm still searching. In the meantime, I'm going to have to keep finding excuses to make the 400+ mile drive to the city just so I can drop in here.", "author": "Jen C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-09-06", "description": "Right around the corner from my home, so this Gordo's is very convenient. But, alas, the burritos are so bland. Where's the flavor? Now my favorite place for burritos is El Farolito. I've been going there for over 25 years and their flavor is \"home\" to me,whether it is the 24th & Alabama shop, the Mission and 24th site or even the  Grand Ave shop in South SF. The taste is tconsistently goodl. But, I don't always want to get into the car to go across the City, so, yes, I will walk around the corner and buy a Gordo's burrito on occassion. Sorry Gordo's I wanted to like you, but you've got to improve on the flavor!", "author": "Sarita E."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-02-28", "description": "This place looks dirty and I always feel dirty after eating here, but they make a good burrito so I keep coming back...", "author": "Bucky K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-07-20", "description": "No a bad spot if you live in the hood, would not go out of my way to eat here, but  also would not go to across town to get a burrito either. All in all it is what it is; quality cheap eats..", "author": "Vince S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-09-14", "description": "good average burrito. i would come here since it is near by. slice of melted cheese on tortilla, beans, salsa for their veggie burrito. bag of chips extra. this sort of reminds me of chipotle but slightly better. slightly.", "author": "AL S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-03-07", "description": "The standard bearer in good super burritos. They're consistent, and they're good, and for this Sunset native, worth not having to drive to the mission. Every time I go, it makes me sad that they use some processed guacamole. But that's forgivable, because they make good burritos. The other thing that makes me upset is they don't give you free chips. But that's forgivable, because they make good burritos.", "author": "Drew Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-03-13", "description": "I like this place because it's close to my house and it's fast GOOD food. The only problem is that sometimes when ordering they can't hear you so it gets pretty repetitive. Most of my guy friends go for a super burrito, so if you're a big eater get one or two of those. I get a regular, it'll last me a good day. I finished mine at home and I craved some more. So thumbs up! But of course if you want more of a selection go to the Mission...", "author": "Kimberly S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-11-06", "description": "gordo's will always hold a space in my heart\n\nit brings back memories of when i used to attend St. Monica's.\ni always get the super burrito with spinach tortilla.. usually carne asada (what can i say.. i'm a carnivore).. and with everything and anything they can put into it..\n\nwhen i went back recently, it wasn't as AMAZING as i had remembered..\nsigh~\nperhaps it was my burrito naivety.. or perhaps it's taste changed.. \nbut all in all..\nan OK burrito", "author": "monica c."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-09-15", "description": "If I didn't care whether I resembled a hippopotamus I would eat here every day.  I have been coming here forever (starting with the one on College Avenue in Berkeley when I was in junior high).  It is the PERFECT HANGOVER FOOD - much better than greasy leftover pizza, or even my usual Balboa Burger and bloody mary.  I usually get a gigantic super burrito with tons of melted cheese and boiled chicken (don't get the grilled, trust me), but most of my friends get the quesdadilla (which is basically a burrito because you can stuff it with everything).  I make it out here at least once a week from Russian Hill (a half hour trip on a good day).  It is that good.", "author": "Liz C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-04-22", "description": "I feel like anybody who has ever dissed this place has not tried the Carnitas.  Carnitas= 5 stars  Minus one star because the chubby worker guy seems to hate my sister and I.", "author": "Marisa M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-11", "description": "4.5 stars. Really good burritos and 'dillas", "author": "Kacie M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-08-21", "description": "That's right, I'm giving 5 stars to a taqueria.  I can't believe I didn't rate this place sooner, it's one of my fav places in the city.  I've been going here for 11 years...that's more than half of my life people! In these years nothing has changed, not the awesome burritos, not the decor, not the people.....i realize this actually sounds bad, but I think they have a formula for success. Why fix what ain't broke, right? Everything is always fresh and made just like I love it.  My granddad hates mexican food and even he can't turn down a Gordo plate, and why would he? And why would you? And why haven't you gone there yet?", "author": "Aristocles P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-03-09", "description": "Don't go anywhere else for burritos. I lived abroad for three years and probably missed Gordos over everything else. Get it done and go to Gordo's if you are in the market for one of the world's best burritos. Know how some burrito places have cold ingredients inside the warm burrito? Not Gordos. Know how some places have too juicy meat that makes your tortilla worthless? Not Gordos. Know how some places overcharge you for just a rice stuffed tortilla. Not Gordos. I could go on and on...", "author": "Kane R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-05-04", "description": "Chicken is not vegetarian. I don't care what the guys who work here say -- chicken in my burrito is not a vegetarian burrito. Not once, but twice I have ordered a vegetarian burrito and they put chicken in it. One time when I complained they immediately made me a new one. The other time, the guy making the burritos said \"well, it's not meat like carnitas or anything.\" Okay true. Chicken is not as \"meaty\" as steak or pork, but it's still from an animal and I didn't want it. And once I got the veggie burrito, it wasn't that great. With all the other burrito places in the city, I'm not sure why you would go here (other than because it's the closest one to you).", "author": "Rebecca H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-12-15", "description": "The burritos here are OK.  They're decent sized and come with some solid beans and nice.  After that, I can't name too many positives.  The staff is so preoccupied with muttering to themselves you have to tell them \"chicken burrito\" three times.  And while I appreciate the speed, I'd rather have a wider range menu.", "author": "John H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2005-12-30", "description": "as expected there will be much debate over the \"best mexican food in the bay area\" but this is the horse i am riding to glory. gordo is understated and no-frills and the food is off the chain. i've never gotten anything i wouldn't order two of next time. once, while tipsy, i ordered my favorite burrito, inhaled it on the way home and then my stomach promptly rejected it. so, i did the obvious thing and marched back down there and bought another one which stayed firmly lodged in my corpus and sent me to shangri-la. hooray for binge eating!!\n\naffordable and delectable; this is everything i want in a burrito|mexican spot. i am going to have them cater my wedding and then i will get divorced so that i can do it again.\n\nand as for the clowns who complain about the 'service' - give it a rest. it's a cafeteria-model burrito joint, there are no sommeliers, no chefs in white hats and no maitre'ds. you order what you want and you get it and sit down and stuff your face. simple, easy and satisfying.\n\nmenu tips for the challenged:\npollo blanco in your burrito\ncarnitas quesadilla - corn\n\np.s.  refried beans are demon spawn\np.p.s. don't go to a burrito place for chips, go for the FOOD", "author": "W G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-02-03", "description": "This place actually has good sized burritos with good quality tortillas. It's convenient, and not too expensive. The downsides are: the service quality isn't too good. The staff just seems lazy sometimes, but they're okay. Also, the menu is somewhat limited (no nachos for example). Also the place is usually kinda dirty looking inside. Slightly expensive for a taqueria, but not bad. I'll keep coming here due to convenience and the good taste.", "author": "Aleksey Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-02-27", "description": "Best burrito in the city - super carnitas and grilled chicken for sure. I ran here from the marina the other night after being away from the place for 24 hours - couldn't help myself. The big guy behind the counter is super unfriendly and skimps on meat, so try to get Carols (with the SF hat) at all costs. The big guy also spends quite a bit of time in the bathroom, which is sketchy.", "author": "Michael D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-04-11", "description": "Burritos are O.K., but any other day, a trip to the Mission is far more rewarding if you're looking for huge, tasty, cheap (super) burritos.", "author": "Richard D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-09-06", "description": "I guess it isn't all about how the burrito looks right? Just as long as it taste good. Anyways my burrito was not even round the guy did not roll the burriot well enough! It tasted good though. I love the grilled chicken. They do not put enough cheese. Bad service, but I guess it does not really matter. Or does it.", "author": "Janet Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-09-06", "description": "i didn't like burritos until gordo's. then i loved it. then i ate it. every.single.day. my boyfriend and his mom frequent this location in particular. they don't cook so it's gordo's maybe 3 times a week and they buy enough so that they don't have to go a day without it. (i'm not exaggerating. well not exactly, anyway.) i don't like wet burritos. if you do, this isn't really the place for you. get a super. and guac. and pico de gallo. \n\nexcept. the service is just... okay. there's one guy in particular who gives us the smallest burrito ever. i've observed - it's just us. i think he hates us. no, really. i think he does.", "author": "Mel L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-07-08", "description": "This is my first time writing a review on Yelp, but let me tell you I came on here JUST to write that Gordo's makes the best burrittos I have ever had HANDS DOWN. I love the super burritto with guacamole and sour cream. Its HUGE and its yummy.", "author": "Anna T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-03-31", "description": "My favorite burrito in San Francisco.  I can't tell you how many times I've come here.  Used to come here once a week.  Now not as often that I moved farther away, but I still make the drive!  Worth it.", "author": "Scott C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-05-19", "description": "By far, one of the better tasting taqueria's in the city. But, sheesh, everytime I go here (and I grew up eating at the place on Sundays) they could never get me the correct pricing. Sometimes my final price included tax, other times it did not. So, what am I supposed to pay anyway?!", "author": "Jj H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-07-07", "description": "So after deciding that it's going to be a Gordo's night, my boyfriend and I then have to argue about which one to go to.  Since he usually pays, we usually go to the Clement location, but this one is my favorite.  I'm consistent, so it's almost always the super carne asada with extra hot sauce.  The seasoning on the steak is licious and goes really well with the fresh guac.  It's reasonably priced, you're in and out in under 10 minutes on moderately busy days and best of all, I usually have enough for two meals.", "author": "Jasmine L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-01-03", "description": "OK -- I really want to love this place - go about once a month - but I always come away feeling it is pretty bland and tasteless.  I will keep going back because it is fairly close and not terrible.  If I have the time I drive to La Taqueria in the Mission -- blows this place away.", "author": "Phil C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-13", "description": "I'm Mexican I normally hate this kind of places. Burritos are not real Mexican food people!!!!! Well my boyfriend wanted a burrito so we went in. I had my cute puppy with me and they said it was okay to let him stay while we ordered. Most places make us take him outside (meanies!). They asked me why I wasn't getting anything I told, how many Mexicans actually eat burritos? They laughed and agreed. They told me to try it anyway, so I agreed. It was pretty good. I'll never be a fan of burritos, but if I had to pick, this is the only place I'll eat them from.", "author": "Salma L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-08-07", "description": "I wouldn't come here if I didn't live in the area.  That being said, it's a pretty decent burrito but I wish they had more salsa choices.  I end up going home and piling on more of my own jalapenos and hot sauce...Don't get the guacamole.", "author": "Derrick V."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-03-10", "description": "I had the carnitas.  The tortilla is processed and cold.  I want my tortilla warm and grilled.  The burrito didn't have any complexity.  It was just mushed ingredients that turned the tortilla cold.  I ate it once and I won't eat it again.  Sorry Gordos.  Plus parking here is a biatch.", "author": "Fatty A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-05-28", "description": "I'm sorry, Gordo's!! I've heard such great things about you, but that burrito just didn't hit the spot.", "author": "Audrey T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-10-06", "description": "This Gordo's is my roommate's favorite burrito place.  Whenever we go up to SF, she wants to stop by.  I've been to it twice thus far.  As a vegetarian, the selection can be fairly slim but you definitely get your money's worth since it's inexpensive and quick.", "author": "Lloyd C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-05-10", "description": "granted this isn't REAL authentic mexican food, but it sure hits the spot when you're having a major burrito craving.  usually i get my super carne asada on spinach wrap w/ black beans and everything on it.  SO GOOD !  this location seems to make their stuff better and are more generous with their extras than all the other gordo's that i've been to in the city.  no complaints here.", "author": "Jeannie W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-03-16", "description": "Great fast mexican food! I love the carnitas quesadilla with rice beans, guacamole, sour cream, salsa, and hot sauce. Delish! Big portions that it's almost impossible to finish everything in one sitting. I am sooo lucky that it's right on the corner of where I live!", "author": "Cynthia S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-09-01", "description": "great food, clean, decent service. I highly recommend the gordo plate to make your own tacos!", "author": "renee m."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-03-11", "description": "Bleh,\n\nThe burritos aren't even that good, and the guys who wrap the burritos don't wear gloves.  They keep cleaning up the counter with a dirty wet rag that looks like it is teaming with bacteria, and I'm surprised that I didn't get food poisoning.  Seriously tho, how come they don't wear gloves when wrapping my burrito?  Isn't that a health code violation?\n\nAlso, the burrito itself was flavorless, and there was noone cooking meat in the back to indicate any freshness whatsoever.   Like Taqueria Pancho villa in the mission much better! On  a positive note tho, the prices are cheap!", "author": "Michele Y."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-02-04", "description": "Wow. There is an apparent rivalry between local Mexican places Pancho's and this excuse for food. I think I know who wins. The burritos are awfully dry and tastless, as well as long lines for the food. I have heard nothing but praise about this place, but it is not good at all. No sour cream without asking ... WHAT? Avoid this place AT ALL COSTS", "author": "Samantha W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-02-16", "description": "I went to this joint on a recommendation from a coworker.  She definitely put way too much hype on it, cuz this place was kinda on the sucky side.  I got a carnitas super burrito, and was not impressed at all.  The biggest flavor I tasted in the burrito was that of salt.  Not that the food was over salty, just that there wasnt much of any other flavor--just NaCl.  My overall feeling is that Gordos is a place to get a boring burrito, and I'm trying not to do that anymore.", "author": "Peter N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-03-22", "description": "This is one of my favorite taquerias in the city.  It's one of the best burritos I've had in SF, simple and straightforward ingredients.  The super burritos are huge, so if you get one don't plan on doing too much afterwards.  The real gem here is the carnitas.  It's some of the best in the city. If that crack-like pork is your thing, this is heaven.", "author": "Brian S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-05", "description": "Got the regular carnitas burrito, and even with the hold on the rice, sour cream, and guac, it still ended up being a very filling burrito.  They were quite generous with the beans, which I had to scrape a lot of it out.  For some reason, the burritos from this location is always so greasy by the time you get down to the last bite.", "author": "Lisa C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-02-21", "description": "This is the best deal in the bay area.  Please don't bother to look any further.  You can get full on beans, rice, salsa and meat  for under $5.  They don't do fancy here.  If you need a salsa bar with 20 choices so you can fill up a bunch of little plastic cups then feel free to spend $10 somewhere else. \n\nYou can't go wrong with a gordo plate, burrito, super burrito, quesadilla or taco.   They all pretty much use the same ingredients yet somehow manage to taste different.  If this was ebay I'd say A+++++++++++", "author": "Joe M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-02-21", "description": "I am not a huge fan of Mexican food but I like Gordo's.  Ever since elementary school, I've been going to Gordo's (at the Clement location and then Geary when they opened this one) for their cups (basically rice, your choice of meat and beans, and the usual fixings of salsa, guacamole and sour cream).  I always get it with rice, grilled chicken, salsa, extra sour cream and extra hot sauce.  Of course, it was cheaper and bigger back in the day.  Nowadays, it costs about $1.50 or so, but it still makes a cheap and tasty afternoon snack.", "author": "Katelynn L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-10-30", "description": "There is nothing fancy about this place - basic seating, simple cheap menu - that's it. The food is ok, but I have had better. If you are in the need for a quick burrito at nearly any hour of the day, this is a good place to go.", "author": "Victoria K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-12-23", "description": "Outside of the Mission, there's no better taqueria than Gordo's!  I love their super burritos, as they are hearty, yet cheap (less than $5).  My favorite is their carnitas, though their carne asada and been and cheese are awesome.  Can't go wrong with this Richmond district taqueria--even when I didn't live in the neighborhood, I'd trek out there for their burritos and salsa!", "author": "Marie B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-02-08", "description": "Cheap and yummy, great for a quick fix after work!  The quesedillas come sloppy if taken out, but tasty none-the-less.", "author": "Grant B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-05-03", "description": "Fatty Taqueria..(Gordo means Fatty hehe) is one of my fast food greazy faves.   \n\nI used to go to the one in Berkeley on college avenue everytime I needed a quesadilla or crispy taco.  SO GOOD.\n\nThey don't have much selection..not a lot of confusing salsas w/mango and stuff in it.   \n\nThis place is fried tortillas w/meat and that's it.\nGreasy, crispy and OH SO GOOD.\n\nThe best things to have here are the chicken corn quesadillas.\nI can never choose between boiled or grilled chicken.  They both have their own distinct flavor.  \n\nThey put the tortilla on the grill w/a big slob of cheese and let it crisp up.  After that..they slab on a big mound of chicken, add some garnish of salsa..wrap it up in wax paper and put it on a plastic mesh tray and hand it to you.   For 3-4 bucks!!!\n\nGetting 2 of these crispy quesadillas plus a drink is a great fast food fav.   \n\nI've never seen an empty Fatty's Taqueria in all it's locations.\n\nAs far as ambience...just some bench seats, a big single bathroom that makes for interesting stories that I'll leave out, and a LOT of bradman patrons who love grilled, fried..greasey food.   \n\nThis must be the closet haven for the Bradman patrons who masquerade as liking sushi or dimsum across the street w/their dainty yuppee girlfriends, and then run off in the late night to \nget their heavy greasy meat fix!   \n\nThey tear off their forced GAP blue button shirts and put on their oldest, dirtiest t-shirt and relive their single pasts!!  \n\nI see those guys here ALL THE TIME...and they look like they're in hiding!!\n\nOH and if you're a pretty girl...of the blonde persuasion....be prepared for the staff to give you looks of lust as they prepare your food.\nComes w/the territory.  =)", "author": "Michael L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-09-29", "description": "I can only give four stars - because my five star ratings are reserved for the truly outstanding.  However if it was at all possible... I would give this place four and a half stars.  I have never been disappointed here.  The burritos are immense and often serve as two meals.... and consequently two poops - yay poop!  One down side to this place is that they charge for chips and salsa... I have to say that's not very Mexican of them.  Every taqueria in my experience gives free chips and salsa... so I say that it seems a bit stingy, especially since their chips are nothing to brag about.", "author": "Sadie K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-04-28", "description": "couldn't be less impressed. I live in the area, and  I wonder if the people that make this 'barely-an-excuse-for-Mexican-food' are catering to the surrounding demographic...NOT as much to a person like myself who grew up on SDiego Mex food....This food was awful. Wait-staff was lame. How do you F up a quesadilla? answer: you don't melt the cheese sufficiently and have lame pico-de-gallo on/it it. didn't even finish it--couldn't justify the calories for lack of taste. Wow- I'm feeling testy today, eh? Anyway--best mexican food is in San Bruno...", "author": "Bing B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-04-25", "description": "My backup Gordo's location when parking on Clement is impossible, which it usually is. Love it that there is two close by, and no need to travel to the mission for a fat, tasty burrito. \n\nThis location has more seating, which is not hard since the other is more of a place to pickup a burrito and eat elsewhere. Bathroom too if you feel so inclined to drop that five pound burrito after you quickly inhaled it.", "author": "David B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-07-07", "description": "All I have to do is look at the guys behind the counter and realize that is what will happen to me if I eat here every day....nevertheless...it's OK in a pinch ...always happy to flirt with the boys in here - which is good for the ego at my age...", "author": "Sue U."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-09-19", "description": "When I want something hardy and filling, burritos are the answer. This place is located on the busy street of Geary where parking is difficult. I recommend either walking or taking the bus here. The cost of parking is 25 cents for 10 minutes if you find parking. I usually get my burritos to go but there is a seating area if you wanted to eat in. I like the burritos here. I usually get a super burrito with everything on it. They steam the tortilla with a slice of cheese and then add the meat, beans, salsa, guacamole, sour cream, and some spicy sauce on top. They wrap it up and it's ready to go. I usually can't finish a whole burrito myself, so I eat now and save half for later. Sorry, no free chips on the side, they charge 55 cents for a small bag of chips.", "author": "Candace F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-11-12", "description": "I'll give it four stars for the carnitas tacos alone.  I stay away from the burritos.  I had initially written off gordos because I had only tried the burritos, which leave much to be desired.  I grew up in San Diego and use to live in Mexico, so I consider myself a pretty good judge of Mexican food.  And while I am well aware that burritos dont count as real Mexican food, there is still an art to a good burrito.  So, why the 4 stars? The carnitas tacos are pretty close to authentic - minus the beans and sour cream. It is possible that I have just been living in Northern California for too long (2 years now) and my highly refined taco taste buds have lowered their standards.  That being said, I still enjoy gordos carnitas tacos.", "author": "Maya S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-12-07", "description": "I grew up in the avenues and OMG, I would seriously eat here 3 or 4 times a week.  Love the place\n\nI dare say better than any burrito place in the Mission", "author": "Robert T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-07-26", "description": "Gordo's serves up one tasty burrito, for the Richmond that is.  Service is not the friendlist and they can be a bit slow.  Sometimes you have to tell them what you'd like two or three times.  When compared to the mission, Gordo's burritos are smaller and a bit more pricey.  Oh, and chips are extra-can you believe that!  In the end, I guess it is all worth it considering I live in the Richmond and it's the only taqueria around.", "author": "Monica L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-07-15", "description": "I like Gordos. Yeah, it might not be the most authentic Mexican burrito restaurant but I like their burritos.", "author": "Roger C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-04-07", "description": "I've been going to gordos for years! I usually get a burrito or quesidilla and its always good! Theirs different choices of wraps such as spinach, tomato, flower, or corn. I like their grilled chicken or carne asada meat. I also love the jarritos drinks. The same people have been working their for years, so sometimes they hook it up with extra meat or a free bag of chips.", "author": "Angela C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-10-07", "description": "One of the best burritos around. The Super Chicken never disappoints, my only complaint is these guys don't understand 'andale'. Rigamortis can set in before you get to order when its busy. Also, speaking of when its busy, good luck getting a seat.", "author": "AnonE M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-07-19", "description": "very average bland, burrito.  has all the right things going for it beans, rice normal option of meat, but some spice in the meat or something is definitely missing.  just tastes realllllly bland and i finish it feeling full, which is good.  it's cheap as well.  but chipotle's barbacoa burrito has 10 x the flavor with their lime cilantro rice, very well seasoned meat etc...", "author": "Ryan K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-05-07", "description": "I have a lot of good memories eating burritos with friends at Gordo's.  I don't know if it's just me, but they always pile on a little more fillings at this place over the other locations.  Although this place isn't exactly authentic (I've had some friends tell me that putting tortillas in steamers is sacrilege), I still find their burritos tasty and more than filling.  I also love the flour quesedillas, even though they really pour on the oil, the result is a crispy, flaky tortilla that tastes great with all that melted cheese.", "author": "Tony L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-10-15", "description": "Ah Gordo's...back in the days when I was a teenager, before I had status and before I had a major...I first stumbled upon Gordo's on College Ave. while attending Cal.  I used to bitch to anyone that would listen that La Burrita was crap (and they would listen because I was from Santa Barbara), but Gordo's was tolerable.  I didn't even know they had multiple locations till a few years ago.\nFast forward a few years, and I've come to terms with the state of Mexican food away from the Mission and SB.  Gordo's is good.  Not as good as the taquerias in the Mission, but it's a good burrito that'll fill you up for not much money, plus I can walk to it in under 3 minutes when I'm really hungry.  One thing I have to say for Gordo's is that they're consistent, Gordo's on Geary is the same as Gordo's on College, Clement, etc.  Don't come here for their tacos or nachos, but take home a chicken burrito and have a cold Negro Modelo ready and you're set.", "author": "Mike U."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-07-03", "description": "Stuck down on Geary Blvd.? Gordo is a decent and reliable taqueria. Decent because they have a simple selection of burritos, quesadillas, and gordo plates. Reliable because they're a reputable chain. Their Beef Quesadillas are a standout.", "author": "Leroid D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-09-14", "description": "It's not just that this place is 3 blocks from my new house but the food is simply the perfect comfort food for borrito lovers. The service could use a little personality and warmth but it's the food that really matters here. The line can be a little long at times but it's definately worth the wait and the prices are perfect.", "author": "Gabriel R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-10-14", "description": "The most reliable, affordable and satisfying burrito joint that you'll find in the Richmond (there really isn't much competition though, honestly.) Good portions and a no-frills eating experience, and at the very least it saves you the gas/bus fare/time of heading to the Mission to satisfy the craving for a burrito carb overload.", "author": "Ramon T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-09-28", "description": "I have a few SF native friends that love this place. I either went on a bad night or I really am just that cranky. I had the super burrito and it was wet, wet, wet. Yes it was the size of a small child but it drooled like one too. It was just to messy. I like my burritos wrapped up tight and packed with goodness. I'd much rather go to the Mission for a burrito. Maybe one day I will come here again and it will be a better day.", "author": "Alia D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-06-27", "description": "My favorite is a Pork-chile verde quesadilla with rice, salsa, guac and hot sauce!  Yummy!  I love their green hot sauce...it's spicy!  It's kinda hard to read the staff's mood, though.  I've been going there since they opened and some days they are friendly...mostly they aren't.", "author": "Marie E."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-07-30", "description": "Pretty standard, but solid burrito from what I can recall. I'm a Mission burrito kind of girl, but the ex took me here ages ago, he's a local so I figured he knew a little somethin somethin about burritos. Nothing to write home about, since Philly doesn't know a burrito from a chilaquile.", "author": "Colleen B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2006-08-18", "description": "I walked into this place and I immediately knew that I was in for an unsatisfying meal.  I knew it was a chain ( i have nothing againts fast food chains) but my bf who is into cheap and filling cuisine thought this place was great the first time he ate here.  So of course he wanted to take me there.  Never again will I eat here....i had a super burrito and it was the biggest and blandest burrito i have ever had.  I can't believe they have the nerve to give you a large amount of awful food.", "author": "Maria B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-02-08", "description": "Delicious carnitas burritos, especially with the refried beans.  The other locations are rated okay...only because they don't carry the good stuff - the refried beans makes it tastier than ever!", "author": "Lisa C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-07-03", "description": "I ate a quesadilla there, which they bake. And if you don't mind it being a little oily and messy, then your in for a treat.  It literally melts in your mouth.  I crave their quesadilla's and would drive 20 minutes away just to have it.  Now I found out they have one on 9th Ave., and it cuts my drive in half.  I have to eat this place once, if I'm home for the weekend.  It is THAT good.", "author": "Peter K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-09-19", "description": "i'm from san diego, and we take our burritos rather serious down there.  gordo's is not a san diego burrito spot, it's a bit different.  \n\nthey use fresh ingredients, and serve you up a fat burrito real fast. you walk out of there $7.00 less in your pocket but 1lb more in your stomach.", "author": "Ameer N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-11-03", "description": "Nothing really great; nothing really bad.  Its always crowded but I'm chalking that up to the fact that there aren't really any other burrito options out here.", "author": "Nora B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-01-09", "description": "Yeah, it's a solid burrito.  It's not the best, but I often crave it.  Gordo would get 4 stars for the burritos, but having to pay for add-ons is so annoying.  So...3 1/2.  But I take off a 1/2 star for the burrito dude always making us feel like we are imposing on his futbol watching.  Be friendly, bro - there are worse things than people throwing money at you to eat your food.", "author": "Louis M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-05-20", "description": "Gordo's is pretty friggin awesome! Fresh ingredients, tasted good and I didn't get mud butt. This make it 5 star mexican food!", "author": "Dan M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-12-11", "description": "I think it's a hit or miss sorta place. I've eaten it in the past in the Sunset as well as in Albany (?) and it wasn't bad. Big burritos, good quesadillas. But they may have gone down in quality.", "author": "Gina R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-04-28", "description": "ate there today. the beef is great! i have been going to gordo's since i was a kid. the quality hasn't changed. the prices haven't changed. the only difference now is the staff. not as friendly as they once were. Still go there twice a week at least. lol", "author": "Arthur S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-06-21", "description": "Definitely not the best Mexican in the city, but it meets my needs. Food was good and cheap, but simple.", "author": "Jen L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-05-30", "description": "Chicken super burrito hits the spot right after a good work out at the gym. I got free chips n guacamole and geez the service is great! I ordered my burrito in spanish and then one of the workers asked me why i had a cubano accent. ancestry rules when speaking spanish lol We had a good convo while i was waiting for my order. =]", "author": "Jason C. J."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-01-08", "description": "Let me tell you. This place is delicious. Absolutely yummy. I love when the burrito is juicy at the end. The sour cream and guacamole mix together with the beef and bean juices....delectable. \n\nHowever,\n\nI was sick afterward. Like my stomach hurts sick. Ay Gordito, why did you have to ruin a good thing with bacteria issues?", "author": "Niya M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-05-08", "description": "This is an institution in SF. When I was a in Middle School we would go to Gordos and get a stake/rice/sour cream bowl. Wow, I don't think I could  hack that today, but what the heck. There Gordo Borritos are just that, FAT. They pack more into a tortia then I have ever seen. Gotta Love It.  I only wish it was more centrally located, with out a car this place is way out for those that live in the Mission or anywhere on this side of the Sunset.", "author": "Susannah M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-03-01", "description": "Best burrito for the price in the city.  Everyone I've taken here has gotten wide-eyed and overwhelmed with the goodness that is the super carnitas.", "author": "John R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2006-08-20", "description": "A major part of burrito consumption is the food coma. Any good burro should be large enough to induce a catatonic state in an ex-NFL lineman. Guess ol' Gordo hasn't heard of that because all that happened here was I got pissed since I left hungry after plunking down 6 pesos. The personnel department should also be notified that it doesn't take four people on the assembly line, especially to shit together some wack-ass food.", "author": "Robert K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-02-13", "description": "Gordo is not the best taqueria in SF but it is certainly one of the better spots outside of the Mission and is, in my experience, the best in the Richmond (that's not saying a whole lot though!).  I end up here at least once a week because I live nearby. What the food lacks in overall taste it makes up with in consistency.  The prices are reasonable and the menu is pretty flexible.  There are the usual meat choices (a bonus is that they will let you do half one meat half another), three bean choices, and wheat or spinach tortilla choices.  One tip: ask for jalapenos.  It's not on the menu but for an extra 25cents, it adds a nice kick.", "author": "Rishi K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-07-22", "description": "I love their burritos-its tasty and fresh.  \n\nthe line sometimes gets long but it moves quickly.  I'm sure there are other places that are better but none more convenient and affordable.", "author": "kenny l."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-06-14", "description": "Definitely not what I expected from a taqueria anywhere in San Francisco, but this is the Richmond.  That being said, the food is OK.  I like there salsa.  The hot is hot, not at first, but it kind of creeps.  I've had the veggie burrito many times, (I'm in the area and hungry often...).  It is almost the only choice for mexican food in this part of town, so if you're craving, make due.  Sometimes I'm actually craving mediocre mexican food, something comforting about it, and I go here.  Sound weird?  The service has jumped back and forth for me, sometimes treated well, sometimes just the opposite.  They do have extremely busy lunchtime rushes though, so I never take it personally, I'd probably want to escape too after that kind of rush.", "author": "Jayson J."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2006-08-07", "description": "I live a few blocks from Gordo on Geary and have been eating there for about 5-6 years. The ONLY reason I go is a. I love taquerias and b. It's the only game in town (walking distance, that is).\n\nDeep down, as I munch away on my 2nd or 3rd burrito or quesadilla that week, I can't help but get angry. After patronizing the same place for as long as that, not one employee evinces a spark of recognition or memory for me or what I almost always order. My roommate thinks I'm nuts for even noticing, but I guess his expectations are lower. Actually, it's not even that I have high expectations. I'm actually shocked. \n\nIt seems to me that as an employee you would have to go out of your way to pretend you haven't seen the same customer come in time and time again. So really, maybe I'm more shocked, even impressed that they could carry on this thing for this long. \n\nAs to a previous review, I'm glad I don't speak Spanish.\n\nAs a guide to the uninitiated, here's a sample dialogue for ordering at Gordo:\n\nWorker: Help you.\nMe: Hi, could I get a super carne asada with black beans and hot sauce, no guacamole to go?\nW: No response, but steams tortilla for a few seconds\nW: What kind beans?\nM: Uhh, black.\nW: What kind meat?\nM: I want a super carne asada with black beans and hot sauce, no guacamole to go.\nW: Hot sauce?\nM: YES.\nW: Sour cream and guacamole?\nM: No guacamole.\nW: For here or to go?\nM: !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!\n\nThis is no exaggeration. Lest you think I'm being harsh, THIS IS THE SAME DIALOGUE I'VE HAD WITH EVERY EMPLOYEE FOR MORE THAN HALF A DECADE. That goes for other locations as well except for the Clement Gordo's.\n\nIn closing, it drives me nuts and I wish a Mission taqueria would come in and shut Gordo down.", "author": "Joe C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-04-24", "description": "BIG TASTY BURRITOS!!! Stuffed very full - good deal!", "author": "Iain B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-01-11", "description": "Simply the best burritos in the Bay Area.  I got into the Gordo habit while in medical school at UCSF, when I went there 3-5 times per week for their super bean and cheese burritos.  I have moved to the suburbs, but still go out of my way to visit Gordo whenever I am within a 5 mile radius in San Francisco or Berkeley.", "author": "Thomas T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-05-31", "description": "The burritos here are excellent.  My BF and I go here about once a week and it feeds us enough to the point where you have to do the unbuttoned pants trick.  The portions are hefty.  Only thing that makes me wonder is why the amount is always something different, but either way that should stop you from getting a bohemeth burrito.", "author": "Diana T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-23", "description": "i love their quesadillas! its the best i've had so far. their burritos are pretty good too! try it with the spinach tortilla. it taste even better.", "author": "B B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-04-28", "description": "the one thing i like about this place is that everything is pretty filling for under $5. \n\nyou can get tacos, quesadillas, burritos, super burritos, and gordo plates (basically do it yourself tacos on a tray) \n\nchicken, beef, chili verde (i don't know what this is), carnitas (shredded pork), i don't remember the other fillings....\n\nthis place is TOTALLY NOT 5 star good eats. its your standard burrito. probably like a chipotle burrito, but not as gringo'ed out. i've gotta admit that the fill ins were not very extensive as far as salsa goes. pretty basic, rice, black or refried beans, couple slices of cheese, and like pico de gallo kind of salsa. it was hard to see the other condiments b/c that tortilla warmer press thing is blocking it, and the people that work there aren't very clear when they speak. they kind of mumble under the noise of the kitchen (unless i've grown deaf from going to too many concerts but i had to ask the guy to repeat himself over and over, sometimes i wouldn't here him, and kind of stood there blankly when he said something.... he must have thought i was annoying... but i seriously couldn't hear him....), but i was pretty disappointed with my NO GLOVE WEARING WIPING COUNTER WITH DIRTY RAG HAND WRAPPED burrito. \n\nits pretty standard for places like these to give you chips and salsa with your purchase.... even just a little. but NOPE you don't get freebies like that from here... unless you eat there often, WHICH I DON'T PLAN ON.... unless i was REALLY jonesin for a burrito at like 9pm, in that hood. \n\noh yeah, one last thing, i asked for some hot sauce, and the guy at the front counter took it out of a squeeze bottle that was refrigerated, it was this green olive color, but it was good homemade hot sauce. that was probably the highlight of my meal. its basically like pureed jalepenos. GOOD STUFF. even tho i was looking for more of a tabasco, tapatio, chalua type hot sauce. \n\ni think dos pinas in soma is better than here.....", "author": "Irene C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-22", "description": "So far, it's the cheapest place where I can get good burritos. The super grilled chicken burrito is my favorite. Good prices, good food, and good atmosphere.", "author": "A R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-03-03", "description": "Well, I'll just tell you what happened. So... I called in my order because I had to be at work shortly. They tell me it will be ready in 10 minutes. I'm there in about 15, and they tell me they don't have my order they can't find it. I'm like ok, it's a veggie super burrito... I start to tell them what it was so maybe it will help them track it down. The woman is obviously not actually listening, and she tells me that she can make me another one. I tell her, \"no thanks, I don't have time to wait, which is why I called it in in the first place\". Then, she says, \"oh here it is\", and rings it up. i grab it and go, get to work soo hungry, start to eat and i discover that all that is in it is beans, rice and cheese. obviously NOT even close to being a super burrito. i can't leave work to go back, can't find the receipt to see what she charged me but I remember it was over 6 bucks (waay to much for beans, rice, and cheese). totally sucked. i have tried gordo's before and wasn't very impressed, but this just sealed it for me. not to mention, they think they're so cool that they can charge for chips and salsa. lame. they're a waste of money, didn't taste very good, and have horrible customer service. booooooo", "author": "C. S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-01-14", "description": "I grew up on Gordo's burritos, mostly at the 9th Ave. location. I've come back to them, but recently everything's been underseasoned and often not hot enough.", "author": "Matt G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-07-21", "description": "me and my folks have been coming to gordos for years, so this review may be a bit biased. we loves it. every time friends come back to town, this is the spot. the prices are decent and the food is great. the chips aren't all that. one thing to take into consideration is who you order from, try to get the old dudes with the hats, they'll make a phatty burrito. The big dude makes em skimp, i think he sneaks food home in his chin flaps. I'm just speculating so don't quote me on that one. Oh and good luck with parking, you're gonna need it!", "author": "buddy p."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-01-14", "description": "tasty but sort of boring.  the chicken in my burrito wasn't spiced all that well and the balance of rice to beans to chicken wasn't all that great....", "author": "Lauren V."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-01-23", "description": "ive been here twice, and the first time the place smelled like a gas station bathroom, and the next time we actually ate there and it just wasnt up to par. for all the praise i'd heard about it, it really didnt live up to the hype. sorry gordo, running out of hot sauce is just not ok with me.", "author": "Sarah C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-04-22", "description": "i used to eat gordos on solano when i lived in albany.  the menu and recipes are the same whichever one you go to.  i love it.", "author": "yayoi s."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-11-04", "description": "AMAZING! Best place in the city for tasty, affordable, huge portions of Mexian food. My fave is the gut-busting super burrito, but anything on the menu is a good bet! I used to live in the neighborhood, gut even now that I live accross the city, I still venture into the Richmond to experience the magic that is a Gordo burrito on a regular basis! Highly recommend it!", "author": "Edwin M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-08-08", "description": "decent food--but man, they are CHEAP. \n\nwhen you order their food, they will SKIMP on the meat. off the menu, you can order a \"gordo cup,\" which is basically all the stuff they put in a burrito, but just watch them, they will put like 3 small pieces of meat in it. if you complain and ask for more, they will charge you an extra $1.50 for more meat, when the gordo cup itself costs $1.75.\n\n\nDONT WASTE YOUR MONEY here. seriously.", "author": "Nathaniel L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-06-15", "description": "first time i came here, the guys were really sweet (they too called me a bonita) and i had a really delicious burrito.  mmmm fresh flavorful beef with some extra spicy salsa.  however, the second time i came with my bf, the service was really bad and the burrito was sloppy and not too appetizing.  overall service is poor in my opinion but the burritos are definitely craveable.", "author": "Amanda N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-10-09", "description": "i would walk across hot coals for this burritto. i eat burrittos every single place i go and this is by far the best place on earth. thank you gordo's every single day", "author": "Annie W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-12-30", "description": "no frills here. simple, cheap and good. just right for a burrito fix in the Richmond.", "author": "n m."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-06-18", "description": "I was an idiot for going to pancho's from my apartment for all this time. Granted I really enjoy panchos, but gordo taqueria is sooooo much closer. Pro's about this place. The price, these burritos are dirt cheap, and there's nothing better than a burrito that  you pay very little for that fills you up...  Their carnitas are money, I don't think I've had anything else (and you can almost never go wrong with carnitas!). I have only a three minor complaints with this place. First, the way they wrap the burritos... Super loose! I personally prefer a burrito that maintains its integrity/form. When eating one of these badboys, it just feels like your stuffing your face down the sucker in order to prevent a meat/veggie spillover. Second, they kind of skimp on the meat, I'd advice asking for more. Finally, there's no salsa bar. I love being able to choose what kind of salsa to put on my burrito etc etc, i know i trust the guys making the burrito, but i love being able to put some more on when I feel like it...  Anyhow, the service is great and fast, and if your hungry and in the neighborhood, stop by!", "author": "Cameron R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-05-16", "description": "white man's burrito. plain, simple, fast...if that's what you want, that's what you'll get. if you want real mexican food, go to the mission.", "author": "selma s."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-02-01", "description": "I find the burritos here to be pretty bland & tasteless compared to burritos in other parts of the city.  Place is clean and you will not get sick.", "author": "JERRY D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-10-10", "description": "a lot of people built this place up for me, so i had high expectations. i ordered the carnitas tacos and the meat was pretty tough to chew. and there was so much sour cream i could barely taste the taco. next time i'll get a burrito.", "author": "N. M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-12-11", "description": "i was going to put 3 stars, but it gets an extra one for being in the outer richmond and by my house; like comments below, it's a long trek into the mish for a good burrito, so gordo's does the trick. their menu is TINY (pretty much, tacos, burritos, or like 5 dinner plates), and i was surprised that not \"everything\" is included in the burrito (sour cream, guac, salsa et al). i got a super burrito with carnitas (pork, on recommendation from the roomie), black beans, rice, sour cream and salsa. that salsa is pretty much like crack, very savory and chunky. i agree with nicole below, at 50 cents per extra addition, it was a little annoying, AND they don't even have agua frescas. what the hell!! but they do carry jarrito's, which is a plus, and it did the trick on satisfying my hunger. portions are a fairly large size, too. it's not the best of places, but i can think of worser places (balazo, i am looking at you).", "author": "Jenz y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-08-15", "description": "i'm a native and i cant agree that this is the best burrito in town, but it is damned good. i've been going to this location of gordo's since it opened i think back in the early 90's. the food is consistent and the service is always the same, pretty fast although kinda no frills.", "author": "A G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-06-06", "description": "I've been going to Gordo's almost since it first opened and I have to say I've finally had enough of the surly service and, frankly, really bad attitude of the people who work behind the counter. I frequent the Geary Blvd location as I live just around the corner and have lost count of how many times I've been infuriated by the rudeness and arrogance of the servers, to say nothing of the number of times the server gets my order wrong or disregards my requests altogether. Then there are the numerous times I've been overcharged. There's a particularly hauty fat guy who seems to think he's doing his customers a favor by deigning to serve them. I'm sorry, Gordo's food is not good enough to justify my returning. I see I'm not the only one who's complained about this. Clearly, Gordo's is doing great business, lousy service or not. Nonetheless, it's lost mine and I'll encourage anyone who cares to listen, not to frequent Gordo's in future.", "author": "Leo B."}
