{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-14", "description": "Local flavor at its finest. I love parks with a view, and this has one of the best viewpoints in the city IMO. Luckily we came when it wasn't foggy - it was a clear sunny day so we could see everything. Because it's on a hill, you get a clear 360 view of the city. You get a view as far as Financial District, but also of the Inner / Outer Sunset Neighborhood. I could even see Twin Peaks from up there! \n\nIt's a little walk up the stairs from the street to get to the top, and there's a small trail that wraps around the hill if you want to take your time. At the top, there's a few benches overlooking the city. Would be cute for a date spot, or even a picnic! No bathrooms - so make sure you go beforehand.\n\nAs far as parking goes, we chose to park further away and walk. We parked on the street near the base of the Hidden Garden Steps and had no problems finding a spot. To get to Grandview, we went up the Hidden Garden Steps, walked through a cute residential up to the 16th Ave Tiled steps, then walked that staircase and walked up another staircase to the actual park. A lot of walking, but makes for a great urban adventure in the area!\n\nBecause it's next to the 16th Ave Tiled steps and walking distance to the Hidden Garden Steps, I think it's a pretty good spot to take visitors. There's quite a bit to see in the area alone, and the neighborhood is quite cute to walk around. That is, if they're looking for more unique experiences in the city beyond the tourist-y stuff.", "author": "Alyanna C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-05", "description": "One of the best viewpoints in the city when it's not foggy which incidentally is most of the time.  Even if the view is obstructed by fog it's still nice to come for the mystical feeling of being surrounded by fog and wind.  You could spend $200 on an oxygen facial or you could come here for free.\n\nI use Grand View Park as a stop on an urban hike adventure.  There are a lot of staircases in this neighborhood to do a mildly strenuous urban hike.  The Tilted and Hidden Garden steps nearby are the most well known and picture worthy so I'd recommend checking those out as well if coming here.\n\nI usually take the staircases and make my way to Golden Gate Heights park. It's around a 3 mile with many different staircases.", "author": "Joan W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-09", "description": "Grandview Park, a.k.a. Turtle Hill, is a small outpost in the Inner Sunset that offers nice views of Ocean Beach, the entire Sunset district, the Golden Gate Bridge, and the downtown skyline in the distance. It's particularly pretty at sunset, especially when clear. \n\nIt's a short but somewhat steep hike up a set of stairs, so you can drive to this quiet residential area if you want. More fun and exercising, though, would be a walk up the 16th Avenue Tiled Steps all the way from the N-Judah line not far down below.", "author": "Vincent L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-05", "description": "Breathtaking view, a \"couply\" bench on top, some mighty wind + breeeeze, & a short walk up. \n\nTake a super easy walk up from 16th ave. tiled steps, then let the camera do its magic. Super photo-worthy spot! Scenic view of clouds + clear blue sky, city view, and twin peaks. \n\nGround is rocky (rocks in inconsistent sizes, so it's easy to trip). Wear layers for the wind & gripping hike shoes for the ground. \n\nPlenty of parking, gelato shops, gift shops nearby the golden gate park/ in the Sunset. \n\nHappy exploring!", "author": "Jess W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-11", "description": "Nice spot for a quick trek uphill to see views of the city. The park seems to be conflated with the 14th street tiled steps, which are located nearby to one another. Once you go up the tiled steps, there's a stairwell leading uphill to the park. You'll see views of downtown from a distance, Ocean Beach from the other end, and Golden Gate Park looking straight on. Given the residential location, parking can be tough.", "author": "Edwina D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-04", "description": "Amazing views!\n\nIt's a little hill with a street around it, on the west side there is the entrance to wooden steps all the way up to the top. It's rather short so doable if you're out of shape. The top is gorgeous and has a romantic bench to sit on and enjoy the view.\n\nI didn't give 5 stars to Twin Peaks because there are NO tourist here, literally NOBODY, yet a way better view than twin peaks. This park is way better, and you can also see the Golden Gate Bridge from here.", "author": "Apple S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-30", "description": "I hiked through Grandview Park on accident while trying to walk over to the 16th Avenue Tiled Steps. The park has some pretty steep elevation gain in the middle of the city and while the park is not huge, it's still a great place to find yourself. \n\nI got to the peak of the park by walking up several concrete steps and then taking a short dirt trail that went to the other side of the peak. Then I took more steep steps to walk down to the top of the 16th Avenue Tiled Steps. If you do it without taking too many breaks (which you will inevitably want to in order to take pictures of the view), it's actually a pretty decent workout. \n\nI would definitely recommend this for anyone visiting San Francisco who wants to do physical activity for about 30 mins - 1 hour (depending on your speed) and also see some views. Definitely walk down and back up the 16th Avenue Tiled Steps as part of your workout too.", "author": "Regina W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-14", "description": "If you're looking for a great spot to see the city, the famous Hidden Garden Steps PLUS the Moraga Steps, this is the spot!\n\nGrandview Park is more like a hill and is located off of 19th Avenue. There are many stairs to get to the top but a little bit of cardio is worth it to see the view. The Moraga steps are about a block or two away from the bottom of Grandview Park. There are always people there so it'll be hard to get that perfect Instagram-worthy shot... but the mosaic tiles are still beautiful even on a cloudy day. Don't forget to bring a warm jacket and water. As you probably have guessed, there are no restrooms or port-a-potties so empty the tank before heading here!\n\nIt is all street parking and it is easy to find, \nespecially on a Sunday afternoon!", "author": "Vivian C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-25", "description": "So cool! Stumbled across this spot leaving Home cafe... amazing view!! Took my breath away", "author": "Maria T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-27", "description": "I usually don't review non-food locations, but I was blown away by this park. I almost didn't come up after viewing the 16th Avenue Tiled Steps, but I'm sure as hell happy that I did. The view was breathtaking, even on a particularly cloudy day. You have a 360 view of SF (downtown SF, GG bridge, and the ocean). The climb is not difficult at all. I'd recommend bringing a light jacket because it can get pretty breezy. I want to come by during the sunset to see the sun sink into the ocean, so hopefully I'll post some pictures when I do!\n\nCOME TO THIS PARK", "author": "Gina L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-19", "description": "Okay okay okay, I have been the worst with Yelp reviews, but I am catching up now! \n\nMy six friends and I went on a trip to SF last week and came here after dinner (started by the mosaic steps). Even though I wasn't expecting the chilly weather in SF (please do yourself a favor and bring a jacket...it gets really windy up there), it is SO worth it because the view is breathtakingly beautiful. I'm actually glad we went at the time we did; you get to take in a wonderful sunset--it was a mix of grays, blues, and yellow/orange--the fogginess actually built into making the view that much more pretty. It wasn't crowded with tourists, so there was time to just take the view in, take some photos, and just enjoy without the pressure of everyone else behind you waiting to pass by, etc. See it for yourself :)", "author": "Sylvia J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-24", "description": "A SF gem!  When visiting the city I love to take out of town guests here.  The views of the city, park, ocean, and tops of the GG bridge are simply beautiful!  Jaws will drop.  You can park on 15th, 14th or Noriega and walk up. But the tiled steps at Moraga and 16th are an added bonus and not to be missed!  This is the best route up and best bang for your buck.  Just be prepared for your calves to be sore a couple days after.", "author": "Sheryce S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-10", "description": "Accidentally found this spot, as we were trying to make our way to the mosaic stairs. Still a beautiful spot to get a glance at the city, disregarding the steps it takes to get to the top.", "author": "Sandy L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-31", "description": "Probably one of my favorite views of San Francisco. The park isn't too high up in elevation so the city doesn't look like tiny specks. It also has a great 360 view of the city. \n\nIt can get pretty crowded with all the tourists so I recommend coming during the morning or early afternoon. Parking isn't too bad but the streets are very narrow so be careful. \n\nBring a picnic or just spend a few minutes either way, the view is great.", "author": "Phuong T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-18", "description": "An example of a perfect day in San Francisco = a luscious Charcuterie spread + a sexy bottle of chardonnay + gorgeous woman + a good book all + seating space at Grandview Park.\n\nSeriously.\n\nLuckily, after admiring and climbing the 16th Avenue Tiled Steps, I saw on my Yelp app this neighborhood hangout right behind the top of the staircase. So I ascended two calf-burning sets of stairs, and if those calories could have been expended any better. \n\nThe 360 view, spanning the skyline of the city's financial district to Golden Gate Bridge to concentrated neighborhoods nestled between hills and valleys, is something I'll never forget. Simply breathtaking. And the fact that it's, for the most part, pretty quiet up there makes it very relaxing.\n\nSure, it sucks that there's only one bench at the top, for whatever reason, but bring a slightly thick, somewhat transportable blanket, some food, and you're good, yo. \n\nOTHER TIDBITS:\n\n-Parking, although residential, may be free and doesn't seem too difficult (for the city). \n\n-There's also a lower, err, plateau, before ascending to the top, which has a better view of the South side of the city.\n\n-There's a strong breeze. It's quite chilly up there, so dress accordingly.\n\n-When I visited, I only saw three other people there. It doesn't seem like the most popular destination. \n\nIf you love urban exploring, this park is definitely worthy of your time.", "author": "Jonathan T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-20", "description": "The ideal time to visit Grandview Park is during a clear day.  Grandview park also known as Turtle Tower is located in the Sunset district.  This park boast breath taking views of the city to include the Golden Gate Bridge, Sutro Towers, downtown SF, Golden Gate Park, the Pacific Ocean, and the Marin headlands.\n\nTo get to the summit you'll need to climb approximately 145 steps. The stairs is a great glute workout and continuation of what I call stair masters after climbing the tile steps.  There is a bench at the summit where you can kick back and enjoy the views.", "author": "Peter C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-06", "description": "So it's not a \"park\", but you sure do get a grand view! Definitely come here after checking out the tiled steps and whatever else is on your list of to-dos. \n\nYou'll be hiking up more steps for another 2 minutes, but definitely worth it! Parking is spacious, since it is in a residential area, but do beware of leaving your belongings behind. Seems like robbery happens often here, with tons of warning signs. \n\nBring your jacket, since it gets chilly! However, I would love to eat lunch here next time, since you get such a spectacular view.", "author": "Hurjane V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-25", "description": "Just when I thought that I've seen most of San Francisco! Grandview Park has a fantastic panoramic view of San Francisco. It is beautiful and absolutely worth the lung busting climb up the stairs. Now, you CAN cheat and just drive to Grandview Park but I highly recommend a different route. Start at the bottom of The Mosaic Stairs (worth it) and walk all the way up to Grandview Park. You would have earned this view and it makes it even more exhilarating! Now, the actual park itself isn't very nice or glorious. You're purely there for the view at the top so don't plan on lingering or having a picnic. \n\nSan Francisco is just filled with little nooks and hidden secrets and I love that we discovered Grandview Park purely by accident. It made it all the more special and I highly recommend coming by if you're in the area for one of the best views of San Francisco. Wear comfy shoes though because you're going to have to trek up some stairs no matter what. We came during the day but I'm sure it's just as incredible during the evening! 5/5", "author": "Michelle L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-29", "description": "Superb park in the west SFO/sunset area. Gorgeous views of the city and the Pacific.", "author": "Sudipto G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-13", "description": "Awesome view of San Francisco!\n\nJust when you think you can't go any further...\n\nAfter Yuri and I conquered the 16th Avenue Steps AND the Hidden Garden Steps, we climbed even MORE stairs to the top of Grandview Park!\n\nOn the way up, there was a bench with a plaque.  At the very top, there was another bench where people were chatting.  It's so calm and peaceful!\n\nWow...  you can see all the way to the ocean!\n\nReminds me of the song, \"On A Clear Day... you can see forever...\"\n\nIt would be awesome to return and look at the scenery in the evening!  \nLet's go!", "author": "Nadine C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-03", "description": "Here's my review of the view.\n\nThis place isn't a traditional park where there is a large amount of grass, picnic areas or playgrounds. It's more like a hill with stairs that lead you up with an area where you can stand to view the city. I think there may be a bench or two along the way. It can get pretty windy up at this park so come with a jacket! The view is very nice and this place is next to the pretty mosaic stairs. The terrain itself is a lot of dirt and meh foliage but the views are what you come for. Avoid foggy days as this may ruin your view of the city.", "author": "Brenda L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-08", "description": "We stopped at Grandview Park before making our way to the 16th Avenue Tiled Steps and Hidden Garden Steps. There are two sets of stairs you can enter from- a concrete stairway at 14th Avenue and Moraga or a wooden staircase at Noriega Street. I preferred the wooden steps as the concrete steps were muddy. It's a 0.2 miles ascent to the top of the park hill. It was windy and cold, but the views made it worth it. We didn't stay long as there's not much else there. \n\nThere was plenty of street parking available around the park. Many signs warn people not to leave belongings in the car due to break ins though.", "author": "Helen H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-11", "description": "Make your leg day a bit more scenic by taking the Mosaic Steps up to Grandview Park. It's truly a playground for adults. Definitely not the most killer/intense leg workout, but it'll get your blood pumping. \n\nOn a clear day, you can see across the bay and you'll be able to snap some scenic photos along the way. Plenty of parking on 16th & Moraga, unless it's a holiday. This place is never too crazy, unlike others (Twin Peaks, etc.). \n\nWear comfy shoes, a light/warm jacket and an appetite for adventure... speaking of appetite...this is a great place to have a picnic, take some photos and soak in all of the panoramic views of the best city ever.", "author": "Astrid Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-05", "description": "We started at 16th Ave down by Kirkham, climbed some cute steps, walked through a neighborhood around the other 16th Ave and the prettier steps, climbed even more steps, and took in a nice and windy view.\n\nDef more laid back and not as crowded as Twin Peaks. \n\nBring layers because the wind can get coooooold!", "author": "Loli L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-29", "description": "Such a great place to visit! There are multiple beautiful mosaic staircases in the area so you should find them all!! \nThe view from the top is great as well! It's for tourists and residents alike. On a clear day you can see all of the bay when you get to the tip top spot.", "author": "Bhavisha P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-30", "description": "If you want a view of the city from every angle, scratch out places like Billy Goat Hill and Twin Peaks because this is your spot! \n\nFirst things first: mentally prepare yourself for a seemingly endless flight of stairs. I'd suggest looking down the whole time when walking because when you look up and realize you have more flights to go, you might just turn around...but trust me, the view is worth the ache in your calves. There's a bench at the top and at several stops on the way up, so you can choose which viewpoint you like best. \n\nThere's plenty of street parking at the bottom of the stairs (just no parking during certain hours on Tuesdays for street cleaning). Also, there's dirt and sand at the top so wear comfortable shoes. Overall, it's a great place to see the city!", "author": "Linh V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-19", "description": "A great panoramic view awaits you from the top of the serious flights of stairs that lead up to this park. Located around 14-16th Ave near Moraga & Noriega. We were looking for the Moraga Steps when we went to Grand View Park. Made our trek up the steps which are covered more and more by dirt and sand as you make your way higher. But the work is worth it because you get a beautiful view of all of San Francisco. It was a foggy Sunday morning when we went but you can see Sutro Tower, all of the Sunset and on that day.. almost to the ocean and the Golden Gate. \n\nBring comfortable shoes you dont mind getting a little dirty. Take some breaks if you need to. But definitely appeciate the view as it is spectacular even on a fog covered day as ours.", "author": "Chuck D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-27", "description": "Park on the street and take the beautiful stairs up to this local public park! Breath taking panoramic view of San Francisco at your fingertips. Plenty of shade at the top with one casual bench to award yourself for climbing all those steps. Bring a camera (or not!), bring a friend, and just enjoy the view. SF really has so much to offer and this is one of them. Especially when it's free, what do you have to lose?!", "author": "Vivian N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-06", "description": "This is a tiny park at the top of a hill that truly has a beautiful view of all of SF. I didn't realize that this was a continuation of the 16th Avenue Tiled Steps \"hike\" until I was almost there. The pup enjoyed climbing up and the humans were all awed by the amazing panoramic views.\n\nWe took tons of photos but they simply cannot do any justice. Just go there, sit at a bench, and take in SF.", "author": "Yi Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-22", "description": "The best 360 view of SF!!! However, be aware of about 500 steps walking upstairs but worth the rewards of the most amazing view of SF!!! This is an easy bike up and will not take more than 10 mins to get up there. I would walk all over again!!! On a hot day, you still get a really nice breeze up at the top. Nice place to take pictures or have a nice picnic!!! Parking is around the residential area. \n\nWhile you're in the area, don't forget to walk down to the mosaic steps not too far from this hike. The steps are higher but worth the walk. Enjoy!!", "author": "Julie L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-08", "description": "A 360' view of the beautiful city of SF.... Heck yes it was worth climbing up those steps. I didn't know of its existence until driving towards the Golden Gate Park. I looked up and saw this crazy park high up in the sky and I knew I had to visit. \nFinding a parking spot in that neighborhood may be a bit tricky but keep at it because it's worth it. Find the mosaic stairs, climb those then turn right and head up the stairs towards the GVP. Hopefully you are wearing the proper attire. It is a bit rocky and dusty at the top so you have been warned. \nMy only complaint is that there wasn't much of a sitting area to just take in the view so I just carefully propped my skinny bottom on some pointy rocks and let the cool breeze refresh me and the sounds of the city relax me. Put this on your must see list while in SF- you won't regret it.", "author": "Loren M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-16", "description": "After checking and doing the 16th Avenue Mosaic Stairs, you'll eventually get to Grand View Park (more stairs)\nSeriously, this place is a must-see!\nIt's like you're on top of the world! Well... on top of SF haha.\nIt's forestry, yet not too far away from the city.\nIt overlooks the city of San Francisco.\nThere's a bench where you can relax at, and look at the GG Bridge.\nYou're hitting two birds with one stone--exercise and the view!\nIt's worth checking it out!\nIf you like to see the top of bay area, I suggest this place, Twin Peaks or even Mount Tamalpais if you're willing to hike :D\nGrand View Park is one of the easiest ways to see the awesome views of what SF has to offer!", "author": "Laramae E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-05", "description": "Beautiful view of San Francisco!\n\nAfter climbing up the tiled steps, we decided to go even further up and get a better view of the sunset.\n\nI dreaded added steps and I know my legs are gonna kill me tomorrow, but it was worth it - the view was amazing!\n\nThere's not a lot of places to sit but there is one bench facing the Golden Gate Bridge. I guess you can sit around the fence and/or on the rocks.\n\nDefinitely a great place to take your friends!", "author": "Aj C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-07", "description": "Oh my freaking god!? Sooo many stairs!? \n\nHahaha that's our reaction while we were here a couple Sundays ago. Once you're at the top, the view is amazing of course.\n\nThe mosaic stairs were very cool to look at. Lots of peeps taking pics all along the staircase.\n\nAfter this experience, I realize how out of shape I am. Wahhhh T_T", "author": "Amy C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-22", "description": "Grandview Park sits atop the famous 16th avenue stairs.  Its a great place to catch a sunset with a loved one or friends.  It teeters the edge of Sunset, but still is a pretty secluded park for the most part.  The stairs are just as fun as the park.  Offers a great view on a clear day and gives a very different perspective of the more residential side of SF.", "author": "David C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-05", "description": "I first came here on a high school field trip (Mercy SF, represent!), and it was a complete eye-opener - who'da thunk that in the middle of a neighborhood off of 19th, that there's these gorgeous mosaic tiled stairs, and a killer view at the end of it all?\n\nTHE HIGHLIGHTS.\n+ Some of the prettiest stairs you'll ever see in your life\n+ Bring a windbreaker, as the view from the park top is a beastly windy one\n+ Bring a camera to capture the incredible view you're also about to see\n+ Ideally be in shape that's good enough to climb several flights of stairs and a steep hillside\n\nI would recommend coming late evening or early morning for the best view from the park, for sure.", "author": "Claire S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-14", "description": "Came by the other day after visiting the 16th Ave steps. The view at the top of the park is even more breathtaking as it offers 360 views of the city.\n\nThis is a hidden gem with very few visitors and tourists alike!\n\nPlenty of street parking is available in the neighborhood!", "author": "Derek S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-03", "description": "Parking\nNeighborhood street parking. The roads are pretty tight so be careful. If you can't park at the bottom of the stairs, try the top.\n\nFeels\nA very community friendly park that has a bike path or steps. I wouldn't really consider this a hike but if you run up the hill a few times, it makes a good workout. You get a good view of the Golden Gate Bridge however beware of Karl the Fog!\n\nOverall\n5 stars. Honestly if you're at a highpoint of a city, you're bound to get a good view however what makes this stand out is that you're close to the mosaic steps. Another non-promoted tourist place to be.\n\nTL;DR Tips:\n* Great place for simply sightseeing or a hilly workout.\n* During the Winter Holidays you can find a Christmas tree there.", "author": "Leland S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-11-02", "description": "Small park with steep stairs, but great views of the city.\n\nGo the route through the \"Moraga Steps\" or the \"Mosaic Steps\" or the \"Tiled Steps\" or the \"Grand View Park Steps\"....or whatever! Call them what you will... these steps are both beautiful themselves and will lead you to the base of the Grand View Park stairwell.\n\nI discovered this park as I was investigating \"Local Flavor\" spots in SF on Yelp- and discovered the Mosaic Steps. I took my kids here recently and it was very cool. The combined adventure of the Mosaic Steps and Grand View Park wasn't long, maybe 30 minutes round trip. It's a photogenic spot for a number of reasons, so come prepared to take pictures. The city views, the stairwell, and the close-ups of the tile art are all cool for pictures.\n\nThe parking situation isn't too bad. It's all residential so be conscious of the signs.\n\nThere are a few benches scattered throughout the park.\n\nI'll return someday, but I\"m not in a huge rush.", "author": "David S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-21", "description": "Majestic views of the Bay, Sunset, Richmond, Golden Gate Park, and more! Can be chilly and breezy on typical weather days, but the views are worth it!!", "author": "Steve F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-06", "description": "Once you finish climbing the mosaic steps, don't think for a minute that you are done. The hard part is yet to come. After the steps, make a right and you'll find another set of stairs that will zig zag you to the top of Grand View Park. This place is pretty secluded and you will see people getting their exercise in at these stairs. \n\nAfter you conquered the stairs, you will regain your breath to the most amazing view of SF. You will see all of the bay and all the famous landmarks. It is absolutely breathtaking and there are lots of great photo ops if it is a clear day in SF. Remember to bring a jacket because it does get windy up here all year long!", "author": "Minh-An C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-29", "description": "Another view of SF that is unbelieveable.\nIt is legit 360 views of the city & then some. \n\nIf you think you're GPS is taking you back to Billy Goat Hill, you're headed in the right direction. It is quite close but the views are black & white. Grand View Park trumps Billy Goat Hill, that's for sure. (Sorry, Billy Goat Hill, I still love you)\n\nStreet parking wasn't bad for a Saturday during sunset. \nIt is all street parking as it is located in a residential neighborhood.\n\nThere are two flights of stairs that take you all the way to the top.\nThere is a a fence that I found myself on the other side of, as usual.\n\nGreat for a photo-op with the whole city as your background.\nPanorama mode is your friend. You will come to find this out.\n\nIt was quite windy but I was okay since the view was worth it.\n\nI totally recommend as the top place to view the city!", "author": "Camille C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-24", "description": "After going all the way the 16th Avenue Tiled Steps, we found this place.  You can see the entire city from the top.  Very nice view.", "author": "L D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-17", "description": "I love this park. It's got an amazing view and it's slightly secluded. You can walk up the million steps and if you're alone, feel like you're on top of the world (or at least the sunset!) \n\nNot the best for kiddies since there is no play structure, but I'm sure they would still appreciate the walk up the stairs! As would any person exercising. \n\nThis is my favorite place to stop off and and just look off the coast and get lost in my thoughts.", "author": "Elysia M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-25", "description": "Wow!  I can't believe I've lived in SF all my life and just recently found this place!   The \"park\" isn't very glamorous, but it has an amazing 360 view of San Francisco!  Definitely worth climbing up the steps!", "author": "Candice H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-12", "description": "They should just combine Grandview Park with the Tiled Steps because they are legitimately one in the same. In my opinion, Grandview Park is like the cherry on top of the cake that is the 16th ave Tiled Steps. It's really not that hard to climb up the few stairs if you are in some kind of shape. \n\nJust like with the Tiled Steps, turn back once or twice on your way up so you can see the different in scenery. In my opinion, I find the views to be gorgeous. On your way up to the top, not only enjoy the view, but relax in the comfort of the generous shade from the large trees.\n\nThe reason why I like this place so much is because you get to see a 360 degree view of a part of SF that gets ignored a lot: the residential areas. Usually, you associate SF with the loud city life in the financial district. Hence, when you go up to twin peaks, thats what you primarily see. But this is a nice change in atmosphere because you get a quieter, more serene, more SUREAL view of the other side.\n\nI think the best part is probably that you can see how LARGE Golden Gate Park is. Its literally like another world down there because you can see how far it spans across San Francisco.\n\nThis place is a must go with your friends, family, and loved ones.\n\nHave fun and prosper,", "author": "Bryan W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-09", "description": "This is a really really cute park! It's more of a hike and view spot than a run in the open air park, so as long as you're aware of that it's definitely worth exploring! The reason I gave this 5 stars is because it felt like this park was my little secret. Another hidden gem to discover in SF as long as you want a workout and view. Hooray-ay-ay!!! P.s sunset here is GORGEOUSSS", "author": "Sarah M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-07", "description": "Beautiful 360 view of San Francisco! I've been coming here since high school, whether it be because we were racing up the moraga stairs trying to win a bet or just had nothing better to do. Those stairs are no joke! I don't think I can run up them without stopping anymore. Props to all the elderly folks I see that are still climbing them at random times in the day for exercise... Hopefully i'll be able to do that when i'm old haha.\n\nThe view when you get to the top is amazing. Especially if you're from the sunset like me, you know where everything is. I can see my house, my high school, some of my favorite parks, and then some! You can even see the golden gate bridge if weather is permitting (aka karl the fog). Also, sometimes it's pretty windy so don't go up without a sweater or else you'll be freezing haha", "author": "Tara A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-06-25", "description": "Grandview Park, for me was basically a hill in the middle of a neighborhood that overlooks the Sunset Area, along with giving you a breath taking view towards the north part of the city.  I was visiting, therefore, I claim not to be an expert about the city.  However, this park starts off with steep stairs that will get your heart racing when climbing to the top of the hill.  Once on the top of the stairs, you can make a quick left around the hill towards the top of the hill.  There you will be greeted with some strong winds from the pacific ocean that is a breath of fresh air.  Grandview Park gives you a nice 360 degree view of the area allowing  you to see all the way towards the Pacific Ocean.  For a visitor to the city, this was a nice little detour to visit and experience.", "author": "Kevin H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-25", "description": "Beautiful views up there for a short effort of one hundred or so stairs.  But wow ... it's gotten super popular and crowded.  I got there near sunset and it was crowded with visitors.  Despite the crowds, very well worth going.  The views, while not as great as some other hills in San Francisco, are fantastic.  Especially sunset over the Pacific with the Farallones in the distance.  Hard to beat.", "author": "Tim L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-14", "description": "We accessed Grandview Park after coming up the 16th Avenue Tiled Steps.  The steps here gives you more of a workout than the tiled steps.  The top of the park provides a nice view of the Sunset district and beyond.  A bit chilly but still worth the climb.", "author": "Karen L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-25", "description": "Amazing views!!! By far my favorite vista point.\nThe walk up the stairs is totally worth it, your breath will continue to be taken away with the views from the top!", "author": "Maggie L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-14", "description": "I actually like the Grand View Park more than Twin Peaks. Here's why:\n\n1. Better view of the city. It's a 360 view, rather than a 180 (you can clearly see ocean beach, golden gate park, golden gate bridge--definitely enhances your appreciation of the city).\n2. More quiet (bunch of obnoxious high school kids at Twin Peaks) and less crowded (people actually come here solo to get away from the hectic city life to relax and think).\n3. Easier to get up to (unlike the maze-like Twin Peaks where you definitely need a car).\n4. That one bench in the middle (reminds me of the bench in LA's Angels Knoll from 500 Days of Summer hehe).", "author": "Vicki L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-24", "description": "I love stairs.\nI love great views.\nI love wine.\nI love sunsets.\nI love my husband.\n\nDefinitely five stars.\n\nMy husband lives a few blocks away, and we walked up about 45 minutes before sunset, took in the view from all angles before grabbing a spot facing the ocean, and [may have] sipped on some white wine while we watched the sun set.   It's a beautiful oasis amongst the urban dwellings.  I love it!\n\nP.S. You can see the Golden Gate Bridge from here!", "author": "Anna C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-01", "description": "Great 360 view of the city. \n\nThere was nobody there when I went... just like the lonely bench up there... just soak in the view and think about life. Deep.... \n\nIt was super windy and cold, even with a jacket on... so I got out of there pretty quickly too. lol\n\nOne of the cool things to do visiting San Francisco and it's free, which is always a plus. It will always depend on the weather, who you go with, and if it's packed or not.", "author": "Kiyo M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-20", "description": "Grandview Park is more of a view than a park. You go up some steps and you see all of San Francisco and a little bit of the Golden Gate Bridge. It's best to be seated on the very front rocks or else you'll have asshole selfie stick owners obstructing yours and everyone else's view *rolls eyes*. I went on a cloudy day but it was still beautiful. I'd imagine a sunnier day would be 10x more picture-esque.", "author": "Itati V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-11", "description": "My Uncle Scott has been missing since Spring 2016.  A friend went searching for him and one person said they recognized his picture and that they saw him near this park. Please help us find him!", "author": "Amy M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-12", "description": "Came here with my friend who came to visit from Taiwan! Wanted to show her a good place to take photos of the city. \n\n\nThe best view in the house! No tourists but some mosquitos. Came here at night and got bit by a few :( but the view is A+ and totally worth it. Remember to wear some thick pants when you come here during the summer.", "author": "Janet K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-21", "description": "Love love love!!! Decided to do some exploring around the city with my son.  Certainly beats staying at home watching the TV.  We both had a wonderful time with the magnificent views around the city.  \n\nFirst we climbed the zig zag stairs, which takes you to the top.  Near the end is a bench for those who want to rest or enjoy the views. To the right of the bench is a path that goes around the hill.  Watch out if ya have kids, cause there's no fence n can be dangerous.  However, walk carefully around and you will see, the GG bridge n GG park, sunset and the view of the downtown City.  As you go to the back, there are another set of stairs that go straight Down.  Whilst contouring around the hill, you can see twin peaks followed by views of the ocean n sunset neighborhood.  \n\nWe were lucky the sun was out n it was a very clear day.  Will definitely go back, with visiting friends n family.  Amazing 360 views, a must see.", "author": "Elaine Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-07", "description": "Feels like the top of the mountain, and the Outer Sunset is the base.", "author": "Julio B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-12", "description": "Easily one of the best views of San Francisco.\n\nLike most good things, they don't come easy and to get to the views that Grand View Park offers it will take some walking up steep hills and steps but in the end it is all worth it.\n\nThe day after Christmas, I really did not want to do anything but lounge away after all the food we ate the night before. But, the other side of me knew I should probably work off some calories. It is a prime opportunity to use that Fitbit device or Health app on your phone with the end goal of catching a glimpse of SF that really is stunning\n\nThere are a lot of families up trekking up to Grand View Park and you'll find many sitting on the provided benches and ledges to catch the sunset which is a very happening time up on this cozy park on the hill. I like the energy here and whether it is the sweeping views of beautiful SF or the crisp air, you just feel refreshed here.\n\nOne thing we noticed was an open air area walking towards Grand View Park that also has spectacular views of the ocean. A lot of people stopped their cars there too to snap some photos and get that perfect sunset pic for Instagram. I thought that was pretty awesome too.\n\nThat said, wear some comfortable shoes, not too tight pants and check out the Grand view that you'll find at this park. Worth it, I swear!\n\n\nTip: Street cleaning on 14th ave 9am to 11am 1st and 3rd Friday of the month", "author": "Matthew T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-25", "description": "I love coming up here. You can see a 360 view of the entire city including the Golden Gate Bridge. Best times to go is sunrise or sunset. It has a long set of stairs for people who want to work out running up and down from it and then take a rest to enjoy the beautiful scenery. It has a lone bench where people love to take pictures with. It's usually a little windy up here so bring your jacket. Love this San Francisco hidden gem.", "author": "M L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-05-24", "description": "Okay view. Not much to see as most of the city is blocked by twin peaks. Very very dark at night (zero lights). Good place to go to get away from the city while still close.", "author": "Danny H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-13", "description": "I like hiking and everything but honestly I am terribly unfit and hate working out and especially hate STAIRS. So when my friends and I arrived at the bottom of the beautiful mosaic steps, I was like \"just kill me now\". There are a LOT, LOOOOOT of stairs if you start from there and want to get all the way to the park at the top. \n\nBut once I got to the top (somehow I didn't die), I remembered why I enjoy hiking and why it's worth the pain. The view from the park is great! The park itself isn't much, you can barely even call it that. But you can see the whole city all the way around. A very nice reward for the workout you just did. Although it was warm the day I went, it was quite chilly and windy at the top here, so just be aware of that.\n\nI can't even imagine how beautiful and amazing the view must be at night time when the city is all lit up. But hell if I'm gonna climb all those stairs again to find out lmao, bye.", "author": "Karen T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-26", "description": "If you want a beautiful panoramic view of the city and the bay and a killer leg workout, Grandview Park is a \"must see/do\" location in San Francisco, particularly on a clear, windy day.\n\nYes, it get's chilly with those winds and yes, you WILL be tired at the top of one of the two stair cases that go all the way to the top, but you will feel alive and grateful for the view and the experience.\n\nTIP: Bring a sack lunch and eat while sitting on one of the benches at the top.\n\nPARKING: Usually, it's plentiful, but I suspect on holidays it might not be as easy.", "author": "Monika H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-26", "description": "I gotta agree with Matthew T about this spot. It's easily one of many best views of San Francisco. You have to come here if you just want to explore SF. I love the moraga stair steps and you definitely get a nice view of the whole city if you climb up higher.", "author": "Danny L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-08", "description": "I jogged up the steps of this park out of curiosity, and although I was wheezing geriatrically at the top, I'm very glad I did. \n\nIt sort of feels like a floating island, with sand paths and wildly engineered staircases. It's also a unique view at the top in that no other park affords such a sweeping vista of the Sunset and the ocean (Sutro basically blocks everything.) \n\nWill be coming back here with my partner for a sunset.", "author": "Andres B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-29", "description": "Appropriately named Grand View as this is where some of the most fantastic 360 degree views in all of SF can be had. Along the way, do enjoy the gorgeous staircases zig zagging up or down. As many past visitors have proven over time, the staircases alone makes for great photo opps. \n\nThe quiet residential neighborhood location plays a factor on why there isn't as much foot traffic as the tour bus laden Twin Peaks. But the relatively low key-ness is another reason why I love it so much. \n\nA true San Francisco gem.", "author": "Esther A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-24", "description": "Words cannot express how thankful I am to have found the Yelp reviews for this amazing place! I'd heard about the 16th & Moraga Street mosaic steps before (see my other review for those), but had not had the pleasure of viewing them myself. My bf and I got a new camera, so we wanted to spend the day in the city trying it out and being tourists (even though we live nearby and come to the city often). I was looking up the mosaic steps, and I stumbled upon the Grand View Park reviews. I never would've known this incredible place existed if it weren't for Yelp, so I am eternally grateful. \n\nOnce you reach the top of the mosaic steps, you walk up the street to the right, and you'll see a small set of stairs on the left. Climb those steps, and then continue on to the right and you'll find the winding wooden staircase up to Heaven (or what I would like to imagine Heaven looks like). We were lucky enough to go there on a super clear Sunday in November. The weather was fantastic all over the city that day. It wasn't super crowded up top - maybe 20 people total, so we were able to get tons of pics without having random people in the pictures. The view is spectacular up there (it was so clear we could see the peaks of the Golden Gate that day), and we had a great time playing with the panoramic and other settings on the camera. \n\nWe brought sandwiches up there with us (which we were super thankful for after climbing all the stairs!). There are a few benches on the way up that look out over the ocean, and because it wasn't very crowded, there was one or two open. We opted to just stand and eat at the top though so we could overlook the bridge and downtown. I know we got extremely lucky with the weather, because it wasn't cold at all up there. But based on other's reviews, bring a coat up there with you, because you want to be able to spend as much time as you'd like taking it all in, and not have to cut out early because you're freezing. \n\nI would definitely love to come back here at night to check out the city lights. I didn't see any signs about there being restricted hours, so this might be an option. Definitely one of my most favorite places I've found in the wonderful city of San Francisco (and this says a lot because there are many phenomenal sites to see here).", "author": "Allison B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-23", "description": "This was a wonderful outing.  We walked all the way to the top and took many pictures on the mosaic stairs.  It was a beautiful day and impressive.  We plan to go back to try and find the hidden stairs next time!", "author": "Okapi C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-08", "description": "Awesome view of SF. You can see the sunset district and the Golden Gate bridge all the way to downtown and Twin peaks! Beautiful panorama views of the city.\n\nThis is more of an uphill walk than a hike. There's plenty of stairs, so it's totally doable without running shoes/hiking shoes. The first time I found this place on accident, so I was wearing booties and it was still fine. The actual length of this \"hike\" isn't long either. You can drive up pretty far, so you don't have to walk as much if you don't want to.\n\nI've been here twice now. Each time the view is slightly different depending on weather and time of day. It's also nice because there aren't too many people and it isn't too crowded. You can definitely get in some good pictures without people in the background!\n\nAlso, this place is right behind the tiled steps. So if you're at the tiled steps, you just keep going up the stairs and eventually you'll get to the peak/park. Or if you want to see some pretty tiled steps after the beautiful city views, just take the steps all the way down!\n\nI also love this place because parking isn't hard to find at all! It's pretty residential, so there's plenty of street parking nearby. Also, remember to turn your tires so you don't get ticketed!!", "author": "Julie L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-22", "description": "After scaling the beautiful tiled steps and taking in the view from the top of them, continue on 15th and Noriega to do another small hike up to the top of this park, because the view is seriously GRAND, hence the name! It is windy, rocky, and a bit steep, yet you get a spectacular 360 degree view of SF all the way to the Marina and Sausalito, and morst impressively see Golden Gate Park in its majesticly large entirety. \n\nOne of my ultimate favorite parks to go visit, and I guarantee it will be one of yours too. Just remember to wear good shoes and a jacket! :)", "author": "Kyrie S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-27", "description": "Definitely an amazing place to catch the sunset, although it can get a bit windy up there. Amazing views of the Inner Sunset, San Francisco and the Golden Gate Bridge. Also a great place to work out if you want to run stairs over and over again with the Mosaic steps near by and plenty of others down the avenues it can be a more scenic stair master.", "author": "Nino S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-15", "description": "Always a great place to go with friends, your love or for a photo shoot. It's usually pretty windy so be prepared for that but the view is fantastic. You can see the Pacific Ocean and the Golden Gate Bridge. It's beautiful. Also the steps leading up are worth it as well.", "author": "Kiki L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-27", "description": "I love this place so much. Nice exercise climbing the stairs and amazing rewarding views when you get to the top!! It's so chill and beautiful. I went up when it was foggy and windy, so bring a jacket. However with some fog, the view was still beautiful and amazingly outstanding because I don't see fog when I go to school in SoCal. So when I'm back here in the bay during the summer, it feels pretty damn special to see the fog.\n\nThis is my type of place and I would come here every time I'm in the area for this great set of steps. such a romantic view. It's so worth it. \n\nWe parked at somewhere right by the Grand view park so we would hike up over the park first and then go back down to see the tilted steps, where the art is. \n\nFor my understanding now, it's better off park at bottom of the 16th avenue so you can start at the bottom where the Mosaic steps are!! (The Tiled Steps project). Take in the art and then keep walking up to the stairway, where the Zig Zag stair is and climb up around the Grand View park where you get the views of the city !!\n\nIf you want to explore around the spots In the city, come to this spot sometimes and drink a little henny with some friends.....", "author": "Formosa L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-20", "description": "I came upon here by luck when checking out the two sets of Tiled steps. I'm so glad my friends and I were just walking through the neighborhood and being adventurous.\n\nWe're all pretty active people, so this was a casual walk/climb we all needed to walk off our food comas & weekend debauchery (it really isn't difficult, trust me you won't regret it!). You can see the ocean and the golden gate bridge. You can see the whole extent of SF and its magnificence. With the endorphins from walking up the stairs and adding in a killer vantage point view, I think this can potentially be a romantic setting. Just remember to bring at least one jacket to cuddle in together, because cmon now.. it's SF!\n\n\"The coldest winter I ever spent was a summer in San Francisco.\"", "author": "Diana J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-22", "description": "Amazing 360 view of SF! Also a great place to get a morning work out in as there are a lot of steps! Love the mosaic tile steps and fortunately there was a lot of parking early in the morning.", "author": "Jami K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-23", "description": "I came here around 6:30 pm in August and it was super foggy. Couldn't see anything at all! Pretty much saw some trees and a white blanket over the city LOL. The area itself is super nice though.", "author": "Cecilia Jane N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-08", "description": "the address that yelp directed me to was on the other side of the park & so if you don't see the amazing staircases right away, just walk around to the other side!\n\nI personally feel as if it would have been better if it was a sunnier day, because then the staircases would have been more vibrant in the sunlight, but it's still a really cool place to see. . . must see!!! :-) \n\njust know that like you, other tourists are going to be wanting to take pictures on the stairs & so it can be annoying to have to wait until it's your turn to take a photo when the stairs are clear of traffic and what not.", "author": "Brooke W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-06-24", "description": "Beautiful mosaic steps with a gorgeous view of the city. The pictures here says it all, more than a review can describe. My friend's cousin brought us here as we asked for a local hidden gem. \n\nDefinitely worth a visit over the populated Golden Gate Bridge if you have already seen it. We got a lot of great photos from here!", "author": "Binh T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-30", "description": "Nice Views!\n\nIt's a small park, essentially just the top of a hill.  Unfortunately, the day we visited was cloudy and rainy, but we were still able to enjoy some good views.  It's easy to imagine this is breathtaking in clear weather.", "author": "Ted Q."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-30", "description": "You can come here, see beautiful views and relax. You can do it alone or with your friend. No metter 'cause this place is great.", "author": "Paula S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-23", "description": "Spectacular views of SF can be seen from here! :) We recently went for a visit and loved it. The stairs to get to the top are a bit much, but if you're fit and exercise often - then it'll be simple. You'll be rewarded with some nice cool breeze, shade (from the trees), and a magnificent view! Be sure to drop by the stairwell not far away from this park, where it's lined with painted tiles.", "author": "Yonnie C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-20", "description": "I was in town for fourth of July, and my goal was to skip the Fisherman's Warf crowd madness for the fireworks. Living in South Florida, the highest point of land I encounter, is the occasional speed bump. I thought I'd take advantage of the California terrain and enjoy a different viewpoint. I thoroughly reviewed viable options via reviews from descriptive locals. This actually made it even harder to choose a location, as San Franciscoans seem to love every park in the area. (I greatly admire this about you guys, by the way!) I had heard about the famous mosaic steps via other websites (I know, what the heck am I doing venturing beyond Yelp?!) and figured we'd kill two birds (don't worry, they are figurative birds). So I decided that Grand View Park would provide my grand fireworks view. \n\nWe arrived at the park just before sunset and made our way up. Very quickly on, it dawned on my that I had forgotten to take into consideration one very important factor, the fog. We climbed to the top, where it was blantantly clear that the only thing I'd be able to see, was the person next to me, provided they were standing less than ten feet away. Karl was clearly not subsiding any time soon. As we started to head out, I remembered the mosaic steps! I actually needed to use google maps to find them because it's unclear otherwise. Despite the weather, the steps made the trip worth it. Although you get a good sense of them in pictures, it's definitely better in person. I know that steps dont sound a big deal but do yourself a favor and check them out.", "author": "Sabrina D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-28", "description": "This is a great adventure , the best part is there is all different types of view and stairs around here ! It is so worth it and wouldn't miss this spot if you're in San Francisco.", "author": "Alondra I."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-30", "description": "There's a pretty set of stairs on one side, and a no bullshit set of stairs on the other side.  I prefer no bullshit, and run these stairs for torture.  I'm not alone, either.  I once walked up here with my 35 lb kettlebell intended to go up and down about 10 times.  From Moraga all the way up, it's a healthy climb.  I did about 6 reps before I started to question my ability to walk home.  It was great.  My legs felt awesome the next day.  \n\nThe top has a great view of the City.  I've walked up here with Robert during Fleet week, and we can see the Blue Angels fly all around the City without a huge crowd and sonic booms.  It's loud, mind you, bit not head shattering loud.", "author": "ROB L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-01", "description": "Get your workout in and climb to the top of Grand View Park for sweeping view of San Francisco. It's a great hidden gem with fantastic views.\n\nFor a great afternoon out, bring a picnic, and start at the bottom of 16th Avenue Tiled Steps Project and admire the gorgeous celestial and sea creature tiles. \n\nTry to park at bottom of the 16th Ave steps for ease. Don't make my mistake at parking at the wrong side of Grand View Park, hiking up and over the park, and then back down to find the tiled steps. Then back up the steps again, and around Grand View to get back to my car. Sure, I could use the exercise, but I was storing up those calories and time for sunset gazing.\n\nFYI, the steps look ordinary from the top too, so it's best to start your journey at the base of the tiled steps. Take in the art, and then travel up another flight a steps up to the top of Grand View Park, and stroll your way around the top for 360 views of the city.\n\nIt's a nice date spot for a picnic or sunset. Take your out of town friends too, coupled with the tiled steps for a good, local experience and views.", "author": "Rebecca G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-18", "description": "This place is a hidden gem in San Francisco. Our Uber driver had never driven to it before. The views driving up to it are gorgeous. Once you've climbed up, you'll notice the breeze rushing past. It can get chilly, and especially on an overcast day feels very witchy. I don't want to be overly descriptive; it's an experience best seen/felt for yourself! Take a date! It's a very romantic spot.", "author": "Shu J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-24", "description": "If you can find it, Grand View has, true to its name, one of the best views in the city. While my boyfriend with a fear of heights doesn't love the stairs, we both enjoy climbing to the top of this hill to watch the sunset over the ocean or the fog roll in under the bridge. The view includes the entire span of Golden Gate Park, the GG bridge, downtown, twin peaks, the entire sunset district, Angel Island, the Marin Headlands, and the ocean.\n\nI love using this area to do exercise. The staircase is long, and running up them, around the park, down the other set, and around the block is a great workout. I often see high school soccer teams training around here.\n\nWhile you're visiting, also check out the two sets of tiled stairs. While this neighborhood is extremely confusing to navigate by car or on foot, the two tiled staircases are hidden artistic gems. They aren't near each other, though (10 minute walk apart), and they aren't exactly the stairs on this park.\n\nThe only criticisms of this park are the hefty amounts of poison oak around the hill! Beware! Sometimes there's a little bit of glass in the sand, so don't go barefoot. Also, bring your sweatshirt cause it can get windy!", "author": "Allxie C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-25", "description": "Parking is all street/residential. Kinda hard to navigate the streets because they are so narrow so just be careful.\n\nBeautiful view of the city. The stairs to get to the top though are a doozy, but just consider it your cardio for the day. The bench that sits at the top reminds me of the 500 Days bench. Perfect for couples or just friends that want to enjoy the cityscape together. The pictures you take there always come out perfectly. \n\nI plan to come back when the sun is setting! Now that must be a sight to see.", "author": "Abigail D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-10", "description": "This park has one of the best views of the city spanning from the Outer Sunset to downtown. The trek to get to the top requires a climb up several dozen steps regardless from what side you enter from (14th st or 16 st) but you will be rewarded once you arrive to the top (assuming there is no fog). The view is unobstructed and spans the entire Golden Gate Park which is something you can't really get from Twin Peaks.\n\nThere is only one bench at the top and a couple places to really sit down comfortably and enjoy the view. One thing to note is that if you come from the 14th st entrance, you will have to walk through some sand - just an fyi with those concerned about ruining your shoes. The 16th street steps feature mosaics so be sure to check those out (many people are unaware of these steps if they happen to enter/leave from the 14th street side).", "author": "E E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-27", "description": "The view here is amazing & is a must visit when in the city of San Francisco. You'll thank yourself later for making up the trek of stairs.", "author": "Arthur K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-18", "description": "Quite the beauty.  If you live in the Bay Area or have a guest visiting from out of town, I highly suggest doing this at least once!  The view is spectacular on a clear day.  The mosaic stairs can be tough but not to the point of exhaustion.  The additional stairs to get to this lookout point are short and much easier.", "author": "Shannon L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-10", "description": "Took us a while to actually find the mosaic stairs... It's not exactly on the top of the hill of the park but down 2 flights of stairs.\nBeautiful artwork! Made my day to see it.\n\nA local said there was another set of mosaic stairs around the bend, but we never found it.", "author": "Kathy W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-21", "description": "LOVE LOVE LOVE the view I had from the top of this park today.  I totally didn't expect this other than seeing the beautiful mosaic steps on 16th avenue. \n\nThe weather was gorgeous and clear.  We came around sunset, which was absolutely breathtaking.  Its a perfect picture opt session spot for all you DSLRers.  Bring a jacket just in case to defend yourself from the wind.  i actually like this park and view way more than twin peaks!\n\nGREAT for visitors, dates, and just to remind you of how beautiful SF is.", "author": "Kathy D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-24", "description": "After climbing the 16th Avenue tiled steps, my friend and I took the extra time to go to the top of Grand View Park. It's free and has amazing 360-degree views of the entire city. We went around dusk hoping to see a great sunset but unfortunately those ever-present San Francisco clouds didn't agree with us. Plan to wear good hiking shoes as the top has exposed tree roots and dirt pathways. Bring a coat too, it's windy up there no matter how much of a sweat you break on the hike up. I could see how it might be crowded on a weekend, so go on a weekday if possible. Grand View Park was the perfect way to finish my California vacation.", "author": "Matt P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-02", "description": "Another of San Francisco's staircase treasures. This one has several; you can climb up from either the east or west sides. Trails to the top (it's a really quick ascent) will reward you with 360-degree views of our amazing city.\n\nDogs love this place!", "author": "John H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-14", "description": "You know the saying, \"Nothing worth having comes easy?\" Well Grand View Park is like that. It's a good trek to get up here if you're coming from the Mosaic Steps on Moraga and it'll leave you huffin and puffin halfway into the hike BUT keep pressing on...the payoff outweighs the exhaustion! \n\nIt's a good workout and definitely wear a good pair of shoes for the climb up. I like playing \"Eye of the Tiger\" as my motivational song to get me to the top - works every time. And when you're finally at the top, with your glutes all burnt out and your heart racing like the time you first laid your eyes on your school boy/girl crush, basque in San Francisco's outdoor beauty and the grand view you worked your butt off to see.", "author": "May D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-13", "description": "You're not allowed to cheat and drive straight to Grand View Park. You need to walk up ALL of the mosaic stairs (and more) to earn one of the best views of San Francisco. The \"park\" itself is not all that glorious, but seeing a complete span of all seven miles of the city is just breathtaking, whether you are a local or tourist. Speaking of breathtaking, you might be out of breath from walking up so many stairs, but it's totally worth it. This is the true fitness test of San Francisco.", "author": "Stefanie C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-08-06", "description": "There is no other feeling than the feeling like you're on top of the world. I was told this was a local's secret place for an escape, and exactly like the name of the park, this is definitely a grand view.\n\nBrace yourself for a small hike up the exquisite mosaic steps and some. But after you get up to the top you will feel pretty accomplished and well-deserved of this breathtaking view of the great San Francisco.\n\nIt's a great place to take a date for a romantic view of the city. Bring a blanket and some yummy SF food and enjoy an intimate picnic date. Just be sure they're not afraid of heights or wind (it gets pretty windy up here).", "author": "Sidney T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-08-07", "description": "My friend took me to this hidden gem and crown jewel of San Francisco, and boy was I blown away (figuratively AND literally--it's freakin windy up there!).\n\nAlso known as Turtle Hill, Grand View Park will give you an absolutely gorgeous and sweeping view of San Francisco--from the beach and the Avenues to the Golden Gate Bridge to the Bay.\n\nParking: There is street parking along 14th Avenue, but I suggest you park on Funston near Moraga and walk up the beautiful mosaic steps.\n\nThis is a perfect place to bring a date, show off the City to visitors, or snap a panoramic view of the beautiful city.\n\nBe sure to bring a jacket, because like I mentioned above, it gets windy!", "author": "Matt S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-30", "description": "Great views of San Francisco!  You can see all of Golden Gate Park.  Worth the hike up after the mosaic steps at 16th.", "author": "Linda L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-17", "description": "Best place to catch the 360° view of San Francisco at sunset! Take a jacket as it will be much cooler up there but worth it. Lots of steps up so especially if you have elderly with you plan to take some time to climb those.", "author": "Jennifer N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-03", "description": "Hidden gem! Not very crowded - or maybe the foggy weather hindered folks from coming out today? Not a huge park. Though peaceful and an AWESOME spot to visit... Near the 16th Avenue Tiled Steps Project. Cardio via the steps - running up and down the stairs multiple times. The best part = beautiful views of the city! Though if it's a foggy day, well then the Golden Gate Bridge will be hidden.", "author": "Pina U."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-26", "description": "I credit this park for turning my crush into a girlfriend ;)\n\nThis is one of my favorite places in the City. A lesser-known and less-crowded view point than Twin Peaks, this is the perfect place to bring your out-of-town visitors.\n\nI would suggest starting them off at the Moraga Street Steps below and walking all the way to the top of this beautiful park.\n\nThe parking is easy, the view is gorgeous, and the atmosphere is relaxing and romantic.", "author": "Teiki K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-31", "description": "I cant believe this gem is basically my backyard! I'always seen the little green hill in the distance and one day on a run decided to find it. It takes some serious calf power (or a car) but it's up a few steep hills, a billion steps, and then you're on top of an ancient sand dune, looking over the entire city. Better than the de Young's observatory!\n\nAt the peak, you're standing on bedrock. There's plants that ONLY grow on this hill. If you're lucky, you can cast your shadow on a lower cloud.. or just a beautiful sunset over The Sunset!\n\nIt gets coooold up there, be prepared!", "author": "Vivian H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-29", "description": "I think this is definitely one of my FAVORITE spots to get a view of the city. You see FiDi, you see the bridges (esp the Golden Gate bridge), you see all the neighborhoods of SF, and even that strip of green that is the Golden Gate Park.\n\nIt's beautiful! I always go from the Mosaic steps up to this park for this Grand (panoramic) View (get it get it?).\n\nNote: this spot gets SO windy though, it's SO cold hahaha. You think the day is okay? Yeah...wait til you go up here...you'll get reminded really quickly what city you're in. \n\nBut the view is worth it!", "author": "Kelly T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-08", "description": "This park is on top of the Tiled Stairs, you will get a great view of the city.", "author": "Mike G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-29", "description": "Thighs feeling a little on the jiggly side? Take a trip to this Sunset gem. You'll feel the burn in your legs and the wheezing in your chest before you get to the second set of stairs. \n\nOr maybe that's just me and all these restaurant reviews hitting me hard. \n\nCame here after going through the 16th Ave stairs and got a plethora of good panorama shots of northern San Francisco. Great place to sit back and talk with friends -- or just simply enjoy the fresh air. There's a good amount of foot traffic (especially on weekend when the weather is bomb diggity) so try to go on a weekday if you prefer some alone time.", "author": "Malori M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-30", "description": "Great view of San Fransisco and it's located in a convenient area. The 16th tiled steps projects is also located only 2 blocks away so this is worth checking out if your in the area.", "author": "Brian A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-30", "description": "Tucked away at the top of inner sunset, it has a great view. Walk up from the mosaic steps, on your way to the top for double good times. The foliage has great character and it's only a little climb for an awesome view. The top is the nicest, but there were a lot of people there. If you go just below the peak you can get some decent privacy.", "author": "Jason H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-02", "description": "2014 is off to a great start! Decided to do something non-foodie related with my girl Chloe G. and spent the day checking out the simpler things around the Sunset. This park definitely lives up to its name and offers a stellar grand view of San Francisco.\n\nThere are two streets you can enter from - 14th Avenue and 15th Avenue - both requiring a hike up a stairway. The ground becomes sand and the wind picks up as you get toward the top, so come correct with the clothes. There are a couple of benches scattered around the park so that you can sit and enjoy the view from different angles.\n\nHIDE YO KIDS!! So much PDA it's cute, but then it's not cute. There were also beer bottles littered around. Who the hell would even think about getting drunk up here?! The terrain up top was so bumpy to even walk on sober, I nearly pulled a Jack and Jill and busted my head open like Humpty Dumpty!! I ain't got time to be luggin' people down this already steep slope neither because I can barely get myself down!!\n\nSimply put, Grand View Park is one of the best places to get a 360 of San Francisco. The view will catch your breath better than Kelly Clarkson ever could. From couples to families, writers, photographers, and everything in between, this place has something to offer for everybody. It's surely a sweet escape from life - come see this place for yourself and let the stress blow off with the wind! You'll feel so much better right after. If not, you'll at least have thunder thighs at the end of the day.", "author": "Peter L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-16", "description": "Definitely a great view! The Mosaic steps are beautiful but was a bit sad of how crowded it was when I went, I wasn't expecting many people to be there but I went on a Sunday around 2 and there were many tourists trying to take pictures... me included! So, it was hard to get a nice shot of just the stairs without everyone else in it.\n\nHowever, the view at the top of the stairs is pretty great! The walk up isn't that bad, not sure why this place is in the category for hiking..? But it's a good, quick stop for any tourist. I suggest going earlier in the day to beat the foot traffic.", "author": "Candace L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-13", "description": "This is one of my favorite 2nd date spots in SF. The stairs are gorgeous, there's plenty of free parking, it doesn't cost any money to hike, and when you get to the top (and I mean the top-top...you gotta go a little further to really get there) you can see 360 degree views of SF. When you're done with your hike, take your date for a Titanic-sized mocha at Hollow--the cutest little hole in the wall coffee shops near the mosaic stairs.", "author": "Emyli V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-21", "description": "The hike up the stairs may make you realize how out of shape you are.  Luckily, it is a pretty short set of stairs.  But, if you are bringing a date here, make sure you are in shape so you are not huffing and puffing and embarrassing yourself.  \n\nThe view is really beautiful since you can see the ocean, as well as the Golden Gate Bridge.  It really is a gorgeous 360 view of the city.  We came up on a foggy and super windy day and it was still really beautiful.  I bet it is 100x better when the weather is nicer.  There are also a few benches around for you to enjoy the view, and rest your leg muscles from those stairs.  What is best about this place is definitely the availability of parking!  It is so nice when you don't have to pay a meter or find a tiny spot to parallel park in.", "author": "Jenn W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-25", "description": "I really got delighted with the work done on the stairs and I think a camera comes handy for taking amazing photos from the top of the park. I think you'd better avoid the place on a windy day because you will not have a 'peaceful sightseeing' If you know what I mean. I would advise anyone planning to visit to give a lot of consideration on the weather. A sunny day is better for me, but that is just personal choice. I am thinking the next time I visit this location I will carry a go pro and capture the best panoramic view of SF. Other notable things is that the place has ample parking and is not usually crowded. I think those who like to work out in the hills can also like the place. Overall, Grand View Park is recommended for both tourists and local residents. Definitely 5 stars.", "author": "Brian O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-21", "description": "This park offers amazing views of the Bay Area! Highly recommend for the beautiful views, even though it's a bit off the beaten path for many tourists. Don't forget to walk down the south side to see the mosaic steps! Beautiful.", "author": "Amy S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-03", "description": "Amazing views.  Beautiful view of the city, Pacific and the bay. Must visit and its free!! Awesome experience!! Can get very chilly,  so get a jacket at least.", "author": "Rao S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-19", "description": "AMAZING VIEW!  I ended up here after I ventured up the mosaic stairway, what a great find!!!  This is a must see when visiting SFO!", "author": "Christina M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-08", "description": "This place has really gotten popular in the last 5-10 years. It used to be my secret place.\n\nFirst love.\nBest friends. \nFamily.\nFuture loves.\nExtended family visiting from out of state.\nReal love.\n\nAll these things. All atop this hill. Take anyone here. They may appreciate the view of Sunset neighborhood and the ocean!", "author": "Veranna N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-18", "description": "The view is beautiful and you can't give it anything less than 5 stars. There was a long walk up a few flights of stairs. My family navigated it just fine, including my 7 year old who bounded up the steps effortlessly. There's a nice sitting area at the top with great views over the city and the ocean. It was definitely worth the climb. Bring a jacket as it's windy and a little chilly even in August. Also, keep some water handy. We combined the walk up with a stop at the 16th Avenue Tiled Steps Project. We parked there on the street and walked up...and up...and up.", "author": "Bart H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-12-10", "description": "Two months ago I got off my bus one stop early (review of the 28 - 19th Avenue at a later time) at Moraga and looked up and saw the most beautiful Mosaic staircase in San Francisco. It was a beautiful fall evening with the setting sun behind me. As I walked up the staircase I was blinded by the reflections off the tiles, it was stunning. When I got to the top of the Mosaic I saw my climb was not yet over. I continued to climb up to the top of, what I know now as, Grand View Park for a truly grand view of the city the bridge and the park. \n\nIn my humble opinion this is a much better view than any other of the city because it is quiet, hardly any foot traffic and never would you see a tourist here. And the fact that it's a block from my bus stop helps too. If your looking for a great sunset from the city I recommend the top if Golden Gate Heights.", "author": "Justin S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-27", "description": "The most amazing views in all of San Francisco, and maybe America. Truly spectacular from downtown to the ocean.\n\nGolden Gate Heights is the hidden gem neighborhood in San Francisco.", "author": "Jacob J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-18", "description": "Found this place by accident but so glad we did!  Even though it was foggy and we couldn't see too far, it was still beautiful and so peaceful!  We were cold tho and wet by the time we got back to our car!!  Can't wait to come back when it's clear!!", "author": "Judy S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-17", "description": "I cannot believe that we have passed by this place myriads of times and have just recently discovered it!! We started off at 16th/moraga and walked up the beautiful mosaic tiled steps and walked the steps up to the top of grand view park. There were benches along the way up where you can have a nice little picnic with your hunny but at the very top there's only one bench. Unfortunately the bench was already taken by lovers. It was so nice and quiet at the top. I can only imagine at this point how romantic it would be to watch the sunset over the city from up here!", "author": "Michelle T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-30", "description": "This place is a hidden gem! Just hiked up with my hubby and dog. Loved it, amazing views! Going to go back again to view the sunset which is going to be even more spectacular. You get a real 360 of the city up there. On a clear day like today, we saw all of richmond, sunset, downtown, golden gate bridge, etc. I am definitely going to bring my friends and family here who are visiting SF :)", "author": "Sara K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-11-02", "description": "If you asked me to take you to one of my top favorite spots in the world... I'd probably bring you here! (Maybe I haven't been to enough places in my life??) There's just something amazing about this spot with its one bench perched at the top facing 360 degree views of SF/the ocean/the bay. Fresh air, sun, wind and ocean.... \n\nDefinitely try to make it here on a sunny day. I think it makes all the difference.", "author": "Christine L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-06", "description": "Beautiful view. Easy to moderate walk up the stairs.", "author": "Inigo M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-30", "description": "This place is the best in the city for a sunset. It has great (almost) panoramic views. The city lights at night are simply stunning, and since there have been many clear days it has made the sky beautiful at sunset, plus you can see very far away. This would be a very romantic place to bring your lovers. Folks seem to love being their dogs around, as dogs have a blast running around after each other up and don't the hill. Excellent for pictures, if you're a photographer like my wife!", "author": "Preston S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-10", "description": "I just wanted to leave a tip for people who don't want to climb the long zig zag stairs. There's another set of stairs on the eastern side of the park that starts from 14th Ave. It goes straight up to the park and takes less steps without the zig zagging silliness. You're welcome.", "author": "Nei N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-02", "description": "At the top of the Moraga steps there is a short walk to this second most important site in the area.\n\nThere is a stairway to the top of the hill, which would make it pretty difficult if infirm; for those I recommend the view from twin peaks.\n\nThe view at the top gives you a great, true view of the SF region, from the Golden Gate park with monster windmill to the skyscrapers of Downtown.\n\nRelatively easy parking as long as it is out of the exclusion hours on the signposts ( mostly 8-12 on certain days, if I remember.) \n\nNice visit in conjunction with the steps. And it's free!", "author": "Pantera W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-03", "description": "This is probably one of the best places I've been to for a 360 panoramic view of SF with the ocean view, golden gate bridge, downtown, etc. \nI would def. come back here again for the view. I also like the stair walk up.", "author": "Grace C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-30", "description": "Wonderful 360 view of the city. Couldn't be happier considering the hike up the stairs was only a few blocks from our house.\n\nGorgeous view even with a little fog obstruction. \n\nIf you're looking for a view in the sunset, this is the place to go!!!", "author": "Brett H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-19", "description": "Grand View Park/Golden Gate Heights is probably most underrated scenic attraction in \"The City'. I actually prefer Grand View Park over Twin Peaks....Incredible 360 Views of  \"The Sunset\", Golden Gate Bridge, and East end of San Francisco....Easy to access to and easy stroll up the stairs and instant panoramic views...I also recommend checking out the 16th Avenue Tiled Steps Project which also has great views and a great cardio workout", "author": "Paulson K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-02-05", "description": "I've lived in the city - 17 blocks away from here to be exact - for the first 18 years of my life, and yet I have NEVER been to Grand View Park! So glad I finally decided to find out where those pretty stairs were, and I was so surprised that it's in the sunset.\n\nThe stairs will give you a good workout, even though you're not trying to get a workout. It's worth it though - the views are AMAZING. Another plus is that it isn't as touristy as other scenic spots in the city.", "author": "Miss H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-05", "description": "Amazing view to the city and awesome stairs. If you've never been, recommend to check them out.", "author": "Svetlanko I."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-27", "description": "Nice little park in my backyard! \n+ Easy to get to, GORGEOUS 360 views of the West side of the city\n+ Can still see downtown since we are in such a teeny tiny city\n+ I take anyone visiting SF to this place so they can have a good idea of the size of our city\n- Can get VERY windy. If you are ever shooting photography bring gloves for your hands!!!\n\n**If you have bad knees... be careful!!! There are alot of stairs!!! Its worth it once you get to the top to look at the view!!\n\nConclusion: This little gem is another fun location in this beautiful city", "author": "Julia D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-07", "description": "Absolutely gorgeous! The walk took a bit of energy, but it's nothing a healthy person would find too strenuous. The first staircase has a mosaic all the way up, so start from the bottom and work your way up. If you take a short cut by driving up to the last staircase, you'll miss the best part! It's worth the walk, trust me. Once you get to the top, the view is incredible. You will see more of SF here than anywhere else. I wish I would have brought a picnic basket or camera or something for an excuse to stay a little longer.", "author": "Windy Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-22", "description": "I came here on a sunday a couple weeks ago and it was pretty windy. The view was awesome but wished the weather wasn't so mad and wanting to blow everything. I really enjoyed walking up the steep stairs to get to the top. I think the view would be more awesome when the sun goes down in the late evening.", "author": "Joy L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-07", "description": "Gorgeous mosaic steps leading up to the little tip top Grand View Park. It can get pretty darn windy up there, but on a clear day you can get practically a 360° view of San Francisco! The park is tiny, like really small, and more of a look out point rather than a park. That being said, this is a great spot to just swing by if you're in the area and have 30mins to spare!", "author": "Andrew T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-20", "description": "One of my favorite hills to climb in all of SF. You get an all around 360 view of the city. I went when it was quite windy and no worries to those who are afraid of heights as there isn't really a cliff or anything that you can fall off of. \n\nOne of the best places to take scenic pictures and to take in the view. You can see the Golden Gate Bridge on a clear day and it's a really serene place.\n\nYou get quite a work out if you're coming from the 16th Avenue Tiled Steps Project, but it's well worth it when you reach the top.\n\nI highly recommend coming here for travelers as well as locals. Can't beat this natural attraction! The trees are also pretty unique and cool looking.", "author": "Henry P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-10-10", "description": "Wow, what can you say about this spot?\n\nWell, all I can say is if you have not been to Grand View Park... Come check out GVP on a nice sunny day! You get a very majestic view of the north and west side of San Francisco. \n\nThis is a nice spot to check out the Blue Angels during Fleet Week. You can see a good crowd of people camping out at the top of the hill as well as people hanging around on the east side steps. A lot of folks also hang out at the east base of the hill along the road, to catch the aerial show.\n\nIf you are a workout junkie, GVP provides at least 3 different set of stairs for you to run up and down. Also, the 16th avenue steps is further down on the west side as well as another set of stairs on the north side takes you down to 16th and Kirkham.\n\nYou can also jog or walk around the streets that circles around the hill. So much to do for one grand hill!!", "author": "Sam T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-09", "description": "Beautiful views of the city from the bay all the way to downtown. You can see the Golden Gate Bridge up in the distance too. The two paths up to the top both meet at the lookout point. The views from each level of the stairs are not bad either!", "author": "Jing L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-10", "description": "The panoramic view from the top is definitely wonderful, especially when there is no fog (something that's definitely a factor here in the west side).\n\nHiking opportunities are pretty limited though, it seems such walks are limited to the two stairways leading up and down and the sandy trail just beneath the peak.  The stairway leading up from the south side (Noriega Street) is wooden but less steep and therefore probably an easier climb than the concrete steps on the north side.  In fact, one can see these wooden steps leading to the top from the area around Noriega and 19th Ave, it's such an interesting sight in my mind.", "author": "H K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-24", "description": "Beautiful view of the city. You get a full view of everything the city offers at this park. The stairs to get to the top are tall, but worth the climb. I suggest having someone take your picture here if you are on vacation-you will love the background!", "author": "Stephanie H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-09", "description": "SF is abundant with beautiful parks and this one is my absolute favorite for both the view and experience. Do not forget your camera! Starting up the Moraga and Hidden Garden steps and then up the stairway of the park itself, it's a continuous photoshoot all the way--and since you'll be stopping at every corner for photo ops, you won't even feel like you're trekking up all these stairs. The view from the circling pathway at the top is most definitely a GRAND view. Don't miss this if you're visiting the city. It's rated 5 stars overall for a reason!", "author": "Emi N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-15", "description": "Without a doubt one of the best views of SF. You can see the GG bridge in the distance, GG park (very a la Central Park from above) and the Pacific Ocean all in one swoop. Prepare to walk up some stairs, but absolutely worth every single step.", "author": "Mel G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-04", "description": "This park really does have a grand view of the city. It's a lot smaller than say twin peaks, but it's also a lot less crowded which is a plus in my books! So depending on where you park or start your walk up, the climb up the Moraga steps takes about 5-7 minutes. It's a nice little exercise up to the top.\n\nThe view up there is great. There is only one bench, so there's no actual seating available up top, but the view will take your mind off of that. Best view of the sunset neighborhood that I've seen thus far.\n\nIt's a nice neighborhood treasure to have. Beautiful sunset/sunrise views as well!", "author": "Junel S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-09", "description": "Such an amazing place! If I can give it 100 stars I would. \n\nYou are first greeted with beautiful mosaic steps that brings you to the very top of the hill. I'm not from the area, and was brought here by a friend's cousin. It's fairly hidden and unknown. Also from what I heard, not many tourists come here.\n\nHowever, it has one of the most beautiful 360-view of San Francisco I've ever seen. Just have a look at the pictures. The view was simply breathtaking.\n\nHighly recommended to anyone and everyone who visits San Francisco.", "author": "Michael L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-14", "description": "Good exercise to get to the top, but the view is great. I won't say breathtaking, but uh yeah it is. A stunning panorama of the sunset district and beyond. There are some benches, and rocks, could be nice for a lunch.", "author": "E. W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-09-10", "description": "After walking up the 16th Ave Steps (http://www.yelp.com/biz/the-16th-avenue-tiled-steps-project-san-francisco#hrid:x0DGBD8wbg79eMhvlsRdGw), we kept walking and what do you know...we stumbled up Turtle Hill (aka Grand View Park).  The hill is incredibly teeny but climbing the stairs to get to the top can be a challenge for some.  Great views of Sunset, downtown, and if you look hard enough, the GGB.  But like I said...teeny once you reach the top.  Not one of the those places you would want to chill and enjoy the view with a lunch or anything.  Just climb, snap pics, and walk back down.\n\nGreat views but not one for the hiking books for me.", "author": "Ninja H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-31", "description": "AMAZING view of the city!!! It's such a hidden gem that I never knew about this spot. It's quite a ways getting up to the park after going up the mosaic stairs but it is absolutely beautiful. It's also freezing and windy once you get to the top but the view is breath taking.", "author": "Jeena L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-06-04", "description": "great little secret place in SF. on a clear day you can get a great panoramic view of SF from downtown to the ocean with the Golden Gate in the middle.  It's also a quiet place. So hike up here and just take a look at a view of SF that post cards and internet searches missed.", "author": "Jason C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-26", "description": "Although Ironically one of the most IG'd (Instagramed) and facebooked locations in the large metropolitcan city of San Francisco, it is actually located in a fairly quiet neighborhood. The view truly is grand, as there are very little visual obstructions such as trees and buildings that may deter you from taking a great panoramic of the city. Be forewarned though, as the popularity of this place slowly rises, so do the amount of visitors, which makes all the more challenge for a tourist-free picture of the breathetaking staircase. Best of luck, definitely come in the daylight if you'd like to see the stair case.", "author": "Hansel B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-06-19", "description": "LOVE this park. It's one of my top local secret spots in San Francisco. I've been here both in the daylight and late at night, and both are just amazing. There's a single bench at the top facing Golden Gate Park, but you don't even need the bench to enjoy the sights. From there, you can see Sunset, Richmond, Downtown, and the entire span of Golden Gate Park. Simply beautiful.\n\nThis is my favorite local spot to watch the fireworks on New Years Day too. There aren't very many people, AND the view of the fireworks in addition to the view of the city is a spectacular view.\n\nI also tend to meet the most unique individuals up there too. Once I met a man who gave my friend and me a quiz on San Francisco, because he wanted to make sure we were \"true San Franciscans\". He asked us how many miles San Francisco was in length and width. He said 7 miles by 7 miles, but he was also drunk, so I'm not sure if his answer was correct...\n\nThe only minor problem I have is that I get lost about 90% of the time trying to find it, and then when I finally do find it, there's the trek of climbing a million stairs to get there, but I suppose that's what makes it so amazing :)", "author": "Caitlin C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-14", "description": "Best view all the way from ocean beach to GG park to the top of GG bridge to DT SF to the east bay to the top of twin peaks. \n\nA hidden gem!", "author": "Chesca A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-26", "description": "You get a great view, almost 360 of SF up here. Golden gate bridge, downtown, golden gate park, etc. Site can be quite romantic with the moonlight guiding your way up. Beauty day and night!", "author": "Henry P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-04-16", "description": "I love how you can see both downtown and the ocean while standing in the same spot.\n\nIts quiet, not crowded.\n\nOnly drawback is the broken glass all around the top of the hill.\n\nCame up here on a beautiful Sunday afternoon after walking up the Moraga steps (Moraga St between 16th and 15th avenues) to the base of the park.\nNote that you'll have to walk up a lot of steps to get to the peak of the park to savor the great view.", "author": "Norman P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-07-22", "description": "I really didn't know much about this park until I was walking in Golden Gate Park and noticed a hill topped with trees to the south. I looked on the map to see what it was and how to get there and next weeend I came up to Grand View Park. \n\nThe park earns its 5 stars just from the amazing view at the top! There are a lot of stairs but the climb to the top is definitely worth it. There really isn't much more to the park than stairs and a view but that doesn't make it any less sensational. One can spend a couple of hours a the top just examining the view.", "author": "JD R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-04-07", "description": "So my dear friend Samir and I were waiting for our Tour de San Francisco partner Kiersten to arrive to walk over to Golden Gate Park.  We were parked near Enjoy Vegetarian Chinese Restaurant in anticipation of working up a huge appetite for the evening repast.  I wanted to show Samir a great walking area, but Samir was already better informed and experienced than I was.  Up 12th to Lawton we went.  Past that to Moraga.  Then westward up Moraga to 14th Avenue and several sets of really steep steps.  Check out the pictures I took.  What a great day Friday, April 6th was.  What an incredible vista!  So this is Grand View Park.  How lucky the Inner Sunset residents are to have this park so close at hand!", "author": "Em S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-28", "description": "This is one of the best views of the city by far. 360 and sitting just high enough above everything, the city feels tiny and huge at the same time. It's a little bit of a work out coming from either stairway, but it's very manageable if you pace yourself. One side comes up from the tiled steps, and I recommend doing a joint trip for the two. Beware of the raised metal steps though. There is railing but for those uncomfortable with small heights, it can feel a little lacking in support and scary. The alternative is a stairwell on the other side which hugs the hillside, so that's less intimidating.", "author": "Grace T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-10-25", "description": "When I really want to get away from it all,  I head to Grand View Park at the top of Golden Gate Heights and right smack in the middle separating Outer and Inner Sunset Districts. \n\nI spent the most beautiful morning on the steps of Golden Gate Heights again, and up to Grand View Park for the most spectacular views of the entire City.  \n\nOnce at the top, you have the Pacific Ocean to your left, Golden Gate Bridge in front of you, and the Downtown skyline on your right.   And right there all alone, I couldn't help but think to myself  \"It really doesn't get any better than this!\"\n\nI've been so busy lately, so it was such a great treat to be spend my Sunday morning enjoying the weather and the beautiful views by myself reflecting on important things in life.  \n\nGrand View Park beats out Twin Peaks for me because of the fact that it's right in my neighborhood, and there is rarely anyone around...so tourists are really missing out on a treat (A good thing, as the last thing this place needs are the flocks of  footsteps from tourists) \n\nI love the little benches that are scattered around for those picturesque quiet moments to relax.  \n\nAfter enjoying the views of Grand View Park, I continued on my trek for more Golden Gate Heights steps that seem to just pop up out of no where---Cascade Walk, Aerial Steps, and Mandalay Steps, and of course my favorite 16th Ave and Moraga Tiled Steps.   It's so much fun wondering where you will end up next.  \n\nHands down, my favorite spot to get away from it all, amidst the beautiful views where I can enjoy my own time all to myself!", "author": "Cass J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-07-30", "description": "I went here for the first time today and WOW! What an amazing view!\n\nYou can see absolutely everything - downtown, top of the bridge, the bay, the park..\n\nWhat a great place to hike up to and spend some time sitting on a bench :)", "author": "Deirdre L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-17", "description": "great outing along with the stairs, love this place. Great for tourists.", "author": "redtulip s."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-04", "description": "Fantastic panoramic views of the city. It's the place to capture photos of the fog rolling into the city (though I didn't see the Golden Gate from here...perhaps I was too late). The only hitch is that you'll have to climb a flight of stairs to get to the top. The best way to stop here is to park just below the mosaic steps (16th street tile steps) -- free parking and head your way up!", "author": "Mimi C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-12", "description": "Beautiful spot and more peaceful to me than Twin Peaks. You have to walk up a lot of stairs in order to get to the view point so you do not see too many drunk people with their music blasting late at night. I definitely recommend this spot, which is possibly the best view in the city.", "author": "Joey I."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-25", "description": "I love urban parks. The view at Grandview is nothing less than spectacular; it's vast and romantic. As obsessive as I am with Google Maps, it was awe-inspiring to see the streets lined in real life: foggy Golden Gate Bridge, Richmond district, Golden Gate Park (with de Young museum, California Academy of Sciences, 19th avenue/highway 1), Sunset district, Forest Hill, UCSF/Mount Sutro, Twin Peaks, Point Reyes, downtown SF, and much more. So beautiful.", "author": "Jay C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-22", "description": "Nice vista point to enjoy the view of the city. It is a hill with a great set of steps, like spaghetti strewn across the hillside. If Twin Peaks is pretty for the overwhelming view, height, and area then Grand View Park is beautiful for its enchanting charm of being a small, captivating, and intimate vista. If the trip up Twin Peaks is great for making one anxious and excited to reach the end point then the trip up the stairs of Grand View is great for the making one enjoy every step and every detail. Twin Peaks is about being at a great view. Grand View is much more about the journey traveled and arriving to a great view. A much more intimate place you share a moment with between the people you arrived with.", "author": "Kelvin M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-01-05", "description": "A lovely little park, just one more reason to love this city. The view is great, but the emphasis is more on the Sunset/Pacific Ocean than a full 360, IMO. The steps up aren't bad, but it will likely be quite windy at the top. We tried to have a picnic once with limited success. Lots of off-leash dogs.", "author": "Megan S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-29", "description": "Great view of San Francisco. You can see the Golden Gate Bridge. Took me a while to get there by bus, but it was definitely worth the trouble. Walking up the stairs to the top was tiring, but it was worth it when I got to the top and saw the beautiful view. On the other side, there are Moraga steps which were very beautiful. This is a place worth visiting.", "author": "Sylvia H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-19", "description": "Climb up the exquisite 16th Avenue Tiled Steps, a wooden staircase, another staircase, then take in the view: Pacific Ocean, Marin headlands, the Golden Gate Bridge, downtown, homes, churches, etc. Make sure to go when it's clear. \n\n(Completely personal aside: I went to vibrant, sunny, hot Utah last week and grey, foggy, cold San Francisco has been a bit of a Debbie Downer. This view made not being in Utah anymore suck less.)\n\nEnjoy.", "author": "Yan E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-30", "description": "This IS the best view in SF. Not as busy as all the other places like Twin Peaks and you get a full 360 degree view of the entire Bay Area which includes the Golden Gate and Bay Bridge. It's not that hard to find this place and this is the perfect place to just chill out and relax after a long stressful day. Amazing!", "author": "Stephen D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-07-02", "description": "It was one of our earlier dates. One clear, brisk Sunday evening, after a long day of work he called me up and asked if I wanted to get something to eat and hang out with him for a bit. Of course I said yes - he whisked me away to Gordo Taqueria to get some burritos, then drove to houses unfamiliar to me in the Sunset. \n\n\"What are we doing here?\" I asked. \n\n\"You'll see.\" He replied. \n\nHe took out a blanket from the back seat of his car and with burritos in hand I followed him to the bottom of a staircase. Looking incredulously at the height of the stairs he smiled and urged me to start climbing. On the steps were murals of the journey, starting from the ground to the sky. \n\nI remembered being tired and restless but I kept following him up. It was already dark and as he gingerly took his steps on the dirt, he grabbed my hand and led me to a bench with one of the most beautiful views of the city that I've ever seen. The bright red and yellow lights of the western part of SF, the black silhouette of Golden Gate Park dividing the Richmond and Sunset Districts, and the always breathtaking Golden Gate Bridge was our backdrop.  We sat down on the bench, covered ourselves in the blanket, and started talking and eating the night away. \n\n\"This is my favorite place in the city.\" He began. \n\n\"Do you take a lot of people up here?\" I asked. \n\n\"No,\" he said, \"You're one of the only ones.\" \n\nI love this place and I love this man.", "author": "Devy E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-09-05", "description": "This is place is great for workout. If you are someone who don't believe paying gym membership, come to this place, you'll get some cardio workout. Don't forget to get your dumbbells. \nThere's plenty of free parking everywhere, so no worry", "author": "Spike P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-15", "description": "Despite the fact that this park is just 4 blocks away from my cousin's house and I'm always there playing with my niece and nephew, I've only been up here twice. It's kinda a steep walk for the kids and though it seems to take ages (guess that's what happens when you have to constantly stop and smell the flowers, grass, bushes, etc) it's worth it because you can see all the way to the ocean at the top - not one but both windmills in the park! And the De Young! The Golden Gate Bridge! Downtown! Seems to be a popular spot because they've got benches up there as well as broken glass and prayer flags (try explaining prayer flags to kids). People kept appearing and leaving during the time we were there. You'll never get this spot to yourself.", "author": "Jean K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-04", "description": "This is a great place to exercise and an amazing view. With any body new that I meet I always show them this view. So relaxing and a romantic view for couples. Definetly suggest anyone to walk up there but car works too lol", "author": "Rosa A. F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-09-28", "description": "If you have never been to \"turtle hill\" the SF natives like to call it then you have not seen an amazing view of Golden Gate Park, the Golden Gate Bridge and the ocean....on a sunny day!!! It's also very pretty on a clear night as well but you need to be careful!!!\n\nNot only do you get to see three beautiful parts of the city but you also get an awesome workout for your bottom and legs, lots and lots of stairs to climb!!!\n\nBring some water, wear some good shoes, bring your camera and take in the amazing view of part of SF!!!", "author": "T C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-01", "description": "SUCH a great view.  At the top of the 16th Avenue tiled steps, there are more steps leading up to the top of hill where after a climb, you will be treated to a breathtaking view of the city.  It's a free attraction, and is definitely worth visiting.  Whether you're a local or a visitor to the city, this place is definitely a must-see.", "author": "Christine W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-03-05", "description": "AKA Turtle Hill ..Some days I like to climb the stairs and view my beautiful city. This used to be a stoner hangout not that I know anything about that. \n\nThanks to the diligence and pride of neighborhood residents the staircase was replaced and benches were installed.  The ecology is being protected now. Monterey cypress trees to the Franciscan Wall flower and Dune pansy.\n\nThis is a small park less than 2 acres. On a clear day one can view the Golden Gate bridge, Pacific Ocean, Golden Gate park and the San Francisco Downtown skyline as well as other hills like Sutro tower in a 360 degree panoramic view. \n\nThe park is a 140 million year old geological Franciscan rock formation formed from sentiment, dust and sand blown and carried via rivers from the California Sierras. \n\nI love coming here to relax and gain perspective on life. I am really glad there is a bench overlooking the grand view. I love that workout climbing up the stairs. Check it out if you can.", "author": "Infodiva B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-02-05", "description": "My math isn't that great, but let's give this a shot.\n\nTwin Peaks - Euro trash - fobby tourists - hormonal teenagers at night - sorority girls posing in their letters - families - any type of crowd + a flight of gorgeous, mosaic tile covered stairs = Grand View Park.\n\nGVP at 14th and Moraga is where the Sunset's best kept secret can be found, high atop a few sets of relatively easy to climb stairs. Not strenuous at all, just perfect for a peaceful, 360 view of one of the most beautiful cities in the world.\n\nGo.", "author": "Betty W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-24", "description": "Awesome 360 view of San Francisco . It was a beautiful. The stairs was kind of high got me tired half way. But i am scared of height and out of shape. Older people we're passing me up lol . A must see if ever visiting sf.", "author": "Nguyen L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-07-28", "description": "After my walk up the The Tiled Steps Project, I found more steps leading up... and up. I can't help but follow steps when I don't know where they lead, and when I see others also climbing upwards.\n\nOnce you make it to the top, you're in for a gorgeous (albeit chilly) view of San Francisco from all sides. You can also watch foggy clouds roll in from the coastline. \n\nClimb for the view, take lots of pictures, but if you're thinking of hanging out for a bit, don't forget a jacket! It was a 27 some degree day in SF (Celsius, I believe that's around 80 or so Fahrenheit) and I was getting goose bumps just hanging out up there.", "author": "Wendy P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-04-23", "description": "If you're ever in the Sunset District when visiting San Francisco, this is the park that you must visit if you want to reach the top and see spectacular 360-degree views of the west side along with Golden Gate Park and yes, Ocean Beach. Which means climbing a large number of steps, but you know what? It's worth the exercise! Try to come on a sunny day if you want to see the most beautiful views, although I'm sure it'll look just as nice on a foggy day!", "author": "Paul N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-23", "description": "I would have to say I absolutely love the view from here! It offers a 360° view of frisko! Definitely worth making time to check it out if you're in the city. Such a romantic view :)", "author": "Jenny S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-04-08", "description": "I can't believe I never discovered this place in my 25 years of living until recently! \n\nI knew about the tiled-steps on 16th, but I didn't know there was this amazing space beyond those steps! It's like a tiny hut with a spectacular 360-view of the whole city. I like how there's a bench for people to just enjoy and relax the mind. Air is also very fresh. You are so high up that the ocean waves look like an oil painting.\n\nThose steps don't look like much, but they will definitely work your glutes. I think I just found a new favorite place to relax! :)", "author": "Jenny M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-09", "description": "This place has one of the best views of the city! The only major issue I have with this place is the weather at the location. It is almost always foggy and damp when you get up to the peak, where a \"grand view\" is (supposedly) spread out before your eyes. But during the warm, sunny days, you can see as far as the Pacific Ocean. At night, you can see the breathtaking city lights gleaming from the buildings and homes of the S.F. citizens. While you're up on the peak, why not snap a few photos too?\n\nAlso, if you're one of those people who like to get out of the house for a workout, you should make a visit to Grand View! :)", "author": "Winnie W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-22", "description": "A great 360 degree view of San Francisco. I've been here at least twice in the past 6 months; the city is continually improving it and helping to preserve the area. There's some native foliage that grows only here in the city, only place it's left actually, since there is some of the original soil from the sand dunes that were leveled to make Golden Gate Park, housing, etc.", "author": "Ken L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-07-16", "description": "Twin Peaks jr. \n\nCrowded at times with runners, tourists, lovers, and anyone else with enough impetus to climb up how many steps?!! \n\nAmazing panoramic views. \n\nReally worth it. Expect wind.", "author": "Mr S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-04-29", "description": "Like many other yelpers, I had never been to this park until recently. Getting there can be a bit confusing if you're driving, but parking is plentiful, and the view is definitely worth the climb up those steps. It's not crowded like Twin Peaks, but don't be surprised to find a group of teenagers hanging out there, with some, ahem....questionable substances. \n\nBest time to go would be late-afternoon, but if you're going to go at night, remember to bring a flashlight. There are tree roots sticking out and the dirt path is not level in some places, plus there are no streetlights. But all that can be forgiven, because the view is phenomenal.", "author": "Nadia A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-27", "description": "Fabulous hidden treasure! The tiled Moraga steps are beautiful enough, but climb them and another couple hundred to the top. The summit of Grand View Park is tiny, but offers spectacular views completely across the SF peninsula. Often bathed in fog,  but get there on a clear day and wow!", "author": "Richard D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-08-25", "description": "San Francisco, thank you. You're views are amazing and your hills from which i look out from are outstanding.\n\nGrand View Park is pretty much just that... one of the grandest views of SF. Lets see... you get the ENTIRE Sunset and Beach view, the Golden Gate and Richmond areas, of course there's parts of Downtown... i mean really, you can almost see it all.\n\nBut gosh, you're telling me now i have to climb back down?!", "author": "Greg G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-01-08", "description": "I've been meaning to visit this park for a while, but I never made the trek until this afternoon. Simply amazing views of the Pacific, top of the Golden Gate Bridge, Sunset District, GG Park, and downtown all from a perch atop a big hill with lots of beautiful trees.\r\n\r\nGetting here by foot is a bit of a workout--the most direct (but maybe not the easiest) route from Golden Gate Park is to take 15th Ave up to Kirkham and taking the scary, secret stairs up between 14th and 15th Aves up to Lawton St. From there, you can take another set of stairs at 14th and Moraga or 15th and Noriega up to the very top. (You could also drive, but it wouldn't be as rewarding... :)\r\n\r\nMake sure to save a good spot on the west side of the hill for a perfect view of the sunset. I noticed a lot of couples came up here for a smoochfest (blah) but you also get a lot of joggers and random folk, too. One of SF's best-kept secrets, in my opinion...", "author": "Richie K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-10-23", "description": "Went there yesterday by myself. There were a lot of people-- usually couples, group of friends and ppl exercising; few tourists. I watched the sunset and it was beautiful. I want everyone to see this place.. but at the same time, somehow, I wanna keep it a secret.", "author": "Yer L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-29", "description": "OMG this place is very amazing.  Good hike going up and the view is amazing.  I didnt even realize this place exists and we only happen upon it by accident.  All I can say is \"wow\"!", "author": "Elc C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-18", "description": "Amazing. Can't believe I used to take friends visiting to Twin Peaks.", "author": "Jordan R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-30", "description": "One of the best views in San Francisco, 360 degree, sand dune park.", "author": "Ernst L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-17", "description": "Tourists all head to Twin Peaks. Grand View Park is so much better: more likely to be clear, much less crowded, panoramic views. There are quite a few steps up, and it's not the easiest to find even with GPS. But whenever I have out of town guests, we head here. I almost didn't write this review, because I don't want it to be spoiled. Probably half the time I go there, I'm the only person on the peak.", "author": "Frank W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-05-10", "description": "I have never actually been here before despite living so close to SF and always going to the city to sight see. There is a very beautiful staircase called the Moraga Stairs that leads you up a hill. For those with heart conditions you should probably take it easy. The staircase is made from colored tiles that create images and they look really nice. Very unique little something. Once you get up the stairs you can keep going up and up more flights of stairs which are plain, no color or pictures. But once you get to the top there is a bench and a pretty amazing view. I came during sunset and it was goregous. Good little vista point to walk to.", "author": "Jeromy G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-10", "description": "Perfect for little workout and great place to sit and absorb the beauty! Gorgeous sunsets from here!", "author": "Juliana B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-03", "description": "I come here on any day with friends and park the car along the streets and just chill in the car. Chitchatting while looking at the awesome view of this beautiful city. It's not overrated as twin peaks and it's super close to sunset district. I love it!", "author": "Lydia C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-10-08", "description": "I was curious about this place boasting so many amazing reviews about the cityscape, I was even more excited that its not too popular (#instanthipstercred). I went there last weekend and it was BEAUTIFUL. It's an unsuspecting park with amazing views of all of SF, you can see from one corner of the city to the other all in a quick walk through the sand/dirt pathway. This is not just for tourists, its definitely a place for anyone wanting to see the hotness that is SF. PS- parking along the street is super easy.", "author": "Rina M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-22", "description": "Another place with great views to the city!\n\nThere are only a few great stopping points with sweeping views that won't be scattered people here and there.\n\nGreat views of the northern portion of San Francisco.\n\nTIP: Pretty dusty paths (not packed/paved trails), so wear close toed shoes", "author": "Angel L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-11-30", "description": "I cannot believe my sister has lived four blocks down the hill from this park for the better part of a decade, and I just finally climbed the stairs to the top this weekend.  In my defense, I live twenty-two hundred miles away, but you would think that would mean I'd be itching to get to the highest vista possible when I come out!  From this point on, Grandview shall be my go-to get-away whenever I'm in this beautiful city, since I can see so much of said city from the top.\nThe view east is breathtaking, as the city winds behind Mt Sutro, the view north is a beautiful vista of the Golden Gate Bridge behind the park and the Presidio, but my favorite, the view west, is the shining city gleaming white in the sun as it stretches to the ocean and the vastness beyond.  I wish I could have stayed for the afternoon with a picnic and a bottle of wine to watch the sunset.", "author": "Kevin M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-03", "description": "From here, I would ponder... deeply ponder... windswept and fogged in, a little drunk and lonely and underemployed and with time so vast and pocketed with decay spread out like gridded avenues across the landscape of my self-importance. Back when I lived in the Inner Sunset, this would be my go-to, and if I still lived here, it might be. I'd take 14th straight up until you hit steps, and goddamn there were a lot of them, and damn if they weren't steep. But for a lonesome time in your lonesome life when you just want to be alone, looking out at the vast enormity of Life's Miracle happening in front of you, do climb, and ponder... do ponder... bring a coat.", "author": "Roy M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-03-02", "description": "It's 5 o'clock somewhere and you've got a hot date. Out the door of your building you gaze up to find a clear sky. Should be a beautiful night tonight.\n\nA quick trip to the Sunset brings you to the bottom of a steep wooden staircase. You smile, happy to have remembered to wear your sturdy running shoes. One strong step at a time you climb, spiraling around a dusty hillside. Each set of stairs leads to another and you cant help but stop to admire the view in between. At last your trek brings you to the top of the hill, your eyes wide with delight as you take in the view. \n\n360* of Beauty .\n\nYou take a moment to find a comfy spot, finding every viewpoint to be a fantastic one. With not a tourist in sight, you settle in to enjoy a serene San Francisco sunset. The sun slowly sets, colorful lights highlight your view. From the top of the hill, all your worries seem so far away, you are at peace. \n\nThe sky grows dark, time to go. Slowly hiking down the stairs, you watch as the city's lights begin to illuminate the night. You head home, satisfied and smiling, already longing for another hot date.", "author": "Caroline J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-13", "description": "Great work out to get there.\n\nOver 5 endangered species to ogle.\n\nOne of the best views in the City.\n\nWhen there is not 80 days of straight fog, best sunset view as well.\n\nGood for a date walk and talk.\n\nTry a picnic, a picnic with wine that is.", "author": "Joe Bob J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-02", "description": "This little park - which basically amounts to a bench on top of a hill - is pretty wonderful.  If you are lucky enough to visit on a sunny, warm day it is a real treat.  Or you can go on a less pleasant day and watch the fog roll in which is kind of interesting but I mean it's really cold and windy, so just be prepared for that ok?  Either way the view is as good as you're going to get in this part of town and the tile stairs are really lovely.  Oh yeah, it's a lot of stairs to get to the top.  Totally doable but just be prepared.  I like to walk up on my lunch break to really feel like I'm doing something \"active.\"", "author": "Shauna L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-05-30", "description": "This used to be the place I'd go to when I needed a little bit of fresh air to clear my head.  It was right in my backyard and offered a challenging walk up to a beautiful view of the slower side of SF and Ocean Beach.\n\nThere are a few ways to get up to this little park and my favorite is the mosaic steps at 14th and Moraga.  You can see the sun, moon and stars embedded in the steep steps leading up to the wooden stairs that take you to the park, which offers a bit of whimsy as you huff and puff up.\n\nEach time I've gone it's been windy, so a jacket or sweatshirt will definitely come in handy.  It's not a great place to picnic though due to the rocky outcroppings and uneven ground, but great if you just want to sit for a little while and take in the sunset.", "author": "Janet L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-04-05", "description": "Grand View Park is perfect if you're looking for a panorama of San Francisco.\n\nUp many thigh-busting flights of stairs and a semi-steep hill of loose sand and dirt, over a few makeshift-ladder rungs of old tree roots sits a small bench that, when sat on, can make you feel like you're at the top of this city. \n\nThe view is magnificent.", "author": "Elizabeth T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-18", "description": "After you surpass the crazy amount of steps, you are able to see the beauty of the whole city. Great place to take a friend, a date, or someone who is visiting SF.", "author": "Sonlay V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-29", "description": "This park offers great views of the city, but the hike is rather short and the park itself is rather small.  The worst part is the weather at the top of the park can be windy, cold, and foggy.  Otherwise it's a great place to bring guests for a one time city view treat.", "author": "Victor S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-10-05", "description": "Sadly, i visited this park when it was pretty foggy. But it was still a breath-taking view. Deff. worth the many beautiful stairs we have to walk to get up to the top. Read the words of the bench, btw.", "author": "Analleli G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-31", "description": "Home of the prettiest staircase in SF; the Funston and Moraga mosaic stairs feature bits of glass and ceramic fish, flowers, bats, squirrels, and birds.  Families and business names are imprinted on some of the pieces (e.g., Arizmendi Bakery).  Flowers have been planted next to the stairs.  Towards the top, the tiles and glass form a mosaic picture of a moon and then a sun above that.  \n\nOnce you climb to the top, veer to the right a bit and go up the concrete steps to reach the wooden steps that take you up to the top of Grand View Park.  The park is small and peaceful with sandy patches and trees. It gets very windy up there and you can see (not surprisingly) a grand view.  They have problems with people leaving broken glass up there so wear shoes.  If you climb down the other side, you'll find another set of concrete stairs.  \n\nCaution, the Moraga tiled stairs can be slippery.  They're also fairly popular but not as popular as the Lyon Street Steps.", "author": "Lolia S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-08", "description": "Lovely view and improvements are being made on walking paths and maintenance.", "author": "Gregarious B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-04-03", "description": "As the last sizable hill before the ocean, this park is a must for vista-lovers.  It's also got a *very* recognizable profile, basically a tiny clump of trees atop a very round looking hilltop, leading to its nickname of Turtle Hill.\n\nOn a clear day you can see the entire sunset and richmond districts, the Golden Gate Bridge, and even downtown SF, though the view to the southeast is blocked.  Great place to take SF newbies on a geographical-orientation tour of the city.", "author": "Wes M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-01-20", "description": "So that's the name of this place, huh?\nThe wife and I have spent many a sunset here....\n....just us, fresh air, a blanket, couple of glasses, and a bottle 'a vino.\nSprinkle in some good conversation, the occasional passing of\na wagging canine, a smiling face or two from other passers-by, and the feeling is right up there with that post 160 bpm artery-cleansing endorphin high, minus the sweat.\nWell I did sweat there once....\n...and cried...\n...and got one dirty knee...\nOne crisp, clear Christmas morning...\n...its where I got engaged!", "author": "Barry A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-11-30", "description": "Finally climbed to the top after living in San Francisco for 2 years.  Not as convenient to get to as Buena Vista or Corona Heights, but is a great 360 degree view of city, GG Park, Sunset, and Ocean Beach.\nDefinitely worth the climb!\n\nNot protected on a windy day, so try climbing the hill when the wind is calm.", "author": "Keith K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-06-05", "description": "How many names?\n\nTurtle Hill\nGolden Gate Heights Park (incorrectly)\nThat hill in the inner sunset\n14th and Noriega....\nThat mural stairway park\n\nWhatever it is, I have seen more PERFECT sunsets, and more serene, maddenenly beautiful moments of my lifetime.  6pm.  11pm.  2:30am.  4am.  7am....\n\nso many moments, thoughts, people.... so many of the most dire moments in my life... those imbued with energy and emotion, and love, and expression.\n\nI love that damn place.  Little windy at times, tho.\n\nI am so glad I live a block away!", "author": "Uncle Fishbits Aeneas X."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-09-13", "description": "We made the trek up here today...have you ever noticed that the hardest part of most \"hikes\" in San Francisco is getting through the residential area to get to your hiking place?\n\nThe view is amazing, and the benches are perfectly placed (great quote on one facing Ocean Beach: \"The violets in the mountains have broken through the rocks\")- though I am a little sad they are all dedicated to dead people who died young. Debbie Downer!\n\nThere were a bunch of kids playing capture the flag, which was really charming considering they were about the age when they really should have been smoking pot in their parents' basement.", "author": "S F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-11-30", "description": "The view (like the climb) is indeed quite spectacular and even more enjoyable if attempted on a clear warm day in November with barely any wind.\n\n360-degrees of gorgeous -see the entire city - from the edge of the ocean beach and the acres of the Sunset, to the Presidio and far into the Castro... we are blessed to have these places in our fair city.\n\nBring a book or the paper and some refreshment for a beautiful, quiet, absolutely stunning afternoon.  \n\nIt's not much of a place to take the puppy (the climb is good, but there's not much space to run around).  Also - beware the broken glass scattered about that could hurt tender paws...", "author": "Claudine C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-04-03", "description": "Wow, nice moves you got there. Grand view is right.\n\nOh, didn't you know that everyone on Mt. Sutro can see you?", "author": "GIR .."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-03-01", "description": "great views of the city. Hands down better than twins peaks, no tourist. There 2 ways to enter grand view, (Funston Ave & Moraga St) or (15 Ave&Moraga). But if you come from Moraga & 16th Ave you come across never before seen tiled stairs.", "author": "Robin L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-08-22", "description": "i would like to have my future home around this area. The view here is great. I love how it's still in SF, but secluded.\n\nI came here on a beautiful late afternoon and love it. I like the houses, the roads and the VIEW.\n\nWatch out neighborhood, DLee wants to be your next door neighbor.\n\nThe stairs is cool. I like how there are benches for people to sit and enjoy the sunset.", "author": "David L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-11-05", "description": "Really cool mosaic on the stairs leading up to this place from 16th avenue. Looks like a steep climb, but it's not bad. Great view of the city from the top. Word of advice. Don't go on a foggy day like I did.", "author": "Linda H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-07-21", "description": "I always take out -of-towners here. I love that it has amazing views and no tourists. (Unlike Twin Peaks, Coit Tower...)\n\nI feel I really am a little hard on tourists, considering 6 months ago I was one. Saying that, I didn't wave my disposable camera in people's faces, clog the streets waiting for a cable car, and hold up buses cause I had no fucking clue where I was going. So I take it all back. \n\nIn fact, I take everything back: Don't go here...it's terrible. Especially you kids with your Smirnoff Ice. ...Wow! I'm just hating on everyone today.", "author": "Ali L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-03-01", "description": "When it comes to being romantic and making my heart skip a beat, my one and only never fails to amaze me.  So he looks up (on yelp, of course) this place since we love nice views (and everything that comes with seeing one).  Not many people know about this place (versus Coit Tower, and btw do NOT go there!  Those added bushes covers the view and it's just played out, so at least go to Twin Peaks instead).\n\nIt's easy to find parking here (I've always wondered what it's like to live in the houses nearby these scenic spots).  Make that lil' hike up the stairs, you'll be wheezing and gasping for air like me (jk, I'm not too bad with that I think) and when you make it to the top, lo and behold, you'll see all of SF, no matter where you turn.  This is the time to get an all around 360 degree view of the city, which I like.  And plus, it's never crowded here, the max # of people I've seen here is a few (and for some reason, they're always with a dog, but I like dogs so it's all good).  You can enjoy a nice, quiet moment with whoever you're with/by yourself.  I'd go run up here and read a book, shoot.\n\nSo, make the trip here.  Actually before you do, go hang out in Golden Gate Park, since it's nearby.  And after you do, well, Twin Peaks is only a couple miles away.  Might as well take in all the lovely sights of SF in a given day.", "author": "Lili K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-03-03", "description": "Here you stand watch over a tranquil view superimposed upon a rock of fearsome wind shear.  The ocean looms cold and omni in a flat, unmoving line.  Adults are bunkering in their homes before you in all directions trying to keep warm; their kids alongside you are puffing up with rather similar goals.  I suspect some are from St Francis Wood, others maybe from Miraloma.  \n\nThis is the penultimate birdseye of the San Francisco Outlands, beautiful and yawning before you ... the only place where  you can stretch your arms and hold all of Golden Gate Park at one time ...  the only place where the Sunset monotony is revealed to be a beautiful swan, and for possibly once a day where those smart green flashes can be seen as our only Star burbles and sighs 'neath the ocean blue.\n\nThis place is the most magical part of the City that you've never been to.  Make it a habit at least once.", "author": "Jim W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-10-11", "description": "I came here on a foggy day, so it was so surreal seeing myself up high and just seeing fog in front and below me.  It's almost spooky with the trees.  It's a small walk up to the top, where there's a bench perfect for pictures.  There's also sand everywhere.  I would definitely try to go on a sunny day because I hear it's a great view.", "author": "Lily N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-11-10", "description": "Okay, here's what you do. You go to Underdog at 17th and Irving, and get a delicious veggie hot dog and tater tots to go.  Then, you go to 17th and Moraga and look in awe at the beautiful tilework on the stairs leading up to Grand View Park.  Climb, climb, climb, eat eat eat. so pretty!", "author": "Mark S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-01-18", "description": "Not what I thought it would be but ended up being more.  It's not a \"park\" per say, akin to Lafeyette.  It is, however, the most beautiful overlook I've seen to date.  The sights:  downtown, old Golden, the Pacific, Twin Peaks.  Once you overcome the steps, there is a sand path that circles around to the overlook at the top.  \n\nFYI:  Some jagoffs (Pittsburghese for a-hole) must think it funny to break bottles up there so watch where you step.", "author": "Patrick W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-01-30", "description": "I want to get married here. And to me, it's Turtle Hill.\n\nI have friends who grew up in the Inner Sunset who took me here a year ago, but most importantly it's where my smoosh A grew up. The view is so amazing, you get to see a little bit from all different angles. Very panoramic. There this zen like calm at sunset, and euphoria I feel when I'm there, regardless of my day.\n\nWhen I use to visit from the East, and A lived up in Sac at the time, it was our tradition on our last night before I fly home to grab some coffee - climb those damn stairs - and sit for a while. He told me before, it's where he goes to think, hangout, fall in love, and apparently almost burn down the hill (but that's his story to tell). I can agree with him about the falling in love. Everytime I had to leave, I fell in love with him more on top of that hill, and just knew I would be back for good.\n\nA year later, a district over in the Richmond, but I'm in SF and we're working on getting back to the Sunset. Still, it's one of my favorite places in this city to fall in love, it's what makes SF home to me.", "author": "Jacquelyne L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-03-05", "description": "Please don't tell anyone about this park. I want to live across the street from it one day. Or if I'm too poor for that (likely), I'll just live in a tent within the boundaries of the park. \n\nSunday was a warm day in the city, & the usually everpresent cold wind that makes this park barely tolerable wasn't blowing. Consequently, it was the best place to be in the city on a warm, late Sunday afternoon.", "author": "Pete J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-05-05", "description": "Please if you go here at night, BRING A JACKET!!! I had a thin jacket on and probably caught a cold, but it might have been worth it! The view is nice but I only wished that I had come here during sunset or sunrise instead of at night.\n\nI find the view here comparable to the one at Twin Peaks, but I think Twin Peaks has the edge. When you're at twin peaks you can see this as a small mound . What can you expect though, its in the middle of sunset so that's about as good of a view as you can get there. I've driven around this area hundreds of times before but never noticed this park until Yelp. It's a nice find and pretty cool to have it situated where it is.\n\nAn interesting note - I read a sign while at Grand View that said it was a mound of living organisms covered by dirt. That if I looked closely you can see this. It was night so I couldnt see but I'll come back next time to check it out!", "author": "Colin H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-08-07", "description": "A friend of mine told me about this park and decided to take me up there one day. One could take the 66 here and start the great climb up the absolutely beautiful mosaic staircase. Not even halfway up the staircase you can already get a wonderful view of the Sunset and the Pacific Ocean, especially around sunset. Once having made your way up the mosaic staircase and perhaps a hundred more steps, the sight is UNBELIEVABLY gorgeous. You can see the Golden Gate Bridge, the Marin Headlands a bit, the city, nearly everything.\n\nIt can be a terribly romantic place or just a nice place to sit and ponder about life. I recommend this place to any one who's willing to climb up 200 steps at most to set their eyes on the most wondrous sight of San Francisco.", "author": "Lauren L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-01-15", "description": "If you've seen the zig-zap steps of this place while cruising on 19th Ave, you may have thought - I need to check that place out!   Well if you have a clear day to explore the Sunset, I highly recommend it!  It's a true treasure of San Francisco. You'll feel a sense of accomplishment after an energetic climb to the top. Enjoy the breathtaking views and know that you've been to a place that many San Franciscans have never even been to!", "author": "Dan S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-08-13", "description": "Great view of the sunset and richmond districts that the view at twin peaks misses. (review of twin peaks here: http://www.yelp.com/biz/twin-peaks-san-francisco#hrid:PNUGo1HLFy0FCG7lIssbww) It gets cold and windy so be prepared. The \"park\" is really small and there is only 1 bench. The day my good friend and I went to visit, we saw a trial of \"love letters\" and felt we were intruding on someones love trial. Anyways good view and good place to bring out of towners", "author": "Robert Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-02-15", "description": "Wow. What a gem in the middle of suburban Inner Sunset. It is so incredibly random but I think that it is totally awesome and amazing and all the above. \n\nMy friend found out abt this place. It's so romantic and beautiful at night. The sky was so clear and I could see so many stars and constellations (Orion's Belt yo) and the view of the city was even better. It is definitely worth going out of the way to look at. I would like to see what the place looks like in the day time.", "author": "Dustin H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-10-21", "description": "Went up on a clear day and the view was amazing! Totally worth the stairs :)", "author": "M M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-02-10", "description": "Today was absolutely beautiful and two of my friends and I took 40s and fruit tarts up here and had a picnic. There really are 23095824 stairs, but it's worth it, really. \n\nThis is on my list of top 5 favorite places, ever. Don't wear sandals, because it's kind of steep, and there is sand and dirt and yeah, kind of a lot of glass at one point, but at the top there is a little bit of grassy area, as well as some neat rocks and a bench looking out over the city. It's really small, but feels very private. Love it.", "author": "Melissa H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-10-21", "description": "Quite possibly my favorite view of San Francisco. Though Twin Peaks gives you that majestic (almost) 360-degree aerial view of the city, Grand View gives you a most unique perspective...you don't feel as \"on top of the world,\" like you do at Twin Peaks, which is kind of a good thing. At Grand View, you still feel like you're IN the City, like you're in a really tall tree, looking out.\n\nNot as easily accessed as Twin Peaks, but the mosaic staircase on 16th Ave is quite pretty, and there is the plus side of not having to deal with gobs of Eurotrash and HK tourists", "author": "Sachi T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-11-08", "description": "Awesome views of the ocean.  This is my favorite place to relax and think.  The winds are almost always really strong here though, so it is not quite the romantic picnic spot you may be searching for.\n\nOn a clear day you can see the Farallons here as well.", "author": "Rob K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-02-13", "description": "I've lived in the sunset almost three years now and never had the guts to climb those stairs above 19th Ave.  However, I felt a challenge come on within the last month, perhaps part of my New Year's Resolutions (that and good weather).  Last Monday I was off and it was one of those rare, gorgeously warm weather days in February, so the hubby and I took a walk/run up the thousands of steps or whatever to get there.  I was huffing and puffing around the halfway point while he was already waiting at the top.  \n\nWe hiked from below 19th ave, through the mosaic tiled steps, then up another set, and finally to the park itself.  A lady at the bottom of the staircase asked if we were going to the top and we said yes.  So she asked us to say a prayer for her cat buried up there.  We said okay, and then carefully walked through the sand (kind of wondering exactly where she buried the kitty).\n\nSince it was a clear day, the view was just absolutely breathtaking.  I think it was the first place I've seen in SF where you can really see everything, probably even more that Sutro if I can remember.  You can see the entire line of treetops from Golden Gate Park, the Golden Gate Bridge, Angel Island, North Bay - Sausalito area, downtown, the ocean as far as the Sloat side to where it crosses the Bay on the other end.  It was just so amazing and so tranquil.    \n\nOnce you're up there, you'll totally forget about the thousands of steps you have to walk down.", "author": "Stacey C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-10-03", "description": "Best Kept Secret Park! This has some amazing views of the sunset and GG Park. Seriously romantic except for the occasional gale-force winds, and you gotta work the gigantic staircase to get the payoff view. 2 staircases - one off 15th one off Moraga. We had a fantastic burning torch dance one night, and we did pack our trash. On a day were the sun is setting on the pacific and you swear you can see hawaii on the horizon, this little hilltop is unbeatable.", "author": "dave p."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-04-19", "description": "This park helped me to learn that I am becoming more of a local than I thought!  The girlfriend and I went for a leisurely walk in Sunset Heights on a sunny Sunday morning.  From the top of Grand View Park I could point out most of the local attractions and a fair number of the neighborhoods - all this after living here for about a year!  I'm so proud of myself :)\nPlus we say a red-tail hawk flying around (and getting badgered by some ravens... evil evil ravens!).  It's a little oasis in the Sunset.", "author": "Suzanne G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-29", "description": "It seems like a lot of people I've talked to don't know about this little gem of a park. You can see from Parkside and Sunset to the Cliff House, The Presidio, Richmond District, and Golden Gate Park all the way down the Panhandle. It's pretty much a 360 view of the best city in the world. You can not see downtown.", "author": "Chris I."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-03-18", "description": "I couldn't believe there was a place like this in the Sunset.  I've been living here for a year and drive by it every week on 19th.  The view is gorgeous...I felt like I was at one of the highest spots in the city. \n\nAfter viewing the colorful porcelain stairs while passing Moraga, I decided to just park my car at the base of it one day to walk up it.    It took like 5-10 minutes... at first I assumed that you had to walk up a steep dirt trail to get to the top, but eventually I realized there were stairs.\n\nI also didn't realize the mound I was walking up was actually called a \"park\".  Anyways, I'm surprised that there were just 5 people there with me on a Sunday afternoon, for a view that amazing.  Gotta return for a sunset.", "author": "M K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-02-28", "description": "I'm not going to pretend the view here matches the view from Twin Peaks. It doesn't. But it is so much more rewarding. The climb up the steps is a decent workout, and the view at the peak is breathtaking. Very peaceful and relaxing. There were less than 10 other people, and maybe 2 or 3 dogs, but it really feels like you have the whole lookout to yourself.", "author": "Kevin B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-11-22", "description": "Super awesome place to check out! It looks like a ton of stairs, but really it's not that bad. Plus on a nice day, you can get a beautfiul view of the city. =)", "author": "Maple C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-07-21", "description": "Looking for a view of the Sunset, Richmond, Financial District, and the beach?  Look no further than Grand View Park.  The view is expansive and the breeze is cool at the crest of the hill.  Coming to this hill is like seeing the rest of what you can't see behind Twin Peaks.  \n\nIt's a bit of a maze to get there, but it's well worth the journey...", "author": "Qyon G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-06-14", "description": "i feel this place is one of the cities best kept secrets. the view is absolutely beautiful and a great place to bring friends from out of town. interestingly enough, ive never been to this place in the daylight. so i really cant talk about the types of people that frequent the place or if its crowded or not. but at 2 in the morning on a clear city night its always great to go there with either \"someone special\" or a group of friends and gaze at the endless city lights that surround you. \n\nonly problem ive ever faced with this place is that it took me about 4-5 times to figure out that by going left when you reach the top of the stairs brings you to a little trail that takes you directly to the top. i always immediately went right and had to climb the steep ridge to get the to the benches with the views. typical me. oh, and believe me when i say this, if its windy in the flatlands, it will be twice if not three times more windy at the top of this hill. so choose your day to go wisely.", "author": "Andrew D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-12-05", "description": "this place is so beautiful.  everytime i drove down 19th ave i always looked up at this spot and wondered how to climb those stairs at the side. my roommate and i climbed up the other side of it though. i thought it'd be slightly bigger but i found it to be rather small. but it's alright i guess. the spectacular view of the city makes up for it. you can literally see an 360 degree view of everything, minus the trees in the way. it's the perfect get-a-way spot, what with the random bench posted there for you to sit on &take in the sights of the city.", "author": "reiko o."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-09-28", "description": "definetly visit if you're wandering through SF. \n\nit's got unbeatable views of the city and the surrounding cities. plus, finding this place is an adventure in itself.  i came when it was super foggy out and it was eerie not being able to see off the point. \n\nthe neighborhood is pretty sweet. would love to have a place out here.", "author": "Joanie K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-03-15", "description": "We saw the most beautiful mosaic steps one day along Moraga in the inner Sunset.  We were curious where the steps would lead and decided to climb it.  We kept following the steps and it took us to the most fabulous view of SF!  Almost 360 degrees!  Downtown to Golden Gate Bridge to Ocean Beach to Daly City.  \n\nThe best part was, there was no one there!  Just us!  This is by far the BEST place to watch the sunset in the city!  Just gorgeous!", "author": "Ruby F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-09-18", "description": "One of the best hills to have a wide view of the city. This is a good place to view the sunset too.", "author": "David B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-10", "description": "If only it wasn't foggy so often it would get the full five stars. This is one of the best views in the city and no 'tourons' to spoil the view (i.e. Twin Peaks). Like others say it is quite a workout to get up there but we often use it as a personal stair master. With the views of the city and the ocean it's always rewarding while doing reps to the top, or just a great place to watch a sunset. I wish people wouldn't break their beer bottles up there as it gets mixed in with the sand and sticks in your shoes or dogs paws. All in all the most relaxing and spectacular viewing spot in the city. And if you come up from the west there is an amazing mural-ed stairway coming up from 16th ave.", "author": "Nate S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-07-17", "description": "Even if you are insane and don't like parks with amazing views there is no denying that the mosaic staircase leading up to this park is one of the coolest beautification projects you will ever see!", "author": "Drue C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-03-11", "description": "As a staunch west San Francisco advocate, I love this park.  In particular, I love that comparatively few people know about it, which means that I can surprise friends, dates, and visitors with a great new view of the City they haven't seen before.  While the park itself isn't much to look at, the view merits five stars.", "author": "B L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-05-09", "description": "Beautiful panoramic views and great memories. I had a first date here in another lifetime with a lovely Irish lass named Dierdre. If you ever read this Dierdre I can still feel the sensuous softness of your lips. Thanks for showing me this jewel of a Park. Sidenote for the haters. If you can't review from the heart dont fucking review at all.", "author": "Brad B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-03-09", "description": "When the hubby is looking bored I make him take me walking around the city in search of cool new places to find. Part of the fun of being newbies here is exploring - something people never seem to do after living here awhile. The photos of this park say it all. You climb up on top of the world at this park to some of the most amazing views in San Francisco. Gorgeous, and right above the beautiful 16th St. mosaic staircase.", "author": "margot b."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-07-07", "description": "Best view of the park and most of SF. I've been to all the top views...Grandview to me tops them.", "author": "LS L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-03-20", "description": "I love this place! It is not very well-known; a friend introduced me to this place back in 2001 and I just call it the \"other best view of SF\" It is a hidden gem and I always take friends here.", "author": "Caitanya M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-03-15", "description": "Gorgeous views 1 block from my place. Not to mention an excellent workout running up and down the steps!", "author": "J H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-03-25", "description": "This park really showcases why the Sunset District is the place to live in the city (if you prefer a house w/yard - love the outdoors/nature and peaceful/quiet atmosphere w/access to everything else in the city). Grand View Park in addition to everything else....the beach, the fresh gorgeous weather (thanks global warming!), the views, the Park Chalet, Sutro Hts, Lands End, easy train access (L or N) to the heart of the madness (which of course I love) of the city....Stern Grove, GG Park, Fort Funston...all and more at a 360 degree view really reminds me why I love to live here. Please only share this secret little gem of a park with those who respect and appreciate the natural side of the city.", "author": "Amy E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-05-30", "description": "This is a local treasure. You get a bit of exercise climbing the stairs up and then you are given a wonderful 360 degree view of NW SF. You shouldn't have any fear of mobs of tourists like at twin peaks and parking is easy. Like at most of the vistas around the city it can get windy.", "author": "Andrew M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-04-12", "description": "Great peaceful place with nice view", "author": "Chong L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-02-08", "description": "I am new to the area and I am busy researching places to go and things to do on yelp all of the time.  I ran across this park in just that way and I was really excited after reading all of these super nice reviews.\nI took my boyfriend for a nice romantic surprise just as the sun was setting.  I struggled a bit with finding the place but that could just be because I'm new to the area and I don't quite have the hang of the crazy san fran streets yet.  One thing that all the reviews seemed to agree on is the fact that it is secluded and a good place to be alone.  This was not the case on the night that we went.  We went on a Saturday night and there was around 10 people there with the same idea.  10 people doesn't sound like a lot but it was a bit aggravating because it's not the biggest place.  Also, one of the reviews described the place to have a lot of benches and places to sit but really, there wasn't anywhere for us to sit.  We had to walk back down a little ways and stand to watch the sunset.\nOverall, this was a beautiful place and I got major points for taking my boyfriend here.  The sunset was amazing and it is a charming spot to be by yourself or take a loved one.  Definitely take a jacket and enjoy!", "author": "Amanda M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-02-22", "description": "After traveling on 19th Ave for all of my 23 years of life, I have never thought of venturing up the hill towards the little hump with trees on top till a couple of days ago.  With a break in the rains and an overcast setting, we climbed up the stairs and circled the small mountain...cameras in hand.  The place has such a nice view.  You can basically see the entire Golden Gate Park, Academy of Sciences, DeYoung Museum, Financial District, and the coastline.  Not many tourists go up there which could be a good thing.  Lots of people walking their dogs but that is fine since I love dogs anyway.  Its a good place for a quick photo op of most of SF.", "author": "Tiffany V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-23", "description": "One of the few things in life that will deliver exactly what it says.  It's called Grand View, and you will find very grand views there.  Walking up, you'll get a lot of exercise and feel like you've had a bit of an adventure.  If I didn't live near Grand View, I don't think I'd ever even know about it.  So it's pretty quiet up there.  And oh yeah, great views.", "author": "Lego S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-04-12", "description": "A little gem that i was very lucky to find in a little grey Sunset Disctrict that i live in. Wonderful views, quiet, romantic and those steps are worth finding... :-)", "author": "Katja S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-10-21", "description": "the most beautiful view in all of san francisco. peaceful, windy, serene, breathtaking...a must-see. \n\nto quote the bench on the top of the hill...\"be thyself: unique and beautiful.\"", "author": "sarah i."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-10-17", "description": "My favorite view spot in the city.  Always peaceful (no tour buses a la Twin Peaks) and offers a panoramic view of the Golden Gate Bridge, the Headlands, and the west side of the City.", "author": "Dave R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-07-06", "description": "i lived next to this park for four years, and the view is indeed amazing, although personally i think the view from the top of twin peaks is a little nicer.  easiest way to get there: starting at funston & lincoln, take funston ALL the way up the hill until you reach a wall.  there's nowhere to go but right at the wall (noriega ave.), so just take that right.  when you get to the stop sign at the end of the block, the park (and the hundred or so stairs to reach the top of it) will be right in front of you.  \n\nplease stay on the path in the tiny park, btw.  some rare, endangered plants grow on the hillside there; they can't take being trampled.  and for the love of god, take your bottles back down the hill with you.  the broken glass really detracts from this little gem.\n\nalso, this place should be voted \"best place for underage drinking after dark,\" based purely on the number of high school kids i saw (and HEARD) getting hammered up there.  saw a few get busted, too.", "author": "Jeff W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-07-08", "description": "like every view in San Francisco.\n\nits better on a sunny day or to see the sunset over the city.\n\nif it ain't. it ain't worth the 'excerise' it takes to get to the top of the hill.", "author": "Derek Alistair J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-05-17", "description": "Reading reviews of how beautiful the view is or even looking at pictures of it will not compare to what you will see once you get up there. One of the most beautiful views of the city, especially during sunset. The stairs look mean, but they're not too bad. I went here right after the beach, so I had on flip flops, which is not the best idea since there is a lot of broken glass on the ground. Wear shoes, bring a sweater and maybe a camera and be prepared to be blown away!", "author": "kat a."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-05-07", "description": "Without a doubt my favorite view and place for just admiring our fair City from what feels like a birds-eye view.  Great for solitary exercise and also romance!", "author": "Dwayne A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-11-30", "description": "Possibly the best overall view of the City. It certainly rivals the view from Twin Peaks, Bernal Heights, and Mt. Davidson. Sunsets from here on a clear day are amazing. Be prepared to hike up some major stairs to get to the top.", "author": "Tim K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-11-17", "description": "The best view .. the most beautiful sunset.. peaceful, never too many people...", "author": "Fabiana H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-11-01", "description": "According to the placard, this park sits on a rock formed by some kind of prehistoric single-celled organism.  Awesome.  I saw this on google maps today and decided to get some fresh air and hike over.  It's a testament to my cardiovascular robustness that I didn't keel over and die at the top of this hill.  The best view of the city from inside the city (outside, that distinction would belong to the Marina Headlands).  Careful with your feets though -- there's broken 40 glass everywhere.", "author": "Phil K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-02-20", "description": "This place is the coolest!  For over a year, I've lived in the area and seen this hill protruding into the middle of my view.  So, one unseasonably warm day, I decided it was time to see what was the deal.  So, I started walking.....and walking......up.....and up.  195 steps up at Kirkham and 14th, to be exact.  Then, there was a mini-hike up the hill and I was rewarded with the most incredible view--the Pacific to the East Bay and directly downtown.  Absolutely beautiful and a bit of exercise all in the mix.", "author": "Jessica L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-06-17", "description": "After reading the reviews and seeing some of the beautiful pictures here, I had to see it myself. Yea, you're right. It's beautiful, a closer view comparing at the Twin Peaks. However, it is very scary walking around the edge. Definitely not a good place for kids. Today was hot, so it wasn't so windy up there.", "author": "The Black Cat C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-04-05", "description": "Beautiful.  This is a park, not a hike (FYI for people who think that this might be a trail).  Climb a flight of stairs and you see one of the most magnificent views of the city.  A little windy so bring a jacket.  Dog owners, please don't bring your pups here.  There's so much broken glass mixed into the sand  (found AFTER you finish climbing up the steps).  If you have a little pup, I guess you can carry him to the bench.", "author": "Shana Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-08-28", "description": "Grand View, such a good place to sit and contemplate life. Bring warm clothes and a hat but really cool view and a good place to ponder things for a hour or so. It is a giant sand dune to remind you, since most of the sunset and Richmond districts are, so be prepared for sand in the shoes. Loss of star to the not very good upkeep.", "author": "Ryan O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-05-15", "description": "Absolutely lovely.  Easy to get parking, has a clear view of Golden Gate Park and the Pacific, something you won't find on Twin Peaks.  You'd think that there'd be a ton of reviews on a site with a view this amazing, but there aren't.  And really, that's the beauty of it--sitting on this hill is truly an escape.", "author": "Tony L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-07-11", "description": "very sweet view; best i've seen of sf, from the west side at least.\n\ncheck out this panorama i took: http://bit.ly/grandview", "author": "Ivan C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-08-29", "description": "Grand view doesn't begin to describe it. So glad my wandering took me here today. Such an amazing 360 view! As a newcomer to the city it was really cool to be up there by myself and feel like I discovered this cool place and just sit and contemplate the city and my place in it. Okay getting really sappy. It's beautiful; well worth a bus ride (if you dont live in the area) and the climb up the stairs.", "author": "Megan G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-10-13", "description": "Living in the Outer Sunset, I have driven through the avenues thousands of times and never had a clue such an amazing park was right around the corner.  I think this park trumps Twin Peaks in terms of the amazing view.  You can literally see the entire Sunset down to Daly City, the beach and Pacific Ocean, all the way up the coast to Marin, GG Park, the tip of GG Bridge peeking over, all of the Haight Ashbury, downtown and the financial district, and all the way across the bay to Oakland.  You have to see it to believe it.  The only thing you can't see is the Mission and bayview as that is blocked by Twin Peaks.\n\nSome interesting notes: the park is mostly sand, cool reminder of what the entire Sunset is built on.  There are trees up on the hill but they were all imported; none grow there naturally.  As mentioned before, there are some endangered species that grow right outside the footpath, so please be careful not to step on them.  There are some cool plants that you'll find attached to trees, they have yellow spores underneath the leaves and only need air and sunshine to grow.  This park rules.", "author": "Mr. A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-04-06", "description": "It's a little hike, but the view is very rewarding. Be there for a sunset. Watch out for the broken glass.", "author": "Josh B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-04-08", "description": "Surely this park has been raved about for its gorgeous views of the entire western section of the city and the Pacific, but I want to be sure it receives proper credit for its kick-ass workout providing abilities.  When jogging through the sunset or nearby GG park, Grand View is a short detour that will leave you short of breath.  The dozens upon dozens of vertical steps leading to the top end with the spectacular view which is a great excuse to catch your breath.  Stairs lead to the top on both the east and west side, which means there is plenty of potential for a serious stair loop / workout.", "author": "Morgen N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-06-03", "description": "Grand View Park is chill.  I love coming here when I'm heading to the city just to relax and enjoy the scenic view.  It is comparable to Twin Peaks, but I like this place better b/c of the beautiful and unique stairs.  The effort you put into walking up the stairs makes the experience up there worthwhile.  Bring a camera and a heavy jacket b/c it can get pretty windy up there.", "author": "Natalie P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-03-09", "description": "This place probably the most spectacular view of the sea. You can sort of see the curvature of the earth when you look westward. So cool that there's 2 kinds of flowers found only on that mound. The wallflowers looks beautiful. Definitely doing a picnic there on that one super awesome bench that sits on top of the hill.", "author": "Arnab B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-07-15", "description": "Worth the burn in your quads.  This is like Twin Peaks West.  The view of the west side of town and the ocean is uparalleled.  I recommend approaching from the East, up the stairs at the end of Moraga (start at 13th) for maximum pain. It's really really windy, but on a clear day this place can't be beat.", "author": "Eric S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2005-12-20", "description": "Crack a bottle here and enjoy the views, the best if you are near Golden Gate park or Inner Sunset district.", "author": "Chris S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-10-25", "description": "With an amazing view like this, its no wonder that Grand View Park has been awarded the exclusive, dare I saw, ellusive, honor of being part of Tim V's \"A-game\". \r\n\r\nRecipe for success? Yeah, I got it. It goes a bit like this:\r\n\r\n1.) Find hottie date (check)\r\n2.) Get said hottie date to agree to an actual real date (no, that drunk pizza orgasmica run after getting tossed out of bar none does NOT count)....count that as a check too\r\n3.) Wine, dine, bide your time  with date (usually 3 drinks worth etc. etc. bla bla blah)\r\n4.) drop the a-game bomb on her/him- \"yeah, there's this little hill I know with a view that puts seeing the sun set over El Pollo Loco on El Camino in redwood city to shame\" \r\n5.) she/he will have no choice but to agree, you suave playah you\r\n6.) stop into a classy liquor store to get that equally nice, classy,  bottle of boone's farm (on ice playah, its what Fiddy would do)\r\n7.) chillax with your honey and watch the sun go down on the sunset, watch the lights of the boondocks that is my neighborhood wink on, and let the romance just flow...preferably, at a speed faster than the boone's farm running through your hot and bothered bodies\r\n8.) don't know- still have yet to get to this step (see previous steps)\r\n\r\nA-game baby, settle for nuthin' less", "author": "Tim V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-04-06", "description": "I've run around this place since I was a kid hahaha The view of the sunset and richmond districts is spectacular up there! Sitting up there at dawn and watching the sun come up is breath taking, just like when the sun is setting too! At times its sunny up there and then you see a blanket of fog rolling in too. It's quite nice =]", "author": "Jason C. J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-20", "description": "Even on the foggiest and coldest of days, this place is worth the little hike.  I'm sure on a clear day the views of Ocean Beach, GG Park, and Downtown are spectacular, but with the fog rolling in, it feels like you're floating above the city on a cloud.  Be forewarned however, this isn't your typical benches everywhere, spread a blanket over green grass and picnic type of park.  There are only a couple of actual benches, and some branches that have fallen strategically.  And the terrain is more ruffage than grass.  Great if you feel like going for a stroll/mini-hike...a wonderful view will be your reward.", "author": "Sarah L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-07-22", "description": "i went here with my boyfriend.. \n\nwe went here after looking at the beautiful mural staircase.. after losing calories and breaking a sweat from climbing those stairs (and then even more stair to get to the stop) that's when we saw the pretty view.. \n\nhard work pays off.", "author": "Reina A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-08-10", "description": "Because i live on the East side of Twin Peaks, being on this hill makes me feel like I'm not in San Francisco. It feels like another, much quieter city.", "author": "Geronimo G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-07-24", "description": "one of the top view points in san francisco aside from twin peaks. imagine, from daly city all up the west coast and around to downtown within your imediate eyeline. freaking incredible! the hike up the hill is killer if your out of shape, but most definitely worth it! take a friend, a visitor, a boyfriend, a girlfriend, or just yourself!\n\nalso a side note, my friends and i always called this place Dr. Seuss Hill because of the funny shaped trees on top!", "author": "Jaei P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-05-03", "description": "it is a GRAND VIEW up at grand view park. does not take long to travel to the top... so once you're at the top, sit down on a bench and enjoy the view. the view of ocean beach is glittering, if you're visiting on a sunny day sometime in the afternoon. \n\nto travel up to grand view... take the 6 to moraga and walk west, or take the 28 to moraga and walk east. towards the east is a elaborate mosaic staircase that will lead you up to grand view. take a close look at the lettering of the tiles on the mosaic stairs and see the messages. look at the staircase holistically and a \"stairway to heaven\" can been seen. then continue on the stairway to heaven to reach grand view. grand views are at the top of the hill.", "author": "Court L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-09-07", "description": "from the mosaic steps on the west side, to the shady green peak, this place is worth checking out if you're in the neighborhood.  a surprisingly far reaching view makes the very short hike worth while.", "author": "L J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-03-27", "description": "This park is gorgeous! Huge views, almost 360 views of the ocean, city, etc. It's off the beaten path, never too many people there, and never any tourists! Beautiful park to spend some time, soak in nature, and relax.", "author": "Amy B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-02-25", "description": "Definitely a site to see. It's well worth the walk and the view is absolutely breathe taking. You MUST access it through the Morage Tile Stairs to complete the experience! The site, again is amazing. Come on a clear sunny day and get a glimpse of the entire San Francisco. Spots your favorite spots and view the ocean, even a love bench to sit for hours.", "author": "Serena J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-01-15", "description": "Finally took my parents with me to this wonder spot about twenty minutes before sunset last night.  It is a definite hike up the stairs, but worth it.  The view itself is obviously easy to appreciate, but I was also drawn to the general atmosphere and mix of people who were also there to enjoy the view: a young couple, some families, and a nice looking group of friends in their 30's who plopped down with a case of Sierra Nevada's to enjoy the sunset.  Would definitely recommend coming here for a date.", "author": "J B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-12-25", "description": "we came here thinking that the giant cross of mount davidson was up here...but instead discovered something even more beautiful, the view! the mosaic stairs are really long.. but once you reach the top, ur in for a surprise. on a clear sunny day, we saw the entire city and could even make out golden gate bridge. pretty romantic for a date=)", "author": "christy w."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-07-05", "description": "Beautiful. I've lived here 3 years and finally did this today! Best views of the city ever! I should have done this yesterday for the fireworks!", "author": "Sam H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-07-31", "description": "I lived within half a mile of this place for a year somehow without realizing that it even existed.  When you are climbing up the HUGE staircase to the top of the hill it gets progressively more and more windy and it totally took me off guard how ridiculously crazy the wind blows up there. Yes the wind really sucks, but the 360 degree view of the city totally makes up for it...you can see all of ocean beach on a clear day as well as the golden gate bridge and pretty much all the rest of San Francisco.  Usually there aren't too many tourists up top or anyone in general which makes it a great place to kind of relax and just take in the views while sitting on the single bench they have there.  If you live in the sunset and haven't been here, you really have to check it out....one of the few cool things you can do for free in SF that is actually worthwhile in my opinion.", "author": "Isaac W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-05-14", "description": "a fave of mine , its breathtaking daytime as it is night time , sunset is the most serene ,great photos of the city, so romantic.", "author": "Kayte S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-03-25", "description": "Grand View Park is just what the name implies, grand or should I Say a grand view for that matter.!  My friend, and I stumbled upon this place when we drove across the city one day, exploring different neighborhoods along the way.  Man,! what a hike up the hill; my feet were not killing yet, than god.!  Then, I could not believe the long flights of stairs that we had to climb.  I guess I had a a slight fear heights, being visually impaired and not being able to see everything as well.  But, we made up, a little tired and taken away by the breathtaking views of the City and the entire bay area.  I thought that it was a small greenbelt, but my friend pointed out that it was long and narrow and we ended up walking out a ways.  It was breathtaking listening to the sites and sounds of the city down below.  It is a very tranquil setting to go to to lose yourself  for a while and take a break from the hustle and bustle of the city.  We were up there for a while and the multiple flights of stairs did not mean a thing anymore.  We made it down safely and were both a little tired, especially after having to walk back down to the bottom of the hill.  It was well worth the effort.  We will definitely have to come back here for a picnic and a sunset.  This, like all San Francisco parks, will be around for years to come.  Keep up the good work City of San Francisco.!", "author": "Brian S."}
