{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-14", "description": "Nick is a badass bartender and  a great guy! I waked in randomly and was blown away by nick and marlon. Marlon, thanks for the shot)", "author": "Ars G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-04-28", "description": "Walked in and it was your average mediocre bar. Typical grime and scents. Nice that they had a few varieties of Anchor. First one tasted a bit flat and sour. Second one Anchor Liberty was clearly stale and had a bit of extra taste from the dirty tap. Needless to say I left the cup half full never to return again. Spend your money elsewhere", "author": "Yosof R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-18", "description": "I've only been here during the week, so I can't judge the spot for its weekend performance.\n\nBut whenever I've met here with a buddy for drinks to celebrate the end of the work day, it's been a great experience. Don't trust the grammatically challenged reviews.\n\nMy buddy and I will sit at the bar, order a few of the quite strong 2-for-1 drinks during happy hour, keep the last chip and come back another time. One day they ran out of chips - you get one with your drink and it pays for the next - so they gave us OG tickets from a roll. I of course misplaced one and told the barkeeper about it. She was kind enough to give me another one that I intend to use at the next visit sooner than later.", "author": "Roland A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-10-10", "description": "Came here to watch the Giants game last week and it was a pretty fun dive bar. \n\nAwesome happy hour (buy one get one) - right when you order a beer (or well drink) you are given a ticket for your next drink...pretty sweet deal. Plus the happy hour goes til 8pm which is pretty late for a happy hour, which is always a good thing. I also like that you can bring your own food into the bar - we all brought in pizza and it was deeelicious. \n\nNot the best bar I've been to but it was fun and lively. Female bartender was nice too.", "author": "Ilana B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-26", "description": "One of the last SF bars, refreshing to be able to go to a bar in your hometown and talk about the past and debate where we're going in the future, and chances are if you are from SFC, 6 degrees of separation you'll always meet someone that dated someone that broke up with that person that is now in jail for being crazy!! (based on a true story) LOL It's also refreshing to go to a bar in SFC on a Sunday and be with 49er fans, not a Patriot Bar, or a Vikings Bar, or a Steelers bar. The \"Mixologists\" here are AAAAAAmazing, I call them bartenders still........... they really know how to make a neat Jameson to perfection!! :-) Then at the end of the night, what's even more amazing is while everybody is waiting on their uber I just whistle for one of many empty taxis circling around. Just find it odd that uber became popular partly do to the fact that people had such a hard time finding taxis, and now like sheople they are all waiting around for their ubers. Getting off topic, Grant and Green is a historical neighborhood throwback to San Francisco, go there and enjoy the authentic SF atmosphere.", "author": "John A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-13", "description": "Devon is the coolest bartender ever! He also makes the best drinks in North Beach.  The bar is ver cozy and the music is good.", "author": "Elle E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-04", "description": "Okay, I live in Pittsburg, and It's worth the BART ride for me be able to enjoy the North Beach nightlife and visit my fave bar G&G! \n\nThey have one of the best happy hours of any bar, lounge, dive, saloon ect of any place I've ever visited. Plus some of my fave bartenders ever! It's located at such a great spot with other venues and eateries around when you need a snack. Perfect place let loose and unwind and catch a game or partake in whatever festivities that would happen to be going on in or around North Beach. Although I usually go every other week or so (Sundays) I've met some cool people there from around the world. I adore this place.\n\nTre Smith You Know!", "author": "Tre S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-19", "description": "It's happening at this saloon - especially on sports game, Friday and Saturday nights!\n\nThis rowdy bar gives you a sense of what North Beach bars are in the neighborhood. \n\nYou'll have a fun time here!", "author": "Tiffany D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-07-28", "description": "Last stop on a fun night with friends. We ended up here because it was the only bar in the close vicinity that didn't have a line. I'm all for dive bars but this place has sticky and wet tables that could really have used some kind of wipe and the band was accompanied by some really trashed people in their early 20s that were almost humping on the dance floor. Oh and they have a $15 minimum for credit card transactions - I'll keep my thoughts to myself on this!", "author": "Sarah S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-08", "description": "Poppin! So I normally hit Sip Lounge, but I guess it's closed. We stumbled upon this spot and it was kind of dead BUT they had a DJ. DJ played good music, we played pool, and had a great time. It's so chill and the people are hella cool there. I can't wait to return next week!", "author": "Deniece B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-05", "description": "I hadn't been to the Grant and Green for many years until recently... Seems like I have found myself in this North Beach bar at least four times in the last couples of months. When I lived in the neighborhood around the turn of the century, I often nipped into the G&G with friends. It was a hardcore biker bar with a doorman that turned a blind eye to our underage status.\n\nOn my recent visits there, I have enjoyed the divey atmosphere, though it is a huge step above its previous incarnation both in hygiene and atmosphere (bathroom is a lot less scary). Yes, the bar is still sticky, but at least they have an incredibly long two for one happy hour. \n\nThe location cannot be beat. There is nothing better than finding a perch at the bar and watching the North Beach pastiche of scenes unfold in the heart of it all. Great DJ on a recent evening as well, spinning old school hip hop that made dancing mandatory.", "author": "Carole B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-06-11", "description": "The bartender is a total ass (chubby guy with glasses. (In case the owner is reading this or cares...it's the guy that was working Sat 6/10/2017 around 7:30). He's rude and condescending and you bet I'll never set foot in that place again!", "author": "Kevin K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-15", "description": "Run-on review again but it befits the evening when I dropped in here:\n\nI'm calling this a solid dive-bar that I would return to without hesitation despite the allegations of a rougher crowd from other yelpers because I had the start of a great evening here and the bartender was friendly and down to earth and the drinks were reasonable and they have good happy hour prices...", "author": "Jim W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-04-27", "description": "Terrible service and very expensive compared to the rest of the city.  Even north beach.  It's a rip off to take advantage of tourist.  I got kicked out for asking to watch the NBA playoffs on the tv too many times.  He said no we're watching the NFL draft.", "author": "Pete J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-12-13", "description": "Came here on Santacon and it was just absolutely packed. Shoulder to shoulder craziness. I read somewhere that is is $15 min for cc/debit, but on santacon it was $30 min - jeez louise! The music was pretty good though - If I could make my way through the crowd I would've gone to the dance floor but not worth it. I'd like to come back during normalcy,", "author": "Kelly G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-14", "description": "Let's cut to the chase. It's a dive bar. \n\nWe stumbled onto this place after dinner. The bartenders were awesome, the atmosphere (loud and crowded) was ideal and the drinks were stiff. Bonus was a 2 for one beers before 9pm.\n\nLove this place. It's everything you could ask for in a dive bar. Poorly laid out, unisex restroom, badly in need of a remodel, edgy staff, an 80's cover band (more heart, then talent but I'm good with that) and single pool table in the middle of the dance floor. \n\nIf the walls could talk, oh the stories they could tell.", "author": "Tim F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-14", "description": "a dive bar with a 2-for-1 special until 9, and even after that the drinks are so cheap your wallet will be as happy as you are.\n\ndingy-looking bathrooms which are actually moderately clean upon closer inspection (the multitude of stickers is a distraction, I guess). there was live music towards the end of the night, but I was busy pounding inexpensive shots of Fireball and pints of Sierra Nevada to care.\n\nbonus points for the Dead Kennedys posters and solid rock playlist. this is my kind of joint.", "author": "Mike B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-11-25", "description": "There is one reason to come here, drinks are cheap!  I don't if it was a special or something, but I was getting $4 Jameson Rocks all night! WTH??? $4???  Mind blown!  \n\nThe bar itself is a dive.  I gets super crowded ($4????).  It had a live cover band on Saturday night, and I am assuming other nights as well.  Oh and it has a pool table.  \n\nI'll come again ($4????????)!", "author": "Veasna H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-07-24", "description": "Good dive bar atmosphere, nice bartender. However, we were thrown out for writing on the chalk board painted wall with chalk.  The owner threatened to call the police and then called the bar next door to let him know \"trouble makers\" were headed his way. Well the fine folks at Tupelo happily took out money for drinks and had some excellent live entertainment. Highly recommend you try Tupelo over Green and Grant if you're in the area.", "author": "Larry C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-07-30", "description": "Rudest most condescending bartender, older chubby guy with glasses. The extra 2 minute walk to Tupelo is definitely worth it! And I will not give my money to an establishment that treats their customers this poorly. If anyone on the staff sees this please retrain your bartenders on how to talk to people. And customers save your time and go to anywhere else in the area", "author": "Stephanie G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-07-23", "description": "The only thing I like about this place is the name. You might be thinking you're stumbling into a British bar like in the movie Green Street Hooligans, but you're not. It's sort of a \"bro place\" or one of those places where white girls come in and shout how drunk they are.\n\nI did, however, have a decent time. They had a pool table that I was occupied with for a while. Space is a little limited so watch where the butt of the pool cue goes. I somewhat enjoyed my corporate tasting beer and was on my way to another joint in North Beach.\n\nI say only come here if every other place is full--definitely not a place to go out of your way for. It's one of those, \"well it's just right there,\" places.", "author": "Marlon T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-23", "description": "It's a dive bar.  No frills, not a hookup meat market, just a place to get a drink and socialize with the regulars or to unwind after a long day at work.  \n\nPrices are very reasonable, esp with the 2 drinks for the price of 1 during happy hour.\n\nBartenders are nice and the patrons know when to talk to you and when to give you privacy.  What more can you ask for.", "author": "Edward M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-24", "description": "Super rad staff, cheap happy hour and they pour the Jameson with a heavy hand. If you're in north beach, this spot is a definite must do.", "author": "Bobby H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-09", "description": "Divey, but a good dive bar. Happy hour is 4-9 errday, meaning 2 drinks for the price of one. After you order your drink, the bartender will give you a ticket for another free drink. Love it. The only thing that's kind of weird is that the bartender will not make drinks other than well drinks or beer during happy hour. \n\nI think there was a pinball machine? Crowd (at least when I went) is drunk mid 20's-30-somethings.", "author": "Claire S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-11-01", "description": "Update- they added $10 to my tab without my consent. If I could give 0 stars I would\n\n\nHad a great night after the giants won WS3. My buddy invited me to play drums with his funk band about a week before. After about ten shots and 5 beers with my two homies I brought to the bar, this bartender told me to quit and pay. I had only 3 shots and a beer but totalled a $100 tab. So dude makes me pay my tab, I tip him 15% (fair=$1 tip per drink) and he says \"thanks for the tip a-hole\".\nOne of my buddies responds \"f..u\" in a n incredulous way. Dude says \"I've been pouring this @ss drinks all night\" and kicks us out. We werent even there for 2 hours and couldn't understand why this dude would cut us off. I didnt even get to play music, but luckily my homey had an extra drummer for the night.  Had to leave my $3000 drum kit in a bar that kicked me out. Talk about an a-hole!\n\nWould have given one star, but I did have fun. So.... F** it!", "author": "TJ O."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-12-04", "description": "Bartender is a racist homophobe. It's disgusting how they treat paying customers and I will never step foot in this place again.", "author": "Megan K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-28", "description": "Great north beach dive bar! The folks that come here are super cool, and I had to turn down multiple offers for free drinks. (Full disclosure: my band has played here twice).\nThe bouncer is friendly and helpful, and on the weekends it is a hotspot.", "author": "David B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-04-28", "description": "The skanky tatted bartender was a C U Next Tuesday.  Was hanging out with the fellas for a birthday celebration and after about an hour, we decided to put some money in the jukebox. Played some pool, were trying to get our buzz going while listening to a nice blend of punk, rap, metal and some old school country selections from Johnny Cash and Waylon Jennings etc.  The country music actually seemed to draw some ladies into the bar and other customers began to play a medley of music, including some country selections.  \n\nThen the slag started skipping the country songs.  About 4 songs over the course of a couple hours and she had it.  I confronted her about it and she got stupid, talking about it being her bar.  I had to remind her she was the employee and the customers were there to have a good time.  Nobody gives a crap about what music she wants to hear... serve the drinks, clean up the foul looking restrooms and shut your mouth about the music!  \n\nDive bars are a dime a dozen and so are tattooed skanks.", "author": "Jared T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-10-10", "description": "Waited patiently about 10minutes ago. The rude bartender in the 49er hat went right around me and helped the guy behind me. Either racist or\nHomophobic. Not a welcoming place.Rude!!", "author": "Gordon R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-10-25", "description": "Worst service i have ever had!!!! The bar tender was extremely rude! Gave us the wrong drinks! This bar is a blimish on the streets of san francisco and should be shit down! Im prety sure puting a different kind of alcohol in a mor expensive bottle is illegal!! My review of this bar stay far away!!! There are alot better places to spen your money!", "author": "Jessie G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-07-04", "description": "Came here randomly with a group of friends during a night where they had live music. It was super loud and we basically had to shout over the music to even talk to each other. Not really sure what to make of this place since I've only been here once and the  crowd was a weird mix.  $15 min if you want to use a card. \n\nQuickly finished our drinks and left to another bar. Wouldn't go out of my way to come here.", "author": "Tiffany S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-12-02", "description": "Solely for the bartenders and ambiance, this place gets 5 stars.  We were drenched and needed a fun bar to watch college football, thankfully we stumbled upon this gem.  NIce bartender, fun and friendly, he made our day.  Nice drink selection.\n\nTip:  They only take cash.", "author": "Cyndi J."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-05-28", "description": "This place is a shit hole, the owner is a Dick and he seems racist. I saw him personally try to fight a customer smh. Wack!", "author": "Felipe J."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-11-06", "description": "Two things I noticed (and hate) as I walked through the door; a fat CASH ONLY sign, and the overwhelming stench of vomit. \n\nAfter paying the outrageous $3.50 fee at the in-house ATM, I ordered up a drink and chugged it down quick, I sure as hell didn't want to stay. The smell seemed to only get worse. \n\nPlain Jane in the way of decor, pretty large quarters, friendly bartenders, lively patrons, and a band(they were setting up). The place has the makings of a good bar except for that god awful smell. \n\nHole number 5 seemed to be a bust, stupid sand traps! I think I'll take a mulligan next round of pub golf when this is one of our stops.", "author": "Justin C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-23", "description": "3.5 stars\nSo this was the first place I went to when visiting SF this last weekend. We were meeting some friends for a little surprise birthday celebration and I had no idea what we were getting in to.The moment I walked in I thought to myself \"uhhhhh what a dive\". But after I sat back, relaxed and took it ALL in I actually kind of liked this place. \nWhat an eclectic group of people that pass through the G&G. Cheap drinks, fun to people watch, socialize (if you aren't the pretentious type) and the DJ was actually pretty good. He had this little dive going off. I would go back, probably not make a special trip here but wouldnt pass it up. I can see why people would enjoy Grant and green.", "author": "Tony C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-08-10", "description": "Place has the neighborhood   name of \"Gang green\" This place was a shit hole when I moved here in  1985 and it still is a shit hole. Bad elements bikers , gang members,  junkies, Losers , crack heads ...need I say more.  ?", "author": "Stash P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-14", "description": "Quite cheap for North Beach standards! I've been to this bar twice now, both times on a weekend afternoon. They have some great deals: Fernet is available all-day at $4 and during happy hour they have a buy one get one free special for the beer on tap - with decent beer selection. \n\nThey have a small live music stage and they play music via the jukebox when there is not a band performing. Overall, the bar seems like a great place to get some cheap drinks casually in North Beach.", "author": "Lance J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-27", "description": "The bartenders here are on it!!   Even when it's busy, they still seem to be able to pump out drinks like crazy !!  They also have some rad musical talent throughout most weekends.  If you're in the neighborhood, stop in and say hi to the barkeep.  I'm sure you'll be taken good care of.", "author": "Evan B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-11-22", "description": "Good place but kinda smells musty in there. The jukebox is also kinda wack because its a $1.50 per song and the selection isn't all that great. The pool table is a redeeming factor though. Its a good place to go get a beer.", "author": "Mike B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-01", "description": "My fav North Beach bar (well tied with Northstar Cafe).\n\nOpens 2pm to 2am daily and the bartenders are always awesome. 2 for $5 well / beer / mix and match drinks too! $3 shots of Sailor Jerry rum all day, SOLD!\n\n$1 pinball and $1 pool is also lots of fun. I'll be back, love this dive bar.", "author": "Chuck N."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-05-04", "description": "Service was terrible. A friend and I each wanted to order shots. So after we finally got a hold of the bartender, he barely looked at us and walked away as soon as I ordered my shot. So he brings my shot, doesn't look up and ignores our attempt to order a shot for my friend. About ten minutes later, we were able to get him a shot from a different bartender who started her shift. He was routing for the Dodgers, so we should have known. Haha. Aside from all that, the drinks were super cheap (and a bit watery to match), but we got coins with them that we immediately traded in for two more free drinks, making our drinks half price, or buy one get one free, which I hear is standard practice during happy hour. So, how much can I complain?", "author": "Kristina K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-09", "description": "A place i rarely frequent... Its rather small.. And for whatever reason trouble makers seem drawn here... And the crowd is fairly young when it gets busy..\nNit a place to watch sports- but for me that only matters during football..\n\nThere really isnt anything that you can really say about  this bar..  BUT:\n\n\nAWESOME bartenders.\ncool bouncers \nGreat music. \n\nYep thats about it.", "author": "Lisa H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-03", "description": "I realized I needed to update my review here.  My issues with it are still the same (a little expensive, out of the way, etc), BUT, they are currently (as far as I know) the only dive bar in the city that still offers Local Music on a regular basis at no cover to the patrons and actually pays the bands.\n\nThe booking agent gets back to you, the bartenders are super nice to the bands, and as long as you show up, bring a few people, and stay the night, they'll give you a little cash for the effort.  While this seems like it should be standard, this is unfortunately a rarity in San Francisco, so I feel they deserve at least an extra star for keeping it real and giving musicians a place to perform without giving them a holier-than-thou attitude b/c they run a bar.", "author": "Tmon B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-12-16", "description": "One of our stops for Santacon... Cool beats, cool crowd, gross barf in the corner of the bar... NEXT!", "author": "Leana L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-13", "description": "It's been said many times in the other reviews... but it needs to be said again.... HAPPY HOUR!  2 for 1 beers... good beers (in my case it was the Barney Flats Oatmeal Stout (YUM!) but there were certainly other great choices.  Tell me another place where you get Anderson Valley on tap at the rate of $2.50 a pint in a city like San Francisco and I will be there!\nA block off Columbus... so in the heart of everything North Beach...  (and when you get the munchies, head down the block to Golden Boy Pizza and pick up a cheap slice of sausage pizza for $3.... then back to your $2.50 pints!!!!)", "author": "Mike D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-06-22", "description": "Dive bar. Tables were filthy and covered in sticky drink residue. Only plus is cheap happy hour. You get a token for a free drink with the purchase of a draft beer or well drink. Wasn't very crowded on a Saturday night. We left after our free drink to go elsewhere as loud obnoxious girls were screaming over by the pool table.", "author": "Courtney O."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-11-09", "description": "Came here while bar hopping in the area, and we had to fight to just get through the door -- meaning they would have a really huge issue with the fire department.\n\nIt was absolutely impossible to move around the place, and we couldn't even think about trying to get a drink.  The decor is like your normal dive bar, and everyone there looked like they were having a great time.\n\nI can't get myself to give this place more than 2 stars since my experience was so poor, but I am willing to give it another try.  Hopefully this time they keep watch as to how many people they're letting in.  I know it sounds like a 'buzz kill' but, in my opinion, it'll make for a more enjoyable experience.", "author": "Pia V."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-10-25", "description": "I'd give no stars if I could my best friend and I were in san fran for a quick girls trip and popped in here for a drink and asked for something on the sweeter side and the owner rudely says we don't make foofy chick shit here. To our surprise we were speechless we didn't ask for a dirty Tina on the beach with a cosmic twist we asked for something sweet. So we proceed to order shots I order makers and my friend orders patron well we only have a couple shots left of makers what else do u want I says whatever you serve me. So he makes a suggestion and goes over to pour my  shot and goes ahead with pouring the last two shots of makers... ok?... so our shots come my friend asks for a pinapple chaser and I ask for a splash of soda on the side he says all we got is sprite... ok ?... that's fine we take our shots and what was in my chaser glass ??? Water!!!! U gotta be frigging kidding me it's like someone just gave a bar to the most unprofessional unsociable unhappy person in the world. We left immediately and as soon as we get outside we both say almost simotaneously that wasn't the booze I ordered. Whatever i had was NOT makers mark and my friend who only drinks patrons says that shit tasted like hornitos. Terrible service, terrible bar and terrible substitute alcohol. THAT'S WHY IT'S SO CHEAP TO DRINK THERE! ur not getting what yur ordering. It took 2 blocks to shake off whatever the hell that guy served us.", "author": "Tawny M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-07-30", "description": "Don't go here go to Tupelo it's way nicer and they're so friendly!! The place is cleaner too and less of a shit hole. The bartender here was extremely rude and told us we had to leave for drinking the last sip of our water bottle because we walked 50 minutes to get here. It wasn't just that he made us leave it was how condescending he was towards us. Dude was clearly on a power trip. I would never recommend this place to my worst enemy, hopefully they fire him soon so people can actually enjoy what that place could potentially have to offer if they had some capable employees with customer service experience. Tupelo though is amazing! Beer, vibes, employees everything is exceptional and it is literally two doors down from this hell hole!", "author": "Lauren S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-19", "description": "Great place if your looking for cheap drinks and Pool. Grant street is full of other really popular bars in the area as well so you'll never run out of stuff to do. whether you're starting then night or finishing it off Grant & Green Saloon is really the place to be. It's pretty quiet up until about 7 or 8 but then things really ramp up. definitely worth checking out if your in the area and looking for good drinks", "author": "Peter B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-09-19", "description": "I don't think this place deserves the low ratings that it receives.\n\n The Sunday bartender is a cool cat and he's not a douche. \n\n If you are there at night when it's busy, the guys at the door are nice & just doing their job. They have never bothered us and I've been there with guy cousins as well as with the girls over several years when we end up at Grant. Same treatment. Never had a complaint.\n\n Don't believe everything you read on Yelp. Isolated incidents v. themes.\nFigure the difference.", "author": "Athena S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-10-11", "description": "Imagine a North Beach pub where a coke costs only 2$ and you get free live music. Inspiring - great music.\n\nI saw two bands perform on a Wednesday night and had an amazing time.\n\nI counted about 60 people - most were locals or fans -  but there were four or five military guys dressed in uniform  - here because of fleet week.\n\nI posted two pics.\n\nWhat's so weird is that I've lived in SF many years - and just recently I heard of this cool place. Where have I been?\n\nAlthough I brought a friend - it's an okay place to visit by yourself because G&G is  okay with your eating at the bar. Its especially enjoyable if you play guitar.  There are a few nice restaurants close by too.", "author": "Emmett M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-02", "description": "My friend and I went in later on a Monday night for \"one last drink\" and had such a great time chatting with Mikey the bartender that we ended up staying until last call! A fun place with great staff. We are from the Boston area, so Mikey suggested some great things for us to do while we were in the area, which was much appreciated! We will definitely come back next time we're in the area!", "author": "Kristina L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-05-03", "description": "The bartender is really nice and friendly, but cash only makes it a little difficult to enjoy. As another reviewer said, it can get very 'bro' in here: lots of beards and baseball caps. The crowd is a majority a hardcore North Beach crowd, and they can get rowdy and offensive to outsiders - at one point trying to instigate a fight with my boyfriend (never seen a gay couple before?) But since these guys were 'cool' with the bouncers, we ended up leaving instead of the offending party.", "author": "Ariel S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-02-16", "description": "Beckoning from the street, the sign outside this mega-dive promised $4 tall boy PBRs. For me, the biggest fan Mr. Pabst ever had, such a promise sang to me like some irresistible mating call. So we ventured into this dark, dank little dive with hopes high.\n\nBut alas, it was a lie - a cruel joke. They were OUT of PBR.\n\nHow DARE you cruelly crush my liquid dreams and force cheap vodka on me instead?! For this insult alone, Grant and Green fell from grace in the eyes of this dive-bar aficionado. \n\nThe place is a hole in every sense of the word. Surly bartenders, cash only, a loud loud loud live cover band and unbelievably inebriated patrons dropping bows and screaming gibberish.\n\nThe band wasn't bad - a shade better than mediocre. Some decent tunes filled the room, but the drunken band of idiots occupying half the establishment took away from some of the entertainment value. I'd forgotten, in a city where last call takes its final breath at 1:30am, the populous needs to get their drink on EARLY. So expect to find stumbling fools aplenty at 10pm. \n\nI would potentially return, if only to see if they could fulfill their broken promise. And perhaps, with enough PBR in my little system, I'd be a better sport about the rabble-rousers, the weirdos and the stumbling half-wits that surrounded me.", "author": "Hannah S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-04-20", "description": "Stopped in here for a drink while walking the neighborhood, it wasn't much of anything special. The bartender was unfriendly and boring, not a big selection of alcohol.\nThe main reason we stopped in was because it was during the day, about 2:30 P.M. and we were looking for an open spot to have a drink,but with all the other selections in the neighborhood, not sure if we'll be going back.", "author": "Roxanne R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-02", "description": "Always a go to. A little rough around the edges but what fun place isn't. Great area and staff was great. Zak was our tender and is a great guy.  No frills here so get over it, or get out.", "author": "joe m."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-03-22", "description": "Angry....crazy....and drunk are not characteristics I look for in a bartender, but if that sounds like ur cup of tea then this is your spot. Never again....", "author": "Laurie D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-23", "description": "Grant & Green is so close to my place, but in 3 years living here I have been there only twice. This is about to change. Why? The super cool live jazz on Monday nights.\n\nThis past Monday I was invited to go check out the jazz band that has been playing at G&G for over a year. Big Michael leads the band and supports different musicians who come by and take turns. The small crowd consisted of other musicians and the few locals that know about this lovely opportunity to enjoy good live jazz played by people that are very passionate about their craft. I had such a great time with my super enthusiastic companion and the fun energy of the musicians that I am already looking forward to coming back for more jazz!", "author": "Simone W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-11-20", "description": "Shockingly poor service.  Came in last night to get a drink, and the bartender was at the other end of the bar talking to a buddy.  Waited about 15 minutes for him to finish the conversation.  No dice.  So walked over to get his attention and see if I could get a beer.  His response \"I'll get you your drink when I have finished the conversation with my buddy.\"  I am not joking.\n\nCan't say I've ever experienced that before - not even in college.  Many of my friends go to this bar and give them good business.  I called every last one of them and told them what happened, and we all decided to boycott the place.  \n\nGiving customer service like that - in this economy - is just not very bright.", "author": "Mark L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-23", "description": "\"Welcome to Grant & Green Saloon, Purveyors of Cold Beers, Strong Spirits & Good People.\" Grant & Green has a mellow punk vibe. There is a small stage for live acts. Posters of the Misfits and the Dickies adorn the walls. They have one of the best happy hour deals in town. From 4-9 pm, every drink gets you a token for another. There's also $4 Fernet all day if you're into that. Service is good, especially when the owner is behind the bar. There is a pool table and a Metallica pinball machine! The one major drawback of this place is that there is only one co-ed bathroom.", "author": "Patrick S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-01-10", "description": "i like that they had a live band.\ni like that service was pretty fast, and that there were some drink specials.\ni liked the set up of this place.  it wasn't too crowded.\n\nit's just not really my scene.  there were a lot of guys, and i was extremely overdressed as usual.  some of the guys were getting sloppy and pushing each other around.  i had half a beer spilled on me.\n\nnot really a place for a girls' night out... or any night out for me.", "author": "Jennifer L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-12-02", "description": "One sip of beer and i could tell the taps need a cleaning! \nPoor beer selection, grimy place, and the worst part is the horrible, rude, arrogant service at least by the weekend night staff. Stay away and go the other bars nearby that are clean, cool, and have tasty drinks and great service. In this economy, ill spend my beer money el$ewhere but here.", "author": "Daniel S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-06-07", "description": "One of those places that are awesome drunk, but when sober you realize how bad it smells and how dirty the bathrooms are. \n\nGreat stage for live bands though and all together it's a great atmosphere.", "author": "Kevin K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-07-01", "description": "Cash only bar with a semi-official looking ATM tucked away in a corner.  Decent live music.  Not a favorite, but okay...", "author": "Scott P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-05", "description": "My old work watering hole. \n\nCheck the sign on the side of the building next to the front door. That's where they advertise who's playing when and what the specials are. If you're lucking it will say \n\n$2 FERNET SHOTS\n\nIf there was a live band playing, I'd pop in for a handful of Fernet shots to get the ball rolling, and then get the heck outta there (because at the ripe old age of 25, my ears can't handle the loud music anymore.)", "author": "Christina S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-01", "description": "This is my favorite bar in North Beach but their New Years Eve DJ was the biggest jerk I have ever seen perform here. I haven't ever seen someone take breaks to make out with random girls during songs. He was exceptionally rude to people who I saw request songs. I hope Grant and Green doesn't decide to use him again.", "author": "A B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-02-26", "description": "I mean, the place as a couple of TVs. It sells alcohol, and it's in North Beach, which is cool.\n\nHowever, this place is not dive-y enough to be a true dive, nor is there a shotglass of class (or @ss) in there. Let's be honest- a halfway dive is just a dump. That's what this place is. \n\nThe best thing about the place is that it can host live music on stage. That is certainly a perk. \n\nI never understood the draw to the bar, however. It's not really a neighborhood hang out (and this neighborhood DRINKS!) . The location is great- perhaps, that's the draw.\n\nAnyway, I think that the bald manager who thinks he's God's gift to revive cool needs to know that slinging crappy drinks and Pabst ain't original . I think you are better off going to a bar where there is some sort of personality. \n\nOn a good note, the bar is walking distance to some good food and bars and prices are reasonable.", "author": "Lothar P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-11-28", "description": "Douche baggy. Yikes! Will not be back here. I used to go here a long time ago and since moving to North Beach a few months back, I thought it would be cool to stop in. \n\nI was really unimpressed. Place looks grimy and and bartender had a huge attitude with clientele. Too bad, the neighbors in the area need a friendly bar. Even we like to go out in our 'hood on weekends and don't need to be greeted with hostility. Will be hanging out across the street, service is way more pleasant.", "author": "sarah m."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-29", "description": "Chill environment. Live bands. $15 dollar minimum that they advertise. Pretty cut and dry.", "author": "Naimah M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-05", "description": "The happy hour is great!  It's every day and is buy one get one free, drafts and well drinks.  Nice bartenders, manager, owner, and door guy.", "author": "Paige W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-02-03", "description": "Great dive bar, the ambiance is great, the music is awesome, had a great time there.", "author": "Betancourt E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-02-03", "description": "On a recommendation for a locals joint I made my way to Grant & Green and was not disappointed. This must be where it happens. Good selection of beer on tap, quick service from a standing room only bar and terrible live music combined with a dark and dirty feel. I love it!\nNothing special about this dive and that's what makes it great.", "author": "Mark F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-20", "description": "I give this place 5 stars because it supports local bands, live music every night, dancing, good drinks, and friendly staff. Kinda small, gets a little stuffy but you can hear some great music from time to time and the neighborhood is filled with lots of other things to do if you don't like the scene there. It can get really crowded when there's a good band but larger clubs with good music get crowded too. Parking can be hard to find especially on weekends.", "author": "Ron W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-11-14", "description": "Ooooh a sausage fest!  With an average age of 25!  Although I was repeatedly assured that I was NOT a cougar (damn!), I still felt extremely old in this place.  \n\nMaybe it's because I'm a girl, or maybe it's because I still had on my full Britney gear, but I appreciate bouncers who don't give me crap when I wander in and out.  Which tends to happen... a LOT.  \n\nIt's doubtful I will be back unless my friend comes to town to play thins place again, and I didn't try the drinks...but if you're a young chick who needs a little lovin', this is your place.", "author": "Pam S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-12-29", "description": "It was fine. Dark, not overly friendly but they had a decent selection of beer and a good location. It is cash only and the drafts were $5.", "author": "Tammy S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-09-06", "description": "Grant and Green needs to seriously invest in air conditioning. I'm a dancer and have been here three times to see a friend's band. Every time I've felt ill and have sweated buckets because they have no air circulation. While the bartenders are cool and pour great drinks, it's impossible to stay in here for more than an hour without experiencing heat exhaustion. Truly an over sight by management.", "author": "Casey S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-12-04", "description": "No coverage for live music - some good bands too.  Last night, we were there for a Tom Petty cover band, good times.  They had a $3 orange Patron special.\n\nEntrepreneur, Scott, is super cool and friendly - lots of fun too. \n\nNo frills, a solid bar w/ live music - what more can you ask for?", "author": "Gloria H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-03-14", "description": "Popped in to kill some time & watch a little college basketball on a late Saturday afternoon.  The bar is your typical dingy lighted place with your run-of-the-mill well drinks.  At night there are bands playing, the music is varied (according to the bartender).  The low point of the establishment - Bathrooms are not the greatest. if you just want a spot to hang with your friends, be prepared to do it standing because seating is limited.\nService was good, not great.  Bartender was nice & pleasant.  \nBar was not expensive.  \n\nIn the end, G&GS is what you would expect.", "author": "Brett L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-04-08", "description": "I've been here a couple times now in the past few months and I actually regard this place as a fairly friendly place to go right after dinner in the more strictly culinary area of North Beach along Columbus ave. I've seen a couple of bands here, and they play all night. I'm not much of a drinker, maybe more of a people watcher, but dive bars such as this suit that purpose well. They are cash only. They have a small standing area and a random, very conspicuous Deer Hunting video game that attention enthusiasts can use to get noticed since its right in the middle of the room in front of the bathroom entrances. Seating is sparse but the general feel is friendly; you'll never get stranded among people when trying to get out for too long like you would down at Tupelo.", "author": "Davey R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-05", "description": "Good music. Local bar. Good prices. Good service. Stumbled upon this bar in North Beach because of the Happy Hour sign buy one get one free everyday from 4-9! Great Deal. Sat at the bar and it reminded me of a local Boston bar. Good rock music. We had drinks until after 9 then wanted dinner and asked if we could come back with food and sit at the bar. The bartender said no problem, so we left and came back. By that time there was a DJ and people dancing, but low key and down to earth. The owner was very cool and made me a special drink upon my request. No frills place, but good vibe and felt comfortable. Not trendy. Would definitely come back when I'm in town again. $5 cocktails and beer. Can't beat that in SF.", "author": "Jeanna B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-04", "description": "This is my favorite North Beach bar. There is no cover and there are always bands playing. It's very small and there are only two bathrooms which can be quite smelly at times but what bars in SF aren't small with smelly bathrooms?? The drinks are always generously poured and I don't think they are overpriced at all. There's a huge pool table, although I think they should move it out of the way because it takes up dancing space. People here are always friendly and it's a safe area. We always walk around and go bar hopping and eat dinner and then end up back here at the end of the night. Plus there's a parking garage just off Columbus that's easy to walk to and from if you can't find street parking.", "author": "Dusty N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-05-18", "description": "Grant and Green is a small treasure of a dive bar located in North Beach.\n\nThe venue is small, perhaps 600  - 700 sq feet. \nThe bar a long bar and the wait is never over 5 minutes.\nThe bathrooms open face the entire venue leaving it smelling like urinal. \n\nThe only reason this place gets a moderate review is due to the quality of bands the stage houses. The two times i have attended Grant and Green the bands have ripped and roared their notes into my heart via the sweet jam of classic American rock.", "author": "Peter T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-02", "description": "Bartender was so nice here! We are visiting and she helped us get around as well as made me a bomb birthday drink! Great stop on your bar crawl.", "author": "Rachella N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-10-23", "description": "Here's a review of the place from the perspective of someone who has played a number of shows here over the years:\n\nPros:\n-Floor layout:  The area in front of the stage is relative small, so that helps make it seem like the place is packed with people and also makes everything that much louder.  The bar is off to the side, so that makes it easier for people not there for the band to stay away, and I'm sure it's nice for the bartenders who will have an easier time hearing drink orders.  Oh, another big bonus... no need to haul your gear up a huge flight of stairs because everything is on one level.\n-Foot traffic:  It's North Beach and there are always people walking around in the area, so chances are you'll be playing in front of more than just your gf/bf and perpetually single friend who's got nothing else better to do on a weekday/night.  \n-Other stuff:  TWO Ceiling mounted fans pointing at the stage!!!  Given the tiny ass stage this makes a HUGE difference.  In the past, it would feel like a freaking sauna on stage.  Bar staff/bouncer dudes have always been respectful and A-OK to me.  Oh, and no cover charge, so there's no excuse for your cheapass friends to come out to see your awesome band. \n\nCons:\n-Stage:  it's tiny, and if you're anything more than a 3 piece, you better make sure everyone in the band loaded up on deodorant.  Consider backlining with other bands as much as possible, otherwise prepare to setup your gear FIFO, not LIFO (you know, because the stage isn't deep enough for more than just one band's stuff).  \n-Sound:  No monitors (as of Oct 20, 2012), soundcheck, or sound guy.  Note to whoever in the band stands closest to stage right:  the mixer is in front of you so you'll likely be your band's sound guy.  Expect everything to sound like shit from the stage.  \n-Parking:  is pretty much impossible on the street... a number of hourly/fixed rate lots are nearby if you're low on parking karma\n-Other stuff:  No separate access for loading in/out means you have to wade your way through the crowd to make it to the front door.  No green room (but you probably knew that if you're playing here).", "author": "Steve L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-15", "description": "Your quintessential SF divey bar with a great vibe!  Jukebox, pool table, good drinks, cool bartenders---what more do you need. Trevor the manager keeps things rolling and is a great host (ok, he happens to be cute too..)  Check is out if you've never been in!", "author": "Melissa P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-11-05", "description": "Nice bartenders. Good venue for live music.\n\nThis place never quite seems to get too packed...which is great when you just want to hang out and talk, but not so good when you're looking for a social bar scene. The plus about this place is that the venue is PERFECT for live music. There is ample space to rest your beer or (as I prefer) cocktail, kick back, and enjoy good live music. \n\nGrant and Green also introduced me to this amazing man that I had never heard of before...Sailor Jerry. $3 sailor jerry's are always on the menu and since Captain Morgan and I had a nice little fling in college, I thought I'd take it back and do some reminiscing. \n\nOk, so Sailor Jerry isn't THAT amazing, but it's $3 here. Can't  beat that!", "author": "Seanté B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-19", "description": "Prototypical dive bar not the type to make you feel dirty for hanging out in it. Happy hour is a good bet if you like to drink for cheap after work (the whole bar is cheap). Dollar black stars until they run out (I guess this is how most of the deals there operate). I can't comment on the live music - which I haven't seen - but there always seems to be enough people hanging around on those nights. Has TVs but wouldn't say its a sports bar", "author": "Taylor C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-03-06", "description": "A dirty dive bar with ex convicts and mental patients for customers.  The music is usually horrible though I do like the fact that they support live music.  Place needs a makeover badly!", "author": "Kyle K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-05", "description": "I really enjoy Grant and Green for live music! We were here the other night for my friend's band. They have a raised stage, so it is easy to see (even for us shorties). The service was quick and friendly. I would definitely classify this as more of a dive bar, but that is my favorite type. They served me red wine in a pint glass :)  The prices were on the lower-end for SF, but it is cash only. The only other thing that I can say about it is that it was extremely hot inside. But overall, I will definitely be back to check out some live music.", "author": "Alycia N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-11-07", "description": "Reasonably priced and bonus points for supporting local bands.  Beers were $5 and hard liquor was $6.  I explained to the bartender that Zwack is known at Unicum in Hungary.  It's like Jager, but less crappy.\n\nThe downsides... it gets really warm inside and parking's impossible (like most of North Beach).", "author": "Andrew C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-06-28", "description": "Ya never know what you're going to get!\n\nOn Saturday it was a bunch of crunchy people,two guys with dreads to their waists, some bros, some overdressed girls and a chick in a red glitter bra, a thong and a chain mail loincloth.\n\nHoo boy!", "author": "Eli B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-10-08", "description": "Stopped by after the Fleet Week festivities. Your standard dive bar. Looks like they do live music in the evenings.", "author": "Stacie M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-05-28", "description": "I am all about a place that offers up beer pong that ISN'T Bar None. I will admit that I am a fan of this college-time drinking game, but I refuse to continue frequenting college-like bars where 21-23 year olds douche around too wasted to walk a straight line. \n\nGrant and Green Saloon was a great spot for one of my Sunday Funday rendezvous - central to lots of other fun spots on Grant Street. No doubt I'll be back sooner than later.", "author": "Julia N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-12-02", "description": "Loved this place! Awesome band on Saturday night and strong drinks. Good service. Fun with a big group.", "author": "Lauren C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-05-22", "description": "This place is okay.  The place does have live bands, but it gets pretty loud.  It's not a place where I would recommend friends to go to.", "author": "Dipesh G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-02-19", "description": "I came here with a friend for happy hour and enjoyed a couple $1 PBRs - thats one of their happy hour deals. I mean, how can you resist $1 PBR? Actually, I'm sure many can, but I digress...Grant and Green is a really chill spot and the bartenders and patrons are really nice. They thought my best friend and I were on a date and while my friend was in the bathroom, the bartender said \"You deserve more than a cheap date...is he really only buying you $1 Pabst?\" Of course I explained that we were best friends and that we were broke and just wanted to grab a drink somewhere, so that was that. \n\nThe next time I came here, I had a COMPLETELY different experience. My friends and I were trying to figure out a place to go for NYE. Most of them were broke, so we settled on a place that would be free that night. We originally wanted to go to Maggie McGarry's next door, but they were charging a $20 cover, so we went to Grant and Green instead.\n\nIt was pretty crowded, which I expected, but it was so hard to get a drink. The DJ was good and played songs that everyone could dance to - and fist pump - but they didn't start a countdown when it was about to be midnight. That was pretty lame. After that the night pretty much went downhill, but none of that has anything to do with Grant and Green, so...\n\nI think I'll stick to happy hour here and probably try it out on a weekend again, but never for NYE.", "author": "Stephanie C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-06", "description": "live band. stiff drinks. prices are reasonable. so loud in here that you can barely hear yourself think.\n\nvery crowded.\n\nstaff are all pretty nice.\n\ngreat place to get hammered with a group of friends.", "author": "Kyu L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-05-18", "description": "Your classic dive bar with live bands. Nothing special and nothing fancy. It's great place to watch the game on a weekday. During weekend nights, it's pretty much too loud to even think or breathe since it get way crowded. I guess you really shouldn't be going to this bar to watch a game anyway. I've never had a cocktail here so I can't say much about that but the bartenders are nice enough when pouring me a beer. The only awkward thing is that the restrooms are right in the middle of everything so that when you walk out, not only do you shine everyone's faces with a bright fluorescent light but you may also be sharing other things that \"tickles\" their senses.", "author": "Rylan C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-22", "description": "Ya know, I've always enjoyed going to Grant and Green. It's pretty small, they are attentive to their customers in terms of drinks, they have a little stage and area to watch live bands play and it's in a central location to other good bars. Last night was especially fun because our friend's band was playing and it was packed with people attempting to mosh and dance. There's definitely a fun lovin' crowd inside and I've always seen hot guys when I've gone there. Total perk!", "author": "Sonya D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-06-20", "description": "So let me tell you about Scott the bartender. \n\nIf they had good service it woulda been fine. But the bartender was too busy hitting on every girl who walked into the place to serve us. Every girl that walked in left until he finally got one and he actually came around the bar to hit on her while the guy she was with was in the bathroom. Man I would have been pissed if I was him.", "author": "Adam W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-03-12", "description": "I'm a bit miffed. I rolled over to Grant and Green to see my friends' band play on Tuesday night. Had some pizza at Golden Boy, walked around with some buddies to hand out some handbills to promote the show in the neighborhood and eventually got back to the venue. \n\nThe music was supposed to start at 8 to 8:15 but the manager was telling them they couldn't start yet. It was 8:30 by the time I got there. They were supposed to wait for a hand wave or something from the guy in charge who was merrily playing beer pong and drinking. \n\nAt about 8:45, after having several people ask him when the band would start came over and said that the concert is definitely not happening and the shuffling iPod DJ would continue. Everyone who came out to see the band was sort of awe-struck. \n\nHow many times has anyone seen a band be able to fully set up, sound check and be totally ready to go, with 20some people there to see them - and more on the way...... and then be told they can't play because: it would disrupt the cliquey beer pong tournament that had a whole 10 or so people playing in it.\n\nWe decided the best thing toi do was to clear out and left the place almost completely empty in the bar area with that dozen of people hanging around the beer pong tables.\n\nI know one friend was asking for her money back for her beer, I hope she got it. Sure, the band got paid their $50, but that's not worth the price of them and their fans that came out getting jerked around.\n\nThis was a fiasco in management at the Grant and Green. I'm avoiding that place like the plague - there's always Mojito next door, where they value live music.\n\nIf you're a beers-willing 35 year old frat boy wanna be who want to relive the beer pong days, yay, by all means, but i can't get over how badly this was all handled by this guy. \n\nMaybe other days there are better... I just can't get over this.\n\nSorry about venting.\n\nbut... seriously?", "author": "volker n."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-06-15", "description": "GROSS!\n\nThat was what went through my mind the moment I stepped in!  The humid sticky air hits you full in the face... and you KNOW in that tiny bar that all that hot air is putrid, steamy HUMAN BREATH!  ew.\n\nAccording to my friend, the band was butchering their cover songs as well.  But my one star is for the atmosphere... it's just a black bare box full of human breath.\n\nTake a shower after you go there, or at least wash your face ASAP.\n\nLuckily we were dragged here by other people... I'm never going here on my own decision.\n\nEw.", "author": "Kitty O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-26", "description": "I prefer Grant and Green for day drinking purposes. I most recently stopped by here during the North Beach festival, it was a great place to stop in and get out of the heat for a cold beer. The staff is super friendly and they have live music! Only downside is that they are cash only!", "author": "Stephanie T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-04", "description": "Church Key is where we were headed, but it closed just as we got there. There was a large crowd outside here, but not a line, just people hanging out enjoying the music. \nThe live band playing was really good, right up until they took a break. Great drinks, good music... a surprising end to the evening.", "author": "Gurpreet S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-11-20", "description": "Dropped in for a few drinks last night.  The DJ was great, atmosphere good, bit the bouncer at the door was a complete jerk.  As we left we were trying to flag a cab in the rain.  He rudely insulted us as we tried to wait under the awning.  So unnecessary and not a way to treat customers.  Ruined our night.", "author": "Kip Z."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-01-02", "description": "Decent place to chill with spotty live acts (guitar duo sucked).", "author": "Inigo M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-06-03", "description": "To be honest, even when I'm drunk I stumble past this place.  Live music almost every night, and a pretty cool \"open blues Jam\" every Monday night definately gives it a nice and unique feel.  \n\nThey have some chill beer pong during the week, but if you show up on a weekend it's either a sausage fest or too packed to move.  I just can't manage to have a good time..\n\nThank god their chill during the week.  All in all it's not that good, but drop by for a quick cheap drink... $1 PBR on Mondays!", "author": "Joseph F."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-03-12", "description": "Hire a band, then schedule a beer pong tournament and tell the band not to play. What's more astounding is the drunken frat boys and their underage girlfriends for some reason not wanting to get drunk while listening to great funky tunes. \n\nHmmm. This had to be the worst, rudest crowd I have ever been in contact with. It must be from drinking the shit off the floor from bouncing a ball on the dirty mucky floor and then drinking it. Must make you mental. \n\nGuess the manager didn't want to make any money. I know everyone who came to see the band left. The wine there sucks and the drinks are just expensive for the rude service. \n\nI used to like coming here. Now I just won't. I say boycott them.", "author": "Marz W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-11-12", "description": "3/12 stars it got a grunge look to it and the live bands are great not really spacious but the drinks are made well, bartenders are always smiling\n\nalcohol **** yes they make snakebites if pear cider is stocked\nprice $ its the city so moderate price\nambiance*** dark, small", "author": "Clarence A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-05-19", "description": "No cover for this place...went here because of a friends b-day. The music was ok but they don't accept credit cards which really pissed me off! What kind of bar doesn't accept credit cards??", "author": "nabil s."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-14", "description": "I can only comment on their 2nd Wednesday of the month when they have an awesome 9 piece reggae band play. I haven't hung out much in North Beach so I am not sure of the normal vibe. I guess I would describe it as Marina type dudes, except skinny and non-douchy. So like a non-fat bro with a side of cracker.  Oh and here you also get drunk moms getting down on the dance floor. Eclectic mix  of people. I like it. The bouncer is way nice and fun.", "author": "Kat M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-03-28", "description": "Popped in here on St. Pattys day, one of the few places that didn't have a huge line, huge cover, or huge anything else. It's pretty small. It was crowded as hell, but the bartenders were being quite efficient and we didn't have to wait as long as I expected for a drink. Probably because it's cash only and that's easy. They had a DJ going with decent music, and of course all the @#$%shows from St. Pattys celebrations. But it was rather inexpensive, the bouncer dude was plenty nice, and it wasn't as bad as I figured it would be despite the drab decor.", "author": "Justin M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-27", "description": "Columbus Cafe is pretty much my headquarters when I'm in North Beach, but I've been known to pop in here from time to time. Always had a pretty good time. They have live music which I'm not a huge fan of, but somehow I enjoy it when I come here because it fits. They also have a couple of big HDTVs so as I don't miss any action being the sports junkie that I am. Me and B watched Nevada upset Boise at this very spot. Good times. I hate Boise.", "author": "Morris D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-03-12", "description": "I had a terrible experience with Grant and Green.  The bar booked my friend's band to play a show two nights ago, and after setting up all their equipment, the management told them they were canceling the show because there was beer pong going on.  Both the concertgoers and the beer pong players couldn't see why the two were mutually exclusive, but the management refused to hear otherwise or compromise.  90% of the patrons walked out of the bar on the spot.  Unbelievably disappointing management.\n\nThis was my first impression of/experience with Grant & Green, and I plan to avoid the place from now on.", "author": "Allison Y."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-05-02", "description": "So basically, this bar attracts meathead douchebag guys and mean girls (like, as portrayed in the Lindsay Lohan film.  The kind that still asipre to be \"the most popular girl in school\" even though they graduated from Chico 3 years ago and are now employed somewhere full time.  Probably a pharmaceutical sales firm or Bloomingdales.)\n\nAlso, I WATCHED a girl get roofied by a creepy old man.  When this girl was falling on the floor totally incoherant, I took her by the arm, helped her gather her things, and walked her toward the door, where said creepy old man told me that the girl was his friend, that I was a cunt, and that he would have me kicked out of the bar \"cuz he knew the owner\".  This dude was like... 65.\n\nSo after the doorman told me to \"let them go\" and then confessed that this guy is a regular and practiced this routine with some frequency, I realized I was in the 7th ring of hell.\n\nSo, to drown my depression, I ordered another $5 PBR (recieving sneers from the Bloomies Girls drinking Stoli Razz & 7up or whatever) and slinked back to my table, which was now inhabited with Crazy Tattooed Face guy who was waving his arms in an attempt to put a voodoo hex on an acquaintence of mine.\n\nAfter the BF's friend's band was done playing, I practically ran away screaming.", "author": "Laura F."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-01-21", "description": "ugh.\n\nthis place is so..how do you say it...\n\noh yeah,\n\nchico.", "author": "Alex P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-12", "description": "this whole section of the city is one of the best kept Secrets in San Francisco , the service is OK,  kinda crowded , but it was on the North Beach festival , great dive bar.", "author": "Diego D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-03-25", "description": "A decent North Beach bar for friends. Not for a date.\n\nSometimes they get some great live bands playing cover songs. \n\nThe bad: A bit crowded on good nights and it sort of has that sticky floor, frat house basement feel.", "author": "Jesse W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-11", "description": "My girl works the bar and works it good.  I love GG.  They have fab drink specials and live music every night.  Good times!  Go, Go, Go.", "author": "Jennifer T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-10-12", "description": "Let me preface this review by stating a disclaimer that not ALL of my reviews are going to contain a story wherein I am liquored up and ridiculous. That said, this one does.\n\nMy introduction to Grant and Green was during the North Beach Festival, where thousands of people (most of whom wish they were still in college) relish the opportunity to drink during the daytime and still adhere to socially acceptable standards. These people wake up thinking, \"Today, I am going to PUNISH my liver. And it is going to be the tits, because everyone else is a-floatin' in the same boat!\" Clearly, these are my brethren. \n\nSo I'm with my girls, and we're bar hopping, making our way over to the beer gardens, when we come upon this divey looking place with a sign that says, \"NORTH BEACH FESTIVAL SPECIAL: JACK DANIELS SHOTS\" and I'm like, \"Ladies... pit stop.\" I make quick friends with Ben the doorman, who's impressed with my ability to slam the whiskey like its the Sweet Nectar of Life and therefore does not charge me.\nWe move onto the beer gardens, followed by the concert in the park (Unauthorized Rolling Stones- fucking UNREAL., fyi).\n\nAfter the face-melting rock of the 'Stones cover band, I felt a twinge in my soul, like, something was amiss. The problem? The Jack Tingle (that's what I call my whisky buzz) was fading fast. So I confer with the gang, and it is decided that a return trip to Grant and Green is in order. Back we go, and before you know it I've regained my stride and power through the rest of the afternoon, befriending G&G all-stars such as bartenders Zak and Blaze, and the neighborhood drunkard Perry (whom I had to inform that I was not, in fact, employed by Centerfolds, much to his dismay).\n\nBy the end of my evening, I had lost my (roommates) sweater, my sunglasses, and my ability to stand or reason. This place kicks ass.", "author": "Anna K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-04-01", "description": "We came here for shelter from the rain and decided to get a few drinks. This is your typical saloon so don't try to order something fancy. It's simple and convenient. I don't think I'd come back unless I was in the area. It has a sports bar type vibe with a bunch of flat screens and screaming sports fans!", "author": "Jenny T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-05-22", "description": "Some good bars in town but this one is kind of the best I think cause there service is so good.  For alot of reasons in the end..  Its got a good FULL bar and lots of TV to. Saw some live music but NO COVER haha sick !! Dudes were shredding one time..  Anyhow you could try this bar to relax after work or bring some buds and watch the games.  Coming back here soon and you could to on a Friday maybe..  GO SHARKS !!", "author": "Xavior G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-04-20", "description": "My number one complaint, why does it always feel like a sauna in there.  It's so stuffy in there that most people have to come out for air at one point of their visit, that's why you see so many people hanging outside of it, well, also because it's so freaking small.  They do have a live band corner which is nice.  Drinks here are decently priced.  They never chill your shot here for you unless you request it. ...", "author": "Young N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-03-10", "description": "Cool little saloon to have a few drinks at.  There was a live band playing... they were the dorkiest wannabe rockstars ever, but I guess it worked.\n\nThe best thing about the place is the decor on the outside.  You definitely do not need to wonder what street you need to tell your cab driver to drop you off at and you can't miss good ol' Ulysses outside.  It feels like you're walking into a $50 bill.\n\nI'll definitely come back here again when I'm in the area.", "author": "Joey S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-17", "description": "I'm from southern california & my girlfriend knows i love dive bars & she recommended that we go here. Yes this place is anything but fancy, but it's a DIVE BAR!!!! They ONLY accept cash. So make sure you hit up the ATM before coming here. Also they make their own brew which only cost a dollar. So that is a lil nice treat for you ballers on a budget. lol Anyways I had a such BLAST here!!!! The bartender (Scott) was hilarious && nice (just make sure u dont get him in any camera shots. He hates that crap). He served us until his shift was over & still hung out for a lil while after at the bar with the customers!! I felt REALLY welcomed here. This place made my 1st trip to San Fran amazing & intoxicating! If u are from out of town && are looking for a dive bar && a good time I recommend coming here! Good times, good music, good vibes.....", "author": "V. P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-10-19", "description": "WHAT?!?! Is this an 18 and under Karaoke dance party? I'd say it is... Can someone tell the kids that Karaoke rap just doesn't work. Hey, better yet, DJ... Turn off that mic! I had to take myself right out of there after continues pain to the ears. I finished my special water and walked the hell out. \n\nAlright... so that was one experience. I tried it out for the second time. It wasn't much better. I figure, if I am sucking down my drink faster then a bubbolicuous losing its flavor means, BORING!!!", "author": "Dee C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-12", "description": "A nice, chill option in the neighborhood.  Strong drinks and cheap beer along with the option of beer pong (albeit on very small tables) makes for a nice afternoon. \n\nHave been here a few times and it's pretty spacious, and not insanely crowded.  Bar staff is really nice and very quick.  They tend to have the game on, which is a plus.  As we were heading out there was a band setting up, which might have been nice to hang out for, but we weren't tempted enough to stay.  A nice low-key start to the night!", "author": "Jaimie M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-11-16", "description": "I'm a big fan of a local bar and this one hit the spot on Saturday. Nothing fancy just great local atmosphere and a few colorful patrons. Music was great, bartender was friendly, beer pong was in progress and I was able to get a slice at a local pizza joint and eat at the bar. \nDrinks were reasonably priced.  Not over priced like some touristy SF joints but have cash on hand, credit cards not accepted.  They even had my booze, score.  Going back a block off Columbus reminded me of the North End in Boston which I love. Next visit to the city we will scope out more of the local hangouts.", "author": "Dianne M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-02-11", "description": "I wanted to go see the Spazmatics play at  this venue.  I was more excited to see the band play than going to the actual bar and rightly so.  The place was indeed kinda seedy and grungy but I have to admit it wasn't a bad place to go see a band play.  I had a Corona when I first got there and they served it with a bottle and lime and later in the night when I ordered another Corona they gave it to me in a can WTF?!  Seriously, who wants to drink a Corona in a can with no lime?\n\nThe band played and they were fairly good.  Everyone was dancing.  There were a few obnoxious people dancing on the dance floor. Unfortunately one of those obnxious people was one person from our party. I wanted to smack him so bad.  Good thing he's NO FRIEND of mine. He just came along with my sister's boyfriend.\n\nBut this venue seriously needs to think about investing in industrial fans. It was so freaking hot in there that I was showering in my own sweat.  Sooo gross.  They really needed more powerful fans breeze out the room.  Even the perfomers on stage were drenched in their own sweat.\n\nNot a bad place to go but I wouldn't rave about it.  If a good band plays, I'll go but I won't frequent the bar on a regular basis or anything.", "author": "Anne M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-01-28", "description": "Difficult to find, hard to park, and worst of all, the staff doesn't do nearly all it could with its stage. Singers would sound better with some monitors.", "author": "Jason K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-12-08", "description": "This is a great Bar! Same ole bar scene but they play reggae every other Saturday, I believe. And I love Reggae! There's also a pretty good size dance floor. \n\nOne thing I can't stand is there bathroom, YUCK! I think last time I went the sink was on the ground and people were using it as an urinal. So I did what I do best... grabbed a bunch of toilet paper and went outside to pee on the sidewalk.", "author": "Ashley C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2006-09-05", "description": "they get 2 stars - one just for even having a bottle of Pimm's in the place and the second because my friend's coworker was playing with his band this one night. that's it. They didn't know how to make a Pimm's cup, and decided it was just better to pour all that was left in the bottle in my glass rather than measure. That's fine, and really shame on me for expecting more. Go here if you have a real reason and for beer. Just beer. Nothing more. They do allow outside food, but since the inside of the toilets is visible to everyone in the place, I don't know how much I'd want to eat here. P.S. It's not even cheap for a divey bar!", "author": "Holly C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2005-08-25", "description": "Two Words: SNAKE JUICE. \n\nThis place rocks my ass so hard it hurts. My absolute favorite neighborhood bar. The drinks are like my men - big and strong (cheap, too!). The only venue in the city you'll find Jungle Rooster and Tommy Castro playing back to back. \n\nThis is also, incidentally, the only place I'll pee when I'm out in North Beach. Clean bathrooms that fit 10+ people. Drink a lot, dance a lot, wiz a little. Good to go.", "author": "Katelin H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-11-20", "description": "I have been visiting this bar for the last year and a bit so thought it was about time to write a review. \n\nThere is something about walking into a bar on a Friday night when you are not really in the mood for a mad one ,, but fancy some music and a few ales....Grant and Green is perfect for that. \n\nBen on the door is friendly and smiley ( such a rarity in this city), the bar guys and gals are courteous and quick and the music is often really good. \n\nThe space is small .. but I always find room to jig a little. \n\nHope to bump into you here sometime !", "author": "Amy W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-08-29", "description": "Okay bar but definitely not my favorite. The live music is fun to walk by in North Beach but, when you get a bit closer to it (when you're in the bar), it's actually not that great usually... it's hard to get too far back in the bar and I always seem to get stuck near the front door. At least you can still order drinks there though! The crowd is fun and chill and you definitely don't need to dress up to head to this bar!", "author": "Meghan P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-12-24", "description": "Good bar, where you aren't crammed in a bar with people and can have some cheap beers and watch the droves of North Beach walk by...", "author": "Jim B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-04-09", "description": "The price is well worth it. It can get a little rowdy, but over all a pleasent experiance. Monday nights rock. Cheers", "author": "Sarah P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-18", "description": "A good place to see some low-key live music and have a few drinks. The crowd is unremarkable, which is actually a plus if you're tired of dealing with people in the Marina or the Mission.", "author": "Mike O."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-03-24", "description": "If you want to listen to music..DO NOT go to Grant and Green to get exercise for your dancing feet because the band may not be allowed to play due to a beer pong tournament going into overtime. Not to mention a beer tournament that the manager is actively participating in and dominating.\n\nThis bar is fun for a drunken night of debauchery with your underage and over-glamorized marina girlies but NOT fun if you want to get a cheap beer (really, a pint was $6!!) and listen to some groovy music played by your favorite local band.\n\nI would STRONGLY recommend walking 4 businesses down on the same side of the street to MOJITO'S where the company is festive, the drinks will get you tipsy, the music is funky and there is no chance of the venue canceling on the band. Unheard of!", "author": "Amy P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2006-08-11", "description": "It just feels out of place for me.  Why is it in NB? Because of it, you have tons of randoms walking in, looking around, and leaving. It's a little too small as well.\n\nOk place to start out your night though and cheaper than most places in NB.", "author": "Ali L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-01-29", "description": "Friday-\nMe:       \"Look, they're playing 80's covers!!!\"\nAnnie:  \"Niice, let's check it out!\"\n\nSaturday-\nMe:       \"Hey, there's a reggae band in there!!!\"\nAnnie:  \"Sweet, let's go in! I love reggae!\"\n\nSunday-\nAnnie:  \"Let's check out what's goin on at Grant and Green!\"\nMe:       \"Grant and Green?!  OK!!!\"\n\nOne month later-\nJeanie: \"This is your new favorite place, Annie?!? It stinks in here!\" \nAnnie:   \"That's just cuz it's your first time!\"\n\nMinus one star for the initiatory stink!", "author": "Deanna T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-12-10", "description": "I love this place, and I love Ashley......she is the BEST!!!!  Great dive bar to just hang, listen to music, watch the game, and have fun!!!", "author": "Lisa C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-02-15", "description": "I had never been to this bar before. I went with a friend to check out some live music. I did not expect a tiny ass bar with a teeny little stage over looking the tiny dance floor. I did not expect folk music.\nThe company was pretty lame. If I lived near this bar...it might actually be a nice little bar to hang out at, but if your looking for a good time in the city, and drive all the way there for it...stay clear of Grant & Green, you will most likely be disappointed.", "author": "savannah f."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-16", "description": "3 words: Sex Type Thing\nKeep in mind that this review is based primarily on the live band that was playing when I went there, you guessed it...Sex Type Thing. A friend invited me along and mentioned that some of the members were also members of Tainted Love...that got me right there, I was in! I love cover bands and this one played all the memorable 90s stuff. Ah, memories. \nAny excuse to dance like a complete fool in a divey-type bar and get out of the Marina is enough for me. Beer was good and cheap and I like small venues to see bands. I'll be back with my dancing shoes on!", "author": "Kelly K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-05-27", "description": "The manager is a douchebag fratboy type who has no interest in having the live bands the booking agent books. He'd just as soon they'd leave.\n\nThey book great bands and then treat them like shit.\n\nI am a musician who had previously good experiences there in years past, but last time, the muscley douchebag bartender/manager Scott took my unfinished beer with a napkin on it, then yanked away the next one when I didn't immediately cough up $5. He acted like I was a swindler.\n\nIt would have been unprofessional of me to storm out, though I'd have liked to and had made promises to the players and fans to oblige.\n\nTo top it off, at the end of the night, the music was cut off without the customary one-song warning. This pissed off the fans who were there to hear us. \n\nDon't ever go to see your friends play here, instead suggest they find any of a dozen other venues on that street, even if you have to pay a few bucks.\n\nI read the stories about ping pong tournaments perempting the music and I'm not surprised at all.", "author": "Dave S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-10-02", "description": "The bartender gave me and my friend free beers as soon as we walked in, for no apparent reason. That rocked my socks that night, because stuff like that never happens to \"Ugly Betty\" types like me. \n\nThis place would've been a blasty-blast if I had been there with a group of friends, but it was a bit lonely, loud, and obnoxious with just 2 people. It was \"band nerd\" night, and everyone there was definitely the grown up high school drum major type - super dorky, yet super fun. \n\nDefinitely NOT a place to pick up men, at least not in my book, but a fun divey place to throw back a few canned beers with friends.", "author": "Rachel W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-06-16", "description": "Fun, classic North Beach bar-hopping stop. No cover, live music, decently-priced drinks. Think: girls in jeans and a scrubby-ish going-out top; guys in T-shirts, jeans and a scrub hat. \n\nPros: Good, live music, with plenty of space to dance. Cheap-ish drinks. Friendly, accepting atmosphere, with cool bartenders. Cool \"dive bar\" feel without that \"get-me-out-of-this-sketchy-place\" aftertaste.\n\nCons: When there's dancing, there is NO ventilation, and this place gets brutally hot and sweaty. Seriously, it's like being in an uncomfortable, dark, drunken sauna.\n\nBottom line: Fun place for a laid-back evening ou, but check out the music lineup first-- that will make-or-break your experience depending on what you're looking for.", "author": "Samantha B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-04-03", "description": "This bar gets 5 stars alone for booking one of my favorite singers EVER to play.  Shannon Curfman playing at the Grant & Green Saloon is the sole reason that I first set foot in San Francisco.\n\nI stepped out of the Embarcadero BART station, feeling like Mary Tyler Moore in a lovely city.   I was rather pleased with myself too, for using public transportation for the first time in my life.  \n\nLater that evening, I ended up at the Grant & Green.  The band was late, but the bartender was amazing.  I had a straight-up, slightly dirty, vodka martini right away, and was immensely pleased with how quickly it came, and how perfect it was.  The bartender didn't even bat an eye when my male companion ordered a lemon drop.  We hung around this bar for hours...  And when my male companion left to move the car, the bartender bought me two double washington red apple shots, and then gave my male companion a freebie too.\n\nYou all have this lovely lovely bar, and the fabulous Shannon Curfman (who rocked my socks off that night), to thank for me coming to this city and falling in love with it.", "author": "Suzanne C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-03-19", "description": "Great bar. Great bartenders. One of the best bloody marry's as well. \nThe only issue is on weekends the music starts at around 5 and it's loud. there is no need for some band to be on stage when there are more people in the band than at the bar.", "author": "Stephen K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-12-18", "description": "OMG, the bartenders here are amazing.  I came in with Santacon last Saturday.  About 200-300 Santas descended on the place the second that they opened the doors.  I was one of the lead Santas and got a seat at the bar.  The bartender asked for 90 seconds to get things ready.  And really, that's all the time he took.  Then the bar back came in (right on time for his shift) and they started.  They divided the bar in half and worked it like I've never seen a bar worked.  Within 10 minutes every Santa who wanted a drink had one.  Unbelieveable.  And the bartenders were smiling and super cute!  I can't wait to go back.\n\np.s.  Santa can do anything!  I never knew that before . . .", "author": "Jennifer R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-01-05", "description": "\"they just let ANYONE in here, don't they?\"\n\"jess, this isn't LA\"\n\num yeah. that was the exchange of the night, while i was at this bar. i was in town visiting my long lost friend/roomie from college Cat K. and she suggested we meet at this place. i didn't get lost getting there so i guess major points for having a name as obvious as this one. i like the idea of live music, but not when it's shitty. drinks were strong. so strong, in fact, i couldn't finish my drink. no cover (yay!) but i couldn't even imagine attempting to go to the bathroom here, so i didn't. \n\none thing i noticed about all the places i went to that night, including this place... there are hooks to hang your coat. random, but necessary. i don't live in a coat-weather climate, so things like that are a foreign concept.", "author": "Jess R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-07-22", "description": "This is for the douche bags at the door. Rude meat heads with inferiority complexes. I went to this bar only to wait for some friends that wound up there. I never go here because it always looks like a mess from the outside.\nSo when I arrive it was closing and they weren't letting anyone else in. We really just wanted to get our friends attention that we could see 10 feet from the door. One of the door guys closes the door (before 2am so the place is actually still open) in our faces as he leaves. I step aside so he can get by but insists on walking where I step which apparently sets this guy off. He starts on us like I'm trying to mess with him. Seriously? I'm half your size. I'm sober, and not trying to get into anything at 2am. My friend calls him rude and he gets all roid. We are totally civilized in calling him out on his behavior. He continues on with his \"stop talking that stupid shit, bro\" rant as we wait for our friends to come out. And at the same time the larger door guy starts shoving some guy who wanted to use the bathroom inside. He was telling him  not step to him and that's why he physically pushed him hack all the way to the corner. Really? He's 1/3 your width. Not called for. The skinny guy was not aggressive or rude. So physical force was ridiculous.  The roid dude finally disappears and our friends come out so we can finally leave.\nI'm not one to put anyone on blast on yelp, but that was so highschool and such an unprofessional display right in front of their storefront I needed to let the Yelp commnity know. \nI'm embarrassed for Grant & Green Saloon to have these two working their doors...", "author": "Sherman A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2005-04-07", "description": "\"Fairly pricey drinks are made up for by great live blues or jazz music in an intimate setting most nights with no cover, except occasionally weekends for big names. A lively, mostly upper 30s+ crowd. Not a good place if you want to be able to talk, though if a live session is in action because it's LOUD.\"", "author": "Marc S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2005-07-25", "description": "Bring your friends, listen to a band you've never head and probably never will hear again, and enjoy the strongest mixed drinks this side of columbus street.  If that ACDC cover band comes back, somebody please let me know.  Not very swank, but just clean enough that you feel sane leaving your jacket behind the bar.", "author": "Mike V."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-12-01", "description": "For its prime location at the heart of North Beach, the Grant & Green did not leave an indelible impression on me.  In fact, I only vaguely recall the decor on the interior.  I seem to recall talking to serious barflies and getting myself rather faded.  Still, with so little to recall, I probably won't go back.  When you have Amante, O'Reilly's, the Saloon, Northstar, and the Savoy within a couple of blocks, why even come in here?", "author": "David O."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-09-07", "description": "Great local pub showcasing great local talents.  It took us a few weeks before we were regularly admitted to all shows without having to pay a cover charge - sometimes, we'd feel special, but most of the time I couldn't help but think that the bouncer was too drunk to remember whether or not people had to pay to get in!   I'd like to think I was special.\n\nI was there often enough and after a while, I didn't even need a drink to head over to Grant & Green - Just give me my Blues, a little dancing space, and I'm good to go!  Seriously, pretty much a dive with your regular locals on the same barstool every night but other great people nonetheless, locals and tourists alike, every night of the week just wanting some soulful Blues.  It's fun just walkin back and forth between here and the Saloon...", "author": "Olma M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-02-13", "description": "I like dives, I really do, so based on the descriptions I thought I'd like Grant and Green...I was wrong. When I think dive I think dark, dingy, big booths/tables to hang out with friends, bad music on the jukebox, strong/cheap drinks, and maybe some regulars and/or old men sipping straight drinks at the bar. This place had two of those elements: dark and dingy. The music was VERY loud live jazz; we couldn't talk and we all had headaches by the end. There were just a bunch of uncomfortable tables so we all had sore asses too.\nGetting Corona in a can did remind me of being in Puerto Vallarta for my senior trip but I am not sure if that is a good thing...", "author": "Lilly O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-08-26", "description": "Saturday nite, where to go, where to go...\n\nNo Cover?\n......................................\n......................................\nLive Music \n......................................\n......................................\nStiff Drinks! ! ! ! ! ! ! ! ! !", "author": "Kristina A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-04-01", "description": "My new Yelp rule is never give a place that is cash only 5 stars. We live in the 21st century now and places still don't accept cards. I believe this is just greed and I am the kind of person who despises carrying cash on me. This place is not a bar with a bunch of chicks so don't come here expecting a Bar None crowd. Mostly dudes who like dudes and hipsters.", "author": "Darius A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-01-01", "description": "I've been here a couple of times, and I can't say that my experiences make me want to come back.  \n\nIt's a low key bar, with no cover.  Sound great, except you can barely get through the door.  I get it, bars get crowded, it happens.  But the way the entrance and the bar is set up, you can barely get through because it's so narrow!  If you're lucky enough to get to the bar and order and drink, then you better not move from there.\n\nIf you're looking to go to a hot, musty place, where you have to fight your way to get through, then this is your spot.", "author": "Maggie L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-16", "description": "Great bar with great live music. Will definitely return next time I'm in Telegraph Hill.", "author": "Kevin L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-11-07", "description": "A decent venue to see live music if you don't mind dropping 10 pounds in the course of the evening from the oppressive temperature inside the bar. Also, beer prices are pretty outrageous - think $5 for a bottle of Red Stripe or a pint of Fat Tire. No cover, though, and for a somewhat dive bar they have surprisingly good sound.", "author": "phil h."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-01-27", "description": "I could hardly catch my breath it was so hot in this bar (and on a REALLY cold night in SF).  It is super stuffy and with bands playing in there it is WAYYYY too small for the acoustics they have going on in there.  When I left my ears were ringing for days - that can't be good can it?!  \n\nIf you go with a group of people, don't expect to be able to talk to anyone other than the person sitting right next to you...even then you have to yell in their ear.  The bands are fantastic, but I like to hear them without flinching when they get closer to the mic. \n\nI asked for a dirty martini and while it wasn't very expensive, it was ITSY BITSY.  Imagine a tumbler, but half that size.  I was pretty disappointed.  They have pear cider here, which I love.  I wish more places had it available. \n\nOverall: 2 stars - Way too crowded, way too small, no air, and small drinks.  Oh, and CASH ONLY people!  If you come with a debit or credit card you're screwed.", "author": "Vanessa K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-01-16", "description": "There are a few things I dread more than going to North Beach on the weekends.  Something really awful happened in the few years I took a break from the bay area.  But we went to see a friend's band play here last weekend and I enjoyed a great drunken, asshole free night in North Beach at Grant & Green for many hours. It was great to have too fun sublimish bands for free. \n\nFunny enough, the north beach weekend was apparently still going on outside since a guy got knocked down in fight quicker than I'd ever seen in one of my cigarette breaks.", "author": "Mazi S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-01-30", "description": "Been there a few times. Usually a decent band is playing. the place is a little seedy but it does the job.\n\nMickey's Grenades for $2 aren't bad either.\n\nEnded up dancing with this Cougar for a while.  She offered to rock my world. I declined. Still have her number in my phone as \"Cougar\" though....", "author": "Adam L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-19", "description": "I live right around the corner and its a great place to come in for a beer and chill after a long week. they often have live music with no cover which is awesome. the bar tenders can be a bit rude which is why the lack of star but all in all a great place!", "author": "Sara g."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-03-12", "description": "Although there have already been several people who have commented about the cancellation of music at Grant & Green, I am compelled to comment as well.  I hauled ass all the way from the East Bay to come to a venue I would not normally frequent (sorry not into collar popping trying to relive their formidable college drinking binges) to see a friend's band play. I roll up a bit late, to find all my friends milling around the corner outside the bar. There is no tale tell sound of a live band spilling onto the street and every one seems a bit miffed. I am then immediately informed that the show has been canceled due to the pressing need to host a beer pong competition.\n\nIt is within every right for the manger of the bar to cancel a show where at least 20 people showed up specificity for in sake of his friends getting together to throw sweaty balls into glasses of lukewarm beer. Right....\n\nOverall, I am disappointed with the venue and the behavior of the staff there. I would not go there again or bother spending my hard earned money on a crappy Bud Lite. Instead go somewhere that values the ambiance of live music and good staff.", "author": "Girl on the Bike s."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-11-07", "description": "dare i say this was one of the best gigs we've played?  this place is awesome.  great booze, friendly staff, good tunes, good times.\n\nthe only thing that could make it better is if they had a sound guy.", "author": "gerald p."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-08-17", "description": "Grant & Green is a solid option in North Beach.  It's a good place to meet up with friends after eating at some of the great restaurants in the area.  I like the big screen TVs that tend to have sports on, and the live music is usually really good.  You can't see the bands from all parts of the bar (e.g. the front portion of the main bar), but in general there is good standing room and it is not overly crowded. \n\nThe bartenders have always been friendly and prompt, and tables are always good to congregate around.  They do have a tendency to have the music too loud so that it can be hard to talk to people.", "author": "Lemar H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-01-03", "description": "Went here after we went to North Beach Pizza and then had a drink at the Saloon. This is a decent bar, good drink selection and you don't have to pay a cover. I think they usually have live music every night. Good place to have a drink or two.\n\nThis is a cash only bar! My Vodka/Cranberry was $5 and bottles of beer are $6.", "author": "Jaclyn P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-05-27", "description": "Wouldn't go so far to call this place a \"dive bar,\" if for any other reason, there's not a real sense of \"local joint to grab some drinks with some regulars from the neighborhood.\" \n\nLike a lot of places in North Beach, there's always a constant stream of out-of-towners (or out-of-North-Beachers) coming and going, peeking through the window to size the place up, etc.\n\nIt's hard to say what this place is...but whatever it is, it's not good. The vibe is weird, the music is way too loud, and the street is filled with too many packs of dudes on the prowl for booty or a brawl. Bottom line: It's just hard to get behind the G&G.", "author": "Derek R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-10-19", "description": "Grant and Green is located on the corner of Grant and Green in North Beach.  There is no cover and the drinks are cheap.  Grant and Green regularly showcases live music, accommodating at least a five piece band on a small stage.  Patrons can dance and drink in an intimate setting.  If hunger strikes, head over to nearby Golden Boy Pizza for a quick slice of delicious pizza at an affordable price.", "author": "Camille K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-01-27", "description": "Grab a beer and watch some sports. The occasional live fusion jazz bands happen to be pretty good, too.", "author": "Y K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-06-18", "description": "For some reason my droogs wanted to watch the World cup game at the Steps of Rome. Afterwards they were going to crowd themselves into a phone booth. \nA friend called to watch the match here and once I got past the crowded front room I had enough space for old school break dancing but based on the bad officiating I did not take part in old school break dancing. \nThey set up an extra bar so even though the place was packed I was able to get a drink quickly.", "author": "Marcus R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-07-28", "description": "The place has a nice feel to it, but cheap drinks?  How drunk were you?  Five bucks for a beer is a bit pricey, but it IS North Beach so...eh.  \n\nNice music, decently mixed crowd, usually allright getting a drink, and the bathrooms are indeed fantabulous.", "author": "Brian H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-11-01", "description": "Grant and Green on the surface appears to be a great place. Friendly neighborhood bar with live music. However, if you looked up the word \"douchebag\" in the dictionary, you would see a picture of the bald bartender that works here. \n\nOvercharged my friend about $15 for 3 drinks he ordered. Pretty much belittled another friend I was with. Had no respect for the girls in our party...I could go on. Be sure and check your tab if you order from this joker. \n\nGets 2 stars for the music.", "author": "Brian W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-08-06", "description": "This is the bar that is closest to my house and as such, I have become one of the foremost experts on it.\nBeer on tap, but not in pitchers.\nMonday night Live Jazz, Tuesday nights are Karaoke night.\nEvery other night  there's pretty good live music with no cover, which I don't think you can say about any other NB bar.\nThe crowd, in my experience, depends on the band that's playing.\nThe people who work here rule!", "author": "Joseph H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-02-28", "description": "i like this place... it wasn't overly crowded, played good music, i think they had a live band but they were finished by the time we got there... but it seems like a good venue for some intimate live shows. The bartenders were nice. But the bathroom situation is a little weird. two bathrooms position in the middle of the bar for unisex use... can get a little dirty and a little awkward and a little intense. but other than that the experience was A OK!", "author": "Shadi N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-08-08", "description": "We dropped in here the other night just in time to grab some barstools and found an excellent 90's cover band; the place filled up and quickly got pretty crowded.   I'd prefer paying less than $3 for a PBR can, but I guess it could be worse and they'll only set you back $1 during happy hour.", "author": "dan d."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-14", "description": "Live music, fun atmosphere, and next door to Maggies. :) The drinks are ALWAYS strong, and the bartenders are efficient and entertaining. It is cash only, & they do have a ATM as well.", "author": "Tiffany L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-06-25", "description": "Great atmosphere and awesome live reggae band. Gonna have to be my newest staple in San Fran. Silly place to meet people, friends, and arch-nemeses.", "author": "Michael B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-05-27", "description": "This is painful. Grant and Green was an awesome place to see a friend's band on a recent night. The bouncer was nice and proactive about keeping the already-drunk-and-rowdies out. The drinks were ok and not too overpriced. One of the bartenders, however, needs a lesson from Miss Manners and so here I am to administer:\n\nDear Bartender with the tattoos,\nThank you for being a complete bitch to my best friend, one of the nicest, smartest, most intelligent and respectful men I have known ever in my entire life. Not only  was he a shining star in a sea of douchebags last Friday night at your bar, but he was also the only patron I saw you berate, yell at, and more or less ask to leave. And why? Why did you do that, evil wench? Because he has a real JOB (he's a doctor) that requires him to carry a work bag and he had just gotten off a flight from LA and came straight to the bar to see our friend's band play. With all the handsiness and douchebaggery going on in your bar on Friday, I find it appalling that you chose to single out my friend for having a LAPTOP bag with him. You claimed it \"wasn't working\" to have it in the bar because it was \"in your way\" and that's not all you said.  And nothing you said was said in a remotely polite manner. Well, thanks to you, we all left. About 20 of us. 20 nice people who also happen to be good tippers and who were simply there to support our friend's band. Nice job. I hope you don't treat everyone with an education and a strong work ethic like this. Oh, maybe you do. That would explain the majority of your patrons I observed on Friday night.", "author": "Autumn K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-03-03", "description": "I once saw a broken beer bottle fight here, involving a woman in a halter top made of feathers. And it was the '90s. This is the first place people go when they are released from San Quentin.", "author": "Roxmarie M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2006-09-12", "description": "just so-so and lemme discuss: skanks galore. skanks who don't know how to dress, skanks who don't know how to flirt. my prelude to dinner at Soldini's turned into a nightmare. 2 cocktails for the man and me, developing a nice buzz, enjoying the crowd (mostly frat types), until the plain loud janes clad in non-designer jeans, sporting skeezy long greasy hair, wearing the ubiquitous nasty flip-flops w/unpedicured smelly feet arrived in full force. go ahead fugly bitch, squeeze your fat ass into the bar stool next to me. you touch my Vuitton bag again, you'll be missing your dykey unmanicured man-hands.\n\nthese femi-nazis who are aching for boy attention surely know how to bring aversion upon themselves. downing their pints (what else do she-boys drink ?), getting louder by the second, adding dimensions to the word obnoxious. these female things are the new boys of the millennium, and every time I've been in this bar, they have polluted the place. the frat boys left in disgust after 20 mins, as did we.\n\nnext trip to Soldini's: I will patronize the in-house bar, which really has stronger pours than G & G. but G & G is a pretty cool saloon . . . they just need a sign outside that states \"NO SKANKS ALLOWED\"", "author": "Prima D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-11-30", "description": "Say what you will about North Beach - I get it, and for the most part, I'm right there with you - but Grant & Green is a great bar. It all starts with who mans the drinks, and I don't think G & G knows how to hire bad staff. Everyone who works here is friendly, and so far, I've yet to receive a bad pour. It's also a great place to catch random live bands and comedy, and even play a little beer pong. If you're looking for a bar in the area where you can come as you are, have a beer, and maybe even hear some live music, this is the spot.", "author": "Kat E."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-04-23", "description": "$4 for a pabst? and you fired my favorite bartender? and you whine to yelp when people have the gall to say they don't like your whack-ass bar? are you fucking kidding?\n\nno, you are NOT kidding. really pricey drinks in a divey setting, some legitimately awful live music (but some good, it is true), few redeeming qualities and way too many better options -- on the same block -- to justify any of it.\n\nfuck this place; i'm going to maggie's.", "author": "Chris R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-07-03", "description": "Just, no.  I used to go here all the time when Robbie & crew owned it, and the current owners are not an improvement.  North Beach does not need freakin' beer pong - we are not the Marina.  \n\nEven worse - when I alerted the owner to the fact that a very drunk girl had been followed into the bathroom by a strange man, he first said, \"That's not my problem, it's [the bar manager's].\"  When I reminded him that as the owner, he's responsible for what goes on in the bar, he said, \"Well, she'll get what she deserves.\"  Combine that with the known dosing that goes on, and this is not a good bar for women to go to.  \n\nPlus, they crank the sound system up to an insanely loud level, even on weekdays  when the neighborhood is quiet.  (Yes, North Beach can be quiet.)  This is not a good bar anymore, and this is not a safe bar.  It's too bad, because they do have some awesome bartenders.  But still, no.", "author": "juliana e."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2005-09-02", "description": "Pabst in cans? Automatic 4 stars. Add a little snake juice, Giant's baseball, some Marshall Law, you have a recipe for the perfect local bar. It can get loud once the live music starts, so if you're looking to chill...this is probably not your best bet. Don't let the Snake Juice (ask for it by name) go to your head, mix it up with the local toughguys, and see what happens. Personally I love this place, I feel really comforatble with the diverse crowd...My girl feels comfortable with the crowd as well (she takes shots of snake juice, what a hottie!). Usually a great getaway from the usual bar scenes around town. Good down-to-earth fun. Tell Manny that I sent you.", "author": "Ben R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-06-22", "description": "havin' lived in northbeach many moons ago....up above the kearny steps..coit tower hill....grant 'n' green just a stroll down hill to the bottom....a frequent stop during the ol' grant street pub-crawl.....crowds haven't changed much.....out of towners stickin' to the main broadway 'n' columbus roads....grant 'n' green still safe bet for locals.....beers, booze and mingle....seekin' a mellow evening...early is best....towards the peak hours....crowds, loudness and bands pursue....", "author": "Hen A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-06-07", "description": "I hold the 2nd and 4th highest scores on porno-photo hunt. This bar rocks!", "author": "Justy L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-04-28", "description": "I've been here a few times, but thought the bartender working last fri was a dbag.  Other than that, music and crowd were ok.", "author": "Mike M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-10-07", "description": "Had a blast here friday night watching an upbeat cover band get their funk on with some irresistable Kelly Clarkson covers.  Can't say anything about the bartending, because I was already nice & snookered by the time I showed up, but I met some nice B&T boys who dragged us across the street for free Fernet shots.  Hurray!", "author": "Ann M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-06-02", "description": "I've only been here once.  Made a friend with some drunk guy who imports Belgian cookies or something.  I bet cute boys come here a lot.  I like cute boys.", "author": "Coco D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-03-25", "description": "I go here once in a while because it's near work and sometimes friends play shows there. That's really all I have to say about the place. Normal kinda dirty bar with kinda okay people hanging around.", "author": "Constance C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-03-24", "description": "a very lackluster bar. it has no character, whatsoever: it's not big. it's not small. it's not light. it's not dark. nothing special as far as decor goes. it's basically just... there. \n\nit's name well reflects it's lack of ingenuity.\n\ni had some cheap beer for a happy hour special, but that's about it. \n\nboring.", "author": "Kayla K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-01-09", "description": "I lived just a block away from this place a few months ago, and we would stop here frequently before cruzin around the rest of north beach. They always have some type of live music and on a friday or saturday the place is usually pretty crowded. It's pretty small and hardly anywhere to sit. Every time I have been here it's taken a while to even get a drink. The crowd is a little mixed depending on the music which is good, but I don't think I would spend my whole night here, it's a convient place to stop for a drink but that's about it.", "author": "Danielle K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-07-30", "description": "The bar was crowded but the people were a fun bunch. People who were there just wanting to watch live music for free on Thursday nights and have a cheap drink. Lots of places around this North Beach area to walk around and check out. I went here to watch a Weezer cover band. The sound of the PA is pretty good so I liked it. Kinda stank like an armpit though. But what else can you expect from a saloon?", "author": "Chino B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-09-08", "description": "My friend loves this place for some reason so I've been here a few times. Not my favorite place. They do have live music which is kinda cool. That's about it...", "author": "Nicole F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-11-24", "description": "Free live music? I'm there! This is another one of those cash-only bars, but the drinks are reasonably priced. The crowd is always decent and it's my go-to place for music on the weekends. Hasn't failed me yet.", "author": "Kim L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-03-03", "description": "I came here with two other people on a Friday night two weeks ago. I was appalled at the service we got from the blonde bartender.  After ordering our second round of drinks (that was the same as the first) she came up with two opened beers of the wrong kind.  I politely informed her we were not drinking that kind and she looked at me and gave me attitude replying \" well sorry, I already opened them.\"  I was stunned. I could not believe any bartender would behave in such a manor!  Then when I simply said we had ordered someting different and I am sorry she came at me telling me how b\"tchy I was.  We walked out right then and there.  I will not be going back there.  Poor management to let someone so rude talk to costumers like that.", "author": "Maria D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-09-05", "description": "if you like to get constantly hit on by all types of men that do not equal attractive, come here. i love it when a man tries to hit on you and you turn them down and then they get pissed at you. turns me on.\n\n\"oh, wait...is that your boyfriend over there?\"\n\"yeah.\"\n\"FIGURES!\" hits the table and goes into the one person bathroom with his wingman.", "author": "NF T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-04-08", "description": "This bar definitely needs more than a single door guy.  Two entrances and too many violent drunk knuckleheads  in bathroom lines.", "author": "Oleg S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-07-11", "description": "This bar is awful, and I'll tell you why.\n\nIts a boring bar to begin with, I yawn everytime I'm there, waiting for my friends to finish their drinks so we can hit the next  bar.\n\nBut what really put this bar on my shit list is one Saturday night when me and a couple of friends stopped in for a quick drink before last call.  I bought a round and gave the tall bartender with a hat on my check card and told him to close it out.  Within 2 min he manages to GIVE MY CHECK CARD TO ANOTHER CUSTOMER!!  When I asked him for it he said \"i gave it to you,\" and blamed me for not having it.  \n\nThe manager was not much better.  He said \"check your pockets.\"  These idiots didnt do anything to solve the problem except blame everyone else but themselves.  I had to cancel my card and have my bank credit  my money back for drinks I didnt buy.\n\nBottom Line.....This bar sucks and so do their employees.  So many better bars to hang out at in North Beach than Grant & Green.", "author": "Richard C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-22", "description": "I like this place.  It is sort of a dive bar and has free live music and no cover charge.  Drinks are reasonably priced.", "author": "Danielle B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-11-16", "description": "If you're a fan of live music coming from obscure local bands, this is your place. It is very loud here where conversation does not come easy. Drinks were expensive for a dump like this, but it is SF and a somewhat pricey area. Barback kept climbing over patrons to get behind the bar which I thought was odd. Went next door to Maggie McGarry's which could not be any different.", "author": "Michael H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2006-05-04", "description": "This place sucks.  I thought it was the bouncers who were being non-sensical jerks by turning away cover-PAYING guests because the place was \"to full\" even though the entire second room (where my friend's band was playing) was empty.  But actually, they were just acting on the instructions of the owner, who called the cops when I asked him why he was denying entry.  Ok, maybe he called the cops because I called him a cocksucker, but still, denying entry, thereby reducing the bar and the band's take of the door, is just plain lame.  I wish I could give it zero stars.", "author": "Aaron F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-01-25", "description": "Good neighborhood bar - music is hit and miss.  I've seen some great bands and some not so great bands.  Drinks are cheap, service is quick and friendly.", "author": "M J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-10-10", "description": "Pretty chill dive bar, but if you want a cooler crowd and a cleaner feeling spot, I recommend Columbus Cafe.  They do have live music or comedians every now and then which is pretty cool.  Check it out, it's worth spending some time in if you live in SF!", "author": "Nelson W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-11-09", "description": "Hole in the wall saloon style place with way too much ghetto music. I mean this is North Beach, not East Oakland. Ohh and mouthy loud blonde wench behind the bar....\"STFU!\" Being a bartender is about your customers not about you.", "author": "J.B. A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-09-17", "description": "hmmmmm\ndefinitely have to say that there's a hottie behind the bar \nlove the live bands and the atmosphere here \nbut could be a little bit bigger \nbut i love that its a dive bar in north beach \nyou don't have to dress up \nyou can just order a beer and chill listen to live music and meet great people", "author": "sarah c."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-10-19", "description": "Good place to listen to music and drink and maybe dance if the music is good - was fun the night we went.", "author": "Jen D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-11-17", "description": "In all honesty, one really can't go wrong with any of the bars on the stretch that is Grant ave.  However, Grant and Green is a head above the rest as a result of the quality of its music venue.  If the citizens of the US were willing to spend two terms on GWB, I think the people of SF owe it to themselves to spend one night with North Beach's own Green president.", "author": "Justins L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-05-07", "description": "Live music, beer, and cool peeps. Could you really ask for more?  Well, yes... but... that's not the point.  Cool joint!", "author": "Giorgina G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-07-22", "description": "I've been to this bar many times since it is just a couple blocks away from my apartment but the show I saw a couple weekends ago confirmed my feelings on this bar.  I saw one of my friends play in General Jones (great, great bad!) and it was an amazing show.  This location is great because they show fantastic music acts for FREE!   It is a great space - plenty of room to get nice and sweaty on the dance floor!  So, despite the door guy who smacks my ass as I enter the bar I will be a return customer again and again!", "author": "Kate J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-05-26", "description": "Many years ago someone set me up w. a BLIND date; he was sooo ugly I suggested that we go to Grant & Green for some dancing and I was a little happier getting a few drinks, dancing in the dark and barely seeing that pudgy mug he had. Bad lighting works for BLIND date scares.", "author": "miriam b."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-06-12", "description": "Fun. Fantastic staff. Bands are great.  Drinks are cheap for Nth Beach.  I will be back.  Whenever I bring friends in here, they have a great time.  Mixed crowd.  It can get busy though, so be prepared to fight for your space. Great happy hours every week night.", "author": "D B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-06-05", "description": "Lovin it.  Pretty much every time I've ever been here is playing with my band LowFat (we play tomorrow night June 6 btw).  It's a little small, but the size tends to keep everyone moving and having a good time.  One thing though, it can get super loud!  But it's all in good fun.  Drinks are fairly priced and there are even tables with tall chairs so you can sit and drink while talking to someone standing next to you at eye level.  Worthwhile stop when bar hopping.", "author": "Garrett G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-06-24", "description": "Goddamn.  And I mean GODDAMN.  Where are you finding these bands these days???  Not only are they talented, they are damn good looking!  Thank you for the dance floor!", "author": "Squid V."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-09-10", "description": "To the people who are assuming half of your drink money goes to the \"shitty cover band\" I'm here to tell you, as a member of a shitty cover band that played this place, we don't get squat.\n\nMe and 8 other musicians played for nearly 5 hours, brought over twenty of our own friends into the place, got people dancing on the floor and the bartender gave us 100 to split 8 ways.  Plus we got ONE free drink each.  Don't hate the bands.  All in all a nice enough place.  Drinks are a little expensive for a weeknight.  The bartender was nice and attentive.\n\nAs a side note, you may want to bring brass knuckles or a switchblade to this place, my friend's face is broken because 7 muggers hit him out in the street in front of the building.", "author": "James B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2005-08-30", "description": "Probably have been here a dozen times, but honestly i never remember much of it.  That said, this is a sweet place to end up the night at the bars, especially if you are tired of savoy down the street.  The bartenders aparently can put with a lot from the drunken idiots that come in there around closing time (myself definately included!), so they have that going for them.. and as far as i can tell the drinks are good....  also, huge bonus points for the close proximity to North Beach Pizza...", "author": "Robert R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-02-28", "description": "I headed on down to Grant & Green to catch a sweet show by a Tom Petty cover band called \"Heavy Petty\".  Though it's small, there was still plenty of room for our sizeable group to kick back at a table, enjoy the [rockin'] band, and watch folks shake what their mamas gave them.  The bar line was short and the bathrooms were even decent.  Come on ladies...you know that's a big deal.  The \"Git er' Done\" special of the night was $2 Olympia beer in the can.  Can't beat that; plus it makes you feel like an Olympian.   Best part: I can walk there and stumble back.", "author": "Beth G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-05-12", "description": "One of the long-time live music venues in North Beach, G&G is a tiny little venue where you're never more than about 20 feet from the stage, but it's a great place to see a band up close and enjoy a beer.  And when you get hungry after all that drinking, golden boy is just around the corner!", "author": "Don H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-07-24", "description": "Great place. Check out this portfolio of the venue:\nhttp://www.shastic.com/portfolios/venue/grant_and_green", "author": "Axel G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-11-14", "description": "This bar gets loud and crowded quickly. The drinks are priced well, and there are pool tables in the second room so it's worth the trip.  Fun place to drink, and I've heard it's a good place to come watch a baseball game.", "author": "Catherine K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-08-06", "description": "On a karaoke Tuesday about a year ago I made the biggest decision of my life at this place. I don't know if it was the strong drinks, the fact that I sang a Partridge Family song, or the film student I was with...but that night made my life what it is today. For better or for worse, five stars just for that.", "author": "Penelope C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-05-27", "description": "Go here and order a Gargoyle,\nand start trippin on how freakin drunk it will have you in a matter of seconds.", "author": "Sleep E."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-01-28", "description": "They didn't kick us out when we arrived at 9:30 pm blacked out from an all day pub crawl.\n\nThat get's an \"A-OK\" in my book anyday.", "author": "Catherine M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-01-20", "description": "A little gem in North Beach.... and really dark.  A true neighborhood bar.", "author": "Annabel G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-04-14", "description": "I was lucky enough to have a good bartender who made a good drink. The live music hadn't started yet, which was good, since I was in the mood to talk and not yell. I usually walk right by this place since its always crowded and loud, but it was a good spot to have a quick drink during the week.", "author": "Nicolas H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2006-07-11", "description": "Corona in a CAN?  WTF mate?  Beer selection is mediocre, and priced high for the selection.  It smells like vomit in there ALL THE TIME!  Bartenders are a bit brusque.  And the bouncers tolerate NOTHING!  No shinanogans?  WTF MATE?", "author": "Max M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-12-11", "description": "Went there once while some jazzy/salsa type band was playing. Dont remember a whole lot of it except for the fact the band let me and my friend play on the drums and keyboard for a while during their break and then serenaded my friend!! It wasnt too crowded and easy to get a drink. Best part, it was right around the corner from Golden Boy Pizza!!", "author": "Erin F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-03-20", "description": "I like this small space to listen to live music on an off night.  Not good when it gets super crowded on weekends or during North Beach drinkfest events.", "author": "Jessica H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-01-13", "description": "Grant and Green is a good bar. It was not hard to get a drink or few and the crowd was very diverse. I didn't get a chance to see who the live band was that night but there was a good sized crowd for them (I left before they started). The highlight of my night was a guy from Boston that came up to me and my friend telling me how great Boston sports teams are. Being a S.F. native I countered his argument with the late 80's bay area sports teams. Niners back to back superbowls, A's 3 world series appearances in a row, Bay Bridge series and the Warriors Run TMC wasn't all that bad either. After I divulged that information on him he said you're good and then went back to his friends. Shortly after we left and continued our rampage through north beach.", "author": "D J."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-03-23", "description": "This place has horrible management.  I walked by the place the other day, and heard a band sound checking.  They sounded great, so me and my friends decided to stick around til they started.  Well, an hour passed, and then another hour.  Decided to ask them what was up, and they said that the bar manager doesn't want live music during beer pong, cause it might scare the beer pongers out.  \n\nI remember playing beer pong in college, with a live band, and didn't think the two clashed.  I would have much rather heard some live music than listened to some frat boy's iPod playlist.  Well, eventually the band announced that they were cancelled, and the crowd left in herds.  So my friends and I decided that the band was being treated very badly, and that we could not support a bart that thought beer pong and live music weren't a cool mix.\n\nWe ventured down to 15 Romolo, where the drinks were original, the bartenders were voted best in San Francisco, and the manager was super friendly and even sent us out a free app after we had told him about the management out at Grant and Green.  \n\nSo if you are in the North Beach neighborhood, I highly recommend 15 Romollo as the place that you become an avid patron of because of its cool atmosphere, highly inventive cocktail menu, and great people.", "author": "Michael C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-12-17", "description": "I love this bar!  They have live bands every night or at least it seems like they do every night.  I've seen some great bands and there's always a good group of people there.  The bartenders are nice and last weekend when my friend was cold the bartender offered his jacket!  I recommend this bar to anyone headed to North Beach plus there are a million bars right next door.", "author": "Heather S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-11-10", "description": "When I first moved to the city, I asked the cab driver to take me someplace fun and mellow. He first dropped me off at Columbus Cafe...excellent, well done driver then after a drink or two I mosed up to this place. There was a chick on stage that looked just like Yoko Ono (Sp?) The crowd was really mellow and just enjoying the music. It was a Tuesday night (I was still unemployed) I was WASTED! Before I knew it, I had myself, my friend, and three random guys back at my house drinking beers and having a dance party till the wee hours... Needless to say, this bar pours a stiff drink, draws a fun crowd and makes me do stupid shit...I like it.", "author": "Lisa K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-11-24", "description": "It was a slow night last night because it was Thanksgiving, but the owner was hanging out there (or atleast he said he was the owner, i was a couple drinks down, he may have just been trying to impress me).  this is the type of place I call a bar's-type bar. yeah.", "author": "Lindsay T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-09-03", "description": "Sorry , I liked it better when it was a dive with an eighth inch of water on the very small bathroom floor. The Grunt and Groan was \"the\" dive in NB. Now it's what? Loss of soul.", "author": "Mag N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-09-20", "description": "Cute little bar on Grant, almost like any other. There was a live band (Maybell or Maybelle) playing jazzy-esh music that night. The crowd was cool, not super young and not super old. Just HOT HOT HOT in there, they could bust a window or something open, overall good decent kind of place, if you're looking to just sip a couple of beers and chill to some loud local-ish music.", "author": "Irene L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-04-19", "description": "best dive bar ever.  Real peeps posers easily WEEDED out! For pro's only! After 11 Fernet shots 4-8 happy hour!!", "author": "francisco M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-07-15", "description": "It can be AWESOME or just SOOO lame...I have had some insane nights at G & G.  Take a chance.on a Fri night and grab a beer at G & G. They sometimes have some really fun bands...", "author": "Laura J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-13", "description": "I met a couple people early in the evening around 8:30 on a Saturday night.  Like any other bar at that hour, things were quiet.  The scene at Grant & Green started to pick up once the bands began playing.  The two bands, Just Off Turner and 5 A.M., were surprisingly good rock bands--props to whoever booked them.  The crowd was young, hip-looking, and fun.  At the bar, the bartenders were friendly and quick.  In addition, the draft beer selection was standard bar fare and moderately  priced at $5 per pint (at least for Stella Artois).  Overall, great place to begin a night out in the North Beach area.", "author": "Andrew F."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-09-30", "description": "The drinks are ~eeena~. Some good music at times, hit and miss. Great location, but never seen it too busy except on the weekends. And on the weekends North Beach isn't what it used to be. Who told the frat-boy trust fund babies to come douche-it-up here? There's some decent pubs, but Grant n Green... hmm I'll say props for providing a venue for musicians, and for free, there's your two stars!", "author": "Boom Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-10-06", "description": "this place is cool man.  We played here early this year and had a full house of crazy SF residents.  drinks are faily inexpensive and bartenders nice.  no parking though.", "author": "Chi-Chong s."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2005-08-29", "description": "Not to bad.  I somehow always meet people when i go here.  I like to start off here and move on because the place can get a little packed and a little warm.  Cool atmosphere, good beers on tap, and almost always a good jam band playing.  My only problem is the bouncers always give me crap about my I.D. cause its from forever ago and out of state.  I guess its reason enough to get a new one.", "author": "Jonathan F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-10-09", "description": "A simple bar with live music several nights a week, what more do you need?  Check to see whose playing...", "author": "Sam B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-04-25", "description": "small neighborhood joint. there's a stage that caters to live bands. i actually came here to watch some friends perform. jahlectrik...check them out! decent amount of people there on a tuesday night. not really a bar thats in my hood but definitely a chill spot to kick it if you're in the area.", "author": "Linda N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-11-13", "description": "OMG! Love this place! I bartend in the north beach area as well and know good bartenders/bars when I see em! The bar manager Zack, Blaze, Zoe and Scott are awesome! they are super fun, attentive and just all together rad! I love this bar and I highly recommend it! Live bands and Kareoke all week long. Looking for a good time? you'll find it here!", "author": "Kelley A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2005-05-14", "description": "right next to the lost and found, this place is usually busy on the weekends. a very low-key and 'rougher' crowd than i usually am used to, but it can be a fun place to get a beer and watch a ballgame.", "author": "Michelle I."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-06-17", "description": "This place smells bad and seems to attract a crowd of people of the likes of San Quentin Graduates.  If you still want to check it out, just be aware that the bartenders are RUDE.  There are a couple of bold guys (barkeepers cause they can't mix drinks) with a nasty attitude.", "author": "Monica R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-04-26", "description": "I mostly go to Grant and Green right after work when its slow and the crazy neighborhood beggers, drunks, and/or methheads provide entertainment outside.  Good local hangout and the prices are about the same as anywhere around here.  Live music everynight is a big plus..... And.... Want to kill some brain cells with friends on a weekend afternoon?  Go to Grant and Green and enjoy their \"Regulation Beer Pong\" tables.  I hadn't played beer pong since I was 18! What a blast!!!", "author": "Adam L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-07-23", "description": "What a freaking hole. I'm not sure what is worse the coked out owner trying to nail the drunkest girl he can find or the puke smell as soon as you walk in. The service sucks, the drinks sucks, the staff is rude (not the girls). Don't waste your time.", "author": "Patrick C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-06-20", "description": "this place is, for lack of a better word, cool...  the bartenders are there to have a good time and it rubs out on the crowd.  live bands cram in there but it matters not!  the place is just all about being cool and having a good time.  car bombs flow like water and i welcome that whole heartedly.", "author": "Swarup B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-04-27", "description": "considering the location, this bar is a winner in my book. free live music, comedy and cheap drinks. and they have $3 absinthe shots during happy hour - which runs pretty late btw. don't take a date here, unless you have a GREAT date.", "author": "Zhenya S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2005-11-11", "description": "i came here on a wednesday night and it was pretty dead.  the loud hiphop seemed incongruous in relation to the dark pub feel, and all the cheap beers are served in cans (i hate cans).", "author": "Roshni R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-12-02", "description": "Grant and Green is great.  Extremely fun place, great live music (if you can, see the Sublime cover band.. they are awesome!), and good priced drinks.  I have had a great time every time I've come here.  The crowd obviously varies night to night, but I feel like the crowd is a step-up from your typical Marina/North Beach crowd.  Obviously not anything amazing or earth shattering, but it's always a great time.", "author": "Wayne S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-04-19", "description": "Post college crowd the night I went.  Perfectly fine band, tall, handsome all-American boys standing around holding beers.  I'm nearing 50 and went with a younger work colleage.  I liked the band and did not feel uncomfortable here - except the bathroom scene seemed a little odd.  It was a unisex bathroom with a door that did not seem to lock, so take someone with you to guard the door.", "author": "Andrea P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-10-02", "description": "definite dive bar, don't usually visit this bar however we heard that there was a great cover band there that evening so of course we had to go and see.... wow the band was great and this was a really great venue to see a live band, very roomy and they have TVs that monitor the stage...so you're up front even when you're not. The drinks were on the pricey side and the bartenders seemed to have hearing problems....a rum and coke because a vodka diet, umm...shouldn't you be used to the noise level already? also the floors feel like they have been drowned in sugar you literally stick to the floor not good when you  are in heals...overall though a great experience", "author": "Joy Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-11-09", "description": "Went to see a little band here last weekend with some friends.  The band was cool, but good lord it was hot in there!  Felt like 110 degrees.   The drinks, service and locations were all \"ok\".", "author": "James B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-01-10", "description": "This place ROCKS! it's exactly what i look for in my saturday night exploits.. live music, cheap and strong drinks, and some pretty chill people. there are plenty of other places to go if i wanted another typical yuppie bar. when i come here, i get old school north beach. crazed poets who've partaken one too many times, aging musicians who long for the good old days of cheap rent and easy women, and a bartender who actually knows a thing or two about good music (alternating between matisyahu and barrington levy).", "author": "shyla r."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-12", "description": "they have good live music from different artist the bartenders are cool, bouncers are wanna be's but its a fun place that is always guarentee  a good time", "author": "Nicolette E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-11-25", "description": "fuck yeah! great bands, great staff, and decent priced drinks for being up there in n. beach. throw in some scary bikers that hang out on weekends and a couple acts of extreme violence right outside the door, god damn i love that fuckin place.", "author": "Ausewaldoe J."}
