{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-22", "description": "I have only tried their Chana(Choley) Bathura was i can say the BEST CHANA BATHURA IN THE BAY AREA.", "author": "Abhishek P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-30", "description": "I have to say, the food was quite good. We had for takeout the tandoori chicken (very tender!), saag paneer, and a lamb dish. All were very good! I recommend giving this place a try.", "author": "Mikey J."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-09-03", "description": "Great location, surrounded by a ton of other cafes and restaurants. People are friendly here, reliable service, good unlimited chai with the lunch buffet. Got here with a friend around 1:30pm for lunch on a Sunday afternoon and I was sorely disappointed. There was still plenty of food, and maybe it was late in the afternoon so things had evaporated... but the food was very overcooked and way too salty.", "author": "Ellen C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-02-27", "description": "Good for what it is, a really cheap Indian buffet. \n\n2.5-3 stars for food quality (vegetarian dishes were better). Undersalted. Dry. Bigger. Just gross. \nMinus 1 for hair and subpar service. \n\nI think all bathrooms should be mandated to have paper towels-- disease control all lie with hand hygiene after all.\n\nIf you're looking for quality, clean Indian buffet with good ambience, for cheap ($13) check out India clay oven. It's impressive", "author": "J P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-09-12", "description": "Food was ridiculously spicy. Being of Indian background myself, I'm used to spicy food, but this was inedible. When I tried calling the restaurant to let them know, they didn't seem to care and told me they would call me back. Poor quality and will not be ordering again.", "author": "Jane D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-08-25", "description": "Called ahead of time to enquire about space for a group of 4 and was shown the door as they received last minute reservation for a larger group. Had driven 45 mins to be here and had even paid for parking. Will never come here again. Highly unprofessional!", "author": "Sonal B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-17", "description": "I fuck with this place hard. Always have and always will. Yelp insists I keep writing until it's log enough so here I am writing over and over again. I think it's long enough now. Thank you for reading", "author": "Tom M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-26", "description": "We treated ourselves to a dinner delivery on Christmas Eve and literally I could write the exact same review. \n\nWe actually had the same food! I was absolutely delicious and we still have leftovers. Everything was perfection.\n\nI highly recommend this restaurant. It's been our stay at home special occasion place for many years and never fails.", "author": "Sharon J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-01", "description": "I live a few blocks from this place and it is awesome. I'm a vegetarian and I always order the Chana Masala, Saag Paneer, and Dal Makhani and they are delicious. Indian food is one of my favorite kind of foods, I've been to so many restaurants and this place really does it well.", "author": "Lauren M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-04-24", "description": "I went to Great India with some co-workers to try their lunch buffet.  And to be clear this review is only in regards to their Lunch Buffet.  \n\nFor $10, it's a great deal.  So much food!  Great if you're vegetarian too because they had a lot of vegetarian selections.  Unfortunately, since it was a meatless Lent Friday for me, I didn't get to try a lot of their chicken dishes like their chicken tikka masala and chicken tandoori.\n\nDespite not being able to try their meat selections, I thought their veggie options were still very filling and flavorful.  I had a lot of their chana masala, saag paneer, and mushroom stew.\n\nOverall, the buffet was okay.  I probably would've had more satisfaction had I tried their meat selections, but I'm glad they had enough veggie options for me to get by on meatless Lent Friday.  I wouldn't mind coming back again and with no restrictions next time.", "author": "Rodney H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-26", "description": "I was actually impressed with this buffet! Good food at a good price. The salad was a bit old and wilted (and brown :( ), but the naan, the chai tea, the curry selection exceeded my low expectations. I think it's definitely a decent place to grab a quick lunch, and will be adding it to my lunch rotation. Kind service and staff as well. \n\nDon't come expecting stellar Indian food. But come if you're in the mood for some homey and comforting curry and warm naan. Eating there reminds me of simpler times, which I don't I really understand since I'm a Taiwanese American female who grew up in the south. But I'm okay with these false memories as long as it means I'm enjoying food that makes me happy. :)", "author": "Sophia L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-04-29", "description": "It's the last choice to make for Indian place. There was a huge lack in taste of the dishes. Something was missing. \nThere are only limited items as they read crowd that comes in...", "author": "Victor D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-08-07", "description": "15 minutes after I order they call me back and tell me they are too busy and I live too far away even though i'm in their delivery area.  Must be nice to be that busy that you can just decide not to serve someone after taking their order (and money)", "author": "P K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-09", "description": "Food is not too bad, made us feel like home. We ordered tikka masala chicken and fish curry. Just that the portion of the meal was not big enough for us that we had to ask for rice refill. We ordered spicy tikka but it came out medium spicy instead. So these made the cut on rating", "author": "Stacey W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-22", "description": "Tasty chicken tikka masala, garlic naan, and masala tea. Note to self: order medium spice next time instead of mild. \n\nFast delivery, hot and delicious food, decent prices. Definitely a must try.", "author": "Nina X."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-25", "description": "Been here several times and always liked their food. Dum Aloo and Saag paneer is a must try. Didn't like their buffet since they have very limited options compared to other. Parking tip: park on 25th avenue which has free street parking.", "author": "Maulik S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-07-03", "description": "My friend and I ordered the Tandoori mixed grill and the steamed rice through Uber Eats. Let me tell you honestly it was the worst Indian food I've ever had, in this city or otherwise. The rice shown in the picture looks freshly steamed, with bits of herbs and green onions. The rice that arrives tastes dry like it was cooked the night before and microwaved before packaged, and has nothing in it to flavor, it's literally just rice. The meat in the mixed grill was so dry we couldn't eat it-- the shrimp tasted strongly of ammonia so we spit it out. Everything got tossed. I'm not sure if it was a bad night for them, but I can't imagine how they are still in business from the order that we had. $22 ended up in our trash last night.", "author": "Virginia J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-13", "description": "I've ordered delivery a few times from this place. You can't beat the quality of the food and delivery for the price!", "author": "Leonora H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-02", "description": "Loved the buffet, such authentic tasting Indian food. It had dal, rajma, chai, cabbage, aloo and more. So many options for vegetarians is amazing!", "author": "Aashali S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-13", "description": "Ordered from Uber eats and the chicken tikka and naan were pretty good.", "author": "Ken B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-06-19", "description": "Over an hour for delivery of rancid swill. With so many Indian restaurants to chose from, make a different choice.", "author": "Christopher C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-06-17", "description": "Food sucks. Restaurant smells, bad service. What else is there to say? I definitely had better.", "author": "Danny W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-22", "description": "This place is great. We've been ordering take out here for a while and it's always fast fresh and fast. My favorites are daal and saag paneer. Very flavorful and tastes homemade. \n\nUpdate 4/22: my boyfriend and I order Indian food all over town (he's Indian), and of all places this is becoming my favorite Indian restaurant in the city. They have the BEST Daal Tadka I've ever had. Sooo much flavor. A vegetarian's dream. I don't know which dish is better that, or the Vegetable Coconut Curry. Both amazing. Their Malai Kofta is really good too. Thanks for making great food.", "author": "Tatyana V."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-08-02", "description": "I have eaten from here several times and I think that the food tastes great.\n\nHowever, I just have had the worst delivery/customer experience of my entire life.\n\nTonight I ordered delivery takeout. My employer gives me $20 gift cards to this restaurant every month. Tonight I ordered delivery to my office since it was a late night at the office. When I ordered I tell them I will be paying cash, and I have $40 (20x2) worth of gift cards, and will pay the remainder in cash.  The delivery man comes in 25 minutes, which is in the window I was told I should expect. I present the $40 of gift cards and a $20 dollar bill for the remainder of approximately $3. I planned on giving a $4 delivery tip. The deliveryman has no change. He calls the manager and says I can pay with credit card. I tell the manager on his phone I would like to pay the remainder $3 plus add a $4 delivery tip. The manager on the phone says $10 minimum. I explain that the deliveryman can't even break a $20 bill, and this is a customer service issue. He says again $10 minimum. I explain again that I can't justify a $7 delivery tip on a $43 cash order to someone who can't make change for a twenty. I do have three dollar bills in my wallet, short a couple of cents from the exact of the roughly $43.xx. I pay and he leaves. 20 minutes go by and I get a call saying they incorrectly billed me and need $2 more. They say it was because I asked for a discount. I never asked for a discount, I said I had two gift cards.  I agreed to pay the $2, a mistake on their end, but said they would need to break a 20. They said they could. I said I would leave the office in 45 minutes. They said they would be there in 20 minutes for their $2. An hour goes by since I had more work than I thought and I leave the office. I call the restaurant and told them I was leaving and to call off the deliveryman collecting the two dollars.  They said they would call him and notify him to not come. \n\n20 minute later he calls me and says he is at my office and where I was. I told him I left and notified his manager to contact him. He cussed at me. I had a 13 hour day at work with no breaks, this was the breaking point. I cooperated with their measly $2 mistake by agreeing to pay. I am not sure why my employer gets these $20 gift cards, but I will notify them not to do business with them tomorrow.", "author": "Ryan A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-31", "description": "First time eating here today. Husband ate from the buffet and he loved it. I ordered from the menu and my dish was delicious. Staff was very helpful and friendly.  Nice laid back place.  We will be coming here again. Thumbs up for this place!", "author": "Marie M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-18", "description": "Very good food.  I loved everything I had.  Reasonable prices too. Delivery time was quick and they remembered to bring me some plastic ware (I was staying in a hotel).", "author": "Lisa M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-05", "description": "So it's been forever and a day since I've been here. Probably 2 to almost 3 years since I've been and I have again ordered the Chicken Thali dinner with the chicken vindaloo. I always switch between the vindalooand the tikka masala chickens. Amazing food and always consistent.  I have yet to try another dish but I love the thali dinners so much. The wait staff is always friendly and always make sure we are doing okay. My friend and I also ordered the pompadon appetizer which is a round crispy Indian type chip with different dipping sauces. Always get it and its wonderful.", "author": "Jesslyn H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-03-30", "description": "Pros: All you can eat lunch buffet\n\nCons: flavors are sub par\n\nIn and area and with time. I stopped in to give this place another go. They did have better naan this time. However the amount of food available was pretty pethatic.\n\nThe buffet starts at 1130 and I came in at 1230. \n\nThe chicken curry available was about 80% thick curry and 20% chicken. I took some and the person after me took the rest. Which again wasn't much to begin with.\n\nInstead of replacing it. They simply stirred it up some more.  \n\nI won't give this place a third try but your welcome to.", "author": "Nathan A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-06", "description": "If you want REAL Indian food, check this place out. My wife is from India, so I know the difference. They're clean and authentic. I ordered lamb tikka masala, and it was amazingly tender and flavorful. We also got butter chicken, mango lassi and paneer naan. Everything was great. \n\nI saw some other reviews said they had bad service, but I think the service was wonderful. They didn't speak much English--but that's because they are Indian folks who know how to make the real deal. I asked for a few extra things with my meal that I normally have in India, and they gladly made special preparation for me. \n\nAlso, one reviewer claimed that the restaurant is not authentic and that they have bones in the food. They obviously haven't spent enough time in India because there are bones in the food more times than not. It just shows that this place is authentic. \n\nI would definitely come again if I lived here!", "author": "John A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-12-08", "description": "Ordered delivery through Grubhub. Don't know whether to yell or cry. Hands down the absolute worst Indian food I have ever had in my life by a long shot! Food was beyond terrible. Absolutely no taste for the lentil soup and coconut lamb. No seasoning, no salt, nada. As a matter of fact, I didn't even really get any lamb. I got a cup of watery tasteless slop with maybe 1 piece of lamb chopped up into 4 small pieces floating in it. Chicken tikka masala was nothing but a cup of watery tomato sauce and like the lamb, the chicken was missing. Just 3-4 small pieces floating in tomato slop. I paid $40 for 3 cups of watery tasteless slop, no lie. I'm beyond pissed off and feel so ripped off. Just gross and rude. \n\nHow dare this establishment rip their paying customers off with such carelessly prepared food! Highway robbery. I wish Grubhub would drop this place because it makes them look bad. Never again, I want my money back. If you want good Indian delivery, Golden Gate Pizza and Masala in the sunset for the win. This place is garbage.", "author": "Irina S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-27", "description": "This place is pretty solid for delivery indian food. My order always arrives well before they say it will (yay!) and the food is great. I recommend the Coconut Vegetable Curry, Chana Masala, Chana Saag or Aloo Gobhi Masala. It's not the best indian food in the world, but we aren't comparing this to a michelin restaurant. Delivery is fast, food is delicious, and it's hands down the best value you'll find- for $12 you can easily feed 2 people. \n\nJust a note-- Indian food is traditionally vegetarian. Order a traditional dish. You won't miss the meat and they do vegetarian very well!", "author": "Hannah B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-11", "description": "Love ordering take out from here! The flavors are on point.  I dream of the naan combo!!!! The masalas are delicious as the soups and basmati rice!!  Definitely recommend especially compared to the other options in the Richmond!", "author": "Jenny B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-04", "description": "I prefer this restaurant in outer Richmond. The buffet lunch is offerable and there are many vegetarian options and the chicken Tikka masala is very good even I have tried. The service is good. They are more friendly. I stayed in 28th Ave. The delivery also fast as soon as. This restaurant is my first choice in bay area.", "author": "Kumar V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-19", "description": "Consistent phenomenal customer service and food. That simple. It's been a couple years and I haven't even explored the menu that much, always naan and tiki masala", "author": "Spencer K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-12-09", "description": "Ordered delivery from here for the first time last night- chili paneer, chicken tikka masala, rice and naan. All tasted okay (not great, but okay) but made my 10 year-old son and I violently ill! We are both out of school/work today as our bodies rid themselves of all of it. \n\nNeedless to say we obviously won't be ordering from here again.", "author": "Emmy C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-17", "description": "Buffet was fantastic! Went for lunch break with coworkers on a Sunday and we could hardly work the rest of the day, couldn't stop eating. Good vegetarian options, too.", "author": "Robbie D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-08", "description": "We had saag paneer, biryani and chana masala nothing disappointed us. Food was good and bread was freshly prepared.", "author": "Jyoti K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-19", "description": "Ordered saag paneer and dal makhani and naan through Eat24.  Food was at my door 26 minutes after ordering and it was SO GOOD.  I have been hunting across SF for an Indian restaurant that makes a really delicious dal makhani and finally found one!!  So good, so fast, and the medium level of spiciness was just perfection.  \n\nI cannot wait to order again!", "author": "Sarah R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-10-28", "description": "Just ordered takeout from here and I have it say it was incredibly disappointing. \n\nThe best part of the dinner is the Mango Lassi. \nThe kasmeeri nan is dry with huge anise seeds which have been cutting into our gums. The rice is ok but full of obviously frozen vegetables, cubes of carrot, green beans, and corn...things I've never had in my normally delicious Indian rice. The rice is also overlooked and too soft. \nWe ordered two curries, Chicken Coconut Curry and Chicken Korma. The chicken korma doesn't taste remotely like the 20 or so entrees I've had in my life, the sauce isn't right. \nThe chicken is fatty and birdy. My boyfriend said he bit into something he's never experienced with chicken before. It squelched. The actual sauce is ok but mixed with the rice it's mediocre at best. \nNeedless to say I wish I could have my $36 back, and had just ordered dominos. We will not be ordering again.\n\n\nEdit: My boyfriend found a large inch long bone in his chicken Korma. A Bone. \n\nWe called the restaurant and they said it was not their fault because their vendor sends the frozen chicken that way. They refused to give us a refund and wanted to send more good. We have never had such a hard time making it clear that is not ok. After talking to three different employees we were able to get a partial refund for the dinner, but still not sure they even understood us. I'll be checking my card statement.", "author": "Larissa S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-11-13", "description": "Got delivery and was severely disappointed.  \nI ordered:\n- vegetarian samosas, nothing special.\n- vegetable coconut curry, lacking flavor and little sauce due to massive chunks of potatoes     \n     thrown in.  Also yellow squash was in this, which did not seem fitting.\n- side of rice, hard to believe the rice wasn't even good\n- side of chapatti, meh really didn't even enjoy it.\n\nUnfortunately, this was the most underwhelming experience of eating indian food and everything lacked flavor and was just really bland.  Like another reviewer said, the only thing I enjoyed was the tamarind sauce, which I was given more to drench the food in to give it some appeal.", "author": "Devin T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-09-30", "description": "We went to this restaurant, no body attended us and not even served water. My family was very disappoint and we had two kids with us asking for water we waiting for almost 45 minutes no one came \n\nThe worst service I have ever seen in my life, will never go to this place again.\nWhen we were about to leave the restaurant not even one person ask what happened why your leaving \nSo I recommend to people not to go there and waste your time waiting for them \nAgain this place serves is wrest service ever", "author": "Anil R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-20", "description": "I order from Great India on an almost weekly basis and it's always delicious. I usually order lamb dishes and there's always plenty of it, and very tender. Plus, the people who own the place are very nice. Happy to have this place within walking distance of my house.", "author": "Amanda N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-06-04", "description": "I have been to plenty of Indian restaurants in the city but this is The worst Indian food I have ever had. We decided to give this place a try because we saw a bunch of people in the restaurant one day. (Indian people) so we assumed that they had really good Indian food.  When we were there we ordered fish curry, Gobi Aloo, Sag Paneer, Lamb Vindaloo,  biryani and naan. (just in case you think we had couple bad dishes) \n\nFirst of all I order Lamb Vindaloo in all the Indian restaurant because that is my absolute favorite.  I make it at home at lease couple times a month. Their Lamb Vindaloo taste like three cubs of lamb cooked in tomato sauce. Vindaloo suppose to have over 10 different types of spices and strong taste of turmeric in the end.  It suppose to be spice, sour, and savory. There was no spices in the sauce. It was $14 for three pieces of lamb in tomato sauce with three other pieces of potatoes.  Worst Vindaloo attempt ever. \n\nSag Paneer was okay. \n\nBiryani was flavorless. would have been nice if they put any kind of spices in the rice. \n\nGobi Aloo was Okay \n\nFish Curry didn't have any curry flavor.  It was couple pieces of fish cooked in tomato sauce.\n\nIt would have been okay if they were Chinese people trying to make Indian food but they were all Indian.  How can they possibly serve this crap to people.  Btw, they were serving Chinese spring rolls.  It's just the lack of effort that pisses me off about this restaurant.  Way better Indian food down the street at Clay oven. or Star India off 1st and Geary.", "author": "Daniel D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-05-17", "description": "I went to the buffet for $9.99. The curries were pretty bland. The naan isn't as crisp as I wanted. Unfortunately nothing was spicy. The dessert is a must taste. The watermelon and salad were fresh. All in all, I liked the textures of the food but the flavor wasnt authentic.", "author": "Lara H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-11-04", "description": "I ordered from this restaurant because I had a gift certificate. I noted that it is nice that delivery is free and until 22:30. Kudos to the delivery driver who actually came inside the building too! However, I realized after opening my order that I did not receive two of my items, despite that I had them repeat back the order before we hung up initially. \n\nThat's when I discovered that this restaurant has the WORST customer service. The man I spoke to barely spoke English, hung up on me twice, and kept repeating himself that I had actually received everything like he thought he was a real-life Jedi.\n\nIn detail: When I called to let them know the items were missing, they of course did not answer because by this time it was a few minutes after 22:30. Then when I called the next day once they opened for lunch, he asked me accusatorially why I didn't call sooner if I was missing items yesterday. After I explained that, he just started repeating \"We checked the order twice. You received everything,\" occasionally throwing in a comment that really annoyed me, \"Please don't do like this.\" I believe I spoke to the same person the night before and the next day, and his English was so poor that sometimes it was hard to tell when he was just being a jerk and when he was literally not comprehending. Ultimately, I asked his name and to speak to someone else. He claimed he could not spell his own name (Mani? he only mumbled it as fast as possible) and had the audacity to tell me that nobody else worked in the restaurant, ever. \n\nI finally called back later in the day (nobody called me, as I had requested) and reached someone else who was much nicer (Paul?). The hilarious thing was that the jerk actually tried to take the phone away after a minute (\"thank you for waiting\"--in the middle of the new, normal productive conversation) and I had to make him give it back. Paul's English was only a little better but he did have the courtesy to interact with me the way normal sane people usually do with customers. Finally, he said next time I ordered to remind them and they would give me the two missing items for free. Unfortunately, I don't think there will be a next time. I am just glad I had the certificate or I would be much more upset about the loss.\n\nAs for the food, the malai kofta was flavorful and arrived hot, and the medium spice was a perfect amount of heat in the flavor. That was the only good thing about the whole experience. The breads I ordered (keema naan, pratha, and onion kulcha) left quite a bit to be desired. I am pretty sure I received naan instead of pratha--pratha is delicious and buttery and flaky-layered, and is described the same on their website: \"velvety layered\". What I received was dry, thin, and almost a little burnt. Maybe it was a terrible chappati because the jerk on the phone tried to tell me it actually was pratha because \"pratha is just wheat bread.\" So upsetting. But I certainly hope that it was not a true sampling of their pratha. The onion kulcha was fine but could have had more fillings and was a bit burnt at the edges. The keema naan (and the kulcha) were at least moist and doughy but there was no meat at all in what they insisted was the keema naan, which is supposed to be stuffed with ground lamb. Lastly, the vegetable pakora (fritters) were at least crispy but they were practically all fry dough and almost no vegetable, and were also a little burnt at the edges.\n\nOverall, the one good dish might have balanced out the subpar side dish situation and this restaurant would have gotten probably 3 stars when combined with the convenience of free delivery as late as 22:30. (The malai was good enough that I might have otherwise tried to order some other dishes another time.) But, given the mediocre food and excessively poor customer service experience, I think this restaurant deserves only 1 star and no further business from me.", "author": "Sora E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-23", "description": "Service is too good daal makhani and channa masala is really very good  a 19-20 year old boy give a good service to us we will give 4 star for service and 4 for food", "author": "Malkeet V."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-12-31", "description": "A co-worker retired and we decided to treat her for lunch and had it delivered.  The delivery was pretty timely and the food arrived before noon.  \nThe chicken tikka masala came with big chunks of chicken, more sauce than chicken. I wouldn't order it again as I can make a better tasting masala dish.\nThe spinach paneer was pretty good.  We liked the biriani rice dish and garlic naan bread.\nThe vegetarian samosa was good too but pretty spicy.  They have sauces in little containers to go with your meal. It was more than enough food for the 5 of us.", "author": "Ry T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-20", "description": "Ordered for delivery from this place. Tried:\n- Chana Saag\n- Saag Paneer\n- Goan Fish Curry\n- Garlic Naan\n\nReally good flavors and prompt delivery. Goan fish curry and Chana saag were on point. One of the better Indian restaurants for North Indian food in the city.", "author": "Santosh K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-03", "description": "I'm not a person who writes review on yelp but i couldn't stop myself from sharing wonderful experience I had at this restaurant so that most of the food lovers like me wouldn't miss this place.", "author": "Hitarth S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-09-23", "description": "Tried the open buffet lunch but the service was really terrible. I went there set down and waiter came with a miserable face telling me to change my table because the other table was half dirty and he does not want to clean another table. Ok ,no problem I can change my table but do not say it like I have to do it, he did not even ask he showed me the table and told me to sit there. How awful, never been treated like that my entire life ,very very very rude. When I complaint about his attitude no one seemed to care in the restaurant, they were all like 'Yes,we hate our jobs and no one cares about us and we dont care if you dknt like it,you can leave.' That was exactly their attitude if not worse. You can see the hatred in their eyes to their jobs. Omg so awful.\nThe food was not good either, everything is swimming in some red sauce,blunt,tasteless and you can see how old it is ,sitting there for god nows how long! Even though I almost did not toich most of the stiff on my plate it upset my stomach, very bad experience :(", "author": "Nashua J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-07-27", "description": "I ordered lunch for man I'm dating. He said it was great and he was too full to finish. He only ate the garlic naan bread, which he dipped in curry. He mentioned he didn't get to chicken, because it sunk to bottom of curry which makes me kinda suspicious '-' Naan bread was burnt in some areas and chicken tikka masala curry wasn't spicy enough for him, but I did order it medium! He ate like half of one of the samosas. The restaurant sounds promising from what majority have said. They delivered quickly and ahead of scheduled time. Two veggie samosas, chicken masala, garlic naan and a 7Up came out to 21 dollars. Not including tip. I went crazy on the tip in hopes they would REALLY deliver! On my end, transaction was smooth and Yelp ordering was great~ you can choose level of spicyness so that's a plus.. I will update this review later when I go visit the area and try out the food for myself!", "author": "M C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-03", "description": "The order was delivered 10 mins earlier. Everything was fresh and tasty", "author": "Alex K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-11", "description": "Really enjoyed the Murgh Makhani - very good. I agree with some of the other posters here about the chicken not actually being \"boneless\". While I didn't find a bone, there was a lot of cartilage and when you order boneless chicken, you shouldn't have to deal with that. \n\nI wouldn't order the samosas again. Both the veg and lam samosas were over-spiced and bland at the same time if that makes any sense... just a poor use of spices. \n\nThe naan was good too. Looking forward to checking out the buffet", "author": "Emma M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-08-06", "description": "I drive past this place all the time and always said I would stop in. The naan bread was the only thing I enjoyed but the thing that made me mad about this place was the blatant classism. I came in made my plate and sat down. At every Indian restaurant I have ever been always bring you naan bread. However, I had to ask for it after the waiter decided to bring bread to the party of White people who came 10 minutes after me. His attitude was as if I had no right to ask for naan bread. Never go again,  I need a mood changer now.", "author": "Ismail S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-10", "description": "Yum! I love Indian food.  This place is a great choice!  Location is chill.  Food is exactly what you expect and desire in Indian food.  It was fresh,  hot,  and flavorful! If you desire or haven't tried yet,  just stop and try it!", "author": "Randall C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-10", "description": "I went to this restaurant today for lunch buffet.OMG there was so many vegetarian option..and non veg also..i like the food.its very delicious and excellent.. i ordered for delivery and got so fast..i ordered paneer chilli,ctm,saag paneer,veg samosa,Tandoori chicken.,Garlic Naan..i recommend this restaurant in SFO.", "author": "Nimmagadda N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-07-10", "description": "Worest food I had ever. No taste nothing. Tandoori chicken is some what oaky. Shrimp biryani is kinda bad smell. Chicken biryani is kinda sambar rice. Less quality high price.", "author": "Nishith R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-31", "description": "Great lunch buffet, $10.99. Some Indian places don't give enough options with the buffet but not the case here. Service was great too, refills regular.", "author": "Mac Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-05", "description": "Its cheap and delicious, always stoked on what i get. Delivery is quick and also only a 15 dollar min, which is awesome when ordering in for just one poor college student", "author": "Shannon B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-07-03", "description": "Really wanted to like this place.  I gave it many chances, going 5-6 times a year for about 3 years, but I officially give up.\n\nDon't get me wrong.  The food is good.  It was the only thing that kept me coming back, and it's the only reason why I'm giving 2 stars instead of one.  Their pakoras are tasty, their tikka masala sauce is tart and tomatoey, their tandoori chicken is moist and flavorful, their curry chicken is fantastic, and they have a delicious cheese cube thing in a tomato-based sauce that's amazing.  Taste-wise, Great India is one of my favorites.  But what good is that when the food is often NOT AVAILABLE?\n\nYes, I always go for the lunch buffet and MANY times I find the trays dead empty.  The turnover rate  for new food is slow.  And the service is often negligent.  There's only a few good waiters, and the majority of them are not attentive or do not care.\n\nBut despite the spotty service and inconsistency in availability of food, I kept coming back.  I like their food (when they have it) and I like to support local business, even though they are sometimes not perfect.  I always gave them the benefit of the doubt.  Then came the final straw.\n\nLast Sunday, 1:30pm.  Partner and I walk in for lunch buffet, which is advertised as 11:30-3pm 7 days a week.  Note that we are nowhere near the cutoff.  Starving, we go straight to the buffet, piling our plates with rice first.  I reached for the two pakora trays and noticed that they were both empty, the only thing remaining was the sign.  Ok, no biggie.  I can wait for the fresh batch.  We moved on to the next tray.  Beans that we don't like.   Skip.  The Tandoori chicken tray had just one tiny piece of chicken left, barely a scrap that was undoubtedly connected to bigger piece.  Starving, I grabbed it anyway.  Then we came to the chicken tikka masala.  My partner swirled the ladle around in the sauce.  \"There's nothing here,\" he remarked.  Ah, but he is good at wet food hunting.  This man can bring up the tiniest piece of tendon or tripe in the most opaque leftover pho soup in existence.  Sure enough, he manages to find exactly TWO pieces in the sauce.  He takes one and generously offers me the other.  We both ladle tikka masala sauce over our rice.  The curry chicken is next.  I grab some but my partner skips it because he doesn't like it.  And that was all there was.  Rice, beans that we don't like, one tiny piece of chicken tikka masala each, and curry chicken for me.  They usually have a dessert too, but no dessert this time.\n\nWe take our plates to the table and hungrily dive in, glancing over at the buffet occasionally to check on the status of new food coming out.  15 minutes pass and nothing came out.  We were both still starving.  I wandered to the buffet to see if maybe I had missed them bringing stuff out.  I noticed that they had taken away some of the trays that had signs on them.  The chicken pakora sign was taken away and replaced with just veggie pakora (which strangely  only consisted of onions.)  Both the chicken tikka masala and chicken tandoori signs were taken away, replaced by one big tray labeled \"naan\", which was empty.  The only thing that remained on the buffet was white rice, the beans we don't like, and curry chicken.  I glanced at the clock.  1:50pm.\n\nI went back to the table and remarked sadly to my partner that they won't be bringing any more food out.  Bear in mind that at this point, my partner has only had a heap of white rice, and one piece of chicken tikka masala.  He was livid.  He told the waiter he wasn't paying for his \"buffet\".  Starving, I continued to eat my curry chicken and rice.\n\nAs I ate, I saw a tour bus pull up right in front and about 30 Indians pour into the restaurant around 2pm, an hour before the buffet was scheduled to close.  My partner pointed out that we were shafted because the restaurant was expecting the tour group so they prematurely took away all the buffet food.  As the restaurant became crowded with the noisy tour group, I abandoned my plate and paid for my bill (the restaurant did not charge my partner.)  As we were leaving, he told the owner/manager that we were never coming back again because there was no food in the buffet.  \"I'm sorry,\" she said, \"but we had this group coming in...\"\n\nSorry lady.  If you have a group coming in at 2 and you know you'll be shutting down the buffet at 1:30, why did you not tell us when we walked in?  Because you didn't want to miss out on that $24+ tip from us?  Sure, we would have left and gone somewhere else, but we would come back next time.  And now that we were disrespected and shafted, we will NEVER come back again.  You made your $12 from me this time, but you've lost years of future repeat business from me and my partner.\n\nMy advice to those coming here for the lunch buffet: SCAN THE TRAYS FIRST TO SEE IF THERE IS ANY FOOD.  IF NOT, ASK THEM IF THEY PLAN TO BRING OUT MORE.  Even if it's well before before the cutoff time, don't assume.  Ask!!", "author": "Tee B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-12", "description": "My boyfriend and I couldn't compromise on dinner - he wanted something heavy, and American, and I wanted something Asian and with rice. We somehow compromised on Indian, and decided to try the place a block away from his house.\n\nNeighborhood gem. From the outside, it looks old and a little run down from the doors. There's a bunch of rating stickers and a sign that reads \"Bathroom is for customers only. Please try to keep our bathroom clean.\" However, the inside of the restaurant is immaculate. Even the bathroom, which I was expecting to be gross, was super clean - looks like it was remodeled recently. I guess the cleanliness stands out to me, since Naan 'n' Curry can be quite disgustingly dirty.\n\nBack to the food - we ordered a garlic naan, onion naan, rice, the chicken tikki masala, and the green spinach curry. It just so happened they were the two curries featured on the menu's cover. The Chicken Tikka Masala was our favorite - homey, rich, satisfying. I thought the spinach was alright, no biggie, and it needed more salt. Naan's were excellent!\n\nI can't wait to come back here. Staff was very friendly, food was delicious, restaurant was spotless. What's not to love!", "author": "Jocelyn L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-14", "description": "Yumm! I love coming here for their lunch buffet! Or ordering delivery for dinner. All their food is so good! And the staff is really nice!\n\nThe buffet is the best because I get to have a little bit of everything and it's since it's only 10 bucks, I can go any time the craving strikes and not even feel a tiny bit guilty! They have all the staples, especially my favorites: chicken tikka masala, saag paneer, fresh baked naan and sweet rice pudding! (Confession: Sometimes I even go right when they open and have Indian food for breakfast! Shh, don't tell, lol)\n\nEnjoy!!", "author": "Adelle K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-19", "description": "Though I have been eating at, and ordering from, Great India for years, this is the time I must give them the accolades they deserve. When we have guests from out of town, and I've been cooking for most of the visit, we give a lovely send off by ordering from Great India.  My tab usually comes to between $80 and $100 because we have so many people to feed. (And, that I can order through GrubHub and pay with Paypal is a huge advantage.)\nThe food always arrives hot and fresh; they pay very good attention to the level of heat that I request. There are so many dishes that I love, I would be stretching my consciousness to attempt to list them. My recent choice of coconut fish curry has knocked me sideways.  The selection of breads is wonderful, and whatever saag I choose is flavorful; any protein involved is succulent.\nI was born here In San Francisco, and as you may imagine, there were few to no Indian restaurants at the time.  The first one I ever visited was Gaylord, somewhere in the early 70s. Great India does such a wonderful job with their food, that I do not miss Gaylord at all.\nGive it a shot folks....if you know what to order, you can't miss.", "author": "janice s."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-10-05", "description": "First of all, DONT GO HERE!!!\n\n      I don't know how in the world they have 3 1/2 stars. It took them 40 minutes to even take our order, and we didn't get the food for another hour. We were here for about 2 1/2 hours in all. Once the food FINALLY came, it was bland and greasy. My chicken wasn't even fully cooked! The food was OK at best. Still, I was worried I might get food poisoning. The water and drinks were lukewarm and disgusting. In addition, it wasn't very cheap either, for the crap we got. BAD experience!! Save yourself the disappointment, and don't go here.", "author": "Helena Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-09", "description": "I recommend this restaurant. I ordered for delivery got intime. The food is excellent.I ordered C.T.M ,saag paneer ,Coco veg ,Lamb korma .and appetizers ...", "author": "Ajay V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-03", "description": "Great hole in the wall. The lamb dishes weren't the best I have ever had but the paneer tikka masala is the bomb! Naan is great and warm, mango lassi's delicious! And they are super cheap compared to everywhere else. Quick delivery too!", "author": "Arielle B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-06", "description": "Love this place ! Definitely best in the Richmond neighborhood. I usually get the saag paneer with naan and it's a delight.", "author": "Courtney S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-13", "description": "This review is for the delivery I just received.  The time it took from placing the online order to receiving the goods was just over fifteen minutes . So of course everything was still hot.  Chicken biranyi was spicy and naan with ground lamb came with yogurt sauce for dipping . I will order again certainly .", "author": "Philip R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-06", "description": "I'm English and I've been eating Indian food since I was in a high chair. So, let's just say that Indian food in America is a little different to what I'm used to. That being said, I like Great India, the service is good, and the food is excellent. \n\nA favourite dish of mine is the Karahi Chicken. The sauces is well thought out with plenty of spice, and vegetables. Great India does a good job at making the chicken, most places I've been to tend to over cook the chicken making it dry.  \n\nThe Vindaloo and Madras are also very good. I know this because I sweat when I'm eating it. Again, the chicken's not dry which is the most important thing to me. \n\nI'm happy to say that Great India is one of the best Indian restaurants is SF and I recommend it to everyone.", "author": "Sean H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-02-08", "description": "Worst customer service ever. This is probably one of the worst experiences I've ever had with a restaurant. Terrible management and completely rude. There are plenty of other restaurants on Geary.\n\nThe food was not good at all - didn't taste like genuine Indian food.", "author": "Nabila S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-07", "description": "$10 lunch buffet \"all you can eat\"! This is a great place to try Indian food for the first time, not too spicy just right! Definitely recommend this place, also great service!", "author": "Leo R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-26", "description": "Love this place! Such friendly people work here. Really nice tikka masala and lamb biryani.", "author": "Charlie W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-02-17", "description": "I had gift certificate to this place, so I decided to do take-out!\n\nI phoned in my order, and they were prompt and courteous. \n\nI ordered the chicken tikka masala, fish and lamb vindaloo. I like the chicken tikka masala a lot better, so good! I like all the sauces that come with the dishes, they are refreshing and it compliments it well. \n\nThe foods had a slight kick for spiciness but it wasn't too spicy either. Nothing I couldn't handle! \n\nWe were lucky and we found parking right there on the street. \n\nI definitely would come back, but it's a little out of the way for me if I didn't have a car. I am not sure if it's worth a bus ride here. I figure there's places nearby me (in Inner Sunset) where the food is of similar quality and flavors.", "author": "Margaret L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-25", "description": "After unpacking, it was around 9:30pm in the Inner Richmond on a Thursday, and we found a lot of places had already closed.     This was one of the places that was still open, and based on our fellow Yelpers we decided to give it a try.\n\nWe were glad we did.   I don't recall what dishes we ordered, but as we are trying to be as close to pesca-vegan as possible, I can tell you that there was no cheese or meat in any of the dishes we ordered.   Everything we ordered was very tasty, the service was quick.  \n\nI'd probably give the place 3.5 stars, but I am rounding up because it is a place I'd suggest going if someone wanted Indian in the area.", "author": "Marc P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-13", "description": "A solid choice for dine-in or take-out. I pretty much always order the saag paneer, chicken tikka masala, vegetarian samosa, paneer tikka masala, and garlic naan. It's also a great price for the amount of food you get.", "author": "Christina M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-04-16", "description": "Health score: 83.  Order at your own risk.  Disgusting.  Why are these ethnic places always so damn dirty. It doesn't cost money to be CLEAN as$holes.", "author": "Anne S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-12-30", "description": "Disappointing.  Medium spiced dishes had zero heat. Vegetables in veggie dishes seemed to be frozen mixed veggies. \n\nSeekh kebab was the best thing we ordered.  Naan was fresh and good enough.", "author": "D R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-07", "description": "They are located in my grandparents neighborhood and we ordered delivery through yelp.  The kids loved the samosas! Food came fast, was tasty for a quick bite.", "author": "Falon B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-22", "description": "I got Vegetetable Samosa ($3.50), Jasmine Rice ($1.95?), Chicken Tikka Masala ($11.95), and Garlic Naan ($2.25). The food was extremely delicious and the staff were more than friendly and quick!", "author": "Jamey M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-19", "description": "The paneer tikka masala is so good. I can't get enough of it. The service here is great too - super efficient.", "author": "Brooke W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-05-01", "description": "Going to make my reviews short & simple for those who don't like to read\nI usually don't eat indian food and this is probably one of my first 5 times still just to make this clear. But I do have a ton of experience eating curry. So here's my honest review.\n5/5 stars for CLEANNESS. Decorations, tables, were all clean and spacious. Felt very comfortable.\n3/5 stars for FOOD. Food wasn't bad, nor was there anything special to it. Curry was the best highlight but they weren't super spicy at all. My friend and I went for the lunch buffet. Everything was just average, nothing particularly bursted with flavor. But for $10 buffet, you really can't ask for much.  You get what you pay for, cheap price, average food. Definitely a place to try at least once though. When my friend and I walked in on a friday afternoon it was pretty quiet, there were people here and there but still pretty quiet. Kind of awkward due to the silence though. I encourage everyone who comes by to just give it a try. Server was very attentive and nice!Their chicken and curry dishes were probably the highlights. Naan was good too but I don't recommend eating too much, makes you full quickly.", "author": "Stephanie D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-21", "description": "Ordered from Eat24 and the order and the order arrived quickly, as confirmed.\n\nLikes: \n\nChicken Tikka Masala- everyone has their taste preference and I really like this. Great rich color and taste. Not too spicy.\n\nPalak Paneer: lots of cream. Very rich.\n\nVegetable Pakora: comes with dipping sauce.\nKheer & Rasmalai were delicious.\n\nSo-so:\n\nThe Lamb Curry: moderately spicy, but just OK.\nLamb samosa: bland. Also comes with dipping sauce; I ended up using the Tikka Masala sauce to help the taste.\n\nI will order from here again and try some other dishes.", "author": "Anna G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-03", "description": "I have been coming here for over 8 years now.  This restaurant has become like family. The thali dinner comes with everything Indian, including the naan and it's possibly to get white meat chicken only! \n\nI appreciate that it's family owned, they're reasonably priced and the food is spectacular.  The younger waiter has been working there for as long as I have been going and he's genuinely cares about his customers.  \n\nI recommed this indian restaurant, without hesitation as the best indian food in San Francisco, worth the drive up into the avenues.", "author": "Kaylee A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-11", "description": "Mother Indian is truly great, and so is this mom and pop restaurant in outer Richmond. The lunch buffet is full of vegetarian options, and packs tremendous bang for the buck. The wait staff is efficient and courteous, and brings out hot nan (Indian bread) to compliment your meal.The chicken cutlets in curry sauce is delicious,The basmati rice is superb, the chutney selection is nice, and they almost always provide the king of fruit to go with your meal; the almighty sliced watermelon! I would go there just to receive the sacred smile from the proprietor as I enter! The cuisine of India is surely great, and I am grateful for the lunch buffet from this nice restaurant.", "author": "David B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-04-27", "description": ":(  We placed an order through Seamless that was marked as 30-45 minutes for delivery and had chosen Great India because it had the shortest wait time. We received the confirmation but an hour and a half later the food still hasn't been delivered. We called to ask about the order twice, but the staff wasn't able to give me any information and was apparently also unable to contact the driver. They offered no solutions. \n\nIncredibly disappointing. Starving!", "author": "Jillian W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-08-19", "description": "The korma I had was good, and so was the onion naan. But I waited so long for the food to get delivered. I ordered at 7:05pm and waited 2 hours. I called at 7:45pm to see if they ever got my order, to which they said it was out for delivery and would arrive in 25-30 minutes. 50 minutes later, I called again and they said it'd arrive in 5-10 minutes.\n\nIf you want to eat food from here, either eat there or go pick it up.", "author": "Phuong M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-12-12", "description": "Ordered my food online through Eat24 in the afternoon during the SF stormaggen for a delivery at 6pm. Got a call within 10 minutes asking if I wanted the delivery now or the evening. I told the gentlemen 4 times that I wanted the delivery at 6pm which is the evening. The food was delivered at 6:30 which is after the estimated time but understood since, it was pouring out. The delivery person said the amount due was for $4.00 more than what the price was on online. I asked the driver why and he just said that is how much it was. So I paid the driver and then gave a call to the restaurant. I told the lady that they over charged me and she said that the receipt the driver had was wrong and to pay the correct amount. I told her that I already paid the driver since, he needed to leave then. She said that the driver will come back and refund the overage.\n\nJust a note, that you should check the receipt and make the call regardless if the driver wants to leave or not. Besides that, the food was ok.", "author": "Kerry T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-23", "description": "I enjoy having food in this restaurant the service is good and especially i love eating chicken tikka masala and prawns masala", "author": "Gowthami Reddy T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-25", "description": "Delicious, so many vegetarian options, and open on Christmas. Plus an all day buffet for $10, I didn't do the buffet but I thought that was cool! Service was great and food was served hot and quick!", "author": "Chach S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-30", "description": "I have been here so many times for some fresh Samosas and chai to satisfy my early evening  hunger or to have dinner when I am craving Indian food. It is a decent restaurant with nice Indian food and I love it because it's 3 blocks from where I live. Food wouldn't disappoint you, I just hope they had more in menu (including chaats). One thing that is best about this place is that it is open all day till 10:30 PM. So, it is definitely my first option when I want to eat at odd hours.", "author": "Pratibha S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-12-27", "description": "High hopes.\n\nBruce Springsteen is great: https://www.youtube.com/watch?v=rOPDhoZH91g\n\nGreat India is not so great.\n\nMenu description of the chicken tandoori sounded awesome: \"No cholesterol, no skin, served with fresh gilled onions and bell peppers.\"\n\nAssumed the no cholesterol part was a stretch. Did not assume aforementioned chicken would show up swimming in grease and oil.\n\nProved to be a very disappointing misprint considering the friendly service and reasonable $10 cost for a generous half chicken. Had much higher hopes.", "author": "Jason B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-09", "description": "I went this restaurant yesterday. The food is delicious. I like c.t.m and saag paneer. Service also good .they move friendly with me.and i recommend  lunch buffet  also its contains lot of options like vegetarian, non veg start up ,and dessert  in just 10.99$ ..i recommend this restaurant. ..", "author": "Deepi S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-05-13", "description": "Ordered delivery from here.  It arrived over an hour late and was super bland.  Not recommended.", "author": "Tim A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-01-02", "description": "Yuk \nAwful dry bread bland curry no meat in the dishes like 3 pieces. Greasy just yuk", "author": "obgyn K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-04-30", "description": "This place was absolutely terrible... 3 of us had the buffet and regretted every aspect of it.   All of us Indian food aficionados....  none enjoyed any of this experience.   Place was dirty, food didn't look like it was supposed to... nor did it taste good--at all.   \n\nOne of us was from out of town, and 3 months later, he is still cracking jokes about restaurants in San Francisco based on this garbage.  My mistake was going here and with a foodie friend who was visiting.   We were all joking (mostly) about potential for food poisoning for hours after dining here.  \n\nDon't go.  Would be better to starve or use your money for origami.", "author": "Johnny C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-22", "description": "I thoroughly enjoyed the experience. Eating their food made me forgot that my apartment was being renovated momentarily.", "author": "Khristopher P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-30", "description": "I recently visited this place again and to my surprise taste in food was back. They have changed all the staff recently including chefs. I am improving my rating from 2 to 4 star... hope they will retain this taste.", "author": "Varun R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-12-08", "description": "This place is alright. THey deliver which is pretty cool. THe hours are great. I haven't tried the buffet but I heard its great. I liked the soups here. Idk it was alright.", "author": "Luke S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-19", "description": "First time. We enjoyed lamb kabob to start and the chicken vindaloo and masala was bomb. We'll definitely come back!!", "author": "Bill M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-02-21", "description": "A lot of polarizing reviews here. My Yelp friends gave this place four stars so I thought it was worth a shot. At the end of the day it was a 100% average experience--nothing better or worse.\n\nPros:\n\n- Free big cup of raita\n- Onion chutney (no place seems to have this in SF for some reason)\n- 20% Seamless discount for first time visitor\n- Pretty solid prices, even pre-discount\n\nCons:\n\n- 1hr 10min for delivery (granted, I was pretty far away)\n- Every entree was completely unexceptional\n- I like my saag paneer with a little texture and this was completely pureed", "author": "Paul C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-10-28", "description": "Guys, this is nuts. Don't eat here for health reasons. After finding a sharp bone in my food I called the restaurant to complain. I was juggled between a man and woman who tried to compete with louder voices than me and tell me it was not their fault. Not their fault for serving a dish with bone shrapnel in it. They adamantly wanted to send another dish to my apartment versus refunding my meal. I tried to explain about food safety for customers but to no avail over shouts that \"no one ever complains here. No one.\" Let the record show that I did.", "author": "Tim T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-23", "description": "I found a Restaurant.com deal for Great India and decided to check it out for dinner Sunday night. When we first walked in (around 8p.m.) there was only one other table occupied, which some might see as a red flag.\nI know I'd eaten here several years ago so I didn't give it much thought. Once we ordered, a bus full of Indian tourists walk in and the place is a mad house! The server told us they've been getting busses of hungry tourists almost every day for the past few months, great for business!\n\nGreat India offers buffet dinner, as well as a la carte options.\n\nWhat we ordered:\n\nGarlic Naan - warm and doughy, not overpowering garlic flavors.\nBaigan Aloo - Eggplant cooked with potatoes and fresh tomatoes\nLamb Biryani - Indian bashmati rice cooked with lamb, nuts, spices (this dish has powerful flavors and can get a little spicy so make sure you get water!)\nVegetarian Samosa - Crispy Puffs Filled With Potatoes and Green Peas\n\nOverall, service was fantastic even after the big group showed up. I think we were fortunate to always have water refills and the food came out relatively quickly. The food was great, I have no major complaints.\n\nGentle reminder: maybe take the Geary 38 line (or bike over) to avoid the horrible parking in this neighborhood.", "author": "Alyssa G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-05", "description": "My friends and I ordered delivery from Great India and it was delicious! They had all been before, but it was my first time. Between the four of us it was about $60 for five plates. The flavor was mildly spicy yet not overwhelming. My friends are all vegetarians, but I was still pleased with the overall meal without meat!\n\nI definitely want to return here, and see what the place looks like inside 0.o", "author": "Mariah O."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-08-16", "description": "Good saag paneer and garlic naan. Not too crazy about their chicken tikka masala- only a few pieces of chicken, and the sauce had too much of a tomato taste.", "author": "Sophia B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-20", "description": "From the outside, you wouldn't expect this place to be as nice as it is. The food is really well cooked (I've been burned by all-you-can-eat Indian places before, but Great India does not take a pass on quality.)\n\nIt has a comfortable atmosphere, decent prices, but without being a hole in the wall. The buffet might be a bit limited, but it didn't matter since they had all my favorite Indian dishes anyway. The chicken tikka masala and chicken vindaloo were especially good.", "author": "Al S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-19", "description": "This is a hidden gem of an Indian restaurant!!! Delicious and authentic food, from the Daal soup (a real one, not the clear broth you find in most other places) to the Spinach and mushrooms dish, Benghan Bartha, Tandori Prawns..everything I tried there is super fresh and perfectly seasoned and cooked ~Highly recommended!\n\nIn addition, the service is great and welcoming and accommodating! \nAuthentic food, authentic people...a must try!!!", "author": "Chloe L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-31", "description": "Had the Paneer Tikka Masala and was not disappointed. It was cheap, fast, and delicious!", "author": "Nguyen K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-03-09", "description": "This is a review of delivery from Great India Restaurant.\n\nWhat's to like?:\n1.  Chicken Vindaloo - The sauce was spicy and tangy.  The potatoes were tender.  Overall, it was a pretty good vindaloo.\n2.  Vegetable Samosa - This was a good samosa.  The spice mixture was flavorful.  The shell was crisp.  \n3.  Pulao Rice was cooked perfectly.  It was nice and fluffy.\n4.  Easy to order via Grubhub.com\n5.  Delivery was prompt, professional, and polite.\n6.  The food was well packaged in easy to reseal plastic containers.\n\nWhat's not to like?\n1.  The chicken in the vindaloo was a little tough.\n2.  The naan was very average.  It also had dry hard spots.\n3.  The delivery was prompt.  They predicted an hour and they delivered at an hour.  However, if you are starving or in a hurry, you might want to select a faster option.\n\nOverall:\nThis was pretty good Indian food combined with easy ordering and predictable, professional service.", "author": "Mark D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-06", "description": "This place is LEGIT! I came in here to pick up an order and everyone in the restaurant was Indian. The hostess was super nice and smiley (which makes me really enjoy sitting there while waiting for my food). It looks like a semi-buffet but they have a menu. Items are typically $9-12, and the garlic naan (something like $2.50) is super delicious. \n\nThey have a tv but the sound isn't on which makes the restaurant much more quiet and one could actually have a conversation in there. \n\nThis is my new \"it\" place for Indian food. Mmm...I really want some more already. :D", "author": "Andy M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-01-14", "description": "Low-grade crappy Indian food.\n\nEverything felt frozen, greasy, cheap.  I think it may be the worst Indian I've tried in the city.  Don't bother, there are way better Indian places to choose from.  If you're in the neighborhood looking for good Indian, try India Clay Oven on Clement St.\n\nI guess if you have to go here, eat vegetarian dishes.  The veggies are at least better than the meat.", "author": "Jonathan S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-08-21", "description": "I ordered from this restaurant via GrubHub for brunch one sunday.\n\nPro's:\nDelivery time is good, the food arrived fairly fast\nThe prices are pretty reasonable\n\nCon's\nThe food was heavily reliant on lots of spices to make it taste good, which made it taste like it came out of a can. Very oily, very rich and not very tasty. \n\nThere are much better choices out there...", "author": "Sarah D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-22", "description": "This is thee BEST Tasting 3 day meal for 2, EVER!!!!\n\nWe buy -\n\n3 Garlic Naan $ 6.75\n1 Tandoori Chicken Full $ 13.95\n1 Coconut Chicken Curry Mild  $ 11.95\n2 Prawn Biryani $ 23.90\n1 Prawn Coconut Mild  $ 12.95\n\n& then I throw all the \"Prawn Biryani Rice\" in one BIG \"sealable\" container, then peal all off all the \"Tandoori Chicken\" from the bone, then I throw all the \"Coconut Chicken Curry\" & \"Prawn Coconut Curry\" on top & stir it all together till equally distributed & fully mixed & then put it in your \"Face Hole\" :-)", "author": "Makana R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-08-26", "description": "After having India Clay Oven on Clement the food at this place disappointed me.  But I guess that's like comparing Tres Agaves to Chevy's maybe.\n\nSome of the dishes we ordered were 'just okay' like the Saag Aloo (creamed spinach & potoatoes) and their Keema Naan (naan bread stuffed with ground lamb).  Repeat, 'just okay'...or...'not worth a 2nd trip'.\n\n...but these really disappointed me a lot:\nSamosas - they weren't that warm and were hard as rocks - like they were fried a week ago, sat out all night and served today.  I was afraid that I was gonna lose a tooth! \n\nLamb Masala - the dish was fairly good but it was mostly gravy and very very few pieces of lamb for the size of the dish that was brought out.  Was I paying for the sauce and was the meat a 'garnish'?!\n\nMaybe this place is empty for a reason.", "author": "Emy B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-07-16", "description": "This place is great and cheap, their naan orders are large and their samosas are fantastic (some of the best I've had in the city).\n\nAlways do late night take out and it never takes more than 10-15 minutes (naan can get a bit soggy). Really fast and friendly service, but their dishes aren't the best out there.. but nothing to be overly disappointed about. Usually get the mixed veggie masala or the eggplant and potato dish, both are decent, but not outstanding.\n\nI'd recommend this place for after 9PM takeout, one of the better options in the Inner Richmond.", "author": "Ninja R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-18", "description": "Excellent, Flavorful food and extremely fresh and fast delivery", "author": "Zhang W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-15", "description": "Family owned place, great food, cheap lunch buffet. Never crowded and the staff is friendly.", "author": "Carlo M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-24", "description": "I ordered from Great India for a second time on a Wednesday night and from boring tomato based dum aloo, half raw samosas, and a VERY awkward/sketchy delivery guy who was 30 minute late, I thought I'd have to swear Great India off forever. \n\nBut oh Great India, thou hath redeemed thyself this Friday evening with thy powerful coconut veggie curry. (delivery came in a quick 30 minutes!) \n\nI'd like to go ahead and request two orders of spicy coconut veggie curry everyday for the rest of my life. Seriously. I'm almost afraid to tell you how amazing it is in fear that they'll sell out or diminish the quality. It is hands down the tastiest thing I have ever had in my life, ever. Sweet, spicy, rich, orange curry with melt in your mouth veggies, topped with shredded coconut. Yep, that's all I need ever again from Great India. Two orders and some naan please. \n\nHowever, I didn't predict just how fantastic the coconut curry would be so I also enjoyed an order of their veggie dahl which was the very best I've had from them and I was extremely impressed, as well as two of the most perfect, hot, crispy, flavorful potato samosa. \n\nI love you Great India. Never let me down again! I am officially addicted to your cococurry veggies. I can't wait to put my mouth around you soon. Love, me.", "author": "Libra J."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-10-10", "description": "Do yourself a favor and go to Star India on the same stretch of Geary instead. This place is horrible.\n\nThere were very few options at the buffet. None of them were particularly tasty. Everything I ate was bland, overcooked, and strangely flavored. My friend and I didn't know if our meal came with naan because it wasn't at the buffet. It wasn't until we finished our first plate that someone brought us bread. I didn't want another round by that point. I tasted the naan and it was awful.\n\nIt was dead quiet except for the bizarre clash between Indian music and Eminem coming from the kitchen. They were at the same volume. The waiters hid behind a wall, waiting for someone to [intentionally or accidentally] make eye contact with them before running to their service. I felt bad for them.\n\nEven the rice pudding sucked. This meal was so depressing. Never ever again. You couldn't pay me to eat here.", "author": "Sterling D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-03-22", "description": "I ordered food from here via GrubHub.. at 930 PM. I'm writing this at 11:09 PM after calling to find out where my food was, only to find out they had just closed. Great. So, they take (and confirm!) my order, an hour before  they close.. and they can't make it to my house or at least call?! Had to call GrubHub to get my money back.\n\nTotally unacceptable. I was craving this place, too.", "author": "Kelley V."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-08-03", "description": "I love good Indian food. I've explored the shadiest parts of Oakland, risking my life, for the culinary thrill of authentic flavor. I'm sure at least two of my favorite spots in Berkeley were in violation of at least a dozen health codes, but damn tasty. The trendy spots are often great as well.\n\nThat said, there's nothing great about Great India. Delivery is better quality than their lunch buffet, but only because the lunch service is so sad. Everything is mediocre or inedible. You'll do better anywhere else, unless you are thoroughly unaccustomed to Indian cuisine. The best item is the overpriced naan, but only when it's not served nearly stale. How on Earth does it get such high ratings? God, I hate this place.", "author": "Paul C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-28", "description": "The Samosas are so fantastic here! YUMMM. They have all the wonderful sauces and chutneys that I love too!! \n\nThe saffron rice was a favorite amongst my friends as well as the Chicken Tikka Masala.  I ordered a lamb dish (I have forgotten the name :( ) that was tasty and the lamb was fairly tender (something I have had trouble finding at Indian restaurants recently).  \n\nThe staff was very nice and refilled our water promptly (I LOVE THAT). \n\nI saw the sign out front for their lunch buffet, so I must return to give that a try!", "author": "Jessyca M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-10-06", "description": "Great India's Chicken Tikka Masala was pretty darn good, and the naan with the dipping sauces?  Yum.\n\nWe were the only ones dining in on a Wednesday early evening, which was a bit creepy.  A few people wandered in for pick-up orders, but nobody stuck around for long.  \n\nIt's not that the place is horrible to sit in, not at all!  Maybe they try too hard w the formal place settings, stiff service.  Maybe it's a bit much for the Outer Avenues where working stiffs really just want some tasty food at a fair price.  Maybe I don't know wtf I'm talking about bc I'm not in the restaurant business... \n\nBut yeah, nobody around for miles.  Which makes the scowl we got when we asked for a few more pieces of the complimentary flatbread very confusing.  Seriously, a scowl when there's nobody else to eat it as far as the eye can see.", "author": "Meg W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-11", "description": "Great India Restaurant is always great...The service is good...And pleasant...Food is delicious...I ever prefer this restaurant  for parties and family dinner....", "author": "Nagabhushanam S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-03-26", "description": "Mixed experience. I walked into the place this afternoon and I came in to see 3 people, maybe employees staring at me like I just walked in on them having sex or something. Total dear in the head lights look with no greeting at all. I had to ask if they were open and finally the waiter seated me. I ordered the chicken curry with kema naan. The food came and it was ok. Nothing really outstanding. The chicken was cooked well but the sauce was kinda bland. The naan was good. But the second the waiter handed me the check I saw a F***ing roach on the table. So gnarly after a full belly to see that. I love Indian food but I won't lower myself to the roach restaurant ever again!", "author": "Phil D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-07", "description": "Best place to enjoy Indian food and tried paneer tikka masala ,lamb biryani and garlic nan its tastes very good and I enjoyed with people serving over here they treat customers very pleasent and polite finally if we try once sure we can get in again.", "author": "Harish V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-09-27", "description": "We've been ordering delivery from this place for a few years now.  They always quote 45 minutes to 1 hour for delivery....and the food always gets here in under 30 minutes.\n\nIt's piping hot, the food is delicious and consistent, the prices are fair, and they've always gotten my order right.  When I dine in, the service is very friendly.  \n\nWe will likely continue to order delivery from this place.  I also love their buffet.  They have both gulab jamun AND kheer, which my fat @$$ likes to mix together into a harmonious blend.  Mmmm.", "author": "Dwigt S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-03", "description": "This place's quality isn't the greatest, but its lower cost and pre-3 PM buffet options make it a good spot for lunch or the weekend. It definitely aims for a more casual environment than the fancier place a block over, and is actually a pretty good workspace when not crowded.\n\nFor just $10, the buffet food is pretty great. There's plenty of variety and lots of vegetarian options, though you'll need to limit your expectations for mass-produced buffet style. I've only eaten the non-buffet once, and it was better quality than the buffet.\n\nOverall, I would definitely recommend this place if you're going for a casual atmosphere or variety, and especially if you love buffets.", "author": "Ned D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-20", "description": "Awesome $10 lunch buffet with a lot of options and tasty curries. It's also a plus that they serve you fresh naan at your table instead of leaving them on a buffet tray to get soggy. They even have really tasty rice pudding and gulab jamun (cheese dough balls in syrup) for dessert.\n\nFor delivery, I always order the tikka masala since their recipe is really good and buttery. I'd stick with rice though since the naan gets too soggy in transit. \n\nFavorites: Chicken/paneer tikka masala, saag paneer, vegetable pakora, tamarind sauce, mint chutney, rice pudding, gulab jamun, mango lassi", "author": "Kai C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-15", "description": "Oddly enough, our night was centered around comedy night at RockIt Room, even though it's one of the worst comedy shows I've ever seen.  Hey, it was a Tuesday night, and we wanted something entertaining to do. \n \nIn search of Indian food, we consulted Yelp, and the only place we could find along the 38 line in the general vicinity of our destination was Great India.  It was only 3.5 stars, so I was a little nervous.  Even more nervous when we walked in, and there wasn't a customer in sight.  I attributed it to the location - it's way the f--- out there.\n \nGlad we risked it; everything was actually pretty great (between 3.5 and 4 stars, but I'm rounding up).  I ordered a Bud Light, and it was only $2.75.  Sister ordered a mango juice, and it was delish - pure fresh mango.  Next, they brought us out that flat, cracker like \"bread.\" (no, I'm not talking about naan).  With that came four dipping sauces ' chutneys, all perfect complements to each other - two spicy, two sweet, all very tasty.\n \nWe ordered a naan that I'd never heard of - cherry, cinnamon, and some other sweetness.  We were feeling adventurous!  As far as naan goes, it was good, and a little different in texture than what's normal (at least in my naan world).  I'm used to naan being soft and stretchy, but it was kind of crispy / flaky on the outside, and soft (and sweet) on the inside.  \n \nThe main entrees - I had the paneer tikka masala (cheese with masala sauce) - again, between 3.5 and 4 stars.  Very good, especially when I dipped the naan in it.  My sister had the mushroom korma, and that too was delightful.  We couldn't decide whose we liked more, and considered trading...but then she got cold feet and changed her mind.\n \nDefinitely a solid choice if you're ever craving Indian and are spending your evening in the Richmond area.", "author": "Ashley M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-15", "description": "The best food in san francisco I went today great India restaurant ..the buffet is very nice..so many food items there..l like naan,tandoori chicken, chicken ticka masala,many vegetable curry's ..is really excellent.....the staff is very nice. Service is excellent. Come back soon.", "author": "Ajay K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-27", "description": "I have been really let down recently by my attempts to find good indian food.  I was a bit reluctant to try Great India, thinking it would be just like the others I had recently been dissapointed by.  However, I was suprised to find that this place got it right!  Mattar Paneer and Saag Paneer were both perfectly spiced and not super greasy.  The Mango Lassi was delicious as well.  The woman inside was very kind and I will definitley be going back!", "author": "Chelsey G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-26", "description": "Fastest delivery I've ever seen. I think it was 18 minutes from the time we called to our door bell ringing - and this on a rainy night. The food is good. I'm not sure it's the best we've had in the city. The chicken tikka masala has a lot more tomato than we're used to but we will order from them again", "author": "Denise G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-08-20", "description": "I used to live in the Inner Richmond and always missed this place. I still see friends who live over there and ordered there last week.\n\nPlaced an order for delivery and when they showed up they had mixed up my order. I had wanted chicken saag and they gave me a chicken salad (with ICEBERG lettuce mind you); i called and asked them to fix their mistake and instead of apologizing and fixing their mix up, they ask me to pay for the $6 difference! I was completed appalled. I had worked a very long day and just wanted some food and relaxation and instead I am on the phone for 10 minutes arguing about customer service!\n\nI was not about to pay for their mistake when my friend (who is a man) gets on the phone and they instantly fix the situation. \nI was/am/will always be livid. \n\nI was not taken seriously over the phone as a woman and then when all of this was finally over; the food was not good at all. \n\nI don't know if my taste buds have changed or if their food has just gone down hill rapidly, but i think as far as Indian take out goes, i will stick to Spicy Bite!", "author": "Susanna B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-01-30", "description": "Came home to a takeout menu attached to my door and decided to get delivery from here Sunday night.  (See, those really do work sometimes!  LOL!)  Delivery was pretty fast.  I got the Lamb Somosas which were not that great.  The dough was a little too hard.  They weren't over fried by any means, so I think it was just their recipe.  The lamb was also ground up a little too much and dry.  The Chicken Vindaloo was yummy!  For once, the chicken wasn't overcooked and it was actually spicy, but not too much!  The Lamb Korma left a little to be desired.  I'm not sure if the spiciness of the chicken made the lamb bland, but the tastes were a little uneventful.  Overall, it was a good experience.  Would definitely check out more dishes on the menu next time.", "author": "Elena N."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-08-15", "description": "Came here on a Saturday during lunch for the $9.95 buffet because of the close proximity to Bakers Beach.  We wanted to take the kiddies to the beach after lunch.  There was only 2 other patrons in the entire restaurant.  I see why it was so empty.   \n\nPros: \n-Can't beat the price.  My 5 year old niece and 2 year old nephew ate for free.  \n-Chicken masala was yummy! \n-Fresh Naan plopped on the table for you. \n-Chicken tandoori was good.  \n-The curry dishes were tasty, not too spicy, and did not feel very heavy.  You expect fattier, heavy-on-the-cream dishes to meet the palates of Westerners...but this place stayed true to the home-cooked style of the dish.  \n\nCons:\n-Only about 8 selections in the buffet.  Boooo!! \n-Gulab Jaman (dessert shaped in a ball) was a bit dry. Nice rose fragrant, but I've had better.  \n-No samosas in the buffet.  Booo!  \n-No lamb dishes available.  \n-No biryani or vindaloo available.  \n-True to the SF way, terrible parking. \n\nI wish they had more selection in the buffet.  Been to a lot better buffets for about the same price or even cheaper in Cerritos (down near Los Angeles) and it was 10x better with 3x the selection.  So sorry, but you won't be seeing my face ever again.", "author": "Jacky F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-03-29", "description": "I like their chicken tiki masala and garlic naan. The mango lassi was alright too. I found the lamb vindaloo to be ok and they are quite spicy so indicate if you want it to mild.", "author": "Jennie W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-12", "description": "Fantastic delivery spot when you have that special craving. Love the saag paneer and garlic naan.", "author": "Sean D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-09-09", "description": "This restaurant is a RIP OFF SCAM joint.  When I ordered a tandoori mixed grill for delivery, they left out some items.  When I called to complain, they said that they would give me more NEXT time I ordered.  \n\nSo if you are a little short on cash when you order delivery--no problem.  Just tell them that you will pay them a little more NEXT time you order delivery.  Unbelievable.", "author": "Zak W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-13", "description": "Good service.  Reasonable food that was a bit bland.  Not that it didn't have heat but the flavor wasn't there compared with the Indian food we are used to.\n\nWe had the curry chicken and chicken courma.  Normally curry chicken has a stronger curry taste and we normally have cashews in the chicken courma.\n\nAgain a nice little restaurant with reasonable prices bit nothing special.", "author": "Erik R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-15", "description": "This is my favorite place to order Indian delivery from. I'm a huge fan of the chicken tikka masala, saag paneer, naan, papadum pretty much everything is delicious. It always comes hot and pretty quick.", "author": "Michael S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-05-31", "description": "Tuesday, 7:30 pm, May 31st. I hope this place lost its chef recently, because if they didn't, they should. The food was -so- bad that I resented the effort necessary to throw it away!\n\nI ordered take out from a menu that a (cough) friend left here.\n\nThis is the worst take-out (of any kind) I have ever had. It tastes like Chef Boy-r-dee was let loose in a kitchen without enough spices.\n\nI have to literally throw the whole dinner away. It may be some of the worst food I have ever tasted.\n\nThe vindaloo, which I was really looking forward to, is rubbery, and uncooked. The sauce tastes like... tomato soup with some spice added? It's hideously bad. It's almost so bad that it transcends itself and becomes good by being as bad as possible.\n\nThe navritan korma is watery and tasteless. The rice was ok. The mango lassi was good. The dinner was ... like an insult slung at me from strangers from afar. A complete waste of an evening and ~$33.00, tip inc.", "author": "Tarm Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-10-19", "description": "I was having one of those lazy days where I didn't want to leave the house. I was craving Indian food so I did what I regularly do, I yelped for Indian: Delivery in my area.\n\nI skimmed through a few and discovered this place. I've probably passed by this place a million times too.\n\nI ordered the Chicken Vindaloo. It was really good. A little spicy but still good. I was really surprised how good it was. I wasn't expecting much since I saw a 3.5 star rating and they deliver. Most delivery restaurants aren't usually very good but this place was. I also ordered 2 garlic naan. Usually when I order 2 garlic naans they are usually about the size of a small personal pizza. This place makes it big. It was like a medium size pizza. So I had an abundance of garlic naan. I have to say it was really good. Most places don't put enough garlic. This place use a lot which I like. \n\nThey also automatically give you 3 sauces. They were good. I like the red one with onions in there. It's sweet and spicy and good with the naan bread. \n\nOh, I would like to also mention the nice Asian delivery guy. Super polite and nice. It's nice to see a clean cut looking delivery guy. (you know the typical delivery guy is usually not the cleanest looking guy...no offense...).\n\nI was going to give a 4 star rating but when I think about it there wasn't anything I could ding them for. The delivery was delivered in about 35 minutes like they said, delivery person was nice and friendly, food was good + unexpected 3 sauces. Reasonably priced for a delivery meal ($19 + $2 tip). Chicken Vindaloo, 2 garlic Naan, and rice.", "author": "Karen L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-29", "description": "Good food.  I could have had our food more spicy but in our group of six, half of us wouldn't have eaten because they can't eat spicy stuff.  If I'm coming here with a different crowd next time, I'll remember to ask them to spice it up!  \n\nIt seems like this place does a lot of take out orders. They also get the tour bus crowd too.  Not too many people eat-in so we didn't have to wait for a table.  FYI - we got there about 7pm on a Sunday night and left at about 8:30pm.\n\nOh yes, the waiter wasn't pushy about getting different things but he did try to slip in suggestions.  I appreciate that.", "author": "STEVE L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-04", "description": "Great indian buffet, many selections. However, they are not getting 5-star is because they stopped refilling the buffet when we came 30 minutes before closing. We saw a couple clients left because of that. Bad business tactic.", "author": "May M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-02-23", "description": "You've got to try the Chicken Tikki Marsala, Chicken Tikki Marsala,  Chicken Tikki Marsala, Chicken Tikki Marsala, Chicken Tikki Marsala, Chicken Tikki Marsala, Chicken Tikki Marsala, Chicken Tikki Marsala, Chicken Tikki Marsala, Chicken Tikki Marsala, \n\nand um....................................................................................................................... .........................................................................................................................................................................................................................................................................\nthe Chicken Tikki Marsala.\n\nBest Chicken Tikki Marsala hands down!\n\nThe only bad thing about this place is the price. It' pretty expensive but the taste and the quality of the food makes up for it.", "author": "Sotheara Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-31", "description": "Naysayers be damned. I live around the corner from this place and walking distance from India Clay Oven and I really like both places. Yes, the latter is infamous for being one of the best in the city and is a lot better, but when I want a quick dinner I can always count on Great India to whip up something for me fast. \n\nIt's a good price-I've never gotten as much boti kabab for the going rate as I have here, the food is reasonably good-i have to admit that the samosas one of my favorites and I've never had that post-meal tummy trouble that you sometimes get from bad Indian food. But above all they are so nice and sweet to their customers and sometimes that can really change an average restaurant into a place that makes you want to come back again and again.\n\nIt does make me sad that it's never bustling but it sounds like their buffet is what keeps them open but I haven't given up on them yet.", "author": "Wendolyn A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-04-15", "description": "Have you ever been so hungry that you are ready to eat your left arm...but can't decide on what to order for food? That was me tonight. I flipped through my Rolodex of delivery menus and simply couldn't' figure out what I wanted. I craved Indian..but after my previous experience at Pakwan..I decided to try something different. \nI saw the menu for Great India and gave them a call. Of course, I kicked myself after I realized how far they were from me relative to the 10 other Indian places I could have ordered from.\nTo my surprise, my dinner showed up 25 min after my call. \nEven better, their food was pretty decent, too. The tandoori chicken was yum..with fresh cucumbers and peppers. The Saag Paneer was neither greasy nor creamy...a bit refreshing. \nThey also give you sides of nan, rice, and this spicy onion sauce...all for under $20.", "author": "Mimi T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-01-10", "description": "I liked going here, when I lived on 25th...so it was close for me.  I don't go out of my way to go here now, because of the parking.  Plus, I know closer places than this one.  \n\nNonetheless...\n\nI always ordered take-out, and would go to their lunch buffet once in a while.  It was an easy walk for pick up and had it in the comfort of my own home.  Good food, not too greasy, and spicy enough.  And portions were great. \n\nFriendly service, family owned, ya can tell.\nParking is a pain, no surprise here.", "author": "Fannie S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-29", "description": "The food here is decent. I wouldn't say wonderful, because I've had some damn good Indian food. However, they were very accommodating to our group, which gives them an extra star. \n\nWe had A BUNCH of dishes, but here's what I'll mention:\nKeema Naan-not very good, stick to the normal stuff (regular naan or garlic)\nButter Chicken-Yum!\nChicken Tikka Masala-Pretty good, but could be spicier. Maybe because we had a lot of white folks at the table, they figured we couldn't handle it?\nSamosas-These were pretty damn good and big (2 per order) I'd order these again for sure.\nShrimp Biryani- Meh, mediocre. I'll pass on this dish next time.\nLamb Vindaloo-Good but needed to be spicier.\n\nMy advice is that if you like your Indian dishes semi-spicy, make sure that you tell them that. I'll probably come back and see what their buffet is like.", "author": "Zoeboe D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-12-24", "description": "The restaurant itself looks kinda shabby, but you can't beat the price and quality of food at Great India.  \n\nSince it was our first time eating Indian food, my friends and I ordered a TON of food - they could barely fit all the plates onto our tiny table!  Some of the dishes looked a little intimidating (steaming globs of green stuff??), but it all tasted awesome.  Every dish comes with either a HUGE bowl of rice or a ton of naan - you'll definitely have leftovers to bring home if you dine in.  We didn't realize how much food we would be getting with our main dishes, so we ordered a bread basket along with all our other food and ended up with mountains of naan on our table.  All the different varieties of naan in the bread basket were delicious, so no complaints there!  \n\nEven after eating a huge Indian feast and bringing home boxes stuffed with yummy leftovers, we only paid about $13 each.  We did leave the restaurant with our clothes smelling like Indian food (we sat near the kitchen), but for great Indian food at an affordable price, I definitely don't mind.", "author": "Karen L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-09-07", "description": "Food tasted good before the real chef left for whatever reason. Now, I don't see much people who dine at this restaurant like before. I once had food delivered very long, inspite that the restaurant is few blocks away. They said couldn't find the place, ridiculous!!!!  It's been a while now I didn't step into this place. I noticed this restaurant has upgraded their look. Don't know about the food though.", "author": "Ogen D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-05-13", "description": "Alright time for a review makeover.\n\nSo I happened upon this restaurant again with my current roommate/tall white male/best friend and boyfriend/short indian male/best friend. The first time I went with past roommate/best friend.\n\nSo, we go to Great India\nA) because it's closet to 45th Avenue (where me and the roommate listed above reside) and\nB) wasn't Star India\n\nStar India is great, but I \nA) get tired of going to the same place and\nB) actually think Great India might be a scosh better than Star India!\n\nSo we get there for lunch buffet and gather up a pile of scrumptious masala dishes, samosas, chutney, tandoori chicken and the like.\n\nIt was fabulous. Well, fabulous for Indian food on Geary.\n\nIf you want some seriously awesome Pakistani go to Lahore Karahi. You won't leave unsatisfied.", "author": "Jennifer P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-02-08", "description": "Tasty, not hasty\nfriendly and papadums!\nYummy chana masala\nand smoky tikka\nnaan pretty good, but pratha\nwell the pratha is for celebrating\nMy picky daughter loved the aloo gobi\n(not too spicy)\nI've loved a coconut curry a couple of times here, so wow\nWe're lucky to live nearby\n(and how!)", "author": "Liz B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-04-16", "description": "INDIAN LUNCH BUFFET.\nWho doesn't love a good lunch buffet? Tikka masala, tandoori chicken, saag, tamarind chutney, birani, and all sorts of things I don't know the names of...or actually what's in them but it tastes SOOOO good.\n\nThe lunch buffet is usually quiet here, but damn! it's not bad. I've had cheaper deals but damn! This was pretty tasty.", "author": "Lauren S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-11-07", "description": "REVIEW FOR DELIVERY ONLY:\n\nWe ordered food here last Tuesday (we were packing some stuff from sis's place) and so this was the closest to their place. The boy ordered the regular: chicken tikka masala, chicken tandoori, rice, and 2 naan. It arrived well under their 45 min quote. Total was around $35.\n\nThe boy inhaled the food...while I was able to cherish it...well I tried. The masala was really spicy so my mouth was burning but the naan was good as well as the rice. \n\nFor the price and the efficiency, well worth it. No complaints on the spiciness of the food...I'm used to it...some makes it \"tolerable\" spicy for me, others...not so much.", "author": "Cath M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-07-12", "description": "Went here twice in the last month for the lunch buffet; the food quality has suffered. 2 stars max.\nThe tandoor chicken tasted stale, it looked reheated a few times. I ordered the mango juice and it tasted diluted down and watery. Bleh.\nI won't go here again. There are better choices. The last time I ate here was 3 months and the food was just as poor. What happened?", "author": "Bert K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-24", "description": "I ordered pratha bread made with whole wheat. ... and dal soup the bread was so oooh authentic made by artisan hands. .... took me back to India. ... the old man chef is the real deal .... even though the waiters don't seem to respond to English !", "author": "Allan Ajaya D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-05", "description": "I just started doing reviews, and I just had to write one for Great India. I have been coming here with my highschool friends for years. The atmosphere is fun. It's got a relaxed, local feel, and the food is divine. When I come back to San Fran from college, this will be a must.", "author": "Lisa T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-09-27", "description": "I'm WAAAAY downgrading. Although they now answer the phone and take your order immediately, without a wait or a call-back, don't get too excited. There's a reason they're not so overwhelmed with patrons these days and it has little to do with the sour economic climate. (Sour economic climate? What? Where? I forgot...this is SF). \n\nThey now charge MORE for LESS and the quality of the food has suffered. Before, the real draw for take out was that you got free rice or naan with each entree/curry. This is no longer the case. I am cheap. I am jewish. It is Yom Kippur. I'd like to keep in line with some tradition even if boy and I chose to stay home with friends' kids and eat Indian instead of go to temple and atone for our insurmountable mess of sins accumulated over the last year. So there.\n\nI'll give them this: for around $50, we got three curries, naan, rice, pakora, and samosa but the serving sizes have declined (I'm not fasting- I already told you- I'm a bad person), the saag paneer was more goo than saag or paneer, the Chicken Tikka Masala was tasty but basically consisted of chicken in masala water (I like my sauces thick), and there were about 10 small fritters of pakora. The Samosas and Aloo Ghobi were well worth the two stars above and the swift delivery and improved ordering system get them a reluctant third star. \n\nI'm not over Great India, I just don't think they're as great as they were a couple of years ago. But then again, I'm not either. Great India, let's both of us go to temple together tomorrow, atone the hell out of our sins, and then share some war stories over mountains of your old delicious menu items. My treat.", "author": "Autumn K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-04-06", "description": "This used to be my go-to place for lunch when the craving for Indian food struck. The combination of excellent food and affordable price was just unbeatable.\n\nUnfortunately as of last fall their \"award winning chef from India\" left on some sort of trip, supposedly to return in mid January. I know this because my Indian friend had a chat and passed the info on to me, but it was sadly apparent by the sharp decline in the quality of the food. The rice was yellow and oily, tikka masala was bland and watery, the palak and aloo dishes could pass as the same thing to a blind person. Abysmally disappointing.\n\nI've been back several times since the expected return of their chef, but the food is only marginally better. Maybe they are cutting costs and reducing the key ingredients, or maybe their apprentice is getting the hang of things, but they still have a long way to go before matching Great India's prior excellence.\n\nBottom line: 2.5 stars (rounded up). I just cannot recommend it as strongly as before; it's passable at best. Service is still ok, but nobody really speaks English beyond what is printed on the menus, so trying to get more info or assess the dining situation is practically impossible. I've found a couple much more consistently better places to take my cravings; you can too.", "author": "Aaron H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-02-12", "description": "More than 30 minutes late and worse than mediocre.  \n\nThe naan is tough and super chewy in a not-delicious way--probably left over from lunch.\n\nThe vegetable masala had no sauce.  Zero sauce.  It was clear none of the vegetables had been cooked in a sauce.  You could see once you bit into a piece of potato that they were barely tinged on the outside with any spices.  The vegetables looked like they'd been rubbed in a pan that had once cooked something using spices or a sauce.\n\nThe palak paneer/saag paneer wasn't too bad--but it's definitely not worth ordering there again.", "author": "Lauren C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-11-01", "description": "I am perplexed to see the bad reviews...I have been many times over the last 6-8 months..Every experience has been glowing. In fact, I think Great India is one of my favourite Indian restaurants in the entire Bay Area..and I eat a lot of Indian food.\n\nMaybe they have different chefs..I always come in the later evening and am never ambushed by \"chef boyardee tomato sauce\" or \"forzen peas\" like the others have. The chutneys are good, the roti and naans are always good, very warm and soft. All of the entrees that I have had have been delicious, various korma and other north indian staples..\n\nI've never been during daylight hours, I've been meaning to go to the lunch buffet. I'll do a review update once I do!", "author": "Paul M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-12-26", "description": "We ordered take out on a week night and all of us were very happy with our meal.  \n\nChicken tikka masala (lots of pieces of chicken)\nLamb korma \nChicken kebab\nPrawn coconut\nPrawn korma (my dish - it was fabulous with many prawns)\n3 orders rice\n2 orders naan\n\nI've accepted that San Francisco Indian restaurants don't include rice or naan with entrees but I don't like it.  \n\nTotal was around $72 (minus $4 for mentioning a coupon) with tax.  With tip and delivery was $80.  They said would be here in 45 minutes but I think it was closer to 40.  Very nice guy on the phone.  \n\nI forgot to ask for medium spiciness in the dishes, so only the lamb korma was medium spicy.  \n\nAll four of us agreed we will get delivery from here again.  My husband wasn't too thrilled with our go-to place, Star India, even though it's much closer.  But then again, we can't tell one decent Indian restaurant from another, but the guy on the phone was nice, my in-laws enjoyed the food, so that's all that matters.\n\nJust an aside: I've never had buffet lunch or dinner at Indian restaurants.  But even if I did, I wouldn't expect too much for $8.99 or whatever low price they're charging, so I don't know why people get their panties all up in a bunch when they complain there's not enough meat or the sauce is watery, etc.  Buffets mean low expectations.  It's something you learn early on in life, no?  I did.  =P", "author": "Mrs F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-11", "description": "Delicious! Affordable! And they are really sweet. Perfect for those days you don't feel like cooking.\n\nTip: chicken tikka masala & garlic nan.", "author": "Stine M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-06-02", "description": "More expensive than Star India but a bit better.\n\nTheir korma is super nutty - its great!", "author": "Jessica L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-08", "description": "Fast, efficient online ordering.  The saag paneer was very tasty with tons of paneer, the most I've ever seen.  The baingan bharta, one of my favorites wasn't too oily.  Coworkers really liked chicken tikka masala which I didn't have too much of.  Perfectly cooked basmati rice topped off an pretty darn good meal.  Oh, and I don't want to omit the massive samosas they have!", "author": "Rosalind S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-03-14", "description": "The food is mediocre. I have had much better curry in the city. Portions are tiny and way overpriced. \n\nThat being said when the food arrived part of our order was wrong so we called the restaurant and they told us we could have a credit for next time. We told them we preferred if they could just send us what we ordered (and already paid for.) A few minutes later they called back and said that none of the drivers wanted to drive back to our apartment because they were across the city and they told us we could have a credit for our next order, as if we would order from them again after this experience. \n\nLuckily we called grubhub, where we placed the order, and they refunded our money for the wrong dishes with no problem. However, I still have no dinner.", "author": "Petra C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-11-04", "description": "I went here because I had a coupon & I'm really glad I did. Called in for takeout after work (physician at the VA). They have wonderful vegetarian options. Here's what I ordered:\n\n- samosas: really yummy, fried (as usual) but great potato & peas filling that was pleasantly seasoned and not overly puréed\n- naan (regular): large serving, very good quality\n- chicken vindaloo: what set this apart was that you could see the individual ingredients & that it wasn't oily. Not as spicy as I would like it (but nobody delivers the heat I crave), but healthy, well-made and satisfying. A superb chicken vindaloo.\n\nOverall, I will certainly return for the warm smiles, healthy food & vegetarian options.", "author": "C G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-28", "description": "It was ok i eat much cause the doctor show me my blood test and  had high cholesterols.  I ate the tandoori chicken and  chicken tiki masala which had good sauce.  The tandoori chicken was dry maybe they should use a lid instead of foil to cover it up.  I ate the salad and they did slice a rip water melon, which i ate like 2 cup full.  It was good.", "author": "John F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-05-30", "description": "I had put off my Indian craving for weeks because none of my friends would go with me, so I ended up grabbing takeout to satiate my desires! \nI ordered chicken tikka, chana saag, onion naan, and two orders of rice. \nEverything was super hot and tasty! The sauce was thick and creamy, the chunks of white meat chicken was tender with the tandoori kissed flavor, and the chana saag was rich and filling for a vegetarian dish. The only thing that was mildly dissapointing was the naan. It was only ok. It was a bit too thick and there weren't any yummy thin crispy edges. \nI go on Indian food binges every so often and I am glad this place is right around the corner and cheaper than Indian Clay Oven. \nThe mom and pop feel made me feel like I was part of the family!", "author": "Stacy T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-01-20", "description": "My delivery order was an hour and a half late.\n\nIt took 2.5 hours to get here after I placed the order.  I spoke to the manager... he didn't give me a refund or an apology.  Awful.\nTHEN, found a long, thick hair in my food.  :((((((  Depressing.", "author": "R. R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-06-09", "description": "Great India is my favourite place to get Indian Delivery, as not all places deliver (*shakes fist @ Shalimar*) and don't always have my favourites like Biryani\n\nFirst of all they're open till 10:30pm on weeknights and are fast (under 45 minutes) considering they're deep in the Richmond and I live in the TenderNob(tm).\n\nMy favourites are dishes they always do right: Chicken Tikka Masala, Lamb Biryani. I usually top those off with Kashmiri Naan. This is your standard Naan but stuffed with finely ground nuts (almonds, cashews) and dried/candied cherries, just a tad sweet.\n\n4 Stars!!", "author": "I. O."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-08-16", "description": "I'd say this is 2.5 stars, really.\n\nIt's always kind of strange to eat in an almost entirely empty restaurant, but I don't really hold that against them. The food came out frighteningly fast, so maybe they just aim to get people in and out as quickly as possible? \n\nWe ordered the saag paneer, garlic naan, and veggie biryani. Pretty simple. The saag paneer was quite good and the naan was fine, but the biryani was extremely disappointing. It just tasted really tomato-ey, it was not spicy in the least, and there were no nuts to be found. If we'd not known what it was supposed to be, I don't think we could have guessed. \n\nPrices are pretty reasonable, but it would be nice to get rice with your (non-rice-based) entree. Service was fine--no complaints. I probably won't go again, as there are several other Indian places I like better.", "author": "Robyn M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-07", "description": "Ordered delivery and they were extremely prompt! I got the lamb rice and tandoori chicken and it was soooooo good! I ordered extra spicy and they mad it with full of flavor. I highly recommend this place. I reallllllllly enjoy Indian food and this place really satisfied my craving.", "author": "Trang N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-11-22", "description": "I always get the mist amazing food from this place, chicken biriyani, mango lassi, loving it! The best part is that they deliver! Yay!", "author": "Nadia I."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-02-09", "description": "So the bf and I were in the process of moving into the new apartment, staarrrvvvving, tired, cranky, and getting pissy with each from moving all day and needed a quick fix but weren't  up for driving out anywhere. We needed delivery. Great India was one of the first places that popped up in our search so we called put in our order and plopped on the couch. \n\nNo joke 15 minutes later, they were at our front door!! And they are at least 10 blocks away. With that in mind, we were a little skeptical about how good it would be, but were so very pleasantly surprised as everything we ordered was mmmm mmmmm GOOD!! We've ordered from Great India several times since, and every time, hot, delicious food at our door in 20 minutes (we time it everytime now) One of the best indian places, with lightning speed delivery, major plus.", "author": "Pauline T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-08-08", "description": "I can't comment on the food because I never got it. After being seated we were simply never asked what we wanted to eat so we got up and left 30mins later.", "author": "Ravi R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-03-20", "description": "It's a Saturday night and I'm sick with the flu, boo hoo. While I like my usual rotation of delivery options, I yearn for something new. I do a quick search on Yelp and Great India pops up, with rave reviews about their delivery. So I called myself...\n\nWow, yelpers know a good thing! The guy who answered the phone was polite and patient (I didn't have a menu to order from), despite a loud background that would indicate a busy dining-in crowd.\n\nI went with their chicken biryani, one of my favorites, and their version lived up to the standard. Naan was fresh and hot, while the roti was milky and cool, both perfect. \n\nI rounded out the order with some mattar paneer, and on the guy on the phone's recommendation, his personal favorite, the baigan bharta (eggplant). Both dishes were well spiced and fragrant, and nice compliments to the biryani rice.\n\nWhen he asked about payment, I asked if he preferred cash or credit. He replied politely, \"Sir, that is of course your choice, whatever pleases you more.\" Take that, Domino's!\n\nDespite being Saturday, the food arrived in under 45 minutes as promised, and the delivery person was really nice as well. If I had a regret, it's that I didn't get to order and try more. Next time, there's always next time.", "author": "Nish N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-08-16", "description": "Hot damn, ya'll! The past two weeks have been fantastic for my stomach and the dinner I just devoured from Great India put the icing on the cake. My biggest complaint with Indian food is how heavy it is and Great India solves that problem for me because they don't use ghee (clarified butter for you plebeians). The end result are dishes in which I can actually taste spices instead of 100% fat. Mushroom mattar is officially my new favorite thing to eat, ever. And and and the curries come WITH rice or naan! No more paying extra like a sucker. Marvelous!\r\n\r\nUpdate - Ordered Great India again last night and it was again, absolutely delisious. Wonderful tandoori chicken, nice sour raita, and really lovely buttery pratha. And TWO samosas for 2.99. Great India is absolutely the best delivery Indian there is in the city. I declare it, so it must be true.\r\n\r\nPS - You can order online via delivery dot com even if the site only lists it as a pick up option with your address. Simply order it for pick up and write \"deliver to (your address)\" on the notes. Voi-la! Had their chicken tikka last night and it was wonderful, not as creamy as other CTM's but with actual spice and a little bit of cilantro. I've also noticed that delivery comes really quickly if you order online, so go ahead and use that instead of calling.", "author": "Maria D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-10-10", "description": "If you've read any of my reviews I hope you understand I give my stars based on how a business compared to others in the same category. \n\nSometimes it might get really specific, like worst burrito between Guerrero and Mission and 16th and 25th street, or best Thai noodle dump open after 1am, or coldest beer on Van ness.\n\nWhat I just did is what we in the business call throat clearing or setting the stage.\n\nIs Great India the best Indian food I've ever had? Not by a stretch. It is however the best Indian lunch buffet I've ever visited. Which is not to be confused with the best Indian buffet I ever had, which was at the Rohet Fort outside of Jodhpur. \n\nWhat was great about that buffet was that we had the entire place all to ourselves. Out in the middle of nowhere, a Maharaji castle where Bruce Chatwin wrote the Songlines. When we got there the house band serenaded my French friends and I. Then a thunderstorm came and we jumped in the pool. Smart huh? Then we hit the buffet and there was this curry with the smallest whole eggplants you've ever seen.\n\nAnyway the grub at Great India isn't that good, but it was good enough to take me back to Rohet for 20 minutes, and it only cost 10 bucks.", "author": "Jason R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-12-22", "description": "I've gotten Great India delivered on several occasions because, well, who hasn't? I mean, I don't think there's a doorstep in San Francisco left unadorned by the Great India takeout menu. And it's decent stuff. Heads and shoulders (or should I say, naan and raita?) over Star India or India Palace for delivery food. \n\nEating in was a strange experience. Kind of like seeing someone in person for the first time who you've known only over the phone. (Actually, exactly like that.) Like your favorite customer service rep you have to call all the time at work. You start to develop a picture in your head of what they look like, how they dress, etc. Great India was a little frumpier than I expected, which was made more noticeable by the fact it was completely empty. To be fair, it was 9:30 on a quiet weekday evening. And, as you might expect, they appear to do a gangbusters takeout business, since while I was eating in I saw at least five white bags go out the door. \n\nBut it was nice to eat in. The service was adorable, the tandoori fish and chicken were both well-spiced and cooked through. (Nothing is worse than undercooked Tandoori. Well, maybe spoiled children in airports.) Chana masala was delightful; a rich, brown sauce like a vindaloo. Too often the chickpeas are weak, you know? Everything comes with rice or naan, so order a few entrees and you'll get a huge bowl of rice and plenty of non-oily bread. Which is an extremely good value but also total fucking torture if you're on a diet. \n\nAnyway, it was pleasant, and if I'm dining in the neighborhood again perhaps I'll eat in. Realistically, though, I will probably continue to order it in, because I am really lazy. Which is the reason I'm on a diet in the first place. So fuck it. I will walk the 2 miles to Great India when I want it. A NEW ME IN 2007, PEOPLE!!", "author": "Megan W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2005-12-17", "description": "I ate here today based on fellow vegan yelper alex f.'s recommendation and i have to say, alex.  thank you.  i would have your child if i wanted to bring a kid on to this crappy planet which i don't but you get the idea.  \r\n\r\nhot damn delicious vegan selections and i LOVE the no ghee (butter) thing...plus, the aloo paratha (delicious wheat potato onion bread) was the best i've ever had, vegan or not.  it's CHEAP too, $6.95 got me one LARGE dish that included rice or nan.  lots of places do not give you rice or nan with the dish, making you pay extra!  but not at great india!  holy crap, i'm loving this place!!!  plus, the buffet at $6.45 was super cheap and there were lots of veggie selections (all delicious!!!)  \r\n\r\nthis place gets an A++++++ WILL DO BUSINESS WITH AGAIN!!!!   \r\n\r\ni wonder if they deliver to the mission????  hmm.  will be calling first thing in morning to find out!\r\n\r\nokay.  delivery is slow as fuck.  they lose a star.  we've been waiting for over an hour and were told 35 minutes.  not cool!!!  i am drunk.  only losing a star though because g-d, this shit is good.", "author": "Laura B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-07-10", "description": "I may be missing a gall bladder but boy, do I love Indian food..\n\nFirst off, the food comes delivered in easy-to-store, reusable, clear plastic containers. How handy is that?\n\nThe food is tasty. If spicy food is not your style, Great India is happy to make it mild. I usually order the samosas, naan, rice, and coconut curry chicken. A great combination that doesn't feel greasy or make you run to the toilet.\n\nThis is my new favorite food delivery option. If you live in the Sunset and want Indian food, this is the place I would recommend", "author": "Kenneth J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-05-02", "description": "They seem to have slipped -- something has changed.\n\nI used be a regular takeout patron (Excellent Chicken Tikka Masala, Aloo Matter & samosas.) However, recently (in the last year or so) the entrees have changed. The curries seem watered down (and very concerning -- there seems to be less chicken in the Tikka Masala...!) \n\nStill reasonably good Indian take out, but not up to the high standard it used to be.", "author": "donal c."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-11-29", "description": "The restaurant was empty at lunch time on a saturday, i wonder how they stay in business.  While the food was good (i think all indian food are good), I'm not sure how fresh it was given there was no one else was in the restaurant!  I'll stick to Naan n Curry to get my indian fix next time.", "author": "Jessica N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-11-12", "description": "Delivered Indian food 7 days a week may just be my weakness. Their vegetarian menu was amazing. I don't know what the heck I was eating (my coworker ordered for us), but it was green, mushy, looked like barf, and was perhaps the most delicious thing I've ever had. Their onion naan was really good but it's healthy substitute, whole wheat naan, was bland and boring. Everything else tasted very fresh and authentic with just the right amount of spices. No complaints from the meat eaters either.\n\nLike always, our office ordered way too much for lunch and we had plenty of leftovers. I brought it home and ate Indian food for 3 days straight. Breakfast. Lunch. Dinner. Dessert. Second dinner. That's how good it was.", "author": "Michelle N."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-10-25", "description": "I had a craving for indian food and didn't want to go too far so I tried this place.  It was ok... the naan was good (hot and soft), but the bhindi masala was so drenched in onions and oil that i could hardly tell it was okra.  The lamb masala was tasty but nothing special and the coconut fish curry was weird... the curry didn't taste like curry and the fish tasted really fishy!  It's sufficient if you're desperate for indian food (but don't get the fish!)...\n\nThe people are nice though!", "author": "Neda B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-12-16", "description": "The food here is really good and since they dont cook with ghee there is no indian-food coma afterwards.  The prices are good ($7 after tax for buffet!), and the family that runs the place is really friendly.\n\nMinus one star because the veggie options on the buffet are limited.", "author": "Ali M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-10-19", "description": "I live just across the Richmond from this place, and despite having them deliver about once a week, I've never been to the restaurant itself.  But their delivery is so good, I'm comfortable with giving that my five stars.\n\nOf the five or six Indian places that will deliver here, this place stands way out in front as far as quality of the food.  Their lamb is always perfectly cooked, the tikka masala and the sag paneer are must-try.   It seems like you get a lot more food per order than from say, Natraj, and you get your choice of naan or rice with every entree.  And their special Naans are great, too.  Garlic naan...mmmm.\n\nIt's never greasy and it's never made me feel sick, but I guess it's the clarified butter that does that and they don't use it.  They always get the right amount of spice, where you can taste the flavors but the heat creeps up on you as you chow along, eventually giving you a sweat and then a nap.\n\nI'm waiting for an order right now.", "author": "Jimmy C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-07-10", "description": "Delivery time on a busy Saturday night was less than 15 minutes. \nThe food was perfect (had Saag Paneer, Garlic Naan, Veggie Samosas, and Veggie Masala), hot, and fresh.\nHighly recommend them, even if the price tag is a bit high, the portions and quality more than make up for it", "author": "James L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-03-30", "description": "I  avoid patronizing businesses that leave their marketing material on your door. Fortunately for me, my roomie and I found this gem before we got their pink pamphlet. (I'm saving all of the crap people leave on my car and on my doorstep. One day I'm going to drop it all off at the business that leaves the most! We'll see how they like it.) \n\nI like the Indian restaurants in the South Bay. There, you get pappadom, 2 kinds of dal, raita, rice, and naan. However, you can't beat delivery Indian food in SF. Delivery in Mountain View? Yeah right! \n\nGreat India's food is very good. Very decent proportions for the price. Their delivery times are about 30 minutes regardless of the time you call. I'm writing this while eating their chicken tika masala with rice and a side of naan and raita. Yum! Their samosas are good too. \n\nI didn't care for their flavored naans. But I like my bread white and plain.", "author": "Kevo M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-07-08", "description": "We've eaten here about 4 times.  The food is consistently good but also consistently salty.  We continue to order delivery, despite the heavy handedness on the salt.  It's that good.  The samosas are super tasty... well balanced, crispy on the outside and moist on the inside.  Not your average played out samosa.\n\nThose looking for an Indian food place that uses a wide assortment of spices and flavors, you've found it.   It's like a heavy metal drummer playing on your tongue.  Definitely not bland or boring but also not overdone.  \n\nEverything is good.  Oh so good.", "author": "Nada b."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-07-07", "description": "I've never actually stepped foot into this place, and have only experienced it delivered to my door. That said, the food alone is great. A little pricey, but I'm never disappointed. The delivery people.. that's another story.\n\nIt used to be delivered by some nice old guys, who were all smiles and prompt! But recently we've had this woman who will show up over half an hour late, and then get \"snappy\" if we don't tip her to her liking. The last time she delivered our food, it was once again late, and she forgot our beers. My boyfriend ran out to her car to ask for some cash back since we didn't get the beers, and she waved him away with her hand while she was talking on her cell phone. We couldn't get our money back, but another dude brought us beer and was very apologetic and awesome about it.\n\nI'm discouraged from getting delivery, but it's tasty as hell.", "author": "Serene L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-07-05", "description": "Lunch Buffet for under $7.00?!  SCORE!!\n\nMy friend \"Sarge\" and I have made this our traditional lunch spot.  He's normally a super picky eater and seems to favor his safe \"diner style\" dishes over any type of asian or ethnic food (ironic considering Sarge is Chinese).\n\nAt any rate, I told him that he wouldn't be disappointed in trying the food - even said I would buy just so I could broaden his horizons.  It was a hit!  The buffet allowed him to try a myriad of Indian dishes ( they seem to alternate the dishes they offer during their lunch buffet - which is nice!) and a few desserts.  All you can eat - and boy did he eat!!  \n\nFor $7.00, I looked like a friggin HERO!  Now Sarge wants to eat here all the time!\n\nI've been here for dinner as well, and haven't been disappointed.  The service has always been fast, but they're not always the most attentive.  Great prices on some pretty decent Indian grub!", "author": "Christy L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-01-21", "description": "Any plan involving rating Indian restaurants has to pass the \"will there be cilantro in the curry\" test - because I'm usually dining with a very picky person who shall remain nameless. Having to listen to complaints through the meal, it takes away from the ... je ne sais quoi, if you will, and makes the digestive process a little less enjoyable. So to make a long story short, I advocate for the Biryani.\n\nAnd I'm not disappointed at Great India. For one thing, the food arrives (delivered, courtesy of waiter.com) fairly quickly, and the portions are overly generous. I have a tough time plowing through the basmati with its complement of nuts and spices. I usually go with the lamb - tender and done to a turn. All is well and I'm in the process of giving this place four stars.\n\nMy companion on the other hand is severly displeased. Her bold font \"NO CILANTRO\" has been ignored and caused her to spend the first ten minutes fishing the offending leaves out of the curry (she got the chicken tikka masala) and when she takes the first bite with a handful of naan the salt content brings back memories of the dead sea. Duly she proceeds to complain and I'm less content with the meal.\n\nNow I should technically give them two stars, but I understand that all Indian food tends to have cilantro in it. Asking for no cilantro is like asking for no tortillas at a mexican place. It doesn't make sense, and one should know better. So I'll subtract a star for the saltiness of the CTM, but add one back for the internal smile I couldn't suppress.", "author": "Maxx L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-03-16", "description": "Despite living (literally) around the corner of Great India Restaurant, the bf and I decided to make our first time eating at this restaurant a delivery.  Despite our guilt for not wanting to walk the 1/2 block trek on a cold Saturday night, our laziness outweighed our embarassment and the following conversation ensued:\n\nMoi: Do you think we picked out enough food to not feel guilty about ordering from around the corner?\nThe bf: Yeah.  Just.. I dunno.  Pretend you don't realize they're around the corner.\nMoi: When do you think they'll realize the extent of our laziness?  As soon as I give them the address or by the time they leave the restaurant to deliver us our food?\n\nIt turns out they realized immediately and didn't seem to mind in the least.  The food was good, we tried the combo biryani (chicken and lamb), chicken tikka masala (the bf is hooked on this stuff), garlic naan, and lamb samosas.  \n\nThe chicken tikka masala was pretty good; not as great as the Indian restaurant my friend bartends at (the name of the restaurant escapes me, but I'll re-edit this post when I remember), but it was pretty darn good.  The chicken did not taste like it was overcooked -- which is one way for a restaurant to not go over well with me.  The naan was good, too.  It's hard to mess up naan, but when you do, it's disasterous.\n\nThe biryani was awesome.  Very spicy, very good.  And the portion was huuuuuge.  We had leftovers for quite awhile.  I am also addicted to the white sauce that comes with it (it tastes like cucumbers, with the consistency of something thinner than ranch dressing.. I have no idea what this is called).  \n\nIn order to beef up the order a little bit, I also ordered drinks.  I ordered the mango lassi and their chai tea.  I was interested in how they would deliver these drinks; the lassi was delivered in your standard fast food drink cup, the chai in a round to-go container.  Despite the odd packaging both drinks were very good.  They even included the sugar for my chai tea!!\n\nThe only major disappointment was the samosas which were literally STUFFED with lamb.  Practically no vegetables in it and the whole thing tasted d-r-y.  Ewww.", "author": "Dianne d."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-20", "description": "I've only had food delivered from here - the coconut chicken curry with garlic naan. Addicted. Greatly appreciated.", "author": "Angelic S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2005-10-23", "description": "HUGE EDIT: changed from 5 stars to 1 because...\n\nthis went from the best indian food in the city to the worst. all curries are bland. many previously vegan curries now have cream or butter in them. the pakora and samosas are gross. AVOID AT ALL COSTS.\n\n\n\noriginal review:\nI love Indian food.\nI have tried about 10 different Indian places in the city and Great India is by FAR the best.\n\nThey have the best service, the best prices, and definitely the best food.\n\nI do not have a single complaint about this restaurant.\n \nAlso they dont use ANY ghee (butter) in any of their food. It's not even in the kitchen. This is important to me because I am vegan.\nGo there now and support them! They deserve more business.\n\nUPDATE: In case it wasn't 100% certain that this place was the most amazing indian place in the city, they have INCREASED their portions. At first I thought it was a fluke, but now the past 4 times I have been there, I have gotten more food than I was getting 2 months ago. I have never left a restaurant so full in my life. wow.", "author": "Alex F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-01-04", "description": "Ordered delivery for dinner for three tonight: garlic naan, onion kulcha, chicken tikka masala, and lamb karahi - $45, including a $4.50 tip.  The food itself was hot and delicious (and they certainly honored my boyfriend's request when he asked for spicy - I gave up after a few bites when my nose started running).  The kulcha has the onions placed on top, with less black pepper than the kulcha I usually get at Indian restaurants.  My friend's garlic naan smelled heavenly.  Rice costs extra; if you're doing delivery, just pull out the rice cooker and save yourself some cash.\n\nThe tikka masala sauces were flavorful and creamy; both chicken and prawns were abundant in each.  The lamb karahi was delicious, with a lot of tomatoes, bell peppers, and onions, but the tikka masalas were better.  All portions were gut-bustingly large, and one entree (plus rice and/or naan) could probably feed two people fine.\n\nThe only reason this was only a 3-star experience is that our food arrived over half an hour after the delivery time they gave us, which was 45 minutes after ordering.  By the time the food arrived (after we called the restaurant to make sure the food was still on its way), we were starving.  I suggest ordering with an extra delay in mind.", "author": "Kate T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-06-26", "description": "I got a flyer from a place I work at in Outer Sunset district.\n$6.45 lunch buffet? Let's try it!\nSo we went to try it like a couple of month ago.\nWhen I asked how much is the lunch buffet for my 4-year-old, they told me that she could eat for free (she usually only eats the naan anyway, but still, their super nice attitude was greatly appreciated)\n\nWell, the selection for the buffet is mostly vegetarian. I wish I know all the names but here are several of them:\n- Naan\n- Saag Paneer (Fresh spinach cooked with cheese and herbs)\n- Tandoori Chicken (all dark meat though)\n- lamb dish\n- Biryani\n- Raita\n- Gulab Jamun (Fried Indian cheese ball in a syrup of rose-water & sugar)\nThere were a few more dishes that either I did not remember or I did not know the name.\n\nThe food was very good and the people working here were really polite.\nWhen I asked how much I had to pay for my kid, they said no charge.\n\nI have not tried the non-buffet one. I have to try their dinner entrees.\n\nUpdate 03/05/07\nWe tried the non-buffet menu: Papadam, Kashmiri Naan, Naan, Prawn Vindaloo, Chicken Tikka Masala.\nBoth Kashmiri Naan and Naan were great.\nI also love the complimentary Papadam.\nThe two main dishes were salty...\nChicken Tikka Masala tasted similar to the Prawn Vindaloo and I was a little bit confused since Tikka Masala is usually a little creamy.\nAnyway, I was a little disappointed with the salty dishes but the people working there were super polite and I think they still deserve 5 stars for the cheap price, their excellent attitudes, and great buffet.", "author": "Oribel .."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-01-04", "description": "I love Great India. It's super yummy, close to where I live, and even though I just said it was close, it delivers! Granted, I judge Indian restaurants a bit tougher than others as it's what I grew up eating -- but this is probably the best Indian food I've had in the city. (If you want better, you should go to Bombay Garden in Milpitas.)\n\nGreat India is north Indian food, and I've never been inside, but if you're looking for a quick delivery of yummy food -- I'd definitely recommend it.", "author": "Sapana S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-02-25", "description": "One windy & rainy Saturday morning, I decided to indulge my inner tourist by running across the Golden Gate Bridge.  I love to run, but it's not an experience that I will soon do again!  After practically freezing my kiester off, I desperately needed to warm up and refuel.  Fortunately, I stumbled across this place and noticed they had a lunch buffet until 3pm.  It was 2:45, what luck. \n\nAlthough the food wasn't exactly piping hot since I got there so late, they had plenty of choices to satisfy my cravings.  A variety of curries, chicken tikka masala, fresh naan, some spinach and chickpea dishes--I was in heaven.  Plus, I felt like I put my gastronomical horizons to the test with one dish at the salad bar. It was some sort of pickled vegetables in what I assume was chili oil.  Anyhoo, it was INSANELY salty and totally rivals the strongest umeboshi if you're familiar with them.  \n\nAn all-you-can-eat lunch for less than $8 that doesn't compromise all deliciousness is hard to come by, so take advantage of it, kiddies.", "author": "Manny P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-03-21", "description": "ohh...Great India....wtf has happened?\n\nWe've been getting food delivered to us for at least 15 years. Korma, Tikka Masala, Vindaloo, Biryani, .... Always our favorite. We went to the restaurant a couple times (first time at their old location that burned down about ten years ago), but home delivery was usually the best option. Always fabulous. Always.\n\nThen, recently, things seem to have changed. It's like all the recipes have changed. Two weeks ago, the vegetable biryani was missing nuts and raisins. Last night, it had the nuts, raisins as well as probably a handful of whole cardamom pods. \n\nThe Kormas seem completely different, the baighan bharta seems runnier, the vindaloo's sauce not as rich...on and on.\n\noh yeah, the prices have gone up and now you have to buy the rice or naan that has always come with the dinners.\n\nI called them back and asked if they've changed owners or something and they said 'no', and then I said, i mean like the same owners that have run the place for 20 years or so. He says 'I'm new'.\n\n:(\n\nWhere am I leaving the house to go get food now? Roti on W. Portal....", "author": "pedro w."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-03-31", "description": "CAUTION! Great India fans beware!!\n\nI'm so bummed. Great India used to be my favorite Indian restaurant in the Richmond. The food was delish, the delivery was super speedy, and the prices were good. However, the last meal we ordered was so bad, I actually called the restaurant to find out what had happened. \n\nApparently, they have a new chef. \n\nOur chicken biryani was missing ingredients (it was a yellow puddle of oil, rice, and onions), the saag paneer tasted like that foul green stuff you get in a foil pouch at Trader Joe's, and the garlic naan was the consistency of a flat tire--that you now have to pay for (rice and naan is no longer included with a la carte entrees). \n\nPedro W. has the exact same complaints, so it's not just me.\n\nNever going back, never again. Which totally sucks, because I hate to patronize India Clay Oven on Clement. It's more expensive, has slow delivery, and the main server (owner?) is pushy and downright mean to his elderly busser. \n\nBoo. Unhappy curry camper.  :(", "author": "guinevere h."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-01", "description": "upgrading to 4 stars. delivery is still slow but the lamb madras is spicy and vinegary deliciousness (much better than the vindaloo), the chicken tikka masala is still buttery goodness, and the naan came warm and fluffy. avoided the tandoori chicken this time and wished they took the peas out of my rice, but overall, this has become my go-to indian takeout restaurant.", "author": "Sherman L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-01-05", "description": "The buffet is alright overall, but very hit or miss.  Maybe I should have gone here when they had the previous chef because all these reviews are saying it was better; however it wasn't that bad now.  The sauces were as thick and goopy as most indian buffets, but in a different way.  Like here, it felt like they were thickened with corn starch whereas usually they taste like they have lots of cream and butter in them.  Usually that would cause me to complain, but for Indian buffets it's probably a good thing, because now this one has the distinction of being one of the very few Indian buffets that has not put me in a food coma. (And I ate just as much here as at the other ones.)  The tandoori chicken was pretty bad, it was all tough and had a freeze-dried consistency.  But the lamb curry was very good as was the dal and garbanzo beans.", "author": "David A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-07-12", "description": "We were feeling too lazy to go out for Indian tonight but I was craving it so we decided on great India to order in. They were here in under 40 minutes and the food was hot along with the tea! I loved the chicken curry, it was a wonderful blend of flavors and the bf loved the lamb korma, the garlic naan was good, nothing too impressive but what I really loved was the sag paneer, even better than tasty currys, the best sag I have ever tasted, it was fabulous. Each curry came with either rice or naan and the 3 curries plus naan and tea was kinda pricey ($40) but we will definitely be ordering in from them again.\r\n\r\nupdate: ok so I ordered the lamb korma and sag paneer \"spicy\" the next time and it was insanely spicy! i mean they are NOT kidding, and I like spice but this was too hot, it covered all the good flavor so all you could taste was HEAT. I recommend sticking with the normal heat level and dont experiment!", "author": "Meg L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-11-01", "description": "this is the best affordable indian food place in the city.  everything is good here. i can't go back to naan n curry anymore cuz this place is soo much better. \n\ndefinitely try there: mixed tandoori, mushroom mattar, garlic naan, rice and mango lassi, oh there veggie samosa is soo good. \n\nhowever, be prepared to be thirsty and also don't expect to exchange more then 5 words with the wait staff. oh and also there decor isn't the greatest but is charming but it really is all about the food.", "author": "curi k."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-04-17", "description": "I was planning on going to Tommy's Mexican restaurant, but some of us couldn't seem to find the place (granted I thought it was west of 25th, not east, and the neon sign currently reads; my's Mexican restaurant), so we all ended up meeting at this place.\n\nNow, I'm not usually one for Indian food, especially if I was hoping for Mexican, but I must say; this place is great!  The service was amazing, the food was fantastic, and it was all reasonably priced...but there is something I can't put my finger on, or should I say, 5th star.  Anywho, I'd come here again - maybe even over Tommy's.", "author": "Anthony B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-04-11", "description": "Yelpers, there is PLENTY of places that shy away from using ghee (huge plastic buckets of soybean oil is SIGNIFICANTLY cheaper, which they probably infuse), that tastes better and conserves a few wallet clams. You just have to make sure which dish does or doesn't have cream or paneer, because i would say a majority of south asian restaurants i've frequented, only the regal establishments refer to the behaviors of yore, like Maharani. This place is of that identical bracket in the vain of the star india chains, which is another downer. You know, that rustic simplicity where every americanized dish you've heard of, cloned menu structuring and all? Not to say that i didn't overflow on excess namaste flambe; cuz i did, fool, definately a three and 1/2 star channa; but even carcass chompers know that the tandorloin is where the north indian/pakistani wizardry transpires. \n\nCome on, Dawn!!! I love you girl, but I absolutely conclude that THE vegan indian delight is a south indian creation: bowl of idli w/sambhar and a dosa w/requisite chutneys. Not to say that it's only at Dosa, but they make a fairly mean one. Plus, most naan's are made with eggs, and even at Dosa, you can get the whole wheat roti or paratha, sans huevos and the ultimate in superflous muscle, ghee.\n\nAh lactose. Not the only item that makes dairy an all-encompassing foe. It's almost......meaner. Like people who drink non-fat, defeating the purpose entirely. Indicator? They don't get it, company! Do male lacto-ingrates lactate? I wouldn't mind finding out, my manicurist says \"the digits\" are impecably sturdy.\n\np.s. I would never go to a manicurist. But i would if it meant i could tear off ignorant nipples. I'll stop now. :o)", "author": "Christopher J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-05-10", "description": "I ordered delivery from here today with wonderful results. My order came 15 minutes before the time indicated, and arrived neatly packaged in spill-proof containers and non-soggy naan (very important for Indian). \n\nI ordered the Dal soup, Dal Makhani, Chana Saag with Rice and Garlic Naan. My friend and I are already stuffed on our first helping. My only complaint, which is my fault, is that it is not a little spicier- next time, I will specify \"Spicy\" as opposed to \"Medium.\" I have been egging on those kind ladies at Mandalay to \"give it to me hotter\" so much lately that apparently I've burned the upper epidermis of my taste bud region. The good news is that now when I drench my crepe in Tabasco and douse my pho with Sri Racha, I have finally worked up enough immunity to finish my whole meal. And in tough economic times like these, that is as good as gold.\n\nAnyhow, back to the meal at hand- really moist and flavorful garlic naan, and tasty Chana Saag. The Dal Makhani is good, too, but I'm a sucker for Chana Saag.", "author": "Anna S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-10-24", "description": "It's in the hood and has decent food.  The buffet looks like a good deal but I have yet to make it in time to partake.  I liked the lamb samosas a lot even though they were dry they soaked up the chutneys nicely.  The tandoori plate feeds 2 but the lamb was like leather.  The simple dal soup was just as it should be and is recommended for anyone who has the flu or is just feeling poorly (it has curative powers!)  Oh well - i'd go back if I was hankering for Indian and too lazy to walk over to India Clay Oven on Clement...", "author": "Julienne G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-01-29", "description": "Let my wife take us to dinner last night, she had the coupon. Rating the service was a 2-3 just because they only had one person manning the phones, cashier and tables, and while he was doing the best he could, he couldn't handle the dinner, so called rush, amounting to three other dine in tables of two each.\n\nDecor really bad, and doing dishes behid the bar (not really a bar, just made to look like one) We spent 1 hour 45 minutes there, 30 minutes until our order was taken. \n\nBy the time we had dinner served there were more workers out front, probably the owners. Food was good, not great, but have tosay I am not a big Indian food fan to begin with. Our coupon had a 18% tip charge (why I would tip 18% for service anyway) but then when they added the tip they added tax on top of that. They tried to charge us for salad that was supposed to come with the dinner (its printed on the menu) and only brought us two salads when we had ordered three dinners. The salad dressing was not that tasty, so we didn't press that issue. Overall the experience was not that good. \n\nDinner must be different becuase the pictures that go along with this restaurant were not what we were served on. Metal plates, which are more traditional I suppose, and didn't take away from the overall experience, just not what is pictured.\n\nIf you want fresh vegetables, looks like you will have to order a salad, everything else is mixed in with a heavy , but tasty, gravy.\n\nWouldn't recommend this place to Indian Food lovers.", "author": "Dan H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-04-15", "description": "Have you noticed how expensive eating out is getting?  \n\nHave you noticed how cheap Great India's all you can eat lunch buffet is?  $7.97, in case you're curious. They offer a limited selection of dishes but still the value is ridiculously good.  \n\nIt may not be as tasty as my faves (Chutney/ India Clay Oven) but man is the price right.", "author": "chris o."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-04-20", "description": "I've had some takeout from here once or twice in the last few years and the first few times I didn't think they were anything special but this last time I tried some of their food, it was actually pretty good.  \n\nWe tried their Chicken Vindaloo and the other thing that I really did like was the Lamb Madras.  Next time I go here, the Lamb Madras will definitely be one of the entrees we order....", "author": "Mark W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-07-16", "description": "Great India is on Geary and 25th.  I live in Russian Hill.  And they delivered to me.  That's marvelous.  \n\nIts not on the menu but they have moong dal (yellow dal).  It was very good.  Spicier and more busy tasting then other daal, which is usually more mild and bland.  Its usually a side dish that is never the main dish but a dish that you don't want to be with out.  The yellow dal here is so tasty it can stand as a main dish.  \n\nThe food is not oily!!  I suppose it's because they don't use ghee, as the other reviewers have said, but how do they make butter chicken without butter?  (Butter chicken's not on the menu either but is listed as a buffet choice.)", "author": "Wakako U."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-08-21", "description": "About the only complaint I ever have of Indian food is that the smell stays on you for the rest of the day.  And sure enough, every time I burped, I felt as if I was re-hashing my meal from earlier in the day.  Still, that's not really a complaint I have with the restaurant, so I'll move along...cos generally, just thinking of Indiand food makes my stomach growl.\n\nThe food served at the buffet was serviceable, neither excessively good nor exceedingly bad.  The lamb was nice and soft and that was a definite plus.  The tandoori chicken looked a little dry, so I stayed away from that.  The naan bread was a little fluffy for my taste, but that's about it.  Aloo Gobi lacked a little kick.  Everything else was pretty good...and made even more so by its super low cost.\n\nThe wait staff weren't very attentive, but I wouldn't say that they were negligent either.  They just sort of fluttered by when we needed water and just hung around when we didn't.  Of the atmosphere, I will say that it was smoky, stuffy and a little dingy.  No flies or anything, but not too far from what I imagine Calcutta in July to be like...well, without the millions of people and scorching heat, that is.", "author": "Philip W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-03-29", "description": "Buffet is good but lacking in variety (it's a rather small restaurant).\n\nThey're very polite when taking orders for delivery over the phone.  Delivery times are so-so but food arrives hot and fresh.\n\nTheir chicken pakora is godly and melts in your mouth.  The saag tasty and filling.  Naan comes soft and warm.\n\nIf you dine in, the service is very attentive.  They provide everything a westerner might ask for on the menu.", "author": "Kimiko Q."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-23", "description": "I've had food from Great India twice now. The first time I joined them for thier lunch buffet. Everything on the buffet was fresh and very tasty.  All of my favorites were their saag, tandoori chicken, chicken korma and of course kheer! Honestly it was some of the best chicken korma I've ever had. A lot of times during buffets service becomes non-exsistant. However, at Great India they are still attentive and frequently came by to refill my chai. \n\nI also had take out from this location. I got rice, coconut chicken, naan and kheer. The portions were generous, I was able to have lots of leftovers. The coconut chicken had a real kick to it. The naan was exactly what you'd expect. And thier Kheer rice puding is wonderful very creamy and enjoyable with lots of raisens and nuts in it. \n\nI'll be back, frequently I'm sure!", "author": "Marissa P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-04-20", "description": "Have been ordering their delivery for a few years, after being deluged with their pink menus; we've dined-in there a few times and were pretty satisfied.\n\nLast night, we ordered from their Website (mentioning $3 off if ordering over $25, and Rice or Naan with every main course) but were told that this has changed, and I'd have to pay for the Naan $3.50 as well as getting no discount off the delivery!\n\nThe food came on time. After having eaten half, I called in and told \"Sam\" that the Lamb Vindaloo (ordered spicy, came less spicy) contained no less than eight (8) pieces of potatoes, which had never been part of the recipe. Chicken Tikka Masala had not more than six small pieces of chicken swimming in the (tasty) sauce. Come on, chicken is so inexpensive, and how much is the flour for your Naan?\n\nIt sure looks like they skimp on the ingredients, and substitute with fillers. Chef has changed, perhaps? Indiscriminate clientele, they think? Updating of Web pages, anyone?\n\nI was told that the owner \"Jit\" would call back after he'd came in at 19:00; we are still waiting for a call confirming a credit on this debacle.\n\nBeware of this restaurant, and make sure you check the bill and quality of what you order! Better spend your money where you get real value...", "author": "Wolfgang S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-03-15", "description": "Super tasty, good price, deliver in under an hour.   \n\nWe ordered three entrees (aloo gobi, baigan aloo, veggie biryani), two appetizers (veggie samosas and the veggie pakora) and naan.  Everything was delicious--great flavor, texture, and nearly perfect spice levels (omnipresent happy tingle, no running mascara).  The samosas were flaky and light, the pakora fritters were good enough to make you want to get out of bed at 3am to snack on the leftovers (resist...).  The meal came with three chutneys and a generous helping of a cucumber-yogurt sauce. \n\nWe had PLENTY for generous second helpings for three people (bad for body, good for mouth) plus tons of leftovers.  I want more.", "author": "Heather P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-12-14", "description": "This was our favorite indian place for take out...we ate in rarely..but it was good for that too.\n\nIn the past year this place turned to shit. what should be 5 stars is barely 2....it's pretty much 2 for nostalgia and because other indian delivery is so damn bad.\n\nThey now charge extra for rice cause rice has gone up. uh, oh-kay, can live wiht that.\n\nbut EVERY dish we order now tastes stragely like a tomato cream sauce. i mean EVERY DISH.\n\nMy favorite used to be the coconut curry prawns. I've never seen it anywhere else...but they ruined it. I'm so sad. Also thier mint chutney was kick ass...no other compares..but now it's just watery blah. \n\nThe rest of thier dishes have followed the same course..they lack spice, they lack texture, they lack ingenuity... they just lack...unless you are looking for a blush sauce fitting for pasta..and you are a totaly medigan. A word my grandma used for americans who try to be italian and do shit like put pepperoni in baked ziti. \n\nThis place is now like that. \n\nThe saddest part? It's still better than most indian delivery.--like rottee. Vomit.\n\nThat place in the lower haight (clay oven?) is still good..but they don't deliver. just eat your indian food out. what a bummer. i miss getting the great india feast on a sunday afternoon.", "author": "Amy J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-12-12", "description": "When I suddenly find myself starving, unable to leave home, and without much in the kitchen, I call Great India. Lately, this has been happening about twice a week.\n\nFood: Good. (It's delivered Indian food and I think this is as good as that can get.)\n\nService: Friendly. And although they always say it will be 45 mins, it's always been under 30.", "author": "James B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-13", "description": "Wonderful phone service, and super fast delivery. Less than 30 minutes to get to my house - unbelievable! The shahi paneer is fantastic.", "author": "Mark S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-01-10", "description": "I came here because I was craving Indian food and I was out in the Richmond area.  I got the lunch buffet and for a while was the only patron in the place.  The service was really great as a result.  The food was tasty, but I had a hard time distinguishing flavors.  I could tell the difference between the lamb and the chicken, but everything sort of blended together.  Don't get me wrong, I enjoyed the dishes offered, I just couldn't tell you which one was best.  The naan was tasty and a bit fluffier than I am used to, but it was a nice change.  For 10 bucks, it was a pretty great bargain, but I would wary of coming here for a full on meal given the unspectacular nature of the buffet dishes.", "author": "Jeremy G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-11-30", "description": "Great for delivery. Seems like they deliver everywhere! I like my Indian food SPICY and this place actually delivers when I ask for it. I feel a little too heavy after eating here because it's a little greasy (or the fact that I over-eat...ha) but it's still pretty good. Not the greatest samosa's in the world, but whatever.\n\nThis used to be my go-to Indian place before I found Curry Village in the inner sunset.", "author": "Emily W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-04", "description": "Great India is pretty fantastic - both for take out and for their restaurant experience. Their buffet is also amazing and diverse. The only thing I haven't been a huge fan of is their paneer - it's technically good, but I find it a bit too firm/dry for my taste. Regardless, they are good enough that I've decided to switch my \"go to\" dish from paneer masala because all their other choices are yummy enough to compensate.", "author": "Elizabeth T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-02-21", "description": "My experience with this place was not good.  We went for lunch on a Sunday about  2pm. I knew they had a buffet but i thought we would get a choice of buffet or ordering off the menu. The two stars are for the waiter/host smiling at us when we came, and because the food wasn't horrible. \n\nI sat down in a wet seat. I jumped up when i realized this and moved to the seat next to me.... also wet.  The bottom of my purse was also soaked since it was sitting in the 2nd wet chair. This put me in a not so good mood. Lunch in wet jeans isn't very fun. \n\nOur service consisted of being sat at a table and given 2 waters. That's it. No asking if we wanted anything else to drink, no ordering off the menu, not even collecting our dirty plates or bringing us our check. \n\nThe food was just OK. A bit salty. Maybe they were having an off day. Also there were rarely clean dishes up there so people were bringing their dirty ones back to the buffet, which is gross. \n\nI might give this place another try someday just because it seems like most people liked it, but it won't be for lunch. \n\nOh, i almost forgot, one more good thing-- it was cheap!", "author": "michelle h."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2007-09-29", "description": "I've never actually eaten here but I could sasiate myself with the amount of flyers they leave on my door. \n\nOk, you deliver, I get it.\nOk, aha, your open and have \"Award Winner Chef from India\"(verbatim), I get it.\n\nI don't need to be reminded on a weekly basis.\n\nMost people have a menu drawer or menu/utility drawer and when they get a menu they put it in there to reference when they are hungry. Only one menu is needed.\n\nI'm not saying this place sucks, I'm just saying their flyering does.", "author": "scott w."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-11-25", "description": "Last time we visited, we were not too happy about the fact that the restaurant was incredibly cheap with giving the normally free nan bread.\n\n\n More expensive for the neighborhood, no parking, uneventful at best.", "author": "rollerbldn6"}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-05-06", "description": "One of my fav places in the city, and I LOVE how spicy they make what I order ( so spicy it makes me want to dance, stick my head in a bucket of water, and do it all over again.) Food is awesome, and I'm definitely coming back!", "author": "T. C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-12-27", "description": "I'd go here much more often if they were open for dinner and the chai tea was free.  Actually, their chai tea really isn't that good (too watery?), so maybe it doesn't have to be free.\n\nThe buffet food is always relatively fresh and they haven't once given me a stomach ache (except from eating too much).  The food tastes acceptable, but nothing stands out as being delicious or terrible.  Service is par.  Price is par. Food is par. Everything is just par.\n\n3 stars.", "author": "Jin D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-10-21", "description": "This place is the bomb! They deliver too! LOVE the chicken tika massala. YUM!\n\nI'll definitely be back!", "author": "Zack L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-05", "description": "We usually order for delivery. Very fast. Chicken in chicken tikka masala good quality. Naan is cripsy. They use real garlic for the garlic naan. Not garlic powder. Delivery is speedy. Usually get food very hot in 30-40 minutes even on weekend. Gentleman who answers phone is pleasant and polite. Everything I've had I've really liked. Get food here. It's great!", "author": "SF R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-11-24", "description": "the food is very very good.  like breathtakingly awesome good.\n\nwhat is not good is when the creepy staff stare at you and your friend HARDCORE throughout the entire meal and come up to you sporadically, asking redundant and idiotic questions, making conversation completely impossible.\n\nhey - GM.  you might want to train your staff to not creep out your female clientele.  thank you kindly...", "author": "Karen K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-04-08", "description": "This restaurant has the most delicious chicken tikka masala i have ever eaten.  I always eat at the buffet.  I usually go once a week. It is pretty consistent, some weeks it's spicier, some weeks it's creamier but it's always delicious.  I never leave dissatisfied.\n\nThe service is awesome.  The man with the glasses and the vest is quick to refill water pretty much as soon as you take a sip which is great when the food is spicy.\n\nThe tandoori chicken is dry, but that's because it's white meat. Athe lamb curry is also good. Very spicy and tasty.\n\nThe naan is hit or miss, they usually bring fresh when we get there.  They also put out fresh chicken tikka masala and rice when we get there.  And if you want fresh, just ask, they'll make it and bring it right out.  They're very sweet.\n\nI will continue to eat here as long as it is possible.  Yum!", "author": "Casey W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-24", "description": "My partner and I always order from Great India. They're fairly fast getting to our door in the sunset. \nThe best thing about this restaurant is that they will actually make all of the dishes spicy when you ask for it. Most Indian places in the city assume that if you're white, you don't REALLY want it spicy, so they bring it mild no matter what you say to them.\nGreat India will not cheat you on the spices, they make it how you want - mild, medium or spicy. Everything I've ordered from them has been very tasty. The Chicken Tikka Masala is one of my favorites. The best veg. option I've had is the Coconut Vegetable Curry, which is absolutely delicious.\nTheir naan is not the best I've ever had, kind of hard, but definitely edible. The mango lassi is also a bit strange, in a way I can't really describe. \nOverall - I'd recommend Great India to anyone who loves Indian food.", "author": "Owen L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-08-02", "description": "I went for the lunch buffet.  Found it after leaving um ma son's disappointed. \n\nThey have a good buffet.  They even had good lamb.  I despise gamey lamb.  Their lamb was def not gamey.  +2 stars.\n\nLunch buffet was super cheap.  I saw the sign outside, and I couldn't believe it!  But it's true.  +1 star\n\nAnd service is exceptional!  It is so good, it will set you back with all the Sir and Ma'ams.  Water is constantly refilled...I don't think my glass made it to empty the whole time?? +1 stars", "author": "MiYong E."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-04-12", "description": "I am really surprised by all of the good reviews for Great India.  I have to say that I was completely underwhelmed and disappointed in the quality of the food here.  I ordered delivery and was pleased with the person taking my order and the speed of delivery, the delivery person was also quite pleasant.\n\nHowever, the food really sucked.  The Lamb Karahi was greasy, but the lamb was dry!!!!  How you get lamb to be dry I'll never know.  The Chicken Makhani    was VERY salty and had little to no other flavor.  The Keema Nan was also salty.  I have had worse Indian food, but I have to say this isn't good.  Overall the food was lacking in the good spicy flavor of Indian food, but tasted really salty.  I should have had my husband bring home takeout from Berkeley.  I guess I will still be looking for good Indian food in the city.", "author": "Kate B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2005-11-16", "description": "I had been getting all the Great India flyers on the railings of my front steps for years! Who knew they'd be so good?  I've only had their delivery (but thank goodness for delivery!) and it's fabulous.  My favourites: the Onion Kulcha (thick and savoury with plump onion bits throughout) and Chicken Saag, but everything else I've tried (Lentil Daal, Lamb Koorma, veggies in coconut curry sauce, Mango Lassi) has been quite tasty.  \r\n\r\nThey do tend to get busy, and chances are that the sweet woman who answers the phone will immediately take down your number and ask to call you back.  She eventually does, but after 5 minutes it might be a good idea to call back.  They're in the Richmond, so expect anywhere from a 45-minute to an hour wait for your food (I live in the Inner Sunset and have had delivery to the Duboce Triangle, Castro-Noe).", "author": "Claudine C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-19", "description": "Love this place!! great delivery and fast too. Its not the best India in the city but its by far the best deliver Indian I have tried. I have tried most items on the menu and have some fav's but you really can't go wrong here its all really good. \nSome of my fav's\n\nChana Masala\nSabzi\nChicken Makhani\nPrawn Vindaloo", "author": "Ryan S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-12-15", "description": "Ok, this place has SERIOUSLY slipped! I was so disappointed with my delivery food. I always get delivery from here because it's the best. However, it's been a while. They must have new owners, maybe cutting corners, but my food was pretty horrible. My Chicken Madras didn't resemble the old version, the sauce was clumpy, and the lamb samosa, it tasted like freeze-dried processed lamb-like meat...not even meat really.\n\nReally sad. I loved this place. Need to find someplace new for Indian delivery. Any suggestions?", "author": "michelle B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-09-18", "description": "I love that they deliver.  That's the best thing about this place.\nOther than that, the food's mediocre.  I had the palak paneer and it was ok, just nothing notable.  My boy had the chicken tikka masala and agreed that, although there was nothing wrong with it, he had definitely had better.\nI'll probably order from them again when I'm feeling lazy and don't want to go out for food.  But, otherwise, there are other places I prefer.", "author": "Jessica L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-01-06", "description": "I'm always wary of places that leave flyers on your door but when I ordered delivery from Great India, I must say I was pleasantly surprised. I ordered chicken korma, aloo gobi and lamb samosas. Each entree comes with your choice of rice or naan, so you can make a whole meal for 2 or 3 people when you order 2 entrees. Everything was yummy and I love the fact that they deliver the food in reusable plastic containers. One of these days I'll have to make the trek down there to try the buffet.\n\nUPDATE: Entrees no longer come with rice or naan. You have to pay extra now. :( STUPID RECESSION!!!", "author": "Melanie V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-11-12", "description": "Walking into this place for the lunch buffet was a pretty good idea.  It was very low key, and the food was pretty great.\n\nThere were some indian people eating there too, so I assume the place is legit.\n\nI don't know much, but the buffet was a good deal and I enjoyed the tranquility.  I guess I avoided the lunch rush.", "author": "L J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-10-13", "description": "I love these guys - \n\nGreat India has the most consistently excellent Indian food available for delivery anywhere in the city.  And they deliver to practically ANYWHERE in the city.  Despite being in the Richmond, they deliver to me in SOMA - \n\nAll entrees come with you choice of Rice or Naan at a reasonable price.  Try the Chicken Korma, masala, or the coconut chicken curry - all excellent.  The bindi masala and lamb masala are also excellent.\n\nThe buffet does not live up to the entrees served at dinner or delivery but that is my only neative comment.  Seems the quality is just better when you order the full meal.  Willing to give it another shot though.", "author": "Rick R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-11-12", "description": "Came here for dinner sometime last week.  Picked this place because it had 4 stars on Yelp w/96+ reviews.  I have to disagree w/the rating. When we arrived, the place was empty. Yelp hasn't doubted me before, so why now.  Well, lamb somosas were dry.  The one thing I would get again would be the fish (salmon) curry.  4 ppl, 4 appetizers and 3 entrees paid about $50 (incl. tax & tip). \nLost stars because I had to keep requesting for my glass to be filled with water when the place was empty (there were only our table and another seated).  This place has about 20 (4ppl) tables.", "author": "Christi S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-04-14", "description": "My first OFFICIAL dining experience with Indian food.  My only other one?  Me being experimental and making tandoori chicken at home.\n\nAfter spending a beautiful HOT day in the city with my hubby, GPS'ed the closest Indian restaurant and ended up deciding on Great India after reading the yelp reviews (gotta love the crackberry).  Boo for having to wait until they reopened at 430 after their lunch hours.  Boo for serving us water with NO ICE...Boo for my soda having 3 ice cubes...Boo for warm mango shake...do they not see the sun outside?  Sheesh.  Another boo for super duper slow service when we were the only people in the restaurant.  Food was good though, I'll give them an extra star for that.  I assumed that their business thrives off deliveries since it was damn near empty the whole entire time we were in there.  oh yeah, and parking SUCKS BALLS...I think I'll find another Indian spot to patronize rather than coming back here.", "author": "Riza A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-05-30", "description": "The buffet alone is worth the almost $9, I will start with that. While I wish they'd get a little more adventurous with the vegetarian offerings, I will eat plate after plate and then some. Maybe I have a problem, or maybe their food is actually that good. Let's not get too crazy here, I've definitely had better, but they get an A for effort. \n\nI think one of the other charming features of this particular establishment is that they deliver. I can't tell you the countless nights where I've run out of groceries and simply call them up for some paneer tikka masala and they are here in about half an hour. It's to the point where I have their number programmed in my phone... totally not kidding with that one, folks.", "author": "Paul W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-09-23", "description": "Excellent and cheap Indian food.  As someone noted, it's not the kind of place you go on a first date; the atmosphere is not classy, it's totally unpretentious.  \n\nGreat service.  Nan is hot out of the oven and perfect, you won't regret it.  The only thing I don't recommend are the somosas.", "author": "Amy H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-10-24", "description": "We order there at least once a month but are stuck on the following menu: Lamb Vindaloo, Garbanzos, Chicken Hara Bara and onion nan. The food is very fast and really good - and hot! We live nearby but they are so fast it's crazy - like hang up the phone and the doorbell rings. \n\nThe only question I have is -- if it's Nan Bread, what is it?", "author": "jim b."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-02-10", "description": "When I order delivery Indian, this is where I get it.\n\nExcellent chicken tikka masala, with 2 orders of rice, and 3 orders of naan makes for a couple of meals.  \n\nIf you like mint chutney, order a side of that as well.  The meals come with a little container of it, and it's never enough.", "author": "James D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-04-19", "description": "Twas a long time ago when we frequently ordered delivery from this restaurant and were quite convinced that they made an excellent chicken tikka masala. Then came the last day we would ever eat their food again. After having spent a day with my friend Precious Jade, I was walking home and decided to pick up chicken tikka masala and saag paneer for dinner. Foodbeard was excited when I came home with the steamed up paper bags. What was to come was not a happy event. The tikka masala appeared to be a canned tomato soup special and the saag paneer some kind of split pea soup special. Very bizarre substitutions. I think we were forgiving, and gave them a second chance, dining in some time after that first fiasco, but amazingly, it happened again, and we have NEVER gone back since.", "author": "Rose Q."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-03-17", "description": "One of the better Indian food places I've tried in the area so far.\n\nThe food is really tasty and the staff is friendly.  Everything is very reasonably priced, and the portions are fairly big.  One of the things I like is that the nan isn't overly greasy...  I usually have to dab dripping oil off of it, but not here.\n\nThe decor isn't the nicest if you're going on a date; a little bland with pink table cloth everywhere...  I think a lot of people order take out from this place.  I would say this is a good restaurant for a relaxed, casual dress, and good indian meal.", "author": "Vicky M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-03-15", "description": "Just ordered from them tonight.  I've been ordering from them for almost 10 years now I think.  Food is always great!  Mild tends to still be alittle spicy.\n\nI almost always order the same thing, so I cant speak for the entire menu.   But the chicken tikki kebab is moist and flavorful.\n\nWhen I used to order, it came with papdam and when you ordered an entree, you had your choice of rice or naan.  That is all sold seperately, so it is much more expensive now.  I would probably order from them more often if they included rice or naan with a dish and gave papadam.\n\n$30 was to total for 2 dishes, and a mango lassi.  It easily fed 2 people.  Delivery often takes 40 minutes and I am 15 minutes away.", "author": "Melanie J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-14", "description": "I really like this place, both for delivery and for dining in. I first tried this place after my boyfriend and I looked at an apartment at 24th and Lake (we ended up getting this apartment and will be moving in a few days). Their lunch buffet is good, although smaller than Star India's. Also, their naan is great, as well as their tandoori chicken, yum!", "author": "Allison K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-10-26", "description": "Great India has been a favorite of mine, especially for delivery. The food is fresh and flavorful. I have eaten at the restaurant and it is pleasant. Yet, when I order delivery, the food always seems to be really fresh, flavorful and delivery is prompt.\n\nSee web site for menu and details at link:\nhttp://www.greatindiarestaurant.com/", "author": "Jonathan F."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2007-04-28", "description": "Fortunately for me I've never ordered food here, and thank God I never will.  I've had some really good Indian food from other restaurants but this was the worst. \n\nFirst off I just arrived home from a play and my room had order Indian food from Great India. She went on further to say that she had ordered it almost an hour before I arrived home. \n\nSecondly when it arrived it smelt a little funny. She ate some and looked at me with disgust. So asked me to try a bite and I said sure. I did and it was horrible. It was bland. Not flavorful at all. We were not impressed. \n\nShe had their Murgh Korma (Chicken) and some plain Naan. The Naan was ok but the Korma was horrible. \n\nWord to the wise I wouldn't waste my time ordering delivery from them  and there food isn't that great either.", "author": "Jessica L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-07-19", "description": "It almost seems like a waste to write a review of a place with 74 reviews already.  Still, this place deserves good words.  \n\nA co-worker and I were in the city for SemiCon West and someone told us about Great India.  We had no idea how far it was (from Moscone Center) but the cab driver warned us.  It was so nice to get outside in the sunshine that we just said, \"go for it.\"  \n\nWe had the lunch buffet and both of us were pleased with the good taste and quality of the food.  We love garlic naan and theirs was superb.  The price was unbelievably cheap!!  The people were nice, the service was good (water glasses kept constantly full).  \n\nThis place is a find!!  The round-trip cab fare was more than double (actually nearly triple)  the cost of the meal for two of us, but I'd do it all again!", "author": "Randy R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2007-08-08", "description": "the first couple bites of my veggie masala were really good...then I saw it.\na black hair laying among the veggies.\nI'd like to think it was mine, but unfortunately I don't have black hair.\nit was my first time at Great India and I don't think I can go back.\ndrat.", "author": ".'antigone' .."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-10-23", "description": "Dinner: Great.\n\nBuffet: Not-so-great.\n\nMy favorite item on their menu: LAMB KORMA. (Yum)\n\nGo for dinner if you can. I think it's way better than their buffet. Oh, they deliver too!!!!! That part's awesome.", "author": "J K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-10-05", "description": "We ordered to go, so please find my review of the following items:\n\nNotes I asked for all very mild.  I told them I had little kids.  I guess there idea of mild for kids is a bit on the fiery side.  Luckily for us, we ate at home and was able to prepare alternatives.  The kids did love the Naans\n\nAssorted Bread Basket - $6.95\nCombination of : \nGarlic naan: Naan topped with fresh garlic and cilantro\nExcellent flavor, but a bit oily.\n\nonion kulcha: Naan stuffed with onion and fresh cilantro\nSautéed onions, soft sweet savory and delicious  \n\nkashmiri naan : Naan stuffed with nuts, raisins, coconut and cherries\nGreat for the kids...it was sweet.  I did not find any raisins or cherries, but the coconut filling was pink from I guess the cherry juice.  \n\nKarahi Chicken - $9.50\nBoneless Chicken stir fried with bell pepper, garlic, ginger, tomato and Onions  \nVery tasty, sweet and spicy.  A bit on the oily side.  \n\nLamb Saag - $10.95\nBoneless lamb cooked with creamed spinach and fresh herbs  \nCannot beat the Saag.  The lamb was tender and did not even taste like lamb.\n\nBaigan Bharta - $8.95\nRoasted eggplant chopped and cooked with tomatoes, peas and onions  \nSweet and savory with a tiny bit of heat....at least for my taste...my kids said \"SPICY!!!!!\" but what do you expect from a 7 year old.", "author": "Jerry W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-10-15", "description": "The food was okay, certainly not the best... but I wasn't even anticipating that, I just wanted some good ol' bleh North Indian grub. It might have tasted better if my delivery driver hadn't made me feel like a jerk for having to deliver to my area (obviously he hit Friday Night traffic). I tipped him well on my credit card (no cash on me) and I was charged an extra $4 for delivery, on a $15 min. order, so getting the food to me wasn't cheap. Super awkward... very unprofessional...", "author": "Courtney H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-11-29", "description": "Was there a changing of the guard in the last year or so?  I used to order from this place at least once a week. I'd get an assortment of pakoras and samosas and their dal makhani was amazingly addictive.  Now the dal makhani is bland and watery, the veggie pakoras are dry and hard whereas the chicken pakoras are bland.  Last night even the soup was a disappointment.  How does one mess up soup? Furthermore prices have crept up since the last time I ordered delivery, so I was a little surprised by the bill.  Still the main concern is that the quality of the dishes has certainly gone down.  Guess they got new cooks who are still learning to cook.", "author": "Mary W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-11-06", "description": "I've never had no-ghee Indian food so I'd thought I'd see if it's all that it's cracked up to be.\n\nTried the lunch buffet...I notice the sauces are definitely not as thick without the ghee.\n\nStill, flavor is nice, price is right, and even though it's not the best I've tested, I'm willing to go back again.", "author": "Jarjar B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-09-10", "description": "I ordered delivery through grub hub and it got here way earlier than expected, which is always a plus for me since I'm hungry when placing the order. Veggie samosas are huge and delicious with three different dipping sauces. Chicken curry is also plentiful and medium spicy really means medium spicy, whereas some places have very different definitions of what's spicy. Mango lassi is the perfect refreshment with this hot food!", "author": "Saba M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-01-28", "description": "\"Great India may I help you?\"\n\nThose words are music to the ears of the hungry and lazy in the  Richmond (and beyond?).  The CTM is so lovely being made from high quality chicken instead of that kind of gristly stuff you will find at so many \"high end\" places.  When you get a samosa, bite off one corner and pour in that brown sauce.  Your taste buds will have some kind of party!\n\nCTM.  Saag paneer.  Chana masala.  Two rice, one naan.  Mild to spicy.  Time to eat Indians today!", "author": "Mike M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-10-04", "description": "I hardly give any negative reviews but this was the worst Indian (??) food that I have ever had. If I had the option to give it zero stars, I would do so. I have been there twice, the first order of curry chicken was ok but not great. When I went back last night, I ordered chicken Mahkani, garlic naan and samosa for take-out. I was too lazy to go to any other Indian place. \n\nSeriously, the chicken sauce tasted like a mix of ketchup and Tabasco sauce. Absolutely horrible. I have eaten chicken Mahkani at so many other places but this was by far the worst. The garlic naan wasn't fresh at all, already looked like a rubber plate and when I ate it, it actually tasted like rubber. Samosa and rice were ok but I won't go back. I only had to wait 2 min for the order and that already made me think that there is no way that the naan would be fresh. \n\nSorry, but I would rather walk two blocks further down the street to India Clay Oven or even head to Pakwan's in the Mission. Lesson learned!", "author": "MS K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-03-22", "description": "Coconut fish curry--AMAZING!! For sure the best Indian in the area. LOVE this place. Go. For sure.", "author": "Hale B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-05-04", "description": "I usually only get food from here when I order delivery.  My order is always delivered in approx 30 min, is hot, correct and reasonably priced.  We usually get the Chicken tikka masala, chicken saag, vegetarian samosas and garlic naan.  Always leftovers and always good.", "author": "Natasha T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-06", "description": "Great food. The chicken tikka masala is fantastic. They need much more business. Parking is a hassle. Good service", "author": "Andrew G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-10-22", "description": "My fiance and I both think that Great India is the best tasting. We tried Clay Oven, Spicy Bite and another place, can't remember the name, and Great India was easily our favorite. We like the Navrattan Korma and the Saag Paneer (perfectly seasoned). The Kashmiri Naan is also really good. \n\nMy only complaint is that they don't have Malai Kofta. If they did, it would be the perfect Indian food delivery.", "author": "Sondra S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-21", "description": "Really great lunch buffet. $9.99 for all of your favorites. Extremely flavorful and absolutely amazing.", "author": "Joe G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-04-20", "description": "I'm writing about the delivery--I haven't yet tried the sit-down service. I've ordered from them 3 times and each time the delivery was very fast, the service was excellent, and the food was VERY good. I've had plenty of mediocre Indian delivery, and in my opinion this place blows them out of the water.", "author": "Melissa M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-12-05", "description": "I've dined in and had delivery.  Experiences have been great either way.  The portions are huge, and they serve really good samosas.  Then again, everything tastes better when you've been drinking.", "author": "Marsha Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-03-19", "description": "I finally had a sit-down meal at Great India. It was pretty quiet, there was only one other party having a meal there, and yes, I'm with Megan W. on the fact that it was strange sitting down to have a meal there. Great India is kind of like your long lost cousin or pen pal whom you've known for so long and have an intimate relationship with but never really spent any quality face-to-face time with. Okay, I digress. The service was great and the food, as it is when it is take-out, did not disappoint.", "author": "Dee I."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-01-01", "description": "It's pretty good and in fact I'm going to order it right now.  The problem is it used to be SO MUCH BETTER!  I think they changed management 6-12 months ago and as far as I know the food never quite recovered.  The samosas are my litmus test.  I'm going to try them one last time and follow up with another review...", "author": "Chancey T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-10-09", "description": "The food was surprisingly good. The Chana masala and aloo gobi were really good, as was the naan. They were constantly checking the buffet to refill and replace the food. The salad was fresh and the sweet dessert ball things (can't remember what they are called) were good too! The tandoori chicken was a little pink on the inside, but I ate it anyway! There was one chicken dish (chicken kh---?) that was flavorless. Pretty good service, even though one server guy kept starting at our table. A little creepy. Not gonna lie.", "author": "Betsy P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-09-18", "description": "If you are feeling overwhelmed by the restaurant options on Geary, and you want Indian food your stomach won't make you regret later, head to Great India Restaurant.  I have only been there once, but would go back in a second.  Everything I tried was delicious, particularly the veggie appetizer combo, which comes with a samosa and tons of pakora, and the veg biryani.  One thing that makes Great India stand out from other Indian places is the amount and variety of vegetables in all their dishes.  The biryani was literally drowning in tasty, well prepared vegetables. So hooray for the great inexpensive food, and hooray for Great India!", "author": "Caroline H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-03-09", "description": "For being delivery - this spot is pretty damned good. Admittedly I have yet to \"dine in\" there - but the novelty of a good Indian delivery place is something that I (personally) enjoy. So the food is NOT the best, I'd say 7 or 8 out of 10 at the most, but the portions are huge, the food is tasty, and it doesn't leave you with the dreaded \"gut bomb\" syndrome afterwards. My personal fave is the Chicken Tikka Kabob, or the Tikka Masala - both yummy! Just don't order a mango lassi for delivery...bad bad bad idea!", "author": "Marco M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-02-05", "description": "The best chicken tikka masala I've yet had in the Bay Area! \n\nAfter trying a number of sub-par Indian restaurants around the Bay I was pleasantly surprised by Great India. The naan was good, the mango lassi was pretty tasty but not the best I've ever had. Moderately priced.", "author": "V R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-05-24", "description": "I order from them because they deliver.\nWorst Indian food in the Bay area.  Food is bland and curry is watery.\nWill NOT order from them again.  Will not recommend to anyone.", "author": "M s."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-03-22", "description": "So I was craving really spicy indian food and was let down once before due to limited cognitive capacity of the order taker at Great India. This time I tell the dude that there's a special spice challenge at my place and I want it inedibly spicy, chanting this in various tones to break his order stupor. Finally the guy mumbles 'So you want  it spicy?' - not a hint of sarcasm either! I say a prayer and submit the order. It arrives, mild as lambs milk! For future episodes I will try 'Hell is freezing over and we need a vindaloo to the rescue' followed by extortion and death threats - stay tuned!", "author": "anurag p."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2005-06-21", "description": "I found this place on Easter Sunday in 2001, red-eyed and ready to eat.  I've been every Easter since.  The service is great.  They have the friendliest staff and you do never have to wait, even if you show up with 10 people.  A good group dinner spot.  The food is great (much better than that hyped up place in the Haight) and cheap.  Delivery a bonus for the West-Siders.  Some unique selections include: Coconut Curry, Sweet Naan, and Chicken Hara Bara.  Worth the drive for those East of the fog.", "author": "Michael M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-05-12", "description": "I think things changed again cause Great India is back and I love it!", "author": "Shawn S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-04-22", "description": "Excellent, made-to-order Indian. I asked for spicy and I got it spicy...amazing! I had the chicken tikka masala and it was perfect. Not too sweet and not oily at all. The garlic naan was also delish. I really want to try the buffet...", "author": "Whit P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-05-07", "description": "Good average indian food. I came here for the weekday indian buffet lunch--only $6.75! Good assortment of dishes, including pakora, chicken curry, chicken tikka masala, veggie curry, lentils, tandoori chicken, and some dessert-fruit, rice pudding. It's not the best, creamiest curries, but good for the price. The place is very clean and the staff is incredibly nice!", "author": "Jessica h."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-02-09", "description": "I have Indian food at least once a week..and this is my favorite place. I love them so much that their number is stored in my celly. They are consistent  with their food. My faves are the chicken tikka masala,chicken coconut curry and the masala tea! Each dish comes with your choice of rice or naan. The veggie samosa is the size of a baseball.", "author": "Jenniflava R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-06-28", "description": "This is my favorite Indian Restaurant in the city. A friend brought me here 3 years ago and still I am never disappointed.  The food is always delicious and the service is efficient and friendly. I now bring my visiting guests to eat dinner here and always everyone is satisfied. The Chicken Tikka Masala and Okra are my favorite dishes. The naan is yummy too- I like mine with onion and garlic or cheese.", "author": "Melinda Q."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2006-01-31", "description": "Since you're already in the hood, go to india clay oven -- twice the buffett selection -- twice the quality.", "author": "Tim G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-01-17", "description": "I went here for their lunch buffet and all I tasted was salt.  But at least it was cheap ($6.45).  There are two things I miss from living further south in the Yay -- the sun and the Indian food.  ***sigh***", "author": "S J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-08-31", "description": "I was basically stuck between this and a chinese place on Grubhub to see what I could get delivered to my new place... they told me an hour, but thankfully it only took about 40 minutes (pretty normal, seeing as it is kinda far from my house), and the food was HOT. Glad I didn't puss out and get Chinese again tonite. I ordered veggie samosas and pakora, saffron rice, regular ol' plain naan and chicken makhani. Samosas and pakora: yummy, dry-ish (which I actually would prefer to a flood of oil or something I guess?). Chicken: some pieces were dry/hard but there was tons of sauce so mixing it all together with the rice was still yum and it wasn't inedible or anything gnarly like that... The sauce was friggin tasty, dammit.", "author": "Michelle W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2007-09-10", "description": "Update 2/13/08: I have ordered here twice in the past week (yes, I'm lazy and don't feel like cooking, and always remembering to pay in cash since they don't care too much about rectifying any credit card overcharges). I think they have a new chef because the normally yummy food actually sucked. Both times. I order my food mild (as always), and the last 2 times it was barely edible because of the heat. Also,  they started leaving in whole cardamom pods (I think it was cardamom) and whole bay leaves. Neither of which are very good when bitten into. Who does that? I think that between the overcharged credit card and lack of care by the owner, and now less than mediocre food, I'll have to find a new Indian place to love. Oh sadness.\n\n\nI really like this place, so I'm sad to have to write this review. A word of warning: if you order from here, DO NOT USE A CREDIT CARD! I usually use cash and ask for delivery, but I picked up my order on my way home and used my credit card. The total came to 26.20. A couple of weeks later when I was balancing my checkbook I saw that they charged 29.00. Now, normally I wouldn't get so upset at $2.80, but the fact the someone helped themselves to my hard earned $2.80 really pisses me off. I called the manager, who insisted he would check the credit card receipts and call me back. He never did. I called again 2 days later and another person (or was it the same person?) tried convincing me for a good 2 minutes that I must have written exactly 2.80 as a tip. Now, first of all, I have a very strict system with my receipts (being anally obsessive compulsive is good for something) and record every cent I spend to balance my books each month. Second, why would I have written in 2.80 rather than 2.00 or 3.00? Last, I know that I didn't leave a tip because I remember thinking to myself, \"self, why would you leave a tip for an order that you picked up\". \n\nBottom line, $2.80 isn't much, but sometimes principles matter. The food here is fabulous, but if you're going, use cash!", "author": "Amy B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-01-17", "description": "I really love this place. The delivery can be painfully slow and sometimes even the waitstaff kinda isn't so great. But the food is well worth it and that is what I go for. So far no dish here has failed me and when you eat in they even give you free appatizers!", "author": "Stephanie W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-06-02", "description": "What the heck happened??  This was my 'go to' Indian delivery spot, it was consistently delicious and sometime in the last few months they changed all the recipes - wtf?  The Mushroom Mattar is a watery mess now, and the Chicken Tikka Masala is also a slightly different color and more watery.  I am so bummed but the last delivery I got from them was near inedible, they are off the list.", "author": "Michael L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-08-22", "description": "This place is great! It's reasonable, the service is quick, they refill your water regularly. What more do you need? :P The lunch buffet is actually quite impressive too. Service is much better than India Clay Oven on Clement (at least compared to when I went four years ago). I still have yet to get my dishes up to par on my spiciness preference, but I've been working on it. :) Only reason they do not get 5 stars is that there are little flies in there sometimes.", "author": "Kristi D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-06-13", "description": "I've been eating here once a week since I discovered it.  I love the lamb korma and lamb biryani.  The food is consistent and a great price for the large portions.  They stay open pretty late -- 10:30pm -- every night, and offer free delivery (it's pretty fast too!).  The service has always been friendly.  I hear the lunch buffet is really great.  Parking can be a challenge though.", "author": "Miss Purr fec t."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-08-21", "description": "I'm thrilled to have found this restaurant!\n\nIndian food is one of my favorites, and the only Indian restaurant I knew of in the area was incredibly disappointing.  But then I found this gem - good food, good prices, and they deliver!\n\nIt isn't the best Indian food I've ever had, but it's definitely solid.  I'd rate the food an 8/10.  The chicken tikka masala is my favorite here - the only complaint I have is that the chunks of chicken can be slightly dry in the middle (so I just break them into smaller bits and let them sit in the sauce for a few minutes - problem solved!).  Other than that, it's great.\n\nThe fact that they deliver is a big plus.  Now that I know about this place, lazy nights in front of the TV no longer necessitate going hungry or reluctantly having mediocre food delivered.  Thank you, Great India!", "author": "Morgan M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-04-18", "description": "we've been ordering from Great India for years.   Tonight's experience was enough for us to look for another Indian place to order from.  \nI actually called the restaurant since the food we received was nothing like what i had received in the past....not just in quality, but in actual flavor...as in recipe changes that were certainly not an improvement.  our three entrees looked  identical and there was barely a variance in flavor.  all three had less vegetables and meat than before.   the samosas were flavorless.  if you only remember one thing from this review, let it be this:  do not order the mushroom mattar.  \n$50 wasted, if you ask me.  such a disappointment.", "author": "Rebecca A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-03-11", "description": "Not bad Indian food.  I am always surprised when I walk by this place that it is not crawling with more people.  But I think that they make a lot of their money on deliveries because every other day I have one of their menu's in my mailslot advertising that they deliver.  I will probably take them up on it.  \n\nHighlight of my evening there (other than the food and the bomb garlic nann bread): an Indian version of that Britney Spears song 'Toxic' came on.  I'm not a Britney fan, but this version was interesting.  It had sitars and everything!  I couldn't believe that that existed.", "author": "Jeremy V."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-06-04", "description": "So disappointing. I have been ordering from Great India since before they even had that name. It was never \"Great\" India, but always \"Quite Good\" India. Now it's \"Disgusting\" India. Whatever happened has made me take them off the list of places I go to or order from. I'm going to throw out their menu The last time I ordered from there, we actually threw out most of the food. Blehhhh!! Does anyone have a good replacement place that delivers?", "author": "Mark L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-02", "description": "I only do Indian for buffets, and this is among the best I've had in this department.  Lamb curry was a special favorite, and I give them a lot of credit for the pakoda (normally they're too greasy for me to handle).  Water was refilled often.", "author": "John H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2005-11-10", "description": "Other than being a bit too salty for my taste, the food here *is* some of the best I've had in the city.  The lassis, like everywhere else in San Francisco, run like water (what is it here?  Where I come from lassis are thick and sweet and delicious) and are salty as well.  The naan was delicious, however.  We ordered over the phone and the staff was extremely polite.", "author": "daisy s."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-03-19", "description": "scenario:\n\nthree big guys walk into an Indian restaurant, hungry, and if i remember right, a tad drunk. the place is empty, they falter a bit, wondering if they have made the wrong decision. the host seats them, and for moments they feel trapped. a lone man walks in empty handed and leaves carrying a dozen to-go boxes of food. our heroes' spirits brighten.\n\nthe food arrives in gargantuan heaps, the flavor excites, the service is generous, and the bellies fill. our happy men exit and walk home - the universe is right once again.", "author": "Darrell L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-02-03", "description": "I went to Great India restaurant for the first time last night and was pleasantly surprised by the food. I've been to one other Indian restaurant in the Richmond and was disappointed- the food was bland and expensive. At Great India, the food is pretty good (not as good as Indian Oven in lower haight but that place is pretty hard to top) and the portions are big! I ordered three dishes and was surprised to find that we couldn't finish them they were so much larger then any of the other restaurants I've been to. And the mango lassi was the perfect touch of sweet to all that spice! The only downside was the service. When were were there it was early, around 5:00pm, and raining- we were the only people in the restaurant. Despite the obvious lack of business, the service was still pretty slow. Nevertheless, this place is a good standby when you are craving some Indian spice.", "author": "Megan C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-11-04", "description": "I have to start by saying I ate here at 2:45 and had the buffet. The buffet closes at 3 so the food had been sitting for a long time. The rice was so old it was crunchy. The lamb curry was dry, as was the tandoori chicken and everything else. There was two peaces of dried out naan left but they made me some fresh naan that was good. I imagine if I had been there around noon when the food was fresh I may have been more satisfied but even then the flavor wasn't that great. Over all the food was that I would expect Indian food to taste like from a truck stop along the interstate in the Midwest. I don't think i would recommend Great India to anyone. Theres lots of Great Indian food in this city but in my opinion Great India is not one of them. Again please keep in mind what I said in my first sentence. I hope this is not a true representation of there food over all but I don't think I'll be returning. I will say the service is friendly and good. That may have been because there was no one else there. That should have been a sign I guess.", "author": "Isaac S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-05-12", "description": "Great India is ridiculously close to my house, so it's my first stop if I want Indian food and I'm pressed for time, or don't care to stray too far from my neighbourhood. The service is prompt and attentive, and the food is fairly good, particularly the chicken tikka masala. Their naans are wonderful: they're fluffy on the inside, and crisp on the outside, and are always warm from the tandoor. Their samosas are all right, although I wish the potato filling were a bit warmer inside. In general, it's good for its price range.", "author": "Finn G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-04-23", "description": "I have only gotten food delivered from this place, but it's been excellent every time. I highly recommend the lamb curry.", "author": "Srinivas R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-10-01", "description": "Excellent samosas and chicken tikka masala.  I absolutely *love* the fact that each of the entrees comes with your choice of rice or naan-- no separate purchase for them!  The great tasting food, the low prices, the friendly service and the fact that they deliver WAY the f**k out to my house earns them top ranking in my book.", "author": "Nicci S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-03-12", "description": "this place is actually decent.\ni've certainly had worse indian food; the buffet was well tended.\n\ni would recommend this place for the vegetarian options;\nthere isn't anything spectacular about it and the naan kinda sucked.\n\ni feel like i have to pull teeth to find excellence in this neighborhood, but i've heard that the ganges place is really good.\ni'll go there next.", "author": "linden d."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-03-04", "description": "one of my favorite Indian spots. have to order the food spicy though. otherwise it can be a little bland. The chicken tikka chicken makhni and vegi korma are all great", "author": "Dante Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2005-10-05", "description": "One of the best Indian buffets in the City. This unassuming restaurant provides delicious food and a friendly staff. Well worth the small trek out to the avenues.", "author": "Be N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-03-24", "description": "ordered delivery from here last night... i am still full, and it's like 4pm the next day.\n\nwe ordered chicken tikka masale, palag paneer, and the great india combo biryani, the naan with ground lamb, rice. (please excuse me if i butchered any of the spellings). i liked most of it, EXCEPT for the fact that the palag paneer had these weird seeds in it, and when i bit down on it, it released this bitter taste/flavor that numbed my tongue/taste buds. does anyone know what they are? either way, it kind of ruined my meal b/c i couldn't taste properly afterwards. \n\ni will probably order from here again, once i regain my appetite, but will specifically ask that they not put in those seeds. yuck.", "author": "Jessica W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-06-12", "description": "some of these reviews are pretty harsh. i agree the food is different.. but not disgusting. i have been coming to great india for some years now... actually it was the first place i ever ate indian food at; and i fell in LOVE! \n\ni moved out of sf last summer and last night was my first time back to great india since then. i ordered the vegetarian samosas and chana masala. the samosas were really really good! the chana masala was good but most definitely very different from what it used to be. the color of the sauce to how spicy it was, simply not the same thing. i liked the old chana better. this one was too runny and the beans weren't cooked right. \n\ni still enjoyed my meal; but had you asked me last week, i would have given this place four stars instead of three. i also don't remember paying $20 for my meals before... but what do i know?!", "author": "Kristin Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-08-20", "description": "First of all, why did they post a picture of a nice dining table with the Chinese character on the wall in their website?? Before coming to this restaurant, my boyfriend and I looked at their website to see their menu.  We had two $10 gift certificates we wanted to use and decided to use it on our day off.  The website looks really nice and when I saw the picture I thought the place was really nice too with that dining table there (but then odd with the Chinese character painting on the wall).  Plus we looked into Yelp to see how many stars they were given and decided it must be not bad.  \n\nWell, when we arrived to the restaurant for lunch, I found out we passed by this restaurant many times before but never tried it out.  In addition, I also found out the restaurant inside was pretty old, plain, and DEFINATELY not like in the website (no wonder there's a painting of the Chinese character on the wall...it's not even their restaurant!).  Feeling a little cheated but excited to try out this new place, we were shown to a table with a beverage menu, given two glasses of water, and sat down.  Both of us decided to order two chai and looked around waiting for the waiter to come and ask us what we wanted.  After a few minutes looking around, we found out everyone else seemed to be eating from the buffet and that the waiter wasn't going to come ask us unless we waved him down.  Well, that's what we ended up doing and wondered why we weren't given a full menu.  Is it because they only have buffet served at lunch?  The waiter wasn't even sure and said he had to ask the chef which turns out they do serve things in the menu.  \n\nAfter all that, we got our menus and ordered the onion naan, coconut chicken, and chicken pakora.  I never had chicken pakora before so I can't say how much better it can be but their chicken pakora was \"good\".  As for the coconut chicken with the onion naan: \"yum yum\"!  I wasn't into the chicken but loved the sauce with the naan.  Although I think it can be made tastier, it was good enough with the sauce being sweet, creamy, and tiny bit spicy.  As for the chai...ehhh...rather tasteless. =(  Kind of a disappointment considering it tasted mainly like hot milk with a bit of chai taste to it.  Naan and Curry's chai on Irving tasted much better the last time I was there (which was rather long time ago..~2 years).  Overall not bad considering we ended up paying only $6 out of pocket after the gift certificates. =P", "author": "sidney c."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-11-30", "description": "Great India is solidly in my delivery rotation. My order is consistent: veggie samosa, chana saag, navratan korma, and of course rice and naan. The last few times I had it, it seemed that the chef had changed - slightly off-tasting plum sauce, less than savory samosa, and all-around weirdness. But tonight's order came in strong again. And it's a good thing - because we waited an hour and fifteen minutes for it to show up! Unfortunately, this is not totally out of the ordinary for them. Great India...Crappy Delivery.", "author": "Kiesha R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-11-24", "description": "I'm sorry: I've got to object to the sinification of Indian restaurant menus.  Does every single one have to have the same goddamn items? I don't like having to go to the expensive joints to depart the orbit of punjabi and gujurati menu items.\n\nI got the veg thali with Mushroom Mattar, Chana Masala, and Veg Korma.  The mush mattar and veg korma had identical over-creamed, oddly-sweetened gravies.  The Chana Masala was actually quite good.\n\nNothing notable here: move along, unless you're trapped in the richmond and looking for indian amidst the east asian joints.", "author": "Srikanth S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-06-13", "description": "stumbled upon this place with some out of town guests. rather unassuming decor, and there were not too many people given that  it was a friday night.\n\nservice was excellent, as was the food. i'm just starting to like indian food and i've been a little picky. some the other indian restaurants in the city give me a bad stomachache and serious heartburn from all of the oil and grease. but i have to say that the food here was really good! i enjoyed everything we ordered and we also got a bottle of wine that was not overpriced. \n\noverall, very reasonably priced restaurant with great service and great food. will definitely return if in the 'hood.", "author": "Anne Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-06-30", "description": "I was craving Indian food, but I was cheap about it, so I thought I'd try their buffet. What I discovered over here is that the food tasted so familiar that I just wasn't interested anymore. It was basically just eating out of hunger and not so much for enjoyment. Nothing tasted bad though. There were less choices of dishes that other Indian restaurants had. But I guess it kind of satisfied my craving for a while.", "author": "Alex Y."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-01-22", "description": "While the restaurant has standard buffet fare as far as Indian restaurants go, I was somewhat disappointed in the quality of the food I ate there and I've been there at least three times, two times in the last month.\n\nThe tandoori chicken was rather dry and the buffet selection was rather limited.  And, while I do understand that Indian cuisine tends to utilize lots of curry in their dishes, their chana masala was rather spicy (for me).  And, the rice was rather plain with not much of the saffron present to color or flavor the rice.\n\nBy comparison, India Clay Oven has more variety and their curry dishes aren't nearly that spicy.  Please bear in mind, I've eaten at both establishments and have made definitive comparisons from my experience and observations.  However, I am not endorsing either restaurant over the other.  Just stating the facts as I am seeing them.\n\nI will say that the sit-down service was good, they are very polite and attentive, and it is quieter than a Chinese restaurant (they tend to be very noisy).  However, even at lunch time, they don't have that many customers, either.  I'm not sure if that's because of the economy, proximity of other competing restaurants (regardless of cuisine), or other factors/considerations.", "author": "E L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-04-10", "description": "I was visiting out here and I was hungry. Randomly saw Great India and their 6.45 buffet. It looked decent and we decided to eat there. Good thing, because that was some of the best Indian food I've ever eaten. The CTM and Lamb Curry was top notch. Their naan was thick and very tasty. Even at 1:30pm when the indian buffet food starts to \"wilt,\" Great India had fresh and great tasting food. They refilled waters regularly and were very friendly. If I didn't live all the way in Berkeley, I would be coming here on a weekly basis. As it stands, I guess I'll have to settle for any time I'm in the neighborhood.", "author": "Seth B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-11-26", "description": "Since the food is good and they didn't charge me for the extra chutney and green sauce, they got a 3.  It would have been a 4, but  I ordered a Mushroom Matar (plus other stuff) for delivery, and I bit into a staple  which was in the bowl of food.  Most likely it was from the delivery bag, but being a paranoid and concerned backseat chef, I gave them a call anyways, and that's what they said. That was that.   I thought it would have been cool if they did something extra though...high maintenance aint i?", "author": "EJ K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2007-10-15", "description": "I went here on the recommendation of a friend who usually has good taste. I never realized how much he must like salt because this place serves the saltiest Indian food I've ever had in my life. It wasn't just my dish, my friend was complaining that her meal was way too salty as well. Don't eat here unless you want to be thirsty for a good three or four hours after you eat.", "author": "Mike C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-06-26", "description": "The food was tasty however the server this time was not very professional and not very pleasant.  On a Saturday, we were surprised that we were the only customer. I've been before and tried their special tasting menu and was excellent.", "author": "James J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-10-08", "description": "So, my gbff (gay best friend fo-eva) was in town and kept buggin'  to get a dank Indian lunch buffet. So, after rolling past this place on the 38L so many times I decided Great India would be the best place to take him. \nIT WAS, oh yes, it was.\n\nWe went on a Monday lunch, so not too crowded at all. Sweet and savory curry and spice aromas waft up your nose right when you step in, and they seat you in comfortable pink tables (although I can see how it might be tight on a busy weekend). Immeadiately, we headed over to the buffet where upwards of 10 dishes called to me, including a zucchini curry and fluffy fresh naan. There are chicken and veggie options available. The potato curry with the mushrooms, the daal, and the saga olif (spell?) were out of this world, and I even went for a drumstick of tandoori chicken (moist, sweet, and not too fatty).  Their yogurt sauce was perfect... not too bitter, and the chunks of cucumber were long and stringly, kinda like onions (which I liked) ... I mixed it with their tamarind sauce and doused my plate with its creamy richness. Most of our conversation was peppered with \"oh\"' 's and \"mmmm\" 's, and \"holy cow (ha!), this is amazing\".\n\nOoh, my favorite was dessert; they have the tastiest, most satisfying rice pudding and fried donut honey-balls my mouth has ever experienced. Truly sensational. I wanted to die inside of my mouth it was so good.\n\nThe busboy couldn't understand one word or gesture I made, but hey, my water was constantly refilled. All for $8.00. STOKED. I'll be back.", "author": "Danielle K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-07-31", "description": "Had two deliveries from these guys and won't be tempted again.  The first delivery was excellent although a little pricey.\n\nThe second delivery on the other hand was awful, the chicken appeared stale, overcooked and tasted as good as it looked.  Thoroughly disappointed, I wouldn't be surprised if the chicken had been reheated.", "author": "P H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-08-10", "description": "We usually get delivery from this place. It's usually good but sometimes they don't get your order right. We went there to eat and it was OK. It's seems as off getting it delivered taste better. I will get delivery again from here but I don't think I will go there and eat. The staff is very nice.", "author": "Ge I."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-08-15", "description": "They have become too popular, and now have increased the prices. Before you used to bread/rice with your entree. Now you only get the entree. \nThe food is still decent, but not as much as before. The buffet is worth going, and still a pretty decent place.", "author": "Kuldeep T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-10-23", "description": "They must know my order by heart now.  I get food delivered once a week.  (Delivery is free and very speedy!)  My favorites are the lamb korma, lamb biryani, and vegetable samosa (the lamb samosa is good too).  I've also tried the Boti Kabab and Chana Masala (they were so so).  The Naans and Mango Lassi are also a must.  They stay open late too (always a plus).", "author": "C C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-06-02", "description": "They must have changed owners. They are such a rip off. If you are going to spend this much money I would recommend going to Roti Bistro in west portal. They are better. The food here is not good. At one point it was very good but now it rates a 1 star because everything is cold and the taste is awful. DONT go here if you want service with the flies and dont take out if you want cold stale food.", "author": "Manhav B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-10-05", "description": "Ordered out of nostalgia (used to order here a lot) and as a change of pace from India Clay Oven. \"Great India' is now a total misnomer - the chef is different, the Vindaloo was watery, and we were delivered saag paneer instead of shahi paneer. Two phone calls later, the delivery guy, who speaks next to no English, arrives and claims that we owe money for the shahi paneer! A third phone call straightened that out, but then he managed to mumble that we had to give the saag paneer back, after the second phone call said we could keep it. Slamming the door on him sent him on his way, and we'll never order here again.", "author": "Mark S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-06-22", "description": "no stars.  Delivery was 1.5hrs late.  Man at restaurant 1st said he didnt have our order on record, then he said it left late, THEN he said there was car trouble.\nDelivery guy said they 'forgot it' and demanded a tip.  I said no tip.  He left cussing and nearly caused an accident.  I was actually too riled up to eat it.  \n\nNo stars.  Zero.", "author": "dave j."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-05-12", "description": "I came here for the $8 lunch buffet. Seriously it was not bad for the money.  Clean and spacious dining area. \n\nWell, the salad can be improved, so is the dessert section, at least adding some mango ice cream or pudding.", "author": "Amy C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-05-10", "description": "NO! Great India used to be great (not perfect), four stars great. We found a few favorites, stayed away from the bland samosas and expected to wait \"forty-five minute\" for the delivery. Once they forgot a dish and were very apologetic, offered to give us credit for it since we had paid by the time we noticed.\nMy husband called them up last wednesday and didn't tell me about the no rice/naan change but the change in the food was visible. I thought they sent the wrong dishes because the colors were totally different than they used to be, both yellowish and oily. Both the chicken dish and the chana masala were bland and almost entirely sauce - it was like there's just one pot of \"sauce of india\" they ladle over everything. There were only about 15 chickpeas in the whole container. I used to recommend this place to everyone and now I'm going back and warning them away.", "author": "Sarah L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-10-16", "description": "This place is touch & go.  I always like the pakora, which amazingly is not something I can say about all Indian restaurants (how do you mess up fried food?), but the rest you can never predict.  I need to start asking about who happens to be cooking on any particular day, maybe that will help.  I used to get take out from here every other week or so, then three times in a row it was just awful.  One time I'm pretty sure they used like Chef Boyardee tomato sauce & it was obviously frozen green beans, peas & carrots for the Navratan Korma.  It was horrid.  My boyfriend talked me into going here again because it's so close, and it was pretty decent, but then again three times in a row it was nasty.  He's finally accepted defeat, and we probably won't go here unless we're really desperate.  They're very friendly, and I want to like them, but they need to be more consistent.  Also, naan & rice are EXTRA, aren't they usually included with entrees, or is this a new trend?  It gets to be pricey, and it's not worth it.", "author": "Ljótur H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-04-25", "description": "It took more than two hours to deliver at home! And when it came it was freaking cold!", "author": "Joana R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-08-29", "description": "the food is good but its not great. but who can resist delivery i love anyone or anything that brings me food.", "author": "Morgan G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-09-12", "description": "Great India delivers directly to the Veterans Affairs hospital call rooms -- can't beat that. Tasty and filling, although at $9.50-11.00 for entrees it's not exactly value. When you order takeout, remember to request utensils and napkins.", "author": "A. T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-06-26", "description": "The buffet is skimpy. Mediocre at best. But I go here in a pinch, or when I want some variety. Plenty of other excellent Indian buffet choices, though. And I haven't tried any of the actual entrees. My roommate used to get takeout here all the time with her boyfriend, and they seemed generally pleased.", "author": "Joseph R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-05-19", "description": "we hit up this spot one day after some festival. auto was a little nervous bc he never really had indian food before this. but i got some lamb and we all had some bomb ass luncheons.  the sauces were delcious the appetizers we got were awesome-ito and we all laid some stinky indian farts afterwards", "author": "Victor B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-02-23", "description": "Went here as soon as I moved to outer Richmond.  Indian food is my favorite and when the buffet was decent, I knew this place would be a staple of my diet for a long time.  Ordered delivery from them once with no problems.  The second time is when disaster struck.  I gave the woman on the phone specific driving instructions (apparently they don't keep records like the rest of the world), after my food didn't come for an hour (I live 5 blocks away on the same street as them) I called to see what the hold up was.  I was told by the same woman that the driver was lost.  Driver called claiming he was on my cross streets.  I kept him on the line and went outside to see.  When I told him I couldn't see him he started yelling over and over that he was on my cross streets.   After he hung up on me I got a call from someone else claiming to be the driver (with a distinctly different voice and accent) saying that he was on some cross streets 14 blocks away.   I explained the problem and eventually got my food.  Unfortunately they lost at least a year of consistent business from my roommates and I.", "author": "Nate W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-11-26", "description": "lunch buffet is good, $7.50 if I remember right, and lots of good food, vegitarian as well as meat.", "author": "C D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-10-17", "description": "Depending on the selection, their buffet can go from average to spectacular.  The buffet is inexpensive.  The staff is friendly, and they're getting better at refilling water without having to be flagged down.  The mango lassi is definitely the best.  It's wise to go early, before other people get there.  Unlike other buffets, this one seems to have customers who reuse their plates.  Yuck!  And the staff doesn't say anything.  Perhaps they could put up a sign, like I've seen at other places.  My only caveat is that I seem to fall dead asleep twenty minutes after finishing my meal.  I have just enough time to drive home and walk in the door before I'm out for several hours.  And it's not just me but everyone I bring there.  This only started happening maybe six to nine months ago because I remember feeling wide awake after eating there a long time ago.  So I don't go there very often now, unless I'm craving some spicy food.\n\nUpdate: after having eaten my way down the penninsula at various lunch buffets, I find this place is better than Suraj (Redwood city), Bombay Garden (San Mateo), a second one in San Mateo I can't remember the name of, except that it had a dancing area, and Amber in Mt. View, for various reasons.  I guess it's the $6.45 price, along with the consistently good quality lamb (very large, lean, tender chucks with no gamey flavor) and large chicken breast meat in the other dish.  Tandoori's good here too, but I usually eat the lamb.  This place is wonderful if you are a carnivore, as the vegetarian dishes change out and is inconsistent in yumminess.  For example, the mung bean dal was absolutely, terrifically wonderful (I wish they would make this a standard dish like they do with the lamb and chicken), but I don't care for the brown colored chili dal.  And when they have eggplant, I'm in heaven.  The mango lassi wasn't as good as I remembered, but I don't fall asleep after eating here now, either.  So, that's a pretty good exchange, I guess.\n\nI would suggest that they wipe the linoleum floor in front of the buffet station because it always seems sticky.", "author": "A P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-25", "description": "Great India is Great!  I was very impressed with the quality of everything!  Some of the reviews here are pretty harsh. It's agreat place to go with a group of people.  The highlights on the menu are the Chicken Korma and Banghan Barta.  Overall, one of the better Indian restaurants in the city.", "author": "Marko C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-01-24", "description": "I love the buffet here.  Today I decided to try India Clay Oven on Clement instead of Great India---Big Mistake!!!!  The buffet food at Great India is delicious and they actually have dal, unlike the aforementioned restaurant.  The only reason I'm giving Great India 4 stars is because they don't have soup on the buffet, and neither did the other place.", "author": "leigh m."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-05-17", "description": "What happened? We used to get awesome food from here and now we go elsewhere. The quality began to deteriorate and the cost went up.", "author": "Nicole M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-05-19", "description": "yo this place is the BOMB. i dont eat much indian food tho, i gotta say. its kind of expensive. prolly like 10-15 dollars a meal. got some curry something with some chicken or other meat. good ass food here. i reccommend if youre a baller on a wide budget. they place the tables like 2 inches apart, so you can hear everything the table next to you is saying. it feels awkward, but i personally love those situations. the music in here is top notch as well.", "author": "Wats C."}
