{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-18", "description": "I'm so glad this place is still here. For real, I get worried when small business food joints with stellar eats & treats open in the City because the competition is tough. Grubbin' sandwiches are IT! \n\nThey do not skimp out on the meat or other ingredients in their sandwiches. I've had their vegetarian sandwiches (Crunchin' and Tastin'), and they are both dee-lish and filling! \n\nThe fam loves it too. We've been coming since it opened and we will continue to!", "author": "Lani S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-26", "description": "Finding a GOOD basic vegan deli sandwich can be hard to find and I am elated to have found this place!\n\nI ordered a custom sandwich with lettuce, tomato, pickles, avocado and cucumbers with mustard on dutch crunch bread. When I say it was quite possibly the best sandwich I'd had in years... The bread was warm and soft. Some dutch crunch is hard when you bite into it and scratches the roof of your mouth but this bread just melted! I am now a loyal fan!\n\nParking was easy and I didn't wait long for my food. Super fast and nice service. I highly recommend!", "author": "Angela H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-19", "description": "Grubbin' is so damn good that I came back for the second day in a row for an encore.\n\nListen, everyone working here is 100% efficient and friendly. Your food will get to you lightning quick because the kitchen is right behind the cashier and they will start making your order AS SOON AS THEY HEAR YOU SAY IT.\n\nThe food itself is absolutely amazing. They have so many options for bread, whether you like a typical Dutch crunch or just want to go conventional and have it between two slices of white bread. They've got all the sides you need, from fries to chicken nuggets to wings, and even just plain old chips. The best part--they serve your sandwich so piping hot that you won't even be able to hold it for the first few seconds. The sandwiches themselves are so filling that I can usually down a Subway footlong in one sitting, but I can only eat half of a Grubbin' sandwich!\n\nI definitely recommend the sweet or spicy mouth waterin' chicken sandwich. It's delicious and has sooo many flavors and a generous amount of chicken tenders. If you've ever been to NYC, it reminds me of a better version of a Sticky's sandwich. \n\nOverall, I completely love this place. It's like paying for Subway and getting something waaaaay better.", "author": "Claire C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-09", "description": "SO DELICIOUS!!! Drop everything and grab one NOW!\n\nI love delis and I love sandwiches. This place did not disappoint. The exterior is really plain and the inside is nothing to write home about, but the sandwiches are AMAZEballs.\n\nThe menu is written on the chalkboard and their selection might be a little overwhelming. I was initially skeptical bc their sandwiches sounded a little too \"fancy.\" But the taste has won me over.\n\nI ordered a Grubbin sandwich and it came out hot and fresh on that delicious dutch crunch! It was pretty meaty and the flavors paired well. The prices are reasonable and the staff is super friendly. We couldn't finish our sandwiches and they packed them up for us to go. BTW they were still good the next day toasted up!", "author": "Junella T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-13", "description": "Stop everything and head over to Grubbin' RIGHT NOW. I first discovered this joint a few years ago and have been a loyal customer since. \n\nTHE MENU: the selection of sandwiches is not as extensive as other sandwich joints (i.e. Lou's sandwiches) but thats exactly what makes GRUBBIN so darn good! Give their classics a try and trust me...you will be hooked!\n\nTIP: The spot itself is quite small but if you come after peak hours, you will secure a table! Parking may also be difficult in this area but I always manage to find a spot right in front.\n\n-----\nFor more food tips, follow me on Instagram @munchieswith_m", "author": "Mary L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-12", "description": "The shop may be small but the sandwiches sure aren't! \n\nMy boyfriend and I stopped by today for a late lunch/early dinner and ordered the Grubbin' It and the Spicy Mouth Waterin' - both on dutch crunch bread. Both came out piping hot (I got a bit too excited and pretty much burned myself on my Spicy Mouth Waterin' but it was worth it!) First off, the bread is perfect and it such a great textural element against the meatiness of the sandwiches. And the sauces - wow - so bright in flavor and they just really tie everything together! \n\nOf the two, I preferred the Grubbin' It (mainly because I just prefer the meats in this more) but would recommend both! \n\nThey have quite a few options so I'll definitely be back to try more!", "author": "Janice L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-10", "description": "Cozy little sandwich shop in San Francisco. \n\nThe Spicy Mouth Waterin' is one of my favorite sandwiches to get! The dutch crunch bread is phenomenal with the chicken. The grubbin' sauce comes together so well with the slightly toasted bread, fried chicken, lettuce and more. This sandwich doesn't taste spicy at all, however. Still, one of the better sandwich shops in San Francisco. \n\nThe prices are reasonable and the staff is friendly. There's a TV playing entertainment and several tables for people to situate at. Overall, a lowkey and chill place.", "author": "Karen Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-10", "description": "Quality meats and breads. The sprouts really give it a nice texture and flavor. The grub sauce is pretty good too. \n\nWe went with the Lickin' and Droolin' - both pretty good. Very reasonably priced and good customer service. Would def come back if I'm in the area and want a good sandwich.", "author": "Alic H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-10", "description": "Really good sandwich flavor combos. Definitely call ahead and get your order to go since the wait can be long!", "author": "Jessica C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-09", "description": "Grubbin' ... this was a term my friends and I used back in the day to describe something incredibly tasty. Recently, I saw several of my friend's posts of their sandwiches, so I had to make sure to make a trip here when I'm back in the Sunset of SF. \n\nRight after the New Year, I wan in town and called my friend who posted the photos and came here for lunch. The place is small, a few tables that seat 3 to 4 ppl.  A large menu hangs on one wall while a big screen is on the other. \n\nTheir signature sandwich appropriately called the 'Grubbin' It' caught my eye. It has salami, smoked ham, pastrami and bacon, plus some plant stuff to counter the saltiness of the meats. I opted for the Dutch crunch roll. The crunch of the roll mixed with the salty meats, the bitterness of the sprouts made this one of the better sandwiches I've had in recent memory. \n\nWe were also comped an order of hot & crispy tots. \nI can easily say if I lived in the Sunset, I'd be a regular too. \n\nNotes:\n* Yelp check in gets you a free bag of chips\n* Street metered parking. Many meters were jammed so you may need to use a credit card. \n* Self serve water by the counter", "author": "James L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-09", "description": "Spicey Mouth Waterin is delicious!  My first time ordering here.  I will definitely be back.", "author": "Cyprian S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-05", "description": "I can't believe I'm giving a sandwich shop 5 stars because I usually hate sandwiches but this place is sooo good! I usually get the Droolin' (pastrami, salami, lettuce, tomato, and spicy mayo sauce, on dutch crunch) and a side of the Grub Fries (garlic fries). They also have Mexican Coke (sugar coke), and together it's a trifecta.  Boyfriend is a sandwich connoisseur and he always gets the Grubbin' It sandwich. We're both addicted to this place. Plus the workers are really nice!", "author": "Vivian W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-17", "description": "Maybe the best sandwich I've ever had. Stacks up with Ike's and any other sandwich shop I've been to in the Bay Area.\n\nSmall shop with some great side offerings as well, I'm looking forward to stopping by again and trying their other options.", "author": "Andrew E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-01", "description": "Second time I've been to Grubbin' now and I definitely enjoyed this experience more than last time. I ordered the house recommended Grubbin' and found it made just right. The meat (pastrami, smoked ham, salami, and bacon) was stacked nice and high but admittedly, it was composed mostly of pastrami and ham. Pesto and grub sauce added a nice creamy richness while the non-negotiables (lettuce, tomatoes, and pickles) brought it all together. Dutch crunch was also the perfect vessel for this sandwich.\n\nTo complement my sandwich, I opted for a side of tots. Fried fresh, they were crispy and piping hot when delivered, but were a tad overfried in my opinion. Still good though. Certainly satisfied my craving for something fried.\n\nAll in all, nearly $14 for a sandwich lunch isn't the cheapest on the block, but it was certainly a taste that did merit the price.", "author": "Elaine Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-12", "description": "Great sandwich shop located in the Sunset district of SF. Stopped by here for a late Sunday lunch (~3pm) with a couple friends and surprisingly it was quite bustling. \n\nI ordered their Juicin' sandwich, which came with turkey and bacon as the main meats, with some avacado, provolone cheese, and pesto sauce. You can choose your bread option and I went with the standard dutch crunch. This was a solid sandwich -- a good amount of fresh turkey and bacon bits sandwiched between a good amount of veggies (tomatoes, lettuce, avacado) and with a good pesto and cheese kick. Portion size was good for the price ($10).\n\nDefinitely highly recommend! They have a lot of different options to choose from.", "author": "Alvin W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-11", "description": "Came here 2 days ago. Got two tater tots, 1 grub fries [garlic fries], and grubbin it sandwich. Tater tots were $4.50 each, and the grub fries were $6. For SF, the tater tots were actually pretty big! You could share it between like 2 people. The fries size was not bad either. The grubbin it sandwich was 9.75 and was pretty good as well. They use a type of beansprout for the lettuce i believe, which had an interesting taste! Parking you could find around the streets, in front, or residential areas.", "author": "Kyle H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-19", "description": "I've been coming back to this place forever cause the sandwiches are handdown the best in the neighborhood. Everything on the menu is hella good. These are also one of the best vegetarian sandwiches I've tried too.", "author": "Jason X."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-27", "description": "Been here a few times and it never disappoints. You can make your own sandwich or order from their specialty menu. I like to order the Droolin' sandwich. Great bread and the sandwiches are always stuffed, leaving me really full at the end.", "author": "Lillian B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-04", "description": "To be fair, I had more \"complex\" sandwiches before from some other shops around that area, BUT, this place was fast, tasty and cute. Sandwich while on the simpler side was super tasty. The best surprise was: the dutch crunch. I usually very worried about it as it tends to be way too crunchy and not so much fun, but that one was fresh and tasty and not overly crunchy (that is how I prefer it).\nLoved it! Will come back!", "author": "Nastia R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-04-23", "description": "The store was a mess when I came in. Dirty tables, overfilled garbage, boxes of supplies everywhere. There was a disorderly a mess behind the counter in area that food was being prepared, thus I was hesitant, but my friend recommended this place so I ordered anyways. \n\nThere was no one in front of us at the store, 3 people came in about 3-4 min after us, the sandwiches took like 15 min to make - which I thought was super weird since there were three employees. Sure if they were cleaning up the tables, the trash inside, organizing supplies or tidying the place up I would understand, but nope they were just chilling doing the minimum. \n\nI thought it was odd that 1 group of people who came in after us got their food 5 min before we did. \n\nI tried a roast beef wasabi Sandwich & the fried chicken strip sandwich as we spilt sandwiches to try them both. The meat in the sandwiches was generous proportion wise, the Dutch crunch we got was great, the Sandwhich was good overall. \n\nThis is the type of place I would rather have a had never see the inside and just be unaware of the messy conditions. If things are a mess everywhere I can see, I just don't trust that the conditions in which the food is prepared, stored and handled. \n\nIt's 1 block away from Lou's so I really don't think it compares sandwich wise - they do make fries and tots so I can see that appeal to some. \n\nLong review short, I don't trust my friends recommendations anymore", "author": "John O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-08", "description": "Ok. So checked in Yelp for a good lunch place while visiting near SFSU. I have to say that the sandwiches my family and I ordered are among some of the best I can remember eating. I highly recommend the Dutch crunch roll as the bread choice.", "author": "Neil Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-30", "description": "This is my favorite sandwich shop in the Sunset. Their fixings to bread ratio is perfect, and the bread is always the right amount of crunch and heartiness.\n\nMy go to is the Juicin' with pepper jack.\n\nOh, the best part about this place is that you can get a side of hot fries or tarot tots with your sandwich!\n\nSkip Lou's am go straight to Grubbin'", "author": "Mimi T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-16", "description": "Food here never disappoints. The wait for the food is a bit long during lunch time but it is still worth it because the portion of the food is perfect size and the price is not bad for the size of it. Typically during the school year there will be more people because of the high schoolers but definitely worth trying the Lickin' and the Fishin'", "author": "Tiffany C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-05", "description": "Great place for sandwiches. If you like the SF sandwich variety they got it at Grubbin'! Dutch Crunch!", "author": "Jeremy S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-17", "description": "Great sandwiches and everyone that works there is so customer focused!   Would definitely recommend Grubbin' to everyone!     \n\nPlus everyone should go a place that does tots as well as Grubbin'.    \n\nSecret menu item suggestion: Nacho Tots!  Tots w/ cheese, avocado, pico (tomatoes, onions, cilantro, jalapeño), bacon, olives, green onions... most of the stuff they already have for sandwiches.", "author": "Fun T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-09-06", "description": "I'll start by saying that I'm a fan of Lou's Sandwiches Cafe down the block. I'm usually at Lou's on Saturday, after my son's baseball game. But last week the game was moved to Sunday, and on Sunday Lou's Cafe is closed, and I had heard and seen good things about Grubbin, so my family and I went to try it out. \n\nThe menu is cute, lots of funny names and such. The description of each sandwich is kinda hard to read though; maybe that's just me. The script font makes it stylish but confusing. But that's just me, so no worries.\n\nI decided to order a build your own regular sandwiches, a turkey and cheese and a pastrami. The service was great; friendly and welcoming. No problems with checking in for a free bag of chips. \n\nThe sandwiches came out pretty quickly. Compared to Lou's, the sandwiches are smaller. You get less meat and less filling. Maybe that's just me because others have commented on the huge quantity of meat. Both my wife and son made similar comments about the smaller size, so ymmv. The pastrami was made incorrectly; there was both pastrami and ham inside. I didn't want to wait so I just accepted it.\n\nThe sandwiches were ok. The grubbin' sauce wasn't special in any way. I couldn't taste anything special about it. There really wasn't much sauce. The meat was just your average meat. I don't have anything really to add... the sandwiches were decent. If Lou's was open, I would go there. If not, I might come back here. It's nothing special, but it will fill your tummy for a quick lunch.", "author": "Dom L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-10", "description": "Oh my goodness! So tasty.  Turkey, avocado, bacon and grub sauce (garlic aioli). Hot fresh tater tots! So glad we stopped here!", "author": "Dawn T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-24", "description": "This is actually my favorite sandwich place in the entire world. I was trying to track this place down for months and I finally got it. They have the best sandwiches with the best homemade sauce. I am so happy I found it and I will be going back to San Francisco soon; literally just to eat the spicy sandwich...", "author": "Noesh H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-10", "description": "Ikes sandwiches? forget that! Come here instead. A quick yelp search led me here on my trip to San Francisco. My typical SF trip consists of clam chowder but I wanted something a bit lighter. This place is seriously one of those hole in the wall places. I was recommended the JUICIN and SPICY MOUTH WATERING. \nI got two both and split with the boyfriend\n\nSpicy mouth watering $10\na chicken sandwich with a mild sauce (kind of like in n out sauce, or thousand island with a kick) on your choice of bread.\nI am a baby for spicy foods but spicy mouth water just had a little kick which was perfect. The chicken had the perfect crunch to it and was very thick and juicy! Served on a double crunch roll, game over. Hands down the better sandwich!\n\nJuicing $10\nA BLT sandwich with ham? topped with a pesto/ranch like sauce on your choice of bread.\nI am not a fan of BLT, but this sandwich was something else. There was so much ham, which is a great thing because you get your bang for your buck. This was satisfying, but it did not hit my taste buds the way the \"spicy mouth watering\" did.\n\nWe also got a large fries to share! \n\nGet the double crunch roll, you will not regret it.\n\nDon't forget to check in to get a free bag of chips!", "author": "Emily L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-26", "description": "This is probably one of my favorite sandwich places ever - and yes, it's way better than Ike's or Lou's. I was a former Lou's fan until I tried this place! \n\nI loooove bread and seriously, their dutch crunch is perfect *_* it goes well with any of their sandwiches! My go-to sandwich is \"Juicin'\" which has turkey, bacon and avocado (and the other fixings) when I'm in the area. Their sandwiches are HUGE, so definitely share or have an extra meal. Seriously. It's so good I try to finish the sandwich even though I shouldn't lmao.\n\nBonuses - accepts card, has stamp cards, and free chips if you check-in on yelp :)", "author": "Julie L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-10", "description": "Truly enjoyed \"crushin\"! Felt really satisfied after inhaling the sandwich. Perfect amount of aioli sauce which wasn't too harsh when I went back to work and didn't have garlic breath. Definitely will be back!", "author": "Cee B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-23", "description": "Super yummy sub sandwiches! Service is always courteous and quick. And they are not skimpy on the meat! One of my favorite places to go...", "author": "Darryl H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-02", "description": "This is funny. It turns out they have been here for 3yrs, and i never noticed until the other day. \n\nWow. So amazingly delicious. My friends and I ordered 3 different sandwiches and they were all amazing. \n\nStaff was very friendly and courteous. Wait time could be long but its so worth it. \n\nLuckily i live up the street, because this is gonna be my regular spot.", "author": "Dave B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-18", "description": "Great service, great sandwiches. Ordered through Grubhub multiple times, and pickup has been quick and on-time. No complaints!", "author": "Kelvin Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-25", "description": "This place has Fast service, great sandwich, and friendly people. I will definitely be coming back.", "author": "Aaron P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-19", "description": "My favorite sandwich shop in the city!! Their Dutch crunch bread is always crunchy and flavorful and I love their combinations. They're very nice about customizations and most of the time service is pretty good. I also like the tater tots there - super crispy. My go to sandwich is the \"cravin\" which can usually feed both me and my guy friend with a side of tater tots (sandwiches are big). Parking is usually not to bad and these sandwiches also keep well if you want to grab one to go to the park or beach. (Pic is the quarter sandwich I already started eating because I was too hungry but you can see how fat it is)", "author": "Anna N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-06", "description": "Lives up to its name! I had the Juicin' and it was definitely Grubbin! All the flavors and textures of the toasted sandwich melded very well. \n\nWill definitely come and try the other sandos.", "author": "Adrienne F."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-10-21", "description": "I'm not usually one to write bad reviews, but when a restaurant and its workers don't take food safety seriously, it really pisses me off. With that being said, my boyfriend and I came to Grubbin this afternoon for our first meal of the day. We haven't eaten any big meals since around 3pm yesterday, so there was virtually nothing in our stomachs.\n\nWe ordered the Spicy Chicken Sandwich as well as the Sweet Chicken Sandwich with a side of tater tots. While waiting for our sandwiches, we noticed a lot of flies buzzing around... There were honestly so many flies, that I had to shoo them away from me and the food every couple of minutes, which I thought was pretty annoying and a little gross. I know it's hard to keep flies under control but there has to be a reason why they keep coming around. Maybe food is left out on the prep counters?\n\nAnyway, the food was good, however we both noticed that the sandwich made us incredibly thirsty for some reason.... I couldn't finish the rest of my sandwich because of that, so I opted to take it to go hoping to eat it later. \nFast forward a half hour, we both get crazy stomach pains while shopping. At this point, we both realized that the sandwiches were no bueno. We now have to cancel our plans for the rest of the day since we've spent the last few hours taking turns in the restroom -_____- !!!! \n\nLooking back on some other Yelp reviews, I see that we weren't the only ones to experience this. Grubbin, please please please be careful with handling food!! I can't stress this enough. Please don't continue to make anyone else sick.", "author": "Audrey G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-28", "description": "I was in the area and found the Yelp listing for Grubbin' so thought I'd give it a try. I love a good sandwich, especially when there are interesting combination of fillings. \n\nIt was a Saturday around 1 pm. There wasn't a line, so I stepped right up and ordered. Everything on the menu sounds delectable, so it was really hard to decide. I went with the Grubbin' sandwich (Pastrami, Smoked Ham, Salami, Bacon, Sprouts, Cheddar Chesse, Pesto Aioli, and Grub Sauce) on Dutch Crunch. The bread seemed very fresh. It was crispy on the outside and soft on the inside. The toppings were also very fresh and the sandwich was stacked and wrapped neatly. It came out warm, but with the amount of meats stacked up, it wasn't warm all the way through. I think it would have been even better if it was warm throughout. \n\nService was very friendly and it seemed like they had more than enough staff to handle a line. The dining area is pretty small, but they had Moana playing on the TV to entertain me while I was waiting. Parking can also be a challenge on the streets nearby, so allot some time for that. Overall, it was a very tasty sandwich, washed down with an Arancita San Pellegrino soda, for about $13. It was tad bit higher than I'd like to pay, but I'd still come back if I was in the area to try the other offerings on the menu.", "author": "Diane A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-03", "description": "This spot has lots of seating for a sandwich place :) \n\nWe got the juicin and droolin, both were yummy. The juicin was more savory and the droolin was more sweet. If you have a sweet tooth like me I'd suggest the droolin :). The Dutch crunch did hurt the top of my mouth but that's okay it was worth it. Lol\n\n\nThere's parking around this area which is a super plus in SF.", "author": "Melanie T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-04-02", "description": "I came here while on my lunch break hoping to get a quick meal. I saw lots of 5 star reviews and i was super excited to get some good food. It was very quick but not very good. It wasn't bad. But it wasn't good. I got the sweet chicken sandwich (forgot what it's called) It not only wasn't sweet, it didn't really have any flavor. The chicken breading didn't taste like didn't have much seasoning and the only sauce I could taste was maybe a lightly seasoned mayo? I came back in the store simply to ask for hot sauce to help the lack of flavor and they tried to charge me for that.  nevermind. Bye. Besides the fact I walked back in empty handed without my wallet, my sandwich shoulda came with flavor I shouldn't have to pay extra to put it on my food!!", "author": "Erika J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-31", "description": "FAVORITE sandwich spot in San Francisco. Get the Dutch crunch bread with your sandwich. Is a Bay Area favorite for a reason!", "author": "Erin J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-12", "description": "When I first arrived, there's a short line in front of the door and eventually the line grew out and became really long. Good thing I was able to beat the crowd and came before the chaos came rushing in. \n\nFood quality: very fresh and hot when I first received my sandwiches. Ordered the grubbin and juicin sandwiches. I have to say, everything looked so good! Then the tater tots came out as well freshly fried!! Overall the food was great, crunchy bread and good stuffings in the middle. Personally I like the grubbin more than the juicin sandwich, because there's more variety of different meats in grubbin and when you bite into it, it is way more satisfying. Juicin sandwich is good too but it's only one type of meat however the good thing about this sandwich is included with avocado! Who wouldn't love some avocado in their sandwiches!?? The tater tots were good too, really fresh and crunchy!! But next time I would want to try the grubbin fries, looked even better!!\n\n\nFood tip: check in on Yelp to get a free bag of chips!", "author": "Joanne C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-06", "description": "With some delicious sandwiches, grubbin' is what you'll be doing here! \n\nYou can make your own sandwich or pick one of their speciality sandwiches. I always order the Spicy Mouth Waterin' Sandwich (chicken tenders, spicy aioloi, ranch, and grunch sauce). They toast your sandwich unless you tell them otherwise. My friends and I agree that their Dutch Crunch is DA BOMB. Sandwiches are filling and super tasty - one of the best local sandwich spots in the area! \n\nService is fast and friendly, usually I see the same people working. There's a TV and a few tables and seating inside. You can also get a free bag of chips if you check in on Yelp! \n\nI highly recommend checking this spot out. Great service, great sandwiches, great prices...great GRUBBIN'.", "author": "Kristal D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-08", "description": "AHHH I love sandwiches!! These are so good! \n\nI got the Juicin - turkey, bacon, avo, with all the fixins. The garlic aioli is a MUST. Only negative (but not really a negative at all), the bacon wasn't really present, I even forgot there was suppose to bacon in the sandwich until I tasted a little nibble in the form of bacon bits as opposed to strips. But, the sandwich was super tasty without it so I'm not at all disappointed. My dad got the Grubbin - pastrami and salami with a spicy aioli and the works. He also enjoyed his a lot. \n\nI will be back for a delicious sandwich made by friendly staff.", "author": "Adriana G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-10", "description": "I'm not a really big fan of sandwiches unless it's Vietnamese sandwiches, but I love their Kickin' which is roast beef, bacon, pepper jack cheese, wasabi spread, and Grub Sauce. Their wasabi sauce definitely did it for me!", "author": "Christina C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-18", "description": "Delicious sandwiches!! We ordered the Droolin and the Kickin', wasabi was awesome! Had nuggets and tots for the kids. Great place we will be back.", "author": "Genevieve A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-24", "description": "Great sandwiches at a great price. Highly recommend the sweet mouth waterin! Not a lot of room to sit down but always an amazing sandwich.", "author": "Patrick T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-23", "description": "It's grubbin' what can I say. When I'm in sandwich mode this is my go to spot. \n\nTheir names for the sandwich different from most places. \n\nI've enjoyed all their different sandwiches, even the veggie ones. \n\nI always order the tatertots here. Very addicting. \n\nSandwich are not small by any means. \n\nGood job grubbin'", "author": "Lyman C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-17", "description": "Erica is awesome, she made one of the best sandwiches I've eaten in a while in the Outer Sunset.  This is the Juicin' Turkey Sandwich that I ordered.  This is Ike's quality sandwiches out here.  Will definitely go here again.  The L takes you directly in front of it.  Very convenient.", "author": "Wilson K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-17", "description": "It's my first time here since I don't really come to Taraval. This place was recommended to me from a close friend of mine and she suggested I try their tater tots. This is exactly what I came here for. The ambience in here is very quiet, at least for a Thursday afternoon. They have tables inside and like one table outside plus a huge tv on the wall. Food came out quickly and the tots were heated up perfectly without being oily. My server/cashier; Alyssa was super nice and helpful. She even knows how to joke around instead of being the boring cashier. Everyone loves a girl that can joke around! Anyways this place is perfect to do homework and eat since it's quiet.", "author": "Lisa W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-31", "description": "I have heard good things.\nStopped by to eat but so crowded - I was not able to wait.\nI'll have to try again!", "author": "Carla J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-18", "description": "Update: still great, they do not deserve 4 stars just because I was cranky and annoying two years ago. Favs: spicy mouth waterin', fishin'", "author": "David G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-14", "description": "Great sandwich spot. I bought the Juicin' sandwich and the meat to veggie ratio was pretty generous. There was a lot of turkey in my sandwich and while I appreciated it, I would have gladly traded some of it for more of the veggies. I asked for extra pickles and I didn't get as much as I thought I would. All in all, good sandwich spot. Decently priced. Not a super huge sandwich, but it's enough to hit the spot. The dutch crunch they offer definitely hits the spot.", "author": "Thomas C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-21", "description": "I got the grubbin sandwich with everything!! The sandwich was very fulfilling which is what I tend to look for at deli places. It was packed with flavor as well! Customer service was very kind, I asked a lot of questions while ordering and they managed to walk me through a lot of it. They also brought our order to the tables we were sitting at (wasn't sure if they were suppose to or we just didn't hear them call our order, not really sure how that works) nonetheless would definitely come again!", "author": "S T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-20", "description": "New favorite sandwich place. Take it as it is on the menu, as the chef intended! \n\nSandwich names are little goofy, and they don't help me remember which is which - however delicious. The only thing that the goofy names do for me is remind me that they use goofy names.", "author": "Phil Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-04-17", "description": "The sandwiches here are very tasty but also very pricey. Ordered the 'grubbin' sandwich and it was delicious but expensive. Irving Subs sandwiches are a lot cheaper but may not be as tasty...and Irving Subs also use gross shredded lettuce where as Grubbin uses yummy pea shoots (think that's what they're called)\nAlso, very slow service with employees that seem to take care of online first.", "author": "Brooke F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-20", "description": "Their sandwiches are amazing !! Really good. I finished the whole thing so fast.. great service too. Just love this place.", "author": "L T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-11-27", "description": "This place sucks! I got food poisoning from their nasty ass sandwich. If i can give them zero star I would. So I ordered for pick up and my boyfriend picked it up for me. He got home, handed me my sandwich and i opened it. First thing I noticed, the bread was burnt, while i was eating it, i told my boyfriend that the sandwich was hella dry. Right after I finished the other half. I felt weak as if i was getting a fever. Sure enough i did, followed by stomach cramps. My stomach was aching the entire night and i felt sick, i was going to the bathroom every minute. Stay away from this place!!", "author": "April Rose C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-25", "description": "Located on the streets of Taraval, next to a park and the police department, this little family business offers some great sandwiches. Parking is either residential or metered; it can be a hit or miss depending on the time of day you go. Service is friendly. Place is small with 2-3 tables and a window bar seating. Check in on yelp to get a free bag of chips!! \n\nWhenever I grabbed Ike's, my cousin would always tell me to go to Grubbin' instead. I never listened though, because it seemed out of the way (Ike's was at Serramonte.. 2 birds with 1 stone cause I could eat and shop!). My boyfriend tried this place out while nearby for a haircut and loved it! He introduced it to me and I thought it was pretty darn good .. still didn't beat Ike's for me at the moment. My first visit, my boyfriend and I split Juicin' and Droolin'. My most recent visit, I tried the Grubbin' It and LOVED it! All with Dutch Crutch & everything on it! :) \n\nJuicin' ($9) - Turkey, bacon, avocado, sprouts, provolone cheese, pesto aioli, and grub sauce. I thought this sandwich was good but not to my liking probably because I'm not much of a turkey meat person.. it was my boyfriend who loved this one. I'm biased! \n\nDroolin' ($8) - Pastrami, salami, pepper jack cheese, spicy aioli, and grub sauce. You can never go wrong with a sandwich topped with meats!! Loved this one because of the pastrami. \n\nGrubbin' It ($9)  - Pastrami, smoked ham, salami, bacon, sprouts, cheddar cheese, pesto aioli, and grub sauce. My new favorite sandwich!! It's soo good when topped with all these yummy meats. I didn't see it the first time I came and I regret it! But it made my mouth water. I guess I should've figured because it looks like the house sandwich with the name 'grubbin'. Totally recommend this one if you love meat! \n\nAside from their specialty sandwiches, you can build your own as well. You can also add-on pickles, jalapenos, and pepperoncinis for freeeee. All sandwiches include lettuce, tomato, red onions, and mayo. My boyfriend also loves to order their fries. It's pretty good with it's fresh! \n\nNow that my boyfriend lives in the area, I guess they'll be seeing me more often ;)", "author": "Mandy G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-24", "description": "UPDATE: I finally got to go return the $5 the restaurant sent me, and the staff was so sweet and understanding. \n\n\nOld review: I debated writing this, since the manager was so helpful in trying to correct my order, but since we ordered our food nearly 3 hours ago, and I'm STILL trying to fix this, I can't not write a review. \n\nI ordered 3 sandwiches. When my order arrived, there were only 2 sandwiches. I talked to the restaurant, they refunded me for the missing sandwich. Everything was cool. \n\nI just want to preface this next bit by saying I believe the fault is with Grubhub, not the restaurant. The restaurant manager did as much as she could to correct my order. However, I think there needs to be better Grubhub-restaurant training, because restaurants can say what they like about an order, but Grubhub won't necessarily honor the restaurant's word. \n\nWe are a small, private, office, we order delivery lunch because we don't have a kitchen or nearby resources. After the first mishap with the sandwich, the restaurant manager called me back to tell me that if I placed the order again, she'll assign a Grubhub driver ASAP so the sole sandwich would be delivered to us as fast as possible. She then proceeded to tell me she would refund the entire order, as a courtesy. Now, before I placed the order, I mentioned that I would have to pay the delivery fee again, which I did not want to do. She ensured me she could refund everything. So I placed the order again. Fast forward to 3 hours later, 4 fights with Grubhub chat representatives, one incorrect refund, two missing receipts, a $5 bill that was sent with the sandwich from the restaurant (which I now have to drive back to return, because we don't handle cash at our company) and I'm just in awe at the effort it took to order some sandwiches. I also paid $5.43 MORE for two sandwiches in two transactions, than I would have by just not re-ordering that second sandwich. (Two sandwich total should have been $29.28, and I ended up paying $34.71)", "author": "Ashley H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-18", "description": "i love their eggplant sandwich with either dutch crunch or wheat bread. Another fav is the fish sandwich...reminds me of a filet o fish sandwich but with way healthier ingredients and taste so good!  I would choose Grubbin over Lou's sandwich any day!", "author": "Alyce l."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-20", "description": "Delicious, amazing sandwich with friendly service.\n\n5 star for food\n\n-1 for forgetting my hash browns!!!\n\n+1 for being nice enough to boil some hot water for my Dad\n\n5 star experience still", "author": "Edmond H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-25", "description": "I'm a San Francisco native and have always been a sandwich lover. I was skeptical about this new trendy place but the lovely Hannah reassured me that the sandwiches are delicious. Hannah was very helpful answered all my questions and had the best customer service skills that I've experienced in a long time. After taking my first bite of my sandwich she was right there delicious", "author": "Arianna A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-22", "description": "Update 4/22\n\nAfter my precious review, Victor from grubbing was nice enough to reach out to me and I was willing to give the location another chance as there was no hard feelings. \n\nI can happily say the sandwich was spot on. The Juicy was super yummy and done just right and customer service was on point. \n\nIt is worth mentioning that when I came there were only two others in the restaurant which may obviously make it a bit easier then if it's during the slammed lunch hours. \n\nOverall I'm glad I gave this place a second look and was happy  with the taste and quality of the food and service. \n\nI'll be coming back and hoping it's always as spot on as it was today! \n\nThanks Victor for convincing me to come back!", "author": "James C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-07", "description": "Excellent and a welcome presence in the otherwise bland and touristy area. Bartenders are really nice and fun. Food is fresh, high quality and SPICY!!!!", "author": "Anne S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-30", "description": "Wowzz I didn't have much expectations for Grubbin' since I have been a fan of Lou's for years now. But this place serves pretty good sandwiches as well! +1 star for the yelp check-in bonus for free chips :) \n\nI got the Grubbin' ($10.61 w/ tax) on dutch crunch (ugh, best sandwich bread ever) and I was pleasantly surprised by its flavor!! As a meat lover, I got everything that I wanted in a sandwich. The sauce was pretty on point and it didn't make the bread soggy. Even though I did finish everything in one sitting, the portion was huge and I was so full afterwards. Def worth though", "author": "Emily L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-05", "description": "Super tasty, with a creative twist to the typical sandwich.", "author": "Rob K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-24", "description": "Woohoo, toasty sammiches! Besides your regular ole' deli meat sandwiches, they also serve ones with chicken tenders, fish fillets, etc. They also use their own Grubbin' sauce/vinaigrette. \n\nAdmittedly, I usually get the make-my-own sandwich with roast turkey (I'm a habitual eater, what can I say), and it's stacked high with fixings. They pop the sandwich in the toaster oven AFTER putting on the meat, so the meat slices are warm and slightly crispy at the edges. Hits the spot every time. \n\nOverall a solid, no-frills sandwich joint. Get a stamp card- buy 10, get 1 free :)", "author": "Samantha C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-03-12", "description": "It pains me to write this review, but perhaps not as much as my current stomach pain from this place...\n\n1. Really slow service. I waited over 30 minutes for 2 sandwiches to go.  At least three people who were served after me got their food first.  A couple who ordered after me got their food and were finishing eventhough I was still waiting on mine.  One customer got their orders mixed up and they had to remake hers, ended up getting a refund and a free sandwich, but hers were being made at the same time as mine... hm... \n\n2. It was a really beautiful day in SF. High 60s outside, but inside was 70 degrees plus. They had one large fan on the floor by the door blowing full blast, and one smaller wall fan, but that was nothing in comparison to at least 2 ovens, fryer, and what looked like no proper ventilation heating up the place.\n\n3. When I got home, we tried the sandwiches, and they were in fact delicious. We gobbled it up and told each other we'll just call ahead for future orders to avoid the long wait...\n\n4. Unfortunately, both of our stomachs within hours started growling and we were taking turns using the bathroom for what seemed like eternity. We've spent the hours trying to figure out what we both ate, and unfortunately the common denominator were the sandwiches.\n\nThinking back now, I do think the sandwiches could've been contaminated due to the much warmer temperature in the restaurant. I'm fully aware that the meat, sauces, etc. are kept in a cooler/temperature monitored stalls, but I recall seeing the middle prep table in the kitchen not refrigerated, and it was so warm inside, that the meat and the sauces could've easily gone bad...\n\nIt's really a darn shame, because despite the ridiculous long wait, and non existent customer service, the sandwiches were tasty at the time for me to say \"we'll order ahead next time.\" I also saw one guy and one girl working hard making the sandwiches and I want the restaurant to be successful. However, it'll be a long while before our stomachs are brace enough to go through this again...", "author": "S Y."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-07-29", "description": "Not a huge fan of this place for some reason. I was excited to try it since it's close to home, and also a friend recommended it.\n\nArrived with parking right in front, awesome. We checked in and got the free potato chips. The bagged chips were actually really good - the Cape Cod style. Anyway onto the sandwiches - I ordered the Juicin', which had turkey, bacon, avacado, sprouts, provolone cheese, pesto aioli, and grub sauce....sounded great, but when I ate it, it fell short. Turkey was too bland of a meat to be placed with the ingredients. Or rather, the meat wasn't flavorful enough, so it just got drowned out. I was excited to get the Dutch Crunch roll that looks so amazing in everyone's pics. But it made the sandwich really sweet for some reason, which made the sandwich even more disappointing. My bf got the Droolin' (pastrami, salami, pepper jack cheese, spicy aioli, and grub sauce)....a little better since it was pastrami and salami meat, but also the same blandness. \n\nWe also ordered Garlic Fries, and Tater tots, that also looked good in the pics. However, these were also very disappointing. The tater tots tasted like something you'd buy from safeway (not even trader joe's) and heat up in your oven.\n\nService -- not extremely friendly. Just got a vibe that the cashier didn't like working there. Also there's this Chinese lady they have cleaning up and bussing tables that can only speak Chinese - difficult to communicate with her. \n\nDisappointing...wanted to love, but couldn't. Also, the prices were expensive for the disappointing sandwich. It was at least 8-9 bucks per sandwich. To be honest, save yourself the disappointment and go to Yellow Submarine in the Inner Sunset for excellent sandwiches and excellent service!", "author": "Jocelyn L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-09-03", "description": "The sandwiches are good but so over-rated. In essence, they are a typical sandwich you could get anywhere else except the bread has a good toasty quality to it and they are loaded with grub sauce.  \n\nWe ordered the Grubbin' It (Pastrami, Smoked Ham, Salami, Bacon, Sprouts, Cheddar Chesse, Pesto Aioli, and Grub Sauce) and the Juicin' (Turkey, Bacon, Avocado, Sprouts, Provolone Cheese, Pesto Aioli, and Grub Sauce). Once we FINALLY got them....took at least 20 minutes, they both started good (we enjoyed the Juicin more)  but after a few bites there was so much sauce on them, they just became soggy and overwhelming.  Wayyyy toooo much \"grub sauce\" aka mayo sauces on there.  \n\nWe may also have left with a bad taste in our mouth because one of the guys behind the counter was so rude..... Hey bud, I just paid you $20+ for two semi soggy sandwiches, the least you can do is not be rude to customers.", "author": "Michelle S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-28", "description": "Favorite sandwich in the city! I always get the juicin and can't say enough good things about it. Great bread, toasted sandwich, tasty combo of ingredients.\n\nBe aware if you're coming at lunch time during the week - a lot of students come from Lincoln high so it can be very crowded.", "author": "Maggie F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-12-21", "description": "Ordered the Juicin' on wheat roll. The sandwich was decent - had all the fixings, but the garlicky aioli overpowered the other ingredients. Also ordered a side of 6 grub wings, which were so-so. Pricey for what you get.", "author": "Chris Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-04", "description": "Fantastic sandwiches for a great price. Their toasted sourdough bread is amazing. Big portions as well. French fries are a great side", "author": "Kevin S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-02", "description": "Mouth watering toasty innovative SAMMICHES! ;)\nMy son said he didn't want a sandwich and I ordered up a turkey with swiss on Dutch Crunch and Avacado, the secret sauce and shredded lettuce with fresh veggies made it the bomb. We bought two more for home later and since my son has discovered the potatoes slices YUMMY!", "author": "Dianne A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-11-03", "description": "Nothing really special about this sandwich place. We got the chicken sandwich which comes in sweet and spicy. I got sweet and my friend got spicy. we didn't taste much of a difference so my friend got extra sauce.", "author": "Nikki H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-18", "description": "If you are in a sandwich hunting mood, look no further as Grubbin has some of the best sandwiches in the city. \n\nA solid favorite has been the Grubbin sandwich especially on the warm and toasted Dutch crunch bread. The layers of meat are rationed perfectly and the spicy and pesto aioli compliment the bread, giving the whole sandwich a kick. Another plus is the size of the sandwich as it is enough to fill a person up. This is not the only sandwich on my favorite list as Grubbin offers an array of magical sandwich pairings that are tasty in every shape and form. Also, if none of the pairings fancy your taste buds, creating your own sandwich is another helpful and tasty option. I'll be a returning customer as long as I am in the Bay Area. Keep on grubbin!", "author": "Jessica E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-29", "description": "An awesome place for a sandwich! Today was my day off from work, so I wanted to grab lunch in the area. Just the day prior I went to Lou's Cafe - which is 1 block from Grubbin - and really enjoyed it. These two are direct competition, so I wanted to see what Grubbin has to offer that Lou's does not. Honestly? It's very hard to tell. Both are great, but here's what I think.\n\nThe biggest advantage that Grubbin has off the bat is size of the sandwiches and price. The sandwiches were very big and only around $8. I ordered the Juicin' which comes with turkey, avocado, lettuce, sprouts and their sauce. I was very impressed by the flavor and loved that they put a good amount of avocado in mine. No doubt these guys know how to make a satisfying sandwich. I really liked the vibe in there too and it seems like a place that's meant as a hangout spot for the local schools around the area. All in all, you really can't go wrong with going here and grabbin' (grabbin, grubbin, get it?) a tasty meal. Well worth the wait.", "author": "Alex B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-15", "description": "Came here today after rock climbing.  Small sandwich place.  Customer service was good.  Very friendly staff.\n\nWe ordered:\nDroolin'-- with pastrami, salami, pepper jack cheese, spicy aioli and grub sauce in a whole grain wheat roll.  Came out fairly hot.  \n\nGrubbin' It -- pastrami, smoked ham, salami, bacon, sprouts, cheddar cheese, pesto aioli and grub sauce in Dutch crunch \n\nSweet mouth waterin'-- chicken tender, pepper jack cheese, honey mustard, ranch, and grub sauce in Dutch crunch. \n\nAnd side of Garlic grub fries!! \n\nWhat can I say? Every bite was delicious and so tasty! So flavorful!! The crunchiness and warmth of the bread make it even more delicious!  Prices are reasonable. \n\nWe also ordered garlic fries and it came last since I ordered it last after the sandwiches order was placed.  It came hot and crispy.  Super garlicky-- just like how it's suppose to be  \n\nWe'll be back to try the other sandwiches in the future..", "author": "Junaline G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-31", "description": "This is one of my \"must stops\" whenever I visit family in the city. The dutch crunch bread is the best! So many great choices and all made fresh and delicious. Can't recommend this place highly enough!", "author": "Danielle Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-24", "description": "Oooooo....I can still taste my sandwich and it was GOOD. Mmmm....I feel so relaxed right now. These sandwiches pack a heavy punch so be ready.\n\nSo tasty and the sauce they put on the sandwiches are pungent. Oh man, the flavor is just so appetizing. I walking into this place you would think that the sandwiches would just be basic and your typically choices but they are NOT!!! They have all these different sandwiches that have flavor that explodes in your mouth as you eat. The result of eating a sandwich here is definitely a SIESTA! \n\nThere is a TV here for watching sports events which is cool. There is limited seating so your best bet is to get your food to go. There are some cold soft drinks in their cooler. \n\nIf you decide to eat here take the outside seating or sit on the stools near the window. Get some sun!!!\n\nThis place was a great choice for my dinner for sure. Just need me a cold brew and I am go to go. Maybe take yourself across the street to Dragon Lounge after getting a sandwich from here. Just don\"t fall asleep there....they will mess with you and then most likely kick you out!!! HAHA\n\nGrubbin....that is what I'm gonna be loving....oh yeah oh yeah!!! DEUCES", "author": "Robert F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-05", "description": "i was really craving a sandwich and since lou's cafe was closed on a sunday, i decided to come here. i decided to build my own sandwich so i chose dutch crunch bread (my absolute favorite), turkey, avocado, pesto aioli, provolone cheese, grubbin' sauce, and all the other toppings minus tomatoes. it took about 7 minutes for my sandwich to come out. i was expecting my sandwich to be small but it was kind of big, so i was pretty content for paying $8.69 for a sandwich! \n\nafter taking a bite into my sandwich, i was super satisfied! the avocado definitely hits the spot. i think if i added bacon to my sandwich, it would've made it taste even better haha. i would definitely come back here for the sandwiches!", "author": "Sylvia H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-06-29", "description": "I only came here to try garlic fries as the gf was craving some. It was pretty disappointing.  For 6 dollars you get a small basket of fries with some reheated minced garlic and some dried parsley flakes. \n\nI can't say how the sandwiches are but stay away from this side.", "author": "William C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-10-29", "description": "Good service and quick..the sandwiches were good and the grub sauce was good. Their fryer was broken so we couldn't try their most popular sandwiches. \nThe sandwiches we ordered were tasty and they give you a great amount of meat and food although we have had better sandwiches in the city.", "author": "Susannah H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-08", "description": "Looking for a small bite to eat while running errands at Odsy across the street, we tried Grubbin' and were very pleasantly surprised.\nGreat sandwiches with a creative twist, unique sauces and fresh bread. This little place stands apart from average sandwich joints without trying to be too hip.", "author": "Lars A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-24", "description": "I love their sandwiches. I got the Juicin' and the Sweet Mouth Waterin'. Their sandwiches are really good! Juicin comes with bacon,  avocado, sprouts... I ordered it with Dutch crunch. It was delicious. Anything they fry is really crispy! Very important to me. \n\nThen comes the sweet mouth waterin... It's crispy chicken tender and sweet honey mustard sauce. So good....seriously, the crispiness is really important. It makes it that much better. Their sandwiches are so flavorful that they may have become my favorite sandwich joint in the city. \n\nI got chicken wings another day to go with aioli sauce. Also good! But kinda pricey for what you get. \n\nMy goal is now to try everything on the menu.", "author": "Lyra C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-12", "description": "What a gem. :)\n\nCame here for lunch a few weeks ago with my boyfriend and we split a $9 Sweet Mouth Waterin' on Dutch Crunch bread, as well as $5 Grub Fries.  We picked this place because we originally wanted to try their Grubbin' Cheesy Tots, but it is no longer available (although it was still listed on their paper menu and website).\n\nRegardless, the sandwich did not disappoint.  The Dutch Crunch bread tasted fresh and the fried chicken tender was crispy and delicious.  I only wish it were a little larger for the price, but I can also understand that running a small business in San Francisco is expensive.  The Grub Fries (garlic fries) were tasty, but did not blow me away as much as the sandwich did.\n\nOverall, I would definitely come back, but I'm not sure I'll get to try any of their other sandwiches on account of liking the Sweet Mouth Waterin' so much.  The staff are very friendly and considerate; a woman offered us a second tray to make it easier to split our sandwich.  We used a Yelp check-in deal for a free bag of chips, and they let us grab any bag we wanted, even though there are two price tiers.  I'm glad we found this place!", "author": "Amanda W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-16", "description": "Ooh damn,  the garlic fries (grub fries) here. So good and full of garlic. Ordered these babies togo and made sure to pop the lid in the car so they didn't get soggy. But then it wasnt hot-hot,  so I wonder if the fries were kind of sitting out for a bit? Still delicious though! \n\nOrdered two sandwiches, le boo got the classic Grubbin' with no tomatoes. I got Juicin'. Service was really nice and accommodating, they allowed me to sub the cheese and sauces in the sammy to make it my own. They also have a check-in offer too!  So go check-in and get a free bag of chips with your sandwich~\n\nThey toast your sandwich, unless told otherwise.  Let them do it.  Toasted Dutch crunch bread with all the fixings gave it that extra crunchy bite, got me feeling some sort of way. ^__^", "author": "Tina N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-16", "description": "4.5 stars to be exact. \n\nFood: 4.0-4.5\n-great selection of sandwiches. I tried \"The Grubbin,\" which is on the top of their list and it was decent. The crispy dutch crunch roll and soft breading inside is what makes this place special from other sandwiches I've had. Bread, meat, and sauce ratio seems to be well calculated. Not too big or small for a lay person eating 45 plus sandwiches a year. \n\nDecor/Interior: 4.5-5.0\n-modern without being pretentious. Layout is simple and customer friendly. There is a t.v that is on most of the time and some available seating outside. \n\nService: 4.0-4.50\n-friendly and nice. Staff always seem to be firing on all cylinders. \n\nPrice: 4.0-4.50\n-might be a little steep if you add on drinks and chips, but I think it's fair for city living.\n\nExtras: 4.0-4.50 \n-seems like a good place to relax and unwind for lunch, but I would definitely call in to order to go if I have business to take care of.", "author": "Phillip K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-01", "description": "Some of the best Dutch crunch bread I've found in the SF area. The service was fast and high quality ingredients too. I highly recommend the Kickin' sandwich!", "author": "Ben M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-28", "description": "Great bread fresh ingredients!  Delicious sandwich! Great and efficient service!\nClean spotless interior!", "author": "Koichi D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-10", "description": "SERVICE: The last time I was here I asked for a box to pack the rest of the tots and sandwich. The guy at the front offered to pack it for me! I imagine that most sandwich places will run a DIY type of business so this was a nice gesture in my eyes! Also, if you eat in, they're quite attentive to your needs and would also check in to see if you enjoyed your sandwich. \n\nFOOD: Fan-lickin'-tastic. for $8-10 a sandwich, the food here is a steal. The people of Grubbin' put a tasty spin on classic deli choices, like their Spicy Mouth Waterin', with spicy aioli, ranch and grubbin' sauce on a huge chicken tender. That's my favorite! Honestly any sandwich is a good option here. Don't forget your order of tater tots. You can get them 'cheesy' too, and when I say 'can', I mean 'must'. :) \n\nATMOSPHERE: They have limited seating in this small spot but if you're not in a rush, take a seat. They have this huge TV running and on the last few occasions I was there, they were playing CSI. Nothing says \"bomb-ass lunch\" like a hot pastrami and pepper jack sandwich on a Dutch crunch roll while you're solving murders and assessing autopsies!", "author": "Greg Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-01", "description": "Grubbin'.... what a name!\n\nYou can never go wrong with trying a new sandwich place, and often times, sandwich shops have some unique creation that makes you coming back for more. My boyfriend and I have been meaning to try this place out, and quite frankly, we intended to go to Lou's Cafe that day. Instead, we discovered Lou's Cafe was closed so it was only fate to bring us to finally try out Grubbin'. \n\nMy boyfriend and I ordered the Spicy Mouth Waterin' sandwich and chicken tenders & fries. I was disappointed when the guy taking our orders said that we could not add garlic fries..when we easily saw that they did via yelp! It wasn't a deal breaker and I just got regular fries instead. The chicken tenders and fries came out first and then the sandwich came much much later. I really enjoyed that they had a variety of dipping sauces for the chicken tenders. More importantly, I asked for more than one kind of sauce and I didn't get any weird stares from the workers or was charged additionally for them! They were kind enough to give me some without any hesitation. The sandwich was delicious and the sauce that was in the sandwich had a nice kick...it wasn't too spicy, and it wasn't too mild. I would love to try more of their sandwiches at this place!", "author": "Victoria K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-01-01", "description": "The sandwich is okay,  but the wait was ridiculous. When we came in 2 people where waiting for there food, no one in line. 5 people behind the counter, 3 was just talking to each other. So we didn't expect a wait at all. But we had to wait 25 minutes for 2 basic sandwiches!! During the time more people came to pick up, so they were probably more busy than they looked, but then they should have mentioned it when we ordered. I don't mind waiting for my food, but if I know I have to wait 25 minutes I might wanna go for a walk, or do my groceries in some stores close by.", "author": "Sisse L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-27", "description": "I'm hungry and I'm NOT waiting for 45 minutes for a table at Kingdom of Dumpling. \n\nJumped on Yelp and glad we did. \nSome of the best sandwiches I've ever had. Good food with complex flavors. Not just meat slapped on bread. My wife's veggie sandwich was fantastic. \n\nI'm going to be craving these...I just know it.", "author": "Ken R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-18", "description": "Good neighborhood eats. \n\nOrdered the Droolin' and the Spicy Mayo Mouth Waterin' sandwiches. Great portion size and the bread has a beautifully light crunch. They offer pepperoncini, jalapenos and pickles at no additional cost. You have the option to build your own sandwich.\n\nAlso ordered the garlic fries which were a bit soggy and the chicken wings. You have your option of sauces to choose from to dip. Chicken wings were crunchy and moist. Options for 6, 9 or 12 pieces.\n\nTotal order was a smidge under $30.", "author": "Julie L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-30", "description": "We were walking around on Taraval looking for this place, but apparently the numbering system is weird. That was a bit confusing. But! It was worth the find because the sandwiches were AMAZING! I came here with a group of 8 and at least 3 people (including me) said the sandwich they had here were the best they've ever had.  \n\nTheir menu has a lot of options, and you can even build your own! I got Droolin' with Dutch Crunch aka the best bread ever. The sandwich was filled with pastrami and salami, aka the perfect sandwich meat combo. It also had some sauces, and I added sprouts along with everything like lettuce tomato jalapenos etc but no mayo! It was delicious! The only downside is I had to wait about 15 minutes for my sandwich, and mostly everyone at the table already finished theirs. These sandwiches are so big, they fill you up very nicely. The place isn't very big, but there are some tables and countertop spaces.\n\nIf you're ever around the area craving sandwiches, this is definitely the place to go!", "author": "Andrea W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-03", "description": "solid sandwich spot! \n\nI usually get the juicin' on Dutch crunch. the portion is healthy enough that I save the other half for lunch the next day. it definitely fills me up! \n\nthe bread is nicely toasted and super crunchy! just the way I like it :) the turkey is juicy and tender and I love the bean sprouts in it \n\nif you're like me and bacon and cheese are negotiable, build your own sammy. it saves you almost two dollars and it's just as enjoyable. \n\nfriendly staff and always welcoming. I'll be back soon!", "author": "Tina Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-27", "description": "This is easily my favorite sandwich shop in San Francisco if not anywhere!! Everybody who works here is super friendly and the food and the wings are amazing!!", "author": "charles w."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-01-02", "description": "Came here because of the reviews and we were in the area. \n\nThe store itself is very small with maybe only 5 tables. It was really hot and stuffy inside. You could see inside the kitchen area which was really messy and cluttered. I thought that was really weird. \n\nI ordered a sandwich with turkey and pineapple. The sandwich is very big. I could only eat half, but still good for its price. Other than that, nothing really specia", "author": "Susan L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-03", "description": "Etymology\nmouth + -gasm\n\nNoun\nmouthgasm (plural mouthgasms)\n\nA sense of pleasure derived from eating food which tastes good", "author": "Jeff W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-02-04", "description": "I had the Fishin sandwich today and it was great! Something different than an ordinary turkey or ham sandwich. Garlic fries is another $5. Unless you have a huge appetite, I would definitely recommend sharing this with a friend. The garlic fries weren't soggy like other reviews mentioned, but it wasn't anything spectacular either. I would come here if it was closer to public transportation. \n\nI'm not a local, but it seems like this place is near a high school. I came around 11:45 AM and by the time I started enjoying my lunch, over a dozen kids entered the place. It was hard to enjoy my lunch since I had to dodge their backpacks. This place is set up for a grab and go. There's only 2 tables and a few seats at the counter for customers to enjoy their meal. My boyfriend and I were lucky to snag a table before the crowd came in. But it didn't stop them from using the side of our table to squirt ketchup on their food. I understand this is a small place, but dude..be a little courteous. \n\nThere's free 2 hour parking nearby but it can be tough during peak hours. \nRemember to check in for chips! \n\nOverall I took two stars down for speed and environment. My sandwich took over 15 minutes to prepare..and there was nobody there. High school students are loud, I get that. But don't invade another customer's table even though you are holding a bunch of food..", "author": "Danae L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-22", "description": "Finally a good sandwich place not far from my house!!!!! Ike's, Lou's, Roxie's, and little luccas are all so far from my neighborhood.... Never want to fight for parking either haha. \n\nCame in late afternoon with my bf for both our first times here. I ordered the sweet mouth waterin which came with chicken tenders, grubbin sauce, honey mustard, ranch, and pepper jack cheese, and my bf ordered the grubbin. Also came with lettuce and tomatoes. We waited probably for ~10 minutes for our sandwiches, which is kinda longer than expected because there were only a few people in the shop other than us. However I do understand that they're still pretty new! We got our sandwiches to go to eat at home later. Oh and the sandwich also comes with a bag of chips. They had the standard Cheetos and lays, but they also had Hawaiian chips (woot Maui onion) and sun chips. \n\nWhen we got the sandwiches we were sooo happy to see that they were huuuugeee (we were starving)!!! Very comparable to the size of Ike's. Drove home and opened them to see that the bread was still in shape and not soggy at all, and my chicken tenders were still crispy!! Yay! I took my first bite and immediately tasted the sauces. The honey mustard and the grubbin sauce went so well together. I really enjoyed my sammy and I could barely finish it because of its size (buuuut I did). My bf really liked his too and said he thinks he might've found a new sandwich spot!\n\nI definitely want to come back and try the other sandwiches! The one with pesto (I think juicin) sounds delicious so I will be back! :)", "author": "Tara A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-08-26", "description": "Definitely tasty sandwiches but I wouldn't go as far to say 'the best in SF\". Everything was pretty tasty though so if you're in the area looking for a sandwich place, I'd suggest checking it out, otherwise I'm still on the hunt for something better than Ike's (if that exists). It was something about their signature sauce that didn't quite do it for me.", "author": "Anne G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-25", "description": "This place is sooo good. I ordered the kickin sandwich. Fast service. Great price and good people working here. I can't wait to come back. Highly recommend this place.", "author": "Nathan C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-11-05", "description": "Sandwiches are great! Service could be better... takes 25+ minutes for a sandwich. I don't know if it's the owners friend or what, but people are freely able to enter the area where the staff is making your food.", "author": "Y W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-21", "description": "One of my favorite go-to sandwich shops in the sunset district. Brought my girlfriend here for the first time and she absolutely loved the juicin' sandwich. The wings are excellent in terms of taste and zing. The grubbin'it sandwich is also one of my favorites as well. Good size sandwich for a good price. Took a little long to make the sandwich but worth the wait for a quality meal. Perfect for lunches and when you're going out with friends.", "author": "Austin H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-18", "description": "I always pass by this place when I drive on Taraval but I never stopped by. This time, luckily I did! My friend and I walked in as we were walking our dogs since this was a pet friendly environment. My oh my, this is the place to start grubbin!! I ordered the Fishin' with sourdough bread which basically consists of a filet fish! Where do I even begin...My first bite, DELISH! The fish was crunchy and full of texture, even better with the touch of tartar sauce! The sandwich was also huge - a great portion that filled me up! I was barely able to finish! Definitely not skimping out on the ingredients. \n\nGreat service too! Waited roughly 10-15 minutes for our sandwiches (not sure why it took this long for sandwiches but it was worth!). The dogs got doggy treats too! \n\nWILL COME BACK!", "author": "Eva C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-12", "description": "In the words of Fergie, \"T-t-t-tastay, tastay.\"\n\nGrubbin' has a small but mighty menu. I feel confident you could order any of the sandwiches and be happy with them. I also feel confident you can split the sandwich with someone else and still be satisfied - the portions are moderate, but magically filling. The deliciousness density is very high. :)\n\nSandwiches are made-to-order, and have good-quality ingredients. It takes a minute, but it's worth it.\n\nI'd love to see a couple more options, and being the health-concious asshole that I am I would love to see whole wheat/whole grain bread and maybe some variety in healthier beverages and sides (maybe seltzer, unsweetened tea, and baked chips or veggies).\n\nI look forward to Grubbin' - and maybe going for a run afterwards - very soon.", "author": "Catie F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-14", "description": "Finally got a chance to try this place. I went with my roommate and both of us got the \"Juicin\" sandwich.\n\nThis is the sandwich with most reviews. It was good and the sauces definitely made it an experience however for the size and cost. I wouldn't go often.\n\nTotal was 9.00 plus tax making it cost to $10\n\nIn my opinion if a sandwich is $10 it had better be large and have ludicrous amount of meat. However if your in the neighborhood and won't go anywhere else. I'd stop by and give it a try.", "author": "Nathan A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-22", "description": "I came in here with a friend for lunch and it seemed like a family run sandwich place.  The sandwiches we got were really good and the bread was delicious.  It's also close to home and affordable!", "author": "Jonathan W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-15", "description": "We BE grubbin'....\n\nOk, ok...more like our breath BE humming from that creamylicious garlicky grub sauce. \n\nOTHER NOTES:\n*Across from Dragon Lounge. Previously The Dog Pit: http://m.yelp.com/biz/the-dog-pit-san-francisco.\n*Soft opened over the weekend. Regular business hours TBD and will update review accordingly.\n*Menu has 7 signature sandwiches (1 vegetarian available); there's even one with fries. All sandwiches are $7-$9 or build your own for $6.\n--Choice of Dutch Crunch, Sourdough Roll or Sliced Wheat. Get the Dutch Crunch.\n--All sandwiches come with signature Grub sauce which is like a garlicky aioli. \n--Tastin' Veggie Sandwich ($8):  http://bit.ly/1hpAAma\n*3 tables and counter seating.\n*CC's accepted via Square.", "author": "Cherylynn N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-05", "description": "Went here for a late lunch when my friends and I were craving chicken tenders. They took a little while but we didn't mind waiting knowing that they were being made fresh. It's good price for A great meal. Only downside was that it was extremely hot inside but I'm sure that wouldn't be a problem on a normal cold SF day.", "author": "Kailee N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-24", "description": "Grubbin! Finally, a new sandwich spot in the neighborhood! I came for the soft opening and so far, all went well. Thankfully, the menu wasn't overwhelming. They have 7-8 sandwich selections, some yummy appetizers, and plenty of chips and drinks to choose from. \n\nWe ordered at the register and grabbed a seat. (They take cash/card. You can choose to dine in or take out.) Waited for about 5 mins for our order of the grubbin on Dutch crunch and grub fries. \n\nThe grub sauce is to die for!! mMm... sandwich was huge and for $9, it's well worth it! Hubby and I split the sandwich and we both barely finished our halves. The meat in the sandwich was super tender and juicy, definitely not like regular deli meat. The bread was really fresh, as the veggies were as well. \n\nGrub fries were super hot and crispy... and super garlicky! Loved it! Will definitely try it with some grub sauce next time. \n\nCan't wait to come back and try more items on the menu! Hoping I'll have the option to toast/heat up the sandwich! I love when the cheese is nice and melted.", "author": "Ann T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-15", "description": "Great food, great prices and super nice people. I highly recommend eating at Grubbin'. Be hungry, because the food is not only great, but you get a lot of it!", "author": "Edward M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-20", "description": "Atleast the LOCALS should know about this place.\nDon't know what to eat? This is one of those spots to go to.\n This place is small but has a cool ambience. \nThe sandwhiches will fill you up.  Big portion with a lot of flavor. TASTE BUDS WILL INTENSIFY.\n\nYou can create your own sandwhich  or pick their popular options also with variety  of delicious  side orders.", "author": "Jocelyn R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-04", "description": "My boyfriend and I came to try this place and I got the Juicin', he got the Kickin', garlic fries, and two free bags of chips for checking in on Yelp! \n\nWe really really liked this place. The people who worked there were so friendly, especially the cashier at the counter. (For my SLO friends, he totally reminded me of Thai Boat workers. Super down to earth friendly!) Anyway, our sandwiches were GOOD. boyfriend liked the wasabi mayo on his sandwich I think? And I loved the Pesto in mine. A little sad that I couldn't taste the grub sauce too much cuz the pesto is just overpowering (but whatchya gonna do, that's pesto!) Maybe next time I'll ask for extra grub sauce cuz I love lots of garlic. \n\nThe garlic fries were super garlicy. Like the scent/taste stayed in my mouth throughout the day but I don't mind. The portion was perfect considering the price. We couldn't finish the whole thing even though we both only ate half a sandwich each. Probably best to split between 3-4 people. Bags of chips are like the mini ones of all the classics but let me point out that they have the Hawaiian chips and funyuns!! Just check in on yelp.. It's worth it! \n\nI would've given 5 stars but a couple things. It's not entirely their fault but by the end of our meal flies were in the way and wouldn't leave us alone since they leave the door open. We also asked for bags to put our leftover sandwiches and fries in but the guy at the counter said they could wrap everything up for us so we were like, aw nice!! Gave them everything including my half sandwich and a few bites of the first half. He asked if I wanted the small leftover piece too and I said yes please (I really did like my sandwich that much!!) However, they didn't give us back the fries (not sure if they got tossed or they just forgot to give them back to us packed up) and they threw away my eaten portion of the sandwich!! I was a bit upset but it won't keep me from coming here again. \n\nI honestly wanna give 5 stars but maybe next time. It's a great newer shop. Simple but it's got everything you could ask for. A few tables and chairs, a TV (if a Giants or Niners game is on, seems like they'd have it on TV), chips, drinks, and friendly staff. Will be here again soon and will tell all my friends. Thanks for opening closer to my home!!! No need to drive top far away for a good sandwich now!", "author": "Amanda L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-09", "description": "Three of us went over here the other day and we ordered 3 build your own sandwiches.  First, they got all of sandwiches right.  My wife ordered a veggie sandwich and my son a plain turkey sandwich.   They both liked their sandwiches. My son who's very picky gobbled his down.  I ordered a turkey sandwich with the grub sauce. Grub sauce is this aioli like sauce.  The garlic in the sauce was good and wasn't overpowering.  If you like garlic I would recommend the grub sauce.  The only reason this wasn't a perfect experience was the fact that we were waited on right away.  I only found out until after we ordered that the reason why was b/c there was a huge order being placed over the phone and they had a new person in training.  If they simply just acknowledged us and told us they were busy at the moment I would totally understand.  Overall, if in the area and are craving a sandwich I would highly recommend this place.  If you're looking for something different and want a little kick in your sandwich try the grub sauce.", "author": "Mike S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-23", "description": "Love love love the sandwiches here. It's a super small shop. They only have like 2 tables and 8 chairs probably. Ordering is simple. You walk in, menu is on the chalkboard, order and hopefully grab a seat. I shared the grubbin and the sweet mouth waterin, both ordered with everything and on Dutch crunch. I usually get Dutch crunch for every sandwich I order anywhere, but there's something about the bread here that's different. It's toasted perfectly with a crunch exterior and a fluffy interior. I'm not sure if it's the toaster they use or what, but I want in. The meats in the grubbin were sliced thinly to my liking and tasted super fresh! And the chicken tenders in the sweet mouth waterin was the perfect amount of juicy. Not dry at all! But of course the winner was the grub sauce! It completes the sandwich! Oh they also give out stamp cards. Get one and make it worth your while.", "author": "Jennalyn L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-05-24", "description": "I had high expectations before trying Grubbin', but I think they were a little too high. Grubbin' is a small, quaint sandwich shop, pretty close and comparable to Lou's Cafe, serving specialty sandwiches ranging from $8-$9 or build your own starting at $6.49. They also offer sides of fries, tater tots, buffalo wings, and chicken tenders. \n\nI ordered Grubbin' It - pastrami, smoked ham, salami, bacon, sprouts, cheddar cheese, pesto aioli, and grub sauce on Dutch crunch bread. I was expecting a huge, mouth-watering sandwich, but it did not meet expectations. First, just by looking at it, it didn't look spectacular. Then, it tasted just as it looked...good, but not spectacular. As far as the meat, I mostly tasted the ham, which is my least favorite of all the meat in the Grubbin' It. I barely tasted the bacon, which was the reason I chose to order it over the Droolin' (but it was in there, I checked). I hardly tasted the pastrami and cheddar cheese in the sandwich. The Dutch crunch bread was a little off as well. I wouldn't say it was stale, but it really did not have that delicious, sweet taste that fresh Dutch crunch usually has. The grub sauce was dripping out of the sandwich, making it very soggy and messy to eat. Overall, it was still a good sandwich, it just wasn't mind-blowing. People hyped it up too much. \n\nWhat I did like about my experience...it's a cute, little shop with great concept, name, and logo. The staff was very friendly, they made my sandwich in very reasonable time, and they offered a free bag of chips with Yelp check-in. I also like that they offer stamp cards for loyal customers. The size of their sandwich could definitely feed one hungry person or two semi-hungry people. Although I wasn't crazy about the Grubbin' It, I wouldn't mind trying a different sandwich some day.", "author": "Jean S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-01", "description": "BOMB sandwich! Second time here and I've only had \"Juicin'\"! So dam good! The melted cheese and their secret sauce is delish. My new go to place when in the area.", "author": "Monica R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-05-26", "description": "It was okay, seemed like an average sandwich but was a little more on the pricey side. I was trying to eat a little healthy which maybe doesn't fit this type of place. My wife got a less healthy sandwich that had melted cheese on it and it was better than mine. It is on the way to GG Park which is cool to pick up and have a picnic. But I wasn't blown away so for the price I'll look for another spot on the way to the Park.", "author": "Wayne S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-23", "description": "Its like your family-friendly neighborhood convenience store at the corner of the street. Grubbin' is non-descript. One look at the place, and one might considering continuing down the street, but as it is said, one must never judge a book by its cover. This is especially true for Grubbin'. It's meant to be a carry out with minimal seating and a space that cuts down on the overhead. \n\nThe Yelp reviews make it clear. There is no dissenting when it comes to the food. The menu is fun, and all the delicious choices are hard to choose from -- a good problem to have. \n\nI got a carry-out order of crunchin' and juicin' and was impressive by the sheer weigh of the bag I received. Always promising when you get what feels like a sizable amount of food! Juicing' was my favorite, but I'm a sucker for turkey sandwiches. \n\nThe bread of course is the main star here. Man, that Dutch Crunch. Yum. You won't be disappointed with the Dutch crunch and any of the menu options. Its crunchy but not too crunchy and the bread is air soft. A great mouthfeel on the bite.\n\nDefinitely bookmarked on my Yelp, and definitely will continue to visit whenever I'm around that neck of the woods.", "author": "Enoch W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-12", "description": "Best sandwich spot in the sunset. I rejoice the day Grubbin' opened, and have since then tried everything on the menu. Nothing disappoints, but my two favorites are the Grubbin' and Juicin' (and Droolin'...).\n\nThank you, Grubbin' fam, for the amazing eats and great service!", "author": "pauline joy r."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-13", "description": "Was in the mood for Ike's but saw this place and thought I'd give it a try. Definitely not disappointed with the \"Super Mouth Watering\" chicken tea series sandwich I got! Parking is easy, they're super nice, and you get a free bag of chips with a check in.", "author": "Danielle B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-06", "description": "Hands down THE best sandwich spot I've encountered in my entire 16yr SF experience (this place is giving Ike's a run for their money - without the obnoxious wait!)\n\nGET THE CRAVIN' SANDWICH ON DUTCH CRUNCH WITH JALAPEÑOS (YES, DIET BE DAMNED).\n\nClean, simple, affordable, DELICIOUS.\n\nMaybe now it won't be as tough to convince my friends to hike \"ALLLLLLL the way to the Sunset\" to hang out...?\n\nBaby steps.", "author": "Anjali V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-13", "description": "I love the blend of flavors on the Grubbin' It sandwich so much I can never seem to convince myself to try something else.", "author": "Marina G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-01", "description": "Great food at decent prices! A must visit for sandwiches in the city. They have fresh ingredients but the bread really makes the sandwiches here!", "author": "Tyler L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-06", "description": "A phenomenal sandwich spot. I have tried a few of the fried chicken sandwiches here. All of which have left me fully and very happy. They really know how to pack in those flavors. Big thumbs up", "author": "Andrew N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-29", "description": "Grubbin' has quite a lot to work against in this neighborhood like Lou's and Deli King. What makes them stand apart is their unique twist on naming their sandwiches, use of sprouts (which I really appreciate), and their amazing sides! I have never had a bad sandwich from Grubbin', but I have yet to try everything. This time around, my intended sandwich, Fishin', was not available, so I went with the Droolin' (Pastrami and Salami), which can't go wrong and it was awesome! Don't know exactly what's in the Grub sauce, but it makes a difference! I figure it's like how Lou's has their sauce, Grubbin' has their Grub sauce. Either way, Grubbin' is a great option for anyone craving a great sandwich!", "author": "Jeremy L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-13", "description": "My family and I, stopped at this place for lunch and we weren't disappointed at all. Grubbin was clean, friendly staff and great food. I'll definitely come back when I come back to town. Love it!\nThanks you guys!", "author": "Monica M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-01", "description": "This spot has probably the best sandwiches in town , fuck Ike's, fuck Lou's and definitely fuck subway. This spot has em beat.", "author": "Wilson H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-09", "description": "Small sandwich shop that is conveniently located. Ordered the Droolin' and Savorin' sandwiches. The Savorin' was good, but the winner of the two was the Drooin'. Portions are good, and everything tasted very fresh. I did wait a long time for the sandwich, as there were 3 folks ahead of me. Maybe I will call in next time first. They are very close to Lou's cafe, so if you want a change from Lou, check Grubbin out.", "author": "A L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-26", "description": "I've been making Grubbin my go to place now. I think the Check-In chips is enough to make me come here over Lou's. To be honest, I don't know which is better, but I do like free chips. ;) \n\nAnyways, I used to always get the Juicin' because I love avocado, but then the Spicy Mouth Waterin' is the bomb . Chicken tenders in a sandwich? Genius. I love it. The Grubbin sauce is fantastic and the Spicy Aioli... Yum. \n\nI've also come here like 10+ times but I always forget the stamp card. Unfortunately, they don't ask you if you have one or not, so it's easy to miss out on stamps. \n\nI also think the garlic fries portion is too small for the price. I always get it to go so it comes in the small plastic container. \n\nSandwiches take 10-15 minutes, so call ahead of time!", "author": "Brandon L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-20", "description": "Great flavors. Plenty of options. Fresh bread, fresh meats and fresh produce. All ingredients to make up some great sandwiches. The tots are cooked to ordered and are great with some garlic added.", "author": "Kyler B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-22", "description": "Great sandwiches and amazing service with a smile! Not your everyday sandwich give them try you won't be disappointed", "author": "Vanessa V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-29", "description": "Wow\n\nI really just stumbled in here because i had to run errands in the city, I got the droolin' sandwich and grub fries and i gotta say..\n\nSandwich was pretty damn good, perfectly toasted and just the right amount of dressing. The garlic fries were the definition of what good garlic fries are, a good amount of roasted garlic in each bite, not just a bs amount of garlic and tossed around to spread the flavor.\n\nKeep it up fam", "author": "Anthony K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-05", "description": "Favorite sandwich shop ever!!! Their grub sauce is amazing and their Dutch crunch bread is delicious I go here almost every time I'm in SF", "author": "Kristine B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-24", "description": "This place is good for hot sandwiches with lots of meat and sauces. The spicy mouth waterin had crispy chicken but the bread was a little thick for our liking. I had the grubbin it and while good, it was a little salty. The cheese tots lacked flavor but you can request grub sauce, thousand island, buffalo sauce, spicy aioli to dip.", "author": "Sheena N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-03", "description": "DROOL\nSo if you're ever craving garlic fries, like, fries WITH YOUR GARLIC (there's a butt ton of garlic, probably didn't get my joke. :P) then this is DEFINITELY the place to go! The garlic fries are the best I've ever had. I always order Juicin', love me some turkey and avocado sandwich. But I can never finished a sandwich AND the fries, firstworldproblems. D: \nDamn it.... now I'm craving some Grubbin'.", "author": "Stephanie Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-12", "description": "Five stars for the Tastin' sandwich, which ranks among the best vegetarian sandwiches I've had in SF.", "author": "Preethi K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-09", "description": "Good prices and great food. The service was fast and very friendly. Found this place by Yelp after leaving the zoo. It got pretty busy around 4pm but the food is worth the wait. Also if you check in then you get a free bag of chips with a sandwich purchase.", "author": "Lacey M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-01", "description": "Dutch bread makes the sandwhiches soooo tasty.", "author": "Don C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-06", "description": "I was craving a sandwich in the area and found this place on Yelp! If you check in, you get a free small bag of chips too! ;) I don't think this is on the menu but there was a hand written poster recommending the \"Cravin'\". It has ham, lettuce, pineapples and a special sauce I think. I got it on Dutch crunch and it was amazing! Would definitely recommend! I also ordered the tater tots and the garlic fries and shared everything between two people. The tater tots were really crunchy and fried to perfection :) the garlic fries were very garlicky. Personally, I thought it was a good amount of garlic, however it was a bit oily and not fried well enough so it was a bit limp/soggy. Lol. I would like to try other sandwiches next time and the cheesy tots as well. I would definitely come back! The service is great as well. It has only three tables I believe and some bar space so there's not much seating there and it took a bit for all our food to come. However, they were really friendly and thoughtful while they brought our orders to the table. They asked if we needed an extra tray since we were sharing and also helped us box our food and assured us that our food would be coming right up. Would definitely recommend this place :)", "author": "Bailey L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-29", "description": "Friendly, simple, with a spunky menu - that's how I like my sandwich shops! \nYou can anticipate a wait during prime times.\nThis place also offers free self-serving water, and free chips upon check-in via Yelp - can't beat that. \nAnyway I'm gonna eat my droolin' sandwich now. *Shaun out*", "author": "Shaun D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-04-17", "description": "Grubbin' offers generously-portioned sandwiches, each with a witty name, such as grubbin', juicin', and droolin'. But nothin' about the sandwiches names are tellin' you which ingredients are actually in it, so you'll need to read the menu in more detail.\n\nWhile in the neighborhood and before Lou's opened one block west, we stopped by Grubbin' to see what they had to offer. It was a warm Sunday afternoon and they were quite busy, so they unfortunately ran out of dutch crunch AND sourdough rolls!\n\nI settled for the Droolin' (pastrami, salami, pepper jack cheese, spicy aioli, and house grub sauce) on a french roll. The french roll was okay, soft and fluffy but lacked any crispness. The pastrami tasted very processed and was unmemorable. Yes, a lot of deli meat contains many additives, ie: nitrates and nitrites, but something about their pastrami just didn't sit right with me.\n\nService was nice, and since sandwiches are toasted, the prep time was roughly 7-10 minutes. Sandwiches are quite large and meat portions are generous. You also get a free bag of chips with a yelp checkin. Overall, Grubbin' offers a great value, but I found my sandwich to be forgettable. Unfortunately, the chances I'll return to Grubbin' to satisfy my sandwich craving, while in the neighborhood, is unlikely.", "author": "Priscilla W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-11", "description": "The sandwich really blew me away. I know that sounds like an overstatement, but it was packed with flavor! I had ordered the Juicin' on a French roll and had added pepperoncini's! I like that you can customize your sandwich different ways even their signature sandwiches. The service was really friendly and I liked that they gave a free bag of chips for checking in. If you can't finish the sandwich they'll even wrap the rest for you to take home! Great job guys!", "author": "Jose O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-21", "description": "There were a lot of sandwiches shop opened on Taraval and I want to try them all. The reason I picked to try Grubbin' first because I was attracted by the hot garlic fries. I ordered the Juicin sandwiches. They have a lot big chunks of turkey ham inside. The sandwiches tasted delicious. The fried chicken wings was hot, crispy and yummy. Staffs works quickly, too. However, I took once star away cuz they kept the door open in a cold weather and wind blows inside the shop towards me. Definitely will try again in the future.", "author": "Katherine L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-03-27", "description": "My boyfriend and I decided to go here, after we went to the zoo.  The cashier was nice, but she had to make a number of substitutions, after we had already paid and put in our order, SINCE THEY RAN OUT OF BREAD AND FRIES?  They only had enough fries for a small order instead of a large, and they said they ran out of all their bread, except for one for sandwiches.  We were fine with the bread, but for the fries, they substituted the lack of fries with tator tots, which we agreed to.  The sandwiches were fine, although a bit pricey.  Also, the tator tots and fries were okay, we saw they came in a frozen package and were cooked in a microwave.  \n\nAfter we had eaten and left, my boyfriend and I felt very ill.  We are not sure what item of food it was, but we are pretty sure it's from here.  We probably won't go back, unless general improvements are made.", "author": "Crissy C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-15", "description": "A surprisingly delicious sandwich shop!  We stopped in here after reading all the other great Yelp! Reviews and were not disappointed :). The crispy chicken tenders sandwich on crunchy Dutch bread is so good it'll keep you going back for more.  If you're not a sandwich person, (nor am I) don't be deterred!  This place shouldn't be categorized as a sandwich shop, but in a brand new meal category due to the yummy warmth of the sandwich, the crunchiness of the bread, the real meat fillings, and the fresh veggies inside.  \n\nGrubbin' thanks for caring so much about sandwiches and for your delicious creations.   Great value and deeelicious melty warm hug in your mouth sandwiches.  If you're in the hood, and have a hankering for fried chicken (and wouldn't mind eating it in a sandwich), or a good fish sandwich...Go!", "author": "Vanessa C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-23", "description": "Ordered their Droolin! Very delicious. \nThey're always busy, so if you don't want to wait, it's best to call in your order ahead of time. Definitely going back for more", "author": "Nate S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-26", "description": "First time eating here and I must say it truly lives up to it's name. The most \"grubbin\" sandwich I've had in like forever. I recommend this place to everyone!", "author": "Sha R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-27", "description": "The food here was excellent, everyone in our party agreed. Possibly the best sandwiches... ever! The restaurant itself was very cute but small and plain, and for our group of six slightly ill-fitting. Overall though, truly a treasure of Yelp!", "author": "Maya M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-23", "description": "Sandwiches are screaming delicious.  Now if they could add the potato salad from the submarine sandwich place on west portal.....they would reach nirvana. ;-)\n\nOrder the 'Grubbin'....it's a home run.", "author": "Sharine d."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-03", "description": "Goood very good sandwichs. Obviously you can get better sandwiches at clancys or elsewheee but it's an above average sandwich, cheap, and fast. Solid 4 stars. I'll be back.\nSide portions are a little skimpy but they're good. They have rewards as well. Worth checking out", "author": "Nick J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-10", "description": "Loved our sandwiches! Got the juicin and droolin. Dutch crunch bread is delicious and crunchy and sandwich was packed with meat. Definitely worth a visit.", "author": "yuri k."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-01-15", "description": "I got the cruchin' (vegetarian) sandwich without cheddar cheese, it was ok. I couldn't taste their grub sauce. Comparing this place to Lou's, I prefer Lou's sandwich. Grubbin' sandwich is about the same size as Lou's. Price is about the same. Menu wise, Lou's have more varieties. Overall to me this place is ok, nothing really special.", "author": "May H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-20", "description": "My boyfriend and I had the grubbin it and the juicin and both were really good (get it on Dutch crunch!). I was kind of turned off by sprouts in my sandwich but surprisingly I didn't mind them and actually ended up liking it! We also ordered the bacon cheese tots that were pretty bomb too. If your in the mood for a sandwich and in the sunset area I would highly recommend it. In my opinion I don't think it beats Ike's tho.", "author": "Linz C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-18", "description": "My favorite sandwich in SF!\n\nI've had both the spicy mouth waterin' and the lickin' which span both chicken and pastrami in terms blog base meat.  Both were amazing.\n\nThe grubbin' sauce is super flavorful and the Dutch Crunch roll hit the optimum point on the crunchy-soft continuum.  (See my other review about Sandwich Spot for more detail on how Dutch Crunch should taste)\n\nLong wait times during the busy periods.  We were told 25 min when ordering today, but we decided to go for it anyway bc the sandwiches are that good.", "author": "Sebastian N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-19", "description": "This place rocks!!!...Went back today, and picked up 3 sando's for the family...This place knows how to create some screaming combos!!!...Check this place out!...I gotta swim a few laps !!!...Yeeees!!!", "author": "Brian C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-30", "description": "Totally love this place! After fishing or biking around Lake Merced, my family has been here a few times. Absolutely delicious sandwich combos. I've tried the Juicin' and Grubbin' both on their amazing Dutch Crunch bread. Picture attached is from my visit last week, of the Grubbin' sandwich. So. Delicious. Grubbin has become a must-go whenever we visit family in San Francisco.", "author": "Danielle Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-29", "description": "Delicious sandwiches especially a win out here in the Sunset district. A bit pricey but the sandwiches are definitely loaded. House sauce is excellent. \nThe staff is a bit dull/lacking personality. It doesn't really look like they're enjoying their job which influences my experience of the food, for sure.", "author": "Maja J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-30", "description": "AMAZING!!!! I got the sweet mouth waterin' sandwich and added bacon & avocado! to die for! must try! excellent customer service!", "author": "Emily O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-26", "description": "Stumbled in here randomly and absolutely starving. Holy shit. Hit a god damn homerun. A new favorite.", "author": "Dan W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-20", "description": "Delicious sandwiches and awesome people :)\n\nLove their Dutch crunch turkey sandwich. Everything is very soft and yummy here!", "author": "ABC Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-22", "description": "Great food! Quick service. Nearby high school students flock here. Defiantly worth a visit.", "author": "Mack H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-22", "description": "Five stars all the wayyyyy!!! Great addition to the neighborhood, abundant street parking and nice guys making good food. Had the Spicy Mouth Waterin' and would definitely order again. So large I had 1/2 to take home!\n\nWhat makes Grubbin better than your ordinary sandwich spot is their signature sauces. A great depth of flavor stacked high, in between bakery fresh bread. All sandwiches are layered with the freshest ingredients: crisp veggies, meats prepared per order and scrumptious sauces. Sandwiches aren't overly sauced either - Just the right amount. OH! And they melt the cheese too! Thank you! I love that!!\n\nNice variety of chips and fries. The cheesy tator tots were surprisingly delicious. Everything is hand crafted with care. So happy this place opened. Will be back to try the veggie sandwich and wings soon.", "author": "Rosalyn W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-21", "description": "We were on the way to the zoo and needed a place to grab a quick bite to eat.. Yelp led us here.\n\nThey seemed a little overwhelmed with the number of people there and it took a while to get our sandwiches.\n\nHaving said that.. The sandwiches were worth the wait. Both the husband and I got the eggplant sandwich and it was delicious and the bread was super fresh.\n\n-1 star for getting garlic fries when we didn't order it and when we told them that they shrugged and said its on the ticket. I wished they were just a little bit more attentive in taking the order and how they handled the situation!", "author": "Anitha C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-10", "description": "Best sandwich shop I've ever been to by far! I am a huge sandwhich person, especially in love with Dutch crunch and they definately made it to the top of my list. \n\nVery good customer service and in a convenient location. \n\nDefinately coming back!!", "author": "Jessica S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-11-24", "description": "Grubbin ... I swear  wrote a 4-5 star review for you guys but I'm not sure what happened to it. Anyways, my last 2 experiences have given me mixed feelings.\n\nOrdered on many occasions: Juicin, Fishin, corn dog, tater tots, Grubbin Cheesy Tots\n\nDine in experience:\n1. Juicin - this sandwich is huge. it's a sandwich you need to share. Flavors are all there and the sprouts are a nice touch to the sandwich. This is actually my favorite. I'll even sub in the wheat bread.\n\n2. Fishin - big sandwich as well, pretty much same big sizes as all the others. Fish patties are huge and so damn good.\n\n3. side of tater tots - perfectly crispy and not greasy/oily. Tastes so good with some of that aoli. \n\n4. Grubbin Cheesy tots - wayyyyyy too salty. There is just salt overload and I had to drink a lot of water. The cheese is just really salty + all that bacon. it was like ... DAMN.\n\n\nTO-GO experience:\non 2 separate occasions ordering to go for a Juicin and Fishin ... Both sandwiches seems to lack in size compared to dining in. \n\nit almost felt like the sandwiches are made smaller because they were to-go. The Fishin' barely had any fish. The fish patties were lacking any fish meat. The Juicin seemed to be lacking meat as well. \n\n\nI've always had a great dine-in experience when eating here but the 2 to-go experiences have been disappointing. I'll stick to eating - in next time I want a sandwich and see how it goes.", "author": "Kenny L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-30", "description": "Came here on a Sunday afternoon around 3PM. Parking was no problemo! \n\nI ordered the Spicy Mouth Waterin' sandwich on sourdough. I wish they had sliced sourdough, but they only had sliced white bread. The sandwich lasted me 2 full meals. it was amazing. I asked for no mayo because it comes with Aioli, which is essentially mayo.\n\nThe chicken was cooked perfectly. I also noticed they slice their own deli meats here, which i completely appreciate. They have water cups for free water and also a fridge of your regularly offered drinks.\n\nThe service was superb! overly friendly and genuinely caring about our happiness.\n\nOne issue is that my boyfriend ordered his sandwich without cheese and sprouts. It came with cheese and sprouts. they immediately recreated for him and apologized profusely. hey, it happens :)\n\nThe restaurant seats about 10 people, so if you have a big group, get it to go and eat at a park or home.", "author": "Kailey O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-09", "description": "Loved this hole in the wall. Workers are very friendly and look forward to coming back!", "author": "Ty M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-26", "description": "I already super like Grubbin'.\n\nFirst of all,\nI gotta say\nthere's something really nice\nabout having a sandwich shop of this caliber\nso relatively close by my place.\n\nSecond,\nthey fashion a sando\nthat I would consider\na rare mix of\nold school mom and pop portions\nwith new school flavors like pesto aioli.\n\nBut\nmore importantly:\ndid I really find myself grubbing?\nwas my sando really that juicy?\n(Juicin':\nTurkey, Bacon, Avocado, Sprouts, Provolone Cheese, Pesto Aioli, and Grub Sauce)\n\nhell yeah to both.\n\nSufficed to say\nI will hella be Grubbin'\nfor many days to come.", "author": "Dan B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-29", "description": "Love the sandwiches here! You get free chips when you check on Yelp - highly recommend the Hawaiian kettle chips. We ordered the Droolin' sandwich today and split it for a light lunch....so so good! Ordered it on the Dutch crunch bread which was the perfect sandwich bread - crusty outside and soft inside. \n\nIf you are looking for a flavorful lunch for less than 10 dollars that will fill you up, then I highly recommend this place.", "author": "Vasu M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-29", "description": "Ever since I bought a bike I have been riding out to neighborhoods of SF that I never would have ventured to.  This weekend's adventures brought me to the Parkside neighborhood.  After biking about 10 miles the fiancé and I were starving; a quick yelp search for some veg friendly sandwiches brought us to Grubbin'.  A tiny little café with a large menu of sandwich combos as well as wings, fries and juice/soda.  We both grabbed the 'tastin' sandwich.  I modified mine to be vegan (no cheese, no mayo, no grubbing sauce) and added some spicy mustard with a side of BBQ chips (free with Yelp check-in!).  Each sandwich has your choice of bread (sourdough, dutch crunch, wheat, sliced bread) and standard fixins' (onions, peppers, lettuce, tomato).  I went for the classic SF sourdough and it did not disappoint! This bad boy was massive.  The perfectly toasted and crunchy sourdough bread was perfect with the roasted eggplant, sprouts and avocado inside.  At $8.50 this meal was a steal.  I was full for hours after finishing this beast of a sandwich.  Not too heavy or greasy like Ike's, Grubbin' sandwiches are filling but with fresh ingredients and great service.  Would highly recommend coming here if you're in the area.", "author": "Kelsey B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-05-12", "description": "Grubbin' is a sammie shop ala Ike's with named specialty sammies. or u can build ur own (6.49+). place has no atmosphere, just a prep counter and cashier counter.\n\neats: Grubbin' it(9)\n*\"pastrami, smoked ham, salami, bacon,  sprouts, cheddar cheese, pesto aioli, grub sauce\" with the usual lettuce, tomato, red onions, mayo.\n-tasted just ordinary, no wow. expecting too much?\n-sammie kind of big, not skimpy (just skimpy on taste)\n-doughy and mayo aftertastes\n-free chips.\n\ncrumbs:\n-friendly, fast service.", "author": "Victor G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-09-18", "description": "Average sandwiches - frankly no different than any other sandwich place in SF. Would give it three stars if not for the ridiculous conversation we had trying to order to go on a weekend since we were close by.\n\nIf ordering one of their signature sandwiches be prepared for a soggy drippy mess unless eaten immediately. Even then the second half will be drenched by the time you get to it. With that in mind we asked for a modification and ended up going somewhere else entirely as a result.\n\nOur last attempt at eating there we were surprised to find out that they either cannot or will not put their grub sauce on the side. They \"make it in the sandwich\" whatever the xxxx that means. We will never know since the guy on the phone did not care to explain and we do not care to return.", "author": "Easwud C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-07", "description": "Grubbin' is exactly that.  It's a tiny casual sandwich joint inside with little room to dine in.  I called my order in and picked it up seamlessly.\n\nDo a Yelp check-in and you get a free bag of chips as a one time offer.  I got the Juicin' sandwich which is turkey, avocado, lettuce, tomato, mayonnaise and some alfalfa sprouts.  I chose to have these ingredients wedged between a hunky piece of sourdough.  The sandwich is pretty hefty- more than a 6 inch.  I had to take a break and come back to it.  It's more gourmet than a Subway sandwich, and you can even build your own.\n\nI can't wait to grub at Grubbin' again soon!", "author": "Elizabeth S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-30", "description": "Came here for lunch with a couple friends since there were not that many choices to eat around the Taraval area. Stopped by here since they had pretty good reviews on Yelp. I was not disappointed.\n\nI ordered the Grubbin sandwich which consisted of a mixture of meats and veg. The sandwiches are pretty big explaining their prices. The bread was nice and crunchy and the flavors were on point. \n\nI will definitely recommend! Try to come early or later if you want a seat since the place is very small.", "author": "Arda S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-07", "description": "Ok, I just have to come right out and say it - Grubbin's sandwiches are..grubbin.'\n\nD and I each ordered a sandwich, when, really, we would likely have been fine with just one.  Didn't help that we had a $5 order of Grubbin' (garlic) Fries, either.  Wish the fries had been hotter (even though we ordered to go, I snuck a few fries in the car. They were plentiful of garlic - yum! - but just warm) and should have asked for extra spicy aioli and/or Grub sauce for dippin.'  We preferred my $8 Droolin' to D's $8 Savorin,' but both were tasty.  Loved all the standard fixings - lettuce, tomato, red onion, mayo - and the free extras - pickles, pepperocinis, and jalapeños, but the sauces really made the sandwiches.\n\nExpect a bit of a wait, since everything is made (and toasted to order).  Grand opening special gets you a free canned beverage or bag of chips with sandwich purchase.  Tim's Kettle Chips?  Don't mind if I do, thank you very much!", "author": "Mel T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-01", "description": "Get the 'grubbin it' or 'juicin it' for the full food coma effect. haha! But yeah, best sandwiches  on the block! Customer service is 10/10 too. Got the homie Brandon who knows how to make a fat sandwich that would definitely put you straight to sleep. (He would be the only dark-skinned filipino worker there) haha show some love with a friendly tip. \n\nDefinitely recommend to place an order over the phone. You would probably need to wait a while if you order at the store, thats why. And when you get there, don't forget to check-in on yelp to get a FREE bag of chips!", "author": "Darrell N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-14", "description": "Got the grubbin it sandwich. Best thing I've eaten in San Francisco! Bread was amazing, pesto aioli was delicious and the meat was just the right amount. Excellent sandwich", "author": "Paul M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-01", "description": "Just ate here. Must say, one of the greatest sandwiches I've had. Yes, it's not an Ike's, but it's straight \"Grubbin'\" I didn't know about this place until my roommate told me about it and asked if I wanted to do, so I said yeah, why not! Right as we enter the place, an amazing smell welcomes us in. As we started ordering, the workers helped us switch out things we didn't want, add things that were their favorites and at the end, the sandwich was perfect.", "author": "Yash P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-28", "description": "There's Ike's and Lou's.  Now there's Grubbin'.  These places offer sandwiches unlike ones you may make at home.  Or maybe it's just me.  Two slices of bread with ham, salami, or bologna with mayo.   Sometimes mustard.\n\nNowadays designer sandwiches come with special sauces.  And loads of other dressings.  Jalapeño spread, peperoncini peppers, house special sauce,etc.\n\nGrubbin' is now officially open. This is the first week so canned soda free with your sandwich order.  Three tables of four, and counter with seven stools.  \n\nWe walked up two blocks from home.  They opened at 11am.  Hours posted on the window,  M-F 11am to 7pm and Sat/Sun 11am-6pm.  \n\nPaper menu on the counter.  You can order a designed sandwich or build your own.  We ordered three sandwiches to go.  Bread is toasted unless otherwise specified.  We waited about 15 minutes.  \n\nThey also offer student lunch special as the local high school is two blocks up.\n\nThe sammies are good size. About 8 inches long and heavy.  I was full after eating 1/2 but forced myself to eat most of the second half. \n\nGrubbin' is a great addition to the neighborhood.", "author": "Shirley N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-14", "description": "It was a Sunday and we were in the mood to try something new. Don't get me wrong, our usual sandwich spot - Submarine Center in West Portal has never let us down. The fast service and top quality sub sandwiches are always something we can rely on.\nHowever, time to branch out and do some exploring. Who knows, we might find a hidden another hidden gem. JACKPOT! Grubbin' on Taraval/24th Avenue, is a place that was hidden off our radar, but now stuck out like Sutro tower on a foggy day. The service was great and the sandwiches are tasty as well. Super fresh bread (we had the dutch crunch and it was perfect) mixed with awesome meat/cheese/sauce combinations that are too many to remember.\nI had the \"Droolin'\", which was pastrami and salami, two of my favorites. That sandwich didn't have a chance and it was down the hatch in no time. My wife had a roast beef and our daughter had a salami sandwich, both of which were tasty as well.\nWe live in the nearby area so Grubbin' is up on our list a slight tick behind Submarine Center, only because Submarine Center are super fast in making the sandwiches. Those guys are an established go to place and it shows. However, I think the parking situation for Grubbin' is easier. At Gubbin' you can take your sandwich and enjoy outside at McCoppin Square on the next block.\nThanks Grubbin', we will definitely we grubbin' again soon!", "author": "Mark M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-20", "description": "Here is to another one of my very rare reviews. Felt compelled to comment on the quality of the sandwiches as well as customer service. \n\nI ordered the spicy crispy chicken sandwich, juicin, and the hot wings to-go. The quality of the bread was on point. I had the Dutch crunch and French roll. I am now actually wondering if they bake their own bread. \n\nI asked for all the sauces on the side bc I am so particular about textures and didn't want the sandwich to arrive soaked and soggy. To my amazement the crispy chicken sandwich was still  crispy and fresh! The grubbin sauce was great! The juicin came with a delicious pesto, as well. \n\nThe honorable mention goes to the hot wings. It's rare to have crispity crunchy wings in a to go order. The crispness was perfect and the batter was not heavy at all. I'll definitely be back! \n\nThank you for putting all my sauces on the side :)", "author": "Jessica L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-03", "description": "I'm excited that there is a great sandwich spot close to my work. My favorite sandwich is the grubbin and its huge! I ask for extra sauce with mine and usually get an order of fries on the side too. \n\nSometimes I call ahead and place an order with them if I only have a short lunch break.   The girls working there are very nice. Very accommodating of them!", "author": "Kendall L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-04", "description": "One of the better sandwich joints in the sunset, Grubbin' has a solid menu that'll satisfy many different kinds of palettes and diets. Aside from sandwiches, the restaurant also serves root beer floats and hot dogs--though I haven't tried either of them myself. \n\nThe prices--usually around $7-9 for a sandwich--are a little high considering that you're basically paying for two pieces of bread and some meat, but the portions are generous and you can easily turn one sandwich into two meals.\n\nYou can choose from one of the specials on the menu or build your own out of a sizeable list of ingredients. This isn't Ike's, but you'll be able to make a variety of different sandwiches from the available options. \n\nThe place isn't too big, so if you have a large party with you it might be best to just take your sandwich and go to the park across the street. There's a small selection of drinks and sides, but the sandwiches are really this place's specialty. If you're passing through the neighborhood on the way to the beach, or coming back from a morning at the zoo, it's not a bad spot to drop in for a bite.", "author": "Amanda R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-08-16", "description": "Just came in for a sandwich with my two friends. I ordered first and knew something was off when they got their sandwiches before me. 15 minutes after they got theirs mine finally came. I know stuff happens, people forget or get mixed up, I work at a tea shop so I get it. However, they didn't even acknowledge it. No thank you for waiting, sorry it took so long, just gave it to me after 5 people who ordered after got theirs first. \n\nThe food was $16. Sandwich was $9. $7 for cheese fries? For real? There was bacon on it too, which I didn't ask for. I'll take my business to Lou's instead.", "author": "Shira S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-09-02", "description": "Just tried the garlic parmesan chicken wings - unfortunately they were soggy, small and overpriced.  I don't think I'll be coming back.", "author": "Ernest S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-05-12", "description": "This place is one of those mom and pops place.  Pretty clean inside,  but has no ac. I was excited to try the cheesy tots but the fryer is broken,  :( another day I guess. \n\nDroolin 3.5: pastrami, salami, pepper jack cheese, grub sauce, garlic aioli, jalapenos, pepercinis, I chose the dutch crunch bread, only way to eat a sandwich.  The sandwhich also comes with a small bag of chips (lays bbq, cheetos, sun chips, fritos) and a bloe pop! The sandwhich is supposed to come with fries inside but the fryer is broken. I totally forgot,  could've gotten the same sandwich for $2 less by building own sandwhich. The sandwhich was great,  nice crunchy bread,  tender pastrami and good sauce (chipotle like), but it was small,  this the 3.5 stars, and the no fries.", "author": "Thuy N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-22", "description": "Stopped by SF for a quick meal as we were driving down south. The staff were kind enough to stay open a little bit longer to serve us, as we came in as they were closing. Luckily we were planning on take the sandwiches to go. I ended up getting the savorin' with everything with the dutch bread and my gf got the juicin' with the french bread . Both were really good. The juicin' had a refreshing and clean taste to it. The savorin' had a good flavor and the sauces weren't overpowering. Besides the taste, the sandwiches were a good size and a reasonable prize. Would definitely grub again.", "author": "Samer M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-13", "description": "Amazing spot to pick up a quick lunch. I would recommend calling ahead and ordering if you don't like waiting. \n\nWe ordered the Spicy Mouth Waterin Sandwich on Dutch Crunch bread. The sauce and the bread really make this choice amazing. \n\nThe only thing that's keeping this from 5 stars were the tater tots, they were a little soggy.", "author": "Devin L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-20", "description": "Came here to grab a bite to eat before the Warriors game. My friend recommended it. My sandwich was amazing! It was a chicken tender sandwich with honey mustard on sourdough bread. Very well put together (I hate sandwiches that are thrown together. Like \"One shit storm coming right up! Here ya go!\" Not the case with this place fortunately) and very filling. Excellent and prompt service as well. Thank you, Grubbin'! My go-to sandwich spot for wherever I'm in The Sunset from now on.", "author": "Tati N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-13", "description": "Whoa, how did I miss this place?? So good, generous portions of meat, cheese, and veggies. Friendly staff, clean and new dining room. Carefully prepared, perfectly toasted sub.\n\nI thought Lou's was the automatic choice on Taraval. Finally noticed this spot last week and gave it a try. A serious rival has emerged. Like Lou's, the menu is well thought-out and each sandwich is unique instead of offering just the typical options with cute names and loads of sauces that get everywhere (i.e. Ike's.) The sandwich artists take their time in layering the ingredients within the confines of the bread and wrap the sandwich twice with paper. \n\nThis place is quickly rising to #1 on my personal SF sandwich list.\n\nThe good overwhelmingly outweighs the bad at this place. Highly recommend!", "author": "Patrick H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-19", "description": "If only you were in Boston... Grubbin' was a wonderful treat during a quick stop in SF. We ordered the Spicy Mouth Waterin' with a side of Grub Fries (garlic fries). After a recent disappointment in the garlic fry department (oil instead of fresh garlic), I was instantly pleased when we were served our heaping tray of piping hot fries tossed with fresh garlic. The sandwich was made on Dutch Crunch bread which is my new all-time favorite. The chicken was crispy and finished with a delicious combination of spicy aioli, ranch, and grub sauce. I'd highly recommend this spot considering it was the first time in a while where I was able to find that perfect balance of spice and crunch with fresh ingredients. A must if you're in the area!", "author": "Erika B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-15", "description": "This place is yummy. I like anything with pastrami. The garlic spread is really good.\n\nTheres also a big TV where I saw the seahawks get rekt.\n\nParking is easy, Mccoppin and Lincoln High have lots of spaces", "author": "John R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-29", "description": "Came to this part of town because Craftea was closing. :(. However, since the line was hella long I decided not to go, I'm sorry, but I just couldn't deal with that line. :\\. It was good and all, but not that good. SOOO, decided to grab a sandwich here to try it out! Thanks for accommodating my order even though you guys were closing up soon! Ended up getting the Juicin': turkey, bacon, avocado, sprouts, provolone cheese, pesto aioli, and grub sauce all on a dutch crunch roll. MY KIND OF SANDWICH. I got it to go and didn't end up eating it until like 30 mins later, but damn that was still pretty good. :D. A bit soggy, but like I said, I ate it much later. I'm sure it would have been better fresh. All in all, a solid sandwich spot--plus they have stamp cards! Yeeee. I'll definitely be back if I'm in the area. ;D. So many other great looking combinations there. :] Thumbs up, grubbin'!", "author": "Mariel A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-24", "description": "I'm not a big sandwich person, but when I tried Grubbin', I was happily surprised. \n\nVery yummy turkey sandwich and great service. \n\nNew spot that is definitely worth trying!", "author": "Irina R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-06-25", "description": "Good sandwich but soooooo NOT worth the wait at all. 3 people making sandwiches literally one at a time, 1 person taking orders, and 1-3 people standing around. 45 minutes from ordering to handing me the order.", "author": "Carol P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-15", "description": "Amazing service. Fast and easy orders. In n out. Just like that. Awesome food. Free chips with check in. Super close to the zoo...", "author": "Tj P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-18", "description": "-awesome service, yes I know it's a sandwich spot...but they really do all the little things that make the BIG difference! they're considerate about take out packaging, being mindful of what's being ordered and how it can stay yummier for longer :)\n\n-their sammies are bomb.com, but DON'T forget about the tots! and chicken tenders. DELICIOUS. I'm a tater tot connoisseur and these tots...perfectly crisp, flavored and not oily.\n\n-their spicy aioli - in their sandwiches/dipping sauce. These guys know how to make it spicy! I hate it when places call their sauces \"spicy\" and its not... spicy.... not the case here :)\n\nSo glad I found this spot!! Always know I'll get something delicious. Big portions - good bang for the buck!", "author": "Selina W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-31", "description": "Wow! This place totally saved the day!\n\nAfter trying to get food at several other restaurants in the area that were closing early or closed for New Year's Eve, we drove by Grubbin', parked and had some of the greatest sandwiches in a long time! \n\nThe garlic fries were delicious, between three of us we had three different sandwiches and all very satisfied, even taking almost one full sandwich home for leftovers. \n\nHighly recommend this spot, amazing bread, but they ran out when we were there so go early and you will enjoy whatever you order!!", "author": "Liz B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-04", "description": "This update is long overdue.  I came back to Grubbin'  last month and ordered the Spicy Mouth Waterin'.  This sandwich comes with chicken tenders, spicy aioli, ranch, and grub sauce.  Per the name, you would think the sandwich is spicy, but it's not.  I wish there was more of a kick from the spicy aioli, but the added jalapenos and pepperoncinis definitely helped. The flavors combined made the sandwich very tasty and I liked that the chicken was moist.", "author": "Candice H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-20", "description": "SF is filled with great sandwich spots, to the point where no sandwich really makes me swoon anymore. However, life's really all about the little things, and Grubbin' does them perfectly well. I'm a self declared sauce boss and have been since I was a kid, and Grubbin' offers a plethora of sauces. If you're a glutton who shamelessly asks for a ridiculous number of sauces on your sandwich, then Grubbin' is for you.\n\nAlso, it helps that the sandwich is huge, bread is perfectly toasted, meat is above average quality, and contents of the sandwich are very generous. If you order any of the chicken sandwiches, the chicken is perfectly toasted; too often have I received chicken sandwiches where the breading is some weird loose soggy foreskin. \n\nThe staff has a great attitude and are very accommodating. Well worth the slightly above average price of $10 a sandwich.", "author": "Douglas Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-08", "description": "I always come here when I'm craving a really good sandwich but don't want to try and go to Ike's. It's THAT good. I usually get the spicy mouth waterin' with everything on it. I have yet to try anything else because I'm always so satisfied with that sandwich that I have no reason to try anything else! It's definitely one of the best sandwich spots in the Sunset/Parkside area!\n\nThe workers are also very friendly (they probably recognize me by now) and they always play good stuff on the TV. Just avoid the restaurant during lunch time on weekdays unless you want to deal with all the high school YOUTHS. (They're alright, I'm just old and cranky).", "author": "Gregg H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-20", "description": "My first yelp review ! I have been wanting to try this place since it showed up on my yelp search. I went for the first time this week and got a couple sandwiches. \n\nTastin' : it's their veggie sandwich and I got it on Dutch crunch plus jalapeños. Let me just say they do not skimp on the eggplant. I thought all the sauces tasted nicely balanced but the sandwich got soggy quickly so eat quickly. \n\nAlso tried the Juicin' : this one had turkey, bacon, and all the veggies piled high. Also got this one on Dutch crunch. Their serving of turkey is very generous and this sandwich was very good overall.  \n\nLastly, even though the sandwiches are great, I gotta take a star off for the wait. It took me about 15 mins to get my sandwiches after I ordered.\n\nWill definitely come back again. Especially since their fryer was down so I couldn't try their chicken tender sandwiches.", "author": "Celia Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-05", "description": "This place is pretty solid. The food is a little greasy, but at a place called Grubbin', you'd be hard-pressed to expect anything other than that. If you've had the garlic fries at AT&T, then you can't really compare, but they give a generous topping of chopped garlic on top of your thin-cut fries for $5. Again, super greasy, so be aware. The sandwiches are bomb. Their special spread is fatty and delicious, and if you know what you're doing, you're going with dutch crunch, bacon, and avocado. After that, you can't go wrong. Portions are huge, and a make-your-own sandwich starts at $6.50. Their specialties go for $8/9. Friendly people and large portions. Can't go wrong. You also get a free small bag of chips for checking in and buying a sandwich. What. The interior is small, so I would say get your stuff to go and enjoy the park next door with some milk tea.", "author": "Danny C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-06-23", "description": "The bread was REALLY REALLY hard. I almost couldn't bite through it. Other than that, it was a pretty good sandwich. The sandwich took pretty long to make though. Probably because they were toasting the bread.", "author": "Yeah O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-25", "description": "This is my new favorite place for a few miles around. Bomb sandwich. Period.\n\nAnd free chips with Yelp checkin", "author": "Gaurav A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-06-07", "description": "Wanted to try this place out since they said it was similar to Ike's. It was okay compared to Ike's. It wasn't bad, but I kept comparing it to Ike's and Ike's sauces and sandwiches are so unique and spectacular.\n\nI got the Droolin' (Pastrami, Salami, Pepper Jack Cheese, Spicy Aioli, and Grub Sauce). It was $8 - which wasn't too bad and it came with a bag of chips. It wasn't spicy and the sauce was really thin - it kept dripping out. I got Dutch Crunch for my bread, it was really soft - I loved it! I think if the sauce had been better - more flavorful/spicy - it would have been good. \n\nThe service was a bit slow since it was just the two of us and another couple. I think it took them at least 15 mins to make our sandwiches. \n\nI'm down to try this place again because the sandwich wasn't bad and the location is much better compared to Ike's.", "author": "Annie H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-31", "description": "LOVE the sandwiches at this place! the bread is not overpowering at all and the sprouts make the sandwich taste earthy and delicious :) Its a homey little place and I love their customer service. \nI work down the street and they did get my order wrong once so I called them back and they were apologetic about it. I even asked if they could deliver it to my workplace (my boss wouldn't let me leave again to get the sandwich) and they delivered it right over quickly :) \nOne of my go to places to grab a delicious sandwich on my workdays :)", "author": "Nancy W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-13", "description": "this place is an absolute gem on taraval. my experience was fast, efficient, and very easy, just the way i like it to be!\n\non a saturday morning around 11, i called in for a Juicin' sandwich for pickup. i had to call several times before anyone picked up the phone. i assumed they were busy and don't have call waiting, and voila! i connected with someone on the third phone call. the guy on the phone was very friendly, and the order was quick and painless. he informed me that my sandwich would be ready for pickup in about twenty minutes.\n\nwent and picked up my sandwich exactly twenty minutes later, and it was wrapped and ready to go! total came out to be around $11, which i think was pretty good considering the size and contents of the sandwich (turkey, bacon, avocado, sprouts, provolone cheese pesto aioli, and grub sauce). the dutch crunch was the perfect level of crunch as well. personally, i could only eat half of the sandwich, and would recommend it to be very share-able, but i could also see a very hungry person eating the whole thing. i would definitely go back again :) \n\ncheck in on yelp for a free bag  of chips with your sandwich! there are also lollipops by the cash register for your taking. oh, and grubbin offers stamp cards, buy ten sandwiches and get one free!", "author": "Caitlin C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-05-05", "description": "I don't like leaving negative reviews unless the people are lying jerks, so I'll keep my comments short and maybe even give them a do-over. \n\nMy sandwich wasn't grubbin. It was soggy. And they can use a spring cleaning day. \n\nOk...that's all. Gonna head up the street to Lou's Cafe now.", "author": "Justin H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-01", "description": "Like a true Yelper is was feeling for a sandwich while wasting time out in the sunset and found this place and like their name sake it is HELLA Grubbin!! \nI had the Jucin' and I was very impressed.\nTurkey bacon avocado are the main ingredients matches with an aioli sauce and some type of Grubbin sauce. \nI usually only eat half and sandwich and eat the other half an hour or two later but this was sooooo good I ate it all. \nI can't wait to be back in that area so I can try another one of their amazing sandwiches.", "author": "Blake R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-22", "description": "Modest looking sandwich shop, but boy do they have flavorful sandwiches. I don't particularly crave sandwiches unless they're done well with healthy ingredients that compliment each other and leave me wanting it again soon. This place did just that to me. I had it twice in one week. Tastin' is eggplant, avocado, Brussels sprouts, and a sauce I can't get over. They recommended dutch crunch bread which is sweet on the outside - one of the best breads I've had. I will likely become a regular here!", "author": "Jennifer L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-12", "description": "I'm not one for sandwiches but Grubbin' has got me re-revisiting the my decision to give up on carbs. \n\nWe ordered the \"Lickin'\" but it happened to be out. I guess that makes sense since it's probably their most popular. We settled for the \"droolin'\" and I have to say, true to it's name, I'm still salivating after I've finished the giant monstrosity that they call a sandwich. And a delicious sandwich it was, the bread was soft and fluffy, lightly buttered and toasted just so that each bite was met with a nice KRUNCH. It was a perfect blend of spicy aioli sauce, grub sauce, pastrami, and salami in every bite. The chopped lettuce and fresh onion gave the sandwich another nice crunchy fresh layer. It was a sandwich of perfect harmony.\n\nWe also ordered a side of garlic fries which, as it turned out, was unnecessary. Maybe we were just full from the sandwich, but we didn't finish much of the fries. Also, it tastes a bit stale.\n\nAll in all, still great place to be, especially on a Sunday afternoon with the Giants game on the big screen.", "author": "Lu G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-17", "description": "Great sandwiches. Finger licking good! We tried veg crunchin and chicken.", "author": "Meera S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-24", "description": "Delicious and dog friendly! These sandwiches are huge and amazing. I had the Juicin' and loved every bite. It is easily enough for two meals. Although the sandwich is ginormous, make room for the tater tots. They are perfectly fried (not oily or mushy) and come out hot and yummy!", "author": "Andra K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-21", "description": "This place is the ish... Reminds me of when I was in high school and went to the near by sandwich spot with all my friends. The guys are nice. Always attentive. \n\nTried the spicy mouth waterin', for the first time cause of a co worker and I was in sandwich heaven, even my son loved it.  \n\nThe wings and fries are sooo good. Thank you sandwich gods for this spot near my job. I will most definitely come back and recommend you guys to all the customers asking what's good to eat around 15th Ave.", "author": "Geenaa L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-06", "description": "Easily one of the best sandwiches I've tasted in my time visiting SF. I came here with my friend before we went sightseeing for the day, and we were both amazed. We shared the Grubbin' It, and I was glad we did because the sandwiches here are huge! They are not so large where it doesn't satisfy, but it's juuuuuusssttt satisfying enough to make you content. The sandwich was warm and the cheese was melted perfectly.", "author": "Jessica L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-29", "description": "Wow wow wow!!! Hands down favorite Sandwich place at the moment. Fries are crisped to perfection. Don't forget to order Garlic. I ordered a Juicy with everything on it and the first bite was ammmmazeballs. Then I bit into my boyfriends Spicy Mouth Watering (with Avocado, Bacon, switched the chicken to turkey) and it was even tastier than mine. I will be ordering the Spicy Mouth Watering next time.", "author": "Margarita M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-30", "description": "Extremely good sandwiches! My boyfriend and I came here to compare it with Little Lucca's sandwiches. Although they aren't as big, they are made warm and crispy whereas at Little Lucca's it's served cold, but a huge portion. Great environment as well. The workers are really nice and plus they're Warrior fans!! I would definitely return!", "author": "Michelle H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-10-09", "description": "I come here every couple months. The sandwiches are delicious. Juicin' is probably my favorite. The Dutch crunch is amazing.  The sauces are good. \n\nUnfortunately, I am taking off two stars because I have waited 25 min for my sandwiches the last two times I have been here. \n\nTLDR: foods good, wait is ridic", "author": "Wilson M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-08", "description": "I usually don't give 5 stars but I've been here four times and every time, I've enjoyed my delicious sandwich and my overall experience.\n\nI build my own sandwich: dutch crunch with turkey, grub sauce, spicy aioli and everything included. The sandwich is perfectly warm and bread is nice and toasty. It's a pretty bulky sandwich - I usually save the other half for later. \n\nThe workers are super friendly and they really strive for above and beyond customer service. This has been my go-to spot for a good yummy sandwich. \n\nNot to mention, a free bag of chips when you check in on Yelp! So worth it.", "author": "Aimee W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-24", "description": "Solid sandwich for sure.  Cool peeps running the place.  Not a worldbending chicken sando, but there's a fierce chicken sando game going in SF and Oakland so its tough.  Solid and if I'm in the neighborhood would return", "author": "Christian S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-06", "description": "I work in South City and the place - despite it's moderate amount of food options - is a food desert. Everything eventually starts to taste the same. I went out of my comfort zone to go to Marco Polo for Ice cream, saw this across the street. While I had to battle for a spot in the line with a few high school grade school kids, I was utterly shocked at the selection that they had. I went for their Sweet Grubbin' Sandwich. The sandwich's sauces were to die for and the fact that they fried their chicken prior to putting it on the bun is what made the sandwich shine. \n\nI really like this place. I'll be coming back here, again. I like it a lot, the seating options here is the only reason I knock off one star.\n\nKeep up the good work!", "author": "Jane E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-04", "description": "I love the spicy mouth waterin. I try to stop here every time I'm in town. Just thinking about it makes the mouth water, in fact.", "author": "Amber J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-03", "description": "My boyfriend and I were visiting SF and wanted to grab a quick bite before we head to the beach. They were super helpful and informative. The answered any questions we had. The sandwiches were delicious. I wish I remembered what I ordered! Definitely would come back next time I visit!", "author": "Lily L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-12", "description": "We stopped by here while in the city for a basketball tournament. It was a little out of the way but well worth the trip. The service was excellent and the food was not only delicious but fresh. Definitely a spot we'll come back to.", "author": "T P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-28", "description": "LOVE THE SANDWICHES!!!\n\nFor it's price, they come in HUGE sizes. I swear to you, I feel so filled after the first half of the sandwich. \n\nFurthermore, they are VERY dog friendly. They have a bowl of water with tables outside AND they have dog treats.", "author": "Christi A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-26", "description": "If I didn't have to do 1000 crunches after eating a Dutch Crunch sandwich, I'd come here every day. Okay... that's a lie. Every other day! This is such a good sandwich spot to satisfy your satiety while keeping your wallet full. \n\nI didn't get the special sandwiches; tried the make-your-own grub instead, and... I guess I have a pretty good idea of what to put in my sandwiches. Or it may also be the fact that they pack in your fillings extra large and extra tight. So generous for a huge $7.00 sandwich! Try their special sauce as well for an extra kick and for 1st timers, check in for some free chips :)\n\nThe 1000 crunches might even be worth the 20 minutes of Dutch Crunch heaven...", "author": "Mandy C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-14", "description": "Best sandwiches in the sunset. Doesn't cost an arm and leg either.\n\nThey give you a choice of bread along with the sandwich, also ask for jalapeños to give your sandwich a kick.\n\nItems on the menu are all less than ten dollars\n\nSandwiches may be a bit salty for some, they're all a bit heavy in flavor.", "author": "Mia M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-30", "description": "First time. Amazing! Everything I want in a sandwich shop. I ordered the Spicy Mouth Waterin' on Dutch Crunch and small fries. Both were incredible! Great bread that was so warm and toasty. Fries were perfectly cooked to my liking, no mushy ones. Grub sauce is great. I am stuffed! Can't wait to try something else. Friendly staff too. What a gem in the Sunset!", "author": "John H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-27", "description": "Delish. Savorin', Juicin', Sweet mouth waterin', garlic fries, and cheesy tots- tried it all. The Dutch bread was our favorite. Prices good,  not dirt cheap but worth it.", "author": "Gina M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-28", "description": "Sandwiches r really good here. Grubbin sauce is grubbin!\nThere's even chicken tenders, corn dogs , tater tots and fries for the kiddos. \nFriendly staff!", "author": "Grace T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-12", "description": "My chicken sandwich was piping hot and tasted great. Not a lot of seating but luckily we were the only ones there. Prices arent too bad.", "author": "Jeff E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-04", "description": "The sandwiches here are super yummy! A great place to get some delicious sandwiches if you're near by. Highly recommend it (:", "author": "Rachel H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-03", "description": "Came here randomly to get something to eat, had no expectation to what the sandwiches would taste like, chose the veggie option, Tastin. Waited for about 10-15 mins and then got my sandwich. After the first bite I was surprised by how good it was. It wasn't too saucy, plain, or overwhelming in flavors. It was perfect. I couldn't stop biting into it until it was all gone. Great spot! Will definitely come again!", "author": "Josephine L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-07", "description": "Really good sandwiches. I ordered the Droolin' ... and I was literally droolin'.\n\nThe only reason it's not a 5 star is because the wait for the sandwiches was a bit long. My friend and I ordered 3 sandwiches with maybe 2 people in front of us and it took over 20 minutes to get our order.", "author": "Chrisy Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-19", "description": "They DO Fried Chicken Sandwich Right.\nI wanted to get the thing for a long time and I finally got it.\nAnd it was Awesome, Spectacular, Fantastic, you name it. \nI mean OMFG, Shit, I crap my pants like good shit!\nI got the chicken tender sandwich w/ everything on it.  \nThe chicken was really juicy and the signature Grub sauce was great w/ a big nicely toasted Dutch Crunch roll. \nMade my day!\nThank you Grubbin', I'll be back.", "author": "Nobu K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-30", "description": "First place we came as far as food in San Francisco during our visit and it was sooo good! My husband and I both did the make your own sandwich with crusty bread(can't remember exactly what they called it) with the Grubbin sauce... This place got our SF visit to a great start, Thank you guys!", "author": "Anna K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-05", "description": "They did it....they made their dutch crunch just perfectly crunchy and toasty.  5 stars.....go here its freakin delicious", "author": "Vince L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-23", "description": "I appreciate when customers like myself come in a little before closing after a long day at work and the workers who have probably also had a long day don't push you out of the store.  With that being said, I love a good deli sandwich.  So I come in and look at their menu and decide to try the Juicin - turkey, bacon, avocado, sprouts on dutch crunch.  I thought it was going to be pretty standard, but I was wrong.  It was totally Yum.  I don't know if it was the sauce they used or what.  The turkey and veggies seemed really fresh.  The price was reasonable, the service was great, and the food was good.  No complaints here :)", "author": "Christine D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-12", "description": "This is the go-to place!! Their sauce is so good, not too expensive, and a great atmosphere. Park on the hilly slope and parking is free! This is the place you want to go for a quick sandwich - they have something for everyone. I can't emphasize this enough: no one I've brought here has had a remotely bad experience. Keep up the good work, grubbin'", "author": "Sean H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-03-13", "description": "Their sandwiches are good, but they have super slow service!  There is no reason to wait 30 min for 2 sandwiches at 2:30pm, with 4 people working there.  They even had to turn away customers at one point because they told them it would be a 25 minute wait.  Totally ridiculous.  Get your act together!!!", "author": "G W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-04", "description": "This is my DEFAULT spot for Sandwiches in Sunset.  The sandwiches are yummy and the toasted Dutch Crunch is a must.  Introduced this sandwich spot to my coworkers and now they come here pretty often.  We even do lunch orders here for some of our meetings.  This is definitely one of the better sandwich cafes in SF. This place can get pretty busy so order ahead of time to avoid the long wait!", "author": "Denise C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-24", "description": "Grubbin is as good as its name would imply. They have great signature sandwiches, (you can also build your own). They are easily My fav sandwich spot in the neighborhood. I'd be hard pressed to think of many that are much better anywhere though. Definitely worth a stop if you're in the area. \n\nThey give you free chips with check in, they used to be free all the time, but alas now I have to press two buttons to get my chips. No worries though cuz I like letting others know about not so hidden gems like this one. Try it some time, I'm sure you'll like it.\n\nCHAD", "author": "Chad L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-16", "description": "Any place that serves tater tots is a winner in my book. And the sandwiches are great.", "author": "Tommy A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-17", "description": "Great stop!  Thanks YELP for not steering us wrong.   The sandwiches are fantastic and the service was great.  Portions were quite generous.  I'd highly recommend this place!", "author": "Craig D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-19", "description": "Had the Droolin' sandwich. Excellent french bread, and thin sliced meat. Would recommend to friends.", "author": "John C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-18", "description": "Saw good reviews on Yelp so I decided to stop by and SO glad I did. I got the Tastin' sandwich on the Dutch crunch bread and I really enjoyed it. You can make your own sandwich if you want too which is cool too. I think which ever sand which you choose you will enjoy. Its a very mellow place which looks family owned. Overall really good I ate half and saved the other half for later !", "author": "Cynthia R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-03", "description": "Just happened to be working this morning got a sudden crave for sandwiches so I looked for the nearest place around me and saw that this place was about to open in a few minutes so I park my car and walk to store I get greeted by the employee who is very nice and chill dude but they ran out of fries but then he offers the check in yelp deal and I get free chips so I ordered the grubbin it sandwich and my god this shit blew my god damn mouth away, so many juicy meats going on at once and their sauce is like the blood of Christ himself, this shit is so amazing that I want to stick my dick in it and have babies with it. the bread has an amazing crunch to it and shit man I'm still eating the sandwich as I'm writing this review. Even though I don't come to sf often to work, but on the days that I do I'll definitely be coming here to get my sandwich fix.", "author": "Johnny M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-11-25", "description": "Not a very good spot for vegetarians and especially not vegans.  The service was spotty although they were fairly nice.\n\nThe only issue was that they wanted to charge me extra for ordering a vegan sandwich...  They actually tried to charge me for EXTRA MEAT price on my two vegan sandwiches that had less ingredients than any of their listed sandwiches.  I had to do the math in my head and ask them about it until they reluctantly gave me the normal price.  I felt like it was a little ridiculous to make your guests catch errors in your ordering system and still fight them on it.  They made me and my girlfriend feel completely unwanted in their little sandwich shop and did not put our needs first.  I could tell they thought we were crazy because we didn't want meat, cheese, or their gross sauce.  As a business owner in San Francisco, this attitude only makes you look stupid and hurts your wallet, not ours.  \n\nThe actual sandwich we got was really bad.  The eggplant was bland and had an off taste/texture.  They don't know how to cook, they just throw the stuff you had in a college cafeteria in between some bread and splash sauce on it.  Ugh....  BORING.\n\nFor the money you spend here you get a really bad sandwich that is trying too hard to be hip.  There are so many great deli's in the city that don't charge $8 for a sandwich or $4 for a handful frozen tater tots.", "author": "William G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-15", "description": "This place is amazing!!! Thank you friends for bringing us here. ps please open a location back in Orange County pleaseeee!! Ohhhh and we're taking a sandwich for the road :-)", "author": "Maria A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-24", "description": "Best sandwiches of my entire life omg Love the juicin' *emoji heart eyes*", "author": "Diana C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-06", "description": "Everyone I take here likes the sandwiches.\n\nI really like Juicin' which as turkey avocado and sprouts. It is close to $10 so it's one of the more expensive sandwiches. Now I usually opt to \"build my own\" and get turkey with pesto aioli - it tastes similar to Juicin' but it's only $7 I think.", "author": "Derek M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-14", "description": "Grubbin replaced the hotdog place that used to be here. The restaurant layout reminds pretty much the same.\n\n== Food ==\n\nThere's a wide variety of sandwiches with pretty interesting names.\n\nGrubbin' It on dutch crunch was pretty awesome. This sandwich comes with pastrami, smoked ham, salami, bacon, sprouts, cheddar chesse, pesto aioli, and grub sauce. It's one greasy sandwich, but it tasted good. The sandwiches are toasted with the meat.\n\n== Service ==\n\nThe sandwiches come out pretty slow. Probably a 10 minute wait for it to be done.\n\n== Overall ==\n\nGood sandwich place at good prices.", "author": "Steven B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-08", "description": "Good food, great menu, pice is good, place is clean and staff are friendly. Sandwich makers need hair covers.", "author": "Judy A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-13", "description": "When you first walk up to this place, all you can smell is savory goodness. I can't even explain what it is exactly. It's like they're making sandwich magic inside. I ordered the grubbin for my husband and I had the turkey provolone. Mine was good but I took one bite out of the grubbin and instantly knew why this sandwich was named after the restaurant. I don't even like pastrami that much and this was da bomb dot com forward slash grubbin. Make sure all of your sandwiches come with the grubbin sauce and their Dutch crunch is as crunchy as can be! Soooo good!!", "author": "Tiffany H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-26", "description": "Good sandwich places are hard to come by. I mean, in SF alone, there's probably hundreds of sandwich shops, deli markets, and cafes that offers sandwiches on their menu. \n\nBuuuuuuuuuuut, Grubbin' definitely deserves a spot towards the top of your list. Their selection of sammies doesn't trail on and on, but what they have to offer is already enough. Seriously, if you look at their menu, you can see that most of their sandwiches have a variety of 2-3 different kinds of meat (ranging from pastrami, roast beef, chicken tenders, ham, salami, turkey, or bacon). Alrighttttt and now you're thinking they probably skimp on their meat since they can't really include all that meat in one sandwich. WELLLL THEN. Let Grubbin' surprise you. Their sandwiches are loaded. And I'm not talking about their veggies - lettuce, tomato, sprouts, but their meat actually piles high. You WILL be full. \n\n--Grubbin: meat lovers dream \n--Juicin' : can't go wrong with a solid turkey, bacon, avo sammie. Paired with their jalapeno and grub sauce. Perfection. \n--Tastin' : round of applause for providing a veggie sandwich. I actually discovered just recently that veggie sandwiches are pretty damn good. The eggplant and avocade were the highlights of this sandwich. Sooooooo good! Non-guilty pleasure. \n\nIf you really like wet sandwiches, they would be great for ya messy eaters! I usually like my sandwiches a little less crazy so I ask for less sauce, which is perfect for me! \n\nI have high hopes for this place and I only see it getting more popular. My only hope is that the quality and proportion of their ingredients won't dwindle when it gets its name out there.", "author": "Regina C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-12-03", "description": "Solid sammies. Nothing to write home about, but definitely worth stopping by for a lunch time fix if you're in the area. \nThe staff was friendly and accomodating.\n\nTip: Check-in on yellow for a free bag of chips!", "author": "Aleyna S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-31", "description": "This place is soooooo bomb!!! Relatively new, but it really exceeded my expectations of the perfect sandwich! Perfectly toasted Dutch crunch with soooo much meat and the perfect amount of toppings/condiments... drenched with their delicious grub sauce! Their sandwiches are perfect if you're hungry and you've had a long day of work/school or if you're just looking for something to share with your girlfriend/boyfriend/friend! $10 sandwich and comes with free chips! Atmosphere is very chill too if you wanna eat there! The workers are super nice and friendly too! Definitely have their customer service as well as culinary skills! Would highly recommend this sandwich shop, I think it's better than gene's, Ike's, and little luccas! My new go to spot!", "author": "Doug W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-01", "description": "I love this place! the only downfall is that they close early. I always get the Droolin'. If I can marry that sandwich, I would! big sandwich, I usually do two meals with it. sandwiches are toasted so it comes hot. Yummy!", "author": "Jules L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-28", "description": "Visiting from Reno for a soccer tournament and found this treasure between games. One of the best sandwiches I've ever had. Highly recommend it. Great service too.", "author": "John P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-13", "description": "I came here with my cousin not too long ago and we were craving for some decent sandwiches. Decided to give grubbin' a shot after looking at the reviews. I ordered the grubbin' and he ordered juicin'. We both agreed that we like grubbin' more. It was sooooo goood! \n\nThe tater tots with bacon, cheese and sour cream was meh..\n\nMost definitely coming back for more sammies though!!", "author": "Tracy V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-29", "description": "Sooo delicious!!!  We were incoherent from how hungry we were and found this place nearby on Yelp.  Even though it was noon on a weekend and there were a handful of people in the shop, we ordered and got our food pretty quickly which was great.\n\nMy partner and I shared the Droolin' and the Lickin'.  The Droolin' was MIND-BLOWINGly good!  The Lickin' was delicious also, especially as far as Corned Beef is concerned.  The Dutch Crunch bread though... omg in and of itself a reason to go to Grubbin'!!!\n\nAlso had a root beer float which was good but made with hard ice cream which isn't my fave.  All in all though, a spot I would definitely hit up regularly if I lived closeby.", "author": "Denise Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-28", "description": "Yummy food and option, cool people working! It's a nice little spot on Taraval right near the train for your convenience. The menu names are fun and all well described. I've had a few things here including the tots and loved it!", "author": "Daniel S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-27", "description": "This place is surprisingly nice for what looks like a makeshift kitchen. \n\nWings and tater tots. Wow. I totally loved it and you can order the wings without sauce if you don't like buffalo flavoring. Plenty of dipping sauces too. \n\nHad a great lunch there after shopping across the street at Noriega Furniture (which is on Taraval).", "author": "Tracy Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-02", "description": "Today was my last day in Sunset before I move and I'm pleased to say my last lunch here was Grubbin. Their sandwiches are fresh, huge and the service is friendly. Its a small quaint place I recommend checking out. \n\nPs- Try the Grubbin It. I thought it was going to be too salty given all that meat but it was delicious!", "author": "Lizz H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-18", "description": "Gotta love a new and exciting new place in the neighborhood!\n\nThis place opened 2 months ago and they are doing great! I came here on a Sunday afternoon. The spot was pretty full and they are so popular that they ran out of some ingredients (dutch crunch bread and french bread) but the whole wheat bread I got was still good! \n\nI chose the \"droolin'\" sandwich, $8, which had some of the best pastrami I've had (made rare and chewy!), salami, veggies, and their house aioli sauce. It was a great sammy. Great big size, tasty, and oh that pastrami. It was a very refreshing sandwich. I love that the sandwiches come with free chips on the side. \n\nThey have a nice selection of other sandwiches and also a make your own sandwich. All sandwiches are about $7-9. The quality is up to par! Their fries look really good too. I will have to come back to try them.\n\nAs a lot of new places are, the service was wonderful. The workers were very friendly and warm. You can really tell they want their new business to thrive. I appreciated their eagerness to display high customer service. \n\nWill come back for more sandwich goodness. Just beware that they run out of things fairly quickly so come early!", "author": "Junel S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-14", "description": "Me and my bestie were visiting a friend in the area and were hungry, after a quick visit on Yelp we decided to make the quick walk here. We both ordered the Sweet Mouth Waterin and an order of Cheesy Tots. Tots were okay, but the Sandwiches are delicious! They're big enough we could have gotten one and shared. Instead they were nice enough to wrap our leftovers. And those leftovers were delicious the next day, which in my experience is uncommon. When were in town, definitely hitting this spot up again.", "author": "Jaclyn M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-10", "description": "My first time at Grubbin was a great experience, tried the Grubbin sandwich and was very impressed. I usually get my sandwiches at Gene's but after trying Grubbin,  consider me converted. Perfectly toasted, excellent portion size and well proportioned, which is what makes or breaks a sandwich. If you think sandwiches is all they do, think again! They have an assortment of side dishes and I can confidently vouch for their tator-tots and garlic fries.  Both were very crispy, very hot and very delicious. A one, two, three punch of starchy goodness. \n\nThe staff were all really nice and they even walked the order out to my friend, which was a nice change from your typical, \"yelling your order number from behind the counter\" service . This was especially remarkable considering how busy they were. Our order was prepared quickly and with a smile.", "author": "Christopher T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-09", "description": "Saw the place and came here around 3 right before the near by high school got out.\n\nEmpty. Workers greeted us with a smile.\n3 of us together ordered the Grubbin, Fishin, and Grub fries.\nEach sandwich is about $8-9 and the grub fries was $5 which is kinda pricey.\nFriendly staff brought the food to our table.\nI took a bite and had to take another one just to double check. \nI think I died .-.\nTwassss soo good!\nThe price was justified.\nWe weren't able to finish and asked for a box to go then they offered to wrap it for us..  it was like a gift with the wrapping paper, tape, and an extra brown bag to carry it in. \n\nDefinitely will come back and with more friends! :D", "author": "Mary-Angeline L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-11", "description": "This place is delicious! I'm picky on sandwiches, but this lived up to my expectations of Ike's, if not even better! Great customer service and worth the $8 or so. Quality sandwiches forsure!", "author": "Jessica U."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-05", "description": "really yummy sandwiches! I usually get pastrami and they make it just right", "author": "Jessica W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-09-07", "description": "This place has really good sandwiches. They're known for their sandwiches having fish sticks and chicken tenders inside which are quite tasty especially with their special sauce. The only drawback to this place is that they are really slow at making sandwiches.  I feel like they need to be more efficient. I've eaten a lot of sandwich places and most of them are very quick such as Lou's Cafe and Submarine Center.   Other than that it's a good sandwich place.", "author": "Michael T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-18", "description": "I got the Grubbin sandwich and it was a very tastey sandwich. Service was awesome and i will be back to try another one. And they got tater tots!", "author": "Russell B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-28", "description": "Great sandwich joint and awesome staff! They stayed open late just to fill my oh so hungry belly!!!", "author": "James W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-08", "description": "First time here on Sunday and I can already tell I'll be back.\n \nThey made a delicious sandwich. We made our own which was turkey on a dutch crunch with all of the fixins and their grub sauce. Which was BOMB. \n\nInhaled it as soon as I got back to my car. \n\nWe also ordered the grub fries which are garlic garlic garlic fries, I think I can still taste some garlic on my breath. Delicious.\n\nI will say that it may be best to order and eat elsewhere since this place has limited seating and can get quite hot. They had a fan in the doorway.\n\nBut definitely worth checking out for a delicious sandwich.\n\nCheck in on yelp and get a free bag of chips!", "author": "Karma B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-20", "description": "Stopped in at Grubbin and got the Crunchin' on dutch crunch bread. The vegetables were fresh and the sauces were a perfect touch to the sandwich. One star shy of a perfect 5 because the tater totes were over cooked. Still a great spot for a tasty sandwich.", "author": "Iyohna P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-23", "description": "Fantastic sandwiches, great staff. These are special sandwiches unlike anywhere else. Plus good selection of drinks. And decent prices!", "author": "Carolyn S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-17", "description": "Good service! Friendly workers! The food was good, nothing too exciting from this sandwich shop. The cheesy tater tots with sour cream and bacon were good! Went on a humid day, they only had fans. The place was near a high school, so you'll see students by around 3:00pm. Parking on the streets.", "author": "Ariane P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-09-13", "description": "I used to come here pretty often during lunch while I'm at school, but I chose to stop going after they served my raw chicken tenders on several occasions. They're just trying to get the food out the door, they don't really care about the quality that much. Very inconsistent experiences.", "author": "Justin D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-06", "description": "So delicious! We ate here one week ago and I'm still thinking about the sandwiches from this place. I like it way more than Ikes and Submarine Center. It's different from Little Lucca's because both places have their own distinct signature sauces. \n\nWe had the Grubbin and the Droolin (which I added some peppers). The Droolin was spicy but not so much that it overwhelmed the other flavors. The sandwich was rather big (so the price of $9 ain't too high) and I only ate 3/4 of it. I finished the rest of the sandwich later that night and it was still so good. \n\nHighlights of the sandwiches: \n1. Signature sauces (the different types of aioli and grubbin sauce)\n2. Moist and tender pastrami \n3. Dutch Crunch bread\n4. The perfect amount of meat to veggies to sauce ratio in my sandwich\n\nI'm definitely coming back.", "author": "Kar Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-21", "description": "Although I left a little disappointed (I asked for a sandwich to go with everything and pepproncinis, but only realized they forgot the pepperoncini's when I arrived home), I was still very satisfied with my sandwich. I ordered a Mouth Watherin' on dutch crunch and it was really tasty. The chicken tenders weren't dry and still maintained a nice breaded texture despite being sauced up in the middle of a sandwich. The veggies tasted fresh and the grubbin' sauce added some nice creamy garlic flavor to the mix. The only critique I had was that it was a little heavy and one note in flavor, but had they added my pepperoncinis I think that would've solved the issue.\n\nI also ordered some Tots which came out great. I asked for a small order, but when I got home and opened the container, it was enough to feed 2 peeps. Also, even being transported to go (which took only a few minutes to my place) they held up really well and were still quite crispy and weren't as greasy as tots you'll find from other restaurants. The cheesy version will be on my list for my next visit.\n\nIt was also pretty cool, that I got a canned soda for free with my sandwich purchase!\n\nI'm definitely looking forward to trying again. Hopefully next time, they remember my pepperoncinis!", "author": "Jeffrey J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-01", "description": "I finally decided to try this place this morning after getting coffee at Trolley Cafe. It's a nice little spot with some seating and a wall mounted tv, pretty straight forward. \n\nI ordered the 'Juicin' sandwich which was turkey, avocado, sprouts, etc on sourdough. I was skeptical about trying this place before because I felt the price was a little high for a sandwich (about $9), but I have to say it was well worth every dollar, and the sandwich was so big I could only eat half and saved the rest for later haha. An even amount of everything in it and the bread toasted just right. \n\nWith that type of first experience, and a polite and friendly staff, I will most definitely be back!", "author": "Nate C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-28", "description": "My new favorite place for sandwiches! My husband had the grubbin' and I had the juicin' on Dutch crunch. The sandwiches are a good generous size and the sauce they use is pretty tasty. The tater tots with bacon and cheese was delicious! The staff is very friendly. Definitely going back!", "author": "GINGER Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-07", "description": "A nice touch to the neighborhood! Sandwiches are on point! They have a nice selection of sandwiches as well. I'm writing this review as I am eating my grubbin' sandwich ;) prices are reasonable. Quality is great. But small selection of chips which is fine since they're pretty new. Convenient!", "author": "Richie K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-09-27", "description": "On the line for this one. Sandwich was pretty good. Bread was good quality although the same you get at sandwich places everywhere--they clearly aren't making it themselves or anything. Ingredients were fresh, flavor varieties were clever. Sides were solid. Unfortunately of the four people there, only one of them actually made sandwiches, while the others sat around and talked, which made for really slow service. Getting their service issues together would quickly up my review so I'll try again and see if it was an off day.", "author": "Daniel E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-27", "description": "Pretty darn good!  I'm definitely coming back here. \n\nI went by there tonight, and while they are still putting on the final touches for the lighting and dining area, I was able to order up one of their \"juicin' sandwiches. Translation: juicin = turkey, avocado, bacon & fresh onions with their pesto aioli on a roll of your choice.   Given my previous experiences with rather mediocre sandwich places on this side of town, my expectations were somewhat low going in..  But the sandwich here was clearly several levels above any typical chain sandwich shop, and better than any usual mom & pop type of place.\n\nFresh ingredients. No skimping on the meat, shredded lettuce, Toasted Dutch crunch bread, and a complimentary soft drink or free bottled water too. $8.60 out the door for a 9\" long big TASTY sandwich. \n\nFriendly service too!\n\nYep.. I'll be back for the tater tots next time!!", "author": "Harry W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-08", "description": "Came here for a pre-hike meal and I ordered a Spicy Mouth Waterin on wheat. It was delicious because the spicy aioli went really well with the chicken tenders. I would definitely come back", "author": "Wilfred S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-19", "description": "A great option for lunch in parkside. Sandwiches are $7-9, which is the norm for specialty sandos these days. Regular fries $3, and very tasty! \n\nI had the grubbin' on Dutch with a small fries. The bread, which can make or break a good sandwich, was perfect. And, everything was in good proportion. I read another review claiming a shortage of meat, and while it's not piled high, you won't be left hungry. The fries are standard shoe strings crispy and salty. Perfect for my taste.  \n\nIn the end I was very satisfied, and will be back to try out the other options.", "author": "Seth D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-11", "description": "I wanted to go a few times before writing a review just in case the first couple experiences were a fluke. No fluke here. It's consistently awesome. I have tried all the sandwiches accept the eggplant. Where to start. \n\nTurkey ham bacon avacado sprouts etc etc. the things you expect in a sandwich. Wait... they have corn beef too.  In a   Dutch crunch sourdough or  whole wheat roll. This is important but anyone who knows of Ike's or little Lucas knows the sauce can make or break the sandwich. Grubbin sauce?! Good name. Its garlicky. Risky. Too garlicky and some won't like it. Not garlicky enough and people won't notice it's in the sandwich. The sauce you can tell has gone through some great taste tests because its perfect. Not too garlicky. Just the right amount. \n\nThe service is great and during their grand opening special a free soda. Ok so do we get our Money's worth. Lets just say I went a couple days ago. Someone came in and ordered a sandwich to go, the sandwich was dropped into the bag by the customer. Sandwich all wrapped up of course went through the bag. Maybe the only thing I could suggest to improve the grubbin experience is thicker to go bags. Haha. Definitely a must try place.", "author": "eric t."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-09", "description": "Delicious sandwiches! I like the Sweet Mouth Waterin'.. its the prefect blend of taste and the chicken tender is delicious. We've also had the Crunchin' (veggie lovers) and it was also great. About $10 bucks a sandwich but definitely worth the price and size. I usually split one with my friend.\n\nI'm a regular now! =)", "author": "Dee L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-10", "description": "Delicious sandwiches. The service was about average speed, but the taste was awesome. I had the Kickin'.  If you like spicey, give it a shot.", "author": "Patrick W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-18", "description": "This place predates Lou's cafe one block down and it has a great selection of sandwiches with equally awesome names. If you can't decide, get the namesake grubbin' sandwich and you won't be disappointed. Plus it's not overly expensive like certain sandwich shops are getting so it's good for your wallet and belly!", "author": "Wilson T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-12", "description": "Just moved to SF and it's definitely my favorite sandwich spot in the city. The Spicy Mouthwaterin js bomb.com!", "author": "David D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-17", "description": "These are high quality sandwiches! You will not be disappointed. They do it up right. The Dutch crunch bread is an added bonus. Also a bonus: super friendly staff.\n\nThe place isn't large so seating might be tight. Don't let that stop you. Go to the park next door and have a picnic!", "author": "Dusty F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-11", "description": "Open for 2 years man, wish I knew earlier. One word to some up this place \"Grubbin\". Name suits the place well. Check it out!", "author": "G T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-08", "description": "I absolutely LOVE grubbin ! I found this place through yelp and gave it a try with my boyfriend about an year ago when they just started and been going ever since. It's a shame I'm only now putting up a review on this place. I've tried their sweet mouth waterin', spicy mouth waterin', juicin', and this other one with pineapples in it and they are all amazing ! although i have to say juicin' is my favorite. people say Ike's is the best sandwich in town, but i say Grubbin is !! There's been a couple times when the wait was long, but i always got a super fresh sandwich to make up for it. If you have a issue with waiting, you can call them ahead to place an order. if you're reading this yelpers, go get a sandwich here ! (:", "author": "Hae Rim H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-20", "description": "Finally tried (well the Mister did) after my coworker had told me about this place for a while. This sammie place is run by a cute little Chinese family. He ordered the Juicin and it was delish. The ingredients were fresh and the Mister is picky. I can't believe we didn't try this place sooner!", "author": "C. T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-12-29", "description": "Soooooooo slow!!! If you have nothing better to do than wait for a sandwich come here!!", "author": "Jason W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-18", "description": "Just ate the Spicy Mouth Waterin' and it was delicious. Everything about the sandwich I enjoyed. If you are looking for a Buffalo Chicken Sandwich, it's not, but it's just as good. It's a great little spot in the Sunset. The service was fast and friendly, the prices are cheap, and the sandwiches are awesome. It's definitely comparable to Ike's but with way better prices and not a fraction of the wait. If you want a quick bite in the Sunset, check this place out, it's great.", "author": "Sean D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-13", "description": "So happy this little shop opened up in my neighborhood! One sandwich feeds me for lunch and dinner. I crave this sandwich when I am out of town.", "author": "Christina K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-14", "description": "Got the chicken sandwich with honey mustard (forgot the name)and it was delicious. Asked for it on sourdough and it was hot when served. Very quick and friendly service. Generous sandwich size too. Overall great place for a quick lunch.", "author": "Adam H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-31", "description": "Nom! I'm so happy there's a delicious sandwich place in the area now. The sandwiches here are humongous and addictive! The sauces they put in each sandwich just put the sandwiches over the top. I let 4 different people have bites on my very first Grubbin' sandwich, and now they're all in love with it too. \n\nI also like how each sandwiches have so many things in it. It's hard to decide what to get but in the end, anything on the menu is good. I have tried 4 different ones here so far and they're all unique and fulfilling. I personally  like the Grubbin' a lot though, and I usually don't even like sprouts (but I'll eat it in this sandwich)! \n\nStaffs are friendly! Parking is pretty easy around the neighborhood.", "author": "Mandy C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-12", "description": "Came in here with my 2 children (3.5 yrs & 11 months old) after running a couple of errands as a \"treat\" for my eldest.  The woman at the counter was extremely friendly and accommodating.  I got myself the Sweet Mouth Waterin' and a generic ham & cheese for my daughter.  Mine was excellent and my daughter at an entire half of her sandwich!  I wanted something that I could give the baby too - a few slices of deli meat and some avocado.  So the woman just charged me a couple \"extras\" on my sandwich and gave me what I needed for the babe!  Any place that's willing to work with me to help out the kids and not nickel & dime me is worth 5 stars in my book.\n\nAnd I know it's worth 5 stars in my daughter's book too because she was offered a lollipop before we left (after asking my permission, of course).  I'll definitely go back if I'm in the neighborhood again!", "author": "Michele S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-05-23", "description": "Very disappointing sandwich. Quality of meat was horrible. Looked and tasted like packages Oscar Meyer turkey. Hardly any veggies too. The only good part was the Dutch crunch bread. Hate giving negative reviews, but I would not go back.", "author": "Sasha S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-29", "description": "This place has super yummy sandwiches! Many different types of good breads & spreads to choose from and the staff is friendly and efficient. I will absolutely be back and would recommend to friends.", "author": "Karen M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-23", "description": "I have been here twice now as I just moved to the area and wanted to see what was in my neighborhood. \nLooked this place up and gave it a try. \n\nVery friendly staff, reasonably priced sandwiches, and great selection. Tried the \"grubbin\" sandwich first which was delicious, got the \"kickin\" sandwich second which was even better!  Very toasty bread, has the perfect crunch. The sandwiches have just the right mix of flavors, no ingredients over power each other. The sauce is juicy and so good I had to lick it off the paper. \n\nAlso tried the cheesy tots the first time I went which were a little pricey, but out of this world. Nice crispy, golden tots with melted cheese, bacon, and sour cream. I shared them and was only able to eat half of my sandwich I was so full, but the second half was very good left over. \n\n\nI would recommend this place to anyone looking for a good hot sandwich. I'll definitely be back to try the rest of the sandwiches.", "author": "Cole H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-23", "description": "so delicious!!\n\nit was my first time trying this place yesterday. I'm such a sandwich snob too, but it definitely exceeded my expectations! I had the \"droolin\" on wheat (no cheese). The wheat bread was surprisingly delightful. I normally would choose Dutch crunch (who wouldn't?!), but they were sold out of every other bread--again, another reflection of sandwich success. Anyways, back to the wheat--it was mildly sweet and flavorful. Not too much bread either (you know, when it overpowers the rest of the ingredients). The sauce was key! Typically, my favorite pastrami sandwich is from Subcenter--but the one downside is that, that sandwich is too \"drippy\" and messy. But this one isn't, it's a very \"neat\" sandwich, if that makes sense. Very filling as well, I was able to save the other half for a late night snack. \n\nOh, and I had some tater tots too--such a great idea! Reminds me of my middle school days. \n\nCan't wait to try the other sandwiches. Plus, it's a bonus that it's open on Sundays!", "author": "Julie N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-30", "description": "I'm a sandwich addict, and would have to say that this one of my go to spot for a mouth watering sammie fix! \n\nThey have list of specialty sandwiches, with wide variety combos. I usually do a customized order, depending on what I'm craving for that day. Their \"grub sauce' is delicious! Oh, and they also have a bunch of sides such as, tatter tots, fries, wings etc... \n\nSandwiches under $10\n\nFast and friendly service\n\nNot skimp on meat :)", "author": "Lils C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-26", "description": "So delicious!! The dutch crunch bread is the best-- soft with crunch on top and so fresh. The roast beef is fantastic too!", "author": "Alisha O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-19", "description": "I had the Crunchin' which is the cucumber vegetarian sandwich. The sandwich was great, especially the bread (I got Dutch crunch) and the magic sauce (aioli I believe). Quick build time, nice quiet location (we went in the middle of the afternoon, can't speak for lunch hours). Will definitely go back here, the best sandwiches I've had in the Sunset, hands down.", "author": "jon o."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-08-20", "description": "Went here for a late lunch around 2:00pm and the place was empty, so no wait which was great.  Ordered the Kickin' with everything on it.  This is roast beef with wasabi aioli.  It's a solid sandwich, but nothing special.  I expected more for a $9 sandwich.  Since I was the only customer, my order was done quickly.  Overall, love the name, decent food, but not good enough to bring me back.", "author": "Kevin Y."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-03-29", "description": "So I am going to hope that I came on an off day...they were out of bread by 1:45, only had enough left for two sandwiches and I needed three. Decided to go for it anyways and just share. 25 minutes later I am still standing here with no food. Slowest sandwich shop I've ever been to. There are 4 people working here, no other customers after me since no bread, and yet they can't seem to make two turkey sandwiches in less than a half hour. I'm sorry, but that's just not ok. Hope the food is at least decent...will change my review if the sandwiches are stellar, but either way am not likely to return.", "author": "Melissa F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-06", "description": "I came to Grubbin' with a friend last night, and the service was excellent. We entered the Sandwich Shop only 10 minutes before closing, and were greeted by the nicest guy who gave clear suggestions and options for first timers. My friend got a Sandwich (which was very tasty) and we both got garlic fries (even tastier). \n\nCustomer Service: 5/5\nFood: 4.5/5\nOverall Experience: 5/5\n\nI will definitely go back.", "author": "Daniel H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-08", "description": "Awesome sandwich place in the Sunset. I always get the Droolin...good amount of meat...the soft roll is perfectly toasted to my liking. A good sandwich must consist of good bread.", "author": "Phi N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-15", "description": "First time here, small cozy place to grab a sandwich and go. Staff is friendly and nice. Nice and clean environment. Wait time if you are with a group of people will be about 20 minutes if you aren't eating there. Sandwich is better than Mr. Pickles and less expensive as well.", "author": "Camille W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-23", "description": "Great sandwich spot in the Sunset...fresh fast and inexpensive.\nNot sure why dude complained about A/C...this is the city!", "author": "Craig G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-16", "description": "Grubbin is a cute sammie spot in my hood. Love the fact they have cute names for their sandwiches with a variety of toppings (peppercionis, jalapenos, etc no extra charge woot!) They carry my ultimate fave of bread - dutch crunch - AND they toast your sandwich!!  They have 3 tables inside with some additional stool window seating too. We usually can always grab a seat and watch the game or whatever they have on while we grubbin! Only downside is sometimes the sandwiches do take awhile but last time they gave us a heads up on the wait when we ordered so that was much appreciated. Maybe one day they will do a sandwich punch card you know, like the kind where you buy 10 get one free. Hehe...thats obvs for my selfish reasons only since we go so much!", "author": "Julie F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-13", "description": "I am so in love with the Juicin' sandwich here. And I don't even like turkey sandwiches!! It's nice to finally have a bomb ass sandwich place by my house. I've tried a few things from here:\n\nJuicin' - turkey, bacon, avocado. OMG the best turkey sandwich I have ever had. Normally I hate getting turkey sandwiches cause they're just so..basic..like ham and you could make it yourself. But this place is the ONLY place I would ever pay for a turkey sandwich. Insanely delicious, super flavorful. I can't even describe. Perfect sandwich. \n\nDroolin - pastrami and salami. I was excited about this one but it's not as good as it sounds. Somehow there's just a weird flavor and it doesn't work well. (Other places do the same but it works) wouldn't get this sandwich again. \n\nCheesy tater tots - with ranch and bacon. Pretty good but it can be a little salty when you get the bacon. \n\nGarlic fries - pretty expensive for very little. Just the basic garlic fries... I wouldn't recommend it cause it doesn't come with much. \n\nOverall, just get the Juicin on Dutch crunch and you won't regret it. As much as I love this place.. I hope it doesn't get TOO popular cause I don't want to have to wait in line....", "author": "Grace S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-12", "description": "Delicious! If you're craving a fatty sandwich I would highly recommend stopping by. One of my fave sandwich joints is Ike's and this is on par. Husband and I tried the Grubbin' It and Spicy Mouth Waterin' both on dutch crunch bread. The chicken tenders in the Spicy Mouth Waterin' sammie are nicely fried and the sauce is not really spicy. Make sure to take advantage of the Yelp check in for a free bag of chips. There is also inside seating and they have TVs usually playing sports. Parking is not terrible, given its Outer Sunset - but the L can dump you off nearby if need be. Enjoy!", "author": "Lisa H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-06", "description": "Came here recently and tried a sandwich. I enjoyed it and thought it was delicious. The sandwich reminded me of other sandwich places I like in the city such as Roxie's. \n\n  Price is okay, thought sandwiches would've been around $7-8 for a sandwich, but it came out to $9 something because you get a \"free\" soda or chips with it for their promotion grand opening. I rather pay $7-8 and not take the soda or chips. Yelp has this place at $, true if you order a sandwich alone, but anything on top of a sandwich more is $$.\n\n  I read reviews of previous yelpers saying the staff is friendly, but when I went in one day, only the cashier was friendly out of the 3-4 people there. And my definition of friendly is either a simple smile or greeting. No one else smiled and seemed like they were happy to be there except for the cashier.\n\n  But, regardless of the negative, I am a fan and of this joint and will most likely come back.", "author": "Pudgy G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-08-19", "description": "Lovely little sandwich place with a limited but well-thought-out menu. I stopped by for a lunchtime sandwich and ordered the crunch, one of two veggie sandwiches. The sandwich itself was brilliant - absolutely delicious - but I did have to wait almost thirty minutes for it. A very, very long time for a sandwich, especially because there was no line when I ordered and it wasn't exactly packed in the restaurant. It was worth it, but I don't know that I will be able to come back on lunch break again if it takes that long. Pity because damn, that sandwich was good.", "author": "Kate M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-30", "description": "Ummmm holy sh** this place is dank! Don't even think twice about it. I wish they were down in LA!", "author": "Dan R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-08", "description": "Found this Gem on yelp while doing a family hike at lands end trail to get some lunch all i can say is omg bomb.com sandwiches were so good all my family enjoyed all our sandwiches definitely coming back again soon yummy.", "author": "Omar Q."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-18", "description": "My friend picked up a sammy for me and it was good. It's pretty big for the price and I love the garlic fries. They are skinny, crispy, and just the right amount of garlic.", "author": "Karen H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-07", "description": "Ever since grubbin opened I have not sought out any other sandwich. I came in here, not much of a sandwich person. I am always eating the same roast beef sandwich wherever I go but I dared take a chance on one of their signature sandwiches called \"Grubbin' it\" ugh.... Best decision ever. The meats are perfection and the sauce is amazing. You're going to get a juicy flavorful sandwich to make you realize how seriously good sandwiches are SUPPOSED to me. The sandwich is big! I ate that bad boy as two meals! If you're a g you can eat the whole thing but you might knock out! They also have many sides to order but I stuck with classy chips that came free from checking in on yelp (free is awesome). I recommend this shop to all my friends. If you're unsure of some of the sauces ask for a sample, they're all delicious and they will gladly let you try one so you're sure you want it on your food!", "author": "Paula P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-19", "description": "Been here a few times now, this place is awesome. Great quality sandwiches at a very, very affordable price. Every time I come in here I always try something new and it never disappoints. The people who work there are very friendly too. If you're in the area and want a quick bite to eat or are craving a nice, yummy sandwich I highly recommend this place. One of the hidden gems on Taraval and in the Sunset district.", "author": "Henry Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-02", "description": "My partner and I were in the Sunset and wanted something close to Crafttea and found this place with awesome reviews on yelp so we had to check it out.  He ended up getting the Juicin and I got the Fishin.  The sandwich itself was pretty good, the fish comes out as a patty and is crispy and hot.  My counterpart also said the juicin was good (although it's hard to mess up a turkey sandwich)  The prices are a little bit up there around $8-9 a sandwich, but they're pretty big and definitely able to save the other half for another time.  Will be back to try out more!", "author": "Roger W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-26", "description": "The sandwiches here are to die for. They are the best sandwiches ever, and I have had many. I am also a really picky eater, so when I say its good you better believe it. The tastin sandwich is my favorite, and their garlic fries rule too. This is one of those places that I would drive hours for, but luckily it's an 8 minute drive from my house.", "author": "Emily G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-10", "description": "I'm not a huge sandwich person, but I am when I come here! I love the sandwiches here. My favorite is the Grubbin It on a dutch crunch roll. Also, they turned me into a lover of sprouts on my sandwich.", "author": "Tiffany G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-20", "description": "Yummy yummy sandwiches. Toasty bread. Garlic fries were awesome. Bread was nice and toasty!", "author": "Rebecca H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-01", "description": "I consider myself a sandwich snob. This place is awesome. The ingredients are all fresh and the toasted bread is so good. The grubbin sauce adds a perfect flavor to the sandwich.", "author": "Darius A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-11", "description": "Bomb sandos! Before i went here for the first time someone said that Grubbin was an Ikes rip off. Well since i love Ikes i was only encouraged to give Grubbin a try and I'm glad i did! And while there may be some similarities with Ikes  (bread selection, different sauces, creative combinations, etc.) what i loved that was different was the ease of selection (refined menu vs the 100 different sandwiches at Ikes) and very little wait time. I've tried three or four different sandwiches now, all were delicious but my current favorite is the ham and pineapple! Menu prices are reasonable for the city and the sandwiches are a decent size, sometimes making for two meals depending on my appetite. The restaurant interior is plain with a few tables,  prob better for take out. Recommended for any food/sandwich enthusiasts!", "author": "Dylan B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-09", "description": "Amazing little hole in the wall that produces incredibly fresh, delicious sandwiches. We ordered the Juicin' sandwich with tater tots and will be going back for more.", "author": "Pablo G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-21", "description": "Got the Kickin' with everything and a small tots.  The tots were nice and crispy, the Kickin on dutch crunch was delicious.", "author": "T. E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-05", "description": "Glad I found this sandwich shop!!  I've been here about 10 times now and each time has been great.  Get the sando on a Dutch crunch roll.  You won't be disappointed with any selection.", "author": "Joe D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-25", "description": "This place is probably one of the best sandwich shops in the Sunset. I've become somewhat of a regular and love, love, love the Fishin'. Is fried fish, veggies and their signature grubbin sauce and its delectable! Until I get food poisoned (for some reason its fish that tends to do that to people) I'll keep coming!", "author": "Tiarra E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-11", "description": "THIS PLACE IS AWESOME!!! I ordered the Savorin' ($8+tax=$8.80), and it was sooo delicious. I was very pleasantly surprised.  \nDon't let the pictures fool you--this sandwich is anything but ordinary! However, the sandwiches aren't too big...I'm not exactly sure how long they are, but I would guess maybe a bit longer than 6 inches. Doesn't really matter to me though. The sandwich packs a punch! I checked in so I also got a free small bag of chips which was nice. \n\nThe workers are nice. When I went at about 2:50pm on Wednesday, there was no line. My sandwich was nice and warm and ready to be picked up about 5 minutes later. \n\nCompared to Little Lucca in SSF and Ikes in the Mission district of SF, I would say this sandwich is almost as good--which is really really good. \n\nI will definitely be returning to Grubbin' to try their other sandwiches.", "author": "K T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-27", "description": "Get the sweet mouthwatering chicken sandwich on dutchcrunch wit everythang on it. Shits fuckin delicious!", "author": "Kevin C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-01-31", "description": "Bf went to go pick up some sandwiches. I tried the droolin on Dutch crunch which was good but had too much mayo for my taste. I took a bite from my Bfs spicy mouth waterin sandwich and it tasted better than I thought it would. I expected them to use dry, ballpark food stand tasting chicken tenders but the chicken was super crispy and juicy! It kinda reminded me of a spicy McChicken but on Dutch crunch bread. We also got some cheesy tots which are your standard tator tots with cheese, sour cream, and bacon bits. Overall good sandwich shop in the neighbor but not something I would find myself craving for.", "author": "Michelle H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-06", "description": "Mmmmmm sandwich was delicious. Droolin' is what I ordered for 8$-9$ or something. Very tasteful and a kick behind it. Used Dutch bread as this sandwich is served hot. Beautiful customer service and a wonderful experience. Will return if I am in the area.", "author": "Lee J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-08", "description": "The Dutch Crunch was delightful. It absolutely made my day. Mmmm... This place is a must destination.", "author": "Bonnie L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-06", "description": "Great sandwiches, helpful and friendly staff. Haven't gone wrong yet.  They were very, very, slow to begin with, but the speed has picked up.  Come here with an appetite, or have lunch for two days.", "author": "Jonathan W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-31", "description": "Tasty! Great little neighborhood spot with creative sandwiches and a very friendly staff.", "author": "Candid K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-24", "description": "Can be a little slow when busy but they're sandos are excellent.  Best Dutch Crunch bread I've had.", "author": "Erik L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-04", "description": "first time trying the dutch style bread.\n\nLUVED IT!!!", "author": "C C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-11", "description": "Don't Get Run over by the MUNI when crossing the street! joke a side this place is a must try very quaint place with a pop of flavor . I enjoyed the sprouts in my Grubbin it sandwitch along with there saws the flavors all blended very well together if your in the area and your hungry give them a try.", "author": "Elizabeth B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-11", "description": "So glad that we have a new sandwich shop I'm the neighborhood. Great food, large portions, great price! It's clean and they are helpful and friendly. We need to support this new business and make sure that their business thrives!", "author": "Kimberly R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-28", "description": "I'm so glad I live across the street. The sandwiches are great (so far I've tried the Juicin', the Spicy Mouth Waterin', and the Crunchin'), and the staff are always SUPER friendly. A sandwich here is usually $7-$9, but they're pretty large and SO GOOD. You also get to choose your bread (I always get Dutch crunch) and you have the option to customize sandwiches too.", "author": "Lauren F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-18", "description": "This place is highly rated for a reason! The sandwiches are spectacular! I loved the Juicin', it really hit the spot and then some! I came in expecting a typical deli sandwich, and I got a hot, melty, delicious, HUGE sandwich fit for a king. As a couple, we each got a sandwich and split an order of Garlic Fries (also very tasty), and neither of us could touch the second half of our sandwiches, we were so full. They wrapped it up for us, and it even tasted good as leftovers. My boyfriend is a vegetarian, and we were also delightfully surprised that there were a couple vegetarian signature sandwiches, as well as the option to create your own. Either way, 10/10 will chow down again.", "author": "Brittany S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-12-19", "description": "The sandwiches looked so delicious in the pictures, but the Grub Sauce leaves an odd, relish-y taste that I wasn't feeling. I got the Juicin' with turkey, avocado and cheese on a French roll. The roll was delicious. I'd get the same sandwich but without their specialty sauce.", "author": "Sam D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-08", "description": "This place is worth stopping by for. The outside looks pretty chic, inside has a tv to watch entertainment. Their sandwiches are really good and pretty big. I ordered it with another friend + garlic fries, great combo. I got the Kickin' sandwich which had some wasabi and if you cant hand wasabi, most def should not get this sandwich. But for me, since i like it, the sandwich was really good but the wasabi did overwhelm the meat/cheese/lettuce/tomato a bit in the middle. Overall, great experience here.", "author": "Jamie U."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-05", "description": "Jus discovered this place about a month ago and this place rocks, simple but amazing.", "author": "Johnny B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-25", "description": "I always come here for the chicken tenders and fries :3 they're very good, and not too salty nor bland and they come out at a pretty decent pace too~ Maybe i'll come here to try the sandwiches some other time since they're what the place is mainly known for!", "author": "Tina W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-21", "description": "a solid 4 stars.\n\ngood sandwich, solid sandwich, but nothing to rave about. I would prefer this over gene's...and I don't see how they would compare to ike's...\n\ntheir aioli and grub sauce could use a little extra pop, but not complaining! \n\nwe tried the juicin' and droolin', I liked the sprouts in the juicin'! tasted healthy. haha\n\ngarlic fries were garlicky and good too. we'll be back!", "author": "Christine M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-19", "description": "So went by here yesterday to try this place out. Had a \"Drooln'\" sandwich...pastrami/salami/pepper jack cheese/spicy aioli/grub sauce/dutch crunch bread/$8/chips..This was quite the big surprise....this place is AWESOME !....you'd better check this sandwich shop out NOW! i will be going here often for myself and family...the food is great...don't know whats in the grub sauce....but its fantastic ! go there now....nice to see something different in the hood for a change...", "author": "David R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-24", "description": "This is a great sandwich. Better than Little Lucca in SSF. The sauce has great flavor and it is not runny like other places. Meat and bread are superb.", "author": "Frank L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-04", "description": "Good eats. Glad I found this place. The smothered tots and the lickin' are where it's at.", "author": "Dave N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-28", "description": "The best sandwiches i have ever had in Bay Area  i tried droolin sandwiches that was great .", "author": "Shadi Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-25", "description": "5 stars. Super nice to me and the sandwiches rival Ike's! Recommend the sweet chicken one. Happy to have in my neighborhood!", "author": "Domenique B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-30", "description": "Delicious buffalo wings and sandwiches. The dutch bread is really good too! Very reasonably priced!", "author": "Athena K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-30", "description": "Stopped by here for the first time today and got the \"Juicin'\" sandwich I think it was called. It was very good and the people working there seemed nice. The sandwich tasted very fresh and was pretty frickin big. They have good Dutch crunch bread, which is key for me.  Plus, their sandwiches come with a soda of your choice, which is some nice added value. I will be back for sure.", "author": "Brett P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-16", "description": "I wanted to try and sub place within walking distance and noticed this place. I went in for the first time today and tried the Droolin'. It was delicious. Plenty of meat, the veggies were good and I liked the sauces. There was only one person in front of me, and it seemed like it took a while to make it, but it was worth it. I'll definitely be back to try more of the menu.", "author": "Matt H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-28", "description": "Great Sandwhich spot for the sunset/parkside area. The sandwich was awesome, i had the Drooli and the buffalo wings were crackin.", "author": "Ray G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-07", "description": "Very solid dutch-crunch based sammie. Proper ratio of fillings, and seasoned correctly. The best meat between bread west of 19th avenue? Perhaps.", "author": "Anthony R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-31", "description": "Quickly becoming one of my favorite sandwich spots, the Grub sauce is truly to die for. Service is always fast and friendly, and I have yet to be disappointed. A place to come back to over and over again, I would highly recommend to anyone. :)", "author": "Anna G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-10-02", "description": "This place was just okay, we tried it because we live in the sunset so it was convenient.  I had the Juicin' on Dutch Crunch, it was nothing special. My boyfriend and I try A LOT of sandwich spots along the bay area and I wouldn't come back here. The turkey seems very processed, like a safeway package and the dutch crunch was very bland. Not a bad sandwich, but Little Luccas is way better for the same price and double the size.", "author": "Jackie S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-01-24", "description": "The food itself was amazing, ordered a build-your-own sandwich and it, along with with fries, was great. \nThe cashier was friendly too, really nice and offered to wrap the remaining half of my sandwich (they're HUGE).\nMy concern is with the girl behind the counter making sandwiches. I overheard her coworkers asking her repeatedly to go wash her hands and her response was, \"No, I'm wearing gloves!\"\nKept eavesdropping and learned that she had cut her hand and it was bleeding. Ew? Seriously girl, go wash your hands. She refused for a good 5 minutes, then her coworkers told her to get a bandaid on. Again, \"I'm wearing gloves! It's ok!\" Let me add that this girl was making MY sandwich. \nI finally get my sandwich and made sure it was blood free but wasn't really hungry after hearing all that. If you work in food service, it really concerns me that you have to be forced to wash your hands and prefer having a bloody glove than wearing a bandaid:(\nI'd come back, but now I know who shouldn't make my sandwich.", "author": "Adriana L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-19", "description": "This place is good every time. I've only ever gotten taken out from here and all the sandwiches have been good. The only reason I'm giving 4 stars instead of 5 is one time I got the mouth watering and it didn't have any tomatoes in it and the staff didn't let me know. Otherwise awesome, and our go to sandwich place.", "author": "Ella M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-26", "description": "Best sandwich I've had in a long time! Staff is okay but I'm not paying for customer service.. Our food came out quick and hot and so good.. Place is very tiny inside, not to busy but we went on a Monday at noon...We were 2 adults with a baby and jogging stroller and fit in just fine but I wouldn't recommend that when this place is super busy.. I will be back", "author": "Crystal V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-25", "description": "Had the juicin' sandwich, pretty good. The bread was toasted perfectly, a good bite of meat and yummy veggies. Id go back", "author": "Tiffany F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-27", "description": "On our way to the airport- they got us in and out in 30 minutes fully satisfied! Had the Dutch crunch bread for the first time in my life and it was amazing!! Meats were lean and tasty. Sandwich combinations were spot on flavorful. My kids had the chicken nuggets which were homemade lean chicken breast. Prices were fine for quality. They lost one star for the bathroom! HC accessible, but stacked with boxes and supplies. I don't know about you, but I don't want to find out my napkins and condiments were stored in the bathroom.  Also blocked the handicap accessibility. Shame!", "author": "John B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-16", "description": "I'm vegeterian and love the eggplant sandwich. The staff is great and the grubbin sauce is to die for. This is a great hidden gem for sandwiches in the city if you are trying to escape long lines at other sandwich spots that shall be unnamed. It's always a treat. When I was working in the city I'd eat here 4 to 5 times a week. Now make the trek just because I love the sandwiches.", "author": "Marc T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-27", "description": "This place is a little hole in the wall but nonetheless amazing! There are 3 young fellas that run the place (I believe). They are super sweet and patient with you. I tried the spicy chicken on a dutch roll and it was AMAZEBALLS! I think my deli experience has forever been ruined because no sandwich will ever taste that good. I will DEF be stopping by anytime I am in the area", "author": "Jennifer F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-18", "description": "HANDS DOWN best american sandwich I've ever had. Deserves all the stars in the world. Sandwich might be pricy, but It's like HUGE. Save it for 2 meals.", "author": "Ken T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-29", "description": "I ordered my Droolin sandwich and it was massive.  It was later that evening so they ran out of whole grain roll, but I will be back to give it a second       I couldn't finish the second half.  Paid just $9 + tax + Free complimentary soda.  The place is small but is the right size type of shop and prime location.  Lincoln High School Student with ID can also get a discount rate.", "author": "S F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-02", "description": "Lou's down the block was closed on Sunday so ended up ordering sandwiches from Grubbin.  We followed the great reviews on Yelp and decided to try them.  Glad we did.  The Crispy Fried Chicken sandwich was delicious.  We also ordered another sandwich which was just as good.  Even got a free chip with the Yelp sign in.  Both sandwiches were on Dutch Crunch.  Even went back a second time to Grubbin and it did not disappoint.  Can't wait to try other sandwiches.", "author": "Em D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-31", "description": "Absolutely amazing for those sandwich lovers!!! Stopped by on the way to San Fran on a wim and definitely worth the stop... Amazing!!! Tried the grubbin' an juicin'", "author": "Jeremy C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-12", "description": "Excellent sandwich!  Very nice people too. Spicy tatter tots - yum!  Highly recommend this place for a sandwich", "author": "Jean G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-16", "description": "This place has great food. The sandwiches are awesome!!  The sauces are incredible! And the portions are big. The neighborhood really needed a place like this! Every sandwich is packed with flavor!! Yum! I also got a sandwich to go once, and I was so busy completely forgot about it!! I had it later that night and it was just as good later as it is when it's fresh!! My new favorite spot!!!", "author": "Serena T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-08", "description": "Called in 4 sandwiches n didn't have to wait. Got in n out in less than 2 minutes. Also checkedin on yelp n got a free bag of chips. Sandwiches were also. I got the grubbin n it was awesome", "author": "Way G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-17", "description": "I had the Juicin, it was delicious. Perfectly prepared. I'd come again and again if I didn't live in Florida.", "author": "Toni F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-03", "description": "Located on Taravel, this is a pretty good sandwich shop.  They have a nice assortment of choices and very cool sandwiches.  They have a student special which isn't bad for $5.  The sandwiches are all served hot and the portions are pretty big.  You definitely get value.  You also can check in for chips!", "author": "Brian C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-30", "description": "My boyfriend and I went here early today and man that was an amazing sandwhich w/ fresh bread and great grub sauce! \n\nI created my own and everything was great! My boyfriend got the \"Juicin\" and he loved it! \n\nVery clean also! Def 5 stars!", "author": "Tamera G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-28", "description": "maaaaan.\n\n*groans in satisfaction* \n\nthis place is just sublime for those people who want just a simply great sandwich. their prices aren't bad at all, their food proportions are amazing and whats more, they CARE about your experience there! The whole time I was at the place,a guy asked everyone how their food was, and was sincere,  that is great restraunteering if you ask me.\n\nI got the mouth waterin', and it was everything it said it would be. Juicy and crispy chicken tenders enveloped in some grubbin' sauce and jalepenos and, and, just perfection. \n\ndefinitely gonna be a regular here.", "author": "Juan Carlos S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-07", "description": "this place makes amazing sandwiches!! judging by the appearance, this place is pretty new; let's give them some business sunset!!!", "author": "John H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-07", "description": "Grubbin sauce makes their sandwiches craveworthy. It's garlicky goodness that combines well with avocado and veggies on the \"crunchin\" sando. I have no idea about the meat ones. Small place with TV and they have Giants games on. Only wish they had a few more veggie options, and carried better chips, like kettle or baked lays, they only have Fritos and Doritos.", "author": "L J."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-08-14", "description": "Ordered the fried chicken sandwich. I only ate half cause it was filled with mayo and made me smell like a deli for like 3 hours. Not returning.", "author": "Anysa S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-01", "description": "Solid sandwich. Unique breads. I got the Dutch crunch, which was really good. The place has a diners, drive-ins and dives feel.", "author": "Josh B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-10", "description": "Seriously delicious sandwiches in the Sunset, doesn't have the lines like other places (Ike's) and is still amazing. Love getting the turkey club with all the fixings. Worth checking out if you're in the area.", "author": "Greg N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-17", "description": "Great place for a fantastic sandwich, reminds me of Ike's or little Luccas with a shorter line. I had a grubbin wasabi spread  sandwich with toasted Dutch crunch. Sandwich had lots of meat and good combination of texture and flavor. They have a friendly staff, and parking is easy.", "author": "drew w."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-06", "description": "Looks like they've been listening to the reviews :) Went back and tried the \"Grubbin'\", and it was really good. They have come a long way since initially opening up. Seeing that, I just had to update my previous review. Thanks for listening!", "author": "J M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-19", "description": "Nice sandwiches with interesting names for them. Garlic fries were decent and was a nice place to stop by at Taraval. Quick lunch sandwich and had television and nice service.", "author": "Jackie H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-17", "description": "Dude amazing sandwiches. Shall I say more? No! Look at the menu and get something you peasant!", "author": "Noah K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-15", "description": "Next time I have that weird hankerin' for a fish-o-filet burger, I'm coming here! Sandwiches are juicy and bread is soft. We had the Fishin' sandwich and the Roast beef with wasabi. The kids had chicken fingers with fries, which were nothing to write home about, but I wasn't expecting much for those items.", "author": "N c."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-06", "description": "Wow! Was looking for a good lunch after a round of golf and stumbled upon this place. Sandwiches are a good size and at a very reasonable price! I'd come back and support this place as it is a small business in SF. The Savorin and Grubbin are both full of meat and good with sauce. The Juicin will be next!", "author": "G Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-03", "description": "Great sandwich spot I'm happy to have discovered. The chicken tender sandwich was bomb. Regular turkey sandwich also delicious. They where gloves making the food which is important. I will continue to be a customer.  Check in on yelp for a free bag of chips!", "author": "Maria D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-22", "description": "I read about Grubbin' on SF Eater and after looking at the menu I knew I had to come in. I had high hopes and I was not disappointed. \n\nI had a Droolin' (Pastrami, Salami, Pepper Jack Cheese, Spicy Aioli, and Grub Sauce ) on sourdough and it was perfect. It was large, had great meat, good veggies, and the spreads were very good. The only bad thing was when I finished it, despite being very full, I still wanted a little more. \n\nI definitely plan on returning soon! One of the better sandwiches I have had!", "author": "Daniel G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-07-27", "description": "This place isn't all that don't know why it gets 4.5 stars. Better places around for $8-9 a sandwich. It just doesn't hit the spot since its nothing special. You can go without eating here since the ingrediants aren't great just very simple sandwich. Seems like processed ingredients since they don't have much flavor. The size of the sandwiches are surprisingly big but I would rather go to Guerra market on 14th & Taraval.", "author": "Len A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-13", "description": "I come here super often and love their crunchin sandwich, I'm a vegetarian and finding a good sandwich that's not just a salad in bread is rare! The servings are so big that I can actually save half for the next day and STILL stuff myself!", "author": "Dana F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-10", "description": "Juicin' was amazing. Good proportions for all ingredients on the sandwich and very fresh ingredients.", "author": "Philip R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-06", "description": "Awsome is exactly what I would say also. Sorry you didn't go WELL I'M NOT I WENT ! OOOH WOW", "author": "Jordan M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-28", "description": "One of the best sandwiches I've tried in SF . Must try they won't disappoint !!! Great quality sandwiches without hurting your pockets like Ike's.", "author": "Kristine O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-10", "description": "We ordered a juicin. Sauce is great. Bread is superb. Place is clean. 5 star for customer service and food quality. Can't wait to come here again for another one.", "author": "Gertty G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-17", "description": "Top notch sandwich. Let me hang out for a couple hours after I was done eating while I waited for a client meeting.", "author": "P. K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-30", "description": "OMG! this place had the best sandwiches hands down! My family went to the SF Zoo this past weekend and randomly googled a sandwich shop so we could sit at the beach afterwards. We ended up in their GRUBBIN shop. I ordered the Cruncher sandwich, garlic fries, and buffalo wings. ALL OF IT WAS DELICIOUS! I never leave reviews, this is my first and well deserved. The dutch crunch bread was perfect, and their pesto mayo and secret grub sauce made the sandwich orgasmic. My other family members were in awe of their sandwiches as well. I might make a trip back to Frisco just to go there again!", "author": "minnie r."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-27", "description": "so glad I no longer have to brown bag it when I take the dogs to the vet around the corner! (I tried the chinese takeout place down the street once. no good.) I got the 'droolin' and what a masterful concoction of bread, meat and sauce it was. it took a wee bit of time to get it, but when it landed in my hands all warm and toasty, it was totally worth the wait. service is really sweet. parking is no problem. just plan on takeout because it's not really a place to sit and linger.", "author": "Sasha R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-02", "description": "I ate here for lunch today and it was fantastic. My girlfriend and I shared the \"Grubin\" on french bread and the \"Juicin\" on dutch crunch bread. I also found the service above average for what you would come to expect from a sandwich shop. If possible you might want to try and wait it til 12:30 on the weekdays, there is a high school around the corner and lots of students go there. It was packed when we passed to park, but as we were walking a swarm of students were heading back from lunch. When we arrived just after 12:30 we had our choice of seating.", "author": "Jeff S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-06", "description": "great sandwich. if you're in the area and craving a sandwich. stop in. I would. but what I wouldn't do is drive across town for it. in a town full of great sandwich shops, this one has made my list. what else can I say about grubbin' except it was grubbin'", "author": "buddy p."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-16", "description": "This place is delicious! Spicy mouth waterin' and Juicin' sandwiches are SO good. Only thing that keeps it from being 5 stars is that the service is sometimes slow- though always friendly! They even stayed open 10 minutes late when I called in an order but couldn't make it there before closing. Highly recommend!", "author": "Daniel L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-06", "description": "hot and tasty.  friendly staff.  clean environment.  grubbin sauce makes turkey so amazing.", "author": "Choladeva C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-24", "description": "Super-friendly staff and great specialty sandwiches. The roast beef with wasabi was delightful. Hoping they will add some décor over time.", "author": "John L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-31", "description": "very good sandwhiches! they r huge and are very tasty!! the only thing i would of changed was to not get the grub spread because it has a little too much garlic for me.. but i will most deff come again!!", "author": "Megan A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-25", "description": "Grubbin is delicious! It reminds me a lot of Ikes and Mr.Pickles. You definitely need to try the spicy mouth watern' with a side of garlic fries. MMMMHHMMM", "author": "Brendan V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-17", "description": "Mind blowing quality sandwiches and and awesome customer service. They really treat you well, and not a horrible price!!", "author": "Kelly F."}
