{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-31", "description": "absolutely quintessential mellow, authentic and cool sf vibe. let's keep on creating while they keep on hating.  loved it, would return (plus velvet and neon)", "author": "Georganne R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-22", "description": "Fun dive bar. Good drinks and service. Would definitely go here again. I also liked that it is a WSU Cougar bar!", "author": "Ed F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-03-06", "description": "There should be a part of me that wishes the old place didn't change, but  I think this has the potential to be a heck of a bar. Beautifully redone they did a great job. It'll be interesting to see how this place goes moving forward with no more \"Old Men\" and clean & modern toilets. It is now a bit of a hipster haven, complete with pretentious douche bags hanging out in there.  and it's weird, because it is definitely an old dive bar, yet they have made modern upgrades that kind of take some of the character and charm out of the dive category.", "author": "Ronald M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-27", "description": "I think the first time I came here was a wake for Charles Bukowski. It has gotten a lot cleaner since those days. Still has charm, though.", "author": "Patrick S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-26", "description": "Definitely a dive bar playing lots of oldies. Their drinks were cheap and strong! They have a pool table if you like to play pool. Lots of places to sit. They also have a water refill station across from the bar. I think every bar should have one of these!!\n\nWe came here with some friends after the warriors game. It's a cool place to start your night or even finish it. Also a good place if you're looking for a chill place to grab some drinks.", "author": "Meghan P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-13", "description": "No more Old Men, 2018. Beautifully redone with clean & modern toilets!\nLove it! Love it! Love it!\nCold BEER.", "author": "Alton C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-05", "description": "Ask for Drew. Best service ever! Neighborhood favorite. Echos the spirit of yesteryear Hank & Ralph, who's gritty tenderloin culture can only be remotely remembered through the artifacts framed on the wall, in the photo booth or cryptic tv playing such favorites as scenes from Dirty Harry and Bullet.", "author": "Michael S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-21", "description": "Ahh the HA-RA.  This bar holds a minor yet mystic mythic part of my history and is dear to my heart.  Many years ago I walked in with a internet date.   Rick behind the bar greeted me and somehow psychically knew my name.  We had never met before but he straight up guessed my full name.   He then quietly & solemnly took me aside when my date used the bathroom to tell me that my date had herpes.  My date was from another state, had only moved to SF days before & was quite squeaky clean vanilla, and there was no way he could have known him, but Rick told me he just knew and wanted to warn me.  Rick was captivating and fun.  I always dug his stories about growing up in the bar, his family's history, SFs history, and the buildings history. The place is just soaking in stories, very vibey. \n\nI would then run into Rick all the time in the TL over the next few years, and we would always have these great momentary transcendental conversations.  The last time I saw him, he was phasing out of bar scene and I figured the place would be sold, and hipped the hell up to some Disneyland idea of what millennials like, so I avoided going back. \n\nUntil this weekend!  I was pleasantly surprised to feel the same charm and history I always felt at this TL hole.  Now there are just some sweet upgrades (nice tvs, beer keg tap tables), a little less crusty & more modern.  I love that the walls are still gushing with history, hate, love, laughing, fucking, fighting, its all still there.  Still the best Tenderloin Bar.", "author": "Chelsey G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-25", "description": "Drew is a 5 star bartender! Always greets you with a smile. Great neighborhood bar. Definitely my go-to.", "author": "Leslie S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-14", "description": "Why 5...?  (Cue the dreamy \"flashback-sequence\" effect used for exposition in the 1980's and 1990's...)\n\nHa-Ra Club was the gritty survivor.  The echos stirred at this little way-past-its-prime lounge on Geary.  I liked going there and experiencing the post-modern impending demise of the last gasp of its era.  The bartender, while not your average guy, was a hell of a gentleman who had a lot of worldly wisdom.  Those who dwained to dwell in \"old\" Ha-Ra's environs were for real.  You knew it wouldn't last.  It effectively closed a while ago.  In my mind, this one was buried and dead.  (Finger.  No pulse.  ... He's dead, Jim.)  \n\n(Flash Forward - Fade into a man walking down Geary on his way to a farmers market.)\n\n10:30am, Temperature:  62.7 Degrees.  Purpose:  I'm on the way to the Fillmore Farmers Mar.... ....  ... (scratch) ... IS HA-RA BACK OPEN?!?! \n\nI wondered in.  And, my jaw dropped.  Dropped.  This place has been redone in a big way.  Then, I was blown away the more I hung out and talked to the folks.  They blew this remodel away.  I cannot believe how good a job they did off maintaining the original character of the bar while enhancing it into a modern setting.  Seeing the \"old bar\" and the \"new bar\" is something.  I loved the nostalgia, but to see a place that is above-average to begin with is quite a juxtaposition.  They opened up the area over the bar and it feels much more spacious.  The bar and behind the bar are the same as always.  The pool area is essentially the same with the addition of high-tops.  But, while retaining these classic elements, they did it up and it is beautiful.  I'd like to know if they used a professional designer - this was well done and someone deserves some props.  \n\nThere should be a part of me that wishes the old place didn't change, but I don't feel that way.  I think this has the potential to be a heck of a bar.  They did a great job.  And, it does stand-out against the back-drop of the neighborhood bars.  It'll be interesting to see how this place goes moving forward, but they have a foundation of a 60+ year-old bar that has a lot of good vibes.", "author": "Adam S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-05-28", "description": "A very nice neighborhood bar to try out it you are in the area. The drinks are good and the beer is cold. They have a pool table which was nice to use while you're drinking and enjoying your company. The service was nice, but I'm not sure if it was because we were there with some of the \"regulars.\" A very nice place to hang out and chill. It was not too busy when we were there on a Friday night. A nice variety of music playing at a good level.", "author": "Camera P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-09", "description": "Oh man, the best bar ever besides Aces. \nThe owner is incredibly sweet, the people the all work there are the funniest/nicest staff you could meet. \nMy dog is continuously being fed treats and I get nice and drunk, it works for both of us. \nMake sure to go when the bartender Adam is working, he is the best and also adorable.", "author": "Sari S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-11", "description": "From the dim lit room with red velvet wallpaper to the most charismatic bartender Hugo; You can't go wrong. Great place to meet with friends, play pool and escape the tensions of the TL.", "author": "Dave M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-04", "description": "This club is great! It has an old fashion photo booth that all my friends and I enjoyed. It's kinda dark in the club, however, that's what makes it fun. Would like to come back in the future for sure!", "author": "Alton W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-22", "description": "If you like vintage velvet flocked wallpaper, you'll like this spot. The bar is divey, has a mixed crowd, a tv usually playing the Giants or A's, and is clean and tidy. And a good spot for a nightcap. The Ha-Ra was opened in 1947 by Harry and Ray, a boxer and a police man (I think, I might have made that up). There's a blown up photo of them on the wall between the pool table and photo booth. The photobooth was converted by Photo-matica from the original 1950's era wooden phone booth (that you can see in that photo on the wall) after the bar was renovated a few years ago. #photoboothpubcrawlsf #sanfranciscophotoboothpubcrawl", "author": "Matt D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-09-20", "description": "Well you know, new wallpaper, ceilings, and...a real complete mens bathroom(no mirror). NO JUKEBOX. All one has to say is: What would Carl think?", "author": "Mag N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-15", "description": "Almost hate to write this review because the conformist lames will infest however the truth is the light. Being a recent widow yeh, ouch... late Tuesday, June 14 I nocturnally strolled to Target downtown for cat food (mock me and you will be cursed)  and on the way I noticed that Ha-Ra Club had like, reasonably sane functional-looking and attractive people inside! One star!\n\nSay wha? That place used to be an ultra freak fest in the worse possible way I'm 'old school' tolerant liberal artsy chick & have avoided Ha-Ra Club except for an unfortunate visit in the  late '90's with the late Mr. L to protect me it was too much yuck and I should know have lived here since 1984 (broken record). \n\nThe handsome (I'm a sexist piglet) doorman accepted my smile and stepped to the side. See, some doormen are passive aggressive idiots and chose to bother a chick for no other reason than they feel less-than; nevermind the quasi- feminist rhetoric about misogynist impotence, which there isn't any at Ha-Ra Club.  Two stars.\n\nWhat else do you want in a recently refurbished San Francisco iconic dive bar beside red velvet flocked walls and friendly talkative service men. Three stars.\n\nEmphasis on men and being a str8 lady, well, honey, please.  Ladies and gentlemen, behold your newest Tendernob cruising/pick up/first date/bridge and tunnel joint. Four stars!\n\nThe  is a pool table, the house white wine is 7 bucks there are drinks specials, happy hours hooks for your purse to hang on (smile)  every nook and cranny is screaming for an infatuation kiss.\n\n Unless you get a wonky doorman then you will lose your mystique and right now Ha-Ra Club  deserves 5 stars.", "author": "SF T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-04", "description": "Continuing my review... it just keeps getting better. Drew is a stone fox and attentive. But straight up they are bringing some excellent door guys. Let's  start with Vince... Fast and furiously on top of  peeps that don't respect the bar. Noah he is  gentleman of door guys and always lights my cigarette. Hank he knows the stank.  The best blousy boobs in town keeps being brought by Sarah but that isn't just it. She has Star personality. Still no question she prevails beyond! Need I say more..,", "author": "Black D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-09", "description": "Nice neighborhood bar with a great relaxed vibe and a fun photo booth! My wife and I decided to stop by in the recommendation of a good friend! Glad we did!", "author": "Marc L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-13", "description": "We stopped by this place by accident what a great find great drinks and fantastic atmosphere super nice bartender and great pours", "author": "Johnny B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-10", "description": "The new HA-RA is great!! I just threw my big birthday party on Saturday. I have to give them 2 thumbs up! They were so excited that I chose HA-RA for my party and very accommodating while I was planning and the actual day of the party. One of the owners Wizz and bartender Drew took time and met me and boyfriend in person to discuss the planning. They were so friendly and flexible. Despite of my last minutes request to have party there, they ordered me a keg that I wanted and got down all logistics so that my DJ friends can set up their gear. During the party Drew and Nicole were so cool and checking in with me periodically if I need anything. New HA-RA brought back classy 40's - 50's old skool San Francisco bar vibe. Everyone came to my party had a really good time. Thanks Tom, Wizz, Adam and Nicole. Everything went soooo well!!! \nLove you guys!!", "author": "Miyako U."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-30", "description": "Great crew behind the bar & the locals are an awesome bunch.\nCheers for contributing to making my stay in San Fran a bloody ripper of a time! :D", "author": "Ad R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-25", "description": "I see the listing as a 'dive bar,' probably would be better described as a 'cool bar.' Why? A number of reasons, not the least of which being that when you go there, right about when you are wondering if you are in the right place - you are just about there...\n\nThree experienced SF bar proprietors (with at least one a local legend) brought this one-time nightspot of wrestler HAnk Hanastead and boxer RAlph Figari, as well as a former brothel, back to its old glory: vintage photos, original ceiling, red-velvet wallpaper, and all (see - a pro wrestler, prizefighter, and a former brothel - three more reasons this place is cool).\n\nIt is on a stretch of Geary Street in the Tenderloin (regardless of what the realtors and rental agents tell you) that is still a block or two from a lot of the gentrification that has happened in the area. So get there now if that's your draw, because given how things are going in The City the 800 block of Geary will be tamed soon as well...\n\nHa-Ra oozes character and stories, which whoever is behind the bar will generally share if they're not too busy. The crowd can be 'interesting' depending on when you're there, it's a great place to catch a game or a drink before heading home. They have a good selection of liquor and beer, and know their cocktails...\n\nI read the Yelp complaints about the pricing, honestly not sure what people expect in SF when here. SF and the Bay Area are not an inexpensive place to eat or drink practically anywhere anymore, I don't see Ha-Ra as being any different better or worse in that regard. It's a great go-to spot for a change of pace, and it's been a sure-fire fun night every time I've been there so far.", "author": "Arthur S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-25", "description": "Had a blast with my friend there and walked out of there mission accomplished.", "author": "Adan P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-09-17", "description": "So much for \"remaining\" a dive bar...yet another TRENDALOIN bore! \nWish I can tell you more, but I will spare you.", "author": "Jill F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-30", "description": "My favorite place to go in San Francisco on Saturday afternoon!  By far the coldest beer in San Francisco.  This place has been renovated and has a great vibe (old school).", "author": "Jeff C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-18", "description": "Stopped in here on our way out of town Sunday morning for some football. Drinks were fast, free BBQ, and the NFL ticket. Hank our bartender was awesome! I've worked in bars for over 12 years and love when a stumble upon a gem like this. We will definitely come back to this place when we are in the bay.", "author": "Sarah M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-09", "description": "Everything you could want in a quiet and dark bar in the middle of SF. Came here on a Sunday after \"dive bar hopping\" with my cousin. The bartender was very friendly, funny and attentive (and makes a great drink!). The locals were just as friendly. Major bonus: they have a no fee ATM (compliments of the establishment), which, in such a big city was a huge plus! You never see that anymore. They also have a bad ass looking phone booth that is converted into a photo booth! We didn't have the chance to try it, but definitely wish we had. Just another excuse for us to visit again!", "author": "Princess L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-26", "description": "Super chill place, we went on a Tuesday and there were max 10 people the whole time we were there! We really loved our drinks ($6 Oatmeal Stout and $6 Gin & Tonic) and especially loved the bartender, Adam! Hilarious and knowledgable about the area, fun to talk to and super sweet. Thanks Adam & Ha-Ra crew, we will be back!!", "author": "Kellie P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-11-06", "description": "We walked in here and waited for a long time while the bartender hung out at the other end of the bar talking to her friends. No bueno! We walked out and went to a competing establishment. Nice bar, tho!", "author": "Rick L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-07", "description": "This place is dark and divey, the drinks are strong and the jukebox is fun. The bartender was very friendly and mixed up a few Makers Mark Manhattans, we chatted like I've been there a hundred times before. The DYL and \"Be about it\" Zine party was the place to be last Friday and introduced me to the Ha-Ra Club. \n\nI love San Francisco locals, they often make you feel at home no matter where you are from. Since, I'm a local - we talk about the ever changing city we were raised in. \n\nI'm drinking Maker's Mark Manhattans at a steal of a price and finish the night off with an Irish Coffee with whipped cream. I know, not what you would expect from a dive bar, but you always find the best things when you are not expecting them.", "author": "Rebekah T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-09", "description": "Cool Dive Bar with very well priced drinks and decent cocktails. I forgot what I had but they were all pretty good. \nThe owner/bar-tender was very personable and friendly.\nMost cocktails rang in at around $3.50~5.00\nI don't like beer so I can't comment on them.\nAfter all is said and done, it's great bang for the buck!", "author": "Umesh T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-01", "description": "Snuck in on a rainy Friday after a nostalgic walk through the Tenderloin. The Bourbon and Branch crew are taking over the neighborhood -- people like me who mis-spent their 20s 'slumming it' on Geary might be the reason -- and rumor was the Ha Ra was the next TL dive to get the mixologist makeover.\n\nAll the signs of a bar imminently to be sold were there: three people inside, empty space on the dusty liquor shelf, and dead silence. That's rare on a Friday in this neighborhood nowadays -- hearing the building hum as you drink -- and worth pursuing. 'When's the changeover?\" I ask, trying to be casual. A sneer. \"You can't believe everything you read on the Internet!\" says the barkeep. \n\nHe's the lone man on the staff, and on his days off (Sundays and Mondays) the bar is closed. Maybe that's how the hints of the Ha Ra's demise began. Or maybe nobody can believe a bar/social club opened by a boxer and a wrestler in the 1940s, and still owned by the same family, can hang on in 2014, when tech is king.\n\n$10.25 for a shot of Bulleit and a Racer 5. $3.50 for a well cocktail. The lesson on how to hit in a bar fight without breaking your hand (palm strikes) and how to break the thumb of the dude choking you (raise your arm, twist, and pull) from the knuckle-tattooed regular was free.\n\nAll bars in the TL used to be like this. Get it while you can, kids; it's on its way out.", "author": "Chris R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-21", "description": "Best dive bar in the TL.\n\nLook at the amount of 5 star reviews! If I wasn't such a D&$K with my reviews I'd give 'em 5 too.\n\n\nTotally worth your time and money.", "author": "Justin S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-14", "description": "Thank you team from aces, Scotty and Tommy for saving an old school bar. You managed to modernize it while keep the original feel. Well .... Old school feel without the grim, smell, and sticky everything. It looks great and feels right! Thank you!", "author": "Michael T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-03-19", "description": "Dump. Skip it. \n\nVisited SF a while back and saw that this place was supposed to be a fun dive bar. I'm assuming now that all these positive reviews are just a running joke with the locals because the bar was completely barren when I showed up with my friends. The bartender had the personality of an opened box of Saltines and seemed annoyed to have customers. My friend ordered a jack and coke that not only turned out to be outrageously expensive but was also almost 100% soda. The actual soda that I did order was somehow only slightly less expensive. Naturally I have to assume that they really value their disgusting bar soda to put it at that kind of a premium. \n\nSeriously. It's a dump. Skip it.", "author": "Mike S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-09", "description": "Solid bar, not a dive bar by any means IMO, pretty dark, tiled ceiling, 3 decent size TVs, water readily available in a self serve style so you don't have to bug the bartenders..", "author": "Jeff H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-08", "description": "Let me tell you a little something about Ha-Ra, or as the glowing neon sign amongst the filth of the 'loin advertises \"Ra.\"\n\nThis is not a bar where you and your girlfriends go to to celebrate your bachelorette party. Nor is it a place where you and your bros from Walnut Creek visit to hit on city chicks.\n\nThis is a place where the patron's eyes wrinkle over from years of heartache and disappointment. Where solitude comes on a busy Saturday night in the hood. \n\nYou are almost always guaranteed a game at the pool table, as most of the regulars are hunched over their scotches and whiskeys. \n\nThis is where you can share a pint with the real San Francisco, far away from the glittery lights of Polk street. This is where San Francisco goes to sit, think, and drink.", "author": "Jenny U."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-11-15", "description": "OMG... With almost 200 reviews I probably won't cover an aspect that's new except to say that upon walking into the place for the first time, a girl in a horse head mask jumped on top of a friend and rode around on the bar and proceeded to have a great time. It was her birthday so when in Rome...\n\nThe drinks were strong and the bartender friendly enough that I enjoyed the whole crazy experience. I like the diveyness of the place and hope you do too.", "author": "John B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-12-22", "description": "I went into ha ra last night with a buddy. (12-21-13).  I asked for a beer and the bar tender, (not giving a shit) said \"they don't have it.\" Then asked for another beer on tap. His response was \"all beers on tap are out.\" Then he asked me \"how much have you had to drink tonight?. \" ?!? It was the start of the night and we literally just got there.\n\nAt ease soldier, I don't need to give you my money.\n\nI hope this whole place washes its face with a shotgun.\n\nIf your looking for a dive in the area go to 800 Larkin.\n\nIf your looking for a great beer bar. Go to Amsterdam.\n\nBut skip HA RA, it's garbage.", "author": "Ben H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-16", "description": "My friend doesn't live far from this bar so it was the perfect spot for a surprise birthday gathering. It's surprisingly well lit for a dive bar. I'm used to them being dark inside. There's a pretty kick ass (to quote High Fidelity) jukebox inside and a pool table for those of you looking to shoot some pool.\n\nThe bartender is attentive and she didn't mind a group of us taking over the bar for several hours. Drinks are also cheap. Both alcoholic and non-alocoholic were very reasonably priced.\n\nPerhaps there will be more celebrations here.", "author": "Amy J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-12-06", "description": "This place doesn't pretend to be anything that it's not.\n\nIt's Ha-Ra. What you see is what you get. \n\nWith a laid back, but efficient bartender - who doesn't mind pouring you a glass of water - despite the hoards of boozing santas around her. Solid prices. And plenty of chairs to sit.\n\nBumpin' to Mariah Christmas Christmas ballads from the juke-box, while Santamonium erupted in the dimly late place, while a grumpy old regular watched - with jaw open - was a great start for a Santa filled Saturday.\n\nTrust", "author": "Jessica T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-05-27", "description": "My friends and I want to start out at a dive bar for cheap drinks. We got there and it was dead (it was 7PM on a Saturday). It's too bad that they ran out of rum already! (Where's the rum gone???) \n\nWe ordered beer on tap and it's $4.50 per beer, so it's not bad at all. We didn't order any cocktail drinks because my friends wanted to go to a more \"classy\" bar.\n\nThe bar has a pool table and a jukebox. The people there played some rock music and were singing along as they played pool.\n\nI think it's an alright dive bar but I'd go here if I want a glass of beer. I could give 4 stars but no rum so 3 stars. I still recommend to visit this bar because people have different feelings with dive bars.", "author": "Vanessa V."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-02-24", "description": "Nice bar but these people are crooks, their alcohol is full of water. I had 2 LIT\"s and trust me it just felt like lemonade. Told the bartender and still they did not do anything about it", "author": "Karan S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-08-07", "description": "Dearly beloved, we gather at bars to get through this thing called life.\nBooze makes me devolve and I'm not the only one so don't judge or do I don't care after enough whiskey.\nHa-Ra Club is a divine dive on the way from Union Square to The Polk Gulch, it caters to old men and the occasional influx of youth looking to get downtown with their drink. It's kind of insulting. I'm at that age where I could commit to a bar like this and it would become my second home or just stop in, imbibe and be on my upwardly mobile way.\nThe drinks are a good price for the city and the TL area. The owner/bartender is blunt, crass and ornery but that's what makes the magic happen.\nI love the big clock on the wall and the brick interior as well as the low ceilings because it's perfect.\n\nMy most recent adventure here was blur of drink after drink after drink after drink after drink after drink after drink after drink after drink. I'm fairly certain I put a $20 bill in the jukebox and played all Eagles songs, maybe I just put the money in and forgot.\nI tried to dance, I refused to play pool, I mouthed off to anybody who looked like they wanted it, I fell asleep in the bathroom(not recommended) and my friends made sure I got home. Thanks guys, I owe you.\nDrinking is another reason for so many things as many know but at this place you drink because you have to. Because in this life things are much harder than the after world, in this life you're on your own. And if  the elevator tries to bring you down\nGo crazy! Have another pour!", "author": "Alexander R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-12-19", "description": "HaRa! It sounds funny when you say it a bunch of times (try it)...and this is what you will be chanting after a visit to the Ha-Ra Club.\nA quintessential dive bar- don't let the neighborhood scare you away. It's typically fairly empty and you can almost always get in for a game of pool (unless it is SantaCon and there are like 50 million Santa's in here).\nFrom the looks of it outside you wouldn't think it's a clean and nice inside, but HA-RA (I like to use this word instead of Surprise) it is!\nNew juke box with all the latest a greatest hits to go with your $5 glass of scotch.", "author": "Sarah M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-02-03", "description": "Ha-Ra is more than your run of the mill dive. How do I elaborate.. it's almost too flawlessly divey to be a real dive bar. Not over the top on purpose divey, but juuuuust right.\n\nA dive bar you'd see in a film. Like the owner purchased a Jello mold of the 'typical dive', added water, and out popped a jiggling, marshmallow speckled Ha-Ra. Old crusty bartender, prohibition violation certificate on the wall. Cheap tables suitable only for a dive or a low budget cafeteria. Cheap beer, PBR included (much appreciated as always). Pool table in the corner an obvious must.\n\nPeople bitch about the crabby bartender but so what? He's like that to EVERYbody. Chill out, it's only offensive if he's being selective. Would you get pissy if a deaf person wasn't listening to you? Of course not, they're not listening to anyone. Same with the bartender, deal with it. He was asked about happy hour and his reply was \"Not here. When I'm working it's unhappy hour.\" Well said good sir, I salute you for your honesty.\n\nLots of \"dive bars\" in SF try too hard. That defeats the purpose, if you're going to invest time and effort into a bar why on Earth would you work to make it look uncared for? A true dive just ends up that way, like Ha-Ra. They have booze, they have chairs, and they have more booze. All you need, case closed.", "author": "Justin N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-16", "description": "Love love love this spot!!!! Beautifully decorated and the staff is friendly and on point. It's only been open fur a short while but is killing it and will for sure be a new regular for me.", "author": "Lauren B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-28", "description": "A true dive bar. I remember (barely) doing shots with the cranky bartender back in 2009. It is now a bit of a hipster haven but is still a great spot to down many drinks with a friend or two.", "author": "David D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-03-07", "description": "I don't want to sound like a snob but this place is a diver among dives. Coming here on a dive bar pub crawl I was not let down by the attraction.\nI had a vodka and cranberry fearing that anything else might be horrible. The bartender was surly despite my efforts to be sweet and wish him a good evening.\nI went to the bathroom but did not use it, i chose to see what the next place held. I can say that in a world of gentrification it's marvelous that a place like this still exists, right?", "author": "Lizzy M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-12", "description": "I don't wanna say too many great things about this place cuz I don't want a bunch of idiots coming here, playing their shitty music on the jukebox and interrupting my pool games.\n\nCheap drinks, but sometimes they run out of stuff so basically don't be a dork and order complicated drinks. \n\nOne star off because the bathrooms smell crazy. Also, be careful of locking it from the inside. The bartender hates that!!", "author": "Brittany L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-09-30", "description": "Aaaaaah, the Ha Ra. Why don't you just change your name to Ca Ra in honor of the man, the myth, the legend - Carl?\n\nIn an age where young, hip bartenders are muddling their way to cult celebrity status around San Francisco, it leaves little room for the old school, curmudgeony types like our boy Carl at the 'Ra. He's a straight shooter who isn't afraid to tell you to \"fuck off\" if you're acting like an asshole and he'll always steer you in the right direction when it comes to your drink order. If he doesn't like it, he'll tell you, \"it's crap!\" If he approves, chances are he'll crack open a beer of his own and stop what he's doing to tell you some dirty jokes. Without him, I don't think there would even be a reason to visit.\n\nDon't expect a fancy library of malt whiskeys, fine scotch or trendy vodkas... head in expecting to drink well cocktails and Miller High Life (served in champagne glasses, on request). Carl will probably get pissed off about having to wash those glasses afterward, so expect to be the recipient of a few four letter words before he actually breaks out the stemware. It's all part of the fun, though.", "author": "Ruggy J."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-06-06", "description": "Walked in on a Saturday night and it was barren. The power was out and all they served was Budweiser from a bottle and Kentucky Reserve whiskey. It boggles my mind how anyone would want to keep this place open, let alone work there.", "author": "Chris B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-09-06", "description": "Dive bar does not cover the description of this place. It's more of a cannonball! Upon entering we were greeted by the funniest bartender I have encountered in my drinking career. He says to our crew, \"You guys better be drinking Budwiser's or shots because the taps are all dead.\" After hearing this myself and the three other chaps I was with kinda glanced at each other with the same thought in our mind \"Do we really want to do this?\" I'm so glad we did!\n\nWe sat and our bartender extraordinaire (Carl) was able to extend the drink menu and rustled up some Miller High Life's from the back for our drinking pleasure. Of course we had to request the appropriate glassware for the 'champagne of beers'. Even though Carl made sure to call us several derogatory names, sure enough he obliged the odd request.  \n\nAbout an hour after what was supposed to be a one and done beer visit, all three of us were now the only patrons left in the bar 2 shots and 2 'champagnes'  each deeper. \n\nWhy you ask? Carl! He's like my cranky old grandfather only way funnier. He told us dirty jokes, ripped on each and every one of us, and swigged shots of Cuervo every 10 minutes. Even when we decided to leave and go next door he closed up the bar early to have a beer with us there. I don't even remember the name of the next place we went because the Ha-Ra was that good. \n\nBeware of what your getting yourself into. If you want clean glasses, a working restroom, and an attractive crowd the Ha-Ra probably isn't for you. If you want inexpensive booze and entertainment in the form of San Francisco's crankiest bartender (he was really voted this by a magazine) Carl will take good care of you.", "author": "Danny W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-10-20", "description": "This is a pretty standard dive bar.  My sister's boyfriend used to come here often, and one evening I was hanging out with them and they brought me here.  I don't think this would be my first choice for a place to grab a drink in SF, but if you want a no-nonsense kind of bar, this is a good place.  My favorite thing about this place was Carl, but I heard he moved out of SF so he no longer works here.  Nothing beats Carl's dirty mouth, the fact that was he always moderately sauced, and would hit on all the women.  This place has a pool table and a rad jukebox.  I think the vodka shots my sister and I ordered came from a bottle of Ketel that was over a year old, but it still tasted just fine.\n\nI would say the best thing about this bar are that there are no pretentious douche bags hanging out in here.  If you just want a place to get drunk and hang out with your friends in a casual environment, come here!", "author": "Sarah B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-05-18", "description": "Carl the bartender was voted by the Guardian as the crankiest bartender in all of SF for '09.  His quote in response to this honor? \"Fuck off.\"\n\nAdd in some dark colors, pitch-black corners, a bathroom that hasn't functioned in at least 6 months, a listing in book of SF dive bars, cheap cold beer, mis-labeled taps, a juke full of jazz and classic standards, a pool table, a liquor selection that's as dusty as the bartenders, and a hefty side of sharp, sarcastic wit, and you have yourself a winner. \n\nThis place has been bringin' the dive since 1947, and I don't see it stopping any time soon.", "author": "Don B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-11-19", "description": "I've been visiting Ha-Ra, and Carl, for the better part of 10 years.  A few years ago, Carl told me that he was \"on Yelp\".  I looked up Ha-Ra and there were a couple of reviews.  Now I'm blown away that Carl has generated so many reviews! \n\nSo what's my $.02 Ha-Ra?  I love it!  It's a piece of realistic, non-touristy, social history in wildly popular, ever trendy, and over priced Bay Area.  Every time I'm in S.F. I make it a point to come by Ha-Ra for a few drinks, which is more often than you would think for somebody who doesn't even live in California.  Carl makes this place, without question.  But Ha-Ra does have an interesting history in itself.  Started by Harry and Ralph.  Ask Carl to show you the bullet hole in the ceiling for starters :)\n\nNow if you're looking for a Hanger 1 Martini, or a Mojito, or some other fancy drink, this place isn't for you. If you're looking for a hipster/trendy bar, look elsewhere.  If you want a live DJ and a dance floor, keep looking.  If you're offended easy by a dirty joke and a sarcastic sense of humor, PLEASE DON'T GO THERE!\n\nHowever, if you want a decent selection of beer, past your typical Bud/Miller selection, for a reasonable price then this is your place.  If you're up for a few drinks with patrons that are real people, who aren't trying to pretend to be something they're not, pull up a bar stool.  If you want a shot of whiskey, or tequila, with your beer you've come to the right place.  If you enjoy conversation with a colorful bartender, who's got a history as interesting as the bar itself, this is your bar.  \n\nSome people call this a dive bar.  I call it a real bar.", "author": "Ben F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-24", "description": "Fantastic remodel.  The guys kept a lot of the original touches but spruced up the space nicely. If you are looking for a cozy space with friendly bartenders and good TVs for sports, this is a great spot.", "author": "Grace R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-29", "description": "stumbled onto this place... Great Bloody Marys and COLD tap beer!! service and Sphere on point.", "author": "Tanya L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-03-27", "description": "Carl retired and moved to Cambodia.  They have an internet jukebox now.  That should tell you everything you need to know if you used to be a regular.", "author": "Joshua W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-06-01", "description": "One day a magical little gnome said come to my magical little place......he spoke and I listened.\n\nThis magical place was full of unicorns, leprechauns and jackalopes.  I was catapulted back between today, yesterday and tomorrow. \n\nIs it clean? Absolutely not. Is it dirty? Eh, not especially.  I would compare it to your favorite pair of shoes you just can't part with.  They have been worn, they have walked these streets down and back again.  They have traveled miles but they are comfy as heck and you'll be damned if you throw them out.  They are not replaceable!  \n\nHa-Ra is that place.  It's been around a long time.  The photos are nostalgic, the bartender reminds you that they aren't there just to make you a cocktail, they are the bar.  Carl is the bar!  This place is seriously old school.  You don't walk in and order some fancy drink, you come in to chill out on a bar stool, listen to some Jazz and put some hair on your chest.  Last time I was there they had a Noir book night.  Noir!!  What's even more SF than the institution that is the Ha-Ra, Film F'ing Noir!  \n\nThis magical place called and I answered....", "author": "Kristin Marie S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-13", "description": "Ha-Ra is yet another one of those SF places that I have deliberately not reviewed, even though I have been there lots of times.\n\nThose of you who knew Carl know what I mean.  What a character.  Recently, I stopped in this joint again and got a new, young bartender.  I give the guy credit, because when I started talking about Carl, you could tell that he had heard about it MILLIONS of times already.  He was very eager to put that chapter behind and make his own mark as a bartender.  Not easy to do in Carl's footsteps, but I wish him luck.  \n\nAt least after Carl left, the owner of the bar used to tend there.  Surprisingly young, he is actually the son of one of the founders/owner.  This place has a surprising history, though you wouldn't know it upon casual inspection.  Check out the black and white photo of the Ha-Ra from the 50's or 60's, when it was full of patrons dressed up in suits and dresses.", "author": "Dave N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-03-29", "description": "$4.50 beers with a nice selection: PBR, Stella, Prohibition, etc.... Ha-Ra. \n\nPool table with lots of elbow room...  Ha-Ra\n\nChill bartender dude who I pattern my wardrobe after...  Ha-Ra\n\nPerfect for happy hour... Ha-Ra\n\nHolla!", "author": "Earl G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-12-04", "description": "I like my bars dark and uncrowded, my floors sticky, my drinks stiff and my bartenders hilarious and my fellow bar patrons unobtrusive. Ha-Ra is everything i could dream of and more. I can sit here in here at the bar and have no Marina m--ther f--ker bothering me, actually for that matter that i can GET to the bar area without shoving some 20-something popped collar douche hitting on Juicy Couture and her best friend and have to pay only $3.50 for a gin and tonic, is my idea of perfection. Top that off with Irving's Pizza across the street...and, well I could go on and on, but i'll stop my drunken blatherings here. Just know that the next time i'm at Ha-Ra i'm inflicting my hideous music taste (Starship anyone??) upon the other patrons at the jukebox. And because Ha-Ra is so cool, they're gonna laugh it off.\n\nYes Ha-Ra's. Dark, stiff and sticky, just the way i like them. ;)", "author": "Vanessa C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-10-12", "description": "This is a cool place with a full bar and a jukebox with a good selection of songs. I even found a Marilyn Manson song on it, \"We're From America\". I played it of course! The lady who was the bartender there was cool and friendly. This place has a full bar. The bartender offered to make my drink strong as I was barely tipsy although we were drinking for a good few hours. \n\nThe drinks are good and strong and not overly priced. Again, Tom R. was with us and we were all wondering about this guy in the corner there who looked like he was dead. I'm not kidding, he wasn't even breathing. He was in the corner behind the bar. Eventually he moved at some point. It was kind of funny in a twisted way, lol!", "author": "Butterfly A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-03", "description": "As a disclaimer, I am from Seattle and was only here once but had a great time. This place is very down to earth and laid back. Don't expect anything fancy. \n\nThe owner, Rick, was bartending and he's great to talk to assuming you're not an uptight person. He had no objections to bringing in food as well. \n\nI'm not a fancy drink person but I didn't see any redbull or lemons around, so if you're looking for that you'd probably want to go elsewhere.\n\nDrinks were very reasonably priced (I think it was 7 for a double well scotch), I don't think they have a happy hour. Rick (the owner) even paid for the jukebox when I was there which has never happened anywhere else I have been. Not too important imo, but still nice", "author": "Mike W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-28", "description": "A small but decent selection of beer on tap, chill bartender, and everything else you'd expect from a friendly dive bar. \n\nI was left smitten when I realized that I could get tacos across the street. I was able to take a quick taco break between drinks and make another another taco stop on my way out. \n\nGreat folks, great drinks, and a sprinkling of tacos = good times.", "author": "Loli L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-06-09", "description": "I have some bad news for San Francisco dive bar lovers. The rumors are true that the cantankerous bartender Carl has moved to Cambodia. \n\nI hadn't seen him there the last few times I'd been in but figured I'd just been missing him but this last Saturday I finally asked where the hell Carl was. Rick, the owner, gave me the 411 and we were crushed. The story is that Carl moved to help his friend run this guesthouse in Cambodia http://newaqua-guesthouse.com/ I assume he's bartending. \n\nCalm down everyone! Carl is gone but lets look at what HaRa still is. They still serve strong drinks and cheap beers. They still have a good jukebox, they still have pool tables, and they still have that great location on Geary. \n\nAnyone up for a trip to Cambo? \n\nP.S. I get the feeling the Rick might be getting a little sick of people asking about Carl.", "author": "Manny F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-28", "description": "I came here for DYL and a great zine party.  I must say that this unassuming dive bar as quickly grown on me.  The bartender was friendly and made me some tasty perfect manhattans.  I know I will find myself here again soon!\n\nThis place is worth a stop in if you're in the area and want to avoid the crowds or attitude.", "author": "Theron L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-10-20", "description": "One of my first \"neighborhood nights out\", we ended up at Ha-Ra.  About 45 minutes in to our experience, a group of tourists walked in and were asking for fruity drinks.  The bartender replies, \"The best I can do is a Jack and Diet Coke.\"  You had me at snark, Ha-Ra, you had me at snark.\n\nThe Giants game is always on, groups of old Mexican men are always around, drunk and playing cards, and I think there is a regular bar fly named Patty or something.  She's ancient and fabulous.\n\nThe jukebox is quality.  One night we were there before the crowds rolled in and the bartender gave me $10 to put on some tunes.  Everything from Gaga to Grateful Dead.  \n\nOn that same night, the bartender (owner I think) got a random shipment in of PBR tall boys, so he was practically giving them away.  Score!\n\nOverall, on my list of top 10 dive bars in the city.  Probably the best in the TL.", "author": "Ashley W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2005-08-05", "description": "Oh why not, 5 stars.  It reminds me of the Tattle Tale down at Sepulveda and Sawtelle (PS: if anyone knows that place I'll buy you a drink anytime any place, there will be a simple test involved of course)\r\n\r\nIt was a Thursday, there were a few old guys, two cute girls at the bar, several hot yelp aficionados at one table, and the pool table from The Hustler (possibly the same one) but with that perfect lighting, or lack thereof.\r\n\r\nand yes, $4 pints and a $2.75 vodka/cranberry (although I think that was because Nicole's a hottie. I mean, mine only cost a dollar, but then again, I didn't much trust the way he was looking at me as he slid the drink across the bar...)", "author": "Mike V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-12-12", "description": "Ha-Ra. Horrah!\n\nI think Vanessa C.'s review pretty much sums EVERYTHING up.\n\nI started my Santa Con adventure at this bar -- what a perfect way to start the day. Beers were cheap, the ambiance was dark enough so that everyone looked attractive, and even those that were playing billiards looked talented. The floors and table tops were sticky, and the smell of stale beer filled the air. Santas were all around, ready to start a very naughty day in the corner, and having a ha ra ending.\n\n$8 dollars for 2 beers. Not a fancy place at all. Very nice.", "author": "Nicole P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-03-18", "description": "You know you're in a dive bar when...\n\n...the owner was conceived on the pool table. Or at least that's what he said. He could be pulling my leg, but I would believe it. Pretty much the perfect dive bar. The main guy there loves to talk (but will also leave you alone if you want), good enough selection of beers, reasonably priced drinks....what more do you need?\n\nBy the way, Ha-Ra is not a Korean word. The name refers to the first two letters of each of the co-founders' names (Harry and Ray, I believe?)", "author": "Mark A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-04-11", "description": "There's something about this place, that even though I can't find it in my heart to give it more than three stars, I always seem to end up coming back. \n\nI like the bartenders. I like the quiet, dive-bar feel. I don't like that I keep forgetting to NOT order beer there. The taps are either filthy or the beer in those kegs are 20 years old.  \n\nI'll keep coming back, and I'll probably order beer again, and then get mad at myself for not sticking to whiskey.", "author": "Mez L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-12-15", "description": "I should have known better than to expect my Fat Tire to actually be Fat Tire. Let's start with that. I've read the reviews. I should have known what's up. But, well...I'd been drinking, and was mildly frightened of seeing my big, bad TerderNob enemeh, so I kind of forgot. Until I had a sip of my \"Fat Tire,\" at which point I made a face, had my FT-lovin' friend have a sip, and then remembered that the Ha-Ra isn't well-known for its accurate draft beer system.\n\nC'est la vie. \n\nWhat bothered me more than my beer not being the beer I ordered/paid for was how gross the bathroom was. Pee on floor! I know I can't expect a whole lot out of divey places, but it would be nice to not feel like my jeans are dragging in a puddle of piss when I go to take a leak. I mean, I don't even have that issue at Zeitgeist, and their bathrooms are bisexual. (That's right: bisexual. Not unisex. Get it right.) Also, the ladies room reeked of manpee, which doesn't really get me in the mood for love. \n\nAside from those two little issues, though (and the beer problem amused me more than anything, because it's just a random quirk of the place), I really liked the Ha-Ra. Small tables so you're not stuck with everyone else in the place and can isolate yourself with your little group of friends. The music is pretty good, although it doesn't hold a candle to the awesomes that were being bumped at Whiskey Thieves. There are also cool photos hanging up on the walls...which are red. Oh yeah. Red walled bars. So hot.\n\nI wasn't blown over by the Ha-Ra Club, probably at least partially because its famous super-crabby bartender wasn't working, because my non-Fat Tire was kind of expensive for a beer that ended up not being what it was supposed to be, and also because we only had time for one drink before hauling ass to try to get back to BART to make the last train to the East Bay (we missed it), but I'll definitely be stopping back in next time I'm cruising Geary for drinks and crack. Or just for drinks, I guess. \n\nHowever, next time, if I opt for beer, I'm ordering a Budweiser. Maybe I'll luck out and get something fancy instead.\n\n3.5 for fun, red walls, and quirky nature.", "author": "Ashley M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-11-12", "description": "I guess I'm just not as amused by filthy bars and alcoholic bartenders as much as other people. I kind of like drinking out of, you know, clean glasses and stuff like that. That being said, Carl is somewhat amusing. He's got a lot of stories to tell and it's funny how beaten down by life he seems even when it's only like 7PM. \n\nI wish Ha-Ra Club and Carl the best but I don't think I'd ever choose to come here when there's so many other great bars to go to.", "author": "Aaron V."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-12-19", "description": "I have been drinking the same bourbon for over 12 years. I can certainly tell the difference between Makers Mark, Jim Beam and Early Times.  What you poured out of the MM bottle on 12/18 did not come from Makers Mark. You must be re-filling empty bottles. Shame on You!", "author": "francisco p."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-05", "description": "Ha-Ra, what an awesome dive. Rick, the owner, is the man. Will tell you stories about San Francisco when merchant marines used to frequent his bar and even bring out old pictures of the bar from back in the '50s. If you are at all interested in San Francisco history particularly in the Tenderloin area come on in and chat it up with Rick. He's a funny guy who likes to bs with the patrons. And speaking of the patrons, all i can say is you are gonna see it all in here. Got an old man muttering to himself in the corner, maybe a few bold tourists, some young hipster like crowd who play shitty songs to which Rick gives me a 5 dollar bill to put in the jukebox and skip over their songs. Anything strange and this place gets it. \n\nThe mixed drinks are cheap. I'd stick with liquor since some of the beer i got from the taps has been skunked on occasion. \n\nExpect a dive bar. A place that the point is to get drunk and not to see and be seen. If that's what you are looking for take a walk up nearby Polk Street.", "author": "T.C. J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-31", "description": "I ordered a round of drinks and had a twenty out. The bartender tells me \"8.50\". WHAT?! Insane. People are here to get wasted...and wasted they get. Not much for entertainment. Although we did sit next to a couple of girls with ultra heavy makeup and eyes that looked soulless. They were putting the drinks down like champions!", "author": "Siao W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-11-09", "description": "Ha-Ra is a very cool and old school classic dive bar. Rick (I think that's his name) is beyond cool and down to earth. Great décor and pool table. \n\nWARNING: if you spend too much time at Ha-Ra you will be drunk, as they don't know what a short pour is...    my kind of place. \n\n5 out of 5 stars...", "author": "Marty S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-03-25", "description": "Once again I've heard about this place but haven't experienced the legendary  wrath of the bartender.\nNice place , nice beer...place to hangout on lazy night...\nI shall be back.", "author": "Dupa B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-24", "description": "The diviest of dive bars I've ever been to in my life BUT still super great find.  It wasn't crowded when I went on a Sunday evening and it was so much fun! There's a pool table and many different types of people frequent the bar. Sure, it's in the Loin but it's still a great place to check out if you want to play darts as well and just chill out. There's not much of a selection yet the environment will allow you to carry a conversation and not feel too scrunched in the space. One thing, for sure, the bartender is an interesting character, to say the least. It seems that he's been there for ages and worth getting to know if you plan on making the Ha-Ra your hangout for enjoying cheap libations. It may just become the place 'where everybody knows you name and they're always glad you came'. \n\nAs I mentioned, if you're walking in their with a suit or a pretty dress, don't expect some classy 5-star joint but if you're a man walking in with a pretty dress, you'll get looked at, most definitely, but it probably wouldn't be the first time the Ha-Ra has seen that.", "author": "Dorothy S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-03-19", "description": "Anyone calling this place a dive bar is someone who don't know a dive bar. At least not by Tenderloin standards. The place is clean, doesn't smell wierd, nor is infested with the typical Tenderloin SRO dwelling assholes/degenerates.  Once in a while, it is nice to go to a bar just to chill out and not have to squeeze up to the bar and get a drink. Hell, chances are you will have the place to yourself along with just a cople others....", "author": "Jim B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-09-05", "description": "We stumbled in here on the tail end of a night spent teetering back and forth with old and new friends alike, and you know what? Fairly appropriate as night-enders go. It's a thin reed of a bar, a small shotgun dominated on one side by the bar itself, and the host behind it, who on this occasion met us with this greeting: \"I hope you like Budweiser, 'cause the taps are dead.\" He was awesome.\n\nOnce he explained that he wasn't, in fact, kidding, we took him up on taking on a High Life (he had a few stashed) and immediately razzed Carl about his distinction as the crankiest bartender in San Francisco. I could see how that might be true, but if your mileage may vary, he couldn't have been cooler when we popped in. Of course the fact that many of us (including Carl) were about three quarters in the bag and were encouraging of his litany of jokes no doubt helped us fit in a little. Regardless, in a pinch? I'd pop back any day.", "author": "Kevin N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-05-22", "description": "The reviews that attempt extensive analysis of how much of a dive bar this is and how authentic it is remind me of an awful film that i saw about wealth inequality. The film dedicated 20 or so minutes to filming some wealthy graduate students and young professionals \"slumming it\" in dive bars for the night and talking about how REAL the people were there.\n\nI grew up in a place where people knew their neighbors. This place feels like home to me. \n\nRick runs the place like it's been in his family for years because it has. He has some great stories about the city and the neighborhood. He's an excellent bartender.\n\nCarl moved to Cambodia. I don't miss being kicked out of the bar at 11 pm-- right after he poured our beers-- because he was too drunk to keep it open.", "author": "Katherine C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-31", "description": "I don't understand how anybody could have a bad time in this place. Ok, maybe I can. If you have a bad attitude, or think you're cooler than thou, Carl will put you in your place, and you'll leave with your tail between your legs, and/or a bad attitude about the Ha-Ra. \n\nI always thought it sounded like an Asian joint, but Ha-Ra stands for Hank and Ralph, the two guys who started the place. I like that it's still in the family, and that it's really the same way it was years ago.\n\nIt was noon on a Sunday when we ventured in here (scandalous and sacrilegous, yes, but hey, that's us). We ordered our usual--beer with a shot of fernet, and although they don't actually carry fernet, Carl gave me a shot from his own personal stash. Such customer service.\n\nHe also bought six songs on the (amazing) jukebox for me, and he called me \"adorable.\" \n\nIt was a little hard for us to leave, but there are many dives in this city. And only so many hours in a Sunday. But this will be a stop on our adventures, for sure.", "author": "Rachel F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-03-05", "description": "A dark red bunker for the drink on Geary Street. Do you enjoy being served the drink by a crusty old man wearing the cap he bought at Jersey Boys? Walk then, like a crusty old man, fast as you can, into the Ha-Ra.\n\n[[SF/X; Frank Sinatra. My fickle friend. The Summer Wind]]\n\nThere isn't a tacky fake boobie beer poster to be seen here. No horrible sports memorabilia, no NASCAR crap, just framed b&w pics of old boxers with spitcurls. A windowless hole with a Formica bar top. A cheap cabinet holds spindled Sidney Sheldon and Danielle Steele paperbacks. Did I mention that this place was a dark hole? It is. And the lighting is shitty. Only 3/4 of a restroom worked.\n\nI FUCKING LOVE THIS PLACE!!!\n\nThe bartender said filthy words! He had a very gravelly voice! Ha-Ra is awesome! And---and---Stella AND Newcastle---and---whoo...spazzing out here...anyhow, he seemed to know that the crowd was going to change and for the worse! He yelled something like \"How does everyone feel about becoming disenchanted with The Ha-Ra?!?\" and not two minutes later a pile of about eight Marina creeps oozed in off the street! Is he part of some Douchebag Early Warning Network? Was he a magical crusty precognitive? How DID he know?\n\nI went to a good five more bars the first night I found myself in the Ha-Ra and it was mostly downhill from there. Did I mention that I was very, very drunk? I think I was.", "author": "Jeremy W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-14", "description": "Bored and wandering through the friendlier part of the 'loin, I popped my head into some of my old favorite drinking establishments. The demographics ever changing, couldn't bring myself to order a drink in any of them. I happened upon the Ha-Ra and found a low-key, friendly place with a bartender that actually talks to his patrons instead of checking his iphone. I got a history lesson on the days gone by. I think he must miss them as much as I do. Much appreciated in this day and age.", "author": "L v."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-03-06", "description": "I am unsure I can say anything about this establishment that hasn't already been said. \n\nCarl, the tender, is surly, to say the least....but if you work on him and don't let him grumble at you he will eventually cave in and smile. I am quite a fan of the smiling Carl, yet, I am also a huge fan of surly Carl. You will undoubtedly get  dose of both on any given night you are here. \n\nThere is a pool table that has actually been re-felted in this decade, which makes me happy. The Ha-Ra has great brick walls, dim lighting, low ceilings, simple decor with as loungy a feel as you can get with no bands playing or booths to hide out in. \n\nI can't leave out a description of the restrooms, they are what will keep the faint of heart out of this bar. This last time I went the womens restroom was out of order, and I have to say the mens was no better or worse than the womens; no soap, very little water, no handle to flush the toilet (meaning you have to reach into the tank to flush) and no paper towels. \n\nThis is one of my favorite TL bars, and unless it changes drastically, it will remain so.", "author": "Drue C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-03-10", "description": "Have you met the elderly, psychotic owner/operator of this hole? I think I'm in love. He will yell at you, he will call you names for picking what he considers to be \"crap\" on the jukebox, he'll lock a bathroom or two just for the hell of it. He likes to threaten patrons that he'll close the bar early and drink prices are arbitrarily assigned at his discretion, and vary from person to person. He actually charged Matthew R $11 for a well drink on Friday night. That's ok. We can be just as underhanded and sneaky as Old Guy can be. We also have the advantage of good mental health. \n\nThis place rocks and I don't care what anyone says. It smells, it's all run down, and Old Man behind the bar just might really go off the deep end one day and take us all out with the gun I imagine he has stowed behind the bar. Until that day comes, you can count on me being back. A little piece of backhills insanity right smack in the middle of San Francisco.", "author": "Autumn K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-06-19", "description": "Carl does not take cards, nor does he take any lip. He says he's been at the Ha Ra since '92. It's quite possible that he means 1892, but nevertheless, he's a funny, old codger who will make your stay memorable (to say the least).\n\nThis is an OG Dive Bar. It's actually written up in The Best Dive Bars of San Francisco with 9/10 dive stars. It's been there since 1942, and I'm thinking it probably hasn't changed much. There's not much goin' on in this place, but a wacky old man, a juke, a pool table, and some crazy CRAZY regulars.\n\nThe Ha Ra is to SF what the Smoke Shop is to Seattle. Real Deal Dive.\n\nIf you're good to Carl, he might pour you a watered down shot or two..\nTop shelf 'Montezuma Gold', of course!", "author": "Katie A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-01-29", "description": "First of all, this is more of a neighborhood bar than a dive bar.  There's a subtle difference.  Carl is indeed one of the greats.  He 86'd my friend for saying, \"Fletwood Mac fucking sucks.\"  He's the kind of bartender that'll hand you a five and tell you to pick some songs:\n\nCarl: \"As long as you don't play that one little guy.\"\nMe: \"Paul Williams?\"\n\"No, the little black guy.\"\n\"Sammy Davis, Jr?\"\n\"Sammy Da..NO!!! the fucking little dancing guy!\"\n\nHe meant Prince.  I should also throw in that when I mentioned SD, Jr, this 1996/\"Swingers\" douche bag in a pork pie hat and a really ugly wannabe sharkskin suit naturally had to chime in and make sure I wasn't talkin' trash, or jive, or 23 skidoo, or whatever the fuck his people say.  Go suck Joey Bishop's dick, Daddy-o.\n\nAnyway, great bartender, great bar.", "author": "J P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-12-15", "description": "Good old TL!  Erin S. and I picked out scary-looking bars to try as a stop on one of our TL Pub Crawls and this was my pick.  Her pick is the 21 Club.  It only took a year to finally stumble in after a Olive HH, and.... not scary at all.  Doh! I should have trusted all the positive reviews but dang this place doesn't look inviting past dark in SF.  It was not very busy on a Wednesday night, the music was playing, the barman was pleasant and the pool table was free so I schooled Brian W. while sippin on a nice cold Sierra.", "author": "Holly B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-05-30", "description": "I needed help finding some place to drink; Drue came to the rescue and provided me a list of great places close to where I was staying.  I decided on one that she said was on Geary and Van Ness (can't remember the name now) but when I saw the Ha-Ra on my way there I knew I had to get off the bus and go in and check it out, she did speak highly of it after all.\n\nI walk in and there are two drunks at the bar, the bartender, a nice looking pool table and myself, I think this is going to be interesting.  I belly up to the bar and the bartender shuffles over to me and takes my order, \"one tall Stoli tonic please\" \"that will be $4.50\" score cheap drinks!  A minute later my drink is delivered, a nice stiff stoli tonic just the way I like 'em.\n\nThe bartender comes over and I ask about the boxing memorabilia on the wall and he explains the story to me.  Ralph, the Ra of the Ha-Ra, was a professional boxer before going off to the war when he came back he realized he was 'too long in the face' to box any more and decided to open up a bar with his brother(?) Hank, the Ha of the Ha-Ra.  It was a great story and I was informed that the bar is now own by one of their sons, it's nice to see a bar like this stay in the family.  I really love places that have that old school charm to them and the Ha-Ra clearly had that.\n\nThe bartender asked where I was from what I was doing there and I explain I'm visiting from Seattle checking out the dive bars in the Tenderloin, he gives me some suggestions and hands over a copy of San Francisco's Best Dive Bars book to check out.  I soon realize this isn't Carl that I read about in the yelp reviews so I ask him 'are you Carl' he laughs and says 'no he's the pleasant one Jerry' so while I didn't get berated by Carl I did get a cocktail poured by one of San Francisco's original bartenders so that was cool.\n\nI finish my drink and decide to head out, I thank Jerry and ask a little bit more about the places he suggested, both allowed smoking which is a no go for me so he threw out a couple more ideas and I was on my way...", "author": "Me H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-04-02", "description": "Carl has old school charm and class.  I haven't been to a bar where the gentleman pouring my Anchor called me 'sweetheart' and 'dear' in far too long. \n\nAnd he has no qualms about telling the assholes in the bar to get the f*ck out when they are being surly.\n\nThe jukebox (sigh) is perfect.\n\nNat King Cole, Johnny Cash, Louis Prima, I could go on...\n\nThis is a great bar to start out your Saturday night.", "author": "Alice S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-06-27", "description": "Pirate Pub Crawl bar #6\n\nThe barkeep so didn't even care that we were pirates.  And didn't offer Irish Car Bombs.  But did have Guiness. And somehow we blended into the crowd.  That's saying a lot, considering I had an enormous hat and parrot on at the time.", "author": "Andi T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-09-09", "description": "Ha-Ra is by far the best dive bar in all of San Francisco.\n\nI found this place my second week living in the TL and keep finding myself planning my Friday nights around it.  The drinks are cheap (3.50 for wells) and strong; usually, I only have to buy two before I'm about to fall off my barstool.  (I actually saw some guy do this last week.)  \n\nThe owner is really awesome and takes the time to get to know his customers.  On the one day they were closed for repairs, I was waiting outside for a friend and the owner offered me a free drink and company.  Though I politely declined, I was touched by his offer.\n\nIf you're looking for a great dive bar that won't disappoint, Ha-Ra is your place.  It's the perfect place to relax with friends on a weekend (or weekday) or to catch a quick drink after work.  Ha-Ra I love you!!", "author": "Stephanie T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-07-01", "description": "They definitely water down their booze. Bar tender kept walking outside to talk on her phone. Would be a good spot to go with a group of friends and kind of have the bar to yourselves and have a good time with the juke box and pool table", "author": "Dirrrtybird B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-03-05", "description": "\"Don't talk to me!  I fucking hate you!\" said the portly elderly bartender to some bloke who, apparently, tried to talk to him.  I reckon the bartender didn't like him, otherwise.  \n\nCool bar, been around since oh 1947 -- it's etched in the concrete in front of the swinging front doors -- and it's class-dive, i.e. the kind of place Sinatra and his Swinging Drunks would hang out at if Las Vegas didn't have such a hold on 'em.\n\nCool pool table, too.  I honestly had no problem with hanging out here.  But then again, when I found myself outside with the bartender, and he was fumbling with his lighter, I lit his cigarette.  He looked at me cold hard in the eyes and said, \"Thank you!\"\n\nAt least he didn't tell me to stop fucking looking at him, 'cos he hated me.  Then again, had he done that, I'd be tempted to give Ha Ra five stars.", "author": "Thomas B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-02-22", "description": "Two gin & tonics on the cheap on an empty stomach, two dollars and twelve songs on the jukebox, and a tight pool table, and I'm a happy little monkey.\n\nThis place is really a pugilist's paradise from a bygone era. The boxing motif is not overwhelming, however. It feels more like it's part of the bar than tacked on like a theme restaurant. I love the jukebox! Normally, I'm a punk / country jukebox kind of guy, and my heart melts a little for some quality hip-hop, goth, or industrial, but this jukebox has soul, and scads of it! Very little \"modern\" music, just excellent selections from decades ago.\n\nI do regret that I didn't get the Carl experience, though. Will have to come back.", "author": "Paul B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-03-30", "description": "Screw writing a review about Ha-Ra, let's call a spade a spade and talk about what it's all about: CARL\n\nYes, the drinks are cheap, the juke box great, the pool table is passable and the regulars are a riot, but in the bar galaxy, Carl is, indisputably, a shining sun!\n\nHere's to the only guy I flash my boobies to for free drinks.\n \nImagine every seedy film-noir-desperate-fat-guy come to life, add a wicked sense of humor, a vocabulary that would make even a Polk Street gutter blush, street-wise smarts combined with a healthy dose of intelligence and a big, soft heart hidden behind a super-thick layer of sarcasm and you might start to get the beginning of an idea of what \"Carl\" is.\n\nYou haven't lived in bar-ville unless Carl's told you to \"go home, get lucky, get laid\", buys you a drink, won't sell you a drink, gives you money for the juke box, turns it off because he doesn't like your song selection, kicks you out and tells you he loves  you - all in the same night....\n\nCarl, I raise my glass (and usually, after drink Four, my shirt) to you!!", "author": "Tatjana G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-03-24", "description": "The Ha Ra is Carl is the Ha Ra is Carl. \nWhat can be said about the Ha Ra that hasn't already been said?\nThe drinks are strong and cheap, the decor is divey, the jukebox is jammed with classics and overall it is perfect. \nYep all that is true. But that is not what this review is about.\nThis review is of Carl, the man the myth the legend. \nHe is the perfect bartender. Heavy handed, quick with the jokes and surly as all get out. \nYou are a beautiful man Carl. Thank you for serving me liquor.", "author": "Melissa H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-17", "description": "Definitely a place I would go to for a drink. The owner is really friendly and funny. \n\nThe jukebox is good and they have a smoking red pool table! I love it! Plus, it's super close to where I live.", "author": "Miss C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-01-31", "description": "Ha-Ra, oh la la.\nWe were led here after a great dinner nearby, in hopes of finding a cantankerous codger behind the bar, but turned out he left the country.  Sounds like trouble.  He must have taken the good stuff with him.  Instead we were greeted by an amicable young fellow who knew quite a bit about the lesser known genres of the music industry.  That's a plus in my book.  (I don't have a book)\n{{{{{{{{{{{{{{{{{{Here are some details on the business:\nHappy street dwellers wandering in, getting yelled at by the bartender~\nRegular priced beers, no different prices for local brew, mass produced domestics, or european skunk~\nUnder-aged college students getting ID's rejected by the bartender (good eye, buddy!)~\nCash Only- on a sa-weet antique register~\nMixed drinks are a little more than decent~\nBANG! I must say this: Dirty taps/lines.  The kind where you get a hangover from your first sip, that kind of dirty.  Stick with something popular here, that way you know the keg is occasionally changed and the vendor should be servicing the lines periodically.  Two pours from two different brands had a horrible smell, taste, and flavor.  There are people to blame, but the bartender was so nice he replaced them. (seems like the right thing to do, yeah? Better: refund and replace)\n\nIt's weird, because it is definitely an old dive bar, yet they have made modern upgrades that kind of take some of the character and charm out of the dive category. I.E. installing huge bright plasma tv's and an internet jukebox that the bartender has a remote control for!  \"nah, I didn't like your choice of songs so SKIP!\" \nI would venture to say, this is a drunk man's hangout.  I'm not trying to be mean, at all.  There were a lot of wasted people when we got there, who looked down on their luck.  The bartender was very nice, we even randomly sat next to his wife.  There were people dressed in \"business suits\" who came in kind of drunk, asking for change for pool.  The bartender had a hard time getting payment for that guy's drinks.  \nOne guy, who was already drinking before we arrived, started a yelling match- from his barstool- with a guy outside.  That was awesome.  He finished his PBR and left quietly.  He seemed nice.", "author": "Joshua K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-02-03", "description": "A classy dive with a brickwall interior and a nice setup for some rounds of pool.  The night i was there i felt like i was watching billiards on espn cuz everyone was so fucking good.\n\nVery deceiving after you walk in u realize just how damn spacey this place is.  Like any dive loads of regulars, but this place is special enough to bring in a variety of crowds...love the old boxing snapshots around the wall.\n\nOh my god!!! - - GO TO THAI HOUSE ACROSS THE STREET!!!!", "author": "omar b."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-04-03", "description": "I walked into the HaRa one rainy night with two friends...we were the only ones there which was kinda nice.\n\nThe bartender poured us stiff drinks and told us ghost stories (whilst sucking on his asthma inhaler)\n\ngood times, I highly recommend it if you need a genuine dive bar fix.", "author": "chandra g."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-09-18", "description": "I wanted to give this place six stars, but there were several glaring problems:\n\n- Cheap drinks\n- A jukebox infused with bop and soul music\n- A cantankerous fellow behind the bar, who propositioned my female friend outright for physical relations.  So what if she is young, sassy, and basically \"asking for it\" in every conceivable way?\n\nSorry, Ha-Ra.  Get your act together.  Until then, it's a five star shame-fest on you.", "author": "Sam M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2005-08-05", "description": "Haaray for Ha-Ra!...Dive & Alive!\r\nWell, not terribly alive considering besides my table for 8, there were maybe 2 other people in the bar.\r\nI heard about Ha & Ra, the original owners, but I dont think they were there. In fact, I'm curious if they are still around, period. Anyway, our bartender was a delight. What a sweet fellow! One of those simple folk from yesteryear who lives to put smiles on faces... AND keep money in your wallet....\r\nMy VODKA-CRAN was $2.75!! \r\nThats less than 3 dolla!\r\nI almost fell off the barstool upon hearing that...and again as I write this.\r\n\r\nOur group was at Ha-Ra just for some quick drinks before attending GAMH. Before we left, the lone bartender had to step outside..not sure if it was a quick smoke or a long errand...but he just gave a shout telling people \"Don't go anywhere\", and then he left. This place is kooky, and i like it...a lot.\r\n\r\np.s.  vodka-cran was ordered after I asked for 2 differnt kinds of beer..bartender told me they both tasted bad lately. So FYI, also 5 stars if you want bad beer.", "author": "Nicole L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-09-09", "description": "The night I went to Ha-Ra was epic.  Epic in the sense that I got so drunk I don't really remember much of it.  But what I do remember is the surly, drunk bartender who started off friendly but when we started asking for drinks that he couldn't make, got a bit out of hand.\n\nUs - We want to have a shot, what can you?\nHim - Anything\nUs - Sambuca?\nHim - No.\nUs - Chambord?\nHim - Nope, don't have that.\nUs - Fernet?\nHim - No.\n\nThis went on for several rounds and the more we asked that he didn't have, the surlier he became.  I distinctly remember him stating, \"C'mon ladies, I don't have all day\".  As we looked around the bar, we failed to see anyone actually waiting for a drink. Finally we asked, what do you have?  His response, what you see.  We ended up with shots of Jameson.  After our shot he started yelling at people to get the hell out (it was 11:30 pm) and that the bar was closing. \n\nWhile I was amused by the bartender I doubt I'll go back again...but fair dos for people who enjoy it for it's small choice and small crowd!", "author": "Melanie N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-05-15", "description": "Dark, divey, stank...with a bartender who'll drink you under the table.\n\nDig it.", "author": "Ryan W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-12-11", "description": "My 2nd Bar I went to during Santacon, the place was a dive with this old dude that's the bartender. He was nice, hands shaking while pouring my vodka and he has no front teeth! ha! He made the perfect vodka tonic, and I found Santa Ruggy and Jessica there!", "author": "Karen T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-06-13", "description": "Crappiest Jack and Diet I've ever had, but Ha-Ra still gets four stars.\n\nSeriously. It was about 3-quarters Jack and one-quarter flat-ass Diet Coke. NASTY. But, when you're drinking away break-up pain, a crappy drink hits the spot, I suppose. \n\nAnd the dark, austere, brick-walled Ha-Ra is the perfect bar to numb pain in (I chose to numb mine on a gorgeous Saturday afternoon, so the dark part came in all the more handy; keep the damn sunshine OUT!). \n\nWhether it be of the break-up variety, or the job-loss variety, or any other variety, I imagine the crusty old fellas consistently slumped over at the bar have a whole slew of pains they'd be happy to grumble to you about.\n\n\"Crusty old fellas\" includes Carl, the bartender, by the way. He's serious crusty business. \n\nAnd he makes a damn fine crusty cocktail.", "author": "Lisa T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2005-07-22", "description": "Me and some folks walk into Ha-Ra at 1:30 am, and the surly ole guy, whose nose is a gin blossom like you read about looks at us and says:\n\"What bar did you get kicked out of?!!?\"\n\nFunny, too, cuz we had just gotten kicked out of some place down theblock that didnt want to stay open past 1am.\n\nGod bless that ole guy for being the coolest bartender in town.", "author": "Jon F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-06-17", "description": "Lady Pestlebottom and I came here for one brief round on Saturday night, and were treated to compliments and free shots from the infamous Carl. He delivered on everything I had expected - berating juke-box selections (and rightfully so), insulting patrons, and attempting to procure Lady Pestlebottom's telephone number. \n\nThe drinkery itself seems to have been recently re-decorated, with fresh red paint and some new-fangled lighting fixtures which detracted from the dive-bar atmosphere. But I did enjoy the old-timey boxing photographs and the painted-on bricks. \n\nCarl told us that we were \"the only people who make sense around here.\" Then he poured three shots of tequila and drank with us. Though I'm strictly a whisky man, I know better than to refuse a free drink from Carl.\n\nThere were several hipsters in the place, much to Carl's chagrin. He rolled his eyes and drank shot after shot trying to ease his pain. There were worse things yet to come, however - a group of about a dozen fools dressed as pirates invaded, and we thought poor Carl would blow his top. I feel somewhat guilty for having left at that point, but the pirates were too much for Lady Pestlebottom and I too.\n\nAnd to the pirate below I say: Carl implored somebody to end his life as a result of the pirate invasion. In jest, of course... I think. And I did not say he \"offered\" Irish Car Bombs, I said some douchebag asked for them, a request which was met with Carl's usual disdain.", "author": "Mortimer P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-08-21", "description": "The first time I went there I asked for Jameson's. They were out. I asked for Maker's. They were out. Bushmill's? Out. Finally, I asked for 'whatever whiskey you have and coke'. That was what I got. My friend had to leave her drink because there was a fly in it.\nThe next time I went the bartender gave me some money for the jukebox. I was excited and joked 'How'd you know I have great taste in music?' He replied 'No, I just wanted to see you walk'. \nNever a dull moment at the Ha-Ra...", "author": "Parisa M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-01-21", "description": "This isn't a bar you're supposed to like. It doesn't like you, probably, because you're probably a douche. Sorry, but it's true, you're probably corny and self-obsessed and the Ha-Ra will light you up for that.\n\nBut if you can chill in a dive bar with some dignity, appreciate the old days when your bartender was your friend and not your slave, you like a dirty joke and a simple drink, you might get along. Helps if you know detective novels, '50s TV, and ask first before playing the jukebox or a game of pool.\n\nThis is my bar and Carl's a friend. Because I am not a douchebag. If you are, go to hemlock - Carl is not kidding when he tells you to go to the Hemlock. Or slide next door to Whiskey's. \n\nThis is not a spot for pretense. If you're not bringing any in, stop by. Put your hat on straight and use your inside voice. And tell your girl to flirt with Carl. \n\nAnd it's not the '20s, dude, it opened in '47.", "author": "That Was A Good Drum Break .."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-08-08", "description": "I love the Ha-Ra. Every time I've ever been here, I've felt like I have the place practically to myself. No one's ever playing pool, and sometimes there are a bunch of regulars talking to the bartender, but other than that it's pretty quiet and a great dive. \n\nThere are seemingly about 10 taps, only about 4 at any given time are hooked up. The bartender is always drunk and grumbly, but he'll give me a couple bucks and ask me to play something good on the jukebox.\n\nThe jukebox, by the way, is great! If you were my friend visiting me from out of town, and you wanted to sit down and shoot the shit in a great dive, I'd take you here, no questions asked.", "author": "Heidi G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-09-18", "description": "Friend or foe?  Iono.\n\nDon't come in unless you plan on buying a drink that's for damn sure.  Drinks are cheap, but the beer tends to be flat and warm.  Or they tend to be out of anything you really want. (At least from my experience.) Best thing to do is just ask Carl to recommend.\n\nNice alternative to go when the Edinburgh Castle is too packed since it's just down the street.  Plus side being it's usually always empty which means free pool tables! \n\nGranted it's not usually my cup of tea, it's a complete dive.  Depending on the mood Carl is in, you'll most likely get a good laugh or get kicked out.  But I guess some people like that kinda thing.\n\nJust remember, you go here to drink and maybe play pool.  That's it.", "author": "Mary R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-08-29", "description": "Not only did I have fun here, but I managed to get drunk and STILL have fun. I'm the type of drunk person that gets easily bored and is prone to wander up and down the street, looking for a better place to get (more) drunk at.\n\nMy friend, a longtime Ha-Ra patron, had been telling me about this place for a while. Honestly, I was a bit unsure as to whether it would live up to all of his praise. But lo and behold, it was even better than I'd expected. There really is no better place to get drunk at in San Francisco; that I am now sure of. \n\nCarl, the legendary surly bartender was perfect. A real fixture! Not to mention he was kind enough to supply me with free shots of tequila. He is a true creepy old man, and called me \"Legs\" the whole night.  He's most certainly a womanizer, and at the end of the night he was urging my friend to \"treat me like a woman all night long.\" WOWZA! Womanizing has never been so hilarious!\n\nThat Carl; he's a real tease, lemme tell ya. He shouted LAST CALL about 4 times that night, and each time someone fell for it and left. My friend and resident Ha-Ra expert/patron of 15 years, explained to me that Carl sometimes does that to clear out the idiots.\n\nThe beer was a little warm and flat, but duh...It's a dive bar! I'm pretty sure I would have been suspicious if the beer had been perfect.", "author": "Pamela D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-29", "description": "This pace is definately your classic neighborhood dive bar. It's in the middle of the Tenderloin. The furnishings are tacky and the register looks like it was manufactured in the early 1900s. It has a pool table, of course, with a couple of dusty looking TVs blasting.  I stopped in here yesterday afternoon to take a break from passing out flyers in the neighborhood for my FUNDAYS MUNDAYS event @800 LARKIN. I had a Samuel Adams from the tap. The bar appeared to have a few of its regulars in there and a very nice and helpful bartender (an older 40s or 50s blond woman) seemed to know them very well and treat them like family. The bartender and I had a cordial conversation...especially about that really old register that the bar uses. If you happen to be in the Tenderloin on a lazy Saturday afternoon, I definately recommend stopping in for a drink.", "author": "Mike L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-07-16", "description": "This is my favorite bar I've never been into.  Every time I'm standing outside the Edinburgh Castle I just stare at it and imagine what it must be like inside.  I'm telling you guys, it's pretty awesome in my imagination.  Sounds pretty cool from what you guys say, although slightly less scary.  I sorta thought I might get stabbed in there.\n\nUpdate: This was about Hanaro.  I got mixed up.  I've still never been to Hanaro, but I have been to Ha-Ra since I wrote this and Ha-Ra is pretty dope if you want to get soooooooooo drunk.  I think that's all I gotta say.", "author": "Nick P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-01-07", "description": "Only had the one drink here. When I was ready to order my second, the bartender told me has was closing up (Saturday night, not even 9pm) to go drink next door in Whiskey Thieves. So I walked over to Whiskey Thieves and spent most of the rest of the night there. \n\nNo real chance to get an impression of this place in action as there were only 3 customers when I got in and 0 when I left.", "author": "Lennard L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-01-07", "description": "When I've gone there by myself or with a male friend the bartender was a total ass.  We played stuff on the jukebox that he didn't like and he unplugged the jukebox and wouldn't give our money back.  That sucked.\n\nOn the other hand, sometimes I go there with a group of people for a literary meeting, and when we do that he's nice to us, probably because he likes one of the females in our group.\n\nOne good point about the place is that it is almost never crowded.  Honestly, I don't know how they stay in business.", "author": "John C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-12-06", "description": "We started out here on Santacon, so I'm not sure if I loved the bar itself or the experience. But since it's just a regular dive bar, I'm leaning toward the experience. There's nothing fancy about this little joint, and sadly there wasn't even a mirror in the bathroom! However, our drinks were strong and cheap and the bartender was super nice- even though she was the only one there when it was SUPER packed. It was a nice touch when a random patron jumped behind the bar to help her out, b/c he could tell she was overloaded. That gave the place a nice homey divey feel!", "author": "Sonya D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-05-06", "description": "I used to go here a lot - I miss the ha-ra.  The star rating on this one is tricky.  When you go in - you know you will be yelled at for choosing a song the barkeep doesn't like on the jukebox, the drinks are awful, you may very well be kicked off the pool table by said barkeep, he will definitely stare inappropriately at the ladies and yet...yet....you love every minute of it.", "author": "Mac M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-04-30", "description": "Dangerously strong drinks at implausible prices. Juke box with Slayer and Justice equally represented. Pool table. Giants fanatic bartenders. \n\nAs dives go, it's really hard to top this place.", "author": "Maryann M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-04-06", "description": "Quick quiz!\n\nThe name \"Ha Ra\" refers to:\n\n1) the Egyptian god of distilleries.\n2) the sound a clown makes when he vomits.\n3) the Chinese slang term for \"wino.\"\n4) all of the above, once you've spent more than an hour slamming crazy-cheap well drinks at this TL fringe establishment.\n\nIt opens early, the only natural light enters through the split Dutch door, and you're pretty much guaranteed to leave feeling like the world became a blurry photograph between the time you entered and the time you finally abandoned your barstool. Needless to say, I'm very glad this place is only a block from my apartment. \n\nIt's got a pool table. Photos of old boxers. Crankily charming old bartenders. And drinks cheap enough that you're almost convinced they gave you the wrong change. \n\nWhat more could you want in a neighborhood hangout?", "author": "John G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-06-04", "description": "A favorite daytime drinking spot.  Good jukebox, cheap drinks, and within stumbling distance of my house  That last one is truly a must.\n\nEDIT:  Carl (Karl?) is an absolute sweetheart.  Don't believe the naysayers. \n\nFavorite Carl moment:  Listening to him getting all worked up into a tizzy about something, saying how \"they oughta bring back Hitler\".  Ridiculous, right?\n\nTwo minutes later my friend and I stumble out and Carl's all, \"You get home safe now, you hear?\"\n\nCarl is the curmudgeon of my dreams.  Also, if you wnt to stay in his good graces, don't play any goddamn Bob Dylan on the jukebox!!  Now Bille Holliday...that's something he'll like ya for.", "author": "Coco D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-11-20", "description": "Always great times here.  A sample evening:\n\nOrder a manhatten. \"Whats with all this Manhatten talk, this is San Francisco.\"  He mixes the drink and garnishes it with an olive. *Oops* grumble grumble.  Sticks his fingers in the drink tosses the olive back in the tray and plops down a cherry. \"Thatll be $3.\" Awesome.\n\nHippy friend drops a glass.  Carl: \"You damn kids! I aint your damn mother to be cleaning up after you.\"  Friend: \"Sorry man I'll clean it...\"  Carl: \"I AINT YOUR MAN!\"\n\nPretty girl walks in.  Carl: \"Hey beautifull gonna stay the night with me?\"\nGirl says hi walks across bar.  Carl, under his breath: \"Cause if you aint, you can get the fuck out\"\n\nIts like an endless joke reel in here.\n\nThe shelves are pretty bear so youve generally got to stick to whatever happens to be lying around.  The flip side is pretty much \"everything is $3\" all night.  Bartender also reserves the right to substitue Diet Coke or 7up when the Coke and Diet Coke stop coming out of the dispenser.   Or six ounce bottles for drafts when the taps get fowled up, which seems to be often.\n\nAnd when he's out of change or too drunk to make any more drinks last call usually goes something like: \"Alright Im done, all you kids get the hell outta here we're going to Whiskey Thieves.\"", "author": "Codester H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-03-20", "description": "Oh, Carl. What would this place be without you?\n\nYou just never know what the fuck Carl is going to do. Will he let you listen to the entirety of \"Sweet Virginia\" or will he turn it off because you're not paying enough attention to him?\n\nWill you be allowed to down that last smelly shot of cactus juice he gave you or will he decide to close down for the night and kick you out?\n\nOr will he nod off and, upon awakening, ask you to wash off the tables for him?\n\nWho knows. As capricious as he is, he's what makes the Ha-Ra so lovable. That and the fact that \"Sweet Virginia\"'s on the jukebox.", "author": "SheRat R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-03-04", "description": "Last night I was on a pub crawl of dive bars.\nOne of the earlier places charged me $7 for a shot of Jack Daniels and it did not come with either a shirt, an XBox 360 or two free PBR's. \n\nBut we went to the Ha Ra and that same drink is $3 which is inline with the economics of a dive.", "author": "Marcus R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-03-11", "description": "If you've nothing new to add, add nothing at all.\nRead any of the other reviews that are 4-5 stars.  They're all spot on.", "author": "Don H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-09-12", "description": "This is the ultimate in dive bars.  It's always dark and dingy in the bar, but the atmosphere is awesome. A pool table, raunchy bartender, cheap drinks, great jukebox. My idea of a fun place. I was on a really awkward date one night and the bartender broke the ice by pulling out a couple of mini glass bottles of miller genuine draft for us. He then says \"it's on the house, I have to celebrate\"\n\n\"celebrate what?\" I ask.\n\n\"I lost my virginity last night. It was with my sister, but it was really good!\"\n\n...Now that is how you break the ice between strangers.  \n\nMy other favorite moment was when I was there with a couple of friends and this homeless woman came in holding a pocket size vibrator still in packaging trying to sell it for a dollar. Man, I wish I had bought it. Then I could hang it on my wall.", "author": "Jade L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-08-09", "description": "When you're looking for a nice quiet dive bar, look no further.  I found this place with a friend once, and despite the place itself looking amazing, the drinks were really cheap, and the bartender is overly generous with them.", "author": "Neil B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-04-30", "description": "our friends from sf took us to this local, hole-in-the-wall dive bar. they raved about it during our walk to the spot, going on and on about the infamous bartender (carl, i presume), whom we missed that night cause apparently he got really drunk the night before (one friend was there to witness it all) and wasn't able to tend that evening.\n\nso, we had a substitute bartender that night who was really friendly. i asked for a white russian which she didn't know how to make, but quickly looked it up and made the drink for me. it cost $4, and tasted pretty good, so no complaints there. their drinks are about $4-5 each, which is awesome. they were having a slow night when we went though and were out of most taps, (they only had about 4 to choose from), but it doesn't seem like that happens often and none of us were bothered by it.\n\nthe place was pretty empty when we first entered; plenty of room at the bar or individual tables. there was a pool table too, and a great jukebox. according to our friend, he's inspected every jukebox in tons of bars up and down sf, and deems that this is it. for $1, you can play 5 songs. they have a great range, from \"mafia hits\" to the rolling stones to johnny cash.\n\nwithin the hour, the place filled up pretty quickly. people were sitting at the tables cause the bar was occupied (we sat at the bar, of course), and some guys started playing pool. ladies were milling around the jukebox and danced and sang to the songs.  \n\ni'm disappointed that i didn't get to experience the notorious carl, so it will be on my to-do list when i go back up! apparently, he gets drunker than most guests and is known to chuck money at customers, give your drink to someone else (and tells you about it), and asks the girl you brought with you if she fucks on the first date. probably not for the faint of heart, but great if you want to up the interestingness of your night.", "author": "Jeane C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-01-21", "description": "4 draft PBRs + 2 shots jager + miller bottle = $20\n\nOh Carl, you are too good.\n\nThe only thing was he called last call around 12:30, which was probably a good idea because he was getting too drunk to pour any more drinks.  I was about to hop over the bar and refill my own beer.  And to be honest, I don't think he would have given a damn.\n\nThis bar is great if you are in good company, and they have a pretty decent juke box.  An easy 5 stars.", "author": "A S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-08-20", "description": "Carl refuses to serve me if I am wearing my hat backwards! \n\nThis is one of my favorite watering holes. \nI like the fact that when you look at some of the old photos in the bar you can see what has and hasen't changed. Like as an example, the same TV is mounted into the wall. so another words, not much has changed!\n\nGood times await!", "author": "Jimmy S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-06", "description": "My cousins and I had just finished eating at Pearl's Burgers when we wanted to plop down for drinks and some catching up conversation.  Passed by and entered Swig a couple blocks down that totally turned me off.  Holy crap, that place is not my style.\nThankfully we passed by Ha-Ra and, while not fancy or inviting from the outside, it is a great no nonsense dive bar that really shouldn't be  intimidating for the non dive bar enthusiast.  The music's not loud and there's probably going to be more than enough open stools for you and your friends.  The bartender reminded a few of us in the party of Dwight from The Office so automatic points right there buddy.  He even was kind enough to correct me on how to pronounce Bulleit as in Bullet, not some Frenchy way as I had been used to.  But his Bulleit pours were heavy handed and the beer selection was great (Racer) and I'm normally a beer snob coming from Seattle and all.  I can't wait to plop down for some more drinks and chill atmosphere here next time I'm in town.  \nDwight you're the man.", "author": "justin c."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-04-13", "description": "Dark and Divey.  I like this kind of place. I liked it so much, it spawned a whole tour of TL bars.  Only saw Carl for a second as it was his day off, he was just dropping something off. Within the short time, he was able to pop off a couple of rude comments. \nI would not go with a large crowd. It is more of a place where you go when you don't what to run into people you know. Go with a friend or two, drink up, have fun.\nThis wonderful experience:\nSaturday 4p", "author": "Justin N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-06-09", "description": "Makers & Coke and a Whiskey Sour for $4?  Seriously?  Thankyou, but no you can't touch/see/smell my tits.\n\nBut, so long as he keeps his distance, for $4, Carl the bartender can make all the pervy comments he wants!", "author": "Katie S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-06-22", "description": "We walked in not expecting much but a good cheap bar. In return, we got prices for a 'dive' bar, but the humor from Carl more than compensated for the premium.\n\nMy friend and I agreed that this is a place you go if you want to become a regular alcoholic. The music on the jukebox consisted mostly of depressing songs people listen to DRINK.\n\nHere are some quality lines that Carl's old codger-minded head came up with while we were there. These probably don't translate well unless you were there.\n\nWe sat next to some girls he had just helped.\n\n\"Thank you ladies. Now, I want to see some nudity!\"\n\n____\n\n\"Hey girls, do you want a slipper nipple?\"\n\n*confused reaction from girls*\n\n\"Hey, say what. I'll give you a slippery nipple for a fuzzy navel!\"\n\nHe also berated people for putting on James Brown and Bob Dylan.  He actually skipped some James Brown songs my friend put in the queue.\n\nUnfortunately these are the only lines I remember. The rest of the night was a blur lost as we passed the clubs that lined the tenderloin's slowly gentrifying streets.", "author": "Anthony K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-04-05", "description": "Refilling your old bottled with less expensive liquor is a dirty trick. That is exactly what they do here and charge a premium for it. One of the worst bars ever!!  I have reported them to all authorities possible. They should be fined for such an offense.  Not even cool!!", "author": "Steve R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-12-29", "description": "Cheap, strong drinks--and a pool table!\n\nMary R. and I came here to end a Thursday night of too much drinking. We had already hit up Lush Lounge, Vertigo, Edinburgh Castle Pub, and Encore.\n\nWhat we really wanted to do was play pool. Mary said they had a pool table at Ha-Ra so off we went.\n\nShe said if we didn't order booze, the bartender would be pissed. I think this was the beer that put me over the top but it sure tasted good going down. This place is definitely a dive bar. We were the only two women there. The bartender gave us a dollar to put in the juke box. He seemed like a sweetheart to me. The juke box could use a little updating but I think the main purpose of this bar is to get drunk. A couple guys asked us if they could play pool with us. Man, we sucked.\n\nThis is one of those bars where you bring the party. I'd add this to a Polk Gulch pub crawl.", "author": "Cindy P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-01-09", "description": "On a cold winter night, this inside of this place was just as cold as the outdoors.  There's nothing inherently wrong with Ha-Ra Club.  It has a pool table, juke box, and plenty of cheap beer on tap, but it lacks any type of ambiance.  Basically, this bar is the same as a thousand other small bars throughout the country that have have plain tiled floors and brick walls.  Maybe if I had visited on a warmer day I would have added a star.", "author": "Lucius M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-02-03", "description": "I love this bar. To me it's Murio's of the TL. Granted, Carl's a bit testy if you don't have a cooch, it's all entertainment all the time in there. The 7oz beers are the shit too - usually we just order them by the 1/2 dozen and just kill 'em off one @ a time. Why more bars don't serve more of those bad boys (Delirium does) is beyond me.\r\n\r\nProbably the easiest bar to get a drink at if you're with a friend (lady) who isn't of say, legal drinking age? That is...uh, if one were to hang out with such people? I'm not. Nope. No sir.", "author": "Justin H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-03-14", "description": "Just another dive bar. My first stop of many this evening. I was not impressed with anything in this bar. The bartender was not too friendly. When I arrived there was three other people in the bar.  Two left when I was about half through my beer, so then it was me and one other man. I do not think the bartender said one word to me for this last part of my visit. Even before, he just got my order, and answered my question about where the restroom was. The beer was a little cheaper here than other places, but not enough to come here to be ignored. I do not think I will return.", "author": "Steve A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-06-28", "description": "Carl seemed in good spirits upon entering. Immediately asked how we've been, WHERE we've been even... aww.  \n\nSo, this was undoubtedly the first time i've gone to HaRa pre-swerve. I went for a couple quiet games of pool with a pal. And it was exactly what i was hoping for. We had tried to hang at Hemlock, but I just cant do it anymore. the place has lost it's charm. so...\n\nIf you want to chill with a friend or two and have an audible conversation while drinking a couple cheap beers or cocktails. This is a good choice. don't play Prince on the jukebox. Carl will slay you. \n\n4 stars \n(cuz there was no chalk for the pool table in site. i scratched on the 8 ball cuz i miscued. wack!)", "author": "jefe m."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-01-10", "description": "Too clean to be a dive and too divey to be a nice place.  I also wanted to get yelled at by the old guy, not the fat Adam Savage bartender.", "author": "Joey S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-04-29", "description": "Based on all the Yelp reviews I read about this place, when I arrived at Ha-Ra on a Tuesday night with my drinking buddy, I expected a gritty, old-world haunt, evocative of old San Francisco legend and days gone by. Instead, I found a place caked in mediocrity, gritty beyond the pale of any divey charm.\n\nWhen we walked into Ha-Ra at 7 PM on a Tuesday night, we stumbled upon a lonely bartender in an empty room. Not a soul came after us for at least another half-hour, and after downing some shots, they upped and left. Not until 9 PM, when we made our exit, did the place have a few warm bodies in sight.\n\nOur experience soured from the time we walked in. When we sat down at the counter, the bartender, an old man with a stiff walk, came and poured us some beers. I was happy to pay less than $4 for a pint, which in this city is like finding a cheap apartment in a nice neighborhood. However, when I took a sip of the stuff, I knew something was wrong. The beer tasted sulfuric, acrid, and entirely unlike what a pint of Fat Tire is supposed to taste like. While I'm normally not that confrontational, I literally could NOT take another sip after a few tastes, so I sent it back to the bartender and got some whisky instead. Later on, my friend got a Harp Ale, which had the same problem.\n\nBottom line: I'm a beer aficionado, and the the beer here sucks. If you're sticking with hard alcohol, you'll be fine, but I think it's reasonable to expect a decent tasting brew from an establishment that sells alcohol for a living.", "author": "Christian P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-01-25", "description": "First stop pearl burgers at 9:30.  2nd stop HaRa to come hang out with carl and eat the burgers. \nLove it.\nNow pass the fries dildo breath!", "author": "Matt N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-10-26", "description": "I used to live a few doors up the street.  I have only hazy memories of the place, which attests to the generosity of Carl and the others who manned the bar back then.  \n\nThe next time you're in there, look at the ceiling above the bar about halfway down it.  There should be a hole .38\" in diameter courtesy of my crazy ex-stripper/hooker/girlfriend.", "author": "R D M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-08-23", "description": "If you hate the Ha-Ra, you should have your right to drink booze revoked immediately.  Only a real boozehound can truly appreciate Drunk Carl---whose jokes about his mother might lead you to believe he's an extremely perverted incarnation of Norman Bates---and the barflies who have been coming there since the dawn of mankind.  Don't order draft beer.  The tap probably won't work.  And don't order bullshit mixed drinks.  He won't make them.   Stick with beer in bottles and whiskey.  Take your frou-frou-cocktail-drinking friends to Olive.  \n\nIf Carl takes a liking to you, particularly if you are a female, you may find him offering you shots from the pint of Cuervo he keeps in his pants pocket.  And although you may be tempted to play a couple Bob Dylan songs when you see them on the jukebox, don't do it unless you're ready to fight with Carl, which I don't recommend.", "author": "Jess H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-08-27", "description": "I made my way down to Ha RA for a birthday celebration this weekend and to my dismay, the famed Carl was....... not there. (sigh). After all the hype I was ready for my encounter with this legendary bartender. Oh well, maybe next time. And there WILL be a next time!!! \n\ndespite Carl not being there, Ha Ra was the bomb, what can I say.\n\nI don't normally like dives but this place was super chill. ice cold, to be exact. The drinks were cheap and strong. the pool table was never occupied for too long. The people were cool. the juke was on point...loving the Marvin Gaye and AL green (could use a few new joints though).  and the bartender was great.  They even let us have a full fledged pinata celebration out front. and, they were nice enough to let us use one of their brooms as the beat down stick. Luckily no one was injured in that drunken reenactment of a 3rd grade birthday party. All in all The Ha Ra club deserves a A+.\n\n See you soon Ha Ra", "author": "Lawrence A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-10-22", "description": "I like this bar cause it's not only a block away from where I live, but the owner  is very charismatic. This bar offers internet jukebox, pool table, majority of it's original infrastructure, cheap drinks, and great stories/photos back when the bar first opened. And it's got a cozy feel to it.", "author": "Kissy F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-09-05", "description": "F'ing HaRa.  There is no choice in alcohol, the taps need to be changed and the bathrooms are disgusting.  Oh well, it ain't a fern bar!  Carl is insane.  So basically that means, 5 stars. Good old HaRa. Great place to hide from the tards that are in most places.\n\nOh yeah, and Tom is obsessed with it.", "author": "Priya R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-11-30", "description": "This is the only bar in the world where people intentionally come to get harrased and put down by an old codger. Nowhere else will you every willing let yourself be called \"dildo-breath\" each and everytime you order a drink. Dive bar supreme! Drinks are cheap, but limited to what Carl will make for you. And, P.S. don't you even dare play any Johnny Cash unless you want to get thrown out.\n\nIn truth, Carl has a fluffy teddy bear side, that come out a bit, but for the most part, be prepared for some of the funniest insults, most racist jokes, and be prepared to feel the full flavor of Carl's anti-semitism/hate of New Yorkers. I am not even Jewish nor from new York, but boy oh boy was he laying it on me.\n\nGotta love this place, the only problem is that is all this bar has going for it. You can get your drunk on cheaper at other places, but no place like this will give you the sheer entertainment factor from being verbally abused.", "author": "Michael M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-06-27", "description": "I am proud to call Ha-Ra one of my favorite neighborhood dives.\n\nIf unkempt bathrooms, bipolar bartenders, and the occasional fly in your drink isn't your thing, perhaps you should go elsewhere.\n\nHa Ra doesn't claim to be anything that it's not.  Imagine your cranky but loveable grandfather running a dark, dank bar out of his basement....\n\nYeah, that's Ha-Ra.", "author": "Carla C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-02-24", "description": "This is totally divey w/  a pool table which would normally be all I need to enjoy myself, but  then they dare charge $4.25 for a basic draft beer?  Really? Where is that money going I wonder since they don't have to do much to keep the place up.  I think I will take my dive bar loot elsewhere - like the Parkside where I can get 4 beers for $4.25 (on Mondays).", "author": "Sarah T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-03-30", "description": "Cant approve of this joint.\n\nI have been here four times and the bartender has never been mean to me, but I have seen him do it to others. Sorry but I cannot condone anyone being a butt hole to a complete stranger. \n\nI also get an eerie feeling that the bar may be somewhat racist. Just look at the photos on the wall and listen to the bartender curse up a storm if Outkast or Howlin Wolf come on the jukebox. \n\nThe drinks are not expensive, but not cheap. Atmosphere is below average.\n\nIll be spending my money elsewhere.", "author": "A G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-08-26", "description": "Nice place for pool.  Sad to say they were all out of Bud Light when I got there, and nearly out of Miller Lite when I ended up there on a week night.  Electronic juke box on the far wall, but even with music on I could hear my friend from across the pool table.", "author": "Beth V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-10-02", "description": "Sunny, the weekend bartender, gets my 5 stars. She is the bartender of your dreams, rarely encountered in real life. Some may say that she is wasted on the Ha-Ra but I think the bar makes a nice setting for her. Her Bloody Mary was the best, and I mean the best, I've ever had! She is smart, funny and a great listener. My lover and I had a great time there last Sunday and are going back again today.", "author": "solell s."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-09-16", "description": "The HaRa is a blast.\n Carl is as advertised but being that I'm originally from Boston and a Red Sox fan I get a pass,  I get to enjoy the abuse heaped on others while being fairly safe.\nThe parking garage next door use to be the Desoto cab lot, that might have been the heyday of the HaRa, they opened at six then to accommodate the drivers going off shift. \nNothing like a bar full of drunk cabbies at 6 in the morning.", "author": "robert a."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-03-29", "description": "this place certainly has personality, that's for sure.  Its a shithole-in-the-wall; filthy, dark, and PERFECT.  The main reason I go is for the old cranky bartender.  Every experience with him is different.  The last time i went he was alternating between singing me a song while drunkenly pouring a glass of jameson and screaming, \"Get the fuck outta here\" to the other patrons.  theyre randomly closed, im not sure what the deal is, but ive seen the bartender at whiskey thieves, so my personal theory is that when he gets too drunk he closes and wanders next door.\n\nthis is always a stop when doing a good night of TL drinking.", "author": "CC C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-09-15", "description": "The ultimate in dive. \n\nCarl (aforementioned crotchety bartender) is a personal hero. Last time I came here with two gentlemen friends after blowing half a paycheck on one round of drinks at Bourbon & Branch (which don't get me wrong, I also love)  the place was dead, so Carl gave me money to pick 10 songs on the jukebox, then proceeded to reel off a list of songs I was not allowed to choose. I wish I could remember more to warn you against, but after a few rounds of cheap whiskey all I've got for sure is NO BOB DYLAN.\n\nA Tenderloin institution not to be missed.", "author": "Katie C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-08-29", "description": "Great place to chase off a hangover. Everyone is nice and doesnt bug you.", "author": "Kevin B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-05-12", "description": "By the time I got here last night, I was so drunk I locked myself in the bathroom and had to call my friend to come let me out. I feel like that kind of thing happens a lot here.", "author": "Maria D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-01-12", "description": "Nothing cool about a glacially slow geriatric dickhead bartender.", "author": "Adam Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-03-05", "description": "its glorious. from now on i will hop twixt ha-ra and whiskey thieves while hanging out with my degenerate hyde st. pool shark posse as it is still within the requisite 2 block radius of the 'hub.'  \n\nyou can come git yer learnin' on as they are stocked complete with trashy paperbacks, and feel transported into the ever glamorous but faded dusty crotch of yesteryear whilst perusing the various black and white boxing photographs on the walls. the old man bartender said i gave him an orgasm when i read lines of trashy smut from random novels to the crowd. i'm good at that because, you know, i do the different voices and stuff.  that was a proud moment for my people. i'm sure.", "author": "Karen K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-11-15", "description": "Carl says to me \"I got my Viagra mixed up w/my Ex-Lax. I don't know if I'm coming or going.\"\n\nIf I wasn't already married...", "author": "nic d."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-02-22", "description": "Pool table, Jameson on the rocks, and being able to snag a stool at the bar make this a great place to just hang out with friends and strangers alike.  The only weird thing is the WIDE open window in the bathroom.  Be aware.  That's all I have to say.", "author": "Ivy R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-06-27", "description": "Ha-Ra is my favorite club in the city and the only one I go to when I have something to celebrate.  It's unpretentious and easy to fit in which is a great thing in San Francisco now that it's getting stuffy and overrun by people who have too much money to spend.   I don't expect to be impressed by what bars are like in atmosphere because it's who goes there that impresses me most.", "author": "Jin W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2007-04-07", "description": "I'm sure he's not the only bartender that works there but the one that served us was sleezy, disgusting, rude and offensive. He made suggestive comments to all the women and complained about having to serve such a large group. There was maybe 8 of us. Give me a break. It's unfortunate since we all loved the bar until we had to deal with the bartender. Definitely a dive bar, the drinks are cheap, there is a jukebox and plenty of seating. Disappointing to say the least though.", "author": "Heather L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-03-26", "description": "As far as dive bar goes this one is a four stars.  If dive bars in colorful neighborhoods aren't your thing then go to Chambers around the way.  The bartender will not make cocktails unless you have a nice smile and a nice pair of twins.", "author": "Amber L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-03-29", "description": "I have been to dive bars before. This is one of them. I am not too sure where people go for drinks, but $6.00 for a Jameson is not well priced at all. Hype. People are drinking the kool-aid.", "author": "Jason S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-03-31", "description": "Four stars on the name alone. Second only to the \"Hotsy Totsy\", for cachet.", "author": "Andy R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-08-11", "description": "True story: I once went to Ha-Ra sat down and ordered a Boont, Carl went to the Boont tap and poured it for me, I paid, started drinking it and realised it was an Anchor Steam? Next I ordered a Prohibition, Carl went to the Prohibition tap and poured but it was far too light for Prohibition... because it was an Anchor Steam! A moment later my wife came over and ordered a Liberty which also ended up being an Anchor Steam.\nStory #2: I once fixed the men's room for Carl and drank for free all night.\nI wish I still lived in the Tenderloin.", "author": "Matt E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-02-05", "description": "Ok, not the cleanest place in the world.. but it served us perfectly for our needs last night! Hubby wanted to go somewhere for his birthday to just hang out, have a couple of drinks, and play some pool. So, we ended up here and that's exactly what we did! Drinks were well priced, we didn't have to deal with a crowd, and they had good music on the juke box. Still hate it when you have to pay for music at a bar, but oh well. We didn't have Carl, it was a woman bartender, and she was nice. Will probably end up back there!", "author": "Stephanie K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-06-09", "description": "I'm not sure what to say about this place.  the beer is fairly cheap, and on a saturday afternoon, the group of eight people I cruised in with were pretty much the only ones in te bar.  It was nice & quiet, and we got a few terrible games of pool in, but really, there's nothing special about this place.  I'm thinking that nobody else was here because there are better options on a saturday afternoon.", "author": "Andy G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-01-14", "description": "The bar stinks, the drinks are watered down, and Carl is a rude pr_ck.  I was in there with my boys kicking back sme barley pops and big Carl has a coughing attack and spits some junk in my pal's beer.  I had the \"gall\" to ask Carl to replace the beer and he muttered some gibberish about living hand to mouth and he can't afford it.  I almost jumped the bar.  \nYo Carl, the little hero worship on here makes me sick.  Because of you I will never step foot in that feces smelling dive again.  Go to a classy joint like the 441 Club or Cinnabar.  Let this _hithole rot.  Good job Carl.", "author": "TJ R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-10-28", "description": "Most serious dive in the world. In an awesome way. It's a perfect spot to go to after a show at GAMH and a perfect way to get wasted for super cheap.", "author": "C P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2005-06-17", "description": "I only come to the Ha-Ra every once in awhile now, but this was the place that I called my home away from home for a good few years back in the early '90s.   I was going to the Ha-Ra back when hookers lined the streets of O'Farrell, Leavenworth, Post, Jones, and Geary. Back before Carl, as a matter of fact (Fat Tommy was the main bartender when I lived in the neigborhood). Ah, those were the days (as far as I can remember them, that is).   Carl makes any visit fun with his cranky ways and his funny comments. Lately, the shelves are looking a bit barren, but they always have something you can drink while you enjoy the quirkiness that is the Ha-Ra.  The owner, Rick, is a really good guy as well.", "author": "Scott M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-15", "description": "I *heart* the crazy ass bartender of this shit hole. Just remember, if he didn't make you cry and you think he likes you, it just wasn't your turn. Cheap drinks and cheap insults. Love it.", "author": "LisaMarie C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2005-05-31", "description": "Carl is definitely on the list of best loved bartenders in SF, Lifer Class.  Genuinely divey but very friendly, decent drinks, a good TV and a playable pool table. The old men who live here are not shy with their opinion but are generally respectful to you and your lady friends.", "author": "patrick g."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-02", "description": "Yeah this place is funny. The owner/ bartender was telling me how he hates people and stuff. He was spitting out insults to everyone besides me too. I think he liked me. The decor is from the 1920s. I didn't like some duffus that was sitting next to me and talking a lot of BS. I really should have just hit him in the face. There were people dressed here in 1920s flapper style clothes. I guess this sarcastic cynical place is original for San Francisco but in Philly it would just be normal. Cool place though.", "author": "Jason W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2005-05-24", "description": "A great old dive, named for the original owners Harold and Ray. Exellent juke box, pool table just good enough for a casual game. Have a couple drinks and squint, you can see your dad sitting down at the end of the bar. Jerry's the Good Cop bartender, Carl's more curmudgeonly but a pretty girl in your party will loosen him up. Please no one go to Ha-RA though, you'll ruin it.", "author": "jim b."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-12-15", "description": "Meh -- I don't see the appeal of this place like some others do, I guess.  Judging from the autographed photographs on the wall -- this place was a boxer bar back in the 40's...and it still has that atmosphere.  Oppressively low ceiling (especially behind the bar, where your eyes are pretty much pinned to the ceiling), not much decor to speak of, not much of an alcohol selection....not much of anything.  If you're going to a bar just to drink -- why not just go to a liquor store and drink at home?  This bar was just about as entertaining.", "author": "Eugene F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-11-19", "description": "So my roommate Dave and I are all fucked up after a night of drinking at new dive bars in our neighborhood (lower TL) when we stumble into the half door and into the time warp of this place.  Apparantly, according to the older gentleman behind the bar, this place used to be a boxers bar:  A place where boxers would hang out and get drunk and the locals would come to get autographs and catch the big bouts on their television, the original of which is still in the corner of the back of the building towards the jukebox.  Anyways, the bartender told us to stay away from the tap beer, so we did, and we drank bottles of high life and reminisced and got drunker...than we stumbled to some other place and kept drinking...anyway long story short, this is a great place to hang out and catch a drink if you are drunks like us on a tl pub crawl...the end.", "author": "Francis K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-01-21", "description": "If you don't mind getting yelled at by the bartender then you will love this place. Dark out of the way hole in the wall for you and your friends to play pool in and meet the color full locals. DON\"T order anything more extravagant than a jack and coke, or you will get the wrath of Carl.", "author": "pascale p."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-05-11", "description": "Ha Ra is an awesome place.  An angry bartender (Carl) who will sexually harrass you but give you free shots if you're wearing a low cut shirt.  And the guy at the video poker machine has the BEST button on his hat \"My shit's fucked up\".  That's Ha Ra. I love Ha Ra.", "author": "Callie N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-05-02", "description": "stopped in last night and met the owner, rick, 2 jamesons and a draft for only $16.25, now that is cheap, rick is super cool too.", "author": "Pickle R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-07-26", "description": "I miss the long days & nights we used to spend at the Ha-Ra. Carl is the only bartender in town who has hands as soft as a baby's ass. Seriously, how does he do that?! Anyhow, this is a dive bar, it's not for everyone, but it draws a very fascinating mix of drunks. I've seen the Bukowski club, drunk Marina girls puking in the loo, some guy falling out of a wheelchair that I'm not sure he needed other than being half passed out. But my favorite are the old timers, they always have great stories are most of them are locals and can tell you all about SF and the times of yore. Anytime I head to a show in the TL I stop in to apologize to Carl for being so remiss in my adoration for the bar.", "author": "Colleen B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-11-19", "description": "bartender is the type of lecher i hope to be when i am old.  drunk, funny and just does not give a fuck but not as intimidating or mean as other yelpers say, unless you are a real bon-jovi looking tool.  but then i suppose there is no help for you.\n\nfour stars for experience only (i will probably be back).  drinks are horrible.", "author": "Markus B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-09-26", "description": "This is a dive bar for people who work in dive bars. I stopped by on a Friday night to get my drink on before heading back to the east bay for my shift at another dive bar. The old timer behind the bar was alright with me and gave me some great background on the joint. I don't like Miller High Life one bit but they sell them in little 7oz bottles that look like little cute treasures and I can't resist that. Good prices, not overtly dysfunctional old timers and pleasent customers (consiering the neighborhood) made my evening and time at the Ha-Ra worthwhile.", "author": "Benji T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-07-13", "description": "Ok, to be honest this review is about the Ha-Ra circa 1997: GREAT! Used to get a pint for $2.50 to $3. Guys would be snortin crank off a car key outside. One night Bill Clinton drove by (actually chauffeured by) and we cheered that b.j.-lovin' good ol' boy. Carl was cool (maybe all the hipsters/Marina flotsam has grown to annoy him over the last decade).", "author": "James B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-05-06", "description": "My first night at the Ha-Ra, Carl told me I have pretty hair. When I tried to say thank you, he told me to shut up. He then let me and my girlfriends crawl up on the bar and take pictures. Good times.", "author": "Nikki H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-05-29", "description": "Place of Carl's home cooked doughnuts!!!  This place is interesting and classic, it feels like being on a movie set and the jukebox isn't too bad either.....", "author": "Steven K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-10-31", "description": "I was looking for a quiet little bar to kill sometime before meeting a buddy for a movie on Van Ness one recent evening. This spot was perfect. With its worn tables and random photos on the wall the interior looks like it hasn't been updated since the Eisenhower Administration.  All that and a top-notch beer selection, too. The bartender said the place gets hopping after 9 p.m. but at 6 p.m. on a Thursday night, it was a restful place with no pretentions where I could sip a pint and read a magazine article in peace.", "author": "Steve O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2005-05-31", "description": "While the hipsters come and go and come again the Ha-Ra manages to stay true to itself.  It boasts one of the best signs in the city and the drinking begins well before the sign is illuminated.  If you don't feel like getting your drunk on, or if you are short on cash, the Ha-Ra serves the smaller bottles of Budweiser.  Buditos, I like to call them.", "author": "L W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2005-10-18", "description": "The Ha-Ra is a cozy little stop on the way to a show in the area. Carl's a total card, a vintage video game console collecting card. He kept waving a bag of old atari 3600's at me the last time I was in there. The regulars are usually pretty entertaining and friendly. There's always the novelty of of the baby-beers. Carl will veto your juke box selection if he disapproves. I appreciate that.", "author": "Steven C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-12-04", "description": "reminds me of a bar in south dakota i worked at one time. wood floors and bar. one lovely bartender playing the box lottery game & a jukebox. \nperfect, really.", "author": "aerin w."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-12-25", "description": "Five stars for being among the best of what it is - a genuine SF dive bar and an enduring institution. For those that confuse dive and non-dive bars, keep in mind that this is the kind of place where the bathrooms probably don't work, the bartender will serve you when he damn well pleases, and any drink with more than two ingredients will be sneered at and probably denied. You can order your fancy bullshit drinks down the street at Swig or the Ambassador. \n\nThis place generates a usually pleasant but inconsistent crowd. Most nights you'll be served by Carl (see any other review) and some nights it will be Jerry, the slower-paced day guy. There is occasionally another fill-in bartender - you'll know her when you see her. They have a great juke box, a serviceable pool table and they'll play your sports if they can get the channel. \n\nI have a lot of \"friends\" who won't come to this bar because of the haphazard bar service, limited drink selection and overall scuzzy atmosphere. But it is those deficiencies that maintain the Ha Ra's reputation as one of the least pretentious bars in San Francisco. You don't come to this bar to pick up women, impress your date, or to increase your ridiculous hipster street cred. You come to this bar to drink and relax.", "author": "Phil D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2006-12-14", "description": "Me and a buddy came in here because it was too packed at the Edinburgh Castle and we just wanted to have a chat.  It seems the place is attached to a hotel of dubious quality and ill repute.  A drunk Korean hooker in her mid to late 30's came up to us while we were talking, yelled at us about Jackie Onassis, then tried to kiss both of us on the lips while attempting to rub her crotch on my friend's knee.  That was the first and last time I went in here.  I'd go back if the hookers were gone.", "author": "matthew w."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2005-09-22", "description": "If I wanted to get yelled at, I'd go home and hang out with my dad....at least here, they have beer.", "author": "Margaux S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2007-05-01", "description": "If you like your bartender old and crotchety with nothing but insulting things to say to everyone then this is the place for you.", "author": "Corey V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-12-05", "description": "Deserted on a Monday night.  \n\nJerry was a sweet fellow.  \n\nNo scotch available at all.  \n\nStill, for authenticity, an available pool table, and a cheap jukebox, Ha-Ra would be my local watering hole if I lived in the area.\n\n**\nVisited in January 2008 on a Saturday.  The Club was jumping due to a large party observing some woman's birthday.  Carl was in character, or so I thought.  .  And then there was a misunderstanding after a round of Tequila Sunrises were ordered.   Carl refused and instead just poured shots.  One lady objected to the price, and then he ordered their whole party to \"get the fuck out.\"  Carl insisted he was serious, threatened to call the cops, and told the lady that he'd better not see her face in there again.  She responded that he was just an angry old man.  Carl said, \"I bet your dick is bigger than mine, you bitch!\"   Many bitter words were exchanged, and Carl's parting shot, after the whole party had exited, was \"Happy Birthday, cunt.\"\n\nUpgrade to five stars based on that experience.", "author": "Daniel M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-05-14", "description": "I love drinking with old school drunks. You know, those guys who have decided to become career alcoholics and have spent the better part of 25 years sitting on bar stools and b.s.-ing with the rest of the barflies. I find them amusing, but also people who have tons of stories to tell (albeit most of the stories start \"this one time, I was drinking at a bar\"). The Ha-Ra provides me with a plethora of these professional drunks who seem to be there no matter what time of day I go, and ones that are definitely willing to get into long conversations with me. I love the grouchy bartender who gives me jukebox money. I love that the jukebox has a great selection of older tunes. I love that the bar serves High Life on tap (even though I pretty much never order it). I love that I can sit at the bar reading and no one bothers me. Basically, to sum it up, I love the Ha-Ra.", "author": "Rebecca H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-07-23", "description": "i finally made it to the ol' ha-ra tonight\n\nwell let me tell you with all the heartfelt sincerity in the world that this place was the shit.\n\nI was completely hammered (from drinkin gasoline and raw eggs on my porch).  I ask for a G&T.  That guy carl who everyone desires tried to pour me a nice 3/4 to 1/4 gin vs tonic.\n\ni got so f'ing sick after that that the cops drove that motherf'er off to jail after that, and the ha ra club closed for good.\n\nHa RA!!!", "author": "Rocco B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-01-10", "description": "Thank you Ha Ra for giving me a night to remember!  Carl is the most hilarious drunk bartender in all the land.  As long as you order a bottled beer and nothing that requires sobriety and thought to make you should be good.  Interesting crowd, a bar that is stuck in time, and a bartender who is so insulting its entertaining.  It's as authentically dive-y as it gets, and I love it.", "author": "Em S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-31", "description": "You guys hype Carl up too much.  I went in expecting to be harassed, abused, and insulted.  I got nothing but a nice attitude and good conversation. My friends and I went across the street bought food, and brought it back to eat at Ha Ra.  We ordered some rounds, played whatever we wanted on the juke box, and played some pool with no complaints.  We even ordered a round of Irish Car Bombs, which they made to our liking, with no quarrels.\n\nI think this is a great local bar, where you can go and just relax and have a drink.  No nonsense, just the way I like it.", "author": "Idin K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-01-21", "description": "I'm sorry, there's just something about the Ha-Ra that draws the folks to it. I'd been there a couple of times during my stint in San Fran since we lived in apartments close by. I only have one word/name to describe this place: Carl. Here's a tip: don't order anything from the drafts. You'll send Carl into a flurry. What you order better be in a bottle and it's gonna be a pony. Other than that, it's quite the dive right on the Tender-Nob that is Geary St. Just sit there and take it all in...you're in for an experience.", "author": "Michael B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-02-19", "description": "Bartender was cool, played some pool and chilled with a bunch of friends. This was stop number 2, just after the nearby Endinburgh Castle pub, on my birthday crawl. It didn't smell, had good drinks and few people- which was good for it's size. Overall it's a great, low-key dive bar to hang out in. HA RA!", "author": "Cassy R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-11-14", "description": "I love bars in the tenderloin and have heard people rave about this bar and I just don't get it.  I've been here 5-6 times and it has always been blah.", "author": "Ed B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-21", "description": "I found myself in the TL with some old friends gracing our presence from Colorado. Knowing our past seasoned knowledge of dive bars and fun times we found ourselves in the TL. Also we found ourselves at the Ha-Ra!! Ha-Ra!!! The bartender was RAD!! I could tell he had been in the business for a while knowing the style of old fashion drinks I order. Its hard ordering from someone who isn't skilled in their profession. Anyhow I also appreciate the fact he could handle this lame patron who obviously was visiting the city without style! Thank you bar mate!! I think your name was Casey or Kevin Oopps! Sorry don't recall. Anyhow, you were fun with style and class!!", "author": "sarah k."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-02-19", "description": "I ran into the bar to meet a few friends on the whim. I was not aware the bar was CASH ONLY. I had my credit card in my hand completely visible the entire time i sat at the bar(few minutes because it was busy) I ordered a beer, card still in hand, the bartender poored it, and i went to hand her my card and she said cash only, WHY didnt she bring it up when she saw the card? blind? I told her I couldn't pay (its 2012 really lets get a card machine why don't we) and she gave me a REALLY hard time when I told her I couldn't pay, even after I apologized and didn't even SIP my beverage. I'm sorry but she should have mentioned as she saw my card on the bar waiting to hand her before I paid. They have an atm machine but it would not take my card, I had to borrow cash from a friend. The situation would have been more bearable if the bar tender wasn't a complete bitch about it. We all have bad days, I think she could have been a little nicer considering i was polite and up front off the bat. I payed her the cash when I got it 20 minutes later, didn't even touch my beer and left. Will not be going back.", "author": "Erin L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-08-12", "description": "I used to live around the corner, and this is one of my favorite bars in the city. Carl is great, and the boxing memorabilia is real- not ordered off of ebay for \"atmosphere.\" The drink prices can't be beat.", "author": "Mark H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-08-22", "description": "Oh where  to start about this dive. The bartender whom I will not name, will stir your drink with his finger. He will cuss at you for playing the Hollies, Carrianne. (sorry i like that song, and the hollies for that matter). The place is just a block away from the GAMH, to meets your peeps before the show. They have baby millers. But at the end of happy, I'd give it six stars if I could...", "author": "wayne s."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-10-24", "description": "Ha Ra is one of the better bars in the T.L. If you can go on an off night, it is a wonderful place to take a friend to catch up...nice and quiet...pool table. I gave 4 stars b/c lately, on Friday and Saturday nights, the crowd is strange.", "author": "L T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-06-19", "description": "Wow. I reviewed this place way back in 2005 and it is in dire need of an update. So, first of all, I hung out here tonight with our newly minted Seattle Yelp Community Manager, Katie, and this is by far the best Wednesday night I've had in awhile. So, after dinner at Red Box we decided to grab a few beers and talk some shop. It was pretty much dead in here save an old man with a dragon cane, a gash on his head and one black glove and a couple (?) at the end of the bar plugging money into the juke. We were chatting it up with Carl, our gracious bartender giving us obviously watered down tequila shots whilst telling us Monica Lewinsky and Michael Jackson jokes. Carl would take a minute to bark at the old man at the end of the bar and take breaks to flirt with my companion. Katie rolled with the punches and even talked about Seattle bars he almost worked in with him. The heavily tatttooed man at the end of the bar surprised me by spouting his love for KC and The Sunshine Band and even reminisced about one of the great concerts of theirs he saw. This guy going to see The Sunshine Band was about as foreign as me at a hip hop show. Soon it was just the two of us in the bar rocking out to Patsy Cline and watching a random woman come in to use the bathroom while Carl gave us his mixed up Viagra/Ex Lax jokes (he didn't know if he was coming or going... badaboom!) I've been here before shows at the GAMH, but those nights don't hold a candle to tonight, and even though Carl said he didn't give a shit if I come back (he took quite a shine to Katie) I'll definitely be back here much more often even though my experience won't be nearly as fun as this night was...", "author": "Michael E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-12-19", "description": "Let me be the first an probably the only one in all of the world to say that I love this bar. This bar is a god sent to any one who hates the fru fru cocktail lounges of the big city life. My husband frequented this bar a couple nights a week after work while we were dating. He had told me all about Carl and Jerry and how I needed to come have drinks with him as soon as I turned 21. So my first bar  was the Ha Ra Club. It has all the warmth of an ice cold beer and smells like sweaty cab drivers. I love that its dark and dank. I love the history behind it and the fact that every one for the most part is a regular. I like to go into my bars and not have to say my drink a thousand time to 4 different people. I like knowing that when I get off work I can go into a place and my drink will be ready for me as soon as the bartender sees my face. It is very true that this bar does not have a good boos selection and a Cocktail Nazi but I love Carl and my needs are simple. It is not a bar for the social scene it is a bar to go have a drink, watch sports, maybe play pool, and maybe shoot the shit with the drunks. The Ha Ra  is the anti cocktail lounge and that is something that I find charming.", "author": "Nichole S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2005-04-22", "description": "old school dive for true 'loin drinkers. seems like most of the patrons are solo, drowning their troubles in their pint glasses. feisty bartenders make getting a drink a humbling experience. this was a stop on a bar crawl that i attended once and the bartender threatened to close the bar if we didn't leave. he also wished vd on a friend of mine. very entertaining.", "author": "Dean E."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-07-14", "description": "its the HA-RA. we were here the other day blowin up M1000s out front and carl obviously wanted to have nothing to do with our childish behavior and immediately 86'd. theres nothing to review about the HA-RA, its a bar for drinking booze.", "author": "christopher a."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-02-12", "description": "A great place to do some solo drinking on a Saturday afternoon if you haven't got anything else to do.  If you order a shot of something make sure you chase it down with one of those midget beers (they carry both MGD and Hi-Life).", "author": "Joe C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-03-24", "description": "i was briefly a regular at this place, because carl thought i was james cameron, and he would give me free whiskey and ask about my upcoming movies. then he got mad at me for not coming around as often as i used to. then i stopped going altogether. but i still love it. the bombed-out bathroom is amazing too.", "author": "steven w."}
