{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-27", "description": "The food is decent here.  Not a fan of their orange chicken but how can you compare to panda Express.  Orange chicken isnt even real authentic Chinese food.  Anyways, the won ton soup and bbq pork chow mein are my favorite here.  My little advice to anyone who goes in to pick up food here should order it online using the grub hub app.  Not sure why they charge $1 for using a credit card in the restaurant but you dont get charged when paying online.  The location is small and is usually crowded with local construction workers nearby who are on lunch so I prefer to pick up and go.  Also, they're menu online needs to be updated as the prices have gone up since they were last posted.", "author": "Belle M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-07-22", "description": "It's just kind of below-average Chinese food.\n\nI eat there because I live like 2 blocks away, but each time I do I wonder why.", "author": "Ben C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-24", "description": "This place is the BEST. \n\nTLDR: \n-Free delivery + on time drop-off\n-5% cash coupon business through Eat24\n-Is your order over $40? Pick from free entrees like: Hunan chicken, chicken fried rice, chicken chow mein, and a variety of other options\n-Great prices and quality food\n\nHad have multiple delivery orders from Eat24, and will continue ordering again and again. Superb and seamless ordering experience. Group order of finger foods included: vegetarian potstickers, fried wonton skins, kung pao tofu with veg, egg rolls, hunan general chicken, and the combo appetizer plate which runs only about $11 and you get 2 of each (though not as advertised): wonton, veg egg rolls, bao meat slices, fried prawns, and potstickers. Amazing deal. With a family-style eating experience, you can get dinner delivered for under $10. Have also done chicken fried rice, lemon chicken, etc. \n\nEat24 order is always a pretty stellar experience. FREE delivery, which is often hard to come by in the City. Who doesn't love bonuses? They give you a FREE entree of Hunan General Chicken, chicken fried rice, chicken chow mein, or other coupons to choose from, example, $4 off automatically, if the order is above a certain amount, like 30-40 bucks. \n\nDelivery has consistently been on time and organized.", "author": "Alison A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-10-20", "description": "Look, if you're in the mood for some \"traditional American\" chinese food then look no further than Hai Sun. We all know Chinese restaurants don't have the highest number of stars on Yelp but, the reality is that the price to food ratio is pretty solid and the food hits the spot for one of those \"I don't feel like cooking Monday's\". Ya dig?\n\nIs the quality of food what you'd expect from a 3 star Yelp average? Yes, it's just A-OK. A couple times a year I order delivery from this place when I want a heaping pile of chow mein noodles and it's pretty good. I mean, how do you mess up chow mein? Seems pretty easy to me. In my most recent order (last week), I ordered the chicken chow mein with white meat and the mongolian chicken (also white meat). Delivered to my door for under $30 bucks and was piping hot. \n\nNot that I'd recommend this place as a \"must visit\" but, if you're on a budget and craving chinese food in the marina then it will do the trick.", "author": "Benjamin F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-24", "description": "This spot has been in the Marina for a long time. I have been walking by on Laguna for a while. I finally decided to try it today. I got the shrimp fried rice and the hot and sour soup to go and it was good. Not stellar, but Chinese food nonetheless for people who like scrappy Chinese spots like this.", "author": "Denise C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-06-24", "description": "ATTENTION: HORRIBLE CUSTOMER SERVICE, DO NOT EAT HERE !!! I took my mom here for a nice day out. I was SHOCKED about what I got myself into! When we arrived we were not greeted, instead the man gave us a HUGE ATTITUDE, like if he didn't want us there. We had barley sat down, and she came up to us a said \"WHAT DO YOU WANT??\" With the  biggest frown on her face. WHAT KIND OF SERVICE IS THAT ? \n\nI asked him politely if we can have a moment, and when he walked he said \"just to let you know I do not speak Spanish.\" English is my first language and for him to look at my skin and ASUME that I do not speak English, DISGUSTING ! \n\nI should of left, but instead I decided to order. The food is pretty good, it's sad that this is the only Chinese place around in this area. \n\nI clearly saw the DISCRIMINATION between myself and other Latin workers also eating at the time. IF YOU COME HERE BE PREPARED TO BE FACED WITH A LOT OF ATTITUDE AND DISCRIMINATION IF YOU ARE A PERSON OF COLOR.", "author": "Monica R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-30", "description": "Not sure who to blame here. Maybe both at fault. Put  order for food at 9:37pm to this place thru their website to be delivered to my address thru GruhHub. It  was charged to my credit Card.\nAs of 10:57 no sign of deliverymen. I Went to GrubHub Website to see what the problem was. Thru their chatline I was told they had no number for the order and asked me for one.\nAfter going back to my Email, I found the order number and gave it to them. They later informed me that my order had been cancelled\nto contact Hai Sun for a refund.\nI think GrubHub and Hai-Sun needs to get their act  together if they want\nto run competent delivery service.\nAt any rate, I'll order elsewhere next time.!", "author": "James H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-08-07", "description": "We ordered delivery on a Monday night and wound up waiting well over an hour++ for our food to be delivered. There were no events going on in the city like a sporting event or a game or a conference or any other reason for it to take over an hour. They didn't even tell us it was going to take more than an hour to deliver our food.They had left the containers open so that the food could breathe and wound up delivering cold food. We had to call three times to find out where our order was.  No one could tell us, they only said it was coming.", "author": "sonaz k."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-09", "description": "There's a 1 star review from 2016, I'd suggest disregarding it. I got some food there around then and never went back, until now. Back then I'd have agreed. Decided to try again, twice, and was thoroughly satisfied. Big portions and for local fare extremely palatable. Something must've changed, it looks the same but tins't.", "author": "Arthur I."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-18", "description": "After a night of maybe too much wine, greasy Chinese always hits the spot as the 'day after' hangover lunch.\n\nI work near the aquatic park, and lunch options are extremely limited.  Thankfully, I was able to hop on a bus and in 4 stops I was here.  A very hole-in-the-wall establishment, nothing fancy, nothing frilly.  Lunch specials run for about $9, the board on the wall boasts about 20 lunch options- good enough variety.\n\nI went with the Mongolian Beef, at the recommendation of many Yelp reviewers.  I was pleasantly surprised-- the food was not super oily, the beef was not dry or overcooked, and the flavors were great.  Also, the soup that came with the lunch special was nice and light.  I walked out of there not feeling too heavy or bogged down, which is rare for Chinese food!\n\nI noticed halfway through my meal that I was surrounded by lots of construction workers and old old Chinese dudes.  The place was packed and I was the only chick in the restaurant.\n\nWill update my review once I have had a chance to try other items, but I'm fairly certain Hai Sun will be in my lunch time rotation!", "author": "Clarissa P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-09-01", "description": "AVOID - WORST CHINESE IN THE CITY - just ordered for the first time at this place and it's the last time - food is worse then mediocre - my partner kept using the word \"gross\" to describe all of it - \n- egg roles - uhh\n- potstickers - all stuck together\n- chicken cashew - see picture there's three cashews and the chicken tasted like bad fish\n- wonton soup - maybe they added a can of salt to it\n- free fried rice with order over $30 - so dry you could make bricks\n\nIF YOU STILL CHOOSE TO ORDER AFTET READING ALL YHE BAD REVIEWS SHAME ON YOU - we ordered because \"seamless\" had a 4 rating for this place - will be calling them tomorrow - Yelp reviews rock should have compared here before ordering \n\nDISGUSTING", "author": "Phillip S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-13", "description": "This place had great food. I love the Mongolian beef chow mien, Combination fired rice and Cashew chicken, Everything taste pretty good. I think they deserve five stars!!", "author": "Jack L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-12", "description": "Cheap, decent Chinese food. Good for lunch because of their lunch specials. Don't expect to come here and get stellar service.", "author": "Sui N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-07-02", "description": "I ordered on Eat24 with option to pay cash\n\nWhen the delivery driver came (Asian guy driving a silver Honda Accord), he charged me $30, and I tipped him additional $10; when I got the food and went back in, I saw that on the eat24 app the cost was only $22. \n\nSo now I'm just pissed the delivery driver over charged me and I tipped him generously. Will never order from this restaurant again.", "author": "Nan L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-07-14", "description": "This place is still horrible, it smells bad, the service is bad, and the food is beyond inedible. The exterior is filthy and just smells like garbage. I would rather eat at a shoddy place in Chinatown that tastes good but doesn't look like much. This place screams Restaurant Rescue and needs a reality TV show or Gordon Ramsay to intervene.", "author": "Dave C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-26", "description": "5 stars for the potstickers, delivery and all things appetizers!!  I have no complaints about this place and order it often!  Very nice people, and very efficient service.  \nAlso check out the bbq pork appetizer and the hai sun's chicken wings- both sooo amazing!!  The chicken wings are so delicious crispy and juicy. They will also deliver you a couple of beers too! Best thing ever!", "author": "Jason S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-04", "description": "Great Mongolian Beef!\n\nAbsolutely loved it! $7.95 for a HUGE portion. We also went for the Combination Appetizers which were amazing; And loved the complimentary Wonton Soup for spending over $15 on delivery.\n\nWay too much for two people, but we made it our mission to finish it. Full of great flavors and definitely worth the cheap price!\n\nFast delivery + on GrubHub.", "author": "Steven H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-05-02", "description": "Very bad customer service.  Two times I ordered from this place, the first time was a big disappointment and I tried to give it a second chance, only to determine that I will never touch it again.\n\nThe first time, food portion size is small, cold, and definitely not tasty.  It's also far from reflecting the beautiful name they give the dish. \n\nThe second time, I ordered through the company's platform called Seamless.  Everything successfully accepted and half an hour later, the restaurant owner called to say\n\n\"We changed the delivery policy\", then he had me to call Seamless to \"figure it out\", verbatim. \n\nI am not sure what I should I make of this second time.  Whether it's just pure irresponsibility or some kind of shady business going on - why can't he cancel the order himself and have to go out of the way to make me do it.  It's the restaurant's faults regardless, even if they indeed have their policy changed, without letting everyone else know..!.   He also literally forced me to cancel an order that I didn't want to cancel and take care of the problems he created.\n\nIf you crave some Asian/Chinese dishes, do yourself a favor and skip this place. \n\nRegards,", "author": "Khoi T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-08-03", "description": "Yelp should allow no star on review.  This restaurant is nearby where my bf is so from time to time at night we order to go for quick dinner but I've decided to stop coming.  3 out of 5 times we get a bit stomach irritation if not stomachache.   The food is poor quality and greasy.   You can tell the ingredients they use aren't fresh at all.  The meat like chicken and beef have a bit of foul smell if you try the ones without deep fry or heavy sauce. The veggie is yellowish.  Sanitary is a main concern in a food establishment.    I feel like we gave fair enough chances to try this at different times and different items on menu.   Avoid if you can.", "author": "Janita s."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-08-08", "description": "Can't say much that's good. Can't say much that was bad.", "author": "Reyn J."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-02-08", "description": "Overpriced and tasteless.  Delivery was prompt, but the food was horrible.  Potstickers with absolutely no flavor, Mongolian beef with really tough meat, chow mein with nothing but noodles......and the wor wonton was broth with not very much added to it.  Never again for this place.", "author": "Tula C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-31", "description": "I had the mushroom chicken, it tasted super fresh and the vegetables were well cooked and the sauce was very good. But I did find a hair it my food.", "author": "Lovisa D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-09-26", "description": "Local San Franciscan who grew up eating Chinese food, here.  Hai Sun is pretty good for a typical Chinese take-out meal.  No bells or whistles, no high commendations - just good comfort food when I am lazy and need a fast meal.  The food is pretty standard cantonese food, and I have no complaints. \n\nFor delivery, I have learned to just order my food one hour before I want to eat it.  I assume that it will take a while, and if it comes earlier than that, then it's just a pleasant surprise.  It's a Chinese place - the customer service, as expected, is curt and blunt.  But, as long as you know that, then you shouldn't have any problems.", "author": "Jennifer Hom C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-19", "description": "This place has the best Mongolian Chow Mein! It is really good and tasty!! \nI dont mind driving all the way from San Bruno to this place for pick up order it is all worth it! Really good!", "author": "Erin G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-12-16", "description": "It was just ok! I found everything to be very salty myself. I also stopped using much salt at home so maybe it just seems saltier because of this? It was a very reasonable price so I would say give them a try if in this area e", "author": "Kirk M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-06-01", "description": "They're dishes do not come with rice.   Had i not asked we would have had our  food delivered with no rice.  Who ever heard of chinese food with no rice.  We ordered 3 dishes and the driver only gave us 2 plates and 2 forks. No knives were given and 2 whole packs od soy sauce!!  The food was not good and some of the vegetables were not cooked all the way.  I expected way better for san Francisco.  If i lived here i would never order from them again.", "author": "Joseph S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-04-17", "description": "Just ordered through Grubhub and this is by far the worst Chinese food I have ever eaten. Quality of food was poor, bland, dried out meat, overall would not recommend.", "author": "Rene W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-03-08", "description": "Terrible, absolutely terrible. Got the orange chicken and half the pieces were inedible. I ordered off of the lunch specials menu and it was suppose to come with beef fried rice(at least that's the the board made it out to seem) and the guy taking our order tried convincing me it only came with steamed rice. Never ever again will I eat here. Bye Sun", "author": "Re D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-20", "description": "I came into San Francisco a while ago to stay for two nights at a hotel. While there I got delivery from Hai Sun and ordered the Crispy Pork Chop and Wonton Soup. It was the best tasting Pork Chop and Wonton I've had in a really long time.\n\nI can't speak for the rest of the menu since I haven't tried it. But next time I came back into the city I will try more of their food.\n\nDelivery: 10/10 Very fast\nFood: 10/10\nPrice: 8/10", "author": "RekaYuki J."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-08-02", "description": "We ordered off grubhub at 2pm. One order of walnut prawns and one order of beef chow fun. Estimated delivery time was pushed back to 3:15pm, we are only 6 blocks away from the restaurant.. \n\nOver an hour has passed, and nothing, no call no food. 20mins after the estimated time, I called them. The lady tells me that she called me then changes her answer to was going to call lol. Then she told me that they ran out of chow fun, I asked why she didn't try to reach me to let me know and she just tells me to pick another dish. Telling me to pick chow mein when it is cheaper than what I had paid. I told her that and she starts talking to another employee, in Cantonese saying I'm ANNOYING for not picking another dish! Seriously? I told her I knew what she said and she's like oh I'm not talking to you, and I told her once again I SPEAK CANTONESE, then she went on and asked me to order another dish again. How is it my fault that you haven't delivered my food in over an hr and a half and didn't even bother to call me to let me know?! \n\nCustomer service is just the worst and I'm worried to even eat the food after all this! I filed a complaint to grubhub and thank god their customer service is always top notch, the employee from grubhub apologized and said it wasn't right for them to do that... Well yes they are just horrible!! Beware they will talk behind your back right on front of your face in Cantonese!!! Good thing I'm bilingual....", "author": "Tiffany L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-07-06", "description": "Really super bland tasteless Chinese food.\nTomato Egg Flower Soup - Gross texture, no flavor whatsoever.  Tossed it down the disposal.\nGreen Onion Pancakes - Rubbery and greasy, not crisp and tender like the good ones.  Am thinking they just nuked some pre-fried ones for my to go order.\nBraised Fish Fillet w/ Vegetables - Not many bland fish pieces which were unexpectedly lightly breaded.  Sauce just some cornstarchy glop.  The few bok choy pieces in it were the best part of the whole order.", "author": "Rose B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-10", "description": "Great food and a reasonable price. I love the Mongolian beef and spicy string bean chicken and  the fresh vegetables. Thanks HAI SUN", "author": "Paul L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-19", "description": "Tried delivery (and this restaurant) for the first time today and I was not disappointed! I ordered the won ton soup, salt and pepper chicken wings, and Mongolian beef chow mein. The food was flavorful and delivered faster than expected! As an added bonus, ordering through eat24, I'm getting 5% cash back. I think I've found my new go to Chinese food place!", "author": "Nancy L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-27", "description": "I ordered a Mongolian beef over rice for my lunch, the Mongolian beef taste sweet, spicy and tender, so yummy yummy, love this place", "author": "Abby T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-02", "description": "I had the scramble egg with shrimp over rice and it was delicious! It is a good amount of food that I can't finish for only $8 something. The place doesn't look as clean and nice as other food establishments in the marina, but for the taste and the price it is a good place to go.", "author": "Diana L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-03-14", "description": "They are rude barely speak English not to clean smells bad when you walk in only reason why I tried it after walking in because my cuzin said it was good not going there again", "author": "Mike J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-10-02", "description": "Good solid Chinese place for delivery in the marina if your craving it. About hour wait for food.", "author": "Riley C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-08-03", "description": "Passable but not the best Chinese around - crepes for veggie mu shi were delivered broken and fell apart when rolled up lake an enchilada. Americanized and lacking refinement compared to other neighborhood places that deliver. Fried calamari appetizer was tasty but small portion. Calamari is not expensive.", "author": "blaine s."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-03-24", "description": "I called in to order food for pick up. First they rushed me while I'm ordering, second I ask them how much my food cost so I can prep cash, they made me wait on the phone over 5 mins and they told me they don't know my price for my order. What the hell? How you run a restaurant without knowing your prices for your food??.. Will not order from them , there are plenty Chinese restaurants out there that will do my business.", "author": "Zhi N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-11-27", "description": "Awful - don't order delivery from this place.\n\nOrdered some tonight after they delivered menus to my new place and I regret doing so.\n\nThe Brown Rice had a weird taste to it - I think it may have been undercooked.\n\nThe Tomato Beef Chow Mein had really dough-ey noodles and the Potstickers were very dough-ey too.\n\nThe Prawns in the Sweet n Sour Prawns were ok - but that isn't hard to mess up.\n\nWe also got Black Mushrooms and Tender Greens and they were lackluster - not crisp and delicious.  There was a lot of the white part left on the bok choy and it was chewy.\n\nI wish I had checked Yelp before I ordered like I usually do.  I didn't think it was possible to mess up Chinese Food in SF - I was wrong.  Be forewarned!", "author": "Kimberly K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-09", "description": "This little \"hole in the wall\" had incredibly great Chinese food. It seems to be mostly a take out place, but we very much enjoyed eating there. You definitely don't have to go to Chinatown for amazing Chinese food.", "author": "Susan F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-02-19", "description": "This is a review of delivery from Hai Sun Restaurant.\n\nWhat's to like?\n1.  The Szechuan Chicken was cooked very well.  The chicken was tender.  The vegetables were fresh and crisp.  There was just the right amount of oil\n2.  Delivery minimum is low ($12)\n3.  The portion was large.\n4.  Delivery was prompt, professional and polite.\n5.  Easy to order via grubhub.com\n6.  The food was neatly packed.\n7.  The food was delivered hot.\n\nWhat's not to like?\n1.  The Szechuan Chicken, while well cooked, was very bland.  This is a dish marked \"HOT\".  It was not spicy at all heat or otherwise.\n2.  The rice was clumpy.\n3.  I requested paper plates.  They did not bring any.\n\nNote:  I must admit.  I've been under the weather.  It is possible that some of my taste buds are temporarily not working.\n\nOverall:\nThis was decent fresh Chinese food delivered promptly and professional at a pretty good price.  I would order again.  I would make a note to make the Szechuan Chicken spicier or try something else.  But I think they have earned another go around.\n\nMy fortune was:\n\"Investigate new possibilities with friends.  Now is the time!\"", "author": "Mark D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-05", "description": "I love Jenny and staff. I like to order the broccoli beef and eggplant tofu. So tasty. Eggrolls not bad. Bitter melon is good if you like that kind of thing. It's inexpensive low key and good for what you pay for. I've been coming here for years!!!", "author": "Anna W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-22", "description": "Haisun I'm back again to order my favorite food for to go! Today I got beef chow fun, not oily or greasy and an order of curry chicken. You guys made my day! I'll be back soon!", "author": "Weibin L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-07-18", "description": "Fast delivery service but the food (orange chicken and veggie chow mein) was very bland and disappointing for such basic dishes.", "author": "Brinleigh R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-07-15", "description": "RUDE and Slow. Call elsewhere. I ordered delivery one day to friends through grub hub at 601 p and the order began processing at 603p. Order was due initially by 645p then changed to 658p. 705p and no delivery. Over an hour for Chinese? I called to cancel and the person got mad at me, said he couldn't cancel cause it was made already. Then he yelled at me to go ahead and cancel.  Had food before and so so, but will not try again. Poor to no customer service.", "author": "M Y."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-08-08", "description": "You can get better orange chicken at Trader Joes, and since the delivery took 1:15 instead of 45 minutes, you can walk to Trader Joes in less time!", "author": "Andrew S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-05-07", "description": "I'm not sure how this restaurant stays in business; it is arguably one of the worst Chinese restaurants I've had the displeasure of trying (and believe me, my sample size consists of Chinese restaurants that span 4 continents). Its only redeeming quality is that is has free delivery ($12 minimum), so for those of you who don't mind (or can't tell the difference) terrible Chinese food, this is a meal option for you.\n\nOn top of all that, my roommate and I both got food poisoning from this restaurant on two separate occasions - maybe that's my bad for trying it after he did. Someone needs to inspect this kitchen.", "author": "Don W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-21", "description": "MONGOLIAN BEEF CHOW MEIN! I have never actually been inside this place since my girl always picks the food up for me, so I can't comment too much on the restaurant. What I can tell you, is that the Mongolian Beef chow mein from this place is absolutely amazing! One of my top three dishes from any Chinese restaurant (It's that good!) Order it, you will not be disappointed!", "author": "Sam A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-20", "description": "Rating a 5 for customer service! Didn't know white rice didn't come with the order and I called back very disappointed.  They sent it out immediately and it was here in 10-min.  The food was good.  Recommend making clear any sauces you want delivered with the meal.", "author": "Kandis P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-11", "description": "curry chicken, almond chicken, and Schezuan beef is very good! I recommend it :) .. aside from mongolian beef :)", "author": "Jinn C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-16", "description": "I live out of the city and bring home the food from Hai Sun and stock up for a yummy week whenever I am down there.  Everything I have tasted is hot and delicious.  My current favorites are the Hai Sun chicken wings and anything with eggplant.  But, the wor won ton is full of won tons, not just 3 or 4.  My daughter lives there and never waits as long as the estimated time.  She stocks up for the week too.", "author": "Sandy D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-10-18", "description": "ZERO Stars, People! It is beyond me that their star rating is as high as it is. In fact, I think the owners must've petitioned friends and family to up-rate them.  Who could like this miserably bland, congealed, mess?!?! \n\nI do not consider myself a food snob by any means and am not a terribly picky eater. Furthermore, having grown up in a culture reminding me to \"think of the Ethiopians\" and not waste, I'll eat just about anything... But THIS?! THIS I simply could not bare.  This is THAT BAD.  Look, it's even got me typing in all caps for crying out loud!\n\nAs another Yelper stated, it's true: You deserve better. \n\nIf you're going to indulge in a greasy take-out treat (and yes, this is indeed greasy), it should taste great, or at the very least 'OK.' Unfortunately, this is all bad.  Sad.   \n\nI've drank water and eaten from street food vendors in third world countries and been fine, but like other Yelpers mentioned, my tummy, too, began rumbling in protest just 10 minutes after trying this out.  \n\nGROSS for so many reasons! Disaster.", "author": "Cuppy C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-28", "description": "Do you LOVE green beans with black bean sauce? If so, order them here. \n\nSO GOOD.", "author": "Misha F."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-12-08", "description": "WOOOOOOOOW. We got a door tag thing saying this place was healthy Chinese food (which already I'm skeptical of, but intrigued), so my boyfriend and I ordered dinner via delivery on grubhub. Not only were they 10 minutes late to deliver our food (it took over an hour), but the guy couldn't find our address (its not hard to find at all), and the food was leaking all over everything.\n\nMy boyfriend and I were starving so despite all this we were excited and started inhaling the food. That was, until I got a good chomp of half of a raw ginger root in the garlic chicken. Now don't get me wrong - ginger in moderation is fine, but it literally made my nose hurt and my tongue go up in flames. Even after I spat it out my eyes were watering. Also- it looked like they chopped the onion into 4ths and then threw it in there. The green onions were over 4 inches long. It was like they were either too lazy to chop up the vegetables or they wanted to be perceived as healthier just because all the vegetables were basically unchopped and uncooked.\n\nThe double mushroom chicken had almost whole water chestnuts in it (which if you like those then all the power too you) but I was having to cut them up for myself. Its like they dipped all the ingredients in sauce and then expected you to chop it yourself.\n\nThe BBQ Pork Chow Mein had a funny taste to it as well. :/\n\nI seriously never write reviews, but this stuff was so effed up I had to. Its not healthier than any other Chinese place I've been to in the city so do yourself a favor and never order anything from here - order from Wok Shop Cafe instead.", "author": "Shayne I."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-21", "description": "Not bad food. Pretty authentic Hong Kong Cantonese food. Something to go for for locals and other Asians looking for Chinese food. Egg fried rice and Szechuan lamb to go for!", "author": "Melissa C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-18", "description": "I don't know why so many people are so upset with this place. I gave them a try despite the bad reviews, and I thought the food was pretty damn good. I got the Mongolian beef chow mein and kung pao chicken, and they were both very tasty, well-cooked, and fresh. The delivery estimate said 45 minutes and it came in half an hour. Even the portion sizes were pretty good. Will order again.", "author": "Andrew T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-26", "description": "Love their broccoli! Very fresh and healthy. My go-to for Chinese in SF! :)", "author": "Kelsey K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-09-27", "description": "Fast service, very friendly, but the hot and sour soup was disappointing. Something is just missing, a bit of umami. The flavor is very one noted. \n\nFried chicken wings was a true delight though! More breaded than average Chinese chicken wings, but very flaky and golden crisp. The meat was sweet and tender. So very lovsies I have no leftover!\n\nOverall, average. HnS just broke the star the wings got.", "author": "Fiona S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-22", "description": "I was very impressed with Hai Sun! The food was delicious, hot, fresh and delivered on time. We ordered the Mongolian Beef, Sweet & Sour Chicken and Mu Shu Vegetable and they did not disappoint. Defiantly healthier in terms of how they prepare the food. I didn't feel all gross and sluggish after like most oily Chinese food does. This place makes the list as one of my new go-to take-out places!", "author": "Katelyn S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-14", "description": "Reviewing a Chinese restaurant in this town is a formidable task. The range of reviews were quite startling, but as a new resident in the neighborhood the regional focus (Szechuan is my favorite) and cool walkable location made me try it. General Tso's chicken is a litmus test - hot, balanced spice + citrus, excellent rice. This place and my Netflix queue will be very complimentary.", "author": "Christopher F."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-04-11", "description": "Umm , can I give zero stars?!\n\nDo not order take out from this place! It's disgusting and dirty! Even saw a roach crawling around. Place needs to be reported to the Dept. of Public Health AGAIN... Seriously !\n\nIf you don't believe me read the routine inspections that have occurred for this place since 8/2003! DISGUSTING.. \n\nhttp://sf.everyblock.com/restaurant-inspections/may26-routine-inspection-hai-sun-restaurant-3702504/\n\nhttp://sf.everyblock.com/restaurant-inspections/feb02-routine-inspection-\nhai-sun-restaurant-4766185/\n\nand on and on....", "author": "Lisette E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-08-08", "description": "Great food and a great time as I stumble in with 12 friends in search of a good feast, we came to the right spot. Jenny was nothing but generous and nice as she single handedly took orders from 13 undecided 20-somethings. \n\nThe chow mein was great, she even made a special chicken/beef combo for me. The mu shu was quite grand - although the pancakes were thin so I'd double up next time. My friends also enjoyed the won ton soup (the hot and sour soup was ok) and you can never go wrong with potstickers... Duh.\n\nThey didn't have enough beer in the small joint so they actually went out and bought us some! That is service if you ask me. All in all a great meal. I will be returning in the near future!", "author": "Lauren O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-08", "description": "ordered from grub hub, very pleased w delivery time and good.\nhot and sour soup was great and everything else was good too, except for Generals Chicken... that was mediocre", "author": "Alex A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-03", "description": "My friend and I were craving chinese food and decided to order take out from this place the other day because we saw it had free delivery. Delivery took about 30 minutes. I was completely won over by their mongolian beef, it was really tender and flavorful. The beef chow fun was decent, it tasted a little burnt, but I guess it was well worth the price. We ordered a lot so we got a free dish which was pretty awesome. Bonus star for that. Overall, pretty good food, price and service. I look forward to trying their other stuff in the future!", "author": "Cindy L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-20", "description": "Its a nice little chineese restaurant ...great food;   The service was impeccable and sincere. Food was no msg and low fat. Highly recommended to try it. fast delivery", "author": "Cc M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-12-30", "description": "Arrrgghh.. \n\nI had a nasty craving for Chinese today...but I have been working out so hard..didn't want to sabotage by eating crap. \n\nI saw on their menu that \"most dishes are prepared with little or no oil\". \n\nI called and place my order. During my call, I even made a special request for \"dry pan\", asking for little or no oil in my dishes. \n\n30 minutes later, my delivery showed up at my door..a brown paper bag with grease seeping out of the bottom... \n\nI take partial responsibility for being such an idiot thinking there was such a thing as \"healthy Chinese delivery\", I blame them for false advertising and over promising...", "author": "Mimi T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-10-28", "description": "2 stars for the mapo tofu and timely home delivery of HOT food. \n\nMinus 3 for bland tasteless chow mein and shrimp fried rice. \n\nMr. Chows blows this place out of the water! LOL", "author": "Lily M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-31", "description": "I was having one of those days where getting off of the sofa simply was not an option so I grabbed my laptop and went to work searching out a Chinese restaurant that delivers to my neighborhood. After consulting Yelp, Grubhub and Menupages... Hai Sun it was!\n\nI went with the Szechuan Dinner for 2 (Yes I did have a friend there to share it with me)\nThe Szechuan Dinner comes with: Hot & Sour Soup, Pot Stickers, Kung Pao Chicken, Mongolian Beef & Steamed Rice\n\nThe Mongolian Beef was the highlight of the meal with the Hot and Sour Soup in a close second. The entire meal was fresh and very flavorful. \n\nThis is without a doubt my new go to spot for Chinese Delivery!", "author": "Thel D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-08-14", "description": "Its serves its purpose. This is for the Delivery service only. \n\nYou really can't expect much and you really can't compare it to an outstanding take out Chinese place. Why? because there aren't any that is really that great. \n\nThe food is delivered quickly and the taste is average. Nothing I would want to order nor crave again. I guess their best dish would probably be their chicken wing special. You do get a free order of chow mein or fried rice when ordering over 25 bucks, free hunan general chicken or beef broccoli with 40 bucks or more. They really don't ask you for the coupon so order away!!!!", "author": "jason g."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-14", "description": "The reviews about this place confuse me. I almost wonder whether or not they have changed ownership in the past year or two. I have not been there but they have a 80+ health rating, so I won't address claims that the place is filthy. I will however say that in the two times I have order take out from them the food was pretty good. \nThe first time I order from them I got Mongolian Beef and Pork Fried Rice. Both were seriously tasty. The Beef was tender and spicy, the rice was tasty and not greasy. The second time I ordered the house chow mein and kung pao chicken. These were not nearly as delicious as the items I ordered the first time around, but I would say that they are on par with other Chinese delivery options.\nAll in all the food is average to pretty good and free delivery on orders of $12 or more. Not bad.", "author": "Jack S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-09-02", "description": "My first review ever, inspired by the undercooked chicken that has me nauseated and sweating since that meal last night. Food poisoning is the word of the day.\n\nTaste: somewhere between okay and bad. My taste buds are very insensitive and restaurants can get away with bad food with me, but even I was not impressed.\nAmbiance: This place is not set up as a dine-in place. Even the door is difficult to open, which really should keep out the unsuspecting. It is not a clean place either.\n\nI eat at street vendors all the time, and have never gotten sick from them. Stay away, unless you are looking to get sick.", "author": "Istvan J."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-10-14", "description": "***** Negative 5 billion stars *****\n\nI wish I'd yelped first...seems like everyone else already knew it's a slumhole.\n\nMy Lesson Learned: If the shop says \"delivery delivery delivery, to go, delivery delivery\" on the outside, it's probably a bad idea to enter.\n\nHai Sun's moo shu has colonized my digestive tract, my entire body remains unhappy two days later...\n\nI also saw a young male worker do an uncovered sneeze right in front of a big tray of iceberg lettuce (I can't fathom what a tray of lettuce was doing in the front anyway)...which means the only thing less nourishing than iceberg lettuce is dirrrty iceberg lettuce, ewww!\n\nWith the petty small hoisin sauce, the 4 tiny brittle pancakes, and my repeated requests just to get chopsticks, the $9 to go cost was just outrageous. \n\nI wondered where the meat was - I thought it was all just filler (although I didn't notice any water chestnuts, which, other than whatever else that's hopefully run its course, would be my #1 food nemesis).\n\nAnd no fortune cookie?? No memento by which I might remember you??\n\nWhen I'd gone into the dimly lighted, poorly cleaned place for pick up, I tried to read the inspection card in the back left corner, but couldn't make it out without obvious prying ... and it was so dark I wouldn't have been able to read it anyway! Turns out some other folks here did read it - and I totally believe that the card reads bad bad bad.\n\nHai Sun = Bad News, the newspaper version of which can be read in the washroom during recovery.", "author": "Cam M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-19", "description": "I got the pot stickers, Mongolian beef, egg rolls, and White rice just yesterday, and figured that i had to finally review this place. Simple, cheap, amazing!\n\nI literally live across the street from this place, and although it's not as good as my favorite Chinese restaurant, it is a close second.\n\n4 stars because their hot and sour soup is just ok, everything else that I've had is amazing", "author": "Brian K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-12-29", "description": "Lesson learned: Before embarking on a cross town food adventure on a cold holiday week, call ahead. Coming all the way from the mission I discovered:\n\nDish/Acre Cafe in the Presidio: Closed.\n\nCook's & Company in Fort Mason: Closed.\n\nCafe GoLo in the Marina. Closed.\n\nLame.\n\nBut I should have called.\n\nFortunately, the one other spot that had been sticking in my mind since seeing a few meat/fruit combo offerings was Hai Sun. And indeed they were open.\n\nIt was love at first sight seeing \"healthy and nonfat cooking\" written all over the menu. I was a bit skeptical, but sure enough after some back and forth to clarify what I was asking they steamed up a really good plate of chicken and mango. There was a few sliced veggies included, an unexpected bonus, and paying an extra $1 for white meat was not a big deal. For less than $8 I had enough food to feed me and someone in need down the corner.\n\nIt was a lesson learned, but all ended well.", "author": "Jason B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-12-23", "description": "Avoid At All Costs!\n\nI ate there last night, and I can easily say, it was the worst Chinese food I have ever had. This is pretty hard since I've eaten at places that have made me sick and that are probably unsafe.\n\nI called in my order and they told me it would be 10 minutes. I went there in 15, took it back to my friend's apartment, opened it up and thought \"hmm, it smells great!\". I ordered Orange Chicken & Beef w/Broccoli.\n\nThe Orange Chicken was stuck in the box, as one large scary glob of food. After eating it and the Beef, I realized, they probably made the food at least an hour ago and just scooped it into boxes when ordered. Not even Panda Express is this bad. The food was soggy, bland and terrible.\n\nThe Orange Chicken didn't taste like Orange or Chicken. It was mush.\n\nThe beef was so stringy I felt like I was eating gum.\n\nAnd to cap it all off, they're not  very friendly.\n\nI would NEVER eat here again. It's a miracle I didn't get sick.", "author": "Mr. A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-12-17", "description": "I debated between two and three stars, finally went with two because \"meh.  I've experienced better\" describes my experience better than \"A-ok.\"\n\nSo I live in the neighborhood and walk past this place all the time with my dog.  Years ago (like 10 years ago) I would occasionally get takeout here, and I remember it being pretty good.  But frankly the place looks so run-down (on the outside, not the inside) that I was a bit turned off and I stopped going there.\n\nLast night I thought I might be getting a cold and as I was walking past with my dog I thought \"I really want some piping hot broth\" so I stopped in for takeout. \n\nThe first thing I saw when I walked in was a bunch of long green beans lying out on a table, with a plastic bag next to them.  Obviously somebody was prepping them for cooking, snapping the ends off.  But seriously - they were LYING OUT ON A TABLE.  Not on a plate, not in a bowl, the food was in direct contact with the table where, possibly, all day long customers had been sitting, putting their dirty napkins on that same surface, putting their dirty hands on that same surface.  And now there's FOOD lying out on it?\n\nAnyway, I went ahead and ordered. Won-ton soup, eggrolls, and Mongolian beef.\n\nThe service is very fast and the food was piping hot.  The won-ton soup was pretty good.  The eggrolls were decent - a bit greasy for my taste, and only three of them, but I liked them.\n\nThe big disappointment was the Mongolian beef.  First, it's 80% onions.  A few green onions and then mostly slices of regular bulb onions.  I'm not a fan of a dish that consists mostly of stir-fried onion slices, but if the meat had been good I would have been happy enough.  At first glance the meat looked good - thinly sliced and tender.  But on biting into it, I realized this was VERY cheap meat and it was filled with connective tissue, so despite looking tender and moist, I actually had to chew and chew and chew to break it into small enough pieces to swallow.  And, nothing in this dish had any flavor - if they use herbs or seasoning, I couldn't tell.\n\nSo, I'm thinking it'll be another 10 years before I go back.  That's unfortunate because it's so convenient and I would become a regular if their hygiene standards were higher, and if the food were better.", "author": "Alexandra D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-07-07", "description": "BOOOOO!  BOOOOOO!  GET OFF THE STAGE!!!!\n\nIt really doesn't matter if it's \"healthier\" if you don't know how to cook the food.  This was horrible.  \n\nOrdered from them after getting a flier.  So sorry I did when there a couple really good places I order from regularly.  Got two combos.  Brown rice was fine (it's pretty sad when that's the standout dish).  The hot and sour soup was okay.  It actually did appear to be \"healthier\", as it wasn't as viscous as hot and sour tends to be, which kinda freaks me out.  It also wasn't as GOOD as it usually is and was still way salty.  Egg rolls, no thanks, yuck.  Entrees - nasty.  Jade scallops and veggies was terrrrrrible!  The veggies were SO, SO, SO overcooked.  Snow peas disintegrated in your mouth....yet the string stuck around!  Clean your snow peas before serving them, dummies!  Its called food prep!  The \"baby\" corn was so weird!  It was more like adolescent corn, with a circumference about the size of a quarter.  The cob part was not tender like its supposed to be, i debated whether i should pick them up and nibble the kernels off.  BBQ pork and veg was apparently a little better, yet the veg was still a mushy mess.  Threw away the leftovers.\n\nThe most unacceptable bit tho was that we were told 45 minutes for delivery.  After an hour and 15 minutes I called and was just told the driver was coming and they were \"really busy today\".  No apology by phone or delivery guy.  An hour and a half is too long to wait for crappy Chinese food that adds insult to injury by withholding fortune cookies.\n\nI hate this place.", "author": "Truthie M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-06", "description": "Food is great!!!  Small portions but very tasty food. This is our second time ordering from them. They're always on time. Loved ordering online too. Hai Sun was my birthday dinner tonight. :-).", "author": "Mia B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-07", "description": "Good, solid Chinese takeout or delivery. I LOVE LOVE LOVE the vegetarian pot stickers. Also, the pineapple fried rice is a must-have. Truly amazing. \n\nI also appreciate that they aren't very greasy and tend to be light on the oil. Although anyone who thinks this is a healthy dinner is crazy. \n\nIf you plan to takeout, I suggest calling ahead. Although they are technically a restaurant, there is never anyone in the dining room. Once I showed up without calling and thought I would just order and wait for my grub to be cooked up. After ordering, I sat at one of the tables in an empty dining room to wait and I felt like I was committing a home invasion. The people working behind the register and the delivery drivers who came and went looked at me like my waiting there was inappropriate and making them uncomfortable. Weird. I just decided to engage in some intimacy with my smart phone. \n\nThat said, good food and fast service for delivery. Solid.", "author": "Mamie R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-02-15", "description": "This review is for delivery only.  We ordered delivery on a sunday night and werent super impressed. we got roast pork chow mein and mongolian beef.  the prices are decent i guess but the food was only ok and delivery was slow.  everything was kinda greasy and the mongolian beef was still pretty spicy despite requesting to make it mild.  oh and i ordered brown rice and paid extra for it but they had none left and just gave me white rice without even asking if i wanted it.", "author": "Lisa C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-24", "description": "Wow! So yummy I am Oder the salt & pepper chicken wings and hot & sour soup the tasty so good and yummy. I love so much. Next week I would like to come again and try the new food", "author": "Kris F."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-09-28", "description": "Not the best Chinese cuisine.  As a reference point I would rate Panda Express higher.", "author": "Allan M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-07", "description": "It is best if you get delivery from this place the actual place is not very well suited for sit in dinner. However the food is delicious and good. I had them deliver some chow mein and Kung Pao chicken and for an extra $2 you can have all white meat it was super yummy. My new place for delivery :)", "author": "Veronica G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-08-27", "description": "Never again.... Just got a delivery and the driver didn't have any change. Told me he only had $20s. Who delivers food and doesn't bring some singles. What a SCAM!!!", "author": "John T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-10-11", "description": "I had the Wor Won Ton Soup ($6.25). \n\nIt tasted fine.\n\nI suggest you eat this if you are fascinated by your bathroom floor and enjoy hugging your toilet for at least 12 hours.\n\nOVERALL: Inexpensive and tastes fine. But, the repercussions are explosive.", "author": "Liz K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-08-07", "description": "In case you didn't know, eating pizza and fried mozzarella sticks at 3 a.m. on a regular basis will, indeed, cause some...er...changes to take place in the belly, butt, and boob regions. Lately, I don't particularly care but there must come a time when the late-night fat fest ends and responsible, health-conscious decisions start making appearances. This usually occurs when I can no longer button even my fattest fat-day pants.\n\nIn any event, last night was my night for making better choices. We ordered food at 9:30 which, in the Western Addition, means you have two options: pizza or Chinese. Hai Sun's menu notes that they cook using minimal or no oil and that they specialize in low-fat/no-fat Chinese food. Yippee! Just what my waistline was looking for!\n\nThey deliver until 10 p.m. We ordered at 9:50. Our food was there almost as soon as we hung up the phone. Seriously. About 20 minutes later, the doorbell was ringing. Beat that, pizza people! \n\nWe ordered mu shu vegetables, string beans in black bean sauce, and sweet and sour chicken.  The mu shu was outrageously light and delicious without the faintest trace of oil. The accompanying pancakes were dry on arrival but I don't like those anyway. The string beans were good and not at all spicy as the menu had suggested (which makes me think that Hai Sun's \"spicy\" is actually pretty mild). The sweet and sour chicken was VERY sweet and sour but not so chicken-y. Mostly breading. I'd ask for the all-white-meat option next time and stick to something unbreaded. \n\nI am looking forward to getting to know Hai Sun better. They're pretty much the only place I can turn to for delivery without a side of high cholesterol. Very reasonable, too. I think we got all of that for around $25. It was especially delicious at 4 a.m. when someone's phone woke me up and I couldn't fall back asleep. It was an awfully romantic sight: Chinese food eaten in the dark, out of the carton, by the light of the refrigerator...DELICIOUS!", "author": "Autumn K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-01-07", "description": "Dear Awesome Girlfriend,\n\nI'm sorry for stealing a disproportionate amount of your Mongolian Beef after you bought us dinner delivery on a lazy Sunday night. I like Cashews! I thought my love for them would pay off and you would be like \"OMG you're so awesome this is the best Chinese food dish I've ever had, you are so great blah blah blah...\", but alas the Cashew Nut Chicken kinda sucked. \n\nWhile the Mongolian Beef was flavorful & slightly spicy, the Cashew Nut Chicken was incredibly bland. The only upside was the lots o' cashews in the dish.\n\nSo...next time let's just order double Mongolian Beef & I won't have to return the portion I steal to its rightful owner.\n\nhugs and kisses,\nThe Mongolian Beef Stealing Boyfriend\n\nps - Nice work, doing your research on Yelp before ordering.", "author": "matt m."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-10-26", "description": "In a city like San Francisco, how is it possible to get bad Chinese??? I'm truly at a loss for words!!\n\nWow, talk about flavorless, colorless and bland!  And it's not like we ordered extravagant meal choices!  Girlfriends and I were planning on ordering greasy, yummy chinese while having a scary movie fest this weekend and we were soooo disappointed!  How do you mess up chicken chow mein and shrimp fried rice?  We would have been better off going to panda express! ....(very annoyed)", "author": "Candice M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-01-22", "description": "Im giving a generous 2 stars...\n\nOne for quick friendly delivery, and one for mu-shu chicken.\n\nother than that... no bueno. don't let the fancy menu fool you....\n\nThe hot & sour soup was watery with a funny aftertaste\n\nThe white meat orange chicken was bland with a mushy coating. inedible.\n\nThe foil chicken was o.k.\n\nIm glad the free chowmein was free.... cuz shit was gross....\n\nnevermind..I'm taking off one star because there were no fortune cookies, chopsticks or napkins.\n\nThe search for decent chinese delivery continues....", "author": "Karlee D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-08-07", "description": "Hai Sun boasts chinese food made with little or no oil. They took the trouble to leave a menu on my apartment gate at some point and they have things besides sweet & sour pork and General Tso's chicken, so they won our business. \n\nThe mushu vegetables were the real standout; flavorful and not greasy in the least, though I don't think anyone has yet found a way to transport the pancakes without having them dry out.  The string beans in black bean sauce also have my hearty recommendation; kind of al dente, listed as spicy on the menu but pretty mild in actuality.\n\nThe sweet & sour chicken was the only disappointment. I ordered it mainly because I wanted some protein and I'm white, and I feel kind of bad for my companion because it was my idea. Not really greasy, but sort of doughy and heavy on sauce. \n\nWhen we ordered they said it would be 35 minutes; it showed up in around 20, and I live a fair ways from where they are. \n\nI'm a little puzzled by the local photo for this business; Our delivery driver sort of looked like that guy though, so maybe it's him.", "author": "matthew r."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-01-14", "description": "Not bad.  Not bad at all.  The Won Ton Soup is a rejuvenating elixir with a delicious broth and tender baby bok choy.  Always ask for all white meat when you get a chicken dish - so worth the extra $2.00.  The veggie dishes are pretty good - fresh and still snappy.\r\n\r\n\"Happy Family\" with veggies is excellent.", "author": "Mokirobinson M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-07-20", "description": "I have wanted to tell you about this place for forever.\n\nSince having moved to the Bay Area, I have long sought THE take-out/delivery experience. A million trips to GrubHub.com later, and I think I have finally found it. So here it is: Hai Sun.\n\n(Please note that I have never set foot into Hai Sun, as that would defy everything I believe about delivery service and me not leaving my sofa.)\n\nHai Sun advertises on the front of the menu that they are \"None Fat / Low Fat Chinese Cuisine.\"  When they cook, they steam rather than fry, and they avoid using oil. The vegetables taste really fresh. It's a little bit like the crappy Chinese delivery you know you already love, but healthier, tastier, quality-er, and at cheap-o delivery prices.\n\nThere's something for everyone on Hai Sun's menu. My friend always gets the Happy Family. I want to have babies with their Mango Chicken, although I recently learned that the Mu Shu there is what is truly, completely unstoppable. It's the tastiest Mu Shu I've ever had, and if the pancakes didn't fall apart so much, it would be so, so perfect. The steamed Gyoza are pitch-perfect. Sometimes the potstickers from other restaurants turn out too limp, or too brown, but Hai Sun's are just right. They are masterful! The foil-wrapped chicken appetizer must be tasted to be believed. The Crab Puffs, Hai Sun's take on rangoon, are also really delicious (although, one night, it was very much a \"miss\").\n\nOrdering from Hai Sun is fast and easy, and when you do, you should request that all your chicken dishes come with white meat--I read that once in another review, and he was right, because it'll improve the quality of your food substantially. You can also order beer, because Hai Sun is full-service and awesome.\n\nHere's what not to do: NEVER ask for something \"less spicy.\" I did that when I ordered the Hunan General Chicken, and what I ended up with was perfectly inedible. It was the worst food experience I've ever had, and to tell you the truth, I blame myself. I should never have offered direction when none was needed. Hai Sun! Forgive me!\n\nHai Sun is friendly and fast, and for me, my food always comes in thirty-five minutes or less. It comes in these really cool, sturdy, Chinese take-out boxes that are microwave-safe. I always thinking about rinsing a box out and keeping it, because they're so cute, but I guess that would be silly.\n\nIn the end, and especially if you have guests who want to eat family-style from a bunch of boxes all over your living room, Hai Sun makes tummies happy. My mom visited me and we ordered Hai Sun delivery, and she couldn't believe how delicious. There's always enough food for me to get two meals out of a single serving. Mmm! Hai Sun, I love you.", "author": "Jenn X."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-09-29", "description": "It's one of those restaurants I shouldn't bother to review since it's not good enough to tell other people about and it's not bad enough to slam. It's the Walgreen's of Chinese restaurants. The food--it's OK, you eat it, you won't get sick, but you don't think about going back since there are too many good Chinese restaurants in town.\n\nhttp://sanfrancisco.menupages.com/restaurantdetails.asp?areaid=0&restaurantid=7586&neighborhoodid=62&cuisineid=0\n\nWho would go out of their way to go to this restaurant?  It's a neighborhood dive.  \n\nWe had the \"Seafood Dinner\" $13.95 per person for three.\n\nSeafood Tofu Soup -- An unbelievable amount of seafood in the soup.  Very generous.  Too bad it was bland.\n\nDeep Fried Prawns -- I give the restaurant one thing: the fried prawns weren't greasy.\n\nPrawns with Broccoli -- Those prawns looked scary.  The dish looked like it was doused with snot.  It too was bland.\n\nKung Pao Scallops -- The scallops were delicate, but the dish was salty and not hot/spicy.  It had no punch.  They didn't use the chili peppers that most restaurants use in Kung Pao.\n\nSweet and Sour Fish -- The fish pieces were gummy and neither sweet nor sour.  It was a little sweet.  It was a little sour.  It was kind of vague.\n\nOf course the potstickers are \"good,\" they came out of a box. We saw them take it out of a sealed box out of the freezer, which of course is in the back of the dining room--in plain view.  They're bought them in bulk.  All it takes for these potstickers to be \"good\" is to not burn them.  (Most of the Chinese restaurants buy them because it is too time consuming to make-- like in an American-style restaurant, the puff pastries used in Lobster bisque is bought 99.9% of the time, even in the fanciest restaurants).\n\nThe restaurant cooks like my mother cooks... well, not quite that bad. It's obvious that somebody's mother was cooking.\n\nDuring the peak hours (dinner time), the family (cook, the wait people, the bus people, the dish washer, and the delivery folks--all one family) was eating dinner.  What does that say about a restaurant... how busy can it be if they have time to eat dinner... a communal dinner no less.  They were having dinner the whole time we were having dinner! We were the only other people having dinner. (6:00-7:30pm on a Thursday night.)", "author": "Priscilla L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-08-17", "description": "I have no clue why I did it but I did order a delivery, humble advice don't do it to yourself, you deserve better", "author": "Sumit G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-03-25", "description": "Ordered from them after receiving a flyer. Close by so thought it would be fast. Food did come fast...but it was almost inedible. Crab cheese puffs had thick stale dough. Almond chicken was almost all bok choy (that tasted like it had freezer burn), with a few small bits of fatty chicken and a handful of stale uncooked almonds thrown in. Black Mushrooms and Tender Greens had maybe 3 mushrooms and more of the freezer burned bok choy. Would give no stars if I could.", "author": "Nancy D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-10-23", "description": "Some of the better Chinese delivery I've had. Still not as great as many of the Chinese restaurants I frequent, so I'll never be a dine-in customer, but really hits the spot for those late-night cravings.\n\nThe chicken is always tender and not too fatty. The vegetables could be a little crisper, but I'm picky. My favorites include the crispy beef (the potato starch batter must be half MSG or something, it tastes so good and salty, and the thickly sweet sauce has just the right amount of peppery kick) and the BBQ pork jim mein (crispy jim mein = crispy hong kong style chow mein; I can discern no difference between the two). They do a great job with frying in general, but the saucy stir fried items are always tasty, too.", "author": "Veronica L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-08-25", "description": "This is the place that I order chinese food from, every time. I only realized recently that this is also the place that I used to order from a lot when I was in highschool, over 10 years ago, so I guess I must like them :)\n\nThe food is good, of consistent quality, and they have some neat dishes.\n\nMy favorite is the spicy crispy beef, and the dry fried green beans are great too. They're usually pretty fast, and they deliver to my neighborhood from the Marina so its a win for me all around.", "author": "Tom S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-09", "description": "Great food! Ordered in, food was great, delivery was cheap. Don't usually post reviews but after seeing the disparity in the reviews here I figured I'd add to the positive ones. We got won ton soup- very good, BBQ pork appetizer - average, green beans with black bean sauce- excellent and chicken with eggplant. All great food and very happy with the quick delivery, easy understanding ordering on the phone, and quality of food. Vegetables were fresh and everything was not too salty or to much MSG like other places.", "author": "Lisa F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-11-18", "description": "Hai Sun was our restaurant of choice for a recent adventure my friends and I call \"The Chicken Project.\" The Chicken Project is, in the words of my boyfriend, \"not for the weak of stomach, faint of heart, or vegetarians.\" It consists of ordering every item on the chicken menu at any given Chinese restaurant. At Hai Sun this consisted of 22 dishes from Poultry + 4 from the Specialty menu, leaving out chicken noodle and rice dishes. Hai Sun was very good natured about the whole thing and you can tell by the shopping bag full of fortune cookies they delivered how many people they thought were eating this food (for the record there were 11). \n\nI'm taking off one star b/c the food is a bit on the too salty side but free, fast delivery + inexpensive food = winner.", "author": "Jessica B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-09-27", "description": "We ordered and picked up dinner from here.  The happy family with veggies was yummy.  The only problem I had was the beef had a really chewy texture and I couldn't tell if it was just fatty meat or they coated the beef with something.  It's not overly salty or heavy like regular chinese take out. We also got the mongolian beef, flavorful but again beef was a soft yet really chewy texture.\n\nAnd make sure you tell them you have a coupon for free egg rolls when you make the order.  Unfortunately they don't honor that coupon when you come to pick up the food. :(", "author": "Emiko M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-08-13", "description": "When I first moved to the neighborhood over a year ago and I was going through the cheap-and-easy ethnic food take-out withdrawls that came with being accustomed to years of frolicking in my backyard: the Mission, a  multi-ethnic  cuisine xanadu. \n\nMy roommate and my boyfriend's father both highly recommended the won-ton soup  but I was skeptical. I'd seen Hai Sun a few times when I'd walked by and it always looked so destitute that I wondered how a place like that could stay in business with such  high lease rates in the area and seemingly no business. Well, little did I know! Turns out they were right! Hai Sun does a high volume of take out/delivery. \n\nI've since ordered take out/delivery a million times  (Yes, I know, pro-laziness points for me because I live around the corner) over the course of the past year and it's excellent. The plain fried rice, the prawn with snow peas, the chow fun with extra vegetables, the won-ton soup, the sweet-and-sour pork, the orange chicken, the mongolian beef, the vegetable chow mein: it's all great! It's not super greasy or unhealthy; The vegetables are always fresh and the prices are very reasonable. Also, their delivery is really fast.", "author": "Dee I."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-19", "description": "Great Chinese Take Out!\n\nThey are better than most I've tried without paying too much, nor too little!\n\nWe ordered the Hong Kong Dinner Special for 2 and it was made fresh.  It didn't taste like most Chinese take out places where they arrive at your door within 20 mins flat and you have to question how they do it!!  Its all in the taste!!  Its not pre-made, nor did it taste like it was sitting around.  I've ordered from Ton Kiang and they are excellent, but it can add up pretty quickly.  I sometimes need some Americanized Chinese food and this place is right on the money - again, not too expensive and fresh!!\n\nTry the Chicken Wings - they are amazingly good!!  Deep fried with salt and pepper, topped with green onions and chilis.\n\nBtw - they deliver within 45 mins.", "author": "Gina K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-02-09", "description": "Give me some water please!  This is about the only Chinese in the Marina area and cater mostly to take-out and delivery.  They aren't really used to customers dining in.  I had the General Chicken and asked for 'mild'....and if their idea of mild was what I got, I cannot imagine what their 'spicy 'is!  Regular Chinese fare, nothing impressive but nothing bland either.", "author": "Michael K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-04-18", "description": "Hands down, one of my favorite Chinese places in the City.  \n\nFood is quality (ask for all white meat on the chicken - its worth the extra $2) and the delivery is always pretty quick.\n\nTry to avoid going to the actual restaurant if you can...its just better that way.", "author": "Ken S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-12-28", "description": "average food. ordered for the first time. had to call the restaurant and someone simply said \"Hello\" ...as if I called someone's home. Portion was a little less than what I expected, food was ok.", "author": "M s."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-07-12", "description": "No doubt the best take out chinese food in the city.\nNot only is the price right, but the won ton soup is a must have and the lemon chicken is also very good. They are a busy place, so expect to wait 45-minutes to get your order, but definitely worth the wait.", "author": "Steve B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-04-25", "description": "Not bad, Not super either. I ordered the Hunan General Chicken w/ white rice. It's a little bland and the sauce looks msg-suspicious but it's not bad (maybe the MSG talking?). Like everyone here reports, fast service, I ordered for pick-up. my order was ready in 8mins.\n\nI'll come back and try something else, like the Crispy beef. That sounds good.\n\nalmost forgot, Their veggies are good. as advertised.", "author": "Benjamin K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-03-24", "description": "Just had take out, won ton soup was amazing, fried rice was not greasy, Mongolian beef was great but a little too sweet for my taste and greasier than I expected as they claim \"oil is used sparingly\" and why I ordered from them (this is the reason I gave them 4 versus 5). It's my favorite take out now! The combo was a great deal! Going to order again! I recommend it and don't know why people below had a bad experience.", "author": "Sophia M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-05-11", "description": "We live a few blocks away from Hai Sun and it is our rainy day delivery choice.  My boyfriend and I were home sick yesterday and we called them up.  We had hot and sour soup and the combination appetizer.  The food came incredibly hot and fresh - we had to wait to eat the soup so it could cool down.  The appetizer had egg rolls, barbeque pork, fried shrimp, foil wrapped chicken, and potstickers.  It was delicious and one of my favorite things on the menu.  Hai Sun will always be a rainy day call for us!", "author": "Arica V."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-12-06", "description": "Ordered in because there were several positive reviews on Hai Sun. I had the Won Ton Soup, Chicken Snow Pea and Veggie Dumplings.\n\nThe broth for the Won Ton soup tasted like it had been made with grease out of a grease trap. Disgusting. Also, veggie dumplings were heavy, doughy and flavorless. The Chicken Snow pea was okay but also lacking flavor.", "author": "Chelsea A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-12-24", "description": "Had the beef with broccoli, hot n sour soup, and singapore noodles... give it a lot a credit for the fast, well-priced food.  plus it comes piping hot.  And it's pretty healthy for late night dinners!", "author": "Emm C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-07-07", "description": "This was such a disappointment.  I give them two stars because the food was ok, it was healthy for Chinese food in SF.  They had very fast delivery.  But what bothers me is that it was such a rip off!  I ordered the combo which is supposed to be a meal, white or brown rice, soup, and an appetizer.  There was no brown rice because the woman that answered the phone said they had just opened even though the menu said they had been open for 6 hours.  The appetizer consisted of one miniature egg roll that hardly had anything in it.  It was a really small deep fried piece of flaky dough.  How does what I got cost over $16.00 with taxes and tip for delivery a few blocks from the restaurant?  And I'm supposed to pay even more for quality chicken?  You really have to be kidding me.  What did I pay for?  This is ok Chinese food, nothing gourmet.  I will never go back, I can't stand being ripped off.  And the review above.... really?  Can it be more obvious that the owners wrote this review?  They put pictures of their dishes on the review (only cheap Asian restaurants put pictures up of their food) and they can't speak English.", "author": "Chris W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-04-22", "description": "the 4th star is for fast delivery.  Lately, I've noticed that if I order too early in the day, I get the day cook who covers his ass with salt.  The night cook knows what's happening and seasons his wok properly.  After several repeat take-out orders, the quality is still great and prices are really reasonable.", "author": "Gordon J."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2006-08-28", "description": "Have you ever first opened your food upon its arrival at your doorstep, and everything looks pretty good, but somewhere along the path from paper carton to plate to mouth, it all changes?  That was what happened.  With everything.  From the potstickers, to the schezehuan shrimp, to the kung pao tofu.  Thank goodness they gave us fortune cookies or they would have only gotten one star.  Order May Lee or Brandy Ho's instead.", "author": "Amme P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-01-28", "description": "The menu claims that it is low-fat Chinese take-away, so we gave it a go, hoping for a healthier, MSG-free option. The combo seems like a good deal - you get a pot sticker or egg roll, Wonton soup or Hot and Sour, Entree, and regular or fried rice. They came in about 30 minutes which was awesome. They deliver for a $10 minimum, and accept credit cards. Overall on food, we were happy. The hubby got the Hot and Sour, pot sticker, and Szechuan chicken. I got Wonton, egg roll and Chicken and Veggies. The veggies were awesome. We both got the fried rice and it was really good. We'd probably order from here again, although I feel like in general we've been happier with some Thai and Indian dishes we get delivered elsewhere, so Chinese isn't at the top of our list.", "author": "Sarah R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-11-25", "description": "Lightninig fast delivery and good quality chinese food with no / limited amount of grease.  Basically the best delivery in the northeast quadrant of the city, tho there is better chinese food around, this place gets 4 stars for convenience and quality.", "author": "George K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-03-03", "description": "I called in sick today because I was feeling fatigued with chills and body pains. I thought some nice hot soup would do me good, so after reviewing a couple of Chinese restaurants I chose Hai Sun b/c one reviewer said the won ton soup was an \"elixer\" with baby bok choy and a flavorful broth. I disagree. I've definitely had better won ton soup. The broth tasted greasy (considering they advertise less grease than most), and the won tons were too soft, kind of mushy and separated from the pork. I was disappointed. I'm giving it two stars for \"meh, I've had better.\"", "author": "Michelle V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-03-13", "description": "This place is not PERFECT but it's not bad at all . Their mongolian dishes are to DIE for-- savory & flavorful . I also adore their szchechuan dishes too . I'm a sucker for spicy food, so if you are too, these two dishes are great here .", "author": "Jenny Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-12-17", "description": "When I think of fast delivery, reliable service, descent tasting Chinese Food for a reasonable price, I think of Hai Sun.  Unfortunately I have not dared to venture beyond the fried rice, pot stickers and ribs.  My Wife seems to enjoy their Kung Pao tofu platter.  I think we've order the same thing each   on a bi-weekly basis for about the past 2 1/2 years.", "author": "Javier O."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-09-27", "description": "Not bad, not the best either. But they deliver and it is always faster than they say it will be. The potstickers are good, the fried rice and the sesame chicken were good, but the cashew chicken was not what I was expecting. The sauce had a funny taste to me. I'll order again, but stick to what I know is good.", "author": "Sarcastic T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-09-24", "description": "It's a little odd to review a place I've never seem, glimpsed or walked into -- but review I will!  Hai Sun is the best Chinese food delivery option I've stumbled across.  My favorites are the Szechuan Chicken, Wonton Soup, Kung Pao Chicken and Chicken With Black Bean sauce.  My one strong recommendation is to spring the extra $2 for white meat -- their non-white-meat-chicken is a bit on the stringy side.  While I'm on the nit-picking vein, I'm not a huge fan (environmentally speaking) of the leave-a-menu-on-every-porch-for-a-mile practice, but it did turn me onto their delivery, so I can't complain *too* much.", "author": "Paul L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-12-07", "description": "This is my Chinese delivery restaurant of choice. The food is not truly fabulous, but it is fresh, well seasoned, and not greasy, and I've never had one of those what-the-hell-am-I-eating moments that are so common with Chinese delivery food. They deliver promptly and get the orders right. The mu shu pork is delicious, and their chicken dishes are well prepared.", "author": "Molly O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2005-08-22", "description": "This is my favorite Chinese take out/delivery place in the marina.  Their food is top notch.  I feel like their food tastes more fresh than some other delivery places.  Their chicken broccoli is one of my favorite dishes.", "author": "Robert R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-08-25", "description": "this is my go-to chinese delivery place.  i love their salt and pepper chicken wings, and the chicken fried rice is great too.  fast and cheap - i can't complain too much. i only wish their westlake minced beef soup was more authentic.", "author": "Priscilla T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-12-11", "description": "all i have to say is i love this place, well i love getting my food delivered from this place.  So fast and so good...i love the vegetable spring rolls and the chow mien!", "author": "Lyndsey H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-02-08", "description": "They say they strive to use less oil and make it healthier, which they definately accomplish.  It tastes healthier than probably every other chinese place i have eaten, and the flavoring is very good.  The General Tso's has a thin sauce compared to other places that was thickened with corn starch, but thats better than oil perhaps.  Flavor stil good (and fried tofu version also good, but waterier, as with any tofu dish).  Moo Shu chicken/pork are delicious, vegetables seem fresh, good egg mixed in, could be more meat.  Hot and Sour soup, what I generally judge a place on (its my book cover), is fairly tasty, varying broth colors/densities, and a lot of what I think is seaweed or whatever the black chewy stuff is (tasty, but i'd rather have more tofu or mushrooms or something).  Pretty good bang for buck, and you feel like its better for you than most comfort food.", "author": "Grant B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-11-13", "description": "Great delivery times (under 20 min) and even faster for takeout (like 8-10 minutes !). This is not a place i'd ever recommend eating-in as they often use the dining tables for A)  food prep, and B) as a general waiting room area for their delivery drivers when they arent out on the road. DEFINITELY opt for the white-meat option when ordering chicken dishes. I think the dumplings are so-so (too much excess dough) and the the jim mein (jim??) is wack (unless u like dry crunch noodles as a dish).... stick with the staples and u'll be fine and generally pleased.", "author": "Pretesh D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-05-10", "description": "We got explosive diarrhea after eating here. In fact within 10 minutes of eating this food I got a major stomach ache.  I thought it was just me but a couple of our other friends also got the runs.  Stay away and if you see this place RUN!", "author": "Ling L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-10-14", "description": "Good solid chinese delivery. You can't go wrong with this place. Love the potstickers. The broccoli beef , kung pao chicken and sesame chicken are all a good time as well.  Not my first choice to dine in however, one of those places it's best not to see where the delivery actually came from!", "author": "Bob F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-01", "description": "so it's 4 stars compared to all the other hole in the wall chinese restaurants in the city.  i like hai sun and i'm sticking to it.  everyone i talk to doesn't like this place, but i'm actually a chinese person living in the marina and i like hai sun.  that must say something or maybe that's why i like it.  so yeah, maybe it's not as nice as the other \"marina\" establishments, but i think it's good cheap chinese food.  i wouldn't actually eat in the place and i've never seen anyone eat there anyways, but it's perfect for take-out or delivery.", "author": "michele k."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-10-03", "description": "Good, dependable Chinese take out/delivery.  Delivery is usually very fast and friendly.  White chicken meat options are nice to have.", "author": "Mike G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-09-05", "description": "So I decided to do a triathlon, sort of last minute. And so I'm having to build my training into my everyday activities. Yesterday I had to ride home from sausalito (not too far right??) but I had all of my training gear from the week and my laptop all on my back. So I'm busting my back up the big hill and i get home, not kidding i was so tired i just sat on my bed. Didn't move, couldn't motivate myself to eat. So I yelped some cheap food in the neighborhood since who isn't trying to save money right now?? BAM this place came up like a glorious site calling my name. Do I really want greasy chinese food after all the hard workouts?? YES. YES I DO. And I also want them to be here in 15 minutes. SO i booked my order ONLINE. Yes, didn't even have to call, and really in 15 minutes I had a hot plate of steamy mu shu veggies calling my name. I stuck to the safe suggestions and can't speak to other's reviews. But hey when you're THAT tired anything that shows up at your door is amazing!", "author": "Arianna P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-11-14", "description": "We don't get delivery very often but I love this place...the mongolian beef is the BEST!!!!!   Some dishes you have to dump out, stir and then serve-they put the nuts or some mix-ins on top.  They will deliver to Potrero Hill and they always ask where we got the menu...I think under my door in the Marina...I was attracted to it because it says \"low-fat, low-oil\".  I never asked if that's true...great selling point for me!  Everything tastes very fresh -I love the hot and sour soup also but need to ask them to make it not so spicy next time, I always forget and it would be so much better with a little less pepper. They have cupons on the menu-don't forget to use them!", "author": "Shannon J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-03-08", "description": "I love this place!  They have online ordering, which I'm always a fan of, and good deals.  The food tastes good.  It's not fancy or elaborate, just tastes like decent inexpensive chinese food, which is what I'm all about.  My only beef is they don't have any dinner combinations for one person... which would be nice.  Other than that, they deliver fast, the food is tasty (not mind blowing taste, but it's good) and their online ordering is always awesome.", "author": "Jeff S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-25", "description": "Been around for 17+ years.  It is take-out Chinese food and they do a great job!  Prices are good and delivery is fast.", "author": "Allan B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-12-20", "description": "I've always considered this place the fast-food equivalent of SF chinese food.  They normally show up at our door within ten minutes, and the food seems to help soothe a hangover.  Try the bbq pork chow fun and the egg rolls--these seem to be consistently pretty good.", "author": "Mike C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2007-10-30", "description": "Hands-down, nastiest Chinese delivery I have ever had. When my wife and I were still dating, we were hanging out at my pad and decided to order some food - a friend had recommended Hai Sun. It was gross. We ate in the dark watching a movie, and after a minute or two of choking down the nastiness, we both looked at each other and reached the consensus that the food was awful and needed to be thrown out. I took it into the kitchen and it was even nastier with the lights on. Shame on me for playing off a stereotype, but it really did look like shredded, slimy cat meat. I think it was chicken but I couldn't really identify what parts of a chicken they had used. It was slimy and glistened in the light. I forget what we ended up eating for dinner but we learned our lesson and never ordered from Hai Sun again.", "author": "Myles Y."}
