{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-08", "description": "Thrifters and coffee-lovers will be happy to hear there is plenty to do in this area. Lots of thrift and vintage stores to check out and many cafés for my fellow caffeine addicts. I spent the majority of the day just wandering and looking at whatever seemed cool. A decent amount of homeless but none of them approach and definitely still kid-friendly. \n\nThe only negative... I have the bladder of a goldfish. So finding bathrooms is essential to my experience somewhere and i have some advice. If you stop at a cafe or restaurant and buy something, USE THE RESTROOM. Please don't convince yourself that you don't really have to go thaaatt bad (we've all done it). If you're a paying customer you've earned the right. If you happen to be withdrawing cash  and think \"hey maybe it's time to go here at the bank\" you're out of luck, no public bathroom. I ended up paying $7 for a drink I didn't need at Whole Foods where I was able to use the restroom. But... if you pay for the bathroom, maybe they should at least keep #2's off the ground? Just a quick warning, but besides the bathroom dilemma I loved the area and you will too.", "author": "Cara H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-03", "description": "Lol hippies with sandals, distributing weeds and LSD. Well apart from the hippies we have lots of arts shops here selling hand made crafts from mystical stones to Rave clothing+accessories(like for the California /Vegas music festivals , particularly Burning Man) , tbh it's quite capitalistic lol", "author": "Lulu Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-09", "description": "An iconic neighborhood in the City made famous by the Hippie Movement (not \"Hyphy\" popularized by Mac Dre and E-40) in the 60's; specifically the \"Summer of Love\" in '67. \n\nThe Haight Ashbury district got its name from the intersection of these two streets where most of the movement took place. If you stand on that corner, you will see a clock set at 4:20. \n\nFor us locals growing up in the City, this is where we would get our ganja back in high school. Especially if my \"dealer\" was unavailable, we would have to trek here and choose who you could trust. Back in the day, it was like Wild Wild West and there were a lot of sellers to pick and choose from. It was either hit or miss so it was buyer beware. \n\nI'd prefer not to since the quality you would get was not consistent, and sometimes they would mix their products with real herbs instead of the alternative herb you were looking for. \n\nOne day, my \"dealer\" was out of town so my \"cousin\" and I were fiendin' to get faded. So we drove here, parked at McDonald's parking lot and started walkin' along Haight lookin' for a seller. We came upon a trio of \"sellers\" across the street from Amoeba. We asked for a dime bag and he said the price. I handed him a 50 and started giving me change straight from his wallet. It was obvious that he wasn't a professional and the guy was actually blazed as he was snickering counting the change. His two friends were also snickering and it was getting awkward real quick. \n\nAs he handed me all the cash, we made the exchange and we quickly hustled back to the car. As we got inside, we started counting the change and realized he gave me 50 back in 10's, 5's and singles. We started laughing and hauled ass just in case they realized their mistake. Anyway, the product wasn't the best we've had and it was dank at best.  \n\nNowadays, you can get them legally and I'm pretty certain the quality would be more consistent than how it was in the past. Also, they've cracked down on dealers over the years as it became more mainstream. \n\nThe neighborhood hasn't really changed much, but it has evolved into rows of vintage clothing stores, consignment stores, eateries, smoke shops, coffee shops, and homeless young adults looking for a place to fit in. I do miss the tattoo shop that made my bull tattoo, which sadly is no longer here. \n\nIt's part of the City that will always be unique and some stories that I would rather not share until I'm an old curmudgeon.", "author": "John G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-29", "description": "This iconic corner street now turned neighborhood is still pretty funky and crowded with shops that scream \"flower power\" and \"peace and love\". I enjoyed visiting all the shops, specially some crystal shops and some Tibetan and Indian shops. There are also some artsy shops and clothing stores. And, of course, a lot of stoners and people walking without shoes. It is San Fran, after all...", "author": "Julio H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-03", "description": "\"A dream you dream alone is only a dream. A dream you dream together is reality.\" - John Lennon\n\nI'm blessed being a time traveler. I won't bore you on the details, but let's just say I've been here, there, and everywhere. Every decade and almost every century I have lived, through living my lives I'd say avoid the Dark Ages, every other period is tolerable, some more fabulous than others. \n\nI agree with some that today the Haight Ashbury is just not the same. Hmm well after deep thought what does that really mean? I mean was this a magical place at one time? Or was Timothy Leary full of bullshesh? No longer can you hear the Grateful Dead jamming in the house on the corner, or will you bump into a pre-cult Charles Manson. Forrest Gump was seen looking for Jenny, and SFPD was found everywhere cracking skulls too. \n\n\"Love is a promise, love is a souvenir, once given never forgotten, never let it disappear.\"\n\nHmm so what is this place? A good place? A bad place? How about a little bit of both. And although there is a Haight Ashbury intersection, there's also the Haight Ashbury District. Guess what? I have first hand knowledge of Haight Ashbury because I lived just four blocks away on Clayton and Twin Peaks! So before you pilgrimage up here and expect free hippy love and everything is groovy... here's some Mary Jane & my 2-cents...\n\nThe BAD Haight Ashbury today:\n* The sidewalk needs to be washed. Seriously. \n* More & more overpriced t-shirt shops.\n* Loitering & being solicited. \n* Kids laying around now are lazy or sad to say many in need of intervention and help.\n\nThe GOOD Haight Ashbury today:\n* Those gems like Amoeba Music. Unique shops like Love of Ganesha, Loved to Death, etc. \n* The Grateful Dead House. The aura is real! \n* Golden Gate Park only steps away! \n* Read John Y.'s passionate review! He lived it! \n* The AMAZING history! \n\nAhh the history of Haight Ashbury is what separates it from just your typical intersection. This is where the counterculture was born and later challenged the authority. And in retrospect sometimes thinking outside-of-the-box and \"differently\" is what truly makes America great! \n\n\"Possession isn't nine-tenths of the law. It's nine-tenths of the problem.\"\n\nOk, it's 1969 again... pull up your bellbottoms, son. It was a happening place to be creative. The Jefferson Airplane jamming in one garage and the Grateful Dead in another. Hendrix and Janis Joplin strolls on by, even Harrison & Lennon was seen in the crowd. Bob Dylan lay lady laying across the street. Then you have the poets like Allen Ginsburg & Timothy Leary, the later who so happens to be Winona Ryder's Godfather, I know she's my ex;) The tied-dye psychedelic shirts and flowers in the hair enraged the authority, but only because the chaos was actually a wake up call for America to wake up! \n\n\"Love is the flower you've got to let grow.\"\n\nIn the end, the Haight Ashbury was never Nirvana or the stairway to Heaven. It was \"the place to be\" during a revolution against a war that probably shouldn't have happened. It was \"the place to be\" as creative as you wanted to be. It was \"the place to be\" to celebrate our freedom and remind ourselves how great America really is... if the people are given the power. Power to the people, right on! \n\n\"Imagine all the people living life in peace. You may say I'm a dreamer, but I'm not the only one. I hope someday you'll join us, & the world will be as one.\"", "author": "Eric R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-08-21", "description": "You gotta go, because you gotta go. I take visiting friends here and we try to imagine days gone by. If it weren't for the legends told, it would just be another coffee shop - bar - sandwich - ethnic food neighborhood kind of place, with the occasional brilliant thrift store find. The murals are cool but everything feels built for the influx of tourists now. It's okay. We'll take it.", "author": "Rachel W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-04", "description": "Yes! It's Haight Ashbury for me. When I was in about 5th grade, I had a schoolmate tell me about Haight Ashbury in SF and the kids in elementary school were hearing about the hippies. My parents were not hippies, but were young adults in SF sometime before hippiedom. I have some fantasy about hippies and hippie life, but it's long gone. Haight Ashbury is a myth, legend, and relic of hippies. And it's about 50 years later in SF. Haight Ashbury is expensive. It's a place to eat, drink, nightlife. I am on Haight much. I go to Amoeba, The Booksmith/Bindery, coffee, try some of the crappy restaurants, and dream of a time long ago where the Grateful Dead was hanging out on Haight Ashbury. I have been to Haight so many times...infinite times. I love the Haight--no HATE!", "author": "Denise C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-01-21", "description": "Did a walking tour here to find out all the information and wow did we get it. Saw the houses of Hendrix, Joplin's and The Grateful Dead. Was introduced to some great architecture and heard very interesting stories. \n\nAfter the tour we ventured into the shops and I guess I was just really sad about what this place has become. An overpriced gathering of boutiques. I thought it would be great to pick up a tie-dyed skirt or dress...average price was $150-$225. I understand we are in the city however i do not feel there is a need for price gauging just because of the location and history of said location. \n\nThere are some great vintage stores that are worth a peek at as well there. \n\nThe history of this area drew me in, the prices of the stores made me not want to come back.", "author": "Brigid D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-04", "description": "Haight & Ashbury is one of my favorite spot in SF. They got some good shops & restaurants to go to in that area. I also like the Ben & Jerry's ice cream in that area too. Haight & Ashbury is one of the good place to go to to get there you gotta the 6 or 7 bus line from Downtown or Take The N Judah train Ocean Beach Outbound & get off at Carl & Cole then take the 43 bus line to there.", "author": "Mychael H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-23", "description": "A MUST DO! HAIGHT ASHBURY WAS THE PLACE WHERE THE COUNTER COUNTER WAS BORN. THE HAIGHT FOR SHORT was responsible for the Gathering of the Tribes, Monterey Pop & Woodstock & ultimately today we have Coachella. This area is responsible for the whole thing. It has indeed kept a lot of its vibe from 1967. But, let's face it , it's not 67. There are Tye Dye T Shirts Everywhere. T Shirt Shops Galore with New Band T Shirts & Baseball Caps from their 60s heyday. There are also Vintage Shops on the street as well as New clothing stores. There are smoke shops & vinyl  record stores like Amoeba. There's a wide variety to eat; pizza, burger, coffee and ice cream shops abound. You might even see an original hippie or a millennial hippie walking  down the street. Lots of great people watching in this Mecca. People still play music on the street out of their van for tips. The corner of HAIGHT & ASHBURY where it all started says it all - it's now a Ben & Jerry's. Yup commercialism has hit, but Jimi Hendrix's apartment is still here. You'll also see wall murals of rock stars painted on the outside of buildings. So today & yesterday peacefully co-exist on the same street. Tourists love this area.  If you couldn't experience the real thing back in the day, at least you get to taste a small bite of it today. Something is better than Nothing! It's easily accessible by The Metro. You'll have a lot of FUN exploring all the cool places in this iconic neighborhood!  \nIt used to be, you had to have mega bucks & be really rich to have the Good Life, not anymore. The Game has changed. You've been Upgraded. Now You Can \nLive Like a King on a Limited Budget!", "author": "Stephen Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-27", "description": "Very cool and eclectic section of San Francisco. Its basically where the hippie revolution started. The Grateful Dead house being on Ashbury St. San Francisco is a great city to visit, and this section is definitely worth checking out.", "author": "Greg S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-24", "description": "Eclectic.  Beautiful in its own sense and what it once stood for.  Surrounded by fabulous sometimes colorful old two story apartment houses.  Relaxing but busy.  Interesting at the very least.  An artists paradise an organized persons nightmare.  Enjoyed my day here but wished I had rented one of the many mini cars and toured the entire district.  Make sure to stop at the Gold Cane Bar for refreshments and an informed and interesting mental tour of the district from its part owner and daytime bartender for the past 35 years.  Everyone I met while in the district was kind and free spirited for the most part.  Anyone cognizant during the sixties should consider adding this district to their bucket list of places to see. There are places to eat here and a fresh food grocery for those who are health conscious.  Plan on spending a day here just looking at the many interesting things that make this district what it is.  If you get here early consider having coffee at COFFEE for the People before starting your journey.  Beware, many of the shop owners do not allow photos inside of their businesses by camera or phone.", "author": "Victor D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-03-22", "description": "I work two blocks away from Haight and Ashbury. This area is full of homeless and hippies ,dogs and tourist. The stores are good and I love the food choices over there especially Ben and jerry which is the only location in San Francisco. There is always a line going into Ben and jerry, but it's always homeless people with there dogs just blocking the sidewalks. This is two blocks from the Panhandle and not far from Golden gate park.", "author": "Elizabeth G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-07-24", "description": "Fifty years ago 100,000 hippies converged here for the Summer of Love. Today, it is mostly a tourist destination. Shops sell what you assume they'd sell: tie-dye clothing, Hindu/Buddhist paraphernalia, pot leaf everything...\n\nThere's a few hippy wannabes wandering around. It seems that dogs are the hot new neo-hippy accessory.\n\nGood to come and sort of take a look around and try to imagine it decades ago, but not worth a lot of your time and money.", "author": "Chad K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-08-13", "description": "I felt like a tourist in San Francisco has to visit Haight.  It's a unique part of the city that has a story and a style all it's own. I was excited at the chance to visit. \n\nTattoo shops, organic coffee shops, vintage clothing stores, cafes, and boutiques make up the majority of the store fronts. Definitely stop for a meal. The food was wonderful and their aromas will draw you in off the sidewalk. \n\nThe shops were a nostalgic excitement for me with nag champa, patchwork pants, the floor length circle skirts, and beautiful baubles. The prices, however, were staggering, yanking me from memory lane and plopping me in tourist trap town.  $25 for a modest agate pendant in a costume jewelry setting?!\n\nWe were also targeted by street dealers (I guess jeans and a black blouse hive me away as a tourist????) several times. I guess between that, the overpriced nature, and the sore lack of celebration of the area's history, I was a little disappointed.", "author": "Lindsey G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-26", "description": "I am 70 years old and 50 years ago I sat on the corner of Haight and Ashbury. Not knowing what to do.  I loved it all. I stayed in the area for three years.  No money no family no home but I did survive.  Some of the best and loyal friends I ever had came from here the rest is history. \nSo if you weren't there please don't knock it.\n\nThanks", "author": "John Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-17", "description": "Love the Haight, though there are only a few laces we stop into nowadays. \nGreat food, decent parking, lots of people watching. \nAlways something to see, and on a clear warm day, the street is beautiful, coorful, and alive with those hippie trippy love vibes.", "author": "Kat R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-26", "description": "A historic neighborhood, though the Summer of Love was a couple of years before I was born I still have heard about Haight and Ashbury. Sadly, the bus tour brought me here on a Sunday morning and it was still way to early for much of the area to have come to life.\n\nGreat graffiti if that's something you're into capturing. Also many store front are brightly painted and well worth a look.\n\nOn the way back to the bus stop, I could very strongly smell the wacky tobaccy. I think I got a second hand high. Duuuuuude.", "author": "Bruce K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-20", "description": "My best friend and I came to San Francisco because when we were teenagers, we had listened to all the 60's songs singing about free love, peace, what have you\nand thought it would be funny nostalgia to visit and because we had heard San Francisco was beautiful and there were tons of unique things to do. On our second day we took an Uber to the Haight district and there were people everywhere! This was on a Thursday morning at around 11am. There was a plethora of old, 60s wall paintings that took you back in time and scarves and unique things all hanging out of windows and draping here and there. It was really cool! Totally Hippie to the core. However, the wanna-be hippie/hipsters there these days ( other than us out-of-town tourists ) all seemed to be homeless and/or addicted heavily to drugs, or were just trying really really hard to look \"cool\", which was a far cry. I can see why George Harrison hated it to a certain extent. There really is a love-hate relationship with this place. My best friend and I had to turn down the offer of drugs numerous times. The stores were very cool, somewhat overpriced, but sold lots of the cute hippie memorabilia, magnets, t-shirts, mugs, etc. There were some lovely thrift stores that were super cheap which was surprising down in that area. I'd say, that if you've never been to the Haight district, you gotta see it just once. You've gotta set eyes on once was a massive hippie haven! It's a unique place, I just wouldn't want to spend more than 2 hours there....", "author": "Brittney F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-17", "description": "Hippie haven! Reminds me of my city's Delmar Loop neighborhood. Packed with smoke shops, skater shops, music shops, incense burning, cafes, small health food grocers, beautiful graffiti artwork along the blocks, fashion forward pedestrians, tattoo parlors, loud radios blaring from storefronts and picturesque views EVERYWHERE! \n\nDefinitely a place to be...if only for a moment, you've gotta experiment Haight-Ashbury glory.\n\n~Christy said so.", "author": "Christy A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-03", "description": "The allure of the Haight with its Summer of Love history, laid-back vibe and amazing architecture drew me in right away.\n\nThe romantic lore continues to be a magnet but the reality of it is the Haight is filled with a mix of people and problems that make it an interesting neighborhood to visit but maybe not to live unless you're off the main drag on quiet, leafy streets like Clayton, Belvedere and Page.\n\nLost young kids still seem to roam the streets in packs (usually dressed in later versions of whatever clothing you're wearing from J. Crew, Garnet Hill and Anthropologie) begging for money for \"food.\" They can be very aggressive and the best strategy is to keep moving and ignore them.\n\nOld head shops mix with an assortment of upscale stores and reasonably priced restaurants offering an assortment of dining choices. Bars, brewpubs and restaurants spill people into the street through open vitrines giving the neighborhood a lively, jovial vibe. \n\nLike Bourbon Street in NOLA, the main drag is dirty (watch your step!) but the mix of old, new, funky, useful and intriguing will draw you in. \n\nThere are great bookstores and quirky retail shopping if you know where to look for the gems and Haight Street offers one of the best grocery stores (Haight Street Market) that's an excellent place to pick up picnic supplies and head to Golden Gate Park or to stock up for your weekly shopping. \n\nBring an abundance of patience for pedestrians who haphazardly cross in mini-packs, leaving you sitting at a stop sign wondering if you'll ever make it to the next block. Look for an opening and carefully move forward - and use the streets parallel to Haight for less frustrating transit and better parking options.", "author": "Jennifer O."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-10-12", "description": "It's okay,  what you would expect. Lots of homeless, and a 60s Stoner vibe. A place you'd like to visit once. Definitely  Hit the  pork store Cafe for breakfast 1451 Haight Street..", "author": "Michael H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-17", "description": "the haight ashbury district is always one of my faves. so many hidden gem clothing stores.\nits also a quick place to get your uber.\nwalking through the streets is fine, you smell a lot of interesting things...", "author": "Ella A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-04", "description": "There is an imaginary romance with the Haight! \n\nSure the ibeam was cool (saw the red hot chili peppers play naked here except for the socks)\n\nThe Haight Ashbury music center had cool guitars ( bought a 1960 hardtail  white strat and a 64 sunburst strat here...$750 each!!!)\n\nRock and bowl was a hoot and a half!!!\n\n..... But  Let me break it down... The Haight has always been grungy, dirty, and funky....even in the summer of love (although I was too young to really remember it)\n\nThat being said it is always a cool place to walk around and check out the \"local color\", catch a wiff of the strong 420 being imbibed, maybe even get a bite at cha cha cha or a drink at the Alembic.\n\nCheck it out but don't expect some timothy leary epiphany...unless you ingest a good sugar cube", "author": "David G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-07", "description": "Rating based only on their community and selection of shops!\n\nGreat place to shop! Whether you are with the cool trendy buddy, the one who is awesome at pulling off second-hand clothing, or kinky pal...there is something for everyone!! 8-) . The folks walking around there are all so different as well! Don't be surprise if someone also asks you to buy weed... You'll even get a sniff test! \n\nPrices? They range from affordable to pricey, so that's quite a variety as well! There are sales from time to time and those are always great! Check out their website for more details. ;-D", "author": "Giovanna R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-05-28", "description": "Gentrified tourist trap. If you're taking visitors around SF to see the interesting former hot spots, it's just boring now. It takes about an hour to walk around & to see the whole area. \n\nNo street musicians at all. \n\nNice murals and a few interesting people but \noverall it's a Disneyland experience. Very few shops selling unique, vintage 1960s wares.  I don't think you can tour iconic places such as the Hendrix house.\n\nAmoeba Music is still cool. Tons of vintage and hard-to find vinyl. If you're a serious music lover, you won't be disappointed here. \n\nMany, many shops selling pure tourist shit.  Mostly Made in China t-shirts and posters, postcards, coffee cups,snow globes.  \n\nParking is impossible.  If you're lucky, you MIGHT find a parking spot blocks away.  I definitely recommend taking a TAXI or you'll spend more time looking for parking spot than anything else. \n\nBut, your out-town visitors will want to go to the Haight, so go ahead and take 'em ..... but it's basically boring.", "author": "So T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-21", "description": "Interesting hippy area filled with professional graffiti and artsy hippie stores and some restaurants.\n\nThere are clothing, toys, art, curios stores mixed through many blocks.\n\nAn interesting place to browse for an afternoon.", "author": "Funtime P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-14", "description": "Cool area. It's everything hippie. I never seen so many head shops on one Street! Lol. Total hipster hang out area. You see lots of older folks here too, probably reliving the old days when the dead, and those type bands were grooving in the area. Neat place. Definitely worth a visit!", "author": "Gunter T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-02-03", "description": "If you're looking for Haight Ashbury, the intersection is still there....but that's about all that's left from the glory days of yesteryear. With the exception of Goodwill and Amoeba Music, most of the old shops that were there 10 years ago are gone, replaced mostly by boutiques selling overpriced stuff to outfit your Pinterest/Instagram themed dwelling. \n\nThere are still plenty of young, aspiring hippies v2.0 camped out in doorways and in Buena Vista Park, drawn here like dreadlocked moths to a flame by the primordial tug of the smoke shops or distant memories of the Grateful Dead....\n\nIf you've got lots of money to burn, you might love the shops here, but if you're in search of a San Francisco neighborhood that still has some authentic charm, head over to the Mission and venture beyond the touristy block. If you're in the Haight already, pop off the main drag and check out some of the sidestreets; there are some pretty cool homes to admire.", "author": "Nick Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-01", "description": "Lovely, crowded, culture, hipster, touristy, cannabis, art, food, ice cream, burritos, Amoeba Music, coffee & tea, stores that sell cool socks and hosiery, chill, Whole Foods.\n\nGoodwill, cocoa people, American Apparel, veggie burgers, tattoos, Cold Steel America (hi Becky), custom fashion, bars, Latinos, tie dye, mom & pop shops, plants, flowers, milkshakes, uniqueness, college kids, outside seating, bus stops, parks, sunbathing. \n\nBlue skies, Mexican food, lifestyle, freedom, cocktails, wild, color, Wells Fargo, cute dogs, good vibes, grinding, gifts, sun, water, nostalgia, boutiques, Bob Marley, markets, produce. Great chill spot. Welcome home.", "author": "Court S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-18", "description": "Haight Ashbury definitely fits the expected hippy stereotype and it is great. The difference from surrounding neighborhoods is noticeable, which makes the trip to this side of town worth it. \n\nThe street is also long enough that you can stay a while and be entertained with the plenty of smoke shops, music stores, coffee shops, juice bars and clothing stores.\n\nEverything is colorful. From plenty of graffiti, boutiques advertising flowery fashion, lively sidewalk cafes and pricey juice bars, to the quirky people walking the streets and the Ben & Jerry's shop (of course it's here), this is a fun area to explore.\n\nParking was tricky for us, but we were happy we didn't give up in the hunt for a spot.", "author": "Meghan H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-04-01", "description": "At first, I was very amused being in this iconic, nostalgic neighborhood (district) that was once occupied by folks that started the hippie movement. Seeing the old streets and homes of Janis Joplin and The Grateful Dead was fascinating. \n\nHowever, my amusement was diminished as reality set in that there is no longer those days of the hippies, and it was just a walk through a street selling food, shoes, music and memorabilia. Kinda reminded me of when Jesus our Lord walked into His Father's temple and saw all the business affairs and transactions going on, and \"freaked out\" in a sense and became angry and started driving out all who were buying and selling. Nonetheless, just another street for me.", "author": "Arturo G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-22", "description": "Lots of interesting characters walking around - you have the best people watching in the city here. We were offered drugs no less than 5 times.", "author": "Erin L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-27", "description": "Mongo no find Jefferson Airplane. Mongo no find Janis Joplin. Mongo no find Grateful Dead. Mongo no find girl with flower in her hair.  Mongo only see stores and stores and stores and stores and stores. \nMongo find hand-made soap. But Mongo say: no one use soap around here. And Mongo find tie-dyed tee shirts for $100. And Mongo find Bob Marley posters. And most everybody nice to Mongo. And lots of people ask Mongo for spare change.", "author": "Mongo I."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-08-17", "description": "I can say with conviction, my LEAST favorite neighborhood in SF.\n\nWhile I try to keep the hipster hating to a minimum(ish)...haight street seems to have its own spinoff: the biker bro and park trash.\n\nThese guys sit at the bar drinking their shitty beer, with their shitty well whiskey shot, a patchy beard, an SF elitist attitude even though they're from the Midwest and have been here for 2 years and crappy tattoos. Dressed in all black with an unkept beard, you'd think they would ride home on their Harley.... Yet instead they jump on to a mountain bike or fare-skip on muni.\n\nAside from these guys, you have the haight street park kids who panhandle and yell at European tourists while too high/drunk to know the difference. Once their flordian parents stopped paying their Berkeley tuition, haight street was the next best thing.....or worse thing, whatever.\n\nThe shops are so-so, a few overpriced thrift stores that you can find anywhere in SF, smoke shops galore, overpriced mediocre tattoo artists who specialize in ying-yangs and mediocre bars with mediocre beer. The saving grace is some of the skater shops (True, diamond, pink dolphin, etc) if that's your thing.... Oh, and cha cha cha.\n\nmake a game out of it: see how many blocks you can walk without being asked for change, being called a derogotory name (being a dick isnt cool, guys), \"wanna buy some reefer, man?\" or avoiding dog shit. hint: there is no winner.\n\nThis is one of the neighborhoods that, if a friend was in town, I'd tell them they are on their own. What a waste of time and a muni ticket.", "author": "Ryan L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-11-16", "description": "I would have loved to see this place in it's heyday, but it's so ghetto now that there's nothing to see. It might be different later on in the evening, but in the afternoon it was just bleh.", "author": "Roll N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-20", "description": "We dragged my mom here and she almost refuse to get out of the car when she saw all the craziness that the street has to offer.  She was much happier when she realized that Haight is home to many cool consignment stores such as Wasteland, Crossroads Trading and Buffalo where she can score a shirt for $10 and a scarf to match for $7.  She was also a fan of the Whole Foods market at the end of the block where you can sanitize your hands, use the bathroom and get an organic juice for the same price as the shirt you just bought.  Good times!", "author": "Monica G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-16", "description": "Don't expect much when coming here. It's not 1968 anymore. That's what made this place famous. I'm not going to go into all the history of it; you can watch the last episode of the documentary \"Sixties\" on \"Netflix\" for that. \n\nHere you pretty much take a picture next to the street sign, buy some Ben & Jerry's if you want, walk down haight and maybe buy overpriced hippy memorabilia (something the original hippies were against), take a picture of Ameoba music, avoid the crackheads next to McDonalds, and walk to hippy hill in golden gate park. If it's warm or sunny, and not too cold, there will be drummers there, mainly on the weekend however. So why do I leave 5 stars? I'm not a visitor. It's just a cool area I've gone too since a child. If you're just visiting, your experience may vary based on what to expect of this area. What made it famous however no longer exists. You can enjoy the shops and just being in what used to be the hippy Capitol of the world, before drugs somehow arrived in the community and destroyed it.\n\nEnjoy!", "author": "Marcel S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-04-04", "description": "Ugh!  I know I'm gonna be 'one of those guys' but 'The Haight', and SF in general, just ain't what it used to be.....Having said that the Haight is still a blast!  From the crazy people watching, to great burritos, record shopping, live music, used clothing.....The Haight still brings it!  Plus we've scored some cool plants at the hardware store.  Parking can suck, but cruise the side streets and you'll find something.  Plus you'll find other cool off street businesses!  \nWe'll be back!", "author": "Jim P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-16", "description": "A unique and eclectic street full of fun people and even more fun stores!! My fiancé and I strolled through each store looking at everything in absolute wonder!!! Walls and walls of water pipes like I've never seen before, not even like some of the stores here in Reno, intertwined with unique clothing stores and antique stores! \n\nThe diversity in the people on the street itself is another aspect of this subculture which is the neatest to observe. Some people even walk around in neat steam punk and old Victorian consumes, while some young drifters offered us things hahaha... Definitely a sight to see!", "author": "Stephanie G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-22", "description": "This is a location in SF overflowing with the history and essence of the anti-war hippie counterculture of 1960's yesteryear, which is indicative throughout the cool eclectic music and clothing stores and local inhabitants which exude it. Definitely an area frozen in time, there is so much to see here on either side of the street for those looking to purchase something that captures the Haight Ashbury spirit! \n\nEverytime I come through here I also make an effort to look through their multiple Tibetan shops, the vintage clothing stores which they're famous for, and the record shops which sometimes features live music. I don't usually mind the new businesses settling in , but they are apparent, pricey, and juxtapose the other stores which still uphold the same hippie character. \n\nWhile the east side of the Haight is boredered by Divisadero and Castro Streets, the west end is famously marked by Golden Gate Park's hippie hill- another cool sight to see when making your rounds along Haight. \n\nThis area is also not easily accessible via BART, but the closest mode of transportation is the N-Judah line on Cole and Carl Street just south of the Haight.\n\nAlso, while this is a very famous area of SF, don't expect it to be like the FiDi or Marina or Castro. This place is adorned with graffiti, smells faintly of that grassy fragrance and have people along the street hoping to sell you some paraphernalia, so be just aware when taking kids over here, but don't be discouraged, there are lots of kid friendly places and everyone is generally chill! \n\nWhether just passing through or visiting to see everything, you will be mesmerized by how lively and quaint this cultural area is and quickly realize how well it fits into SF, as well as learning history while you shop. I learn something new every time I visit! :)", "author": "Kyrie S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-26", "description": "Get ready for some stellar people watching, and stores of the hippie persuasion! I enjoyed checking this area out- Magnolia Brewpub, Decades of Fashion, Murios pub, and Haight Ashbury tshirts were favorite stops while we were here (see individual reviews through my profile!).", "author": "Suzanne B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-08", "description": "One of the best taxidermy stores exists here. I need to go to some of the bars/restaurants here before I move. Awesome painted buildings, miscellaneous boutiques, and good for people watching.", "author": "Natasha K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-05-24", "description": "We did not spend too much time in this area, it does have a lot of drug addicts and homeless people hanging around. \n\nIt is the home of where free love was alive and well back in the day. The hippies are still out and about.", "author": "Tina S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-31", "description": "One of my favorite neighborhoods of San Francisco - the iconic counterculture vibe runs through the streets and is ever so infectious. Here you can find an eclectic range of stores representing a wide range of fashion tastes, book tastes, and an uniqueness that's unlikely to be replicated anywhere else. Every store has its own character and so tempting to visit every one of them. The storefronts and the exterior walls are not shy of graffiti art and expressive decors.\nA stroll from lower haight to the golden gate park takes you through the best of Haight Ashbury. A place that's difficult to forget.", "author": "Sharon Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-16", "description": "Very unique neighborhood full of history. The shops are each very individual. There is plenty of street art to take in. The most unique part of this neighborhood is the actual people. Would like to go back and spend a whole day there in the future.", "author": "Angelic M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-11", "description": "This was a really, really cool place to walk around. The stores really run the gamut -- dive bars, restaurants, smoke shops, incense pouring out of some, hip hop music blaring out of others. It was great. Lots of great street art, tons of characters, great for people watching!", "author": "Justine J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-15", "description": "As I read through these reviews, I wonder if I visited on a good day or ya'll just crazy picky people ? \n\nI had always wanted to visit the legendary \"haight-ashbury\" & I was not disappointed. Of course, you can't expect it to be the way it was in the 60's but some of that magic is still there. There's a few boutiques with bohemian clothes, smoke shops, record stores & other clothing stores. There's a lot of stores that have punk clothing rather than hippie style clothes. It seems like a place where hippies and punks live together as one now, which is quite interesting. The people were friendly at each store I visited. Being from LA, I can tell you that this place has its shit more together than Venice Beach or Hollywood. Yes there's lots of quirky types but they're not disgusting or rude like the ones in the previously mentioned areas. Like I said, this place still has some left over magic from the 60s. I visited Janis Joplin's old house and the grateful dead house. All these things are very close to each other. This place is a must-see when you stop by San Francisco (: \n\nTL;DR: It's awesome ! If you're not a picky soccer mom, you'll love it too.", "author": "Stars S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-30", "description": "hipster attraction! Two words: HYPE. BEAST. hippies! tye-dye mania! For you LA locals, venice beach on crack! lol jk ..\n\nM bf and I were crazy enough to walk here 3 miles from the heart of union square, took 1 hour (we didn't believe the gps, but yes, the hills are a killer)! This place is way better than venice. Ben & Jerry's, Diamond Supply, rvca, true, pink dolphin, jordans, nikes, buffalo exchange, american apparel, black scale, and much much more- bars, bar & grills, cafes!! \n\nGreat place to chill on a Friday night. Everything you need for a shopping kinda day. They have little boutiques too if you're not the hype-typa personality! Just expect long lines and high price tags though!", "author": "Linda L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-30", "description": "For all my fellow hippies out there-- this is the Mecca for us all. It is eclectic, free, tie dye shirts, and free spirited souls every where. You can be sure to smell weed and incense while you walk down the street. Very trippy clothes, accessories, and memorabilia. I loved it .", "author": "Vee W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-20", "description": "You're ever around the San Francisco area and you've never been, this is definitely a must-go at least once.\n\nHaight Ashbury district is famous for it's eclecticism, hippies, and unique shops and people. Tons of vintage and consignment clothes stores to explore, some good food, and of course Ameoba music store.\n\nThis street is always busy so don't expect to find parking very easily. I usually park in the Mcdonalds at the end of the street by Golden Gate park, walk inside the place, and walk out the other side to the street. The signs posted say McDonalds customers only, 40 minute limit, but I've never stayed for more that an hour or so and haven't gotten towed yet. Busy days they do check though, yesterday I saw a clipboard and chalk man as I was leaving. My tire had chalk on it, close call there!\n\nThat said, wander and people watch, come back with a funky souvenir, and very likely get offered some pot. Enjoy!", "author": "Emily G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-03-21", "description": "Haight Ashbury is full of dirty homeless people and drug addicts. It reeks of marijuana and dog poop. \n\nIt is included in many tourists books but I think it is dangerous to send foreign tourists here. \n\nAmoeba and Rasputins are good record stores and they both have branches here, but it is not worth it. This place is nauseating. If you want an authentic hippie neighborhood you can go across the bay to Telegraph Avenue in Berkeley. They place has been cleaned up recently. All of the gutter punks and their mangy dogs are gone from there. \n\nAvoid Haight Ashbury at all costs, unless you like stepping in dog poop.", "author": "Eric P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-07", "description": "What an amazing stroll through this iconic neighborhood . I loved our short time. Visited Janis Joplins home , grateful deads home and a pretty cool little neighborhood market", "author": "MarcCrystal C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-14", "description": "It's a fun area of town with a more free spirit vibe.  There are lots of places to eat and lots of second hand stores.  It's was the festival when we were there.  It was a fun place for people watching.  The festival had a lot of booths with food vendors, art, and more.  The area ends at the golden gate park.", "author": "Andy S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-08-21", "description": "What a DUMP this place had become.\n\nThe Summer of Love was over 40 years ago and is a distant memory as this place is really sketchy.\n\nI would NOT recommend this place for teens or families unless it is during the day and you stay in your car with the door locked and the windows rolled up.", "author": "Bill S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-17", "description": "A MUST. I love this strip; it never has a dull moment. There is always something to do, something to see, even if you just people watch, it's fascinating. I'd definitely recommend this little strip to anyone who is a first timer to the city :)", "author": "Miranda B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-29", "description": "There are plenty of strange but unique shops, interesting people to watch, musician's houses to see (including Jimi Hendrix and Janis Joplin) and cool stores to shop at. The whole area is very loving and kind towards people who are different. The best shirt store is the Haight Ashbury tshirt store, and Veganburg has delicious Vegan fast food.", "author": "Margaret P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-07", "description": "Today my best friend Peter and I went to Haight Ashbury. The Haight-Ashbury district is noted for its role as a center of the 1960s hippie movement. The earlier bohemians of the beat movement had congregated around San Francisco's North Beach neighborhood from the late 1950s. Many who could not find accommodation there turned to the quaint, relatively cheap and underpopulated Haight-Ashbury. The Summer of Love (1967), the 1960s era as a whole, and much of modern American counterculture have been synonymous with San Francisco and the Haight-Ashbury neighborhood ever since.\n \nThe area is similar to what Granville used to be in the 90's and is grunge punk, alternative and 70's hippie with a commericial drive twist.\n \nInstead of doing the typical tourist thing we decided to take the BART @ $8 each and just walk around and do some exploring in a familiar throw back area with a culture that we were familiar with.\n \nHere are some yelp reviews of what Peter and I did in and around the area.", "author": "Shila B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-06-17", "description": "The Haight, while colorful and full of freaks, is getting a bit old and blasé for me.  The shops don't draw my attention any more (I've been away for 12 years).  If my hike hadn't taken me to the Haight I wouldn't have been disappointed.  I don't think I'll be returning for quite a while.", "author": "Tim L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-07-22", "description": "This was a HAD TO for my husband while we were on our honeymoon staying in Sausalito. Besides, his mom and my dad were both huge hippies back in the day and had both experienced this area when they were younger when it was in its prime. I had to take one star away, but for a few things wrapped into one because this really was a good experience for us. \n\nYAY!:\n\nLots and lots of history here. You gotta love it. Also, lots of really cool, hip stores and shirts are very fairly priced, not over priced like lots of touristy places are. \n\nI really wished we would have dined here to get an even better experience. \n\nI LOVED the Bob Marley mural that they had at the Central Haight Market was bad ass. Had to take a butt load of pictures in front of it and of it. We also bought stuff from there too to add to the experience :)\n\nLoved that they had the hippie bus drive by. I so felt like I was living in the 70s.\n\nNAY:\n\nTotally wasn't cool with all the people there trying to hit you up to support their causes, etc. We got stopped by this one guy that kept wanting us to donate money monthly for the gay and lesbian alliance. I totally support that cause, but I'll sign something, I'm not in the position to be donating 50 bucks a month right now. \n\nParking is crappy.\n\nWayyyy too much traffic.\n\nHowever, I can't wait to go back :)", "author": "Hailey Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-06", "description": "Well, it's your typical tourist attraction...\n\nFun gift shops, dirty \"hippies\", good places to eat. The Haight Ashbury has it all, including the home of the stinkiest McDonalds I have even visited!\n\nWe always come here on a weekday morning if we need to. We usually will grab breakfast at the Pork Store but on this occasion my husband needed a new pair of sunglasses. His favorite cheap sunglasses place is in the Haight so we decided to take a trip. The parking meters are pretty expensive but a nice thing is that there were plenty of spaces to choose from.\n\nIts always a quick in and quick out mission when coming to the Haight. You never know when someone is going to ask you if you want some bud or acid.", "author": "Andy S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-02", "description": "What's there NOT to say about Upper Haight?! It reeks of pee and trash and is covered with graff but with this is filled with tons of history, art, style, fashion and fame.  \n\nIt's such an adventure coming out here especially since you don't know what or who you're going to run into.  That element of nervous anticipation is such an adrenaline rush sometimes...it's so much fun.  Specialty shops and eateries line Haight and it's surrounding neighborhoods that it becomes a little difficult to decide where you want to go at times.  Flipping a coin will likely help with this dilemma.  \n\nBe sure to swing by here to experience the culture and pizazz of old San Francisco.  The shops here do close early so be sure to make it out here earlier in the day to catch all the good-good.", "author": "Cat V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-23", "description": "Vibrant & Eclectic Neighbourhood with a Hippie Vibe, Lots of Character & History, & Unique Shops - Great Place to Stroll, Explore and People-Watch!\n\nMy mother and I visited the neighbourhood of Haight-Ashbury during the afternoon of July 30th and again on the afternoon of August 1st. Haight Street is easily accessible via public transport (MUNI bus). \n\nHaight-Ashbury is an eclectic, vibrant and interesting neighbourhood in SF with a unique, laid-back and hippie vibe. The neighbourhood has a lot of character and the main avenue, Haight Street, is lined with unique and independent local shops (smoke shops, vintage thrift shops, bookstores, music and movie stores, tattoo parlours and more), cafes, sidewalk markets, and lots of restaurants. Haight Street was crowded and there were lots of people walking the sidewalks in the afternoon. However, when we wandered off Haight onto the residential side streets, there was nobody else there and it was so peaceful, calm and quiet, which was great considering how close these areas were to the bustling and vibrant Haight Street itself. \n\nWe walked from Golden Gate Park and then continued along Haight Street towards Buena Vista Park. I enjoyed visiting the Haight Street Market, where I found a large variety and great selection of fresh fruits and vegetables. The most iconic intersection in the neighbourhood is that of the streets Haight and Ashbury. During the 1960s, this was the corner where the hippie counterculture movement comprised mostly of young people, would gather. What can now be found at this corner, is a clock attached to the corner of a building that is permanently set to the time 4:20. Also at this famous intersection, is a Ben & Jerry's ice cream shop, where my mother and I sampled a delicious (but expensive) bowl of ice cream. \n\nWhile strolling down Haight Street, I loved checking out some of the many local and independent shops, that are completely unique to San Francisco and specifically, this street. I explored thrift shops selling vintage clothing and mementos, book stores and even a smoke shop (the young male cashier who sold me a SF magnet was completely high on drugs and could barely complete the transaction! It was hilarious to watch). I also enjoyed seeing some of the beautiful and colourful murals that were painted on the walls of buildings on some of the side streets stemming off of Haight. \n\nAlso along Haight Street sticking outside of a second floor window of one of the buildings, was fake female legs with fishnet stockings, looking like they were kicking the air! Very interesting indeed. \n\nI found the entire neighbourhood and the people living/walking around there, to be absolutely fascinating and very unique! The people-watching opportunities were abundant and fantastic and I observed many interesting characters (for example, two men walking down Haight Street completely naked and confident; a man singing very loudly on a street corner; young and homeless looking backpackers openly selling marijuana to passersby; people with hair colours that resembled the rainbow, and much more). There were quite a few homeless and substance-addicted individuals congregating on certain street corners along Haight, to the point where there was a strong police presence in some areas. But, I felt very safe wandering around this neighbourhood during the daytime. You will also probably notice the strong aroma of marijuana wafting around everywhere. If this bothers you, just be aware that this is what the Haight neighbourhood is like. \n\nI also thoroughly enjoyed venturing off of Haight Street and wandering through the residential side streets and neighbourhoods to admire the beautiful Victorian houses. The streets were very steep and walking almost vertically uphill was challenging, but it was worth it. The old houses were so pretty and painted in a wide variety of bright and beautiful colours, and they all had such unique and detailed architecture. My favourite row of houses was located on Central Avenue, just north of Haight. The colours were so bright, vibrant and beautiful! \n\nAfter exploring some of the residential areas, we discovered the gorgeous, peaceful and quiet Buena Vista Park. The park consisted of a huge hill, covered in dense foliage, with pathways spiraling up the hill to the top. My mother and I were the only people in the park during our afternoon visit, and I loved walking uphill through the forest in such a peaceful and calm atmosphere/environment! At the top of the hill, was a lookout area with a park bench and a clearing in the trees which overlooked the entire city! The panoramic views were absolutely incredible and I couldn't believe how high we were standing above the city. It was so amazing to be able to enjoy and savour the view in complete silence and being surrounded by such natural beauty. \n\nOverall, I thoroughly enjoyed my experience exploring Haight Street and the surrounding residential neighbourhood! It felt authentic.", "author": "Brittany T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-09-25", "description": "\"You guys wanna buy reefer?\" \n\nOur visit wouldn't have been complete without getting propositioned on the street. Here in California, where just about anyone who wants a pot card can get one, there was something... quaint... about hearing it.  \n\nAfter a couple decades of just driving past Haight Ashbury, I finally made a point of finding a parking spot (no small feat) and taking a walk down the world famous hippie thoroughfare. \n\nIt's not as in your face about the Turn on, Tune in, Drop out counterculture these days as, say, Venice Beach is. That felt oddly disappointing (much like the first time I realized the corner of Haight and Ashbury had a Ben & Jerry's on it). Time marches on and never looks back, I guess. \n\nI do recommend visiting. Ignore all the talk denouncing going anywhere because tourists do it. Why even live in San Francisco, then? Inevitably tourists have rolled down every street just looking at houses. There's at least one worthwhile reason people flock to something, and you should find out on your own.\n\nHaight has more going for it than the Venice boardwalk, what with the indie bookshops, fresh produce markets, pricey vintage shops, restaurants, and galleries alongside the smoke shops, colorful murals, panhandlers, and occasional buskers. More yuppies and hipsters, but oh well.", "author": "Christine A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-03", "description": "Flashback to '06...I loved walking the streets of Haight-Ashbury in search of a great place to eat and then a good pair of jeans. The neighborhood sits just so as to attract a great combination of sunlight and distant sea breeze. It was a supreme spot for people-watching and immersion in the nostalgia of the 60s...fun times.", "author": "Roxanne E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-29", "description": "Brittainie B. is right on with her 3.8-star feeling.  The Upper Haight was my introduction to San Francisco.  OK, not really my introduction to San Francisco, but my introduction to living in San Francisco where I live in San Francisco.  I thought it was dirty, grimy, and a hassle; and it is.  But it's also beautiful.  There's Page Street.  And Buena Vista.  And St. Agnes.  And Janis Joplin's house.  And those wonderful Wednesday and Friday parking spaces that I used consistently for two years or so.\n\nThere's plenty more to love, but I miss so much too.  Lori and Kristin G. have moved far away, so there'll be no more safety-in-numbers walking on Tuesday nights or Broderick Street turf wars.  And the idiotic traffic circles made pedestrianing so much fun, you see.  And random Indian places that keep closing and opening again.  And GUMPTION.  Not most of all GUMPTION, but that's a lot of the appeal these days.\n\nIt doesn't deserve the same rating as the Lower Haight, which is much more down to Earth.  But if I were to say that I'm not a fan of the Upper Haight, I would definitely be lying, and one thing I try ever so hard not to do in my Yelp reviews--my life is a different story--is to lie.\n\nAnd I guess what takes it over the four-star top is that Gavin Newsom doesn't live here anymore, and that's always a bonus.  How are you enjoying Marin County, Mr. Mayor?  Scumbag.", "author": "John S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-04-03", "description": "As someone who has a more boho style I was looking forward to doing some hardcore shopping at Haight-Ashbury. I was really disappointed with the stores, however. The area wasn't very big, and a lot of the stores were just full of the same stuff I have back home in NY. There were a good number of thrift and vintage stores, but the prices were tourist trap prices. I found a gorgeous vintage bakelite haircomb, but the price was really inflated, ditto for the clothing and shoes. I ended up only buying a couple of things from two shops.\n\nThe only shops I really liked here were Piedmont Boutique, which sold a lot of glitzy costume pieces (hair clips, gloves, tights, etc...) and Pure Land, which had really nice hand beaded belts and raw silk scarves. The rest of the stores were just kinda meh.", "author": "Iron Man H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-09", "description": "During our most recent day trip into San Francisco, my brother-in-law drove us through Haight Ashbury.  All these years, I had never seen the place.  I'd always been curious about it though.\n\nWe were unable to find good parking so too bad.  It would have been cool to get out of the car and check out all the neat looking shops, restaurants, and boutiques.  People watching would have been nice too.  There were quite a bit of \"hippies\" milling around with the tourists and locals.\n\nOh well, maybe next time.", "author": "PatrickJ T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-10", "description": "Iconic. This is the ultimate SF hippie, peace and love, Rastafarian SF place to be. Scents of Nag champa and Weed can be smelled from anywhere you turn. There are a lot of cool touristy shops, and a lot of awesome vintage stores. If thats your thing, definitely go here when visiting, the style is different but guaranteed to find something special.", "author": "Dalia G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-17", "description": "Love this area, lived there & hung out there when I was on tour with the Grateful Dead. Such eclectic shops and great people watching.  I love my old hippie home", "author": "Al W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-07-04", "description": "Since we're relatively new to SF, hubby and I enjoy walking around different 'hoods to shop and eat.  \n\nHaight was an interesting mix of tourists and grungy 20yr olds who think being dirty, homeless and high is cool. \n\nI loved all the vintage shops but their pricing seemed so out of whack with similar places elsewhere in the city. I guess you can add 50% to prices so tourists can proudly proclaim that they bought it in the Haight.\n\nIt was also a surprise to see so many \"no dog\" signs on shop doors. SF is so dog friendly but when I asked shop clerks \"why\" most said they have had problems with leg lifting, aggressive dogs (usually accompanying the dirty hip street kids) and assorted other problems. Thanks irresponsible owners! Very few restaurants had outdoor seating so we had to walk to lower Haight before we could score a dog-friendly spot for dinner.\n\nIt made for an interesting afternoon but I'm not sure I'll make Haight one of my regular stops.", "author": "Kim W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-07-05", "description": "This place isn't awesome. Granted we did just drive down haight street. We did this because we wanted to see the area on our way to golden gate park, parking is bad, and we didn't want to spend anymore time walking from store to store. \n\nAfter hearing raving reviews about this trendy, hip area, I was very disappointed. I didn't see anything that made me want to stop and stay. I saw a couple restaurants that looked neat, but no stores. The stores were mostly vintage stores, so if you're looking for that than this place is for you. \n\nMy opinion, it's worth driving by and seeing. Don't get your hopes up, it's just ok. There's some cool street art and some hippies that hang out there, so that's pretty cool. Kind of dirty, but that's the atmosphere, right?", "author": "Katelyn R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-09", "description": "Oh Haight Ashbury, you always make this neo-hippie feel right at home!\nHaight Ashbury is a lasting symbol of yesteryear's counter culture. In an amusing evolution of an area once populated largely by hippies who eschewed materialism, Haight is now one of San Fran's best and busiest shopping streets. The majority of shops along Haight Street:\n*vintage clothing\n*toys and/or art \n*curio boutiques\n*smoke shops \nHaight Ashbury has some of the coolest, funkiest shops in the city, and there's interesting cafes and pubs tucked inbetween them. Grab a window seat and enjoy some awesome people-watching! Plus Haight Street runs into the beautiful Golden Gate Park... you can walk down one side of Haight, take a rest in the park, then hoof it back on the other side of the street. \nUnless you have a problem with shopping and/or street kids asking if you can spare a joint, Haight Ashbury is a fun touristy way to spend a day, and possibly a good chunk of your paycheck. Oh and parking is a nightmare, so plan on parking at least a couple blocks away.", "author": "Summer M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-12", "description": "Very eclectic neighborhood! We took the bus from Market St. to get here for breakfast. The rows and rows of Victorian houses are gorgeous! Someone on the street said they go for 2 million! EEks!\n\nThere a lot of cute little stores, shops, restaurants & markets that you can spend your day at. \n\nDoesn't feel so touristy so that's a bonus. \n\nI'd like to come back and have a drink at one of the taverns here.", "author": "Harlow H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-12-21", "description": "There are hippies.  There are neat shops.  I don't think I would go out of my way again.", "author": "Jasmine C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-27", "description": "touristy: yes. But.... is it a fun place to walk around, people watch,and feast on delicious Escape From NY pizza? YESSS!!!\n\nI enjoy the bums trying to sell me pot, or sometimes as for it. I enjoy the little pubs and music stores and vintage stores. This place is different, and I am ok with that!", "author": "Amanda C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-11", "description": "Although it won't live up to what you expect from books, movies, and other media, Haight Ashbury is still a must stop around SF. Lots of cool shops to check out that will keep you busy. Not really a hippie mecca like it once was. Instead you'll see a lot of tourists and posers rocking tie dye and walking around. It's more fun to imagine what it was like back in its hey day though and trying to get some enjoyment from that.", "author": "Joshua C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-05-26", "description": "I've lived within two hours of this place almost my entire life and had never been here before joining my in laws for a weekend in SF to conclude their west coast vacation. I'll be fine if I never go back. I didn't hate it, I didn't like it, I was just there. I didn't buy anything, didn't eat anything, didn't give any change to homeless people. I just walked around waiting for everyone else to shop. It was interesting, even entertaining in a way, but mostly, it just made me sad. I wish I had given all my change away, maybe we could have left sooner without being able to feed the parking meter. \n\nAnd I could have gone without seeing the two very tan, elderly, naked men.", "author": "Paul L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-08-09", "description": "We drove up this famous strip out of curiosity and I must say it was sort of disappointing in that it didn't really live up to its reputation of being a really artsy Hippy Haven. Being from Southern California it really just reminded me and my friend of a much smaller and less exciting Melrose in the Los Angeles area. Like Melrose I'm sure there was a time when this area probably did indeed live up to any reputation it may have garnered, but what we found was no Hippies, no parking (just a slow drive for us,) and a short commercial area that would be more entertaining to someone who just loves to shop. Neither one of us needed any of the wares that any of the stores had to sell so thank goodness this area was small because it left very little to be desired!\n\nIt was depressing to be here, but just not enough to eat away my sorrows with a Cherry Garcia from Ben & Jerry's shop!", "author": "Chad A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-08-31", "description": "I liken this to our Venice in the Los Angeles area. Bohemian boutiques, record shops, and lots of pot-related paraphernalia.\n\n.", "author": "Melissa C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-10-09", "description": "I remember when the upper haight was cool with punk rockers in the early '90s, now it's just a haven for gutter punks and loser ex deadheads. The tattoo on your face was not a good idea, man. Watch where you step too, land mines are everywhere. Nasty.", "author": "Pickle R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-04", "description": "Haight Ashbury. A district known to all, yet not all would give a chance to know. Here, although we would like to embrace the hippy cool, 'we love everyone' type of groove, it's not always so. If you're a business woman, who appears too well dressed, and talks on her cell phone as she walks, making appointments... people will tend to give you cold stares of 'WTH are you doing here woman! Get out before someone socks you in the face!' Well, this woman isn't me, but is my mum. My mum is actually quite sweet, and give her a chance, you'll see that she's just like the rest of us. Big sensitive babies, who just want to be accepted.\n\nThat's why I give the four stars, instead of the five. I really love this district. I came here many times during my life in SF. During high school especially, I'd walk from my home and just spend hours in this district. I loved the shopping at all the vintage and second hand stores. The delicious good eats found on every single block. The cool shoe stores, that would fit my love of high ass platforms. The tattoo shop, I took my brother to, when he turned 18. Back then, you needed an adult to accompany you, if you were under the age of 21. His tattoo was actually for free, because the dude told us we would be next, and we waited for lilke an hour, and he didn't have time to start on my brother. So he said if we came by tomorrow, the tattoo would be free. So we did come back, and the tattoo came out like a sea horse. I loved that it accidentally looked like a sea horse. Sea horses are cool creatures. The male carries the baby in his tummy! That's a world I'd like to live in some day. Fishes are such cool creatures.\n\nAnyhow, as you can see the Haight Ashbury carries many fond memories for me. Me and a few of my gal pals from Lowell High, would meet up on the weekends to explore the eclectic stores, and my best friend, Kristen and I, would go to the hair stores, and buy hair coloring kits, that we'd take back home to experiment... I tried so many colors during my high school years. Red, black black midnight, dark blue, light blue, magenta, red wine, light brown, blond...etc. Yup my hair coloring days are over, but it was fun back in the day. Even for my Lowell High School picture, I dyed my hair light smurf, bright blue. My other Korean classmates did the same, some coloring their hair red... we wanted to represent the Korean Flag. Sweet.", "author": "Hannah Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-13", "description": "It's a little more touristy these days. The more touristy it gets the more it pushes out the original energy. Still, it's a fun place to walk around for a day. \n\nListen to some of the conversations. (\"It's just the gutter punks pushing their negative energy on me, man. They're ruining my flowers.\")\n\nRelax, feel good, buy some pot, relax some more. We enjoyed an awesome book store and a cute little market. \n\nI told CP to take a picture of the street sign, \"This is the one we came for,\" I said. And in a way, it's true.", "author": "Tai F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-09-19", "description": "I have a love/ haight relationship with my hood.\n\nLove:  Its right on top of one of the most amazing public parks in the world. Plenty of shoe shops, fantastic local market with amazing fresh produce- like a cheaper better Whole Foods- Haight Street Market, numerous public transportation options, lots of bars and restaurants, and centrally located.\n\nHaight: The historical significance of The Haight has been diluted by giant head shops catering to tourists seeking the remnants of the 1960's.  Saturdays and Sundays are usually a maze of tourists and panhandlers.   The street use to be a tree lined neighborhood but now there are only a few scattered trees remaining.  After a couple of storms broke branches or roots tore up the sidewalk they were removed.  A couple of attempts to replace them were met with demise from local street vandals who pulled down the tiny saplings.  Result, the street no longer has the the foliage beauty that it use to have and unless local merchants and residents start caring about the street again its likely to stay that way.", "author": "V R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-10-10", "description": "Cool shops, cool people, cool sights, and cool... smells? (haha to the mj smoke cloud following me down the street)\n\nA lot of unique shops (some chains like True, Buffalo Exchange, Pure Beauty), but most of them fit into its bohemian history & atmosphere.\n\nAlthough I can't say that I quite fit in here, it's a nice and fun stop if you are from out of town! All of the stores have such interesting store fronts and signs, and there's so many things to look at! \n\nLike most cities, it's a little dirty and filled with crazy or homeless people.", "author": "Jacqueline V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-31", "description": "Cool vintage clothing stores and coffee shops make-up the once known home for the '60s \"Summer of Love.\" The Grateful Dead, Jefferson Airplane, and Janis Joplin all lived within a couple blocks of the famous Haight-Ashbury intersection. Many different people, from street kids to European tourists to musicians, take the streets of this colorful neighborhood, to walk, talk, and shop, and to take pictures of the many murals painted on the brick buildings. Of course, all must get their very own image of the Haight-Ashbury street sign!\n\nAside from taking pictures and people-watching, the Haight is great for shopping! Two favorites: Dollhouse Bettie and Amoeba Music. Check 'em out! Before you leave, don't forget to make a stop across the street to Hippy Hill. \n\nTip: if you want to go there while anything is open, be sure to visit between the hours of 11:00AM and 6:00PM. \n\nThe Verdict: Go for the records. Go for the vintage clothes. Go for the history. Go to support street kids. Whatever the reason, find one and go!", "author": "Cara S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-10-21", "description": "Loved shopping here as a teenager (had a crushed velvet stage, skirts, tanks, dresses- my style was a lot different at age 18, mixing clothes from Esprit, the Gap, Contempo and the stores here), still loved today. The vibe is eclectic, free spirited, bohemian, independent, and unique. Yes, it was known for many years because of the Summer of Love, drugs and hippies. It's become a hodge-podge of ethnic restaurants- caribbean, mexican, thai, middle eastern, indian, etc., cafes (coffee), bars (nightlife), bookstore, boutiques, vintage stores and thrift shops (ooh).\n\nHere's what remains from when I shopped here as a teenager: The Wasteland (a tad overpriced), Villains (yup, same category), Buffalo Exchange (love love love this store- this location is what started my preference for this store; my brother's friend told me about this place), Goodwill ( we found a GPS holder NIB for $4.99), Aardvark's Odd Ark, Amoeba, and Recycled Records. I liked a cotton clothing store called Dharma, too but it's no longer there, oh well. \n\nThe ones that joined later on, that I really like are: Ben & Jerry's (they have the Vermonster here- for those of you who don't know this about me, I love ice cream, frozen yogurt, frozen custard, etc.- it is my dessert of choice, much like chocolate is to my husband, but no, I couldn't finish the Vermonster myself, are you crazy?), and Crossroads Trading Company (april/may 2010- found a plaid wheat colored Dooney & Bourke wristlet for $10, which retailed for $55- I went to the one at the Castro years ago; that's how I found about this one). \n\nI wanted to go into \"Held Over,\" but sometimes when you see the word Vintage, it screams \"expensive.\" At least, that's what it means sometimes in LV (The Attic). If you like doc martens (I still have three pairs that I wore when I was in college- they last forever, if you get sick of them, take them to Buffalo Exchange), check out John Fluevog's. If you like Stussy, you're in luck, there's a store here. There is much more than I mentioned, BTW. Pretty much something for everyone.\n\nAnyway, in restrospect, this is a unique colorful place as a whole, and I love the thrift stores, so I will always be back whenever I'm in town. Parking can be tricky (used to park on the side streets as a teen) but if you're lucky, you can find a spot with a meter and fill it with coins, as you might be a while browsing; my husband had to make a few trips there, had to be honest about that. \n\nYeah, part of the area (broken into two parts, but I really didn't go the entire length of the district as a teen) is gritty, might be dirty (every city's got 'em- the dirty part of LA, for example, is Hollywood Blvd.- gross), and homeless people are around the corner, but in all my years of shopping here (usually with my sister, best friend, and BF at the time), I've never had a problem with the people here- you see every type (goth, yuppie, druggies, free spirit, casual, families, singles, older, tourists, locals, etc.) here, for the most part, actually get along, gasp, imagine that. I cannot say the same for the experience at night, because I ventured here mostly during the day time. It might be different, worse, I don't know, but I can't comment on it.", "author": "Margret C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-12", "description": "The shops there are very unique, so all shopaholics must make a stop here!  And for music lovers, there's Amoeba music which is a huge store.  And even if you're not a fan of music, just peek inside to see their huge selection of posters.\n\nAnd like the previous review, try to take public transportation.  I was lucky to find parking the times I visited there, but it was very stressful.. It took me an hour the last time!", "author": "Vira P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-08-19", "description": "It's been a long time since I've been in the Haight, but I doubt much has changed. \n\nResidents nearby avoid Haight Street, with good reason. \n\nThe Panhandle section of Golden Gate Park extends into the Haight. It is \"home\" to packs of homeless kids who shake down people and businesses in various ways when they're not cavorting around in the park chasing each other with knives because of drug deal misunderstandings. \n\nThe \"Summer of Love\" with the flower children lasted about three months. It didn't take long for predators to move in on the prey. The prey is gone. All that is left are the predators and tourists who don't know any better.", "author": "Andrew T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-06", "description": "Kind of reminds me of Melrose Ave. but in SF, I think this it's own culture and people need to stop by to check it out!", "author": "Yuki A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-12-22", "description": "Haighters gonna Haight.\n\nI come out here every chance I get to visit San Francisco. I like the atmosphere, I like the people, but something feels different lately.\n\nGone are the days of random street performers, weed shops, tourists traps, chatty bongo playing drums (well maybe a couple) haight and ash has gotten a lil more upscale. \n\nNow there's tons of boutique clothing stores, crepe shops, it's actually quite lovely, and yet missing it's hippie vibe, or at least when I went it wasn't there.\n\nI liked the \"local\" feel of the neighborhood, now it feels like another melrose or another stretch of overpriced vintage shops. There are a couple of gems still here but cruised through this place in less than a day.\n\nStill worth a visit out of curiousity, cha cha cha is great for the nightlife. Ridiculous parking mixed with hipsters and you got Haight-Ashbury.", "author": "Ray K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-12-01", "description": "With a tear in my eye, I am so sad about my experience at H/A. I had high expectations - my first time in SF, hoping there would be some remnant of the utopia described in songs and writing from the 1960s. WELP, it's gone, folks. It's gone. This area is dirty and the vibes are WAY OFF. Bad vibes, man. And I am not just talking about the people who hang out there all day and night or the dudes selling/doing/talking about drugs or the street kids - putting all of that aside, the vibe was not a welcoming one by any means. I couldn't wait to leave :(", "author": "Nancy A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-22", "description": "A very nice area of San Francisco to visit. It's different from other neighborhoods for sure. There are so many stores and restaurants and beautiful street art and friendly hippies and hints of marijuana smoke and nag champa up and down the street for blocks. There is sure to be something interesting for everyone.", "author": "Joe N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-20", "description": "The haight has a charm that ive seen nowhere in the country not even new york. Its always packed full of people on the streets. The boutiques and shops along haight street are one of a kind especially the vintage clothing shop. Its accessible by bus and plenty of food to eat and choose from", "author": "Tj J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-10-22", "description": "I was expecting something else from the neighborhood. \nAfter seeing how in other cities with neighborhoods that have historical music heritage they open live music venues, and concentrate around music, I'm surprised that in San Francisco with its hype vibe and cheerful atmosphere no one thought of centering this neighborhood around music. People come here to look exactly for that. \nDuring the last few years many new eateries and clothes vendors opened up, but I saw only one crepe place with live band and it was in its back room.\nThe neighborhood is more centered around weirdos, hippie clothing retail shops, and smoking shops.\nOn a weekend the streets are crowded with tourists walking in and out the clothing and smoking shops, or sitting in the restaurants and coffee shops, and looking at each other. Like in many other touristic places the tourists became part of the attraction. Great place for people watching, and grab a bite of good food, but I expected something else.\nLike my teacher used to say - this place is missing its potential.", "author": "Stephanie A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-11-09", "description": "Hey you, come over here. We're going to ride our fixies down the expensively dirty streets of Haight, past Amoeba, Ambiance, and Villains to take overly artistic photos in front of the graffiti murals on Shrader. We'll inhale the marijuana-fused air of the city, exhale rainbows and lollipops, and absorb the essence of the 60s while frolicking through Buena Vista park with daisy chains strewn through our hair. At Ben and Jerry's, we'll split an Imagine World Peace in a waffle dish, gossip about politics, green alternatives to living, and discuss Michael Pollan novels.\n\nIt'll be a summer of love. Are you coming?", "author": "Colleen M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-22", "description": "#3 stop on my San Francisco Trip :) \n\nI wanted to stop by here because my friend had recommended I visit this street and to be honest, I almost gave up due to the lack of parking. I really should have just parked my car and taken public transportation here... but that's aside the point. \n\nThis street has a bunch of stores lined up back to back and the merchandise range from recycled clothes to vintage clothes. Haight Ashbury was almost like a boutique mixed with a thrift store heaven. There was even an old record store that I really liked right up at the beginning of the street and a nice fresh market place smack in the middle with lots of yummy-looking produce. \n\nIf it hadn't been so difficult to find parking and if it hadn't been foggy/raining, I would have enjoyed Haight Ashbury more.", "author": "Julie Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-11-20", "description": "My dad is a child of the 60's and grew up in the Philippines. He told me once before that had he grown up here his life would have been very different. You can tell by the twinkle in his eye that he meant he'd be on Haight & Ashbury. \n\nHe was the student council president in college and he had ideas of revolution. But in his words, \"revolutions only happen when you're free to revolt.\"  This wasn't the case during his time in the Philippines. \n\nI think he would've been a leader had he been here during that tumultuous decade.  I'm thankful he never made the trip. I may not exist today if he had. \n\nToday we took a drive down Haight and I saw that twinkle in my dad's eye again. I know it looks nothing like it did 40-50 years ago but I don't think it mattered to him. \n\nHe finally made it...", "author": "Nino R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-07-10", "description": "Was visiting the Haight again recently.  My old review still applies.", "author": "Eric H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-03-07", "description": "I love Haight and Ashbury. I used to come here a lot back in the days when new wave and punk rock were in. The place has lots of cool boutiques, little cafes, eateries , vintage stores, record shops,  incense shops etc. The vibe is chill and  if the weather is nice, the place is perfect for hiking or lazing around in cafés and bookstores -- but you'll have to navigate through plenty of panhandlers, Neo-punks, club kids, fashionites, tourists and drag queens.", "author": "Michael F."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-06-03", "description": "Being the quintessential San Francisco tourist that I was and the fact GBF#1 really wanted to check out the Haight and all it's 'thrift stores' I went.  Let's just say I hated the Haight; I'm not a fan of hippies, granola or patouli.  And to top it off just about every shop we went into I was given the WTF are you doing in here? look.  I in turn gave them the leave me the F alone look, I wasn't having it.  \n\nIf you like hippies, patouli, street \"kids\" begging for money, used clothing stores or Ben and Jerry's ice cream you'll like the Haight.  If not I suggest by passing on the photo op of the Haight/Ashbury street sign.", "author": "Me H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-02-15", "description": "i buy all my shit at ross and marshalls so felt a little out of place here.\n\ncool band shirt, bro.", "author": "Son V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-09-14", "description": "This place was more exciting when I was in high school...as most things are.  Still I like the culture that grows around here, the shopping, the random weirdos, the food, and people trying to sell me mushroom chocolates in the alleyway. \n\nBoo to the consumerism, high prices, tourists, and the random obscure shops that don't seem like they should be able to afford rent.\n\nBut yes to them finally getting rid of that gap. Doy.", "author": "Grace Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-01-16", "description": "Amoeba Records = five stars.\nVoluntarily homeless, disrespectful street punks = one star.\nComplete change of vibe one block off Haight in either direction = five stars.\nOut-of-town drivers making it hard to walk in the neighborhood = one star.\nTourists thinking The Haight is a haven for hippies = five stars.\nTourists thinking The Haight is a haven for hippies = one star.\n\nThis neighborhood encompasses everything and anything in between, and when you average it all out, it works out to about 3.25 stars.", "author": "Jim S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-20", "description": "I really don't care about the hippie factor. There are many awesome shopping options here, some cool clothing shops, some excellent restaurants and bars. You've got Golden Gate Park at the one end, and Buena Vista at the other, lots of beautiful Victorians in between. Take it for what it is today. The past is called the past for a reason. It's still a beautiful stretch today.\n\nOh yeah, dealing with the substance abuse burnouts and pathetic street people begging for attention and the young people who show up in San Francisco with no money and no place to stay. If that freaks you out and you can't harden yourself to this scene then probably you should avoid the Haight. The whole city is an aggressive street people mecca, not just the Haight. I think it makes it more interesting but that doesn't make it any less of a mine field. Deal with it or don't. We spoke to a few folks and once you tell them you don't want to buy any bud they just move on. One dude asked us for a cigarette, he was nice and it didn't seem like a routine so we obliged him. We had the good fortune to pass by an excellent drumming circle in the park, it was one of the best we have heard in a long time. You just never know what is going to happen so have to be open to the experience.", "author": "Jef B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-08-30", "description": "I am a neo-hippy - really into the 60s music scene and lifestyle - so this was a MUST SEE for me and I was not disappointed. The area is kind of dodgy, but it was fun to walk around and go in all the shops. Also, I was able to see all the homes that famous musicians lived in around the area - like Janis J., the Dead and Jefferson Airplane. I LOVED this area!", "author": "Mary M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-09-06", "description": "\"Iconic part of San Francisco but the actual shops are a combination of chic, shabby and whatever.\"\n\nCouldn't have said it better myself, though I suppose I may suggest that it's a combination of chic, shabby, whatever, mediocrity, identity crisis, and corporate rape (that one's just for you, Ben and Jerry's, you no longer matter.)", "author": "Tim Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-02-04", "description": "I really want to give this place 5 stars. But I can't. Gone is the idealism of the 60s/70s/80s. Exchanged for a bunch of hybrid cars and our parents attempting to stay healthy after many years of being burnt out.\n\nThis place isn't really much of a hippy place. You'll see tourists, metro hipsters, and trustafarian gutter punks. Yeah, I am talking to you...I know you want to rebel against the \"system\" and not work. But I do work, I've worked for a long time, and you're not getting my change..\n\nI know not all of them are like this. Some are just nomads, some came from abusive homes, etc. But yeah...\n\nThe rest is just the trendy SF fare. You know, it isn't cheap to live here.\n\nTourists suck. Ben and Jerrys is so for them.", "author": "Lana P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-09-26", "description": "Okay so this right here was the second cross street related place I was looking forward to seeing in San Francisco. I was excited to witness some 'psychedelic'  ambiance and people walking around representing peace and love. I might sound like a complete idiot, especially to those who have actually been here. I mean I liked it, but to be honest it sort of reminded me of any other street in LA. It had a bunch of graffiti, boutiques, and marijuana shops. I just didn't get that historic hippie vibe. I don't want to completely hate on it because it is still part of history, but I think the only time I'll be in the neighborhood is if I'm catching a bus in Union Square and going to the Golden Gate bridge.", "author": "Shanel S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-03-11", "description": "Why would anyone hate the Haight/Asbury area? \n\nIs it they might get scared away by people hanging out in front of the stores or corners slighty inebriated need to judge it on that,but judge on the many shops that the Haight offers. This place is outstanding if you like to shop and have unique style. The fact that it may get really crowded at times might scare some away,but don't you do that. Some might say f-it because they can't find parking. Believe me  there is,just come early enough and you will find it. \n\nI love this nieghborhood,shops and all it has to offer. My favorite pit stop is Amoeba record stores and the funky styled shoes places.This area also has some good clothing and dining choices. Even thou I didn't like Cha-Cha Cha that much I still enjoy this area of the city. \n\nNice shops,coffee,dining,ice cream,liquor and *special stores* to peep at.\n\nOh,must add that the homes look quite comfy too.", "author": "Dani D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-17", "description": "I am in LOVE with this place.  I haven't been to many places in San Francisco (think Fisherman's Wharf, Union Square... and that's about it) so coming here was a DELIGHT.  It reminded me of a crazier Melrose.  Shopping's amazing (bad for my credit card), the bars look fun and there is GREAT people watching to be done (think tattoo of giant eyes on someone's back).  I wish I wasn't in L school so I could come here more often but... I can't, so I'll come here for weekend delights.", "author": "Christine B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-12", "description": "I visited this area and loved it. During the day this area was great to walk around and had some super cute shopping. Bought some records, looked at dresses, got a drink at Magnolia, and a snack at Whole Foods. One thing to note, at about 6ish, all of the stores start to close and the obnoxious homeless street punks start to come out. If you're visiting, grab a bus out of the Haight before 6 (because the bus gets sketchy too). When I was trying to leave, a guy tried to sell me hash and nuggets. I didn't bother to ask him what a nugget was.", "author": "Amanda M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-05-01", "description": "This was a great time! The shops were so unique and the atmosphere was chill.  There were so many different things to enjoy. And you have to get a picture of the street sign!", "author": "Ashley C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-03-07", "description": "Aggressive bums and tons of street kid punks who seem to love to roam the streets begging for money didn't seem to phase me. Don't mind them and if you do then you have no spine! I found tons of small boutiques and great vintage shops while perusing both lower Haight and upper Haight. My favorite one would hands down be Held Over and the old Aardvark's which is now Haight Ashbury Vintage. \nParking does suck which we were not concerned  about because why take a car when in the city. It's far easier to just walk or use public transpiration. Tons of taxi's out and about as well.  So, note if you drive you  will be left scouring for parking and less time enjoying the bums and boutiques!", "author": "Christina S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-09-20", "description": "Frommers made the Haight sound like it was the place to be. I think because my expectations were so high, ultimately we were let down. The stores were unique and cool to see, but given the vintage wares I expected vintage prices, but most of the apparel for sale was overpriced and not worth it! That being said it was fun to sift through shops and people watch. We saw a couple drug deals, guys with signs asking for weed, and a man with gold teeth stared at me in a provocative fashion. It's an eclectic area with a lot of diversity as well as socio-economic disparity. Worth a trip, yes, but definitely did not meet the Haight hype!", "author": "Nicole S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-09-25", "description": "Its one of those areas I think I'm supposed to go to in town and the location is good. That said, if you are over say 20 there is nothing much here anymore... unless you need a cheap haircut? really I like the close by Richmond area much better", "author": "Mark B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-12-07", "description": "Haight Ashbury was quite a bit different than what I was expecting. But I suppose in hindsight it makes perfect sense as to how it looks now and how it used to be. I always had the idea that Haight Ashbury was a hippie neighborhood and it was in the 60's. Now it is mostly yuppy so that earthy vibe you may have heard about is muted quite a bit since many hippies turned into yuppies. Still it is an area of San Francisco that is worth going to and check out the cities history. I kind of felt the same way with the Castro District as well. Anyway like I said after thinking about it it makes sense since most hippies are now yuppies that some of the shops look a bit snooty that line Haight Ashbury. Same thing has happened in Boulder,CO and probably many other locations that was once designated as hippie.", "author": "Alden C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-09-06", "description": "Haight Ashbury is a dirty, filthy, homeless infested tourist trap. Don't waste the time and effort required to get here, it's just not worth it. you won't feel safe in this city. \n It's a shame that San Francisco has decided to let the homeless take over their tourist areas.", "author": "Jeff F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-03", "description": "Took my fiancée here for the first time because I knew that she would love the shops there for shopping as much as I do. The hippie style and inscense aroma throughout the streets just lets you know this area is another part of San Francisco history. If you walk the entire area, you can end up at Golden Gate Park also", "author": "Charley B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-27", "description": "I almost wanna say 3.8 stars\n\nAlot of good places to eat here apparantly though i haven't been to any of them. There's supposed to be some good pizza here from what i've heard which is nice considering there really are not great pizza places in the Tendernob where i currently live. Alot of cafes around. This place gets alot of buzz so although i was here today in pouring rain, there was still hella people. This place is pretty cool but only on ocassion because i could see it getting old really fast. It's really just alot of stores and things. Some really really cool storessssss, but still...how often are you going to just go shopping. Off the main bust road there are some really coold hidden gems *hair salons, more tattoo/piercing/art places, perfume and organic oil/incense/candel places, more produce makets and afew notable vegan places/icecream* Cool to visit everynow and then but i wouldn't say it's an awesome everyday hangout.", "author": "Brittainie B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-09-11", "description": "Everyone says Haight Ashbury is the place to shop when you go to SF.  It is, if thrifting and weed is your thing.  Other wise, i'd just skip it and go to Fairmont Street instead.  Better shopping and dining experience.", "author": "Jules D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-06-29", "description": "The spirit of the 60's may be alive and well here, but it's all for sale, cheap. And it needs a shower and a haircut, and well . . . a purpose besides selling tee shirts and bongs.", "author": "Erika G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-11-29", "description": "why do i like it?\n-toronado\n-mad dog in the fog\n-rosamunde's\n-that bbq place\n-amoeba music\n-citrus club\n\nseriously? too much good stuff on this street.  the homeless people and junkies just give it life", "author": "Sean L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-02-18", "description": "Haha Haight Ashbury,\neven when I came here the first time i instantly felt naucious around the hipster bullshit attitude here, I cannot beleive how anyone with a bit of personality and self irony would set a foot here, well...... I did and this does not happen often for me,I feel sorry for all tourists that come to San Francisco thinking that they will find any originality in this neighbourhood, it died a long time ago, all you get now is pretentious wannabes...\n\nOnce again, No offence.", "author": "cecilia k."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-25", "description": "interesting part of history to see. lots of great and off the wall shops. however there are alot of homeless people around", "author": "Andrea R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-08-26", "description": "Where hipsters are rebellious against the standard fashion. Yet they all look the same and have the same pompous attitude. You guys arent fooling anyone. I'd say its is just as fake as the residents of LA with their plastic surgeries.", "author": "Alex R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-20", "description": "BEST PLACE TO SHOP IN SAN FRANCISCO. So much fun, an occasional awesome deal, super good time.", "author": "Emily H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-06-01", "description": "After getting some quick take out at a Mexican restaurant in the Haight last night, I felt the need to thank my parents who were diligent and relentless that I did my homework and become a productive member of our society and not a bum.", "author": "G L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-17", "description": "Since we finally found a parking spots for me to go to kidrobot, we decided to stick around a bit longer to walk around. \n\nI don't know if its the gloomy weather there or because of the dirty streets. I wasn't the biggest fans of Haight Ashbury  \nThey do have some interesting small stores.\n\nI guess I just like Melrose better.", "author": "Chow-time W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-09-24", "description": "Stars for being a part of history that continues to draw people to the tiny city of San Francisco.  Also, for drawing so many great and intelligent people to the city in it's hey day.  Although the neighborhood has a certain unpleasant stench at times, it is still fun to come every once in a while and enjoy the excellent shops, and some terrific food. (Check out Ploy 2 on the corner of Haight & Stanyon)", "author": "Jennifer L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-09-16", "description": "WELCOME TO THE HAIGHT!!!\n\nyou want food?\nthey got food!\nyou want some style?\nthey got style! \n(or something that closely resembles it...or maybe it's just lacking class)\nyou want some designer toys and paraphernalia?\nthey got designer toys and paraphernalia!\n\neverything i want within spitting distance. urban sprawl complete with unadulterated, corporate free (?) merchandise and all the accouterments to go with it.  \n\nhell...they will even throw in some Harri Krishna's for shits n giggles!!!\nhowever i could do with less third world and more metropolitan...", "author": "John-Michael C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-05", "description": "Ever since I went away for college, one thing I miss about San Francisco is shopping around Haight. The shops around are definitely unique, you probably won't find a place like it... well, Telegraph is similar to half of Haight. \n\nThe reason why I'd give it four star is because every time I decided to take the car out and happen to be near haight, I can NEVER find parking! So, I'd take the bus!", "author": "Lianne D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-08-27", "description": "This place deserves far more credit than we're giving it. Compared to other neighborhoods, I feel like the Haight Ashbury has done a nice job of keeping the youthful vibe in its gentrification. Likewise, there's an amazing cross section of society in this neighborhood that you can't find anywhere else. \n\nIt deserves its' hype as a local attraction even when I hate the fact that some people stomping these grounds aren't my posse, and that the stores are getting damn expensive. But when I walk these streets and browse the stores, I'm still amidst an amazing vibe.", "author": "Andrew C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-12-20", "description": "By the time I made it here damn near everything had closed up except a few eateries. The minute I got out of the car to try & get into the Dispensary I was approached 2 different times with offers of the chronic. Well I was too late for the store so I ventured up & down the block checking out the different stores and people. Not my mother's Haight-Ashbury but definitely a unique blend of culture.", "author": "Scott D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-01-31", "description": "Touristy, dirty, and run down.  An unfortunate end to a place which birthed the hippie movement in America.  If you want trinkets, records, or souvenirs, here is your place.  There are some good cheap restaurants and bars in the area.  Watch out for young people--who are strangely dressed like normal people--walk up to you in restaurants to ask if they can eat some of your food or leftovers as if this is some continuing vestige of the Haight's illustrious past.", "author": "Ethan B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-29", "description": "Awesome place to check out.  Very Hipstery and there are some cool boutiques.  Plus let's not forget, the RVCA store!", "author": "Shad B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-10-26", "description": "I came out here, visiting , my X took me around town. Haight & Ashbury ,is like our South Street District, with lots eateries, pubs, cute stores, tattoo parlors, used record shops-funky boutiques. My x was under impression you had to dress a certain way to hang out there*(Mind you he is coo-coo for cocoa-puffs) on anti-depressants-just wear what you like who gives a F***??!! Anyway, his loony sister came out , too-I didn't care-nice time, we ate at the local place, had their own in-house root beer-nice-not overly sweet-Grabbed a couple tanks for the gym-liked it out there . It 's quite eclectic.., all kinds of flavor & people. Great time!! Even with crazy X. LOL", "author": "Jenn W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-08-17", "description": "The shops here aren't that great--the 2nd hand stores are the best places (wasteland, goodwill, crossroads, etc). The smoke shops are great for seeing some pretty awesome bongs.\n\nThe best is the park though--right near hippie hill, where there's often some great festivals.", "author": "Shauna T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-07-26", "description": "Iconic part of San Francisco but the actual shops are a combination of chic, shabby and whatever.", "author": "P G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-07-24", "description": "I drove through several times. Wish I had time to walk through. Lots of neat shops, interesting people and beautiful Victorian homes. There were what appeared to be a lot of homeless youth in the park but, they looked as chill as everyone else. I have heard the neighborhood is sketchy but, it looked fine to me. Maybe nighttime is different. Next visit I will make time for at least an afternoon here if not a full day.", "author": "Ellie S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-10-11", "description": "Dirty and some more dirty.  Bums and some more bums.  My wife and  I stopped by today while we were on vacation.   I'm from way down south and  have been in some pretty seedy places - juke joints all over the MS delta, bars all over New Orleans, etc... I have never been in a place like this and don't know if I ever want to come back.  My wife was pretty much acosted by 2 males right by the McDonald's... when they saw me (6'2\" - 245 lbs) the bums backed off.  About 2 blocks down, we were offered 2 joints.  It's one hell of a place.  I don't think I will ever come back... unless they need some demolition work done or the police need a hand.", "author": "Hess R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-07-29", "description": "This place is living on fumes of social relevancy - all the \"hippies\" around here are just dumb kids too stupid to realize their following some abstract formula of what used to be cool... Holly Hobbie dresses over flared jeans? Guatemalan jackets? Really? I don't think so. I can't believe how many young people are still begging on the street around here - it's like a third world country.\n\nYou might be tempted to come to the Haight for the Amoeba Records or for Cha Cha Cha but both places have other locations in better parts of the city. \n\nThe only thing worse than the smell is the lack of parking.", "author": "Quartknee K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-10-25", "description": "If you're going to San Francisco, be sure to wear some flowers in your hair and make certain you dedicate half a day to Haight Ashbury. This place is where it all happened in 1967, the summer of love. After decades of neglect and bad reputation, Haight is coming back to life and is really a pleasure to visit. Walk there from Alamo Square and enjoy the most beautiful Victorian houses in San Francisco. Janis Joplin, Jefferson Airplane, Jimmy Hendrix and The Dead have lived here and you can walk past their door.", "author": "CasimirVessel"}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-03-01", "description": "This is my 'hood.  Yes, it can be a bit challenging at times with the homeless youth, doggie doo doo, etc. but truly independent-minded free spirits live, work and play here!\n\nThis neighborhood is home to artists, musicians, filmmakers, writers... in other words cultural creatives and bohemians of all walks.  \n\nOccasionally, the hipster factor is at play on who you see hanging out on the street (mostly because of the vintage and boutique clothing stores).  But the hipsters alone do not define Haight street.\n\nThere are interesting happenings at Amoeba, Booksmith, Club Deluxe any given night; there are yummy spots for dinner &amp; a drink (Alembic, Magnolia, Citrus Club, Ken Zamans, etc.) and if you aren't put off by the occasional sales pitch for \"buds\" then you are guaranteed an interesting counter-cultural experience in the Haight!", "author": "C E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-10-07", "description": "The five or so blocks of Haight (oddly enough pronounced \"hate\") street between Masonic and the park is hippy-ville. The unofficial home for San Francisco hippies and hipsters continues into Golden Gate park as just into it is an area called hippie hill. This whole area does in fact include a number of homeless people (only half of which spend their time pan handling). It's not only the people that makes this the hippie mecca but the shops. The area is full of used/vintage clothing shops, smoke shops, shops selling Tibetan crafts, tie die clothes, records, and no shortage of places to get a tattoo or a piercing. You can even go to some unique shops like Loved to Death which you could buy some bizarre and unique things (like a taxidemied squirrel dressed in Victorian garb holding a hatchet by a chair covered in bird bones- $750). There's no street in San Francisco quite like Haight so go by and check it out. Keep in mind late afternoon/early evening is probably best as all the places are closed until 11am.", "author": "Matt E."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-12-21", "description": "Haight and Ashbury is a favorite place of mine in San Francisco but this year my friends and I felt there was something missing.  It seemed less magical than past years; less shops, the vibe was weak, more homeless kids than previous years.  I couldn't help wonder if it was just me changing in my life or if this historical place had changed so much in just one year?  I could still feel the musical scene of the 60s and 70s beneath my feet and I was stoked to be there, and of course I had a great day walking around the streets.  I didn't want to believe that perhaps the dwindling economy was hurting this precious place that had made such magical music at one point, but it seemed so. \nIt took me a moment to forget all the shops, the homeless people, the corporate-ness, and the economy while standing where some of the greatest musicians to grace the earth once stood, but once I was able to close my eyes I felt the vibe I was looking for.  \nGo to Haight-Ashbury and love what it used to be and what it is when you shut your eyes and listen to your heart...", "author": "Jaimie B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-08-27", "description": "I always called this place The Haight, but Haight-Ashbury works just as well :)\n\n\n For the uninitiated, Haight-Ashbury refers to the region around the intersection of Haight St. and Ashbury St., although most of the area seems to be simply on Haight St. It had a reputation for alternative / hippy lifestyles, but now is mostly a collection of fashionable clothes stores, thrift stores and cafes. Still, it's definitely worth a visit.\n\n\n Check out Ameoba music at the west end of the street", "author": "Alistair H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-20", "description": "Gone are the days of the hippie. Its sad. Another SF neighborhood that has become victim to Gentrification and yuppies. But the pot culture is still present. The place is very young and hip, and the occasional hippie is still around. Got to go to Golden Gate Park for the acid though. In the last few months alone it has become more upscale. It isn't the same place that legends and stories speak of.", "author": "San F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-08-19", "description": "Follow the beat or hippie trail through this district and swing by the iconic crossroads", "author": "moonvalley"}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-14", "description": "fun, fun... little noise you can find good things... but some times is better off buy new.", "author": "B H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-12-08", "description": "I love to walk around the neighborhood, check out the stores and just explore. Can get annoying with all the people and crowding but very cool to check out once in awhile and a must-see for someone visiting from out of town.", "author": "Hanan H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-16", "description": "Lots of quirky shops, had a good time and I HATE shopping.", "author": "Tony R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-03-22", "description": "Ageing alternative area with some clothing and shoe stores. Only bright spots - super cheap shoes, Crepe Express and ripe fruit + fresh squeezed orange juice at Haight St Market. A bit grim and not charming at all. Maybe that's the point but I wouldn't go back.", "author": "pj n."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-06-23", "description": "A Place where the SPIRIT OF THE 60's IS ALIVE AND WELL.\nThe Immortal Spirits of Jerry Garcia and Ron\"Pigpen\"McKernan\nTimothy Leary,Hunter S. Thompson,Ken Kesey,Chet Helms,Bill Graham\nJanis Joplin,Papa John Phillips,Mama Cass and Frank Zappa.all surround you.Just wish they were all still with us and at the nearest bar\nwe'd go in and kill a fifth of Southern Comfort with Janis,how cool would that be.Jerry Garcia would have his own Wine Cellar.One thing I regret in life is that I wasn't a youngster during The Summer of Love back In '67\nA time when you could be as naughty as you wanted,and no one would bother you about it-very unlike today,The Grateful Dead lived at 710 Ashbury,and would play free concerts in the street.1967 was a great year for music-you had Jefferson Airplane's Surrealistic Pillow and After Bathing At Baxter's,Moby Grape debut album,Janis and Big Brother-Cheap Thrills-First Grateful Dead album on Warner Bros.Records.\nI wasn't even born then,my parents had just met in '67 and married a year later.I was born 7 years later in '74,but my Dad always played this great music and still is a big fan of it to this present day.That's where I learned to like it,and I listen to it quite often myself.And According to the Music Industry in 1967-SAN FRANCISCO was known as THE AMERICAN LIVERPOOL (as in Liverpool,England).Sadly,the Winterland Ballroom is no longer there,The Grateful Dead were the last band to play there before it closed in 1978,and the establishment was razed in the early 80's,A High Rise Apartment Complex now occupies where Winterland once stood.", "author": "Mark P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-04", "description": "I had no expectations of hippies or rockers when I first visited.  I like the neighborhood, especially for its distance to Golden Gate Park.  I took the metro here and walked to GRSF to buy a comic book.  My boyfriend bought himself a new pair of sunglasses here.  Watch out for panhandlers.", "author": "Ai M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-11-18", "description": "A great area to wander around in! I particularly enjoy the alternative shops in the area. Lots of things to look at in the shops and lots of stuff you aren't going to find just anywhere. It's a nice walk, people are friendly, and there are great places to take photos as well!", "author": "michelyn"}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-08-11", "description": "If you can ignore the more recent, overpriced, tourist-oriented stores, you'll find a lot to love here. Though its Janis-n-Dead heyday is over, remnants of the swingin' sixties are alive and well in the Red Vic hotel, the tie-die t-shirt store, and some of the most creative, highest-turnover, pretty-cheap vintage stores ever. Plus, the street folk aren't scary like some of the city's neighborhoods after dark. They are just as likely to give you a smile and a song as they are to ask for money. As a single girl, I never feared walking here after dark because there was always some bum on the street looking out for me. There is a real sense of community and neighborhood here, and watching out for each other. Plus, it's right near the park and you can hear the drumming from Hippie Hill! Definitely my favorite neighborhood in SF.", "author": "Geae D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-09-24", "description": "Great alternative shopping street just a few minutes up the road on a trolley from the central shopping centre, Lots of hippy/ thift/smoking paraphanalia/cute and vintage shops. The vintage dresses are cheap with the conversion rate, I Could of filled a suitcase. Some of the vintage shops are a bit pricier but they've cherry picked their selection, and you can tell- most of the shops ask you to give them your bags when you enter and they put them on a shelf behind the till ( I think it's to stop thieves) I can recommend the thrift shops for absolute bargainous bargains. La Rosa was the best vintage shop, friendly staff, great items- maybe a bit expensive. The wasteland and X generation are good alternative clothes shops, I ate at Kates Kitchen and came out deliciously filled to the brim for cheap. It took us half a day to walk up one side and down the next and we only went in a handful of shops. A great day out with something for everyone!", "author": "Skintight_Chorltonite"}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-10-27", "description": "really cool place. lots of culture and history. be careful in some parts as its quite dodgy", "author": "simonefrances"}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-11-17", "description": "An iconic area of San Fran. Worth going - we have some great photos. We found some cheap eats too so explore.", "author": "mccak83"}
