{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-05", "description": "This place is a definite must go to place if you're in San Francisco. Easy to find, stay on the floor level and grab your favorite drink. Bartenders are hilariously funny. \n\nFeel like playing pool? There's a pool table towards the back. \n\nFeel like people watching? Go upstairs, sip your drinks & people watch the street below. \n\nDon't forget to grab a postcard and send yourself or your friends some love (psst... they will mail it for you!)\n\nOh.. the old fashioned was perfectly made! $11", "author": "Linda R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-30", "description": "This is a solid place to grab a drink with a friend or two during their off peak hours (aka any time before 10pm) but after that the crowd changes a bit and resembles a frat house -- if you like that sort of thing then this is the place for you! \n\nThe decor/ambiance is modern yet rustic and there's ample seating on the lower and top level. The drinks are be a bit pricey but then again this is SF!", "author": "Danielle D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-08-21", "description": "I literally love the bar and the layout. The only problem is the rudest bartender. Blonde lady with the tattoos.... \n\nI ordered 3 tequila shots and stopped in the middle because my friend did not want one because of her medical condition. The bartender literally yelled at me for 3 minutes about how I was rude for asking her to make it 2 shots.... everyone that was around me was also very confused on why she was yelling at me.(awkward moment) \n\nI've been to Harper and rye for the past 2 years and I'm honestly never coming back because of her. I felt so uncomfortable.", "author": "Amy C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-11", "description": "Stopped into this wonderful corner local neighborhood bar for absolutely amazing cocktails. I love the menu especially because it showed you the type of glass that each cocktail within. Most expensive cocktail with $11. I am assuming they have great beers too but I'm not a beer fan so I didn't partake. My friend lives down the street So that was the impetus for stopping in after a party at a nearby private club. The only negative for me because I am over 50 is the very loud noise so we had to shout to speak. But for me the innovative Mixologist cocktails made up for it. I would definitely go back.", "author": "Tricia Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-12", "description": "I stay close by and go every now and then. The cocktails are decent. My usual go to is the old fashioned. Its not the best cocktail bar but if you are around Polk give it a shot.", "author": "Rohan K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-08-22", "description": "Bar tender attacks a French tourist for wearing sun glasses inside, like she was Ronda Rowsey in her first pro fight. Poor tourist couldn't speak English so it escalates. Don't go to this bar lol. The Bar Tenders May attack you.", "author": "Andrew M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-05", "description": "Great cocktails here. The bar staff really know what they're doing. Very urban feel. Can be both good and bad as you navigate the mean streets of Polk and Sac. Worth the trip, though. We'll be back.", "author": "John H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-10", "description": "This is Brass Tacks, but bigger.\n\nIf you're looking to meet bros in finance, you've hit the jackpot. They are everywhere, in packs, gaggles, herds. I recently went on a Friday around 10, and couldn't move an eyebrow without bumping into four or five of them. I should have known, because they don't serve food here.\n\nReally want to talk to one? Sit at the bar, and reel these bad boys in. \n\nDespite this, the drinks were good, bartenders super nice, and the bar was bourgeois AF. I felt like I was in a really nice leather trunk with great lighting. Additionally, the parrot man from Brass Tacks doesn't come here and I'm afraid of birds...so I liked it.", "author": "Cindy T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-03-25", "description": "Came here on a Saturday night. The bouncer is an absolute crazy person. She harassed our group to the point that we were all uncomfortable getting in. The owner came out and let us all in but the mood was already ruined. Fire her and hire some good people.\n\nUpdate: The owner bought us free shots, that was nice. On my way out I told the bouncer woman that \"she was an absolute pleasure\" and she seemed to immediately realize that no one would seriously say that about her. She then threatened to \"lay us out on Polk St\".", "author": "Spencer C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-08-15", "description": "Decent service and drinks - and quite the large venue. It can get boisterous and borderline brotastic, and besides being, well, a bar with bros, that's about it. If you're already in the neighborhood, and/or dig such a crowd, then you'll be at home here. It won't be an offensive experience, but it can get quite crowded at peak times.\n\nAt the end of the day it's just a bar - like many throughout the West Bay. So there are also many compelling options out there. If you're not from the immediate neighborhood, it might not necessarily be a destination worth going out of your way to seek out.", "author": "Vincent L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-09", "description": "Stopped by this bar when I was visiting the city. It's a pretty cool bar and is pretty chill. I was able to have a decent conversation with my friends. The drinks are good and reasonably priced all things considered, but it does close pretty early (compared to the bars I hit up in LA).", "author": "Brian D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-20", "description": "I would like to counter act a review written tonight. The woman that was here on a work trip from Canada. I saw the whole interaction. She was completely in the wrong and was talking inappropriately to the bartender. As a bartender myself I would have done the same thing and told this woman to leave. I would have actually kicked her out long before, but the bartender here is apparently better than I am. Even the people she was with said she was in the wrong and came to hang out with us to apologize for her. I think it is absolutely ridiculous to write a review because you are a jerk and you were told to leave the bar. You deserved to get kicked out Vika. Deuces.", "author": "Monique B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-10-21", "description": "Posting this while it's still fresh.  Gay guy here, stopping by this busy straight bar close to my house because I wanted a nightcap and I hear they have some good beers on tap.\n\nIt's busy, so I go to the back end of the bar, only one girl ahead of me at the service area.  Perfect, minimal wait while she gets her drink.  But she's chatting up the bartender.  I think, \"that's fine, girls are why everyone is here.\"  Except I wait, and wait, and wait.  They chat, and chat, and chat.\n\nFinally, after about 5 minutes another bartender comes by, takes my drink order (the pale ale on tap) and I give him a $20 (I'd just gone to the ATM and had a single $1 and 5 $20 bills).  He comes back, gives me $4 and runs to the other end of the bar.\n\nWell, then.  I stand there looking at my $4 thinking, either:  1) paid $16 for a glass of beer, 2) he thought I'd given him a $10 and then ran off before I could ask, or 3) he ripped me off.  I'm guessing it's number 3, but willing to discuss #1 or #2.\n\nI wait, try to make eye contact and ask about pricing, and kill time by drinking my $16 glass of pale ale.  Never able to get his attention.  I stayed in the same spot, and tried to get his attention for 20 minutes or so, no luck.\n\nMeanwhile, a couple of couples come back to the service area where I'm waiting (fruitlessly) to see about my beer charge. One of the men tries to get the bartender (who's chatting with a friend) to serve him. Too bad for him; he waits several minutes while the bartender has a few laughs with his friend before he acknowledges the customer and takes his drink orders. I take a bit of cold comfort that I'm not the only one who had to wait, and I hope they don't get overcharged.\n\nMaybe all of that's normal at Harper & Rye (I don't spend a lot of time at straight bars), but I don't have any plans to go back, ever.", "author": "Andrew M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-02", "description": "good place for a happy hour and Friday night. The bar has a very decent drinks menu and the environment is very nice.", "author": "Sharisse M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-24", "description": "Great bar, great atmosphere!! This place is really  popping at night.  It's a huge space upstairs and downstairs. We ordered 2 pirate punch here for 4 peoole....each punch serves about 4 to 6 drinks so it's a good deal! \n\nBartenders are fast and are nice. Definitely will come back here. For once, an sf bar that's not crammed and has alot of room to move around!", "author": "Caitlin P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-24", "description": "Excellent evening.  Great cocktails and bar team.  Night got busier as it progressed as is to be expected.  Enjoyed it all.  Pool table only $1 :)", "author": "Justin C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-18", "description": "Shout out to James for making this night so memorable!! We came on a Thursday night and still had a great time", "author": "Cindy T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-18", "description": "James is the best. Period. He's the nicest and most inviting guy ever, you won't be disappointed", "author": "Kevin L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-12-13", "description": "12/10/16: Santa Con SF\n\nOh my gosh, this place had us wait in line at least 40min - 1 hr because of Santa Con! It was pretty wild, my friends and I walked 20 min feom Buccanan Street to Harper & Rye to meet with our friend's friend, but when we almost reached the front, the friend left to go to another bar. Since we waited in line, we decided to stay especially since we made new friends in line behind us!\n\nA nice dark bar, lightly lit and had an upstairs area that overlooked the bottom/ bar area. The seats were stools with a long table underneath the upstairs area. Plenty of space for people to mingle or lounge around. Majority of the folks in the bar were decked out in holiday gear for Santa Con.\n\nThe drinks: 3 Moscow Mules \nRating: 4/10\n\nIt was way to sour and had too much citrus, with barely and alcohol or ginger beer. It came in tall skinny glasses. \n\nWould I come back to give this place a try. Sure why not, just don't order a Moscow Mule.", "author": "Vivian V."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-05-26", "description": "It's ok! But a bit of an unpleasant vibe, with slow and unfriendly bar workers, and no one clearing the tables. It's good for large groups who aren't able to find anywhere closer to the center of Polk. It's less good for small groups / couples, or fancy drinks.", "author": "Jeremy S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-25", "description": "Thumbs up!!\n\nGood drinks. Cocktails here are dangerous because they blend it, make it well, they are all balanced in taste.\n\nLove the atmosphere.\n\nLove the bouncer, he is awesome!\n\nBut not a lot of chairs. \n\nThey have pool table at the back, which is always occupied. But it's okay.", "author": "Sarah L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-07-16", "description": "If you are looking for pretentious under 25 crowd: we have found your bar.  You can wait 25 minutes to get a beer. You can forget any type of attention for giving an extra tip.  To get into the bar after 10, you have to know the door guy. The beer selection is decent. They have a good old English stout in fun bottles.", "author": "C R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-15", "description": "Great cocktails in a classic SF neighborhood environment.  You can tell a ton of regulars are here as well.  PS. Bartenders are cuties.", "author": "Casey C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-08", "description": "Not a bad place to be on a Thursday evening, especially if you get there early. My friend, boyfriend, and I decided to grab a drink around 7 pm and were able to easily and quickly get drinks from the bartender. My gimlet was awesome! We settled in the mezzanine area (where the pool table is) to people watch. We left an hour or so later to grab dinner, but walked by Harper & Rye later the same evening, and it was packed! I was happy to have been there during a slower time.", "author": "Sarah B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-15", "description": "On Polk near my old apt! Walking on Polk to take a friend from out of town. Saw the place was completely drawn it it. Like i was on natural cruise  control. Head in steaight to tge bar got quickly served by a very handsome server. I said to him, i swear have been here before,  but it looks different.  He says, \"This place was the Red Devil Lounge\". Blast from the past. It still has a great vibe and they mean pour big drinks! Mercury in Retrograde...", "author": "Dianne B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-06-19", "description": "I will preface this by saying that I had been to this bar at least 10 times(different bartenders though) and this time I brought 6 of my Canadian coworkers for a good time. It got ruined by a female bartender who was very rude to all of us at separate times but mostly by spilling a drink on me and acting like nothing happened. When i gave her zero tip (since she never even apologized), she told my friends that i was no longer welcome at the bar and that i had to leave or she would call the cops. She called the bouncer \n(Who was apologetic but obviously at her mercy), and I asked him and her to disclose her name - she would not give it to me. Asked to speak to the manager - she said she was it. She threatened to call the cops - which i told her i was ok with since i was sober and adequate to talk to. Plus my friends were witnessing the whole thing. She got combative and started yelling that we had to leave. She then began grabbing my friends' drinks from their hands and saying no one was welcome anymore and that she would have the cops drag us out. At which point most of us got uncomfortable (again, the rest were my Canadian coworkers who didn't want any trouble with the US law, of course) so we got up and left. Don't go there. Horrible service that WILL bite you if you if you try to tell them what's wrong. Which is most definitely the horrible service and entitlement.", "author": "Vika N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-10-19", "description": "After dinner, my girlfriends and I wanted another drink. Harper & Rye was close by, so we stopped by for one round. It was Thursday, October 15th a little after 8:30pm.\n\nMy gfs stuck with wine since that's what we had during dinner. I was in the mood for a cocktail, so I got the Rye & Apple: rye, sidral mundet apple & old fashioned bitters ($10). I wouldn't get that next time as it was sweet and really weak. I was hoping it would be a little stiffer.\n\nThe vibe here is definitely not my type of bar. I prefer lax bars and this one was packed with a younger crowd. Being in my mid 30s, I felt too old for this place. But we didn't have a problem grabbing a table. They have these long 6 tops along the wall and we shared it with a couple before they left.\n\nI guess Harper & Rye might have been fun in my twenties, but in my thirties, I'd prefer a chiller bar. And with stiffer drinks!", "author": "Elena N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-27", "description": "Best bar in San Francisco.  I couldn't believe how fun it was on a Wednesday night.  Great, strong drinks.  Fun, young good looking crowd, which isn't that easy to find on a weeknight in San Francisco.\n\nThe bartender was so awesome and took great care of my group.  I think his name is Jamal, he gets 20 stars.", "author": "Lawrence V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-31", "description": "Cool upstairs area that can be reserved for parties \nBar area is attractive and welcoming\nService is friendly\nDrinks are reasonable and made well \nOne pool table \n\nOverall Thoughts\n\nGood place to go in the Polk area but gets crowded fast especially on fri/sat", "author": "Eddie W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-12", "description": "Great place to start the night. Drinks were reasonably priced, and not watered down. Place was very packed, so getting up to the bar to order, takes a buy of effort. Bartenders were fast, so that made for a short wait. Security was professional, unlike some other place I went that night. Good times, I shall return.", "author": "Andre P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-11-11", "description": "This used to be one of my favorite bars in my neighborhood until I brought my boyfriend and experienced a truly homophobic bouncer that sent us to the back of a \"new line\" when several women arrived and we had already been waiting behind other women. I'm originally from Texas. This is truly a first for me in terms of homophobia.\n\nWhen I asked inside for a manager to speak with, I was turned away by a waitress who seemed unconcerned when I told her of my experience. \n\nVery unprofessional. Very bad place. Not coming here anymore.", "author": "Greg N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-09-02", "description": "Went to this place last night for the first time because I heard good things. However the bouncer was extremely rude and we decided to go elsewhere after he threatened one of the girls from our group saying \"I run this joint, I do what  I want.\" Unprofessional.  One person's actions affect the entire establishment. Too many other good spots that treat people with respect in the area.", "author": "Josh D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-08", "description": "After a feast at House of Prime Rib, we were looking for a place to hang out a little longer. I had wanted to try a few other Polk Street spots but they just didn't feel right when we walked by. We defaulted to the reliable Harper & Rye.\n\nLiving in SOMA, I rarely make it out to this area (or the Marina). Yes, the people are good-looking, if you're into them. I've always preferred minorities and Harper & Rye is not the most diverse place to be.\n\nThat said, my Moscow Mule was pretty good (although not served in a copper mug). Even though it was loud and crowded by the bar, we were able to find a comparably quieter table upstairs by the window.", "author": "Yi Z."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-07-02", "description": "Terrible service. Rude staff. The atmosphere is friendly but getting interacting with the bar staff was a very unpleasant experience.", "author": "Antonio C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-07-08", "description": "Nice ambiance with small pool table and additional seats upstairs with view of Polk Street. Music isn't too loud. Decent drinks.", "author": "Kimberly H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-08", "description": "The bartender that served me, Jenny, is probably one of the best bar tenders in the whole city. She's a machine... one hand shaking a drink, the other pouring something, and at the same time she might be taking an order from someone else. Sitting at the bar was like a front row seat to a mixology course on fast forward. Harper and Rye is lucky to have her.", "author": "Jonathan B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-12-21", "description": "This place kinda epitomizes what is happening to Polk street.  Where Polk street used to be the go to choice for dive bars, cheap drinks and sf zaniness, it slowly started to become what felt like a spill over of the Marina crowd.  Sure the bars were still divey, but the crowd started to get more Bro-ey, but at least we still had the bars.  Slowly, these bars are starting to go away.  What used to be one hell of a dive in Red Devil Lounge is now a spacious, modern upstart bar that now is starting to resemble to the new POLK.   \n\nI actually do like the venue itself, but yeah, don't expect too much of the Onesie parties to be rolling through.  \n\nDrinks were okay.  Standard, non-standard experimental cocktails and classics.", "author": "Veasna H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-12-29", "description": "Yes it's impossibly packed at night with a douche factor way off the charts... but if you just happen to pass by right when they open on a weekday, it might be worth the pop in. \n\nThey make alright cocktails plus they have Mannys on tap. I've only had Mannys when I've been in Seattle so it was a nice surprise to taste it again in the city. Service, despite it being almost empty when they just opened, was nonchalant but got the job done. Didn't matter since we left before it got unbearable with the crowds where bartender attitude would not fly.\n\nNot enough charm to warrant the long lines and being squashed in like sardines in a can but consider Harper & Rye for a first drink.", "author": "Jon L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-15", "description": "Was in town for business and heard about this place. Stopped in on a Friday night and with a 218 occupancy rate, this place was at it or damn near close. Took 30 mins to get a drink even though the bartenders were working their asses off. Only good part about it was waiting at the bar you got to see them create drinks really fast and with precision. The drinks we had were good and staff was friendly. Just expect to wait a long long while for a drink on a Friday.", "author": "Kevin F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-03", "description": "Nice Whisky bar with a great selection. It can get pretty crowded and hard to get to the  bar but if stop in during a non busy time is could be a gem.", "author": "Eddie B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-07-14", "description": "I've never experienced distasteful customer experience until today. There were two bartenders who overcharged for a drink AND a $2 up pour, like what is an up pour? When confronted the bartender said it was because the whisky sour. I've never experienced that ever. I've provided screenshots of our receipts and of those bartenders who decided to rip us off. They should really face repercussions for this and I would advise EVERYONE to stay away from them and this bar.", "author": "Alexander A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-07-01", "description": "It's pretty amazing that one can get the entire picture of what's gone wrong with the city of San Francisco without leaving this bar. \n\nWhat was once a legendary live music venue & bar is now another yuppie watering whole for the tech employees. \n\nSure its sparkly & cleaner but it's also soulless & devoid of its former artistic culture. \n\nBeing back in this room was truly painfull.", "author": "Jon S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-20", "description": "Really nice place to meet friends or colleagues after work. The atmosphere is really relaxed and the crowd is most mid-to-late 20's. It also gets really busy on the weekends...so get ready to mingle. \n\nThis venue used to once ago be a grungy club/concert venue. But they've closed down and this rebuild of a cafe is far better and inviting.", "author": "Tré S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-17", "description": "The ambiance and full room of dashingly good looking people will draw you in. The bar was very crowded but had a modern and upscale feel to it that you normally won't find in many nearby bars.\n\nDespite the crowds, we had no problem grabbing the attention of a bartender. After asking for two of the strongest shots he had, we were instant friends with him. Hint: even though you beg and plead, the bartenders won't take full shots with you because they're so friendly and get so many offers to-- they might get *drunk* on the job. Rough life.\n\nThere's a great energy in this bar and the alcohol selection is unlike any other.  Highly suggest going here.", "author": "Cassandra L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-01-18", "description": "Fun bar to hangout with a small group of friends if you are planning to bar hop around Polk Street. The drinks were on the weaker side and slightly watered down, but this was the last bar we came to so we didn't mind too much. The drinks are also really affordable and top out at around 10$. The ambiance and crowd definitely skews and appeals to the younger yuppie tech crowd in SF which differs from the divey feel that the rest of the polk street bars embody. They play exclusively EDM music but its a soft enough where you can still hear your friends over all the conversations around you. There's also a fun pool table if you want to get competitive with your friends! There's only one though, and the wait is pretty long so get there early if you want a shot to show off your skills.", "author": "Lisa H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-04-22", "description": "Really chill during the day and for happy hour, but turns into a humid steamy clubby mess Friday, Saturday and sometimes Thursday nights when there's a line around the block. Solid bartenders and whiskey selection.", "author": "Nick T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-13", "description": "One of my favorite cocktail bars. \n\n- Go early to get a bar seat and to avoid a line to get in (usually starts about 9:30)\n- Make nice with the bartenders they'll treat you well\n- Fun for a date / few friends meeting up (it gets busy & crowded so keep it small)\n\nCHEERS TO YOU, BIG SQUARE ICE CUBE.", "author": "Rachel T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-15", "description": "Harper and Rye is a must go to location on Polk. Drinks are a little pricey, but it is an upscale atmosphere without being too snoody. Grab a drink or shots here and it is a great place to begin or end your night", "author": "Ross S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-05-28", "description": "The type of bar you wander into at the end of the night, only to realize that every other drunk moron had the same idea.\n\nFrom head to toe this place reeks of tech bro and man children. Upon entering, the bouncer who was suppose to be patrolling the door and checking IDs was spinning a girl around on his shoulders, acting a fool. We walked in without being checked in, so I'm guessing that's why the average age of this place felt freshmen year in college.\n\nWhen we got to the bar, the flow of bar service was sporadic. The bar tender was literally ignoring about half the bar and just taking the orders of those closest to him. When we finally got our drinks, we sat down to witness around what can only be described as a scene from your worst night in college. 5:1 guy to girl ratio, early 20s pea cocking on everything with a pulse, and the stench of beer soaked floor in a sea of tech bro humidity. \n\nIf you're looking for that end up spot where you'll be too blacked out to remember/care, not the worst spot you can end up at up. For all else, stay away.", "author": "Eric B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-17", "description": "Cool vibe, chill bar, good drinks. The atmosphere is pretty hipster if you're into that and it's a decent space with plenty of seating. The bartenders are nice and I forgot what I got (it was a cocktail) and it was pretty good. There was dim lighting and low music so you can actually hear your conversation.\n\nOverall, cool spot to hang.", "author": "Sophia Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-31", "description": "This place gets packed - why? Because it's fun! They make a great old fashioned drink also - one of my favorite spots to hang on the weekend. The pool table in the back is also super fun for $1. It gets a bit packed, so make sure to head over before 11PM. \n\nGreat chill date spot or if you want to just kick it back with friends.", "author": "Albert K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-05", "description": "I work with the Young Professionals of San Francisco and last week we had one of our most successful events as Harper and Rye, with over 300 people in attendance! The event was a partnership between YPOSF and a local charity. Harper and Rye gave 10% of bar proceeds to the charity and allowed the charity- which works with animals- to bring two adoptable dogs on site. The servers and managers were incredibly helpful and responsive from start to finish. They ensured that our event ran smoothly and were accommodating. Shout out to Jamal for being the best!  Thank you, Harper and Rye, for your contribution to the community!", "author": "Julianna I."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-17", "description": "Really nice environment! I went to watch one of the Warriors games and it was cool! \nIt's not a sports bar or anything but still had a few screens. \n\nIt's more of a casual, after work meeting point to have some drinks, so the people you can find are more the formal-casual workers. \n\nNice spot to hang out, plus you have a ton of restaurants, bars and stores in Polk St.", "author": "Mari Carmen M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-08", "description": "Been to this place twice now and had good experiences both times. Went there last night (Tuesday night) since I had two friends in town who had never been to SF and wanted to show them a good time. This place was BUMPIN around 11 when we went. \n\nI got the gin and thyme specialty drink, which was okay but honestly nothing special. I was expecting a bit more flavor. The vibe was great though and the bartenders were super nice so can't complain too much.\n\nI'll definitely be back again.", "author": "Ilana B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-04-07", "description": "Walked in for a beer or two because I had to kill a couple hours. Saw this place and decided it looked like a great place to hang out. I walked in and counted 4 people inside the bar.. that included me and the bartender. Not a big deal since they were just open for a couple hours and its mid-week. \nThe bartender was a tall scruffy guy that came right over to ask what I wanted. He quickly helped narrow down the type of beer I was looking for and served it up quick, wet, and cold. I like talking with bartenders but I felt he was unapproachable unless you were family or a friend. What a coincidence a friend of his walked in soon after that. It's crazy how his personality changed in a matter of a few minutes. Okay, that's cool. \nI sat there with my beer and watched TV while they caught up on things. Just a bit bored sitting there with the bartender completely engaged with his friend. In my defense I'm not the kinda guy who requires a lot of attention or medication that keeps me from spazzing out. Just the opposite. I had time to kill and wanted to have a couple beers and know more about the bar and its contents rather than learning about it from a google search on my phone... while sitting at the bar.\nI was finishing up on my first beer when two women walked in. The bartender asked them what they wanted and I noticed he went back to the same unapproachable vibe he had before his friend walked in. One of the girls asked a simple question \"what's good here\". To my surprise the bartender without a wink, smile, smirk, or indication he was having  fun with them replied \"everything\". Okay, DUDE! I get you maybe having a bad day but two young, cute, happy, girls walk into your bar and you give them attitude and a stupid reply. You have any idea how may places would kill to have those girls walk into their establishment for a drink or two and maybe call their friends to come join them?! \nSo that kinda killed it for me. It killed my desire for conversation and a second beer.\n\nTo be fair I will go back because I think the bar was done right and looks like a great place to hang out. I'm praying the bartender was just having a bad day.", "author": "Kyle G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-13", "description": "Had a great time at Harper & Rye this past weekend, and it was a bit unexpected from the usual Polk experience that we all say we hate but keep coming back to.\n\nIncredibly crowded with a line outside 20 deep after 11pm. The drinks were well-made though, and a step above the typical non crafty bar cocktail. I especially enjoyed my drink off the hooker. Or I especially enjoyed my drink, Off the Hooker. Commas matter.", "author": "Jonathan Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-27", "description": "I love the aesthetic, the ambience, and the crowd. Definitely recommend anyone interested to pass by. A little pricey but not that bad, we got the punch jar and it serves around 5-6 cocktail glasses with ice for $35-40 with tax and tip, and it's really good.", "author": "Jess P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-07", "description": "Shout out to Ally and Jamal for keeping the drinks flowing last night. Came through on a Wednesday night with two friends and we found a spot at the bar. Took a tour of their solid draught beer and bourbon offerings while vibing with what seemed like the full discography of ATCQ. Great drinks and service - dropped down to 4 stars due to Jamal's reaction when I said he looked like Matt Barnes (you're a dead ringer bro - deal with it).\n\nBrian Urlacher", "author": "Benjamin B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-09-03", "description": "Nice bar good prices but service is really slow.\nThey need more staff. I was up on loft and no service at all.", "author": "Alison W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-13", "description": "After how many bars on Polk, this one was the winner. We hopped and hopped and finallyyyy spent the rest of our night here. The music was good, but not overly loud... lots of room to walk around but it wasn't empty. Drinks are decently priced. Go away if you're ratchet. Harper & Rye is NOT for you.", "author": "Elysse P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-01-03", "description": "Ohhhh. .Harper and Rye... I love your space, I love your drinks, but when I step through the doors, I feel as if I have entered a college frat-house of hipsters.  I'm too old for this place.  \n\n4.5 stars for the drinks...\nMinus 1.5 stars for the crowd", "author": "Hiromi N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-02-13", "description": "Talk about pretentious. \n\nI wish I could give it zero stars. Decent location full of \"wanna-be\" hip and trendy decor that fell flat. Bar was crowded at midnight on a Friday (McDonald's is crowded at midnight on a Friday- not high praise) but there was a 30 minute wait for drinks. For the wait  I do not blame the establishment itself, but the snooty clientele that make this place a real stinker. \n\nIf you're in SF for the classic quirky charm run from Harper & Rye. RUN!", "author": "Lauren S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-21", "description": "For some reason my friend and I always end up here after a Taco Tuesday.  I really love going here on the weekdays compared to the weekend.\n\nWeekends are super crowded and there's a line, and its amateur hour there.\n\nCome in on a weekday night and you'll get great service from the staff and awesome dranks!!!  One of the bartenders, Robin, is a super cool cat.  He and the other bartenders/bar backs there make this a great place to go to.\n\nBreckenridge Bourbon FTW.", "author": "Cliff S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-01", "description": "For a Thursday night, this was an excellent post dinner drink spot.\n\nMind you-  I didn't have to work the next day but this spot was really cool.\n\nI'm engaged- but if you're a single girl this place had A LOT of guys milling about- the ratio was probably 75% dudes 25% ladies.\n\nThe decor is rustic and kind of hipster but I don't think it's reaching too hard on Polk St, It seemed like a genuine place that prided itself in making good drinks.\n\nI wouldn't want to go there on the weekends, as I am sure it is a MUCH different scene.\n\nThey have cool seating upstairs over looking the bar area which is really nice and private so you could have a nice little conversation.\n\nThis may be a perfect first date -post dinner spot to wind down the night.\n\nDrink prices were pretty on par for the area, and the bartenders were really great and made me a delicious Paloma.", "author": "Meg H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-31", "description": "Harper & Rye is a classy addition to Polk St., which is becoming more upscale by the minute. Awesome, because I live two blocks away.\n\nI recommend coming here on a weeknight with a couple of friends to grab a drink. However, I would avoid this place like the plague during weekend nights, because not only will you have to wait to get in, but you'll probably end up waiting an hour for a drink. And that's two hours of your life you'll never get back. Or that you could have spent sleeping or playing with your dog.", "author": "Grace C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-03-10", "description": "My night out at this bar have been a much better experience minus the hoards of people packed into the space. I felt very Harry Potter like at a table under the stairs.  \n\nHarper and Rye is known for their cocktails so if you want to avoid confused looks from behind he bar order an old fashioned or a side car. I ordered a vodka soda and the bartender did a double take. :)\n\nAfter our first round from the bar, a waitress started serving our table. She was great. Super efficient and more than capable of maneuvering her way through the sea of sweaty bodies. She split or check no problem at the end of the night.", "author": "Emily E."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-02-16", "description": "Came here on a Wednesday night and it was filled with pretentious bro-techies. Seems as though they come to this place often. Drinks were good, nothing special. Waited nearly an hour for a pool game, got passed up and almost got into a fight to get our spot. My friend tried to order a drink at the packed bar from the bartender from the only side she could fit, he told her to order from the middle of the bar then proceeds to take an order from a guy next to her. Took nearly 30 minutes to get a drink. Do yourself a favor, don't come here...EVER. You'll be happy you didn't.", "author": "Vee T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-09", "description": "Lively urban bar with a young weekend crowd.\n\nHarper & Rye doesn't offer food at all, so my expectations for drinks are naturally a bit higher. The venue features a decent rotation of draught beers and an upbeat vibe -- Think college bar with an upscale twist. The mixed drinks are decent as well, but can be hit-or-miss when the place gets busy.\n\nThree stars for the drinks, four for the vibe. I'll come back to try their punch jars!", "author": "Alex L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-07-11", "description": "There is one bartender who should not be a bartender because he has no patience and is very mean for no reason!! He literally said \"fuck you\", \"fuck off\" and \"go find another bar\". Thanks, our party of 15 will. No money for you.  \n\nIf you are having a bad night, dont come to work and act like an asshole. You are making the owners and the business look bad. \n\nNot cool.", "author": "Yuliya K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-08", "description": "I don't get the negative reviews.  Some serious haters on this site.  Forget them.  Why do we love this bar?  \n\nFresh squeezed grapefruit, class act bartenders that treat all of my friends with kindness and respect.  They LOVE dogs and go out of their way to make sure we are always taken care of.  Jake and Robin really made our labor day bash pretty memorable. Thank you - what fun!", "author": "Robert M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-09-02", "description": "They kicked us out even though bunch of white girls on the sofa called us yellow monkeys. The bouncer, a black man himself, kicked us out because we wanted justice from these whites who mocked our skin color. This is an unfair world, and this bar is racist. Do not come here if you believe in liberal rights.", "author": "Jack M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-11-24", "description": "The line on a Friday night is not fun, and then when we finally got inside it wasn't even super packed ... Come on guys, don't make people wait for the sake of waiting. Drinks were fine, music was okay but they definitely need to turn it up. I like dancing on a Friday night and this definitely isn't the spot to go for that.", "author": "danielle a."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-10", "description": "Been here a number of times and also hosted a private birthday event upstairs on the mezzanine level.\n\nBesides the poor ventilation on the mezzanine level (it got extremely, intolerably hot that all my guests left 2 hours before the party was over), the general ambiance here is fantastic.\n\nThe bottom level is spacious, with a pool table far inside. The bar area is great from all the angles and there are a number of high top tables facing the windows that are great for larger groups.\n\nThey have a number of options here - beer, wine, champagne, as well as amazing cocktails. They also have some alcohol options by the bottle which are reasonably priced. Delish Cocktails are $9-$10, or they have \"Punch Jars\" that are $36 but easy to share among 2+ people.\n\nOverall, a solid spot and addition to the Polk neighborhood - great with friends, a night out, or even a casual pre or post dinner drink! I'll be a regular.", "author": "Veronica S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-08-13", "description": "The bar looks amazing but one of the bartender's attitude was awful!\n\n Yesterday I went with my friends to the bar and ordered a drink. The bartender ask me, apparently, if I want to leave the tab open or not, I couldn't hear him because it was too loud. So he just turn his back to me, angry, gave me the bill, and kinda pushed the drink on the table, throwing napkins on the floor next to me. No smile, just an angry looking face. \nI don't understand where did this attitude come from. It was not busy there.\n If you have a shitty day- don't show it to the costumers, or don't go to work!", "author": "Lin M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-08-18", "description": "I'm not sure who owns or manages Harper & Rye or how many negative reviews they need to see about certain staff members before they realize that will be the downfall of their business.\n\nI read all the bad reviews and still chose to take my friends here and spend our hard earned income at their establishment.  \nNever again.\n\nIt's been well documented how just plain rude and horrible certain staff members are so I don't need to go into detail. But good service is the easiest fix in any business that actually cares.  There's no reason any business should be allowed to stay operational as long as disrespectful employees are allowed to run the show.\n\nFor the 'bartender' that was in a black hoodie, baseball cap and shorts, looking like he just crawled to work after a 3 day bender, that repeatedly gave me the worst service I can remember ever having, especially in a place with 7 people in it, please DO quit your day job.  I'd suggest finding one where you can hide away in a cubicle or work from home and stay far away from human interaction and anything in the 'service' industry.\n\nSkip Harper & Rye. Do not waste your time or money here.  Some places in San Francisco still care about their guests and the experience they have at their establishments.  Unfortunately this one does not.", "author": "Mr. M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-23", "description": "I love the vibe here. It's always pretty packed but friendly people, great cocktails and a nice selection of wine. \nThere's a mixture of couches, high top tables, seats by the bar or smaller table areas up on the balcony. \nHipster is the right word for this place. It is great to come here before or after dinner at Co Nam (next door) :)", "author": "Van-Anh N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-12", "description": "I don't think it's fantastic, but I have nothing bad to say about it so far. Formerly the Red Devil Lounge, Harper & Rye is spacious with lots of room to stand and sit both downstairs and upstairs. Ceilings are tall and everything seems to be made out of wood, which gives it that Tahoe-y or pirate-y feel. Okay, I know those are like two different feelings. Whatever.\n\nAnyway, service was slow for its second weekend, but I feel like that's always the case at new bars. I recognized one of the bartenders because it was actually the old manager at Tipsy (current owner of Harper & Rye). This dude is a badass if you've ever met him, by the way.\n\nThere was a line outside by 9:30 pm on a Friday night, and FOR GOOD REASON. Yes, they could have packed at LEAST a hundred more people in there, but they didn't because they - unlike many other bars in the city - were probably following fire / safety regulations and not over crowding the bar! Finally... some space!\n\nAnddd like Poppy C. mentioned, it's definitely my kind of crowd. Not super young! If I had to guess, probably people in their laaate twenties to mid thirties. A lot of Russian Hill / Marina-looking people who were all dressed really well... and looked great \"for their age.\"\n\nI left around 10:30 and there were more recent college grad-looking people coming on Friday.", "author": "Jennifer L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-03", "description": "This is my favorite place ever. Cute fancy casual anything you want it to be! Lots of techy types here, but still such a great place on Polk. They gave me free shots and sang me happy birthday on my bday! Yes to Harper & rye!", "author": "Hannah R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-05-29", "description": "No food served!\n\nNew Bar on the Block! Open Lit Decor with two tiny TVs. No food and will be interesting to see if it lasts. \n\nSaw more bartenders behind the counter than patrons.", "author": "Madhusudhan R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-07", "description": "I didn't realize Red Devil Lounge was closed and I was super adamant that I would not go to this new place.. NOPE changed my mind quick! Super cute inside, drinks don't take TOO long to get, door guys are friendly, bartenders are friendly and the moscow mule is delicious (even though its missing a brass mug).\n\nI like how it's not super douchey and Marina-esque and the people here are nice. PLUS the punch menu is great for a group to order!", "author": "Diana R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-04-18", "description": "Okay, I actually like Harper & Rye in terms of ambiance -- not too crowded but packed enough that you feel you're socializing. I come here quite a lot whenever I get a day off however I haven't been since a few weeks ago when the man who was busing tables was super rude to my friends and I. I haven't had an alcoholic drink for a good two years now but my friends do like to go out to bars and lounges as this is how adults socialize. My friend orders I believe a cranberry vodka from the very nice bartender who looks like he could be a country singer lol and tried to serve us as soon as he could even with the busy crowd (I never wave my money at the bartenders or call out to them, I always just stand by the bar -- not aggressive at all) but my friend orders her drink and I order an orange juice and we go take a seat. The guy busing tables kept making comments about how this is a bar and people drink here. uhmm... okay but some people are DDs or recovering alcoholics or allergic to alcohol or pregnant but whatever the reason is making comments like that to customers is rude in general. I could have sat there and not bought crap so the fact that I paid for the orange juice is still patronage. Anyways, maybe they should reevaluate who they have on the floor because it was such a turn off and the people sharing the communal table with us were disgusted as well,", "author": "Yvonne L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-01", "description": "I usually avoid polk street but a friend introduced me to it originally and I was impressed by both the friendly bartenders, the awesome ambience and lighting, and what is officially the best smelling public restroom in San Francisco. I swear to god, it smells like a luxury cedar cigar box in there. Or at least it did when I was there, but it was a slow Monday. \n\nRob the bartender, with the arm tattoos and perpetual baseball cap, is a textbook slash Hollywood-movie perfect bartender. And totally straight, of course...c'est la vie.", "author": "Daniel L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-08", "description": "Listen up, kids. I'm writing to drop some knowledge from the perspective of a regular at H&R.\n\nThe people criticizing the bartenders are probably the same idiots I often overhear speaking to them with zero manners and terrible customer etiquette. I've been going for months and have never had a problem with the guys that work there. They know their craft well and put up with a TON of crap from a lot of people. \n\nI have examples for days. Let's talk facts:\n\nFACT: One of the guys, blonde-ish, puts up with constant harassment from marina girls who shout his name over and over and over, almost exactly like the seagulls in Finding Nemo (\"Mine! mine!\"). They get butt-hurt b/c he doesn't flirt back. He's nice to them but treats them like everyone else and doesn't linger while they try to flutter their eyes. HOW DARE HE continue working. What. A. Dick.\n\nFACT: the bros talk to them like servants. No manners whatsoever. You, with the pastel polo and pinky up while you drink--dont shout at them, wave your money, snap your fingers. Know what you want to order, pay and SURPRISE! Good service. \n\nFACT: This place is often packed. So many people are complaining about waiting to order a drink. Are you kidding me?! Not sure what you're used to but where I go, magic hasn't been invented yet. When you're one of hundreds, you're gonna wait. You're calling them inattentive when what actually is going on is that they're paying attention to others there before you. \n\nFACT: Its easier to get an accurate number of drinks made and charged if you accurately tell them how many instead of slurring and stammering through placing an order, and waiting to correct them until the end.\n\nFACT: Just because you know someone who was born doesn't mean you get free things in life. Bitter pill to swallow, I know. Stop getting upset when whining, \"its my friend's birthday!\" doesn't work.\n\nFACT: The \"rude\" quotes people provide from them are actually called JOKES. If you can't sense sarcasm and took them seriously you're an idiot. Thats how bartenders are. You won't choke if you banter back with them. \n\nBottom line: The workers are friendly, very professional, and hilarious. I'm not sure, but it miiiight have to do with me being polite, knowing what I want to order, and keeping my drunken behavior in check. GROUNDBREAKING, right?! Before you blast their behavior, stop and think about what actually happened. If you check your entitlement at the door, it gets much easier to grow a backbone. I promise.", "author": "Gena B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-04-19", "description": "Synopsis: Nice looking bar. Decent bartenders. Douchy patrons.\n\nDets.: Though I can't comment on the drink quality (I was sipping tequila straight, yo), the bar itself is nice enough, as were the (all male) bartenders. The gent checking IDs was a gem. \n\nThe problem with this establishment is the douche-quotient. Guys, there was a bro unironically wearing a seersucker suit. There was also one wearing a tie loosely around his neck atop a t-shirt...The women looked like clones: too much makeup, stick straight hair, and resting bitch face. \n\nIf the clientele of an establishment matters to you, there are far better places to spend your money.", "author": "Cami A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-21", "description": "Great cocktails in an unpretentious spot (a rare combo). The decor's spot on too. Just avoid weekend nights because there are always crazy lines and even once you get inside, the music's so loud you can't hear anybody.\n\nI'd drink their Frankie & Levi cocktail over half the fancy, trying-too-hard cocktails at Bourbon and Branch...", "author": "Alyssa Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-27", "description": "Loved this spot... great feel and decor here ...reminded me of a country barn type setting.Tons of seating including some loft seating.The cocktails were really good and the bartender was very attentive and friendly ...hard to come by these days.Their daily specials were written on a butcher paper roll hanging down from the wall ..cool touch.Looking forward to going back!", "author": "Carlos G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-21", "description": "Very chill bar vibe.\n\nThere is a bouncer outside of the door that keeps track of the number that comes in and out of the bar in order to not have overcrowding of the place.  \n\nMy friends and I came here after a night of dancing not sure what to expect, but it is a nice little bar that is definitely popular.  This is a nice place to go out with your friends, have a nice drink, and meet new people.  Don't come in thinking you are going to get 'Turnt'....no..this place is chill not a place of ratchet. \n\nWill definitely come back another time to have one of those let's just chill and enjoy the company that you are with night.", "author": "Alisa S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-28", "description": "Walked in here after work. The staff is friendly and the bartender I was making banter with was nice and accommodating.\n\nThe cocktail's are pretty good and not watered down. Living relatively across the street, this is a nice spot to go to just to unwind.\n\nI'll make future visits since it was a great first impression/experience.", "author": "Kenneth L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-09-02", "description": "If only zero stars were an option!  This business was packed last night, and the bouncer clearly wasn't entirely sure how to handle it.  He asked us, a group of three men and five women, to queue on the side, which we had no problem doing.  Then we noticed that he was letting in woman after woman on the other side of the entrance. Puzzled, we asked him what was going on, and he became quite aggressive in his tone to one of the women in our group.  Intervening, we further inquired what was the disconnect with the line, to which he said \"who the fuck do you think you are?  I can do whatever the fuck I want and no one can do a fucking thing about it!\"  We left immediately to proceed to another establishment, and this bouncer had the gall to leave his post and continue yelling at us and intimidating us as we walked away.  We didn't catch his name, but this was simply ridiculous in every way imaginable. The bouncer of a bar is not only security; they are the face and first impression of a business.  The one working last night lost sight of this and made the face and first impression of this business an all-out embarrassment for all the people on the inside who work so hard to make it a successful bar.", "author": "David W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-27", "description": "Love this Polk St bar.  Every time I walk around this area I find a new spot and Harper & Rye is a gem.  The interior decor is about what you'd expect from a hip SF bar and there's also a pretty awesome upstairs area to hang out.  The bar liquor selection is not bad.  You don't see some of the better known bottles on the shelf like Maker's Mark or Bulleit and I definitely feel if they were going for a higher-end feel maybe they should have had at least the Maker's 46 and the Bulleit 10, but I also do like to see a bar pushing Buffalo Trace as it seems that's how you move up in the world of whiskey bars.\n\nService on a Saturday afternoon was pretty good (they make a fairly tasty Sazerac).  A lot of friendly patrons around as well so that's definitely a plus.\n\nI would definitely come back here and you should too!", "author": "Chris C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-02-20", "description": "This bar is great if you can get inside, the bouncers who work here are quite rude to people outside. I heard one call a patron who was not in her right state of mind a \"piece of s%#t\" yes people can get rowdy and even slightly messy but calling people names and throwing insults is poor poor customer service. Would you want to be referred to that way? No, if you want to be treated like a human you best stay away from this place.", "author": "Ana G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-12-19", "description": "Harper & Rye is roughly 6-months old and the latest addition to Polk Street's burgeoning bar scene (it seems like they're opening up a new place every week!).\n\nHoused in the old Red Devil Lounge (may it rest in peace), Harper & Rye offers fancy cocktails in a large, faux-rustic setting. The interior design is pretty cool. There's plenty of seating (upstairs and downstairs), an area with a pool table, and a nice long bar at the center of it all. However, there's something strangely cold about the place (both literally and spiritually). When I came in the other evening, it was pouring rain outside. And for some reason, they left the front door wide open, which carried in quite a chilly breeze. We didn't want to make a fuss about it, so my friend and I just moved to the back of the bar to escape the chill factor. But still, it was kind of odd that no one thought to turn the heat on, or at the very least, close the damn door. It's not fun to sip on drinks while you're shivering.\n\nIn any case, we looked at the cocktail menu. They had some interesting selections. This is clearly a Mixologist kind of bar, and not a dive bar. I was almost tempted to order this specialty cocktail with tequila and ginger beer. But when it's cold outside, my palate leans more towards bourbon. So I wound up getting the Manhatten with Maker's Mark. The bartenders here clearly know what they're doing. I watched as the bartender took his time creating my libation. He first started with one of those gigantic ice cubes (that never melt), and then he carefully poured in the bourbon and sweet vermouth, before finishing it off with some bitters. After stirring the ingredients for a bit, his masterpiece was complete. It was definitely one of the better Manhattens I've had in a while. Granted, at $12 per pop, it wasn't exactly cheap. But there was no denying that it was delicious. On a personal note, I'd love to see them offer some sort of happy hour in the near future. We ordered two drinks each, and the bill wound up being $50 (not counting tip). Don't get me wrong, I'm not complaining. But if you're looking to get tipsy on the cheap, then this isn't the place for you.\n\nAll in all, Harper & Rye is a solid bar and a classy addition to the neighborhood. I'd definitely come back if I was in the area. The drinks are good. And the location is central. I just wish the place had a warmer, more inviting vibe to it.", "author": "Kevin B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-26", "description": "Good Vibe. Has a pool table and the old fashioned is going to have me driving back from LA.", "author": "Shawn P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-27", "description": "I don't know Gena B, but I could have written much of her review.  I knew people who worked there, so perhaps I got treated better than average, but on the whole, If I had lived nearby, I would have been a regular.\n\nCan't go to 5 stars because of, as others have noted, the crowd.  If I didn't know where I was, I might have thought I was in 94123.  Work force bros abounded.", "author": "Steve S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-01", "description": "Great vibes. Unpretentious bar with great drinks, friendly staff and a cool environment.", "author": "Sarah D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-28", "description": "Cute place! Went here for a glass of wine on a Tuesday night since restaurants are closing down around 10pm. Sat in the upper level area at a small table and watched people walk by. Totally low key and a great place to chill on a non-weekend night.", "author": "Lori M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-09", "description": "Harper & Rye has taken over the old Red Devil Lounge (which I drove by many times while living in SF, but never visited) so its in a prime location in Russian Hill.  From the outside, you'll slightly tinted windows exposing what looks like a romantic restaurant with people visible at all the window.\n\nI didn't see any signage on the front for Harper & Rye, and had my friend not been the one navigating I probably would have not seen it and drove right by. We went on a Thursday night around 10:30pm and while it was moderately crowded inside there was no outside line as many have written about so we walked right in.  \n\nThe moment I walked in I was a little disappointed to find it felt like a regular old hipster bar. Don't get me wrong its nice inside, but based on how it looked from the outside I kind of created this image in my head of a beautiful bar with dimmed lighting and stunningly beautiful people.  \n\nThere was no wait at the bar and we received our drinks about 3-4 minutes after ordering them.  The drinks were well concocted. The upper level has a couple pool tables if you're into that sort of thing while you're out drinking.  Its not my first choice for a bar, but I'll definitely be back at some point.", "author": "Ash S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-08-31", "description": "This place is awesome if you hate drinking. There's a ratio of 3:150, bartenders to patrons, so plan on waiting 45 minutes for each drink. \n\nI'll pass.", "author": "Ted T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-01", "description": "A great start to a Friday night out!  Went here recently for a work happy hour - plenty of room for our growing group as friends trickled in.  The bar attracts a friendly crowd, some in our group were wearing white/black striped shirts, and a couple of guys wearing a similar style came up to where we were standing to snap a group photo.  We also saw a very cute puppy in the bar, although he only brought three legs in with him!  Definitely a chill spot to start the night.  The cocktails are excellent, the patrons attractive and the waitstaff friendly.  From the cocktail menu, I tried the \"Tom & Diane\" which was quite tart but easy to drink quickly (not my aim), but the \"Victor & Nancy\" which had a great amount of spice and tasty!", "author": "Beth V."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-04-04", "description": "The cocktails we had were 5 stars.\n\nThe deafening noise level, 0-stars.  \nGood design should include sound dampening of surfaces such as ceilings.  Hearing damage is irreversible.  It's possible to have a fun bar environment without damaging your health.  Just like you can't smoke in bars anymore.", "author": "Leah B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-05", "description": "Polk street needs more spots like Harper & Rye!\n\n..maybe then the lines won't be so long? See how that works... ;) \n\nGreat space - good atmosphere - drinks are awesome.\n\nBouncers that I've encountered are friendly and easy going, Bartenders are great, friendly and fairly quick. Jamal is personable and mixes a mean cocktail!\n\nA lot of seating, on the main level and upstairs. Comfy couches. Bathrooms are clean and the men seem to enjoy the pool table :P\n\nI always come back! It's a great time :)", "author": "Selina W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-12", "description": "Love this place. Been here a few times and never been disappointed. Excellent drinks, perfect lighting, casual attractive ambience! Add to that good looking well dressed crowd here! Bar tenders know how to mix drinks well and it's not that expensive either! You might see a long line to get in but it's all worth it. All in all a fantastic setting for an outing with friends. Can't wait to go back here again! Going maximum *s on this one!", "author": "49er .."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-08-16", "description": "Man this place is turrible, the bouncers rude -\nSf local and they were givin is the business.  This is a douchey establishment", "author": "Kyle A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-07-09", "description": "Cool ambiance, although a little dark, and fun cocktails--but the two stars are for the bartender I had last night.\n\nWent here to kick off my 22nd birthday with drinks at midnight and wanted to get a crowd-pleasing shot for my friends. I may be young and used to college bars, but when my friend asked if they had fireball or could make birthday cake shots, the older bartender rolled his eyes and brusquely told us, \"we don't serve alcohol for little children here--no flavored vodka or jäger bombs. I need to see your IDs, are you even legal?\" I was offended but undeterred and asked what shot he recommended, to which he responded, totally unhumorously, \"I'm guessing you just want the cheap tequila.\" ...Excuse me? \n\nI'm not the kind of person who wants everyone to fawn over me on my birthday, but a little respect would have been nice. Instead this bartender got us all in a bad mood. May return if I ever feel the need to be pretentious, but in general I'll look elsewhere to enjoy my alcohol without being judged.", "author": "Malaika D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-07-10", "description": "1:08 am is when we asked for a shot and we were met with \"guys, we want to go home!\" by the bar staff unilaterally.  I don't know but in 15 years of bartending, I never turned down a sale for shots especially right after 1am and for shots; that require no work but a straight pour from the bottle.  \n1st time at this spot and that was unimpressive.  We were 3 and one of our 3 writes for a spirits and food mag and that reporter your surly bartender shut down, you can figure it out.  Lol.\nSide note:  \nChildren, last call is a warning for your guests and universally known, perhaps H & R might like to adopt this method. This is a good tool for y'all to learn.", "author": "D B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-13", "description": "Love bars that allow you to bring your dog!!! Also great cocktails and staff was very friendly. Totally a great spot to hit in Polk", "author": "Nicole S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-09-14", "description": "This place is pretty cool. I would come here all the time if I could actually get a drink. \n\nThey have 2-3 bartenders working, overwhelming demand, and drinks that take 5 minutes each to make. There is no element of ANY bar that I dislike as much as waiting for a drink at this one. \n\nIf you decide that you want check it out here are three tips:\n\nIf you see a line, it's time to abandon the idea completely. It never moves quickly and it's just a preview of how much you'll be waiting inside. Try to come before 9pm. \n\nIf you are using a credit card, never leave it open. You'll probably grow frustrated and want to bail later, so close it out so you don't have to spend 20 minutes doing that later. \n\nSince it is an admittedly cool place, it may be tempting to use this as a first date spot. NEVER do that. The only thing worse than wasting 20 minutes getting a round of drinks, is having that whole futile exercise leave a first impression of general incompetence at life.", "author": "Evan R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-25", "description": "Checked this spot out last night.  REALLY crowded for a Thursday.  REALLY fun for a Thursday.  Bartenders are super nice (specially Dan and Jamal).  \n\nI can't say much for the cocktails, it was crowded, so I tried to be considerate and only ordered basics.\n\nI'll be back, a lot.", "author": "Anoo L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-06-03", "description": "This place is white hot.  White as in people, hot as in temperature.  \n\nThis place was absolutely packed on Saturday night so I wasn't even able to get a drink after a 10 minute wait.  However, this seems like the place to be if you want out of the marina but are too scared to venture downhill too far.  Don't forget to wear your checkered button down dress shirt so that people know you're a balding tech-bro.", "author": "Joey S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-07-13", "description": "Ever long for those pretencious people that look down on you for ordering a PBR and a jameson.\nOr how about those people that love being in their financial district clothes long after they get off of work.\nHow about wanting to know what being in the ferternity/sorority party is like.\nThen this is your place to be!\n\nIf you're into random beer and the feeling of being in the marina without actually being in the marina then this is your stop.", "author": "Cescilia A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-02-07", "description": "Racist bartenders....dude with the beard. ignore my group of friends. Something else. Don't go, please.", "author": "Wiggy T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-09-26", "description": "The venue is actually pretty nice. Very well designed and spacious. Unfortunately, the crowd left a lot to be desired. Further proof that the gentrification of Polk street over the past decade has NOT been a good thing. \n\nI only had one drink there, which took my friend about 20 minutes to order on a Thursday evning (I had a Guinness -- didn't have the time or energy to try and order a cocktail). Once I finally got it, I had to navigate a sea of dudebros while searching for a spot to sip on it. The space eventually cleared up a bit just after midnight, but by then my nostrils were already oversaturated with the stench of Chestnut street trust funds and general douchebaggery.\n\nI will totally go back earlier in the week to give this place an actual chance. Unfortunately, just like most (not all) of lower Polk street has become, most of the patrons are insufferable... or at least the weekend crowd.\n\nIt might not be entirely fair to rate the venue based on who walks through its doors, but the two go hand in hand. At least the doorman was nice.", "author": "Yasir S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-25", "description": "Beautiful bar with a great location. Whenever I've gone (disclaimer: never on the weekends), there's plenty of seating and I get served relatively quickly. \n\nMy one gripe is that the drinks are always super inconsistent. I've ordered a whiskey sour and gotten it in different glasses each time, sometimes with egg white, sometimes not.", "author": "Stephanie Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-01", "description": "New bar opening, the crowds come out this weekend. The PR person on this has clearly done wonders, there is legitimately a line for Harper & Rye at most points during this Saturday night. Will this continue or is it merely the novelty? Only time will tell.\n\nThe place is packed but not uncomfortably so, decent looking crowd, not too young and not too old. Seems like a good spot for someone over 28 not looking to mingle with the post college kids.\n\nDrinks are priced about right, falling in the $6-11 range for the most part. \n\nI'd probably come back to see how this place is doing.", "author": "Rachel R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-13", "description": "Industrial bar with a chill/ fun atmosphere. Great for meeting up with friends for happy hour during the week. On weekends it can get pretty crowded and loud, not necessarily a bad thing if you're ok with that. \n\nDrinks are tasty and service is good. Overall a great addition to the Polk street scene.", "author": "Leslie S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-03", "description": "Great music, great drinks/beers, nice bartenders and a good looking mixed crowd. \n    In a tie, a hoodie ir a flannel, you'll be welcome here.\n     Im having the Gin & Thyme. Its nice.   \n  To anyone rating this lower than a 4- wtf.", "author": "Scott D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-05", "description": "Really diverse, friendly crowd.  Scored free shots upon entry.  It does have a pool table despite me accidentally answering no.", "author": "Vanessa F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-01", "description": "Nice place to grab a drink before or after dinner...the bartenders weren't particularly friendly, but it was a busy night, so I understand their need to hustle. I'd go back for their cider!", "author": "Hayley H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-30", "description": "::moment of silence for the Red Devil Lounge::\n\nThis new bar on Polk is awesome! Super trendy and chic, so expect to wait in line until the new-ness dies down. The cocktails are delicious, I especially enjoy the cucumber gimlet.", "author": "Alli J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-02-05", "description": "Honestly a gorgeous, chic bar with some awesome cocktails. The only trouble is that it's way too popular for its own good and attracts a fairly bro-y crowd. \n\nI've had great experiences here on Tuesday or Wednesday nights. Would not try to come here on any other night -- lines wrap around the block and once you're inside, you have to push and shove your way to get a drink.\n\nHopefully the hype dies down eventually but until then, you're better off spending your weekend nights at some of the nicer bars in the TL (Rye, Tradition, Redford, etc).", "author": "Tiffany W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-10-10", "description": "I usually like this place; however, my last visit here was a  disappointment. The bartender was so rude! He refused to make a drink that was on the menu?? When he finally served us, the drink was mediocre. Disappointment :(", "author": "Harvinder K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-08-11", "description": "I wasn't too pleased with the first time I came here.  A couple friends and I recently decided to try this place on a Monday night.  In short: the red-headed bartender called me a \"fuckin pussy\" for ordering a Matador.  First he asks what the drink is (probably from being so used to only making stuff of their menu), and instead of saying they don't carry pineapple juice, he says pineapple juice is \"fuckin stupid\" and serves up 3 unrequested shots of tequila for us.  Just because you don't know what a drink is doesn't mean you need to get offended.  Done with this misogynistic scene.", "author": "Bryan H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-03", "description": "Pretttyyyy legit, especially considering how dark and HORRIBLE red devil lounge was. I can't even believe it's the same space. Special shout out to our server who made our friend's 30th birthday unforgettable. I wish I remembered your name but you got me so drunk, love it!\n\nOn the SPACE: Very open concept and really neat second story seating around about a 1/4 of the perimeter, just above the windows. This space creates more privacy for 1:1 time for your not-so-awkward tinder dates. The main level is very open, large bar with a good amount of seating. ~ 5 long tables along the Clay St side with 6 seats per table. Lots of space utilized well, which is obviously coveted in SF.\n\nOn the DRINKS: Pretty darn good, although one was HORRIBLE. I am a Bourbon fan so I tried the one on the menu (name escapes me, will update later) and it was delish. Not too sweet, really refreshing and enjoyable! Then I tried this pink campari/coconut drink later, which tasted like celery. My friends sent them back, but the waitress was so awesome and friendly about it.\n\nCan't wait to go back!", "author": "Meredith M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-22", "description": "Strong drinks. Crowded but not stifling. Fun for a Saturday night with friends. I wish they had more of their mug drinks though! They ran out right before I got there and I was really looking forward to sharing one with a friend.", "author": "Laurel S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-27", "description": "Very cool and swanky spot.  Some unique cocktails, good draft beer selection, $1 pool table, completely remodeled on the inside and really clean.  Decor is rustic, open, and outdoorsy... Very cool spot and overall a great addition to Polk and SF!", "author": "Brett B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-03-03", "description": "Somehow they get to charge a 9% surcharge for using a credit card vs. cash. Some reasons floated by the staff include \"processing fee\" \"because we can\" and \"gas stations do it\"\nFull disclosure: they offered to remove it after I pointed it out...  if I used cash", "author": "Brendan M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-07", "description": "drinks before dinner, yay! who doesn't love that?  \n\nparking :: only noticed street parking, but didnt' really look around.  we took uber. \n\nambiance :: cool decor, not sure how to describe it?  hipsterish?  ample seating, which is nice!  bartenders are nice to look at too ;-)  not too loud, at least not at 7 PM on a Saturday\n\ndrinks :: yummy and reasonably priced, what more can you ask for?\n\nhappy drinking!", "author": "Tina F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-09", "description": "My friend and I were just wandering down Polk Street and looking to hit a new spot. We saw a short line outside of this place (it was a Friday night) and decided to check it out. We only had to wait a minute, and the bouncer \"Robb with two b's\" was awesome! So the experience started great right off the bat. \n\nWe both got beers, they have a decent tap selection, and the prices are right. The cocktail list looked good too but we just weren't in the mood! The place was packed full of young 20 somethings. Bartenders were also all young, attractive and very attentive/friendly. There is a second floor, a pool table in the back, and plenty of space to mix and mingle. We didn't stay too long but I will definitely be back to check it out again! Until next time...", "author": "Mandy A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-29", "description": "Great new spot in a neighborhood that was in much need of a facelift. This new spot could not have come at a better time. Red Devil was stale and H&R is fresh and fun. \n\nIt also says something when The Black Keys choose to spend their time there when in town a couple days ago. What?! How amazing was that!? \n\nP.s. this place gets crackin fast with a line around the corner, so get there early so you don't have to wait too long. You can totally bring food in with you as well, which is amazing when you want to chill for happy hour and beyond.", "author": "Britt B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-28", "description": "Somewhat torn... I sort of miss Red Devil Lounge and the live bands, but at the same time, I love swanky new bars.  I have to say if I had to choose, yes Harper & Rye would win hands down.  It's borderline \"Marina-ish\" (proximity to the Marina, can't help but get some of that crowd) and yet much better ambiance; a good mix... not all frat boys or old married douchbags; some hipsters; some professionals; overall a good-looking crowd.  \nThere's always a line, which I'm definitely not a fan of, but fortunately I've never had to wait.  I like the vaulted ceiling, wooden decor and the trendy inviting bar.  I also love the pool table in the back.  The very last time I was there almost a couple of weeks ago on a Sat night.  Definitely a fun night.  Look forward to coming back", "author": "Myra M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-12-18", "description": "It was little too bright for me. Cocktails were good - I had a drink made with Mezcal spiced with some kind of paprika - little too smoky but nice", "author": "Meera S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-02", "description": "Fabulous Gin and thyme highball and amazing mezcal/carrot/lime&citrus chile powder cocktail!!", "author": "E. S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-08-29", "description": "Either both of our drinks were $15 or the cocktail server kept some of our money. If you order a Manhattan and the server asks you if you want it on the rocks or up, you're probably not getting a Manhattan. Also, don't order the June Bug (at least I think that's what it's called). Terrible. Really hot, crowded, and super douchey. It's like the Marina migrated south. Going back to Oakland where people still take pride in making cocktails and you might see some diversity.", "author": "Julie B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-27", "description": "Trendy bar with creative mixologist! Friendly vibe and relaxed ambiance, fun for an after work drink or a night out with friends. I recommend the \"Victor and Nancy\" cocktail\n:)", "author": "Michelle E."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-10-03", "description": "The decor is pretty cool, but the mixed drinks weren't the best.  Had a variety of people comment that their margaritas were poor.  No sure what happened as I assume they come from a mix!  They had a few interesting beers, the nut ale was pretty good so maybe stick to beer.  Also, head to the back for a pool table.  If you can snag it, that would be a good time here.", "author": "Cameo W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-08-12", "description": "Tried this place out on a Tuesday night. Loved the décor and the general scene but the bartender was super unfriendly and was incredibly unhelpful. I like trying different kinds of whiskey and was trying to narrow down their extensive whiskey selection but his demeanor prompted me to just quickly order a whiskey I've had several times before. I would have understood if it was really busy, but there were maybe 2 people waiting. I really liked everything else but that experience was totally overshadowed by the cold service.", "author": "Cindy K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-29", "description": "What a great addition to the neighbourhood, I can see this becoming a very popular bar. \n\nShort but punchy cocktail list, good selection of tap beers and loads of seating options, but still plenty of room to move around!\n\nDefinitely my new local, can't wait to head back and have a proper stab at it.", "author": "Kristy B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-29", "description": "Solid spot on Polk for some average price brews or cocktails.\n\nAmbience: impressive decor with a warm feel. Open space to move but can get packed during peak hours\n\nDrinks: known for cocktails but also has a few microbrew and craft drafts\n\nPeople: tons of dudes but the women who are there are attractive. Just elbow your way in with a smile and make it happen.", "author": "Andrew A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-29", "description": "This was a great place to meet friends at after work. I saw numerous groups of about 5 people eager to shake off work stress and relax. The drinks are good and run around $6 for beer and $11 for cocktails as is normal for the area. The decor was pretty cool and I really liked the layout. There is multiple levels with high tops, couches, the bar, and long tables that can fit around 6 people comfortably. It got pretty packed, everyone in there was mid 20's to 30's. There were also tvs on either side of the place and a pool table.", "author": "Jon U."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-04", "description": "I approve!\n\nMy kind of crowd. Not super young, not quite Middle Aged old fogey. Professional types mostly, lots of responsible shirts, a couple of suits.  Russian Hill and Marina looking people.\n\nNice lighting. Bright enough to see,\nNot so bright I could see THAT well.\n\nSpace to sit, nice pool table that nobody seemed to be using.  \n\nWe had pretty looking average tasting old fashioneds with one enormous square ice cube. \n\nGenerally I stay away from crowded bars on weekend nights, I was here on a Wednesday after 9 and it was still fairly busy.", "author": "Poppy C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-08-10", "description": "I knew nothing about this place during my first visit here. 3 stars summarizes everything below.\n\nSaturday night, 11pm: there's a considerably long line out the door.\n\n11:30 pm: we're getting pretty close to the front door, but this is mostly because people are fed up from waiting in line.\n\n11:50 pm: We're up to the front of the door. There is only one more group in front of us waiting to get in.\n\n12:00am-12:15am: The group in front of us are fed up. They leave. Now, we're next to get in. While waiting, there were a steady flow of people leaving the bar, but we still couldn't get in. Meanwhile, plenty of above-average looking girls try to cut the line and sweet talk the bouncer. Nope, doesn't work. They make a scene and leave.\n\n12:30am: we're finally in by now. Time to get a drink! They had a menu and it wasn't too hard to get a drink. The bartender was nice. I didn't feel like I waited at the bar for long, but he apologized anyway and gave my first drink for free. Maybe he was apologizing for the wait outside of the bar? I gave him a good tip.\n\nOverall, I hate waiting in line. I generally would never wait this long for ANY bar, but, I had to stick with my group. I understand they're probably following some fire code or making sure people are getting served in a timely manner, but maybe a Saturday night isn't the best time to visit.\n\nWhile the service and drinks were fine, the wait definitely wasn't worth it.", "author": "Grady T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-07-04", "description": "Seriously the worst service I've ever had at a bar. Waited for at least 15 minutes trying to get the bartenders attention and she refused to acknowledge us whatsoever. Then when we tried to wave her down, she just mocked us by waving back and taking someone else's order. To the blond girl bartender with tattoos and curly hair, you just lost at least $100 worth of business on a first round of drinks that could've turned into many more. Will not be coming back.", "author": "Alexandra C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-23", "description": "Really great drinks.  A little too hip of a scene for me, though - a lot of dressed to impress twenty-somethings. I probably won't be back.", "author": "Deserae W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-12", "description": "Seriously the best drink I've ever tasted. Came in for a margarita met some great people loved the drinks", "author": "James L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-30", "description": "The male to female ratio is off in this place but the few ladies that were present made it a night to remember. Harper & Rye had a cool atmosphere and the music selection was cool. This place is set up to be social and the wait staff was cool.  This place get's busy and crowded but if you find a cool place to chill you would be fine.", "author": "Edward B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-05", "description": "Amazing cocktails and bar staff! Plus cool interior. Can relax and enjoy a seat on the weekdays and get rowdy on the weekends. Something for every type of Polk-er", "author": "Hadley L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-19", "description": "Really excellent bartender. He didn't mind chatting with us even though we were just getting some beers, which were delicious by the way. H&R looks great too. There is a lot of window seating, which includes a loft. Perfect for people watching on the corner of Polk. Only complaint is the clientele is kind of hipster-douchey, but I guess that's my own fault for being out past the old-person curfew of 7 pm.", "author": "Louise R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-06", "description": "Enjoyed my experience here - reminded me of Comstock in the Castro (but larger, and better).\nPluses:\n- Lots of variety in cocktails - $9 or $10\n- Large \"punchbowl\" style drinks for $36 that you can share with 3-4 people\n- Knowledgeable bartenders\n- Not too crowded (went on early Saturday evening, it may be more crowded at peak hours)\n\nMinuses:\n- This place didn't have food or bar snacks, but if that's not what you're looking for, it's perfection.\n\nWill definitely go back during HH!", "author": "Grace Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-11", "description": "Given Harper & Rye is my new neighbor, I'm glad they put in a little more of an upscale spot to replace Red Devil :) \n\nIt's an ideal spot for pre or post dinner cocktails, or anytime cocktails. Prices are fair and there is a decent selection of options, including wine and beer.  Also love that they have pool tables and TVs.  Could add in a bit more seating but other than that, we had a fun and tasty first experience!", "author": "Brianna M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-02", "description": "A nice spot for quality beer. The stout is a nice option. A bit noisy for talking but it has a nice couch and upstairs for people watching. I hear the hazelnut beer is really good. The crowd is mixed with groups and individuals who sit back and enjoy a beer alone.", "author": "Bardia B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-01", "description": "This bar is the new hot spot in the neighborhood. Great drinks and ambiance. The only problem is that it can get too crowded, so I prefer going on a weeknight. Busy pool table in the back, and cool upstairs seating. \n\nSam out.", "author": "Sean Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-01", "description": "Did a great job with the renovation, especially liked the new flooring.  Mixologists are well trained and talented.  Management didn't allow the place to get too packed.  Kudos to them.\n\nOne knock is the drinks were coming out slow.  10-12 min wait times, should be 3-4 min max but they're new.  Need to add another bartender to solely do waitress service orders and let the other 3 bartenders handle the crowd.", "author": "Joe I."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-03-23", "description": "I went there on a Monday and I had the worst service ever. It was my birthday and both of the bartenders were really rude. Not recommend at all.", "author": "Larissa F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-11", "description": "Love this place!! Cannot get enough of the Mike and Cathi! Tom and Diane is delish as well. Love the huge ice cubes and the staff is so friendly and fast!!", "author": "Kat C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-07-13", "description": "on World Cup Final Germany vs Argentina around 4pm\nMe:  Do you make a bloody mary here?\nVery Short Blond Guy Behind the Bar:  (sighs, looks at me disdainfully, as though I've asked him to make a drink that is beneath him) We don't make a bloody mary.  \nMe:  Do you have mixed drinks that are not sweet?  I don't like sweet drinks.\nVery Short Blond Guy Behind the Bar:  Most people don't.\n\nI get mixology. I used to be a bartender at one of the best restaurants that ever was in San Diego.  But sometimes mixologists are just dicks that are full of themselves.  Maybe being woefully short is just too much and this guy can't handle it.  As a bartender, barman, mixologist, or whatever you want to call yourself working behind a bar, a HUGE part of your job is to create ambiance.  Very Short Blond Guy Behind the Bar at Harper and Rye, do you know what sort of ambiance you created for me in that short exchange?  Think about it- I have, and I'll never come back.  I bought a drink from you and it was tasty- something with carrot juice and mezcal(how cliche-mixologist of you), and I even tipped you $2.  I'll concede that the drink was worth it, but that was a waste of my $2, and I'm still kicking myself for not leaving after our exchange.  \n\nThe drinks here are good, from what I experienced in the one drink I had.  But of the two sides of the fence, I fall on the these-bartenders-are-full-of-themselves-dicks side.  So if you like good drinks served by assholes, then this is your spot.", "author": "Chris P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-12-01", "description": "pretty disappointed with my experience at harper & rye. from the looks of it, the place is gorgeous and the perfect place to kickback and enjoy a few drinks.\n\na group of us headed here on halloween for a kickback round of cocktails. - the bar wasn't even crowded, yet the bartender was super unapproachable and grumpy. he brought us out one extra drink than what we ordered and when we told him we only wanted 5, he got upset and said that he heard us say 6. he refused to believe we only needed 5, even though there were only 5 of us there and still charged us for the 6 drinks. even though he charged us, he continued to give us dirty looks and didn't wait on us again. \n\nalso, they don't have a full bar.", "author": "Mandy A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-06-03", "description": "This place should invest in bar tenders and management who won't brush off real ids as fakes. I've been a California resident for 29 years and have NEVER had an issue with my id, but apparently my California license doesn't \"feel real\".  RIP Red Devil - you are dearly missed.", "author": "Bri J."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-06-07", "description": "My friend and I waited 30ins to get in and another 20 mins when we gave up on this place. I was thoroughly disappointed with this bar. I was ignored countless times. Other patrons who were there after me were served before me. It is a Marina scene bar. The crowd is mid to early 40s. Not a fan.", "author": "Stephanie L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-17", "description": "Love the looks of this bar, vintage and brand new at the same time. The sort of deck above the rest of the bar is nice if you want to chat away from the crowd. Some cocktails are great, some are really weird, but that's just my taste. Highly recommend in any case.", "author": "Leo L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-20", "description": "Great for grabbing drinks with friends on Polk. Recommend arriving before peak time to beat the crowds so you can enjoy your company. Solid drinks- bartender can help design you the ideal cocktail!", "author": "Jessie H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-06-07", "description": "Not impressed.  Crowded and loud.  Bar Tenders couldn't be bothered to mix anything not on the limited and uninspired menu.   Don't believe the hype.   Not worth it.", "author": "Max K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-06-08", "description": "First time there and I experienced an extremely discourteous staff, and unbelievably slow service. The place was busy, but it does not explain the bar tenders being obnoxious and there inability to get drinks out. If you go there plan only getting a drink every hour or so...", "author": "Cameron B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-09-11", "description": "I miss Red Devil Lounge. The bartenders suck now...way to churn out 1 drink every 5 minutes.", "author": "Alex S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-09-17", "description": "I've been waiting to try Harper & Rye since they opened up a few months ago. I live in the 'hood, and it was fun to see them give the old RDL a total facelift.\n\nI had high hopes and expectations for the bar, especially since there is a line out the door most weekend nights.  Sadly, the bartenders fell short.  They couldn't seem to manage the lines well, resulting in long waits.  Additionally, the mixologists short you on the alcohol; they claim to use only the \"standard\" 1oz pour, when we all know the standard is 1.5. They also never seemed to get the ice/liquid/booze ratio correct, resulting in 3 (back to back to back) watery and warm \"jack and gingers\" a friend ordered.\n\nOverall, I'd be hard pressed to go back, unless they improved their bartender and wait staff.", "author": "Gigi B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-01-18", "description": "Bartender's a prick. If you're not American, don't come without your passport. Would say the ambiance was nice because the decor is lovely, but the bartender sh*t on the vibes.", "author": "Amy J."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-09-28", "description": "Came here on a Saturday night, took a LONG time to get a drink, at least 20 min. There were 2 (maybe 3) bartenders working nonstop, but clearly that wasn't enough for the demand. One looked like Bruno Mars which was a plus, but doesn't make up for the long wait and a pretty bad whiskey sour; but the Hefeweizen was good! There's nothing too special about this place, it has the cool hipster look, but doesn't have the drinks, service, or chill atmosphere to fit it.", "author": "Maleenee B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-05", "description": "Love this spot. Much needed addition to the neighborhood with a thoughtful design and cocktail menu. The owners do a good job of not letting the bar get too crowded, which makes for a much better experience. It's also cool because you never know who you're gonna meet there - one time I ran into a renowned local author and poet Mark Gudaitis, and another time I saw Willie Brown. Really great spot I highly recommend.", "author": "Andy P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-09", "description": "Awesome Bar! It def packs in people and can be a bit crowded but well worth it! Great atmosphere! Great drinks! no complaints!", "author": "Kyle W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-23", "description": "Guys of SF, come here if you're looking for an amazing guy:girl ratio. Lots of good looking ladies here. :) There was actually a line out the door by 9:30pm on Saturday. Good vibe. \n\nWould like to try the place again for HH to see how the crowd differs.\n\nGood riddance Red Devil Lounge! This place was a much needed addition to Polk Street. One of my new neighborhood favorites!", "author": "Jeanne C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-09", "description": "Love Harper and Rye since its close to my house and relatively new. The crowd tends to be more fun and SLIGHTLY more diverse than other nearby bars. Slightly. The cocktails are very well executed and some of the best I've had around. There's an upstairs balcony area which is sort of creepy because people stand up there and lurk on people below. Other big annoying thing is there tends to be a long line unless you get there really early or really late", "author": "Victoria W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-10-01", "description": "Bar staff is unacceptable. Negative attitudes like they wish they were someplace else, and that made me want to be also! Sadly this nice space will loose lots of cool customers like they did me...", "author": "Dante D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-07-30", "description": "Came here the other night for a birthday party! Drinks were good, I think I had their take on a Pimm's. The only complaint that I had was that there was no ventilation! It was really, really hot where we were and our server never brought us water! :-(. I'd go back, but maybe when it isn't so crazy hot.", "author": "Christina C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-08-08", "description": "This bar demolished my faith in humanity. Exaggerating, sure-- justified? Absolutely. I arrived and all went well; got some drinks, met some nice people, the usual. Drama started when a server walked by and tripped, spilling the majority of drinks all over me. He said \"Oh... Sorry.\" I went to the bouncer, and he was very sweet and apologetic. I decided to let the incident go... Until I heard a loud, distinctive crash. A wine glass had broken, and the most dangerous part, the stem, slid towards us. I saw it before my friend stepped on it. I went to see the manager, Jake. The nice bartender was appalled at the glass stem I held in my hand, but warned me not to be \"emotional\" with the manager. This seemed odd to me, but made sense a minute later. There was another man waiting, too. He was angry that he'd stepped on glass and it had pierced the sole of his shoe. I did not know him at all, but I watched, as Jake met with him first. I was so utterly shocked at what unfolded. The man was clearly angry, and had no solution in mind. He wanted justice, or at least acknowledgment that he had been wronged. He never got this, because the manager only argued with him for five to ten minutes about why the man was stupid for thinking anyone would care about his complaint. Who would believe him? Who would advocate for him? Who would care? I watched as the manager cut him apart, bit by bit. I'd seen this kind of arguing before--- the law school kind. I reasoned he was a 2L at best. The patron was stupid for settling-- he got his bar tab comp'd, but for me, this went far beyond that. This manager disregarded safety, common sense, and basic human dignity. I was completely disregarded after my entire shirt and jacket were soaked with God knows what. A glass broke and went completely ignored. Then, when it came to accountability, the manager could only scoff and laugh the ENTIRE way through. Well, hats off to you, Jake. I am sure you'll achieve that high esteemed status you seek, and one day you will become that stereotypical, sleazy defense lawyer you already portray yourself as. But hey, you're \"on our side\" right?", "author": "Valentina C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-07", "description": "I love this bar!!! They have alots of great drinks!!!! Lots of beers and Tequila!! Get early because then is too crowded to sit down and get a table.", "author": "Natalia M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-01-11", "description": "A rustic feeling spot that is different than most of the other divey or cozy feeling places along Polk.  Drinks are mid-range on price, but taste great.  A unique spot for Polk, but relatively par for the course for the larger SF area.\n\nI feel like this is a great happy hour spot.  After that it seems to get packed which is fine but the music and space sometimes are a mismatch if you want to dance and get a little looser.  Early evening this spot provides an atmosphere not the usual on Polk and is a lot of fun for sipping strong drinks with friends while enjoying a conversation and deciding where the evening will go.  The upstairs tables provide for a little more intimate setting while the downstairs open floor plan allows for a lot of mingling.  If you're lucky enough to snag the lounge area downstairs then you are set.  When it is not packed the drink service is at a great pace and usually you can get yourself to the bar.  As the night goes on getting a drink can be a daunting task, but then again that's becoming par for the course at a lot of spots around the city.  Bottom line is the drinks are well made, delicious, strong, and are served in a comfortable feeling spot that is great as the neighborhood go to for early evening drinks with friends.", "author": "Greg M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-17", "description": "It's a new bar!!! If you want somewhere less crowded with super attentive bartenders, go to the Buc or Shanghei's. These low ratings are acting like this should be the 4 seasons cocktail lounge and not a new bar in a neighborhood that doesn't get a lot of new additions. This place is great and I go out to see people, not make sweet love to a perfect cocktail from a bartender that will write me when I leave.", "author": "Sean T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-24", "description": "Delicious drinks. Tried a few of their specials one with mezcal. Woo! Not a typical drink I drink but savory. We must've gotten there earlier because when we left the line was down the street. Even got a couple of seats at the bar with my little bro. Bartenders were all guys and they were hotties. I can see how this place could be annoying if you weren't in a good mood and just wanted to chill. If we weren't sitting at the bar I imagine it would take a long time and mighty hard it get a drink because it gets packed. Filled with a bunch of pretty people who are a little uppity. Seems like one of those places to be seen and to pick up someone. I'm married and have kids so I was just happy to be out with a super strong tasty drink in my hand.", "author": "Tracy D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-05", "description": "I liked this place - only been here once though on a date. Drinks and service at bar were good. We were there early...once it got to be about 7 the crowd got really young & really yuppy and we left!", "author": "Jenny K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-28", "description": "best hot and dirty martini i have ever had in my life. that is all.", "author": "Raina D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-04", "description": "This is surely one of the most spacious and bright bar on polk street. Got here last evening with a few friends for a drink and loved the interiors and the space. We got ourselves the Kentucky Punch Pitcher and it was delicious. I'm surely going to check this place out in the night. But if you want to grab a drink in the evening its a great place since it has floor to ceiling windows which makes it great for some people watching.", "author": "Priyanka P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-10", "description": "The remodel is pretty fantastic. Space now looks light and clean and open. I'm bummed there won't be live music but pumped that there's a pool table. The cocktail menu is a bit fancy for me but I'm a bartender who drinks fernet straight and the pour is good so no complaints there. Staff is all super nice and friendly. For the Yelpers writing negative reviews I call shenanigans. I was in there for happy hour mid week and had no problem getting served or getting a drink not on their menu. As for people complaining that it's super crowded, are you kidding me? You went to a new bar, that got a lot of press, on a Saturday night,  color me surprised that it was busy. First world problems. Good for you guys hope it goes well. See ya for a drink soon.", "author": "paulina k."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-10-29", "description": "Door guy was an absolute idiot. Held up the line for half an hour so he could hit on a girl. Never going back", "author": "Sam R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-14", "description": "I visited from SD. My friends took me to this bar after we went to Playland. Seems like a cool spot to hang out with friends. It was crowded, but not too crowded that I was still able to meet some cool people! I believe this place is going to be popular on Polk Street very soon. The choice of music is better than Playland tbh...", "author": "Gemma L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-30", "description": "The devil made em do it! the ghosts of buzzes past have anointed this place as a fun new Russina Hill/Pulk Gulch lower Pac Heights (anymore useless attempts at branding Polk Street hoods??)hang.", "author": "Matt H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-09-30", "description": "Good vibe until the uneducated door man yelled in pure form, \"Bitch get outta my faceeeeee.\" Let's be real, there's professionals, and then there is door people. Go here for the drinks but do not expect to have a high class entrance. The door man has had the same job for three years plus, and clearly his aspirations and customer service are both limited.", "author": "Jaclyn K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-07", "description": "One of my favorite spots! Creative cocktails, great ambiance and the best bartenders around! Neighborhood/eclectic vibe is really fun.", "author": "Lucy R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-05", "description": "Awesome addition to the hood!!!  Fresh ingredients for all my favorite drinks.", "author": "Luke W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-31", "description": "Great new spot. Got there early with friends and there was no line but the place filled up quick. The bartenders were cool as they always acknowledged that they will be right with you.  Plus, tasty cocktail menu.They didn't over pack the place which was great.\n\nThe space was designed well as you can find tables to hang with your group. We scored a table by the window and it was perfect.\n\nThe crowd was fun and easy going and the place overall had great energy.\n\nThis place is definitely a welcome addition to the neighborhood.", "author": "David C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-12", "description": "Had an amazing vodka and grapefruit!!!! Fresh juiced and so delicious. Fun environment and fun people. Love this place and will be back!!", "author": "Chelsea G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-01", "description": "Awesome new bar!!  Great drinks and great decor!!  Plenty of tables if you tire of standing around the bar.  There's even a great pool table area where we hung out while some of my friends played.  I had so much fun grabbing drinks with my co-workers one night that I brought my girlfriends back the next.  The crowd is awesome and I bet it has a lot to do w/ the bartenders and cocktail servers being so chill and friendly themselves.  I LOVED hanging out here and will for sure be back again soon!!!", "author": "Jena W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-02-06", "description": "Worst.  Sazerac.  Ever.  This place looks like it should be awesome, but apparently the bartenders don't know how to use the ingredients they have back there.", "author": "Amit M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-07-06", "description": "There's a bald bartender that works at harper and rye, you will see him as soon as you enter. He is the biggest douche bag alive.  He is rude to the customers and has bad mannerism and makes the worst drinks ever. I wouldn't recommend this place to anyone.", "author": "Alexendar J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-19", "description": "Such a great addition to polk street. The cocktails are amazing and The server Carmen is always so fun and helpful. Definitely a place to check out!", "author": "Tiffany C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-08-13", "description": "Just another new, trendy, noisy, crowded bar with a rotating specialty cocktail menu. There's nothing wrong with the bar itself--the drinks are decent and the booze selection is good--it's the herd that makes it an unsavory place to be. Give it some time and visit after the herd has migrated to newer, trendier pastures.", "author": "keith s."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-20", "description": "These guys know how to run a bar. Drinks are quality and strong, the musics on point, the bartenders know their stuff and can give you what you want. The bar deals with a lot of d bags in stride and doesn't let it hinder the night. Cameron at the door handled his shit and doesn't have the typical bouncer mentality. The old fashioned is on point.", "author": "Luke W."}
