{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-28", "description": "My partner and I dined in at Haystack tonight for the first time. During the few minutes we waited for our table, at least 3 of the staff greeted and welcomed us. Service was altogether great with very friendly staff. We ordered a large pitcher of beer, antipasti salad, and a large Haystack pizza. All was very good, and they are generous on the toppings. We felt the pizza could have used more sauce, but will just ask for some extra on the side next time. Have I had better pizza? Yes. But I definitely enjoyed it and will be back. Pro tip: my partner and I are two big guys with equally large appetites, and had leftovers on the 16\". Will order 14\" next time.", "author": "Winston C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-31", "description": "The service is above excellent. The portions enormous, and the desserts beyond decadent. Ask for George as your waiter.", "author": "Lattigo P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-03", "description": "Nicest people in San Francisco! The people who work here treat you like member of their family. So incredibly welcoming and kind - plus good pizza and cute decor. Wholesome af.", "author": "Nic G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-06", "description": "We ordered from Haystack Pizza while staying in Noe Valley. We used GrubHub and our pizza came quickly and tasted delicious! I especially appreciated that they weren't skimpy with the toppings. Don't you hate it when you order a mushroom pizza and you have exactly 9 mushroom slices on the entire pizza? Not at Haystack, they loaded it up! \n\nWhen I'm back in San Francisco, I hope to visit Haystack in person and try more of their menu!", "author": "Megan L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-15", "description": "Delicious Pizza and delicious dinners. I have never had a bad experience at this Noe Valley institution. Always trustworthy. Always delicious! Open late and friendly.", "author": "James J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-06-04", "description": "This place gets 3 stars but that is a sum of very extreme ratings on a variety of topics.\n\n4-5 stars: Value of italian dishes, especially the tortellini or anything eggplant. We never come home hungry. The meats in dishes and on pizza is usually good. Open pretty late. Great location. Sauce on pasta can be awesome sometimes, especially if you like thicker sauce. Speed of food coming out often is faster than the wait staff can bring it, and that is not due to just being microwaved. \n\n1-2 stars: Freshness of salad, pizza quality at times, slowness of wait staff at times (at best a 3 hence why we sit at the counter), wine selection not as big as most italian/pizza places in bay area. \n\nDefinitely a solid option when used strategically as in certain items are extremely good value for San Francisco.", "author": "David A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-07", "description": "This one of the very few establishment that is still on 24th street in Noe Valley that dates back to the time before gentrification.  Surprisingly they have several vegetarian special pizzas, as well as old school standards.\nThere deliver times are very inconsistent.  However I've rarely been disappointed with things I've ordered for pick up.  The few times I've eaten there,\nThe staff was been polite and attentive.", "author": "Sheila F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-26", "description": "I only recently discovered this cute noe valley pizzeria also has ravioli and other delicious pasta entrees. I've been ordering through their website (I can pay and tip online and pick it up on my way home from work) and it's always proper and ready and good. The owner is so well-dressed and charming and he always makes sure everything is perfect.", "author": "Christopher W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-12", "description": "A family fav always! Very picky eaters with an 16 and 11 year old. Once I call out haystack...Never a complaint. Always a pizza to go after our meal there.", "author": "Tony M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-25", "description": "One of my absolute favorite restaurants in the city. Love the Ranch Chicken Sandwich, the Chicken Cordon Bleu is fantastic as are their pizzas and calzones. \nWhether ordering for delivery or eating in the folks at Haystack always give great customer service; they are sweet and helpful. \nReminds me of pizza/pasta places back east where they serve delicious food from recipes that have existed for ages and you are treated like family when you arrive. \nI love this city for is unique and interesting foods, but when I want guarantee that I will enjoy every part of my meal, Haystack is always my top choice.", "author": "Tim W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-25", "description": "Great food and great customer service.  Pasta dishes and pizza are fantastic.  Cold beer on tap:) Thanks for the great time", "author": "Ryan E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-12", "description": "I used to visit Haystack years ago when I lived closer. I recently saw their menu online and remembered the Chicken Cacciatore I used to get there. It has disappeared from many Italian restaurant menus for some reason. We had it delivered and I swear it is better than I remembered! Absolutely the freshest richest sauce with tomatoes and olives served with aromatic rice and vegetable medley. The portion was huge! We also got a sausage & mushroom pizza and it too was fresh & tasty. Delivery was faster than promised. Highly recommended!", "author": "Mike O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-01", "description": "This was a staple of mine in Noe Valley. They had a delicious simple pizza and fun atmosphere for an after work unwind.", "author": "David M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-14", "description": "I am so sad that they have recently taken my most favorite sandwich, the chicken caprese, off of the menu.", "author": "Stephanie M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-18", "description": "Best pizza in the City. Hands down. As a native of the Mission--this gem is celebrated by all true locals & Gs all the way around. Dino, a sweet & knowledgeable man of Greek & Italian descent is the owner who orchestrated the menu of pizzas, pastas, steaks, lamb chops & more! Everything is fresh--made by scratch with his daily/weekly trips to the market. To prove its worth--Haystack will celebrate their 45th anniversary this year & remains the ONLY longstanding business in Noe Valley. I asked him how he's been able to maintain his success & he stated: 1) down-to-earth *good* food, 2) down-to-earth service, & 3) consistency.  Def check it out. You will leave with a satisfied belly of yumminess & a smile from the care of the staff.", "author": "Jacqueline R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-01-07", "description": "Sad to be nickled and dimed in a charming establishment like this. I just moved to the neighborhood with my partner and made nice with the staff and when ordering a burger, which is already expensive at $15, I was charged $1.50 for a side of ranch, which I find to be completely out of line and unacceptable. This meal was not at all worth over $16 and I even ordered it to go. I will likely skip out on returning here, which sucks because we live just around the corner.", "author": "Mahana B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-03-26", "description": "You know this place have it's high moments and low moments I go in order great delivery what's the deal wrong order bad timing shit and piss driver wham they want tips and credit for half hour short vigina mits meaning pizza place any who it's great as long as I'm driving cheers", "author": "Iz F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-17", "description": "I love their pizza, calzones, entrees and service.\nThe epitome of a family run San Francisco business at its best.", "author": "michael h."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-06-13", "description": "I had a pretty bad experience. Service took forever and when we went in to see how much longer it would take (after waiting for 45 minutes) we saw the food just sitting on the counter next to the waitress. It took about 25 minutes for them to bring out the bread and butter and a salad that we had ordered which was basically two hearts of romaine with sliced tomatoes and mozzarella on top. Nothing special... we had also ordered the lamb chops and while they do come with four, they are extremely small. After everything is all said and done it was definitely not worth the money that we spent. Which was roughly $50 for three plates. Don't recommend, save your money.", "author": "Isabel T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-07-14", "description": "I added a star because when they get an order right, it's pretty tasty pizza. The issue is that they rarely get the order right. I know that I should know better - like Charley Brown kicking the football - but when they get it right... it's tasty pizza. \n\nmultiple times of ordering on-line and calling 1+ hr later to find out they don't have the order. 33% of the time when I put \"Thin Crust!!!\" everywhere on the order, it comes with major-thick-crust.\n\nStill, even then I'll still do it because when they get it right....\n\nThen this (photo-posted of cheesy-mess squashed into one side of a pizza box).  I emailed them about it with a picture and got no response.  It is with regret that I must call time-of-death on our relationship...", "author": "T M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-15", "description": "A \"go to\" pizza in our neighborhood!  Service is always friendly and they are supportive of our school.", "author": "A E."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-12-13", "description": "I've heard those jokes about the impossibility to make pizza bad, but I'd never thought that it's not a joke. I feel sorry for people who work there, because this place is definitely not worth it. Went there with my bf, ordered pizza and salad. The crust wasn't crunchy at all, plus its flavor was as if the dough was made for sweet pastry, but not for pizza for sure. It was stuffed with some meat, sausage and cheese, but I didn't feel it - I felt like I'm chewing a mix of some products (not the best ones). Dirty plates from the appetizer remained on the table until the very end and only smile of your young server and his question if we wanted to get our Cokes refilled somewhat saved the situation. I'm sorry, but it was the worst pizza I've tried in my 27 years old life. Thank you for that experience though, I'm wiser now.", "author": "Oleksandr M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-10-24", "description": "THE WORST PIZZA THAT I'VE EVER HAD. Despite reading the many bad reviews of their pizza, I foolishly ordered for delivery a small #3; The Haystack Pizza: sausage, salami, pepperoni, mushrooms, bell peppers and onions. I live less than a mile away, it arrived in 45 minutes, but it was beyond soggy; as if they poured water in the box before putting the pizza inside. The sauce was overly sweet and runny, and the RIDICULOUS amount of salt in the pizza made it INEDIBLE. The meat on the pizza tasted cheap and processed, far worse than the cheapest Dominos pizza, and the cheese seemed rubbery, like only the cheapest cheese is. With tip I spent $28.10; unbelievable for a pizza of such poor quality. It tasted like they should've paid me to eat it. If you want to experience the worst pizza of your life; order a pizza for delivery from Haystack Pizza on 24th St.", "author": "Scott L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-05", "description": "This place is pretty good and the food is always delivered hot, fresh and prompt.", "author": "Darren S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-28", "description": "I really like haystack! Not sure why they only have 3 reviews! We had garlic chicken, onions and mushrooms on our pizza and it was delicious!! \n\nService is very nice and parking isn't so bad as you far usually find some parking in the homes around the block. \n\nNice bars and lounges nearby should you want to grab an after dinner drink.", "author": "Carina M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-01", "description": "Had a yummy pizza from here on Sunday. We ordered takeout using their online system and had some issues - better to just call in your order if it's same day. \n\nThe pizza itself was very good and I'll order it again. Only complaint is the crust was a little plain. We built our own pizza - a medium with pepperoni, mushrooms, and jalapeños (they were pickled, not fresh). It wasn't New York Style or Neapolitan style, but was more along the lines of Papa John's or Dominoes (but better). The pizza was just shy of $24. A little steep, considering it was just a pizza - but I know Noe Valley rent so they're probably just trying to pay the bills. The medium easily serves 4 people who eat a normal amount.", "author": "Kendra N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-02-25", "description": "Where has Janice been?  Best server they have, always super friendly, funny, and welcoming.   Have missed seeing her the last few visits!!  She's the only reason we come.  Great food, service varies depending on the servers!!", "author": "C B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-02", "description": "Last time I ate here was in 1973/74.  It looked different, looked smaller and missing the old family style.  Still a nice place to enjoy traditional italian cooking like pastas, veal, chicken, beef and pizza.  i had the veal scallopini with garlic mashed potatoes and vegetables.  Large portion, fresh veggies and tasty mashed potatoes. Well seasoned.  I had to ask for bread after my meal was served. Cold french bread and hard butter came with it, not my cup of tea.", "author": "Hum V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-16", "description": "This is our go-to pizza delivery place. Always hot, fresh and crisp, and good value for us because one medium pizza is a meal for two and they allow you to build your own.\n\nWe've eaten in just once, when we massively over-ordered with a calzone and a small pizza and ended up taking half of it away in boxes. The portions are huge, my calzone seemed to have a whole mozzarella cheese in there from the amount spilling out when I cut it, and the dough was good enough to really enjoy eating even the crust bits.\n\nThe atmosphere inside is quirky and we saw some real Italian classics on the menu. Haven't ordered anything except pizza from here yet, but can't wait to try some of the other options.", "author": "Heather O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-26", "description": "It's nice to have a local pizzeria a block away here in Noe Valley when I have a taste for pizza.\n\nPrices are reasonable and my personal size pizza was good, cheesy and just the perfect size!!\n\nI'm not some pizza expert so all I can say is this place was on the money!!", "author": "Ron W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-06-28", "description": "It's strange that the name has the word \"pizza\" in it, because as near as I can tell, this place does not serve pizza. What they do serve is a type of soggy flatbread covered with cheese and oil, and burnt to a crisp. They then have the audacity to put this thing in a box and ask you to pay for it. \n\nWith dinner successfully ruined, we both decided to have some oatmeal instead. I've posted a picture of our pizza, it was supposed to be the Alberto's Classico.", "author": "Jesse D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-06-01", "description": "I was craving some \"Italian\" food today so I fired up the ol' Eat24. \n\nI used to order from Haystack back in 2010 and don't remember it being so:\n1. Expensive\n2. Shitty. \n\nI ordered the chicken parm with spaghetti and alfredo sauce. It came out to almost $19 with tax before tip. \n\nThe spaghetti was flavorless and congealed into a giant white clump the second it got cold. \nThe chicken was dry as hell, the sauce tasted like something out of a jar, and the cheese tasted like cardboard. \n\nI know I know, I shouldn't have expected much but dang, for $19 I expected a little more. \n\n1 star because my fat kid Italian food craving has been satisfied for at least another four months. \n2 stars for the sweet lady working the counter.", "author": "Meh M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-15", "description": "My wife and I travel up from San Diego to San Francisco each year around Christmas time and are always on the lookout for good Italian food at reasonable prices.  Too many Italian restaurants in downtown SF are way overpriced for the food.  We were very happy to find Haystack Pizza as an alternative to the high priced food.  We both had the seafood fettuccine which we found to be excellent and a carafe of the house Chianti, also very good.  Service was wonderful and attentive. I'm guessing it was the owners (husband, wife, and son) who took care of us.  The atmosphere was nice, although we both thought the lighting could have been turned down a bit since it was very bright inside.  Dimming the lights some would have helped with the ambiance.  Nonetheless, very much looking forward to returning to the SF area and having dinner at Haystack Pizza!", "author": "Brian M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-05", "description": "My favorite delivery pizza in San Francisco.  By far.  Thin crust had a good chew to it and it's the only pizza that even remotely reminds me of Brooklyn.  \n\nI've only had the pizza (usually cheese or pepperoni), so can't comment on the sandwiches, pastas, etc.\n\nDelivery comes fast and hot.  Bonus points for having Diet 7Up.", "author": "Mark T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-26", "description": "Wow! The doorbell rang & it was the pizza delivery guy. And voila! A piping hot pizza (yes hot) arrived from Haystack. The best pizza there is the simple New York. It tastes just like an honest to goodness New York slice, the delicious kind that you fold & eat. The crust is thin and crispy, the sauce sublime. The cheese is perfect, and the herbs add a subtle flavor. But back to the sauce--it's so good. At $13.50 for a medium pie, this beats pretentious Una Pizza Napolitana by a mile. Sure, UPN is good--but it's twenty-five bucks & Zero Zero is less expensive & just as good. Plus Zero won't shame you for asking for chili pepper flakes. (That's right folks--Una Pizza Pretenciosa doesn't ALLOW any condiments except salt. And I've had pizza in Napoli, & it doesn't cost $25.) \n\nHaystack's NY pizza is the like Napoli's spunky cousin. It looks different, tastes different --but she's just as tasty. Dining in is like stepping back to the Mad Men 60s. Sit with your pals in the back room, and order a  a carafe of Burgundy (yes, Burgundy--I told you, it's old school;) & a plate of antipasti. It comes with the usual suspects: salami, olives, pepperoncini. Then get that New York. You'll be glad you did.", "author": "Connie C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-03-14", "description": "I remember coming here when I was little. It brings back good memories of when me, my brother and parents would all come here together. Came here today with my dad, it's okay. I've had better pizza, this pizza is very soggy and average. I just like the nostalgia it brings, and it's a low key cute little restaurant. It's just not the best, but it's also not the worst! I'll keep coming back because it brings memories.", "author": "Juliana F."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-04-06", "description": "The service here was good, which is the only reason I gave it two stars instead of one. They were incredibly sweet to us. The location is great on 24th street in the heart of noe valley. The food however was not great. The pizza was soggy. We ordered a thin crust pizza which should be crispy on the bottom but this was not the case. We had to use a knife and fork because the slices just collapsed in a big pile of mess in our hands. Pizza is not meant to be eaten with utensils unless it's deep dish. The sauce was ok, not anything fantastic.", "author": "Lisa D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-11-06", "description": "I went to Haystack, with a friend, about 3 weeks ago, and ordered the marsala chicken. The chicken was tough and rubbery. I didn't want to deal with it while in the restaurant, and thought I'd be okay, that perhaps it was just overcooked. Shortly after getting home, I was hit with \"explosive liquefaction\" if you know what I mean. It took the better part of the week before I was back to normal. I wrote a nice e-mail, just suggesting they they look into it. I waited several days, and never heard back. So, I gave them the benefit of the doubt, and resent the e-mail. I've now waited long enough for a response. So, here's my review of my experience.", "author": "Bob B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-19", "description": "Mercedes is the best. She help me by the phone and gave me the BEST choises ever. \nRaviolis meat sauce & meat balls... Devilish. \nZorba's Pizza & some yummy deserts... \nThank you for such a great dinner... At my friends house! \n4 new customers.", "author": "Beautytraveler G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-06", "description": "Great staff   good wholesome food\nI noticed that  the customers tonight    75 percent knew the wait staff and hugged them\nIts nice to see that  loyalty amongst customers\n\nLarge portions   reasonable price for San Francisco   (full meal for 17 dollars)", "author": "kavin m."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-11-03", "description": "If I could give this place 0 stars, I most definitely would. Waited over 3 hours for my pizza to be delivered. Driver said nobody picked up the phone, this is a lie we confirmed it 3-4 times every time we checked by calling the restaurant. Waited next to our phone for over 3 hours and didn't receive anything. Just cancelled the pizza. Definitely not paying a single cent it's been 4 hours now at the time of writing this. Off to find pizza elsewhere by foot.\n\nUpdate: Pizza came in the middle of a very heated conversation between my father and their manager. I calmed him down and went outside to get the pizza. No tip, judge all you want, there is no pity when my 9 year old sister goes to sleep without food because it's 2 hours past her bed time. Paid the exact price and we parted ways. Never ordering from here again. I recommend Marcello's Pizza. Tastier and much better service. I've had pizzas delivered within 35 minutes from them.", "author": "Jeffrey F."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-10-21", "description": "I was actually gonna hold off on writing this, but after reading the most recent posts, this restaurant needs a serious wake up review.\n\nNow, I could go on for sentences talking about how awesome this place USED to be, or how the decor is outdated, blah blah blah. I honestly don't give a rats about minor things like that.\n\nNo Haystack, let me tell you about what I expected from you this particular evening, and what I received instead.\n\nI had an awesome walking trip with my family, from Glen Park, all the way up Diamond Heights, back down through Noe Valley, and finally making it to 24th. We were tired, we were hungry. And I personally had a young child who was very whinny after the long walk. \n\nWe went to the first pizza place nearest to us, and had lame service there (check my last review), then left to find a better place. That's when my GF tells me, \"Let's go to Haystack!\", and a rush of feel good memories hits me. Some of our best dates were at this place. The last time we walked the same route with my family, we ended up here and had a blast. So I was DOWN to eat there.\n\nEnough beating around the bush, let me tell you WHERE YOU JACKED UP(please DON'T excuse my french, because Yelp's guidelines won't allow me to swear). When our FIRST pizza came, it was a size smaller than what we ordered, plus had the wrong toppings. Hey, no big deal, just flag down the waiter, have him take it back, right? Or, it would be right, if the bushy haired server didn't make a face like we're stupid. Didn't even apologize. Dude, in the food industry, I don't care if you didn't even look at the food, you apologize even if its not your fault. Unspoken rule. Period. \n\nOur waitress comes by, shows us the ticket to prove it wasn't her fault. That's cool, kinda unnecessary, but that's cool. \n\nSECOND pizza comes. Got the right toppings, YAY. Still the wrong size. Of course we have no choice but to call back the wonderful guy who served it to us, he makes an exasperated sigh (pft, like we WANTED to talk you). So we let him know it a size too small, and that we ordered a medium.\n\nWhat does he say? \"That is a medium\"\n\nWow. You work with pizza. All day. Errday. And we're having size issues?\n\nI had to check him with what his menu says, 10 slices for medium. 8 for a small.\n\nWhat statement does he counter with? \"Look man, I don't slice the pizzas, I just serve them.\"\n\nThat statement speaks for itself of how bad your restaurant sucks. I was so ready to go, but I couldn't, since my fussy child was ready to snap without some pizza. Our waitress comes back, tries to mitigate the situation, halfway through the conversation, server dude comes back with the right one, explains how he got it mixed up. Still no apology, at all, and this time it actually was his fault. Fine, whatever. \n\nYou know, with that attitude, how am I supposed to feel about what happened to the pizza in the back while you were with it...exactly, right? The readers get me.\n\nThen, our waitress decides to throw us the whole \"let me get you something comp'd\" line. Again wasn't necessary, but she offered free desserts. Cool. \n\nAfter we were done with our meal, she was nowhere to be found. What a surprise. Made an empty promise. Like the empty promise your restaurant is. \n\nNow, the main thing that reeeeeally grinded my gears was the server. Look, man, you were walking around with a nasty scowl on your face. Do you hate your job? If so, why are you still there? I don't know if this is you everyday, but going off of my experience with you, you don't belong in the restaurant biz. You suck, man. Go find a better profession, and stop making people have bad experiences there, you obviously aren't down for the cause. I say this not as a yelper, but as a human being. Go find your place in this world, a pizza shop is most def not it.\n\nAs for the restaurant in its entirety, I don't think you should care about whether or not I actually come back. What I really think you should be thinking about is how many bad reviews is it gonna take before you guys realize you suck? \n\nOh yeah the pizza was ok.\n\nI check back in a year or two from now, just to see if you guys are still around and convert on the multiple feedback. Hopefully bushy haired angry server won't be there ;)", "author": "Cesar C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-10-18", "description": "POISONED, THEN IGNORED!!!!!!\nMy wife got the cajun linguine with shrimp, which was so-so. 10 minutes later, she was puking her guts out in the clearest case of bad-seafood poisoning imaginable.  This was the only thing she had eaten for 8 hours so it was definitely the Haystack shrimp!\nSo I called them, not angry (hey, sh*t happens) but to warn them to get rid of that shrimp so other people don't get sick - and it was scary to see how sick my wife was, and in pain for a full day afterward.  I was IGNORED (placed on indefinite hold 3 times) then LIED TO repeatedly (manager was \"not there,\" then \"in a meeting\" -at 10:30 pm??!!-then she had \"just left,\" and finally \"would call me right back from her cell phone.\"  Never heard from her, ever.\nSo......if you want to get poisoned, then lied to, then ignored, by all means go to Haystack Pizza on 24th.  VERY bad experience!!", "author": "Judi Q."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-05", "description": "This place deserves a 5 star rating. The ordering process was easy. We received our pizza faster than expected. The pizza was amazing and was well worth the price. The pie had a lot of meat, the crust was perfect, and arrived piping hot. I also ordered an apple pie which was really good. I rarely give a 5 star rating but this place really deserves it. Highly recommend this place. Better than the pizza I had at Naples, Italy.", "author": "Cherelyn G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-22", "description": "Sometimes you're just in the mood for an old-school pizza joint. You want booths that are clean but poorly patched with duct tape. You want waiters who look like they've been here for decades. You want a beer selection not much more complex than \"draught or bottle\". Appetizers that blow your diet. \n\nThis place does the trick. Everything is very classic old-school pizzaria. Nothing too fancy, nothing too unique. Just the same pizza shop experience that every generation has enjoyed since Italians became Italian Americans and set up this little slice of Norman Rockwell Americana.\n\nFried calamari were delicious; though next time I'd ask for marinara sauce (which I'm sure they have) instead of tartar sauce and cocktail sauce. The pizza was a homerun. Not gourmet, just awesome. Server just seemed like one of your Dad's friends who's been running the joint for 20 years.\n\nReally chill, good pizzaria.", "author": "Sean B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-14", "description": "I walked past Haystack last night on yet another unusally gorgeous San Fran evening with my lovely roommates, reminiscing about a date I had gone on a while back with a seemingly nice guy. \n\nHow my heart pitter-pattered for my former lover. How inexperienced I was in the ways of casual dating. And how shattered I was when I found out he was playing the same games with four other girls.\n\nBut, live and let die a horrible, horrible death. That's the expression, right?\n\nSo while I batted my lashes and tried to sensually eat my pizza and make interesting small talk, I realized just how good the food was. And now, here I am wishing I could wap myself on the head with something hard to wake up past me out of my dreamy stupor to focus on what really matters in life: Food.\n\nStarting off, we got Mozzerella Sticks ($8.50). On a date? Really Crys? Hell yes. My tummy was in the right place obviously. \n\nWe split the Greek Salad ($11.50) as well which was very fresh and honestly probably one of the best Greek's I've had. \n\nNext we had Alberto's Classico (Medium $18.50)  which was basily, tomatoey goodness, oozing with mozzerella cheese. No sauce, but you can order it if you prefer.\n\nThe decor is cute, kind of old school and funky. Not that it matters, good food is good food is good food, but it's Greek food, not Italian. Doesn't matter to me, Dino and Santino's is another favorite of mine in Pac Heights and they are of Greek descent as well. A bit pricey for pizza and salad, but I'm a cheap date and it was Noe Valley.   Looking back, all things happen for a reason. And we had a lot of lovely times together, no matter how big of a d-bag he turned out to be.", "author": "Crystal C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-16", "description": "I love their chicken wings! The pizza was also delicious. Thin crust and great flavor. Ill order from them again. Great and friendly service.", "author": "Alex P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-23", "description": "This place is quiet nice for dinner. I tried their buffalo chicken and cheese pizza. Chicken strips are crispy and fresh but salty but the pizzas are really good.\nOne thing I didn't like about this place is the service, I guess there are very few people taking orders and we had to wait quite sometime for our chance. Over all food is good but the service is very pathetic.\n\nThis is my first review in yelp, hope it helps.", "author": "Vijay Kumar M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-07-05", "description": "I ordered delivery on 6/3/16 at 8:55pm from Haystack. Lasagna, Chicken Jerusalem and Ravioli for me and my girlfriends. \nI had to give my address multiple times over the phone because the person on the other line couldn't understand me. I spelled it out one letter at a time A like apple-Z like zebra -T like tiger....,Aztec,  not  a hard word to understand. Perhaps their phones weren't working right? Who knows. \nMy house is 8 minutes away from their restaurant, according to Google maps, which is why it surprised and annoyed me that after an hour and a half of waiting our food still had not arrived. \nI called Haystack to see what had happened and their reply was \"Oh, the driver couldn't find your house so he came back.\"\n\nReally? The driver couldn't find my house so instead of calling me so I could give him the directions he returned back to the restaurant without giving any notice. I wonder would they have ever called me or just charged my card $60 and left me in the dust? \n\nI was really disappointed in the fact that when I offered directions to my house the man on the phone replied \" We close in 5 minutes\". I took that as him implying the driver would not be returning to complete the delivery.  \n\nI asked the man on the phone to keep our food for us and that we would be there shortly to pick it up. It only took 6 minutes to get to Haystack and when I arrived the food wasn't ready. \n\nAfter waiting another 10 minutes the food came out without an apology, explanation or offer to remedy the mistakes they had made. They just sent me on my way. \n\nThis experience made the food taste horrible and I will not be returning.", "author": "Haleigh A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-05", "description": "I have no complaints about this place - the pizza was delicious and the staff was super courteous. Possibly due to the low(er) reviews on Yelp, I didn't have to wait to be seated during dinnertime, and I'm starting to really value that around here. I'll be back!", "author": "Sara H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-01-16", "description": "Cheap, kid friendly Italian restaurant. Most things are covered in butter, the portions are big and the price is fair given the neighborhood. We only come here when we are with folks with kids. Pizza is fair- good but nothing special. The service can be pretty slow though.", "author": "Vanessa L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-20", "description": "Saturday night dinner with my mom, ordered the haystack special and it was delicious. Great flavor, crust, and fresh toppings.", "author": "Ingrid J."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-01-05", "description": "I really enjoyed my meal from Haystacks. The artichoke & crab Meze was delicious as well and the antipasta salad and the Zorba pizza.\n\nWhat I didn't enjoy was the RUDE service we received. Which is why the low star score. We were seated in the very back area and it took forever for someone to take our drink order or offer water. We were the only ones seated back there. It took another 10 min or so after that for the server to come back with our drinks. After we ordered, our food came out fairly fast. What I didn't appreciate was when we ordered desert. The server/busboy (short guy with nappy long hair who ties it back in a man bun) took our desert order got our order wrong. We ordered pecan pie and pumpkin cheesecake. Not that hard to remember. Instead he brought out 2 different pies. When we told him that these were the wrong pies, he gets mad and storms off saying loud enough so that we can hear \"Damn, I'm just trying to go home already!\" and continues bitching and complaining as he walks into the kitchen. Mind you, the kitchen isn't that far from where we are sitting so we heard everything. The lady who was our original server comes back to apologize but the damage was already done. Now I understand why this place has such a low rating. I would never want someone who has an attitude and is rude to customers working for me.", "author": "Robyn S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-22", "description": "I being a customers for about 8 or 9 years and I could say that the service is better with more staff.\nPizza is great not to thin or thick.\nWe always ask for thick crust and extra sauce and fresh basil,definetly our favorite.\nMy kids love the hawaian pizza and I really enjoyed their lasagna, is awesome!\nDefitnetly our favorite pizza place in the city!", "author": "damariz m."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-11", "description": "My partner and I love haystack! It's a family-friendly place with great customer service. We had it delivered recently and it came super fast. The crust is delicious and we get the Luigi almost every time; it's so good!", "author": "Brittany V."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-02-13", "description": "The pizza is the best! The Alexander is what I go for with extra chz. The service is poor but the pizza makes up for it. The girl busser was good to us, but the lady server who took our order had a horrible attitude . She thought we were talking about her when she came to take our order and called my friend out on it! You can tell she hates her job, just nasty. But when the pizza came she disappeared and the meal was the best ! I've read a few reviews and a lot say the service isn't good. Get it owners???", "author": "Ladyreyes R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-23", "description": "Walked by as me and my boyfriend were looking for a place to eat dinner, and decided to try it. The Pizza was so delicious. You definitely get double for what you pay.", "author": "Kristy A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-11-22", "description": "The woman who takes the orders put me on hold twice tonight and couldn't get my phone number right after I gave it to her 4 times.  4.  That has to be a new record for a native english speaker in the service industry.  When I got upset, she said I anger easily.  Thanks for the feedback.", "author": "Isaac C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-11-13", "description": "They're great if you eat in or do a pickup, but their deliveries take way too long (over an hour and a half) and they don't really care (when I called I was lied to twice about status of my order).\n\nDon't order online, via an app, or by phone, it won't matter. Just get in the car and drive over and get it yourself. At least that way you can have a beer while you wait.\n\nAlso theres a pretty good chance they'll get the order wrong.\n\nJust do not order delivery.", "author": "mike m."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-11-14", "description": "If I could leave zero stars I would. Extremely rude service. Delivery that took hours and cold (incorrect) pizza. The food here can sometimes be pretty good but the service is so bad it doesn't make it worth it. Dining in is a bit better than delivery, but the staff is still rude either way.", "author": "Christie K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-12-12", "description": "The pizza never arrived.  I called 4 times (which I know is a lot-I'm hungry)\nThe pizza is mediocre, I have had it before.  I reluctantly ordered it because another pizza join in Noe is a joke.  \n\nDONT ORDER FROM HERE!!!!!", "author": "maker of p."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-03", "description": "Got the New Yorker and it was a brilliant pizza! The delicate proportion of oregano, garlic and cheese was wonderful. Definitely one of the best thin crust pizzas I've ever had.", "author": "Rajan D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-14", "description": "Pizza was great and salad dressing was so so good. They delivered at midnight which was a tad bit later than what was told to me, so that is my only -1 star.", "author": "Fallon H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-02-26", "description": "Terrible service....rude waiter and waited 40min for pizza with only 3 other tables on restaurant and no noticeable to go orders...must have a really really good lease, to survive on 24th St in noe", "author": "Eric T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-04", "description": "I wish I could give them a 6 star rating. The service was above and beyond from the moment I walked in with my wife and kids. Our host was great a young man D. He did something most places dont when I asked for waters he brought my son and daughter child cups plus crayons and paper. Our waiter was a very nice man and made nice conversation with us we felt at home in this place. A man whom I believe to be the owner or manager with a mustach was excellent with his customer service and took pride in the resturant as we waited for our food the pizza #10 which was breath taking. He went out side to sweep the street and the resturant you don't see owners or managers do that much. He was a class act and this will now be our familys pizza/pasta resturant for years to come. It was a delight to dine here", "author": "Rudy M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-31", "description": "I was house and dog sitting for a friend of mine in the neighborhood, and as luck would have it, their dog developed what we scientists professionally refer to as \"the shits\" and I had to go to the Death Star (I believe it's called \"Whole Foods\" if you translate it to hipster) to pick up some chicken and broth to make dinner for the dog. Since Haystack was nearby, I decided to pick up dinner on the way back.\n\nI saw a random tip on the Yelp that said to order the wings here. Despite spending an entire week in San Francisco, I was somehow still a mainstream consumer whore. Oh wait no, I was just hungry and wanted wings and pizza. BEST DECISION EVER.\n\nThem chicken wings were meaty and tender, probably right up there with the best I have ever had. That was after I had walk for about 15 minutes at night and then let the wings sit for another 30 minutes at room temperature while I cooked dinner for the dog first. The thick creamy ranch they provide was perfect for these wings. I ordered a personal pizza as well and they loaded it up with the toppings. The bacon they used was the thick-cut pieces instead of wimpy bacon bits that you would find elsewhere.\n\nGIVING THIS PLACE 1-STAR IS LIKE GIVING FREEDOM 1-STAR. WHY DO YOU PEOPLE HATE FREEDOM?", "author": "Ian L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-07-14", "description": "The slowest service in the world. I've been here over an hour and even the many waiters\n--only one overworked waitress--don't seem to make the food come. Once it came it was ok.", "author": "Peter G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-09-05", "description": "Not bad but, unremarkable\n\nI ordered the namesake, the \"Haystack\" pizza. The toppings were good but the crust was on the meh side. Slightly burned on the edges and soggy in the middle. Then, they committed the cardinal pizza sin, it was served on an aluminum platter on top of one of those wire stands. So, your first piece is piping hot, the second tepid, and everything else, just cold and soggy.\n\nThe waitress was friendly and attentive (giving the place 3 stars instead of two).\n\nIf these guys focus on the food more, there's some real potential here.", "author": "Paul D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-22", "description": "WHY DOES NO ONE ORDER THE CHICKEN WINGS HERE. MY GOODNESS. \n\nI love chicken wings that are crispy, a little seasoned and not too greasy (in which my preference is that I definitely don't like saucy wings). With that being said, I honestly think Haystack has one of the most scrumptious wings I've ever had. It's completely worth throwing into an order with your pizza (maybe not in large groups though, unless you're willing to get more than one order - maybe 1 order per 3 people would be good). \n\nAnd another thing: No one here on yelp mentions the ranch that they order for the restaurant. I'm not even going to describe how perfectly viscous the ranch is - all I'm saying is that you have to trust me that this ranch is absolutely perfect and that unfortunately the ranch is not sold in stores :(\n\n\nNo comments on the pizza though, I'll leave those ratings to other yelpers. But yes, I enjoyed my pizza here very much (The Alexander: sausage, salami, pepperoni, and mushroom, delicious). \n\nThis place is nice for dates and small families; I haven't had a really good experience with large groups due to how long it takes for the food to come out, so I recommend just a small amount of people for the best experience.", "author": "Tiffany A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-09-01", "description": "We way, way, way over- ordered.....\nThe pizza was good but the word \"soft\" comes to mind.  It was chewy and \"soft\".  The sausage and mushroom combination was perfect--we could actually taste the mushrooms.  The sausage was tasty too.\nI ordered the chicken parmigiana with a side of linguine and vegetables.  My partner ordered the veal parmigiana with the same sides.\nI have never seen such a large amount of food served  in SF--ever.  The portions were huge.\nWe wound up taking half the pizza home as well as  half of our entrees. \nThis place is definitely a \"time bubble\" kind of place.  It is old school Italian that has never changed in taste, presentation or recipes.  It's been open since 1972.  Every song that we heard playing in the restaurant was from that time frame too.  From Seals and Croft''s \"Diamond Girl\" to Elton John's \"Daniel\".  Time warp?  Time bubble?\nThe food, albeit from yesteryear,  was pretty good.", "author": "Thomas D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-23", "description": "Old school decent pizza (good crust) in the land of the precious. Love it!", "author": "M M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-10-29", "description": "Haystack has a lot of overpriced unpleasant Italian style food of all sorts.  Veal Parmesan filed with lots of gristle and too much soggy stale breading was particularly foul.  So-called thin crust cheese pizza missed the mark-Too much cheese and sauce with a mealy crust.  Years ago when my kids were young and liked going there it might have been better. Noe Valley needs a good casual Italian place and Haystack is not the one.  I must say the wait staff is nice.", "author": "Richard D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-02-25", "description": "If you are looking for pizza in Noe, go elsewhere. All things being equal I prefer to support small local businesses, but this place is really subpar. The pizza is pretty gross. Service is detached and diffident. I have no idea how this place stays open.", "author": "C X."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-22", "description": "In love! This is my new favorite place. The service sucks but the amazing food makes up for it! I ordered the vegetarian pizza and let me tell you it was the best I've ever had!! The bottom crust was crispy, the sauce was delish and the vegetables were plenty. 1/2 of the pizza had pepperoni and it was good too. Oh, the iced tea is also on point. I can't wait to bring some friends. It's a hidden gem. I saw some of the other pasta dishes coming out of the kitchen and they looked good too. It's a very family kinda of place and the 80's music just added to the atmosphere. David Bowie + pizza = win!", "author": "Tony B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-29", "description": "Marcella was awesome. She made the best Mediterranean salad 'from the heart' I have ever had. Just awesome.", "author": "Ron M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-12", "description": "I love Haystack. They deliver late in Noe Valley which no one else does and the pizza is delicious. It's old-school-thicker crust, a lot of cheese-but I love it and the sausage and pepperoni are tasty too.", "author": "Lydia B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-06", "description": "The pizza was very fresh and tasted great. Salad dressings tasted homemade. Service was also great. Only complaint is the pizza could have used a drip pan underneath it to help remove the grease. Didn't slow me down eating it though", "author": "Chad W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-15", "description": "Haystack was our neighborhood go-to pizza place growing up.  I mean, before I learned how to drive and opted for Milano's or Pasquale's.  But whenever I'm visiting the folks, they will still order from here since it's just a few blocks away.  I always remembered it as just being okay.  Our default toppings are always pepperoni, sausage, and mushroom.  Haystack's sausage is unique, but everything else was just average.  \n\nFlash forward to present day.  This month we've ordered from them twice and I gotta say, something's changed.  And for the better!  I'm not sure if it's the sauce or the dough.  Maybe it's the dough.  It definitely seems different.  Fluffier.  Well, whatever it is, both times we got takeout and both times I ate 3 or 4 slices when I usually limit myself to 2 max.  And it's not that I wasn't thouroughly full after 2 slices.  It just tasted really good and my mouth kept begging me to keep the good times rolling.  And it wasn't just me that noticed a difference.  We all did.  I think the consensus is that the dough is different.  Well, whatever it is, kudos Haystack for improving your pizza.  Coming from a person that LOVES pizza and spends a lot of time in Noe Valley, that's a job well done!", "author": "Joe M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-06", "description": "I'll start by saying, Service is incredibly slow!!! BUT the food is great. I always get chicken cordon blue, it's amazing. Comes with veggies & choice of another side I always get mashed potatoes & my bf always gets spaghetti!! Both soooo good!!  I've had their pizza many times it's also delish!!! Their crust is pretty thick tho so I like to specify thin crust!!  I would give 5 stars but service is really really slow.  Still I love this spot!!", "author": "Natasha P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-06-10", "description": "The worst Italian in Noe Valley. Charming atmosphere, but the food is basic. The pizza is mediocre. The staff are on the strange side. We've eaten there several times and finally just stopped after giving it numerous chances. For pizza go to Twin Peaks. There are better Italian a few blocks to the West on 24th.", "author": "David H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-14", "description": "Bad reviews regarding this establishment is BOGUS!!!!! Great food, atmosphere, servers, and drinks!!! Fourth time here, first time leaving a review. I came with wife and young daughter, ordered mozzarella appetizer, calamari , medium pizza, and a salad! Dishes were out quick and servers all had great attitudes! Did I mention it was full of customers!! Thanks a lot guys! Definitely will be back!!!!", "author": "Cee S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-16", "description": "I enjoy their pizza always on point, they have all kinds of combinations or make your own and they also deliver takes a little longer but always worth the wait. great service", "author": "Leslie C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-09-20", "description": "We used to regularly order from here, but haystack just lost our business. We ordered a haystack pizza and normally it comes with mushrooms. When they delivered it was missing the mushrooms, my favorite part. I called them to tell them and they basically said they would send the driver back to give me $2 for the mushrooms. Seriously? If you get the order wrong you either make it right by making another one or at least discount me 15%-20% for the inconvenience. And of course Im not gonna make the poor driver come all the way back just to give me $2, especially when I paid by credit card. Why would they even suggest that? Guess they don't know how to keep customers. Pizza is soggy too.", "author": "Katrina L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-06-09", "description": "The food is good, but the service is horrendous! They really need to work on being more attentive and also on service overall. Especially when they themselves are the ones who are in the wrong, I guess you can tell I had a bad experience here. It's sad really because I tolerated the sevice up until now because the wings and calamari were really good, but no longer.", "author": "H P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-05-18", "description": "Before Saturday Night, it had been awhile since I have been to Haystack's pizza. After Saturday Night, I won't wait that long again. It was very good, but here are my reasons for loving it:\n\n1.) We needed a place at the last minute for 15 and they fit us right in. We had one long table that was fit for the Queen's Crew (Happy Birthday Monica!!!). It was very reasonable price wise too~\n\n2.) The Owner, when carding me - actually thought I was underage! LOL, won  me over - right there. Okay, I guess I shouldn't have included that in my review, but it was awesome.\n\n3.) Most importantly - the food, the salads were huge and great. The Greek Salad had all the fixin's of a great greek salad. The house salad, although intended to be a personal side salad was very large as well.\n\nThe pizzas were delish! (See MY posted pics) We ordered:\n1.) Luigi the Italian, which was Pesto, Fresh Garlic and Tomato - really good and one of my favorites. \n2.) Cleopatra, grilled eggplant, sun dried tomato, fresh garlic, feta and red sauce.\n3.) The Haystack, Sausage, Salami, pepperoni, mushroom, bell pepper and onion. Very Good.\n4.) Jolly Green Giant, Broccoli, Zuchinni, Fresh Garlic, Onions, Mushrooms and Fresh Tomato. \n\nI only tried No. 1 and 3 of the pizza list above, but they all looked wonderful and everyone enjoyed their meals.\n\nI would definitely recommend this place to my friends and family.", "author": "Rebekah T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-15", "description": "I enjoy Haystack - whether dining in or getting it to go.  I usually order from there at least 2x monthly, either for pizza or pasta (most recent order was last week for 1/2 ravioli, 1/2 spaghetti).  That order was just as good as when I've gotten the same thing at Joe's of Westlake (which is great).  \n\nThe only thing that keeps me from coming more often is their prices which are $2 - $3 higher than what I'd expect.  \n\nThe staff is quite friendly and I find it most enjoyable sitting at the bar when eating in...", "author": "Anjanette B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-10-28", "description": "This has been my my go to pizza delivery place for a while but the last couple of orders have been below par. Fast, friendly service but the quality is now questionable. I'll probably give them one more try before moving on.", "author": "David D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-02-01", "description": "Absolutely horrible. Pizza and wings were the same quality as generic frozen foods. Pizza dough is not chewy and is too thick, sauce has unbalanced acidity, too much sugar, and is watery. Wings were tender but flavorless. Must be CAFO chicken. Uninspired. One of those pizza places that is driven by margin instead of passion. I hope they take this review as an opportunity to make some real change.", "author": "Christopher w."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-26", "description": "I love Haystack!! Their pizza is delicious! Their pastas are very good and tasty! Love their garlic bread! Would recommend to a friend!!", "author": "Janet P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-08-21", "description": "The pizza and other food is solid but wow is it expensive.   We ordered a small and medium with two toppings and it was over $40.  Wow wow wow.  Yes I know noe is expensive these days, but seriously how can they survive with their prices being more expensive than a meal at the \"fancy\" pizza places on Valencia.   I used to love you guys Haystack, but way way too expensive to come back now.   You were a great go to for a quick well priced family meal but those days are apparently long gone :(", "author": "Jaime A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-10-08", "description": "Good, solid pizza. it was doughy, and cheesy, and classic. Good old-school atmosphere inside the restaurant, too. I loved the old western theme. Kinda cheesy and silly, just like a pizza parlor should be! \n\nI sat inside and ordered a take out order. The girl who helped me was cool and chatted with me for while the pizza was cooking. \n\nMy only qualm would be the prices. I think they are a tad bit high for the quality and ambience. I would lower all the prices like $3-4. That would be more fair and reasonable. \n\nI was willing to pay those prices though because I would like to see this place stay in business, so there it is.", "author": "Alanna R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-09-23", "description": "They Lost Their Spark\n\nI Came here Yesterday With My Sister For Dinner. The Waiter Who Greeted Us And Took Our Seats Seemed Busy And Anxious. A Bit Later, An Other Waiter Gave Us Menus And Water. Looking At Te Menu, Everything Is Way High Priced! My Sister And I  Both Got Personal Pizzas. When The Pizza Came, It Was Flavorless. I Had To Add a Bunch Of Cheese, And Hot Pepper Flakes For The Pizza To Taste Good. All in All, I Wouldn't Come Here Again. The Food Is High Priced, And Not That Good.", "author": "Susana R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-23", "description": "Best pizza on the whole of 24th street! Talk about bang for your buck and fast delivery.", "author": "Jenna O."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-07-22", "description": "This place is pretty solid. The veggie pizza was a little soggy in the middle, and it tore apart when I picked my first piece (and every piece thereafter). Other than that the pizza tasted pretty good and the customer service was good while we waited. They let us order a pizza for pick up 15 minutes before they closed. They're one of the only restaurants in Noe Valley open past 10:00, so it's great for a nighttime pizza emergency.", "author": "Jenny G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-08-15", "description": "This pizza is terrible. Very nice people and fast delivery, but the quality of taste is awful. I don't recommend wasting your money on this. It will leave you hungry and unsatisfied.", "author": "Steve H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-05", "description": "I like this little family style place. I was here on Monday, for a writer's group meeting. The decor and atmosphere is relaxing, yes, a bit old fashioned but very comfortable and low-key. Service was good. I like the soup and pasta but I thought it a little over priced for the side dish portions. \n\nI was told by several to order the pizza. Next time I visit, I will. I was disappointed that they do not serve pizza by the slice. And, I was disappointed that they do not serve a few Greek food dishes, like Moussaka. \n\nThe reason why I say this is because as I understand it, the restaurant is owned by a Greek family who came to SF from Greece in the early 1970's and settled in Noe Valley. The decor has some Greek themes and so I was anticipating at least one or two items on the menu to be inspired by Greek food. But no, only Italian style dishes. \n\nI was also disappointed by the house red wine. It tasted mellow, but the next morning I had such a headache, and only after one glass. That's not a good sign. I also thought it sad that Haystack charges for bread and butter. Garlic bread, I can understand, but basic bread and butter? If that's the case then why not charge for serving plain tap water? Other than, that, I really like Haystack and yes, I will return. \n\nHopefully some day soon they will serve something Greek-inspired, like Moussaka. Perhaps you can tell, that's one of my favorites.", "author": "Jonathan F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-08-04", "description": "I can say their Pizza making is completely inconsistent. I have went 4 times and my pizza has been different every time. I can tell that it's the only pizza  place around so I still continue to go. The servers are horrible, but the bartender is the reason why I keep coming back! She is awesome! So if you want to dine in. Sit with Kim!", "author": "Mikayla S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-12-09", "description": "Holy cow--what a great pizza!\n\nMy wife ordered two of these for dinner tonight from her work and then brought them home.  We had a cheese pizza and a veggie pizza and just kept devouring slices until there was almost none left.  I think there's not even enough for lunch tomorrow.  This is really the best-tasting pizza I've had in a long time--I've had a fair amount of pizza recently, and this one comes out pretty near the top.  Delivery service was pretty friendly too.\n\nI really want to try sitting down at this joint and trying out some of the other food that they have here.", "author": "Matthew D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-08-14", "description": "They shorted us a meal on our delivery order. Then refused to make good on the mistake. Avoid Haystack at all costs.", "author": "MArk H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-05-13", "description": "Good.  Made me happy, but nothing special.  I would actually give the pizza a 2.5.  The staff gets a 5!  Wonderful, attentive, fun staff...rather average, generic pizza.  There aren't many pizza options in Noe Valley.  Patxis is the way to go.", "author": "Evan M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-01-28", "description": "***UPDATE*****\n\n*wakes up sober*  It wasn't that great!\n\n*****************************************\n\nMozart's birthday today.\n\nI'm giving Haystack 4 stars on Principal.  I'd even give this 5 stars amid the true San Franciscan style pizza places.\n\nThe service was perfect here tonight.  I don't even know who served me!   I don't even recall who the waitress was who served me.  Whoever she (or he or it was), I left he, she or it a 25% tip because it was a rarity: perfect service.  I define this as feeling as if the food magically appears before me.  Dam, was our server an Artesian? or an alien?  Maybe the toothfairy or a Greek Leprecaun.\n\nIt was refreshing not to hear a, \"is everything ok?\"   Of course everything ISN'T ok.  We're in San Francisco: the city of no parking, futia colored walls because Richard Simmons says white and gray walls lack panache, pilates, the final dump of forgotten trends from around the globe.\n\nWell I happen to love bright grey walls dammit!\n\n*sips another shot glass of port*\n\nWhere was I?  Yeah, 4 stars, I enjoyed this place.\n\nEven Budweiser on tap.  I nearly cried from the Nostalgia.", "author": "Tony U."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-04", "description": "I ordered linguini and clams with garlic sauce. They were very generous with the clams, and it was good. I'll be ordering from here again.", "author": "B A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-07-04", "description": "They lose 1 more star b/c the website now is just an error message that indicates you should call the store :(", "author": "Kelvin B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-07-03", "description": "We ordered thru Eat24. Got delivery sooner than promised--about 45 minute wait. Antipasto was great--much better than last time when the toppings were skimpy.  Meatball sandwiches were meh. Not enough sauce or cheese, flavorless meatballs; $12 each including side of fries or spaghetti.  Total cost of $50 was a lot for just one quality item.", "author": "Mary L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-04-30", "description": "I've been to Haystack's a few times and have always been satisfied. Haystack's is the definition of comfort food for me. It's no frills pizza and offers a casual, welcoming environment in the heart of Noe Valley.\n\nFrom traditional cheese and pepperoni to vegetarian to 'the-make-your-own' pizzas, you really can't go wrong. There are tons of options all at great prices. It's definitely a solid, local spot for families and for groups. Get the pepperoni pizza rolls, it's a tasty starter!\n\nThe service is kind, quick and knowledgeable! Our server gave us recommendations on pizzas and starters, made sure we had drinks refilled and always came by to check up on us.\n\nIf you are in Noe Valley and are craving pizza, Haystack's is a great choice!", "author": "Stephanie C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-05-15", "description": "We went to Haystack last night, because we were too late to make it down to Pauline's. The half/half vege/cleopatra had too much tasteless cheese and too much garlic. There was lipstick on my beer glass, which I only noticed half way through. The server didn't seem very interested in anything. Next time, just go to Pauline's...", "author": "Stuart J."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-05-25", "description": "We are dinner here last night and were not all that impressed with the food. We had artichoke crab dip that was ok and Old McDonald pizza that was just ok. It had onions and garlic in it that was barely cooked. Garlic is yummy, but not half raw garlic. \n\nWhat stuck out and impressed us with our visit here was the waitress, Jill. I would give the place a 5 if we were rating her. She was a machine. She seemed to be running the front of the house on her own, even though there were 2 other wait staff \"working\".  \n\nWe hate that the food was not great, but happy to meet Jill.", "author": "Shawn W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-02-05", "description": "Another Pizza joint that has stood the test of time (decades), and test of millions (maybe billions)  taste buds. While never having ventured outside the pizza fare, I am fan. The down-to-earth.... pizza comfort food and neighborhoody (is that a word?), \n\nhttp://www.haystackpizza.com/\n\nAgain, I LOL at some reviews (not all in reference to Haystack !), some classics include dining on Thanksgiving (\"had to find a place\" .....hmmmm must be, that family didn't invite the reviewer), Christmas (anyone seen \"A Christmas Story ?) New Years Eve (ewe .... chasing pizza on the last day of the year) only to discover the waiter/waitress/cashier/busboy was not in the best mood.... dahhhh.\n\nFavorite pies include \"The Haystack\" and  \"Zorba the Greek\" (kinda great since the original founder is of Greek heritage).", "author": "Matsuo U."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-01", "description": "Only 3 stars!? I'm SHOCKED!\n\nHaystack Pizza rocks! While I have only ordered from here twice, I have NEVER been disappointed! \n\nThe food is straight-up italian deliciousness--huge portions, lip-smacking delectable food and enough cheese on your chicken parm to sink a ship ::drool::\n\nDelivery is super fast, and the guys are incredibly nice and the food is scrumptious. They told me that the wait time for delivery was approx 45mins and I think it got to me in 20... nice and piping hot and ready for me to devour (which I did!)\n\nMM-mm eat here if you want some down home italian cooking!", "author": "Alyssa S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-12", "description": "Eggplant parm is always delicious. I have had it delivered at least 4 times. Don't get the veg on the side though, garlic potatoes are much better!", "author": "Holly M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-05-31", "description": "I love thin crust pizza and they make theirs just right. Their eggplant parm is delish! Zack is by far the best server there!", "author": "Fallon P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-25", "description": "After Noe Valley Restaurant closed a couple years ago, this is the only remaining \"old-school\" Italian restaurant/pizza joint in the hood.\n\nDespite the negative reviews from the recent transplants who think they've patented cool, Haystack has good food at reasonable prices.  These other, unhelpful Yelpers, seem to forget that people have different tastes, and guess what, you can order Haystack's pizza with thin crust or their traditional, thicker crust.  Yelp isn't a forum for you to announce your personal taste, it's a place to give honest reviews about whether a business is reputable, or not.\n\nYes, La Ciccia is a better Italian restaurant, and for those of us who don't like Patxi's \"gourmet\" pizza, this is the go-to place when you just want a pepperoni pizza and spaghetti with meatballs without busting out a Grant.", "author": "Xu D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-03-30", "description": "After a looooong day, my girlfriend and I decided to eat pizza at Haystack, the last time we came we had poor service but we decided to give it another go. We walked in , only like 2 tables were occupied, and waited about 5 minutes until someone finally noticed us. She pointed us to sit in a table right by the entrance which we weren't to happy about. Then we waited a while until she finally came to get our orders. She just came up and looked at us, and my girlfriend said,\" Uhhh to drink I'd like... And to eat we'll have...\" And she left. We waited about another 15 minutes watching her just talk at the bar and no one ever brought our drinks out. We had enough and left, horrible service. Never going back", "author": "Nigel F."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-03-15", "description": "Use to love this place for delivery. And I've had delivery no less than 15 times. Thin crust WAS great. However, the last 2 orders have been BAD. I almost think there must have been turnover in the kitchen. The pizza was under cooked and was just an overall sloppy mess. It was nothing like the pizza they would normally produce.\n\nI'll give it a couple of weeks and try again but if that pizza turns out bad, I'm done.", "author": "Kendall T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-12-26", "description": "P-i-z-z-a!  My daughter, Kris and her fiance, Aaron took me here for my birthday.  Impeccably delicious!  I brought my girlfriend, Dani from Brazil here.  \n\nDani ate and never said a word because she couldn't stop eating.  Dani loves Haystacks!  The reason is clear why I brought my foreign friend to Haystacks with no embarrassment or worries.", "author": "Shirley M. J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-16", "description": "Classic neighborhood pizza restaurant and bar. I have been a regular for years and always find the staff very friendly and attentive.", "author": "Todd D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-08-19", "description": "The pizza is good...\nThe problem there was the \"CRAZY\" bolivian guy... He just a driver there but he was driving everybody crazy, like the  owner, manager, workmates, clients,etc...  \nI heard he's not working there anymore... Now i believe haystack bussiness will go up again....\nFck this krazy bolivian guy.... Ah ah ah ah", "author": "marcio d."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-13", "description": "I LOVE their pizza! They do not specialize in thin crust or deep dish, but just the classic traditional American style pizza, and they do it perfectly! Simple flavors with a soft yummy crust. If you want just a classic American style pizza, this is the place to go. If you're in the mood for thin crust Neapolitan pizza like from Delfina, Farina or Mozzeria, this place is not for you.", "author": "Luna R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-12", "description": "I love haystack and it's neighborhood vibe. The sourdough crust is on point!", "author": "Henry T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-01-29", "description": "Been ordering from here for the past 10 years. The food is decent but not amazing.  Every time you call, you will speak with the rudest person.  You will want to hang up and order from somewhere else, but maybe realize it's late so you go through with your order even though you've regretted giving money to a business that has treated you so badly. I'll give two stars because the food passes for delivery, but honestly wish I would never have to talk to one of their employees ever again.", "author": "J P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-12-12", "description": "Not sure how they are still in business in Noe valley! This area needs an upgrade. We ordered delivery and it arrived undercooked and pretty gross. Won't order from here again", "author": "Roshni P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-11-20", "description": "This is honestly one of the only older businesses in Noe Valley.  Many of the other places have been there for less than 15-20 years, which to me is very \"new.\"\n\nI grew up eating here as a kid, and it's still damn good.\n\nI get thick crust pizza and the salads are big and fresh.\n\nIt's very no frills and it has a great old Western decor scheme going that is lovely.  I think it's a real relief to come here.  There aren't a lot of places on 24th that are very worthwhile or quick.", "author": "Julia D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-03-26", "description": "Pizza arrived within 45 minutes on a Friday, so that wasn't bad. When I took a bite of it, though, it was burnt quite badly and tasted terrible. For some reason, I also ordered fried zucchini and it arrived swimming in grease and a little overcooked as well.\n\nA quick call back got apologies and the offer to refund or send out another. I was in a hurry so I took the refund. The lady was nice, so I'll give them another shot. I'll revise my review at a later date...\n\nI posted a pic of the burnt pizza.", "author": "Adam L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-02-16", "description": "One star for the very good service.Zero stars for the pizza.\nBeing the pizza fanatic I am,I'm always on the lookout for new good pizza places.\nA friend of mine recommended this place and said it was very good.\nI always try the pepperoni or pepperoni and mushroom first to try a new pizza place,so I can taste other important things on the pizza too,like the cheese and sauce.Not the typical sauce here.Hardly any cheese on the pizza either.Just wasn't feeling it here.Wont go back.", "author": "Mike M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-12-27", "description": "Haven't tried the pizza yet, which seems to be popular.\n\nI'm new to the area and chose this place over an Italian chain restaurant just a block away thinking it looks like a local family owned kind of place with fresh made authentic pasta. Not that many customers, pasta was just ok, not worth the price or wait. I can make similar 'trader joes' pasta at home for 1/4th the price. \nThis place reminded me of the show where chef Gordon Ramsey rescues restaurants with some potential. \nService and decor are good. Friendly staff but need a little more enthusiasm in the kitchen maybe?", "author": "A K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-06", "description": "So there I was, attending our quarterly pub crawl.  This time, Noe Valley.  As the light buzz started to set in, I realize that I've not eaten.  Then, like a beacon on a stormy shore, there was Haystack Pizza.\n\nI continued to drink, of course, but knew I needed to wrap it up in time to place an order and abscond with it to scarf at home, or in the car ride on the way. \n\nThat said, the staff was great, and the pizza was delicious.  It's tough to get crunch and chewy right with pizza, but it was done.  The pepperoni was delicious and perfectly crisp around the edges...just like I like it.\n\nEven the next day, the slice was just as delicious.  The perfect reminder of the great night I had prior!", "author": "Andy S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-09", "description": "I absolutely love this pizza place... Every time I come to city when I'm craving pizza this is the place to go... I've been coming here for 20+ years since I was little with my parents... The dough is so good.. I also like the calzone and the linguini and clams with white sauce... I definitely recommend this spot...", "author": "Prisma P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-13", "description": "If you want a little 1970's flashback, come to the Haystack. Pizza grease and '70's rock to bring you back to a time when life was simple and dinner out was fun.", "author": "Melissa H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-03-06", "description": "The pizza took over 80 minutes to arrive and tasted like cardboard. We will NOT be ordering from them again!", "author": "Alison T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-01-27", "description": "what i ordered... \"the haystack\" pizza, hot artichoke with crab meze\n\npizza was normal in size but was so heavy. pie could have been great if it wasn't for the blandest marinara sauce i have ever tasted. other fillings were abundant and good especially with the veggies.\n\nhot artichoke with crab meze was mediocre though generous in size. tasted so oily, it felt like eating mayo. and the italian bread was lightly toasted and soaked with butter.\n\nambiance... great (place was antique and clean... and the cuckoo clock was a cherry on top)\nservice... ok (drop and go with a wicked smile)\ncost...$$ (fair)", "author": "Gors P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-11", "description": "I enjoyed their pizza! Staff was friendly and helpful. I enjoyed the vegetarian pizza and it was bursting with flavor.", "author": "Megan B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-05-16", "description": "I was here once a couple years ago and it was okay enough to return to. After this last time, I won't be back again. The server was a weirdo and he was giving us a serious case of heeby jeebies. \n\nHe applied a hard sell on beverages and we just asked for water and he sarcastically said \"ok a shot of ouzo and a shot of jack daniels\" he said as if it were a joke but with undertones of \"sure thing, cheapskates\"\n\nHe barely spoke to us the entire meal after that. The only sound we got out of him was the sound of our salad plates being dropped onto the table with a bang as if he was frustrated with us for reasons unknown. \n\nWe were seated at a pretty large table for 3, and when the pizza came he set it down directly on my wife's placemat although we made space in the center of the table for it. Again, he said nothing and left. A good server usually starts you off with your first slice. The place was next to empty so it's not as if he had somewhere else to be. \n\nWe sat there for 10-15 min after finishing eating before I had to ask for the check and he says \"yeah yeah\" under his breath as he walks away, such a weirdo. When it came time for him to earn his tip he got jokey again. I pull out my credit card and he said \"no she is the woman she has to pay!\" What? I understand he was trying to be funny, but that joke just didn't make sense and instead came off weird and sexist. I couldn't wait to get out of there.\n\nOh, I forgot to write about the food. Our salad was so-so, the lettuce seemed to be a mix of romaine and iceberg with emphasis on iceberg. The dressing was crap. The pizza was pretty bad. The sauce was watery and lightly applied. The cheese seemed to be low quality and the entire thing was doughy and apparently undercooked. \n\nI'm not sure if the ownership changed at some point since I last visited, but in the direction they're headed, it should. At the very least, a Kitchen Nightmares visit from Chef Ramsay is in order.", "author": "aaron f."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-03-24", "description": "My sister has ordered from Haystacks at least 5x a week (delivery).  She gives delivery person nice gratuity.  One would think Haystacks would appreciate loyal customer, right?  That IS how businesses continue, thrive, no? One would go further to say returning customers provide security for sustained profitability.  My sweet sister was told by the snarky woman who has taken her order THAT SHE ORDERS TOO MUCH.  TOO OFTEN.  Finally, she would no longer honor her orders.  There is no backstory to this.  She had no debt outstanding.  She ordered from her neighborhood eatery.  She has no car and mobility problems.  The ACLU, KGO, and BBB all informed and investigating.", "author": "Eileen D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-18", "description": "I have been going to Haystack for years.  The pizza is very good, generous toppings and fresh. I recommend trying other dishes on their menu though. The calamari is as good as North Beach Restaraunts. Pasta and  Chicken dishes are yummy, particularly like the ravioli. \n \nThe surf and turf was okay- the steak perfect, the surf just ok and again generous portions of vegetables and sides. They also make one of the best hamburgers in the city.  The Alibaba burger is outstanding! The classic - excellent with  Salad, Fries or Spaghetti - all a good compliment to the burger. \n\nWhether we go in to dine, order by phone or online, the staff is friendly and acommodating.  Ordered online for the first time delivery was within 30 minutes and the food hot.", "author": "Janet C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-03-10", "description": "I finally ventured into this place for a sit down, eye-talian style dinner with my bff. I was dumb for not paying closer attention to the prices on the menu... we ordered one spaghetti w/balls and one cheese ravioli w/meat sauce, one garden salad to split, one root beer that came to me flat and a garlic bread that arrived after we nearly finished our meal. The bill came to a whopping $48. What the heck!?!\n\nPerhaps if this wasn't a meal we could have gotten at the Stonestown food court for less than half the price... maybe if my raviolis arrived hot rather than barely defrosted... sigh. At those prices, at least make some effort to fool me into thinking this is fresh-made fare.\n\nIn addition, the place could use some sprucing up (dust on the plastic grape vines), and they should lose the assault of country top-40 on the radio blasting in the background. \n\nAlthough the staff was pretty friendly, they hovered immediately after the bill came (the place was almost empty), asking repeatedly if we were ready to pay. Perhaps they suspected we would run after seeing the check? \n\nThe prices match the neighborhood but not the food, decor or service. You're better off at Pasta Pomodoro up the street or Twin Peaks Pizza just around the bend.", "author": "Prattle P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-03-30", "description": "I think this place is exactly what it aspires to be. A simple family-run neighborhood restaurant.\n\nThe food and the service are OK. The prices match the location and the entire proposition. The decor is less than contemporary and certainly not hip.\n\nI don't understand some of the bad reviews here. If you want to go to a nice trendy restaurant with superb service and creative food, go downtown and pay top dollar. If you are just hungry, in the neiborhood, and craving some famly style pizza, stop by.", "author": "Jose S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-12-09", "description": "I've only ever had pizza at Haystack so I can't speak upon the entrees.  I've had the Haystack, Zorba the Greek, Luigi the Italian, the New Yorker and the Alexander.  All are top notch, and super flavorful.  The all veggie pizzas look so delicious but I always end up choosing the reliable Alexander.\n\nI prefer to have this pizza at the restaurant so that its hot out of the oven.  Sometimes, when delivered the crust can get a bit soggy, maybe from sitting while deliveries are being made.  However, the crust is so good, crisp and chewy.  Not too thick.  It's even better the next day, cold.\n\nThe antipasto salad is one of the best i've had at a pizza place.  It is completely loaded with meats, cheese and an array of veggies.  They have a creamy italian dressing that is very good too.\n\nI've referred plenty of people to Haystack and none has been disappointed yet.  Give it a try!", "author": "Lesliegh H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-02-17", "description": "GREAT service at lunch!!\n\nI first went to Haystack at 3 years old,  no joke, we grew up in Noe Valley and Haystack was a hit back then...\nStill is.   If you appreciate old school gems, down home service, good quality meats, veggies, salads, generous portions if that's your thing, head over. \n\nI typically don't do pizza for lunch or all that frequently so when I do, it best be a good one.  Went here with my younger brother for lunch and it hit the spot.  He enjoyed some meatball sandwich and I had a yummy salad and a personal pizza.  \nNoteworthy: they have whole wheat crust as an option. Is 'OhHellYa' a word?  Word.\n\nWorth a solid 5 because not every place needs to be gourmet and frou-frou to deserve a 5.  No complaints, ever.  Some of these reviews are way off.  \n\nvery reasonable - $20 for 2.", "author": "Athena S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-08-12", "description": "When I placed my order, I was told that they would deliver within 45 to 60 minutes.  75 minutes later I called to see where they were, they apologize and said the driver would be there within 5 minutes, and would throw in a couple free desserts.  15 minutes later, I called again, and was again told 5 minutes, and free dessert.  10 minutes after that, they showed up with a cold pizza and no dessert.  The pizza wasn't bad, but the service was horrible.  Never going to get delivery from this again! PS, it was $80 for three pizzas!", "author": "Alex G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-06-11", "description": "5:23 Ordered 2 salads, a soda and a dessert through Grub Hub. \n6:52 Called to see where food was at. Immediately put on hold after I asked where it           was. Held for 6 minutes and finally hung up.\n7:00 Called back, immediately put on hold. Girl came back on, identified myself as previous caller. Received a very short \"we are trying to call the driver if you would just hold on\". Ooookaaayy...  Finally comes back on and says driver should be there in 5 minutes and tries to hang up. I asked her when the order went out originally. Received a very short \"it didn't, I thought it had but it didn't so we just made you new ones\"He's just leaving now. What? Made it while you had me waiting on hold? Not even giving me the option of just canceling the order? Without an apology or sorry for the inconvenience? At this point, I said \"Thanks for saying sorry!\" She responded with \"your welcome\". I asked for her name and she hung up on me.\n7:20ish driver shows up, immediately begins to say it isn't his fault. I said don't worry about it, you've  already received your tip. (I had included tip with payment online.) He starts asking if I want him to just take the food back and swings it out of arms reach. I said no, it's already been paid for. He repeats and I finally get it through his head that I have been charged on my card already and I want the 2 salads that have taken 2 hours to get.  He leaves but I find later where he  tossed his crumpled receipt on my front steps. Very professional!\nI have been a very loyal customer since I moved to Noe Valley in the late 90's. Unfortunately, all it takes is one bad experience and lack of accountability to lose a good customer forever. \n\n2 stars for past experience. They threw a couple extra sodas and an extra dessert in I guess as an apology.  (Allergic to chocolate by the way!) An actual acknowledgement or apology would have gone so much farther to saving the situation. And maybe some additional customer service training.\n The fact that I see so many bad reviews here and nothing seems to be done about fixing the issues leads me to believe the owners just don't care anymore. So sad. I really liked this place.", "author": "L A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-12-31", "description": "Not every restaurant is going to be a perfect 5 stars from every single customer or not every restaurant is going to be a 1 star failure from every customer. Everyone has their good experiences and bad experiences in places that everyday at everyplace by everybody is not going to be the same. Otherwise the world won't be ahead as well as us. \n\nI went there with my family because I have not been there for years. It was very busy due to the New Years Eve and I only see one waiter that did a excellent job on his own handling multiple customers and tables. The food was good that I forgot how good the pizza was and my customer service experience there was unforgettable. I will go there again.", "author": "C G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-03-09", "description": "I went here for a friends birthday party, I liked the neighborhood it was in and the wait staff seemed really nice.  The pizza was really good.  I was shocked. I never expected such good pizza at this place.  My reason for being there was for a party, but if you can find time to go and enjoy the pizza without the distraction of a pizza on the head (long story), you will be pleased with the pizza at this place.", "author": "Gregory E."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-05-21", "description": "I needed pizza on the fly. This was the most convenient place. Had passed by this place a million times and finally this was the opportune moment. The front room was not filled, however  they seated us in the very back room. \n\n      We ordered the calamari as an appetizer and it was very good. Light and crispy topped with a sprinkle of parsley. Unfortunately, no spiders, just rings. Delicious though. It was not oily. We had a medium double mushroom wheat pizza. It was an easy order. Nothing complicated or high maintenance about our order. It was a slightly softer dough and a little thicker than I expected, but  not bad. In  cases like that,  I usually save my crust  for later snacking so that I can have an extra slice more. \n\n     Over all the food was satisfying, but the service was HORRIBLE !!!!!!! We had our order taken, and our food was served in a timely manner, but our waitress did not check up on us during our meal if we needed anything extra. I had to go up to the front room myself to ask for oregano which I usually sprinkle on before consuming my pizza. \n\n     Our  pizza plates were cleared after we were obviously finished which happened quicker than we were offered a refill of water, which never happen at all,  yet we still hadn't finished our calamari. My fork was still hand , and while in the process of polishing off the rest of the calamari,  our waitress came, assumed that  we were done and without asking quickly took away the plate I was working on. \n\n     Now, I was obviously speechless that  this just happened.  I mean it was only about five pieces that I was slowly working on but we just let that go. Why? Because not only were we  so stunned that it all happened so quickly, but today would have not been the time to mess with a woman who had just had worked through a tough week at work.  Deadlines and all . And  to top it off it was that time of the month and not worth starting my weekend by slaying the dragon over this minor hiccup!  \n\n     It was not as if they were so busy that they had no time to ask if we were finished even if there were just a couple pieces of calamari left. She just up and cleared the plates  so fast that it completely overshadowed the fact that we had not even been checked up on during our meal for even a refill of water or for any other request that we may have had. What's up with that? (Don't sweat the small stuff, right?\" ) AS A PAYING CUSTOMER, I HATE BEING RUSHED BEFORE, DURING, OR AFTER MY MEAL !!!!!!!!!!! Oh yeah, but she did ask if we wanted to look at the dessert menu. The audacity !!!!! \n\n    Needless to say, we won't be coming back to this place because I can get better service elsewhere, where I can relax, have a fantastic dinner AND dessert,  and know that I'll be taken care of after a hard week's work because I deserve it !!!!!!!!!!!!!!! Plus I'll make sure to look at the wine list first ;  )  \n\n     Experience can sometimes be bad, but more often than not it's usually good for me. This was just one of those fluke ones. Life goes on and tomorrow, as those weird Christians are trying to proclaim that the world will end anyways, I will never have to worry about bad service again because I signed up for Nirvana!", "author": "Granolia G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-07", "description": "Holy Pizza, 'Zorba The Greek!' \n\nIt's rare that pizza delights me the way the #4 at Haystack does. It has everything I enjoy on a pie, and it tastes even better on the second day! This place isn't 'bells and whistles' but that's what I enjoy about it! When I walk in, I know I can grab a table, order a pie, and enjoy some down time with friends. They have a diverse menu, but I stick to the same every time: #3 or #4. I'm sort-of excited to venture out and try the others... but sometimes, you just want what you know works! So if you're looking for something robust and delish, try the 'Zorba.'", "author": "Andrew C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-06-29", "description": "No idea what's wrong with some of the reviewers here. This is good old fashioned pizza parlor pizza that's as rare in San Francisco as a concealed carry permit.\n\nTheir dough isn't artisanal whole wheat flour grown from the tears of rescued pandas on a rooftop garden. Their toppings and sauce are high quality but traditional; if you want truffle oil and purple potato pizzas, this place isn't for you.\n\nIf you want cold-damp-night comfort food pizza, this is nearly as good as it gets in NorCal.\n\nNote: the service can be slow, but I'd only be deducting a star or two if there were 10 available for this pizza. Since there aren't, 5 will do.", "author": "Geoff F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-05-30", "description": "I emerged from my office Friday night at 6:00, the earliest I had left the office since....well, probably February.  I wish I was joking when I said that.  When I left the office, I had a standing appointment to return the next morning at 9:30, bright and early, to spend another weekend feeding the monster.  By Friday at midnight, after an 18-month wrestling match, the monster appeared defeated or placated.  Take your pick.  Result's the same, either way.\n\nSaturday came and it was almost too breathtaking beautiful to actually enjoy or believe.  Perfection whispers illusion in this day and age, and I spent the whole day walking on eggshells, expecting a call that would drag me back to the office, never to return.\n\nBy Sunday, my frayed nerves relaxed just enough to allow me to climb the vast hill to the summit of Noe Valley, and then to collapse in a booth at Haystack Pizza and proceed to eat and drink.  I cannot comment on their sandwiches or pasta, for Wifey and I split a small pepperoni, sausage, olive, and onion pizza, and it was fantastic.  The service was friendly and attentive, the setting was quaint without being too over-the-top, and the price was nothing to complain about.\n\nBut what now for our hero?  [Or, at least, for me?]  Will he be summoned back to the cave of eternal struggle, therein to waste the remainder of his summer in the battle of the stupid versus the evil?  Will he once again disappear from Yelp, with nary a fan or friend to notice or miss him?  Will he discover The Penguin's evil plot in time?  [Sorry, pretty much had to throw that one in.]  Only time will tell, only time will tell.", "author": "Ben P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-02", "description": "I am a Noe Valley native--edderhave not ordered a pizzas from there in over 20 yrs Yesterday I ordered a lg pizza with pepporoni. The last piece was as good as the first My Dad ask me to order one for him tonight. Thats rare. Great pizza,", "author": "Donovan M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-15", "description": "I really enjoyed Haystack and I think this has now officially becoming my pizza hangout in Noe Valley. \n\nCleopatra w/ Pesto was good (you could have gotten this with Tomato Sauce if you wanted) and was decently sized, the small easily takes care of 2 people. The Medium will handle 3 for sure. I'm not sure on the other sizes as I tried to peek around at other tables but no one had anything bigger than a Medium.\n\nI loved the casual laid back atmosphere and it's a lot bigger than I expected as it's a deep restaurant. There's seating past the bar area", "author": "Eric A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-12-12", "description": "guys... i don't really post here in yelp. but this time i have to.. i just ordered food from them for delivery. and while eating the steamed vegetables i found worm in my food. i posted 3 pictures of it.", "author": "Hazel C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-08-25", "description": "3 stars because they're open late.\n\n2 if they weren't.\n\nFood was okay. I had the baked pasta and caesar salad. I definitely wasn't wow-ed.\n\nI know it was a warm day for sf, but I was sweating more than a hooker in church. Not comfortable, let me tell you.\n\nBut, they do have diet sprite!!! I don't hate it!", "author": "Marisa R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-04-02", "description": "Mmmmmm! Haystack is pretty good pizza. They use lots of garlic and the large size is actually a hefty portion. I had a pineapple pizza with my boy during my visit. We both enjoyed our slices thoroughly and proceeded across the street after wards for more beers at the Dubliner. \n\nHowever, if you were doing carry out at Haystack they have a bar inside too. This location seemed to be family/kid-friendly and low key. I think think their prices are a tad high, but that seems to be the case at all pizza joints in the bay area. At least the ones I have come across.", "author": "Nichole P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-26", "description": "YAY, Surfen Turf, and in the 'hood.   .   .\n\nFLAG 4 Redux!/  LATE NIGHT!!  da Kine da Vinci\n\nThx, Marisa!", "author": "Clifford L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-26", "description": "My Favorite restaurant in San Francisco. \nI've been a regular for 13 years\n\nAtmosphere:\nIt's simple. It's Homey. It's casual. The low-profile atmosphere doesn't offer a clue as to he high-impact taste and service you'll receive here. \n\nService:\nNever had I had to wait for seating. Their staff are all friendly, courteous and prompt. Their service is very good. They deliver your orders within reasonable times. Drinks 3-5 min, Appetizers and Salads 5-7 min.'s, And entree's within 10-17(most). \nThey check back on you to make sure you are ok. And they are mindful of where you are in your dining experience: refills, extra items, plate removal, desert offers and check delivery.\n\nTo-go food is accompanied by items your may need, and is promptly made and well packaged. \n\nDelivery service is prompt, easy and friendly.\n\nFood/Beverages.\nNice Wine selection. \nSize-able non-alcoholic beverage selection. \nThere really is something on the menu for everyone of all diets (yes vegetarians have AMPLE choices) and all ages.\nI've brought dates, anniversary parties, birthday parties, young nieces, nephews, young and older adults. And all have been very satisfied. \nNow, I've never had a pizza here. My family has, I've sampled it, it was good. But what really makes this place STAND OUT are their OTHER menu items: Chicken Cordon Bleu (my favorite), eggplant parmesan, veal parmesan (both also VERY good), pestos, alfredos, marinaras, a wide array of pastas, lentils, vegetables, and other sides and much more. \n\nMoney: average dinner plate for 2 ~ $30 drinks and meal included.", "author": "Miguel R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-12-17", "description": "This place is mediocre at best. I had heard good things about the place.. The pizza i got was under cooked. The ingredients were bad quality and there was way too much garlic. Why do they put garlic on all their pizzas? They claim to be \"traditional Italian fare\", an italiano would not be best pleased!\nbut other than that it was great, haha", "author": "Kieran F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-05-03", "description": "I love this place and although their pizza is not the BEST in sf, it has the flavor you learn to love and miss.  \n\nHowever - I must say, that I had my husband pick up a SMALL cesar, order of mozzarella sticks and two diet cokes last night, and it was $25!!!  I emailed him today thinking there must be a mistake, and he told me the diet cokes were $2.75 each - that is crazy.  We ordered Paxti's the weekend before and our whole medium pizza was $23.50.", "author": "B H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-16", "description": "I LOVE Haystack. Super delicious pizza. I love it. Friendly service. I'm confused why there's even negative reviews. I've been here several times and the food has never let me down. I like the guy who's always there, he's very accomodating.", "author": "Gina D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-05-09", "description": "We placed today a large order of 3 XLarge pizzas for our school Teachers Appreciattion day lunch, almost a $100 order, and the pizzas arrived not only soggy and cold but all smashed up, a total wreck. We called right away to report the desaster and the manager offered to send a second order but it would take another hour for us to get it. Short of time, we declined and asked for a discount on the whole order but were turnt down... The lunch was ruined because of their reckless delivery driver. I guess our school will not order from them again.", "author": "coco r."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-15", "description": "I actually left really happy and surprised at how good the pizza here was! I was STUFFED coming into this place, thinking MAYBE I'd eat a slice, or nibble on one slice of pizza. I was so so full. Once the pizza came though, omg, 2 slices magically disappeared.\n\nTwo of us ordered The Cleopatra - grilled eggplant, sun dried tomatoes, garlic, pesto, feta cheese. WOW. Delicious. We ordered the small, which came with 8 slices! The hugest small pizza I've ever seen.\n\nThat's all I tried, but it was enough to get me wanting to come back again. Service was cool too.", "author": "Carol L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-01-25", "description": "Well, I have been waiting on this review. I do kinda rely on Yelp for trying new places... That said... It was New Years Eve. My dinning partner and myself were looking for a good pizza. NOT just a slice, but a whole pie. We decided on hitting up Noe Valley. It had been awhile since I strolled up and down 24th Street, so we popped into Haystack.\n\nI know, I know... Maybe New Years Eve isn't the best time to give my two cents, but the place wasn't that busy. (hmmm, maybe a bad sign) We stood at the door for a few minutes, then went up to the bar and explained that we wanted to eat. We were seated fairly quickly then... Again, they weren't busy. (The SFPD were being treated pretty good though)\nAbout 15 minutes later, we flagged down a server. She said she was sorry. \"No big woop\" we say, as we are pretty hungry at this point (feed me, it's already 7:00 p.m.) The pizza arrived fairly quickly though. At this point, I figured I could eat anything.... \nNo bueno! Flavorless and wet is how I would describe it. \n\nIt's a shame, as this place couldn't be in busier neighborhood.\nI am pretty sure it's been there for quite sometime. \nThey may want to come up with some new recipes?  ;0/", "author": "John R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-09-02", "description": "Never tried eating in their restaurant but my uncles would always have their pepperoni pizza delivered at least once a week and I don't understand what exactly they find appealing in Haystack pizza.  The crust is too thick, the topping is way too salty as in waaaaaaay too salty and it's just too greasy for me.  Really, I need to be enlightened because I really don't like it no matter how hungry I am....the first bite makes me wanna gag.", "author": "Janis P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-12-15", "description": "Haystack pizza is fine if you're in the neighborhood.  I wouldn't call myself a pizza snob, but for me, Haystack pizza is just a quick option for pick-up or delivery.  \n\nHonestly though, I can't give it more than average rating because it tastes like any other pizza and it's kind of expensive.\n\nSalads far outshine the pizza as far as I'm concerned :(", "author": "Angella S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-08-13", "description": "Super cute restaurant. The staff was very friendly and immediately made us feel welcome. We arrived really hungry and ordered the pepperoni rolls and a hawaiian pizza. I really liked the pizza but I'm from Chicago so I like a thicker crust pizza. This had a thicker, softer crust which I really like. The pepperoni rolls were heavy and could have been a meal in itself. We left with a half of a pizza for leftovers.\nI'll go back.", "author": "Eliz M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-03-25", "description": "2 stars because the server was pretty nice, even though he was an awful server.\n\nNo stars for the food, which was just awful.  And it came out so fast, even though we had told the server we wanted to take our time.  It was like wham bam eat and scram.\n\nNo more for me.", "author": "Theresa H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-03-21", "description": "Kitchen staff obviously do not wash their hands, as my fiance' and I both had separate dishes, and both got violently ill shortly after eating here. Totally grossed out? You should be. Keep walking.", "author": "Vincent C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-21", "description": "Another decent pizza joint, although for the price I would go for Patxi's or Little Star, the Calzone was okay but I had the New York Style Pizza and they did a pretty good job! Another one between 3/4 staff was really friendly!", "author": "Tiff W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-11-18", "description": "I don't know there is just something inviting about this place. It has some old school New York pizza shop charm to it. I want to go in one night and sit at the little bar and order myself a pint of beer while I wait for my take out pizza. It has a cozy feel to it. \n\nWe had a small onion, meatball and extra cheese. I was told it would be about 20 minutes and bang on it was! I was afraid about getting the extra cheese because I didn't want it to be disgusting but my partner insisted. Well it did have extra but the perfect amount. I also thought it was cooked to perfection! The crust was the right crispiness and the sauce just the right amount of sweetness. I do hope they make the sauce themselves and it is not out of a bit #10 can, but if it is I loved it just the same. \n\nI read someone else review about delivery. I am embarrassed to admit I live up the street and sometime ago it was pouring rain and we had it delivered. I should have just gotten wet and gone out and done the dirty deed on my own. What I ordered ended up taking forever and I do remember something was missing. We just said screw it, that is the price we get for being lazy! \n\nGood pizza, good staff, cozy atmosphere!", "author": "Scott P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-10-26", "description": "DO NOT, I repeat, do NOT order food delivery from this place. \n\nThey have great sandwiches that lure me back after an imposed hiatus, and they fuck it up every. single. time. They cannot manage to bring us the right thing.\n\nThe last two times we have gotten delivery we have gotten someone else's dinner. When we called to tell them they said, \"want to just eat that?\" Um no, or I would not have called you.\n\nIt happened again tonight. Driver just picked up the food we did not order and left us foodless. He said he'd be back in 5. It has been 10.\n\nIt has now been an hour and fifteen minutes since we ordered. Presumably someone else is waiting on food we had our hands on.\n\nTerrible.", "author": "Brittney G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-10-23", "description": "The pizza is really delicious, the ambiance is cute and romantic, however; the customer service isn't so great. Out of the three different servers I had that night only one of them actually talked and made eye contact. It made the experience very awkward. We also had to get up and hunt down a waiter at one point to get a refill on our drinks.", "author": "Lissette V."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-11-23", "description": "First time here for dinner with friend and girlfriend. Inside feel warm, staff was friendly. They have a good portion size salad Cesar dressing $10. Man entrée we order was their spaghetti with mean ball, good size dish, sauce was good and meatball good size delicious. Food was good and made with love. They busy during dinner time, small restaurant but food and price was worth it. If you love Italian food recommend it and would come back here", "author": "Gruber T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-10-15", "description": "She had me at Heart. The bartender, a young woman, was bopping around to Heart, playing on the stereo. I was waiting for a friend. Forever, it seemed. I commented on how much I appreciated hearing Heart. She had just discovered them and was now going to go out and buy more! How cute. I gave her my recommendations, of course.\n\nThe food was good. The beer is cold. They did a lot of to go orders as I waited, so I knew people liked the place. I would certainly eat here again and again.", "author": "Penguin S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-09-16", "description": "We have ordered pizza from Haystack for the past year, probably 5-10 times.  The first few times the pizza was great: hot, delicious, made well, affordable.  The last 3 times, however, well.....let's just say we will NEVER order from them again.  \n\nLong story short three pizza's ago, the pizza arrived made to order, however it was room temperature (okay, car temperature.)  Okay, this happens.  I can forgive it.  We just popped it in the oven, reheated it, and it was fine.  Two pizza's ago, we ordered it late on a Tuesday night (that happened to be my birthday), I placed the order at about 7:30, was told it would take an 45-60 minutes.  I lost track of time, my boyfriend yells down to me, \"Did the pizza get here yet?\"  and I realize it's now 8:45, and no pizza.  Hmmm.... I waited another 15 minutes and just as I was dialing Haystack to find out where the hell our pizza is, the driver knocks on the door (at 9:00 p.m.).  He handed me the pizza, and I told him to wait, I placed my hand on the bottom of the box, and lo and behold, it was cold (not even room temperature.)  I asked the driver who could I call to complain to, and the driver offered over and over that he could take it back and have a new one made.  Right, because everyone likes to eat pizza at 10 pm on a Tuesday night.  That's a certain recipe for indigestion.  No thanks.  I called and spoke to the manager (possibly owner?) who apologized profusely, and put a note in our address that our next pizza was free.  Wow, thank you!\n\nThat brings us to last night, where we ordered our final pizza EVER from Haystack.  I called, placed the order, and the guy who answered the phone asked me why we had the free pizza, and I told him, \"Because the last two we ordered were cold and/or late.\"  So, was it unreasonable for me to expect that my pizza would come piping hot this time?  That maybe, people would pay special attention to our order in an attempt to correct the past two wrongs?  Apparently, it was.  The pizza arrived in a fairly timely manner (60 minutes), and SHOCKER!  It    was      cold.       Again.  So, we're done.  I'd rather eat greasy Pizza Hut or flavorless Dominoes, or even overpriced Round Table!  At least they come hot!  Save yourself the trouble.  If you really want Haystack Pizza, go into the restaurant and eat it there.  That's probably the only way it'll get to you hot.", "author": "Priscilla D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-12-01", "description": "Antipasto salad wasA-MAZING! Small portion will feed 2 even 3 people! It was super w/ mozzarella, pepperonchinis, and everything else! YUM!\n\nThen i had the chicken parmigiana and the portion was huge! Yes, i tried to eat it all and got sick when i got home from over-eating.\n\nThere is nothing gourmet here. It is a lot of full fat, full size bad for you but good for your soul kinda food. I say, treat yourself to an antipasto salad for sure , then share a meal or pizza.\n\nCute little place in Noe Valley. Open 'til 11 pm or midnight (weekends).", "author": "C A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-08-14", "description": "All my classic Italian favorites located in one place! \n\nDont:\nJudge them based on their dark, ugly, outdated decor.\n\nDo: \nJudge them based on the taste/quality their food, which are all very reasonably priced! \n\nDon't:\nDrink the water here. It tastes like toilet water. \n\nDo:\nSplurge the extra $2 for a flat soda.\n\nDont:\nOrder the calamari. Even though its breaded, the tentacles are so big and it has that slimy aftertaste like day-old sushi. \n\nDo: \nDine-in because their delivery service is slow.\n\nDon't: \nWaste all your money feeding the parking meter on the street. \n\nDo:\nTry one of their pizza's. Great ratio of meat, sauce, crust. A lot better than other pizza joints I've been to.\n\nDon't: \nForget to order caesar salad. It's fresh and cold, plus the croutons appear crunchy and freshly toasted to order.\n\nDo:\nSkip the house salad. It looks old and gross.\n\nIn short, you'll be glad you tried their pizza. They also have surf & turf items like new york steak, seared scallops, grilled prawns, etc. Oh and the tiramisu...", "author": "Joraine C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-03-13", "description": "The pizzas good but I lve round table better surprisingly I though it would be a restaurant based around their pizza, but the menu was huge maybe not such a good thing for most restaurants I didn't like it to much. I traveled to get here from across the bay it wasent worth my drive.\n\nNot a fan of the prices there a little high, and if im going to pay for a pricy dinner I want a good meal and excellent service, the waiters seemed a little snobbish and did little work and expected a big tip. It might just be me but im not for that or people being fake to work for a tip, I want a genuine person who is interested in my order and food quality.\n\nIf they fixed a few things I think it would be better.", "author": "Ash S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-12-15", "description": "This place used to be great. My boyfriend and I would order the New Yorker with pepperoni at least once a week. But not anymore.\n\nLast week I was gone and he ordered delivery. It came after an hour (which isn't too unexpected), but it was cold and smashed all to one side, hardly recognizable as pizza. He called and complained and the manager said he noted the account and next time we ordered, they'd provide some reconciliation.\n\nWell, last night we decided to try again. The peace offering for the f-ed up pizza was $5 off, which I guess puts something of a dent considering how costly Haystack can be. Only tonight when the pizza arrived, again it was cold. Not \"cold\", but definitely not hot and barely lukewarm. The cheese had reformed and wasn't really melted anymore. It was another major letdown.\n\nHaystack is so expensive it should be really good to be worth it, but I'm done paying $30 to have cold pizza delivered to me.\n\nI won't order delivery from Haystack ever again. Maybe I'll eat there if I find myself in Noe Valley some time.", "author": "Garrett O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-18", "description": "Delicious pizza, friendly people, cheap pitchers of good beer. A little tired inside, but it has great character!", "author": "James C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-03-22", "description": "greasy, floppy, tasty.  I ordered the wrong pie once, totally my fault.  They just made the right one for me and didnt charge me for the one i didnt want/couldnt eat.  so nice.", "author": "David S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-04-28", "description": "I'm a pizza snob.  I don't like pineapple on a pizza, I don't think chicken is good either. If I want to eat chicken, I'll go to a place that serves chicken. Pineapple is great for dessert, not on my pizza...\n\nI walked a few blocks to go to this place and I have to say, I'm glad I did.  One of my BIG tests is if the stuff on top STAYS on top of the slice when I pick it up. This place passes, easily.\n\nI ordered to go and they have a small bar to sit at while you wait.  I noticed several families there, but I felt sorry for the couples that had to sit near the loud kids.  Due to its small size, I'd say this is not a place for kids...\n\nI'm going back and I think that's the ultimate compliment.", "author": "Mac S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-12-25", "description": "I live near Haystack and have heard from many locals about the great pizza here and how it's been a staple to Noe Valley for years. I can't seem to understand why this place is still in business. The staff is off and seems very \"special.\" They can't seem to get simple orders correct and are very off putting. The pizza is sub par, greasy and stale. I'd go to Whole Foods and get all the ingredients to make my own before ever making the mistake of eating here.", "author": "Fiona N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-02-04", "description": "Growing up in Noe Valley there were places that loomed large in my imagination. Places I couldn't wait set foot in again. Bud's Ice Cream, Color Crane, Castro Pharmacy, Bell Market & Haystack Pizza. Of these, only Haystack Pizza survives today. And they still have a great pizza. I always get pepperoni & mushroom. Best pie in Noe Valley.", "author": "Cesar C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-12-06", "description": "The husband and I decided to spend a lovely Saturday evening strolling around Noe Valley, Christmas shopping and enjoying ourselves - before we got started we chose a spot to fill our bellies. \n\nHaystack looked nice. We were in the mood for italian - so after a check of the menu we went inside.  We were the only table in the place - which was fine, but maybe we should have taken that as a sign. We ordered a pizza that sounded similar to my husband's favorite - no sauce, basil, fresh cheese, diced tomato. sounds yummy right?\n\nIt got to our table and looked delicious - but the minute we started eating we looked at each other and realized we'd made a big mistake - The crust was so so soggy  - and super garlicky (it didn't mention garlic in the description).  It was impossible to eat with your hands - fork and knife were mandatory and it was just overall... gross. It was like eating pizza mush.\n\nWe each tried to eat enough to feel like we'd gotten our moneys worth - but it was just bad. So bad in fact, that it put my hubs in quite the mood and he spent the rest of what was supposed to be a lovely trip pointing out all of the other restaurants we should have eaten at instead.\n\nThey also overcharged him on the beer he ordered - but whatever, we weren't going to dispute it - we just wanted to get the hell out of there. You win some, you lose some.\n\nand haystack was a big fat LOSE for us.", "author": "Melissa J."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-03-31", "description": "One of the worst pizzas of my life.  We got a medium \"Old McDonald\" last night - Marinated chicken, fresh garlic, onions, mushrooms & fresh tomato.  We also added fresh basil for $1.90 and got thin crust.  Pizza base was so soggy we couldn't even pick up a piece and the \"fresh basil\" was wilted and gross.\n\nWe got a regular salad as well, nothing bad about it and we ate it all as the pizza was terrible.\n\n$29 for the pizza, salad and tax - WHAT A WASTE OF MONEY\n\nPositives - could order on line and that was quick.  Delivery took 45 Min's which was good (though we live in the neighborhood).", "author": "ORLA L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-12-28", "description": "Best pizza in San Francisco without  a doubt. I've been going here since I was a little kid and the pizza has never changed. Its nice to know Haystack is still around even with all the changes in the neighborhood these days. If you don't feel like ordering a whole pizza or spending too much money, then just check out the personal pizzas on the menu!", "author": "Matthew F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-06-14", "description": "This is definitely a place for cheesy plain-jane pepperoni-mushroom pizza when you're tired of the foodie yuppie stuff. Waitstaff is friendly. We ordered a pizza to go around 11:30am and had it in 15 minutes.\n\nThe guy in the corner starting on a pitcher of beer seemed kind of out of place for what is turning out to be a Noe Valley stroller-packed Sunday afternoon on 24th Street ...", "author": "Rob T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-30", "description": "The Haystack Pizza is located in the main street of Noe Valley and is a very interesting Italian restaurant.\n\nThe place is divided in two different areas. The first room (the one you see once you get in) is open and offer a bar counter. The second room (which can be accessed by going through the first one) is more cozy and less open. It is actually perfect if you would like more intimacy as well as great and comfy seating (they basically have wall seat).\n\nPrices are good and the staff was nice (out waitress was a bit overwhelmed though). A good surprise was to have a chance to talk talk with the owner of the place who was checking upon is if everything was fine.\n\nWe've ordered a pizza by choosing our own toping. The crust was definitely a favorite for me (see my reco below) and the overall result was tasty. (Their Small [12''] = 8 slices, Medium [14''] = 10 slices, Large [16']) = 12 slices. They even have a \"Wagon Wheel\"! [18''])\n\nWe were looking for something new in Noe Valley and the Haystack Pizza restaurant is a very affordable option that offers a great atmosphere and good pizza.\n\n==============================\n\nPros:\n- Atmosphere.\n- Price\n- Various range of items on their menu (pizza, pasta, salad...)\n\nCons:\n- None.\n\nCedric's secret advice:\n - best time of the day to go there and avoid the crowd? 7pm on a Friday night was still a good time to get seating. However plan to come early if you come numerous.\n - best spot to take a picture? Look close to the bar on your way out and stop by the wooden man with the cowboy hat at that a shot ;)\n - best pizza size? The small (12 inches) is definitely a lot for me. It is perfect to share!\n\nCedric's favorite options:\n - Wheat dough pizza with their think crust is really great.\n - Go adventurous and make your own pizza!", "author": "Cedric L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-01-07", "description": "Service: 3.5/5\nFood: 3/5\nWait: 2.5/5\nPrice: $$\nPresentation of food: 3/5\nPresentation of restaurant: 3.5/5\nOverall: 3/5\n\ni dont really like their pizza here nor their pasta, but their cheesy garlic  bread is pretty good. the only reason i come here is because the boyfriend use to love this place.", "author": "Eva H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-05", "description": "Since I moved to Noe Valley, Haystack has always been my go-to takeout establishment for pizza -- and when I have eaten at the restaurant, the service has always been pleasant.  The pizza itself is tasty (and fillling) -- good cheese, flavorful sauce, and best of all, not too greasy. As an added bonus -- though it pains me to own up publicly to my laziness -- they deliver quickly. Well done!", "author": "Katie M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-06-20", "description": "I've eaten here more times than a prostie performs fellatio.  \n\nWhen I first started going, I would order an array of vegetarian pizzas that were all quite good.\n\nBut then, one day, whilst feeling frisky, I ordered the New Yorker.  Hot damn!  Best pizza I've had stateside.  \n\nTo accompany the pizza, I would recommend the barrel of beer.  Yesh, barrel, bitches!\n\nThe place itself is classy, especially after one of these barrels.  By this, of course, I mean endearingly tacky. \n\n(And, uh, the review below this might be a little harsh (and incoherent?))", "author": "Christine M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2005-06-21", "description": "I tried them in a desparate search for anything NOT pizza or chinese that I could have delivered to my lazy ass. So far its the absolute best ravioli, fresh baked bread, fried scallops and perfectly cooked vegtables I have ever tried anywhere. The food is always piping hot and the sodas feel like they could have just come out of a freezer... plus they have Coke, not Pepsi-(my #1 rule) and best of all- you can order online. A++++ [I didn't see thier website posted here but I didn't really look too hard either.. just in case, its http://www.haystackpizza.com\n\n**update** --these people won't deliver to me now that I don't live in Dolores heights. So their 5 stars goes down to 2.  Seriously, If you're not going to prevent me from having to get dressed and go outside, then you suck as a restaurant.\n\n**re-update**  i cant believe i gave  them two stars... and im not just saying that cause i live in an area they deliver to again.  that part is just coincidence, it really is awesome food. the garlic mashed potatoes are probably the best ive ever had.", "author": "Rachel A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-01-01", "description": "Disappointingly average pizza and sub-optimal service. The salad was topped with un-ripe tomatoes and filled with inedible bits of lettuce. The garlic bread was good and garlic-y, but it arrived 45 seconds before the pizza. \n\nThe pizza itself was OK, and that's a pretty damning statement given how much I love pizza. The sauce tasted canned, there was too much cheese, and three hours later I'm still getting \"bonus love\" from the sausage.\n\nRegardless of how \"intimate\" a restaurant is, I can't stand wait staff who stick their butt in your face for five minutes while they take the order from the table next door. Seriously, can't you see I'm having a hard enough time eating as it is?\n\nCouple all of that with the fact that our waitress had to be prompted to refill our waters and reminded to take our payment and, to quote the Who, we won't be fooled again.", "author": "Greg Q."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-01-02", "description": "You usually can't go wrong the pizzas here. I typically order pretty straight-forward stuff: 1-2 toppings like cheese or pepperoni, and it gets the job done. We ordered one of the specials one time and that was pretty good too. The other items like pasta or salad are so-so. I had the spaghetti with meatballs once and it wasn't terrible but made me wish I got a pizza instead. So...go here for the pizza!", "author": "Jordan P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-01-14", "description": "Haystack is where I go in the hood when I want to load up on carbs and get a nice creamy pint of ranch dressing to dip my head in. When I go here, I feel like I'm transported back in time and place to my smallish midwestern hometown circa 1985. And sometimes that's just what I'm in the mood for. The decor is pretty wacky -- the front half is kind of western themed, with a big Native American vibe, and the back half feels kind of like a greek themed restaurant to me. The music is pretty bad, but can make for some good sing alongs and air guitar moments. The menu has various fried appetizer offerings, salads, pastas, pizzas, etc. \n\nTo me, Haystack is not great, but sometimes I don't want great. I just want to go somewhere comfortable and unpretentious where me and my old man can get all bloated on dough and cheese and pitchers of beer. Mmm, sexy beasts!", "author": "Pam D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-15", "description": "I've been to Haystack many times over the years, and ordered takeout many more.    It's a great traditional pizza parlor, no more, no less.  Haystack makes excellent sausage and vegetarian pizzas, but I usually end up ordering the New Yorker, my all-time favorite.   Their house salad is an extremely generous mediterranean salad.  The decor is faux saloon, but that's part of the charm.  And if you're coming with a group they have plenty of tables big enough for 6 to 8.", "author": "Anne C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-06-19", "description": "Have you ever had somebody walk into your office at like 4pm, when you've already shifted into neutral to coast through the rest of the day? And they hand you some new task AND want to be chatty? Doesn't that suck? Well, that's what EIGHT of us did to the staff at Haystack last night. Our booze-fueled book club adjourned from the noisy bar where we'd discussed the book and came here for much-needed food. Not surprisingly, we were in the very back of the narrow, two-room restaurant at the only table that could accommodate us.\n\nDespite the location, the service was excellent and friendly. They didn't even harass us for talking loudly about words that sound dirty but aren't (circumscribe, dictation, comeuppance, masticate, etc.),  I still feel a bit sorry for the little old ladies two tables away though. I'm sure they considered us hooligans.\n\nThe two pizzas we got were quite good, with no shortage of toppings and enough cheese to hold them in place. Beer is available by the pint, the pitcher, and the KEG! Before you get as excited as I did, their \"keg\" is only 10 oz. larger than the pitcher. They also have a fairly nice wine list, and of course the normal array of soft drinks.\n\nIn the end, we were all happy and satisfied, and we even cajoled our waitress into sampling a bite of the bacon-chocolate bar one person brought for dessert!", "author": "Bill B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2006-07-08", "description": "The pizza is unremarkable but decently tasty, holding some middle ground of crustiness between New York style and Chicago style, without venturing into the gourmet realm of California style. The decor reminds me of Howdy Doody, in a way that would be mockable if you didn't feel affectionately towards the place. \r\n\r\n...which brings me to today. There's a dearth of places in San Francisco that deliver -- most delivery places are the kind of thick, doughy crust pizza that's really only good when bought by the slice at 2:30am. But I remembered Haystack as being ok, and placed an order from their website. \r\n\r\nTen minutes later, I got a phone call from a teenaged girl. \r\n\r\n\"Um, hi? This is Haystack? And you placed an order? For a pizza? We don't deliver there.\" \r\n\r\n\"Ok,\" I said hesitantly. \"It says on your website that you do. To zip code 94107.\" \r\n\r\n\"Yeah. We don't deliver there.\" \r\n\r\n\"Well,\" I replied, \"it's the first zip code listed on your website. Where it lists the zip codes you deliver to. What do you suggest I do, here?\" \r\n\r\n\"Um? My manager's standing right here? And she says we don't deliver there?\"\r\n\r\n\"Well, I can't really argue with that, now.\" I replied, annoyed and condescending. \"You might want to tell your webmaster to update the site with that info.\" \r\n\r\n\"I might want to tell my what??\"\r\n\r\nNevermind, and I hung up. One star for not delivering where you say you do, and for being incompetent and unbudging about it. Mediocre pizza not worth the hassle. Thanks to Yelp I discovered Mozzerella di Bufala instead.", "author": "Trisha W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-04-05", "description": "I always get delivery, they say 45 minutes, it usually arrives in 30.  You can order online or by phone.  I've got them programmed on my cell.\n\nI've recently discovered the joys of thin crust pizza.   Less likely to get stuffed without that thick crust and I can enjoy, the cheesy goodness.  However, sometimes i wished they used more mushrooms.  Also, they are pretty good about crediting you if there is a problem with your order.\n\nThe only thing that concerns me, is they hang on to your credit card info in their database.  So even when you pay cash and get your receipt from the driver, you entire credit card number is printed out in all it's glory.  Can someone fix this?  Or truncate the number so the whole thing is not displayed?", "author": "Jenn A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-06-27", "description": "Ordered a pizza (olives, mushrooms, onions with a whole wheat crust) from here the other evening.  \n\nThe good -- it tasted alright but...\n\nThe bad -- the pizza was cold and was stuck to the paper under it (you know the sheet of paper put between the pizza and the pizza box...  is that usually there?).\n\nSo, after you reheated the pizza, peeled it off the paper sheet, it was OK.  That is, if you don't mind your pizza being all messy (after having to pick it off the paper sheet).  I'd rather have had frozen pizza -- it's cheaper and tastes at least as good (especially since I had to heat it up anyway). \n\nWith so much good pizza in SF, we won't be ordering from here again.", "author": "S J."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-10-02", "description": "Man oh man. \nI used to love haystack. Went there this week with my boyfriend, and no doubt they took care of us, the waiters gave us the booth when there were only two of us at the beginning of the dinner rush. And they were polite as usual. Now for the disappointing part. :( \n The calamari wasn't thouroughly cooked, edible but kinda gross. However, they took it back- when it came out the second time it was properly cooked(bland but whatever)\n*the pizza tasted good. We ordered pepperoni and garlic. They went kinda crazy with the garlic, but it was good. I love garlic, so it wasn't a HUGE problem.\n*the beer was poured improperly. I saw the chick do a hillarious attempt at pouring us a pitcher-complete with a classy \"sccop the foam out with a spoon technique\" never seen that befor but I got a good chuckle. \n\n\nTHE NEXT DAY: we both had the most terrible diarrehea!!! Eeeewwww muddbutt!! We didn't know if it was something else we ate until we decided to test our luck an have leftovers last night. It was definetly the pizza. WE HAVE FULL BLOWN FOOD POISINING!!!! \nHe's throwing up as we speak we've  been losing it from both ends. \nNever again will I return. So sad. I used to love this place", "author": "anna b."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2007-06-16", "description": "Anyplace needs to deliver until 4 or they suck\n\n\n\nedit - 8/4/07\nSo what happens when you've had about 10 drinks in 8 hours on a Friday?  You want FOOD, NOW!  Which means the original review above MAY have been not only made while drunk, but also hungry.  Not a good way for Laura to be.  FWIW, I have had their pizza and it isn't very good at all, so I don't feel too guilty about the one star.\nAND - Can we PLEASE get a GOOD late night restaurant in the NOE/CASTRO area?  I'm talkin' 24 hours AT LEAST on the weekends.  Yes, I am SHOUTING for it!", "author": "laura g."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-03-24", "description": "My boyfriend and I went here on a lazy Friday night after walking the city and craving Pizza. Being close to my house in Noe Valley was the determining factor on why we chose this place over the many options in the city.\n\nWhen we first arrive, we had the unfortunate experience of being seated in a booth next to a large table of kids who looked like they were part of a little league. Boo. Loud and obnoxious kids are not fun at dinner time.  So after kindly asking our waitress for a new table, we were escorted to the cozy back room of the restaurant... a much better environment!\n\nWe ordered a picther of beer... which was a good value at $12, and some mozzarella sticks to start, for $6.75 (I think). While the sticks were the generic run of the mill frozen kind... I was surprised at how large the order was... 10 sticks total! Also a good value!\n\nWe ended up ordering the \"Old MacDonald\" pizza... with chicken, onions, garlic, and tomatoes. The pizza was actually really good with one exception... the tomatoes were large slices... and I would have preferred them to be diced into smaller pieces.\n\nAll in all... our bill was about $40, plus tip. While on the surface I thought this was pricey for pizza for two... we did get a pitcher of beer which yielded us 3 beers each, mozzarella sticks, and a medium pizza which was large enough that we ended up taking half of it home to enjoy the next evening after we got home from the bar. :-)\n\nNow that I have found this place... I will probably be back for more of their pizza...", "author": "Matt O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-10-07", "description": "Their New York style thin crust pizza and antipasta are good.  Take out / Delivery always tastes like shit.  Make sure you dine in.\nTacky decor, but fits the place well", "author": "Pug P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2006-10-15", "description": "I'm not sure whether it's the uninspired sauce, with doughy pizza crust or the insipid table guests we had.  But I really hate this place.  Yes we have a toddler and yes we should like the other parents--- but nothing, nothing could prepare me for the god-awful food that this place serves.  There isn't  enough wine in Italy to make go back there again.  Then there's the lack of courtesy from the other parents, who have forgotten that their screaming two-year old isn't cute to anyone else but his deaf parents.  \n\nCan say it again, I HATE this place.", "author": "Princess P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-08-07", "description": "I haven't tried the Pizza, but one day, I walked in, and and ordered ravioli with pesto dressing (meat filled) + galic bread.\nThat was a REALLY GOOD LUNCH. That was the BEST garlic bread I've had in a while, I dunked it in my pesto sauce and it was \nDELICIOUS! =D \n\nYes, it was kind of expencive, I think around 15 bucks or maybe less. I know for sure it was over 10. But it is worth it, the serving was really big for me, and I got full almost halfway and saved the other half for dinner. \n\nThe blond lady who always works there is courteous and talks with a smile. I really like this place =)", "author": "Sophia G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-01-12", "description": "I wish I could give this place ZERO stars.  Now, to be TOTALLY FAIR, I did not have the OPPORTUNITY to ACTUALLY eat here.  Here is what happened.  It was a couple nights after Christmas, a couple nights BEFORE New Years.  Me and my crew were looking for some pizza in Noe Valley.  Haystack looked festive from outside.  So we went inside.\n\nOnce in, we were asked to wait by the bar, while a table was prepared.  Now, the restaurant was nearly empty, so we were not really sure what we were waiting for.  Um, OK.  So we waited by said bar....and waited....\n\nFinally, we were escorted to a booth.  We then waited for menus.  And waited....and waited.\n\nAfter ANOTHER 10 minutes, yes 10 MINUTES, we were GRANTED the PLEASURE of menus.  NO ONE came and talked to us in that 10 minutes, no one acknowledged us, not even a nod.  It was almost bizarre.  At this point, we were almost fascinated by the sociological experiment of it all-  how long WOULD it take the folks at the 'Stack to talk to us?\n\nWater was now brought-  But OOOHHH, NOOOO, NO EYE CONTACT, NO NOD, and FOR SURE, NO TAKING OF ANY ORDER.\n\nThe bizarreness was finally too much for my roommate, who insisted that we leave.  As we walked out, finally one of the servers said, \"what?  you're leaving?\"  Um........", "author": "Jennifer O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-25", "description": "We had a great family meal here. I enjoyed the \"old style\" vibe and feel of the place. Steady crowd the night we were there, many seemed to be repeat customers. Our pizza was perfect, service was great and even checked to make sure we had all we needed. Made for a fun evening.", "author": "Dave E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-02-14", "description": "Since moving out of my place in Noe Valley, the one thing that I have consistently missed more than anything is getting delivery from Haystack. The penne rigate is THE BOMB! It has grilled chicken, vegetables and a delectable lemon-cream sauce. I am addicted to it. It seems like everything else on their menu pales in comparison.\n\nWhen I would order delivery from my place about six blocks away, it would arrive ridiculously fast. Sometimes it seemed like under 20 minutes. The tins of pasta were always so hot that they almost burned my hands. The delivery minimum is only $10 which is fantastic. Their portions are generous and a couple can share a single entree. A yummy meal for two, delivered in minutes, for about $15. Unbeatable. I love you Haystack!\n\nfyi, you can order delivery directly from their website", "author": "Aaron V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-10-02", "description": "All the 1 star reviews don't make any sense that they might have been paid off to talk mess. Anyway me and friends drive 20 minutes to get to this awsome mecca of pizza's. As for delivery issues nobody is perfect, I've waited over 2 hours for pizza to be delivered from 10 min away pizzaria. Stop being hates the pizza is good and service is awesome.", "author": "Maher A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-01-16", "description": "Dining In: I was with a group of 4 or 5 people pretty late on a week night and every place we had tried was closed. We stumbled upon Haystack as they were about to shut their doors for the night, but they agreed to seat us. The service was good given the late hour (the wait staff was obviously trying to get out of there). The pizza was great, we had the New Yorker and Old MacDonald. The decor was random in a good sort of way. It felt very homey. \n\nDelivery: We tried them for delivery one weekend, and used the online ordering feature (pretty cool). We immediately got a call to confirm (very prompt). It took about 40-45 minutes, as they said, however they mixed up our order and give us regular crust instead of thin crust. An honest mistake, which happens. Flavors were still good. I would order delivery again but be extremely specific while filling out the online information.", "author": "kathy c."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2005-11-29", "description": "I thought that I yelped this already.  What a loser I am.\n\nHaystack is the best pizza on the block up here.  The toppings are quality and plentiful.  You can order on-line and it magically shows up about 45 minutes later.  I really like it.\n\nIt is true that there are no major inovations in pizza at haystack. For me that is ok.  Sometimes you just want to have some good-old-fashioned pizzeria pizza.", "author": "Thadd L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-04-23", "description": "The delivery was FAST (30 minutes or less) and the pizza is so-so.  \n\nI would have given this place an extra star or two, but today I pulled my leftover cheese pizza out of the fridge and began to eat it when I found NOT ONE but TWO black, pubic-like hairs baked into the cheese.  (i.e. it absolutely must have come from the kitchen of Haystack because it was COOKED IN.)  I nearly vomited, but at least I didn't find the hairs by pulling them out of my teeth later.", "author": "Sleuthy W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-04-10", "description": "\"Excuse me, can I get a refill on root beer?\"\n\"Sure, but it's going to cost $1.75\"\n\"But I just paid $2.25 for this tiny ass glass, a whole two liter bottle only costs $1.50\"\n\"That's our policy\"\n\nIf the pizza was even good, I could have overlooked the soda conversation.  If the service wasn't mildly retarded I could have overlooked the soda conversation.  If the homeless guy I gave our leftovers to didn't look disappointed when I told him the pizza came from haystack I could have overlooked the soda conversation. But no.\n\nIt is time for haystack to be put down.  It was great before good pizza came to San Francisco. I'm sure in its day, it was the bomb yo... but now Pauline's, Arinelle's, and Little Star all put haystack to shame, and if I wanted delivery, Escape from New York is still my fave.\n\nAnd to think Haystack, I probably would have given you 4 stars and not hated you so much had you just given me my 3.5 cents worth of syrup and refilled my tiny ass soda glass.", "author": "Darren R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-04-29", "description": "No wonder why my mom always orders takeout from this pizza joint whenever there's visitors over at the house. The pizza is so damn good. The tomato sauce isn't that overwhelming on the slices too. I like the way how they put a player of ham or peperoni beneath the toppings of the pizza. It made it even tastier. I'm even trying to eat healthier at the moment and I just couldn't resist eating three slices. Haha. And the crust isn't that bad either. Very eatable like regular bread.", "author": "Gerard Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-06-05", "description": "The food at this restaurant is absolute best!\nThe service was prompt, less than 10 minutes for appetizers and the same for the entree. I recommend the calzone as an entree and the cheesy garlic bread for the appetizer, they are both great.They have a great wine selection. \nThey're even open late!! Highly recommended. ...", "author": "Rod H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-11-15", "description": "Love the Pizza at the place.\nThe crust is very tasty and the servings are heart.\nI have to say its the bext San Francisco style pizza in SF.\nA couple weeks ago I ordered Chicken Parmigianna and I got 2 huge breasts which turned into a great meal and leftovers for another meal.\nIts a 70's flash back San Francisco style and as a local boy who was born in Noe Valley its nice to see something from the past still around.", "author": "Joe R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2007-06-27", "description": "Booo!  This place really let me down.  This was my first and last time ordering from here.\n\n__________________\nMy timeline with Haystack (should be called HayHACK) Pizza:\n\nOrdered at 7:24: Kid answers, totally rude took my order.  Said it would be an hour and would cost more than $17 for a small pizza.  Um, ok.  \n\nCalled at 8:30:  Asked what's up with my pizza, it's more than an hour late.  Woman worker said, \"I will be there in 5-10 minutes\".  Then the kid who took my order in the first place picked up the phone from another line and kept insisting that I was his Mom and that he needed to talk to me.  The woman said, \"It's not your Mom\" about ten times before he got it.  I mean that is funny shit, but what kind of operation are these people running?\n\n8:50: Called to see what was up.  It's almost been an hour and a half, will you guys at least give me a discount?  Kid says, let me check with my manager, comes back to offer me $3 off.  Wow.  That is LAME.\n\n8:57: Called to cancel.  I've been waiting more than an hour and a half. \n\n9:10: Guess who just knocked at my door?  The deliveryman.  Nice work calling the poor guy to tell him that the order was cancelled!  What a surprise!  No thank you, not really interested in a pizza that was probably made an hour ago.\n__________\n\nHere's my real problem.  No one said sorry once.  Not even when I cancelled.  Worst customer service I've experienced in a long time.  Totally unprofessional.  If I could give it -5 stars I would.  \n\nAlso, I took a look at their restaurant and it's supposed to be some kind of a family run place.  Doesn't that mean it should be friendly?", "author": "Sheila B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-10-14", "description": "I'm hesitant to give five stars, but I really think this place deserves it. Their pizza is very good, thin crust is excellent although sometimes rolled a little too thin. If you request garlic on your pizza don't make plans to see any vampires later in the evening, because sometimes the pizza maker is a little heavy handed... the pizza cutter (could be the same person I suppose) sometimes cuts the pizza awkwardly with big and very little slices in your pie. But the pasta is great. The environment in here is a little, old west meets Italian coutry-side with just a touch of dive bar thrown in - but you're there for the food not the scenery so, who cares! \n\nP.S. good delivery service too!", "author": "Elizabeth D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-12-20", "description": "3 stars? WHAAAAT?!\nMe,my boyfriend, and friend went here at about 1:30 am when there was nothing open in site after a few drinks at Bliss Bar. holy crap. was I happy that this place was open..the atmosphere is what an authentic Italian place should be. very homie. Not to mention the pizza was GREAT. I usually would frown at the choice of vegetarian pizza but it didn't matter this time. So gooooood. It tasted like true Italian pizza. When I'm back in SF I will for sure go back there.", "author": "Natasha F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2005-12-06", "description": "It's just fine. As in \"oh, yes, everything's fine\" but -not- as in \"say, this is some FINE pizza.\"\r\n\r\nThe crust is a little too thick and chewy for my taste, and the ingredients could be of a higher quality, but their pies are decently made and much better than those from other places that deliver to my 'hood.", "author": "anita c."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-03-01", "description": "I'm not a big fan of Haystack's pizza, calzones, wine list or their choice in kitchy 60's/western decor but their pasta is INCREDIBLY good and you can get good beers in pitchers. Although there's a Pasta Pomodoro in Noe Valley that has better ambiance, I prefer Haytstack's pasta and Haystack is cheaper so I hardly ever went there. My favorite things are the penne rigate - rich, creamy, lemony sauce, tender chicken, lots of zucchini and broccoli - and the... carbonara something... I seriously order the Penne Rigate at least once a week and never get tired of it. It's always delicious and so good I don't see why I wouldn't continue to keep having it regularly.\n\nThe best thing about Haystack is that you can order delivery from their website. Perhaps it's because we lived so close, but it always came so quickly that the aluminum tray was so hot you couldn't touch it with your bare hands, even inside it's paper bag. The garlic cheese bread fried zucchini and mozzarella sticks are also excellent.", "author": "Kristina A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-12-26", "description": "You can't get better pizza in San Francisco than what you can get at Haystack (and I used to live in Chicago, so I know a thing or two about pizza).  Oodles of toppings, crazy rural 1970s pizzeria decor (paneling, baby, yeah!), ambivalent staff, good beer selection, and somebody-stop-me-holy-cow-it's-so-silly-good pizza.  \n\nGood place to order in from (and a very easy online ordering system - you can think about what you'll order later while you're eating lunch at your desk at work and then say - online - I want this delivered at 7:00, and they actually show up ON TIME), but it's an even better place to visit.\n\nThe Greek salad is a big winner, the meat ravioli pretty standard, but you're not going here for salad or ravioli.  It's the pizza, kids.  Trust me.\n\nAND:  Last time I was there, I lost my wallet right outside the front door, but didn't notice until later.  The person who found it brought it to my house.  THOSE are the kinds of people who eat at Haystack.  What's not to love?", "author": "Evan G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-03-21", "description": "I have always regarded Haystack as a kid friendly place. The quality of the pizza can be so-so, but my daughter likes it so we enjoyed going there. \n\nBut recently we experienced something that really changed our minds about the place. It was Saturday and we got their pretty early 5:30 ish (family time). When we walked in their was a free table up front so we asked the waiter if we could sit there. He said yes, but then saw that we had a child with us and mumbled something about saving the table for a larger party and wanted us to sit in thback. We reluctantly agreed, as my experience with the back room is that it is hot, stuffy and you get ignored by the wait staff.. \ne \nAll of which proved to be the case that night, in addition to which it was full of families with kids (the kiddie corral) \n\nThe wait staff was barely polite and the pizza was like bland cardboard. \n\nAs we left (swearing to not come again) I noticed that at the table in the front there was just a couple, not the \"big party\" the waiter lied about. It was obvious that families with kids are not welcome to sit in the front par rt of a restaurant that proclaims itself to be a \"Family Restaurant\".  So as far as \"kid-friendly\" goes, I would change that to be a big fat \"NO\".", "author": "Erin C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-04-02", "description": "Haystack Pizza - New Yorker with black olives and sausage. It is my second favorite pizza ever. Always count on it to be greasy, garlicky goodness.", "author": "Erin A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-10-30", "description": "Have been eating here occasionally for over 30 years. The quality of the entrees and service have definitely gone downhill -- while the prices have risen disproportionately.  I still like the pizza with that thick, doughy, yeasty crust and the generous iceburg lettuce and canned beans salad with fresh, chunky (made in-house?) blue cheese dressing. This is 1970's comfort food at 2011 prices. They used to serve hearty, acceptably-priced lamb chops, chicken parmigiana, and spaghetti with meatballs, always enough for leftovers, but no more. It's been nearly empty for the last few years whenever I've been in. Haystack's Hayday is ovah. The last waiter we had is an incredibly cute, sensitive, boyish body builder -- and is the only reason why I'd return.", "author": "Lotion M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-10-13", "description": "I've ordered take-out from Haystack for the almost 20 years I've lived in Noe Valley.  I love their pizzas - the Haystack Special, the Zorba; also a combo of pepperoni, linguica, mushroom and onion that they make for me which is delicious.  My friends have all loved it also when we've had it together.  It's a family owned restaurant with a nice neighborhood charm - the owner and the servers are mostly family members and their friends.  It seems like some folks that have eaten there haven't gotten great service, but I can say that the pizza have ordered for many years has almost always been tasty and worth it (and I've tried many kinds of pizza.)  For me it's been a five-star staple over the two decades I've lived here.", "author": "Brian C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2006-07-30", "description": "I can say with great certainty that this pizza is edible. I managed to eat two of eight slices. From what I can tell however, this place dislikes, or refuses to believe in the existence of tomato sauce.\r\n\r\nGood news: they do believe in cheese! In fact, they perhaps believe in it too strongly. The pizza showed up with what was probably once a veritable sea of cheese that had somehow gone solid, trapping sad, doomed slices of white onion.\r\n\r\nAll of this might have to do with the fact that it took just over an hour for our pizza to show up to our door. Perhaps this sad pie sat in a driver's car, unloved and forgotten until someone realized that it was closed to closing time and, oh, what is that in the back seat?\r\n\r\nI'd like to like this place, because, well, I _want_ to like places. I'll probably give them another shot some time soon and see if things improve.", "author": "Holly T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-07-20", "description": "Solid Pizza. The thing that sticks out to me was the portion. a Wagon Wheel, XL was in fact enormous and relatively cheap. Sauce was lacking, but the crust Awesome) and freshness of other ingredients carried the Pie. With a big group, i'll be back", "author": "Stephen C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-08-20", "description": "This is restaurant is alright for dining in.  The Western decor is kinda cool, if you're into that.  I think the pizza here is fantastic...nice thick crust, tons of cheese (probably just a little too much), and they definitely don't cheap you on the toppings.  Unbeknowest to many, this place also serves really good hamburgers.\n\nI must admit I've had mixed service here.  Also, DO NOT UNDER ANY CIRCUMSTANCES ORDER FOR DELIVERY, especially if you are starving.  They will lie to you, deceive you, tell you the food's on its way, tell you driver is new, tell you the driver just left with your order, and hours later it will finally arrive, your pizza piping hot, fresh out of the oven.  WTF?", "author": "Kerry D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-02-07", "description": "This is good pizza, but this is NOT New York style pizza.  The crust is thick and has a good texture and the sauce is tangy and a little sweet.  Are there better pizza places in the city?  Probably?  Will any of those pizza places deliver to Diamond Heights?  Nope.  \n\nWhen it comes to delivery, I have to admit, they are a little slow.  This is a mom and pop shop, so when I order from them, I usually expect them to be at my door in about an hour.  \n\nThe appetizers are really tasty too, though it seems like they might be frozen and then just thrown in the fryer.  Honestly though I don't go there for the appetizers or the salads.  I'm there for the pizza and they do that well.  \n\nI have to say that Haystack pizza is actually better one day later after spending the night in the fridge.  All the flavors seem to tighten up a little more.  \n\nThis is a great place for a date or a chill night on the town.  \n\nSure Little Star is close by, but you have to wait and find parking in the Mission or on Divisadero.", "author": "Adam E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-02-03", "description": "This is my favorite Pizza place in San Francisco. I've been eating Haystack pizza for a very, very long time. Actually, I think Haystack may be the first Pizza I have ever eaten. I love it! But enough about me, getting back to the review. It's a great neighborhood restaurant, the staff is super friendly and they do make some yummy pizza. I would have given it 5 stars, but they do have the occasional pizza mess-up. (ie. too greasy, soggy, too much crust). However, they do manage to get the pizza just right most of the time. In addition to their pizza, the 2nd best thing on the menu is their \"Spicy Buffalo Wings.\" They pack as much flavor as saucy buffalo wings, but Haystack's wings are nice and crunchy! Yum!! Haystack is definitely worth a try! \n\nRecommendations: \nThe Alexander (Specialty Pizza #1)\nLeilani - The Hawaiian (Specialty Pizza #5)\nLuigi - The Italian (Specialty Pizza #6)\nSpicy Buffalo Wings", "author": "Lisa T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-08-02", "description": "I am constantly in search of good pizza here in the Bay Area. Haystack was a big let down. The crust is insanely doughy, super bready and is slightly sweet. It's just not good. \n\nThe entrees are ok and they do give you a lot.  I would definitely not go out of your way to try Haystack, but it's not terrible if you go the entree route.", "author": "Jennifer C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-01-12", "description": "I always thought that Haystack Pizza was the best place to order a pizza on this side of town until the other night. We ordered a pizza  and to my amazement, it looked no different from your local Pizza Hut or Domino's pizza. The toppings we ordered were sausage, extra cheese and tomatoes. Well, they are definitely beginning to skimp on their toppings. Some pieces of pizza had only one morsel of sausage and most no more than two and the extra cheese, let's just say \"extra\" is not what you get.\n\n In the past we didn't mind paying $30 dollars for an extra large pizza when we had company over because we knew that we were getting exactly what we paid for and also bragging rights for our local pizzeria. Next time we have company over, I will think twice before I pay another $30 for a pizza from Haystack.", "author": "J D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-03-08", "description": "We just moved to Noe and finding a restaurant that has good selection on the menu, delivers quickly and is close by, is difficult.  Haystack wins on all fronts.  The pizza is great and the fact that they use real bacon as a topping option is unique and will keep me coming back. They make thin and thick crusts, however, the thin crust pizza can get soggy quickly with the toppings.  The thick/regular crust pizzas can be a bit dry so I would suggest asking for extra sauce if you go that route.\n\nThey have a full, and diverse menu so if you're not in the mood for Italian, there are many other choices.  There are the must try 'hot wings', that are slightly spicy, crispy and seasoned just right.  They even serve burgers and fries which are tasty.  We ordered their spinach salad and Greek salad and that was good as well - very fresh.\n\nThe service is good and they stay open later than most of the spots on 24th in Noe.", "author": "Renee J."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-09-22", "description": "This place is all-around average. I'd go there if I didn't feel like going out of my way to go somewhere better--which is what happened when I ordered online for lunch.\n\nProps for being technically savvy enough to have online ordering (though shouldn't all restaurants have this by now) but they never called back to confirm the order. After calling, I was informed the order would take 40 minutes to arrive. 40 minutes for a hamburger? okay, whatever. I waited an hour and called again. \"It's about to go out for delivery.\" 30 minutes later I called again, \"It's on its way.\" 15 minutes later, it finally arrived. Not piping hot, but edible. Fries, however were warm and soggy. \n\nIn short, I shouldn't have been so lazy and chosen a better and closer place nearby rather than rely on delivery by Haystack. Despite their lack of delivery service, .there's nothing terrible about this place, but nothing to write home about either.", "author": "Sabine S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-05-07", "description": "Haystacks was the first place I had a beer and never carded!\n\nI like Haystacks since I live near there. Their pizza is average, but if you order your crust thin, it's basically just toppings. \n\nIf you want a burger or a meatball sub, they've got those too.\n\nIf you're not looking for anything super spectacular, decent pizza, and quick delivery, then go with Haystacks. \n\nIf you're looking for fancy pizza, might I suggest Little Star?", "author": "David S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-09", "description": "I have loved Haystack for years because they make pizza the way I like it:) They know what extra thick crust means, and their sauce is sweet and delicious, not bitter and overwhelming like other pizza restaurants. The ingredients are always fresh and plentiful, plus you can add extra for just a little more. There was a delay with delivery, but after having a nice conversation with the manager they are back on track and better than ever. Thank you Haystack for listening and then delivering your best!! I will continue to recommend you to folks in my neighborhood and yours:) BTW, your Canadian bacon and pineapple with feta and extra thick crust was amazing!", "author": "John G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-01", "description": "I finally decided to give this a place a try after going by it several times. I have to say the Thick Crust PIzza is really good, and reasonably priced. It is now on my favorite places to get Pizza in SF. The service needs a little help, and that is the reason I am not giving it 5 stars. I think they need more help, staff appeared to be stretched thin, which then increased the wait. The wait for the Pizza was worth it!", "author": "Justin B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-06-21", "description": "My review is from my experience as a delivery customer - I have never eaten in the restaurant.\n\nI'm a positive person so I would like to start by saying that Haystack is convenient if you like to order your pizza online - it works... however, that's where the positive ends.\n\nI only have two words for their pizza - soggy and tepid...okay a couple more... just don't do it and haunts you for days.", "author": "ohreleigh .."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2007-09-26", "description": "I had the Caesar Salad and a Calzone and was truly amazed at the terrible quality of every single ingredient. Cheap lettuce, bad cruttons and absolutely insufferable amount of rubbery, partially melted cheese in the calzone. There was a pink tint to the outside of the dairy mass, which is all there was in the way of sauce. I asked for some extra on the side to try and put together a few palatable bites; that showed up on the bill. \n\nI could see reading this review and thinking that I've been overly hash and snobby, but I can tell you that this was literally the worst meal that my dining companion or I can remember. A tremendous disappointment.", "author": "Danielle R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-10-03", "description": "Worst counter service ever.  It's a shame. My family used to order take out from here almost weekly, but today's extremely rude service has put a stop to that.  First of all, the stupid counter girl overcharged me.  After I pointed out the correct price and handed her a copy of their own menu with the price right in front of her face, her only response was that she had to charge whatever showed up on the computer.  I mean really, use your brain.  Is it really worth losing a regular customer? When I tried later to speak with a manager on the phone, she obviously realized it was me calling in to complain about her, and I never received a call back.  Not the way to treat patrons.  Will never return.", "author": "Irene F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-12-30", "description": "My girlfriend lives across the street form Haystack and I have eaten there many times. If you love thin-crust pizza Haystack is a decent choice. The staff are super nice and the place does have a very friendly atmosphere, but the pizza is extremely greasy and softens the perfectly cooked crust. There pasta dishes and salads are delicious! I often order the antipasto salad and it is LOADED with meat and veggies! Overall a decent place to have a pie or some pasta.", "author": "Norm N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2005-11-29", "description": "Haystack is definitely the place to beat around the Noe-Castro area. I've never had a problem with them over many orders. Pizzas arrive hot, quick, and delicious. You can even order your pie online--which saves so much embarrasment when you're stammering to order over the phone while obviously inebriated. (Or so I'm told.)\n\nNot a huge fan of dining in there. Friendly service, but sometimes on the slow side. Why go out when you can dine in tho?", "author": "Aaron L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-01-28", "description": "I went into this place for lunch today, as I always pass by it while walking down 24th street.  1 o clock on a Wednesday afternoon, and the only other patrons beside myself were a group of rowdy highschoolers and a middle-aged woman.  Needless to say, the service was good enough-- my waitress was friendly and even brought over some french bread for my baby, Magnus, to gnaw on in his stroller, and the food was delivered hot and timely... but great service cannot make up for dismal food.\n\nMy calamari was bland and came with an odd red sauce I think was supposed to be marinara, but tasted like catsup.  The spaghetti was the most disappointing, as I was hoping for a truly flavorful sauce and received a watery, bland and boring mess that i covered in cheese to make barely edible...  Long story short, I ate maybe 1/3 of the food but wasn't interested in finishing... or in taking it home.\n\nThere are several other pizza/Italian places in Noe Valley, so I don't think I'll come back here again.", "author": "Julia R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-04-26", "description": "Extra-large beef and onion.\n\nThey are going to cater my birthday.", "author": "J-Meoww W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-03-26", "description": "Not the worst pizza I can imagine, but I was expecting a lot more from Haystack pizza. It seemed like one of those neighborhood staples that would be a classic. Not the case.\n\nWhen I lived at Mission and 24th, many moons ago, I used to frequent Noe Valley for brunch mostly. Here, I noticed Haystack and thought: \"wow, this place really keeps it real.\" They seemed old school and classic. The pizza however has much to be desired.\n\nIt seemed that they cooked it properly. The cheese to sauce to crust ratio was adequate. The main problem was a horrible crust. Horribly unseasoned. I can't say much for the sauce, but the crust was the major downfall of the pie. Especially when making thick crust, you must season the crust properly. It's the most important thing. If you had no crust, you would have nothing.\n\nThat egregious error exemplifies each ensuing effacement of enthusiastic elations.", "author": "Berg W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-07-27", "description": "Friday night pizza dinner with friends. Waitress was very pleasant as was a young man who gave us refills on our soda.  Our veggie pizza was just ok.  The crust was good and the toppings were plentiful.  The garlic tasted a bit on the bitter side. Please put more pizza sauce on your pizzas.  You could hardly see it on the pizza and it affected the over all taste of the pizza because as you bite into the slice you want to taste the crust, sauce, cheese, then toppings in that order in order to get the full pizza experience.  That is why I rated it like I did.", "author": "M R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2006-08-13", "description": "The appetizers were crummy, the wine was acceptable, and the spaghetti and meatballs were the worst I've ever eaten. Seriously, it was like they fashioned the meatballs from a pile of old cats they had lying out the back, then served them up on a bed of tomatoed shoelaces.\n\nThe serving staff were very nice, though. Perhaps we should order pizza next time.", "author": "Glen M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2006-08-14", "description": "sad excuse for pizza. Yuck!\nI ordered their signature pizza the Haystack online---and..i seriously don't know where to start with the failure that is Haystack Pizza. \n\nFirst off ----Thick flabby dough, no sauce, rubberized cheese, wet mushrooms, par-cooked onions, SOGGY pepperoni and salami, wayyyy too many green peppers, but the sausage was ok. If they're gonna make a thick pizza-- they need to make it right-- the end product was way too soggy. We tossed it into the compost bin.\n\nSecond-- delivery time. it took an hour and 40 minutes to receive the pizza. that was way too long. I used to waiting around an hour for delivery food, but this time frame isn't acceptable. \n\nThird-- Delivery guy-- Guy forgot to include the homemade garlic bread . He did offer to comeback again with it, but after 100 minutes waiting for the stupid pizza I said No-please refund my credit card. Did they? no. When I called to confirm the refund-- they had no clue. \n\nFinally-- it's not a value meal. $22 for a large with a 1 inch crust, no sauce and loaded with inexpensive ingredients to add volume is a ripoff. Don't count on leftovers -- unless you like pizza soup.\n\nConclusion: This place totally sucks. Places like this ruin the \"pizza is like sex\" motto, cause this pizza blows but not in the good way.", "author": "Pea H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-21", "description": "I can't believe this place is in Noe Valley, seriously, a blast from the past.  Old school vibe, young white clean cut servers, a bit dusty, and rustic feeling.  \nTasty pizza and salad!  \nVery relaxing, good for families.", "author": "jennifer t."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-11-05", "description": "Me and Hubby were at Twin peaks..We were looking for any pizza place around.we ended up here..Dine-In\n*Warm atmosphere\n*Yummy cheese,sauce,perfect crust \n*good price ................a small looked like a *Medium /large.\n*Even the water was good.\n*Good service\nAlthough we were the only ones eating there on a late tuesday night\nit took a while for the pizza to be ready..we were satisfies.It was Delicious.I would drive back from SJ to eat here again!.", "author": "Jehzabella V."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-07-31", "description": "While I prefer their pizza to the others in the neighborhood, their entrees are just ok.  Service can be iffy and they are always busy.  Basically the place is a dump, but it's a neighborhood pizza place not a destination...", "author": "Karen C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-04-12", "description": "Tried Haystack again, and for the last time.  Why would you even waste your time and money getting food from this place, when there are 20 other local Italian restaurants and pizza joints that serve better food with better service for the same price?\n\nAs another reviewer said, Haystack's food pales in comparison to what you can get at a mall's food court.  Never again will I make the mistake of eating at Haystack.", "author": "Josh M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-04-08", "description": "Online ordering rocks. Lightning fast delivery. Always perfect pizza.", "author": "Lisa C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-12-02", "description": "I ordered a greek pizza for delivery. The crust was okay. The toppings were generous and delicious. The delivery was a bit over the stated time, but whatever, good pizza takes time.\n\nI'm not a pizza fanatic. In fact, I'm pretty meh about pizza in general. So if I like a pizza, it's probably pretty good.", "author": "Matt W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-11-07", "description": "It was an intense night with my friends celebrating election night and the city was stirring with excitement. But not Noe Valley. Nothing was opened, we were starving, and we stumbled into Haystack.\n\nI tend to judge pizza restaurants on the chicken wings they have. lets just say that they looked like they came from \"costco\" as one of my buddies put it. the ingredients seemed very fresh on the Haystack Pizza but wasn't totally impressed with the burnt crust. Good thing for the ranch dressing coming to the rescue.", "author": "Gabe H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-01-22", "description": "I've ordered from Haystack dozens and dozens of times over maybe 15 years. Here's my favorite: pizza with pesto sauce, canadian bacon and feta cheese. It melts in your mouth. Thick soft delicious crust, lightly oily pesto sauce, lightly crispy canadian bacon. And feta cheese to make it over-the-top creamy and rich. I don't even want to know how many calories/carbs each slice has, but because the guilt of the experience overwhelms me, I always order their spinach salad too. HUGE. Lots of baby spinach, red onion slices, tomatoes, with a bit of bacon and hard-boiled egg slices. They put the dressing on the side, so nothing is soggy. The pizza/salad combo is enough to last for a few days. Perfect. \n\nI've also ordered burgers/fries from them several times, and the reason that it works so well is that they put all of the condiments on the side. You get a burger/bun, and then you have a separate side bag jammed full of lettuce, onions and tomato. And then your usual squeezie-thingies of mustard/ketchup. The burgers stay relatively warm during delivery -- although I've always lived pretty close, so the travel distance wasn't far. Their french fries are SO GOOD. Huge super-thick-cut home made fries. Lightly golden.\n\nOnce I ordered an actual Italian meal from them -- ravioli, and it was also a delicious meal. They have a good selection of non-pizza items.\n\nI know you can order online, but I've never tried that. And for all of the times I've ordered for delivery, I've only eaten inside their restaurant a couple of times. The decor (wagon wheel chic) just doesn't do it for me. But I've gone in for pick-up, and have never seen a crowd of any sort. It seems like the kind of place that you could go and get a seat at a huge booth at just about any time of the day/nite.\n\nAfter so many years of providing me with such satisfying food, I'm happy to be able to do a little something for them by singing their praises here.", "author": "Zoe H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-08-26", "description": "I went to High School down the street, so I often passed this little place. Its GOOD, but its not AMAZING. \n\nGood prices, better waiters (I guess you get better service when you aren't in a uniform), and good crust. I'm all about the crust. \n\nStreet parking is a joke. Usually. But when I do come to Noe Valley, I have been very lucky with parking. I highly suggest taking the bus or the J. Or even walking from BART. It's a nice stroll!", "author": "Coco C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-11-09", "description": "Ahhh the good old days of pizza.\n\nThis is how pizza used to be. My friend and I ordered \"The Haystack.\" The pizza toppings were sausage, salami, pepperoni, mushroom, bell pepper & onions.\n\nIt's so refreshing to eat a good pizza unlike all those typical chain pizzas.\n\nThe atmosphere is like an old western hometown restaurant . It feels like home.", "author": "Bert T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-10-31", "description": "really nice people.\n\nno parking in the evening...sometimes no parking during the day.\n\nits okay pizza and pasta.  they have a huge menu so i guess that goes to why everything is okay.\n\nif they had less of a choice they'd be MUCH BETTER but they make so much that it takes away from how good other things can be.\n\ni've had pizza and pasta and the minestrone soup.  it was AGAIN...okay.", "author": "Bing D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-12-16", "description": "Food was mediocre. Service was not very good. And the seating was so incredibly cramped I had to sit with my feet diagonal to not bump knees with my dining partner.", "author": "Nicolai T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2006-09-30", "description": "Food is decent, if greasy.  The delivery leaves a lot to be desired, unfortunately.  The last time we ordered, it took an hour (which they told us about in advance).  The driver forgot one part of our order, so he want back to get it.  Came back lukewarm.  \n\nThe least you can do when you're that late is give the item for free, or to give us a break on the next order.  As it is, we're never ordering from them again.", "author": "Bill J."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-02-24", "description": "The Pizza here is good.  For the Noe Valley area it seems like a really boring restaurant.  They do serve Italian food which doesn't seem to be what they really want to sell.  The service seems to be fair but nothing to write home about.  For the location I expect more.  Which I was sad to say did not happen.", "author": "Ramona L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-01-30", "description": "The pizza is really lacking. I have not been to the restaurant. I ordered a pepperoni and then a combo large pizza for a party. So disappointed and embarrassed. I try to patronize local restaurants where I live in Noe.\n The dough was bland and so was the sauce. The middle was really moist and just fell apart. If you live in Noe go to Escape from New York in the Castro instead or Paxti's (greasy). LIke I said never ordered anything except the pizza which was not good so I am skeptical to try anything else. Also kind of expensive.", "author": "julie q."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-12-04", "description": "This place is not very good even for a down home pizza and Italian food joint.  Salads were crappy ice berg lettuce and very little else.  The meatball sub was on a pretty old tasting roll, and the meatballs were nothing to write home about.", "author": "Todd R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-07-27", "description": "YUMMY pizza & decent salads too! This place has lots of character & really good service! Went for a friend's b-day dinner so we had a few tables in the back. They even let us bring in balloons & cupcakes :) The pizza crust on our veggie pizza was my fave--perfectly thick & doughy. The pizza also had a great garlic flavor :) Will definitely be back. I've heard people swear by there Veal Parmigiana.", "author": "Mel A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2007-11-12", "description": "DO NOT EAT HERE.  \n\nI just tried to order a pizza for take out, was hung up on twice, put on hold for over six minutes, and when someone finally answered the phone, I told her I was hung up on twice.  She says, \"Ok, so do do you want pick up or delivery?\"  So I asked if she was even going to apologize for hanging up on me.  She says- and I quote: \"Look, we're busy.  Do you want to order something or not?\"  \n\nNeedless to say, I did not at that point.  \n\nI have tried their pasta which is beyond gross- overly greasy, not flavorful, and way over priced.  So I wanted to get a pizza, which was clearly not going to happen.\n\nI give this place ZERO stars for some of the worst attitude I've encountered at a restaurant.", "author": "Ellen S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-06-04", "description": "the pizza here is alright. My mom loves it. they have good prices. i think it tastes better to-go or for delivery.\n\nthey have the best delivery service ever. I live pretty far away and they still deliver. EVEN BETTER..... they deliver anything on their menu. (including steak)", "author": "angela s."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-20", "description": "Went the other night.  Had a great pizza.  The service was just ok.  However, to be fair, they were close to being closed and Im sure they wanted to get out of there and go home.  Would go back for sure.", "author": "Jeremy G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-12", "description": "The BEST pizza in SF!!! The crust is like a fresh baguette; they don't skimp on toppings; and they are reasonably priced.", "author": "Sandra M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-01-26", "description": "I was going to give it a 3, but 2 is appropriate as I have TRULY experienced much better.  It is not bad, but there is nothing mind blowing about their pizza at all.  A girlfriend told me that it wasn't that good and advised not to waste my time, but I had to try it for myself.  It could be better if they did something with their crust.  The crust was similar tasting to a store bought pizza you toss in the oven.  Now that we have extablished I wasn't crazy about the food, the service was very good, and I have no complaints there at all.  They had it ready before the guesstimate they told me, they were very kind and corteous, and even those that knew nothing about my order kept checking in with me.  Very sweet.  I am bound and determined to find a food item I like here just so I can go back and say hi!", "author": "Gina R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-07-20", "description": "The menu looks amazing!  The pizza looks amazing (we got half Old McDonald and half Haystack) BUT it is not as good as it looks.  The pizza was soggy :(  So soggy that the pizza seemed to be breaking through the bottom of the box and it was impossible to pick a piece of pizza up.  It was edible and some pieces were better than others.  The part was the crust!  It was probably the best crust I have ever had on a pizza.  We did not finish the pizza but since it was so soggy it would not have saved well but I cut the crust off of all the pizza and saved that!  Also, the service was not friendly.  We picked up a to-go order and all the workers seemed angry.", "author": "Chauntay J."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-01-01", "description": "I've been going here for years.  Basic pizza, nothing special but decent.  Last night I ordered a half and half pizza expecting to pay the more expensive half for the whole pie.  Their most expensive \"everything\" haystack wheel wagon is 31.80, but for something different on the other half the charge for the entire full size pizza PLUS the items on the other half.  This explains a $40 large pizza.  Don't get half and half pizzas or you will be grossly overcharged.  I will NEVER go back there based on principle.  The staff attitude was \"tough.  Take it or leave it\".  I'll leave it thank you very much.", "author": "Tim C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-27", "description": "Best pizza ever in Noe Valley/Bernal Heights area! I always order Zorba the Greek which has feta cheese, pepperoni, sausage & bell peppers. Omg super Yummy!!! And their Spinach salad and garlic cheese bread is excellent too. Best flavored sauce and specialty pizzas and great Italian food as well. Haystack Pizza is a great family restaurant too. Two thumbs up for Haystack Pizza!! :]", "author": "Claire K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-01-05", "description": "This place just has all the right elements that make a pizza place great. Nice and comfortable atmosphere. Great variety of food. Cool staff. \nI don't know what it is about their pizza, but it reminds me of the pizza I grew up with down in Los Angeles. I highly recommend ordering any of their wagon wheel 18 inch pizzas. \n\nAnd I usually don't order appetizers at most places. But here, I look forward to it each time. I especially love the cheese sticks as well as the very great tasting Chicken Wings. Although they're a little over priced for the wings, they're just so tasty that I can justify the price.\n\nAlso, another cool thing is, this place offers other various choices such as sandwiches, pasta and more. Lots of variety. One of my personal favorite places in this city. \n\n***Note of caution, when taking a slice of pizza off the pan, pick up the slice starting from the middle. Otherwise it can get pretty messy***", "author": "Shaun M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-12-29", "description": "It was a dark and  drizzly Saturday night leaving most locals in orders and probably ordering home delivery.  We were able to get seated right away by a friendly face.  A pizza dinner out with the fiance in our new neighborhood - Noe Valley. \n\nThe place had a nice quiet buzz going on with different groups enjoying their meal and conversation.  As was expected, it did take a few for someone to take our drink and appetizer order once we put aside all the menus and looked plaintively towards the general waitress area.  All smiles when she did arrive to take our appetizer and beer order, we were still debating on the pizza toppings.\n\nIn general the staff seemed pretty attentive checking on tables, refilling drink orders and getting to go boxes for left overs.\n\nWhen the Bruchetta arrived the first thing that I noticed was pink tomatoes, then noticed very little seasoning on think slices of very garlicked bread.  The Luigi somethin' or other with sausage added was then ordered.  IMNSHO, the topping on Bruchetta should be a bit more on the red tomatoey side, diced up nice and small, marinating in olive oil with maybe a touch of garlic and salt and pepper and served on thinner, almost toast slices.  Each place has their own style I understand.  Just won't be ordering that again.\n\nA pitcher of Sierra Nevada went down nice and smooth between the two of us and then the pizza arrived.  YUM!!!  It was delivered by the next waitstaff person available, A.O.K. in my book, as that makes sure it arrives fresh and HOT!  The cheese was nice and gooey, the pesto and garlic made my mouth water and the sausage was nice and not too spicy.  The crust was crispy where it should be, on the very bottom and along the sides and just bready enough on the inside.\n\nOddly enough however, this was when the wait staff disappeared.  No one came back to make sure our pizza was all right, to see if we needed refills on beer or some water or more napkins.  No offer of coffee and dessert until we stopped a passing person to get a box for our left overs and a check.\n\nSince the pizza was good we'll most likely give delivery a try and maybe one of their other dinner offerings another time.  But if someone said choose now, Noe Valley Pizza would come first.\n\nLate nite is only Friday and Saturday until midnight, Sunday thru Thursday is 11 pm.  Wheelchair accessible would be doable but a tight fit.", "author": "Marti P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-01-19", "description": "Great Pizza, reasonble prices.\nEasy online ordering!", "author": "Scott R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-11-27", "description": "There was nothing really bad about the food or service, it's just that there are much better places to eat in SF, especially for the money we paid. We will not be going back again.", "author": "LH N."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-12-06", "description": "I found out that Haystack makes pizza with whole wheat crust so I decided to order it to be delivered... \n\n1. The pizza arrived late because the delivery person went to the wrong house. \n2. The deliver guy did not believe me when I said that my house existed. (yes, he told me it did not when I'm pretty sure I know where I live) \n3. The pizza was NOT on whole wheat crust. \n\nMy room mate liked it so much we ordered again the next night...hoping we'd luck out with the driver. We received a call to verify the order and then a few minutes later another call to say that the delivery guy said that he does not deliver to this area. *back up and rewind...what?!* So I told her that the delivery guy came by last night. She said she'd speak with the delivery guy and call me back. A few minute later, I get a call back and she said that the delivery guy does not deliver to my area...AGAIN. \n\n1. The website states that it delivers to my zip code. \n2. The deliver guy is a major tool. \n\nThe only reason why I'm giving this restaurant an extra star is because the pizza was decent...even though it was on the WRONG crust.", "author": "Valerie C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-09-29", "description": "I LOVE Haystack!  My husband and I moved away from Noe Valley a few months ago and have been going through withdrawal.  They don't deliver to SOMA, so several times we have actually fought traffic on a Friday night to go to Haystack and get our takeout.  I love the Greek Salad, my husband swears by the Calzone B (add mushrooms).  Anytime we have out of town guests we order from here.  I had to knock off one star for long delivery wait times and a for a lackluster in restaurant dining experience.  The atmosphere is nothing special, but the food is amazing.  Highly recommended!", "author": "Alison J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-07-20", "description": "On a recent visit to SF, my husband and I decided to explore a part of the city that we had never been to.  Our son lives in SF and is always bringing us to these yuppie, overcrowded, over raved about restaurants.  Many of them have had very tasty food but that trendy scene gets old and expensive.  As we made our way up 24th we saw this little Italian place, Haystack Pizza.  It reminded us of an old school Italian place so we decided to try it.  It was a Monday at 1pm and there were only a few couples in there eating.  We ordered pizza and a salad.  We LOVE the pizza.  The sauce is perfection.  We didn't get the thin crust (didn't even know they had it until I read the reviews); it was on the thicker side but not too thick and baked to perfection.  A size small was big enough for both of us and we even had a piece left over.  Our salads were just okay. I would actually give the pizza 5 stars but because I haven't tried anything else on the menu I hesitate to give the whole place that much love.\n\nAmbiance is old school.  Don't expect to be impressed with the decor.    But if you want a good pie at decent prices...this is the place.", "author": "Shell M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-06-02", "description": "Love the pizza!! The pies are pretty large and thick. The toppings are plentiful. It's fresh, not greasy. They are consistently good. I've taken lots of out of town guests here. It's a relatively small place. I always try to sit in the front of the restaurant, as the large groups of kids/families are usually seated in the back area where they have more room. Even still, I very much enjoy Haystack!", "author": "Heidi L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-05-12", "description": "If I would have read the reviews before I stopped by the other night, I would have never gone there. But the other night after going to a movie I felt like eating pizza. I did not want anything out of the ordinary... just plain old pizza that would satisfy my pizza craving. It was already 10pm om a Saturday and I was trying to think... where can i get pizza. Haystack's! So off we went to Haystack, parked right outside and were greeted and seated immediately. Our server was a very sweet and polite woman who was nothing but smiles. I ordered the #4 Zorba the Greek pizza (which I thought was expensive at about 16-17 bucks for the small) and my friend got the Italian sausage pizza. I had been to this restaurant years ago and did not remember much of it except that I had gone right after the gym and felt guilty for going there. Anyhoo... I digress... so we are sitting there waiting for our food and other folks come in. It is getting pretty busy for being after 10pm. I figured folks would be at the bar and what not. Alas... the food arrives, my pizza looked so good... it did look like a heart attack waiting to happen and there was no way in the world I could ever eat the entire thing. My friend also got her sandwich with some yummy steak cut fries. I dig in and have my first bite... WOW! It was exactly what I wanted... a hearty pizza. It was very good, granted, I only was able to eat 2 slices and left the other (more than half of the pizza) to take home and savor later on. There was constantly someone asking us how things were (an older gentleman who seemed like he may have been the owner) and he even chit chatted with us. \n\nI don't know if I was just lucky or if it just depends on who you get to help you, if people are going in with snooty attitudes and it shows, everyone was on that special time or what, the planets were just aligned right, but I seriously didn't experience anything negative while here. I mean... if you want some sort of specialty pizza.. then go to the specialty place... if you just want standard, hearty pizza... this is your place. Hey... I like gourmet like pizza myself... but if that is what you looking for... then save yourself a trip and whiny review and go elsewhere. \n\nAs for delivery mishaps... haven't ordered, but if I ever do... I will drop a few lines about it that experience. Based on my experience... I am a fan :)", "author": "Amelia M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-11-12", "description": "I've been ordering from Haystack for years and unfortunately, their pizza has been on the decline and yesterday may have been the last time... 70 minutes after having Ordered, I called to find out where my pizza was and was told it \"had just left and should be delivered any minute\". 25 minutes after that STILL NO PIZZA so I called back only to be told that it was \"Leaving right now\" so an hour and 45 minutes later I finally had what must've been the most mediocre pizza they've ever made. Sorry Haystack, I'm done....", "author": "M. S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-03-16", "description": "Came here after a day of hiking.  I would never choose a pizza place left to my own devices (bread + cheese = chub!)  , but was with starving bf and his parents.  Seriously, he was at that low blood sugar place where I was really wishing I had a Cliff bar in my purse to keep him from passing out!   \nWe were seated, we ordered from our nice waiter (who seemed a little nervous).   My salad and BF's Dad's pizza came out right away.  I wasn't sure if our waiter heard my order for bruschetta, so I asked if he had gotten it.  I thought that bruschetta would arrive the fastest, being an appetizer and all.   It is a good thing I asked because he came back and apologized - our order hadn't gotten through to the kitchen!   BF swooned with hunger and I fed him some salad and he munched on a slab of his dad's pizza.\nQuickly after the error was discovered, we received appropriate amounts of apologies and the food came out within minutes.   Problem solved!  \n\nThe food was good -  solidly 3 stars and no complaint on the quality or quantity.   There was nothing outstanding and nothing was wrong -  I would have preferred spicier sauces, but BF's parents are not so into the spices (being British and all).  I think this is one of those places, like Rocco's, where the food is predictable and solid, comforting and filling.  \nI guess I'd go there again if I'm ever in the mood for pizza or with guests who are overwhelmed with SF foodie food and just want pizza, salad and straightforward Italian food with no scary weird California-ness.", "author": "Maria C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-04-13", "description": "I grew up on Haystack Pizza. This is one of the greatest family pizzerias around. They've been at the same location for over 35 years and still going strong!", "author": "Marty F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-09-18", "description": "I would have to say...mmm meh? We ordered delivery on a Friday night and it got to our home in 45 min-which was quite good...but the pizza was nothing really worth raving over. We ordered 3 personal pizzas: cheese (this one was the best as you really can't go wrong), bbq chicken (no thank you and won't order again..peeled chicken and really quite bland) and a chicken and onion (again, actually bland-despite the onion). I would say if you're looking for easy, simple and reasonable price -it was okay...but yah, that's it..just okay. (I ended up adding my own bbq sauce etc)", "author": "SLH H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-01-13", "description": "I have grown up eating at the Haystack and it never EVER lets you down! The best pizza in Noe and italian food to die for!", "author": "stephanie p."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-09-02", "description": "absolutely DELISH!!!\n\npizza, pasta, chicken, EVERYTHING tastes like home ;D", "author": "Astrid M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-04-26", "description": "I dined here last week with a girlfriend and the fams.  My kids wanted burgers and I wanted pizza. My vote was Gialini's and the girls wanted Barney's.  Split the difference - Haystack.\nI ordered Zorba the Greek and the Eggplant Especiale, both shared with my friend.  The kids shared a cheeseburger and pasta with cheese and butter.\nThe salad arrived first and I scarfed it down without a care while my fellow diners waited in agony for their own food to arrive.  The garden salad is satisfying, albeit cafeteria-like, with its canned beets and beans, romaine lettuce and tomatoes.  I ordered it with oil and vinegar, since on a previous visit my friend's request for \"Italian\" resulted in a slathering of creamy goo. \nThe pizza was delivered first.  My oldest whined for her burger while the littlest sucked up whatever morsels landed in front of her.  \nI'd ordered \"Zorba the Greek,\" and expected a purist combo of feta and bacon.  What was presented was a delectable burden of sausage, salami, pepperoni, onions and peppers - in addition to the feta and bacon which I thought I'd ordered.  \nMy friend and I whispered our shock, and then decided to speak up. We'd take it, we said.  But this wasn't what we ordered.  Still, we'd happily accept this mess of meat and cheese, onions and peppers. We were starving.  And we quickly served ourselves. \nWhen the server brought my daughters' burger and noodles, we told him we  were eating someone else's pizza.   But, that we didn't care.  He said that he had brought the right thing.  And said some other garbled things that we didn't understand. \"Yeah, right!\" We winked between us.  \"Sure.\"  Positive that he was just saying weird stuff to distract us from the botched order.\nMy girls happily slurped their simple white noodles and the youngest insisted on a serving of eggplant.  Neither was impressed with the burger, which my eldest described as \"overburned.\"\nI told my friend that I was gonna check out a menu, to prove that \"Zorba the Greek\" was supposed to be only feta and bacon.  I told her that I didn't want our server to feel bad, so I snuck outside to see the menu posted out front.\nDude was right.  Of course.  Stupid me - arguing with the server over the menu;  why do I always have to be such a know-it-all?! Zorba the Greek _was_ actually the #3 combo plus bacon and feta - the \"garbled\" explanation I'd chosen to ignore. \nWe thought we'd never eat all the food we'd ordered, but all that remained of our feast was one slice of Zorba the Greek.  Which i re-heated for breakfast the next morning.\n\nUpdate 05/27 -\nOrdered pizza for delivery last night.  Waited an hour, no pizza. Called to get an update - they said they were running late, and also having trouble with my CC.  Gave them my CC again.  Another 1/2 hour - still no pizza.  This time they said the driver had attempted delivery, but nobody was home.  I'd been sitting in the livingroom the whole time, feeding the kids potato chips. \nFinally called Noe Valley Pizza, and they were open and ready for my hungry family.  \nThis morning - not only had my CC been charged for the meal -  they actually charged me twice for the undelivered pizza!!!!", "author": "Kati K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-12-10", "description": "the only thing that makes haystack pizza better is going there on a rainy night with megan w and maria d and sitting in the biggest booth that they have (for a family of 10 but i don't care, the place was empty and i have a big ass so BACK OFF).  you can learn a lot dining with the hot ladiez of yelp.  for example:  urine is very clean and can be used as toner in the shower if you're uh, exceptionally frugal?  because damn, you can get some toner for like $1.99 at walgreens, you cheap bitch!  and b) the hilary duff/heather locklear masterpiece, \"the perfect man\" was actually written by a 12 year-old.  but if you saw the film (sorry, \"film\") you already knew that.  i totally just outed myself about seeing that film.  twice.  \n\nyou can also learn a lot about football.  seriously, megan w knows more about football than the entire new york yankees, los angeles lakers AND mighty ducks football teams COMBINED, okay???\n\nand you ask me how much do i love haystack pizza?  how much?  the correct answer is THIS!!!!! much.  (that's about as much as someone with asperger's syndrome loves a cassio keyboard, fyi.)\n\nP.S. YOU CAN ORDER ONLINE FOR DELIVERY!  that's right, you can order without even interacting with another human being.  THAT'S service.  i have them deliver to my house as it is two long (read: short) blocks to my house.  and what makes zucchini bearable?  you deep fry that fucker and nobody does it better than haystack.  NOBODY.", "author": "Laura B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-08-17", "description": "i'll make this review sweet and simple because the experience i had was also a 'turkey shoot\", uncomplicated...\n\nso, the decor of this joint is obsolete, but  they gratify you with their passable pizza which you could also have your pie in wheat dough and that is a perk! \n\na warm service was also demonstrated by our waiter which  made my dinner satisfying!\n\nthat is all folks!", "author": "Nelle A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-11-23", "description": "I like the place, as others have written it has a warm feel to it, a good place to have a pie and beers and catch up with friends. The service is decent, nothing great but nothing to complain about either. The pie is good, not out of this world or anything. The large pies are a bit undercooked in the middle, so I would recommend the medium, two of them if you are hungry enough. If your in Noe Valley and craving pizza I would suggest haystack, I wouldn't go out of your way to come here to eat though.", "author": "Bobby B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-06-03", "description": "This is our favorite Pizza place in SF. The pizza is always delicious and delivery is always prompt. Tasty pizza", "author": "Sean G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-07-26", "description": "My girlfriend and i were looking for somewhere you could actually sit down and grab some pizza and beers that wasnt a shady lil by the slice joint and after walking around 24th st. we found this place.  The service was a little slow to get acknowledged, but the food was good. I would go back next time i am up that way for sure", "author": "jamie z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-05-13", "description": "I can remember coming here as a small child, and last week I took my baby there for the first time- and she loved it too.  It's not a super trendy place, so if you're looking for that kind of establishment, it's really not for you, but if you're just looking to go somewhere to go, chill out and have some good pizza, this place is great.  The waiter was super friendly & attentive and one of the other waiters came by just to say hello to the little one.  Our pizza was out quickly, our drinks refilled as soon as they got low, and I believe the manager came over to check in and see how we were doing.  Love this place, love the pizza, will keep coming back.", "author": "L C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-11-10", "description": "I was in Noe Valley the other night in need of a yummy new place to have dinner and decided on Haystack. My boyfriend and I shared the bruschetta and a GIANT calzone filled to the brim with delicious cheese, meat and artichoke hearts. The service was friendly and prompt and the portions were fantastic. My only complaint was them blaring country music in the back of the restaurant. Not really the kinda ambiance I was hoping for!", "author": "Britney K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-12-10", "description": "I really like this pizzeria. I like that it feels so inviting, and it's a cool place to bring a group of friends. I've had about 4 kinds of pizza, and they were all delicious! I also like there customer service, they are not snobby! They donated a gift card for a charity I was working for! The only bad thing about this place is that it's a bit pricey, but it's worth it. There sauteed mushrooms are soooo good!", "author": "Gabriel T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-01-08", "description": "My husband & i were in the neighborhood one night and decided to try this place out - it was horrible, some of the most overpriced and greasy, tasteless pizza ive ever had. The place seemed pretty dirty too - there are SO many good restaurants and so many places where you get get an awesome pizza or at least one that is good - this isn't the place...skip it by all means.", "author": "Kimberly R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-04-08", "description": "Decent pizza, but holy smokes, are they expensive.  If they were 33% cheaper, I would give them 3 stars.  If you have bills to drop, then go for it, but for that money you could do much better elsewhere.\n\nI wanted to order a large pizza with 12 wings, and the price came to about $40.  Forty dollars?!?!  I was so shellshocked, I thought \"Umm, maybe that's just how much it costs these days\" and I just placed the order and hung up.\n\nI turned around and told my friends with whom I was watching football with, and they all yelled at me, called me stupid and forced me to cancel the order.  We went to Roundtable in West Portal instead for about $20 cheaper.", "author": "Stan L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-01-08", "description": "Hahaha. So, the last time I wrote about this place, I praised them because \"we seem to get the hookup as far as quick and accurate service.\"\n\nThe last time I ordered from them - which will likely be the last time I order from them - they delivered the wrong meal - mixing up the mediterranean pasta dish for the sandwich. This has happened before and I was conscious to make clear that we wanted the sandwich, didn't happen. Not a big deal - bit annoying, but mistakes happen. But while they agreed to send over the right sandwich, they also called me back to demand the original dish back. Which I just don't understand, really, Maybe if it was to ensure that we weren't trying to double up on them, that's understandable - although a bit frustrating to be so doubted considering our history with the joint. But if that's not the reason, what is? Shudder to think. Anyway, since this wasn't the first error and was a really awkward experience, I've pretty much decided I'm done with the place. They still serve serviceable food and will deliver, but the appeal was always in the service - and when that fell off, they fell off my radar.", "author": "Ian M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-10-13", "description": "wow. \n\n4 of us arrived here around 7 on a friday night. We sat down in the front booth. We're there for a minute or so and watch the busboy give menus to the table right next to us that had also just walked in. He then proceeded over to another table to clear it off and set it. Fine - he'll probably be over right after. Wrong. He then is sitting rolling silverware wrap ups. My friend had to get up out of his seat and walk the 5 steps he was away from us and ask for menus. He gets us 3. The waitress shows up 10 minutes later asking for drink orders. We order a pitcher of Pyramid....its flat. \n\nThe rest of the evening continues in this manner. The pizza was good. But nobody came to clear our plates when we were done so we were left waiting for the waitress to come with our bill with 2 big trays on the table. We finally had to get up and go fetch the waitress to give us our bill. \n\nThis place is getting 2 stars bc the pizza was decent and the prices were reasonable. Service was ATROCIOUS!", "author": "Megan M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-06-07", "description": "we got a hawaiian pizza. the pineapple had a weird taste to it, i am not quite sure what it was and it was in huge chunks :( the crust and ham were good. But i've def had better hawaiian pizza.", "author": "Olga S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-09-30", "description": "Came back again this september, I have to say, it was better than my last experience, I had a Calzone with canadian bacon, mozzarella, and tomato sauce. The crust was so good, and delicious in every way! Ofcourse this is where I discovered Anchorsteam, such a good beer! I wish they had it in Los Angeles", "author": "Antonio Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2005-08-01", "description": "The decor is very east coast, family run pizza joint, so naturally it gets the thumbs up from this homesick girl. Get the thin crust, new yorker pizza with an 8 dollar pitcher of Bud and you're set!", "author": "Maria D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-05-06", "description": "I'm not a pizza lover but my husband and i wanted to try haystack since it is by our house, and it was really really good we ordered a peperoni pizza, i don't know about the rest of the food since i haven't tried anything else....", "author": "veronica n."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2006-11-19", "description": "I havent eaten here that much. The pizza was really really oily which to me is kind of gross. Wasnt a huge fan of the sauce or the crust. Would eat here again if there wasnt a better option across the street", "author": "Carli M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2005-07-06", "description": "At 9pm, I felt a growl in my stomach.  I remembered some Yelpers mentioning Harvest has online ordering and stayed open late for Noe Valley.  I got online, ordered a personal spinach and artichoke pizza, got a called 2 minutes later, picked up the pizza pie 10 more minutes later, and ingested in under 5 min.  The pizza is pretty good, though doesn't compare to anything back east.  I'll definitely be hitting this place up again for the convenience factor.", "author": "Chris M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-01-17", "description": "We like garlic, and thank god....cause our pizza was very garlicky, and a little greasy.  But it was flavorful, and the place was comfortable.  We were thinking of giving it two stars (the service wasn't great), but admittedly...the pizza was tasty.  We got their house wine which wasn't great, but it was cheap, at least.  This place was ok.  Our experience was ok.  I wouldn't mind going back and giving it another chance.", "author": "Corey H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-12-25", "description": "I don't eat a lot of Pizza but when i do, I usually end up ordering from Haystack. The pizza is consistently good, with lots of options for toppings and combinations. Delivery is fast (usually 30-40 min) and the service is friendly. They store your address by referencing your phone number so repeat orders are a breeze.", "author": "Bumble B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2005-05-20", "description": "Pretty good.  Delivery seemed relatively prompt to the Duboce Triangle on a Wednesday night around dinnertime, and the Large Popeye (for $21.60) was tasty and covered with spinach and feta.  Some of the better pizza delivery I've had in the area.", "author": "Danny D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-05-29", "description": "Just okay.  Nothing terrible happened, but the pizza was below average on taste.  It was missing something, oh yeah . . . taste.  \n\nService was mediocre - slow.   Prices a little high.   I wouldn't return.", "author": "K V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-02-10", "description": "Haystack's the only place I order pizza for delivery. I get a personal mushroom pizza, light on the cheese. They tend to put on a lot of cheese, so if you like that you're in luck.", "author": "Christy K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2005-11-16", "description": "mmmm  good Pizza--though the place makes me feel like I'm eating in the back of an east coast bar from the 1970s--but maybe that's the point.  Seems like most people takeout so it was pretty quiet except for the TV above the bar.  The one thing I like about their pizza was that it was not greasy at all compared to other pizzas I've had.   Their New Yorker is pretty good.   Plus you can order online which is kinda cool too...ah its amazing what you can do these days.", "author": "Ed C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-02-09", "description": "i called tonight and ordered a pizza and the guy who answered the phone and took my order  was nice  and i read him my card information and he repeated it back and he said it would  be an hour and then  at six  thirty three i called and some girl answered  and she was rude and she said the card was declined and  the food gives you the runs  bad enough to  be taken to the hospital and she argued with my husband and i guess if you arent liked they black list you  well i took my business else where and guess what the card worked fine", "author": "jessica e."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-03-31", "description": "I arrived late one night with two friends after we had been running round moving a couch - we were hungry and thirsty and there before us, like an oasis in the desert  was haystacks - we were seated despite it being after 10:30pm and our server was simply awesome, he rushed me a beer like I was in medical need and then was really great in helping us with deciding from their vast menu. I know we were famished as we ploughed through 2 large pizzas without a word being spoken but the food was awesome. Quite honestly its the best pizza ive had in SF - making up for mistakes like bambinos and north beach pizza \n\nim truly a fan", "author": "Stuart g."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-03-15", "description": "I was highly disappointed with Haystack Pizza today.  I ordered 2-XL pizza for an office as a \"thank you\" gift two days ago.  I reconfirmed the order yesterday and today the pizza showed up 2 hours late dispite all efforts!  I will never order from there again.", "author": "Marleen C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-09-27", "description": "First they sent me a raw pizza. Then they sent me one where the sauce and cheese didn't meet the crust and the toppings were non-existent.  When I called to complain, the manager acted like a total jerk.  I told him, the customers who like your establishment tell 3 people.  The ones that don't post on Yelp.  I'm not touching that second pizza with a 10 foot pole.", "author": "Ruth W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-03-06", "description": "They have a really good ceaser salad and when you add grilled chicken, it's excellent.  a cute little place in noe valley, I'll have to try the pizza before i up it to 5 stars.", "author": "Caleb D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-08-09", "description": "Haystacks is just fine...not bad, not great but worth going and good enough to eat with a smile!", "author": "JR H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-08-21", "description": "Reminds me of my old college pizza place.  Reasonable pizza prices, good pitchers of beer and your favorite booth.  Open late-ish.  What more do you need?  The service is pretty good too.  I never order delivery as I live down the street but I hear it can take awhile.  Get the new yorker (just make sure whoever's with you is getting it too...garlic) or the pizza with feta, bacon and spinach on wheat crust (a T-street favorite).", "author": "Ann F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-05-03", "description": "The decor brings you back to a time gone by, and the food is not bad.  I actually like their pasta dishes more than their pizza, but that's neither here nor there.  This is a nice place for couples to bring their prospective date, since they could actually talk about the setting being from another era.  A good conversation starter in my opinion.  And the food has never turned my stomach, so I'm happy.", "author": "brenda b."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-06-23", "description": "I've come to rely on Haystack for consistently good pizza and pasta. I've never been disappointed by the food. My only minor complaint is that at times, the table service can be a little more attentive.", "author": "Juan d."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-16", "description": "Your run of the mill pizza joint with good ol' classic pizza.  No trendy thin crust or BBQ chicken pizza here.  Just old style, quality pizza - nothing special, but nothing to complain about either.   I like their Caesar salad, and we usually order a margherita or Mediterranean / Greek pizza.  The pizzas are big and filling.  The crust sometimes seems thick and doughy - not the greatest crust I've had.  But toppings are fresh and the traditional sauce is good.  We've eaten in the restaurant, and we've ordered take out as well.  The vibe in the restaurant is interesting - the waiter (also the owner??) is usually a middle-aged man wearing a black tux and dark glasses.  Are they trying to dress themselves up?  Not sure.  But either way, I feel comfortable in this ambiance, and I appreciate this place for what it is - a consistent, no frills pizza joint.  Much preferred over Goat Hill!  It's good, but it won't blow you away.  Next time I order pizza for delivery, it will definitely be a sausage and mushroom pizza from Haystacks.", "author": "Jenna C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-04-29", "description": "EWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWW sorry i have to say ewwwww , i had it the first time it was bad , decided to give it another chance it was reallly bad  and a friend of mine insisted to order again poor guy didnt finish his food  , i will not give it a 4th chance even if it was freee no thnks", "author": "NAEL K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-10-24", "description": "Pizza was bad, service was good.  We didn't even come close to finishing our meal because it was so bad.  We also ordered the artichoke dip appetizer and it was terrible.   In fact, I was convinced it was going to make me sick because it smelled so bad.   Bottom line:  We are still looking for good pizza in Noe Valley.", "author": "Roberta J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-12-29", "description": "I love Haystack for their wings.  They're not your ordinary wings.  No sticky messy sauce, just spicy crispy battered wings with lots of meat!  The pizza is on par with West Coast pizza, but maybe not suitable for the distinguished palette of a Bostonian.  They deliver, but it's also a fun place to eat in.", "author": "Josiah B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-12-16", "description": "Just arrived back home from our first trip to Haystack & we were really impressed.  The atmosphere was nice and casual/comforable, service was excellent & so was the food.  We ordered a large Haystack combo pizza - it was one of the best pizza's I've had in a while and the whole table agreed.  Just the right amount of cheese and toppings, toppings were very fresh, sauce was excellent and tasty, just moist enough and perfectly cooked.  We ordered the house salads first and they were pricey at 5.50, but large enough to keep us choming until the pizza arrived - all in all a very pleasant suprise tonight - we will be back.", "author": "Bradford A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2006-10-09", "description": "Update -- while their menu was tasty and delivery convenient, I can't eat there anymore after they food poisoned me.  At least there is Noe Valley Pizza right next to it.", "author": "Sam B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-02-10", "description": "I really like this place for both dinning in and take-out/delivery.   They are fast, pizza is great and they are not too expensive.  I have yet to try their pasta because the ranch chicken sandwich they have is great as well as their minestrone soup but I will, one day, venture towards some of their other entrees.", "author": "Sarah L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2006-08-27", "description": "I have been ordering from Haystack Pizza since the early 90's.  Most of the time the pizza has been really good with just the occasional \"off\" day.  I don't place orders very often any longer because I haved moved out of their delivery area (Miraloma) but I did try to call in an order to pick up the other day.  \nI have never been treated so rudely before when trying to give someone  my business....I placed my order and then asked if I could  add Feta.  The \"gentleman\" taking my order SCREAMED profanity at me and then hung up.  I called back a few minutes later and asked for a manager and was denied. ???????\n\nI can't even imagine how anyone could justify this behavior.  I might add that this was at 2:45pm on a weekday which I wouldn't think to be their busiest time.\n\nNEVER EVER AGAIN will I make the mistake of patronizing Haystack.", "author": "esme m."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2007-08-05", "description": "OK, I've only been in San Francisco for 3 months.  I tried to order online from Haystack pizza.  I reviewed their menu and site and placed my order.  Then I waited and waited and waited.  I finally got a call back an hour or more later saying they just got my order due to a fax jam.  They said I would get my order in about 20-30 minutes.  I said ok fine.  I get a call 5 minutes later saying that they don't deliver to my address.  I said well Im in one of the zip codes listed on their web site.  They then say well Im beyond the 16th Street limit.  Well it would have been nice to have been told this on their site first off and secondly when they called the first time.  Needless to say, I will not be going to their establishment.  Update your website to reflect your true delivery area, otherwise you will lose more customers like myself.", "author": "Louis B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2007-08-23", "description": "I had a decent late lunch with a laid-back middle-aged waitress. OK, I said, pizza is not soggy, nothing too special. \n\nBut a few weeks later I went there for dinner in a group of six - and it was TERRIBLE! \n\nThe waitresses were both very young (underage?) and rarely came to our table, and when they did, barely heard anything we requested. The table was not really big enough for six, but they did nothing to put smaller tables together or otherwise accomodate us. The waitress who set our table (with paper mat, fork, knife and napkin) literally put a table set ON THE MIDDLE OF THE TABLE. Did she expect one of us to get on top of the table and eat from the center? And she put an extra set right on top of another set. I told the waitress we didn't need this set, and she just smiled and walked away, obviously not interested in anything I, her customer, was saying. \n\nI had to go to the counter to order drinks, when a waitress appeared, looking pissed off, and told me to go back to my table. I went back, thinking she was going to take our drink order, but she didn't appear for another 15 minutes at our table. After a while we managed to put in our drink and food order, but got so little attention, it was clear these waitresses were either totally untrained or didn't care at all. When they brought in the pizza which took up the entire table, they didn't bother to clear away the salad bowl or plates - so we had to start discarding them on a nearby shelf/wall ledge ourselves. I mean, really. I haven't had service this bad in a long time.\n\nI don't really understand how Haystack uses inexperienced staff during their prime hours (this was Thursday evening). I know they've been in the neighborhood for a long time. Is this the owner's way of saying: \"We don't really care what you think of us, I'm minimizing labor costs with cheap inexperienced labor that I'm doing nothing to train them, and you can just go to the pizza joint across the street, because I don't really need your business anyway.\" \n\nWell, this is one local living in the neighborhood who will not be going to this pizza restaurant anytime soon. \n\nWhat's funny is, I grew up in the neighborhood, and I remember distinctly in 1985 going there in a group, and the waitress who served us was surly and unhelpful, too. Does the owner or manager just uniformly treat the workers there like crap, or something? Is that the \"Haystack tradition\"?", "author": "Randy D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2007-10-19", "description": "Poor service for sub-par pizza. \n\nTheir website allows online ordering, but please save yourself the headache and pick-up the phone. Having to hold down the CTRL key on my keyboard to select multiple toppings for my pizza would have been fine in the late 90's, but nowadays c'mon. \n\nThe pizza is extra greasy which makes for a quick exit in the morning. \n\nIf you look at their website for their delivery service area, make sure you consider that the delivery guy may be having a bad night and might not want to drive out to your house. IS your zipcode listed in the delivery service area? You just might call to find out that even though your zipcode is in their service area, you're just a little too far for their guy to drive. \n\nThis place is pathetic. Greasy pizza and sub-par cheese quality. \n\nGet in your car and goto Little Star. You deserve a lot better than Haystack barn pizza.", "author": "John D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-01-30", "description": "This place definitely has great pizza ....but the best thing I've ever had here is not pizza, but their hamburger, which is to die for. No preformed packaged patties here, the burger was melt in your mouth delicious with all the trimmings and wedge fries. Yummy!", "author": "Suepattra M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-07-11", "description": "HayStack Pizza is the most heavenly Pizza around SF.  The business is family owned and they are the warmest people I ever met in a pizza place.  Not to mention the delicious most addicting pizza... I recommend the delightful Zorba with loads of feta cheese, sausage, mushrooms, bacon and onions and bellpeppers. Or the just try the Haystack.  You can order online and they deliver with a smile usually within 30-45 min.  Well worth my time anyday!!!!  TRY HAYSTACK PIZZA SOON!! Let me know how you like it!!!", "author": "Jacob K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-02-15", "description": "Ahhhh it's a shame because I really like the people at Haystack, and I have really tried to like the pizza here because it is my neighborhood joint, but every time I try, I fail. The pizza is just kind of \"blah\" the crust is too thick for me (even the thin crust) and it is generally soggy and greasy. Salads seem out of the bag and prices on everything are too high in my opinion. I wouldn't avoid it like the plague, but if you have the option, go somewhere else.", "author": "Tara T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2005-08-28", "description": "Good, solid, dependable food in a restaurant with a comfy 1970's rec-room atmosphere.  I stopped in for lunch alone one weekday afternoon and they seemed both surprised and delighted that I wanted to eat there. Quite nostalgia-inducing.", "author": "Jude F."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2005-12-17", "description": "Online ordering is pretty sweet... but my Popeye pizza was just kind of gross.  I think I prefer Extreme Pizza over this... and as we know, Extreme isn't that great to begin with.  But at least your pizza doesn't come from them bathed in grease.", "author": "Nat K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-06-14", "description": "Haystack is Noe Valley's best bang-for-your-buck when it comes to pizza.  I used to chow down here on a weekly basis when my last ladyfriend and I were finished  imbibing for the night.  We'd be hungry, buzzed,  and looking for a  late-night place to stuff our stomachs to near capacity.  Whenever we were in this mood, Haystack always fit the bill with a quiet dining area, quick and polite servers, and a humble pizza-parlor like vibe that's accented with just the right amount of tablecloth-and-napkin dignity.\r\n\r\nWhen I'm sans-date, I always order a 3-item small and walk over to pick it up. It's usually ready when I get there, but a small bar makes for a great spot to chill with a beer when I've jumped the gun and showed up early.  When I'm with the lady-friend we usually dine on-premises, splitting a small \"Old Macdonald\" pizza with a house salad while washing it down with a carafe of cheap wine.  The pizza's thicker than normal, the toppings are generous, but the crust is a bit on the chewy side.  The house wine is pretty decent, and the always-fresh Salad is one of the more rockin' deals on 24th Street. We've ordered \"Luigi the Italian\" with Pesto and Garlic, and it's been pretty good too.  The regular combination is an excellent crowd-pleaser, and those who pine for pizza from the East Coast  will appreciate the \"Native New Yorker\", a  thin-crust specialty with a tomato-basil sauce and devoid of toppings. \r\n\r\nTwo tables near the windows give a view out onto 24th Street.  If you're in a big group, large oval-shaped booths with cushy upholstery make for a great gather-around seating arrangement.  And while the front room rarely fills up, a larger area towards the back is available for overflow seating, banquets, or private parties.\r\n\r\nIf you search San Francisco far and wide, you'll undoubtedly find a better pizza.  And if you're willing to brave the drive, the line, and the wait at Zachary's or Little Star, be my guest.  In the mean time, I'll be walking through the front door of Haystack and sliding into my favorite table.  Not long thereafter, I'll have a menu in one hand, and my beverage of choice in the other...", "author": "Mike W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2005-11-17", "description": "when i want some pizza delivered, i call this place... i've never actually been to the restaurant and dined though... so i hope it's a clean place that values good hygiene...\nanyway, their veggie pizzas are good... i like artichokes...\nmeat pizzas are tasty too...\ni like their thick crusts...", "author": "charlotte s."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2005-04-14", "description": "Suggest pizza to me any time and chances are, I'm up for it. I just love pizza.     Since moving to San Francisco, pizza has become quite a staple for me: it's relatively cheap and it's convenient since most pizza joints deliver. Yet despite my affinity for pizza, I recognize that not all pizzas are created equal. Once in a great while, a really special pizza place comes along and really shines all above the rest. THE pizza place in SF is Haystack Pizza.  Read more here: http://www.ballyhoo.us/restaurants/review.cfm?review=31", "author": "Baochi N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-02-12", "description": "Oh man, so good.  I came here with a group of 25 and we all had really good pizza and beer.  It's a tad dough-y, and I never saw a check, but I'd definitely come back here.", "author": "Cody G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-01-25", "description": "This is a pretty bodacious spot to get some pizza, not only do they use feta cheese on their pizza, I mean how crazy and delicious is that, but their XL pizza is called a freaking Wagon Wheel!! That alone should be reason enough to come here every night for pizza! \n\nBut be careful, there are some items you dont really want to get off the menu, like.....\n\n\nlike,\n\nlike NOTHING!\nEverything is pretty bomb here, but the pizza is the most bada** item of all.\n\nIn all seriousness here people, Haystack Pizza is a fine establishment of very hard working people who want to give you delicious food at a affordable price.\n\nThey should be in Hayward too though seeing as their name is haystack.", "author": "Dale E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-14", "description": "What you see is what you get! Simple and old fashion San Francisco fare. No, this will probably not be on any of the Food Network shows, but the food is good, moderately priced and delivery is quick! Love the minestrone and anti-pasto with their creamy Italian dressing.  The owner walks around to check that everything is ok. Nice.  On a recent delivery, they left out the mozzarella on the salad. I made a call to let them know and the delivery person was at my door within 5min with a container of full of mozzarella. Great customer service!", "author": "Queenie O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2005-04-16", "description": "gotta try their pesto thin crust.  Yummmmm!!!", "author": "Sydney L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2005-07-16", "description": "Stepping into Haystack Pizza is like stepping back into time into the 1970s, or at least like traveling to a landlocked state, what with its 1970s Western/cowboy decor. My dining companion and I had the medium New Yorker pizza for $12. Described by the menu as \"thin crust with cheese, garlic, and oregano,\" it was wet yet chewy, and very enjoyable. I haven't had pizza like that since the 1980s brought us \"wood-fired.\" With a $10 half bottle of wine, it was a cheap fun dinner.", "author": "Amy E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2005-08-16", "description": "The place I usually order pizza from. Favorites: The Alexander and The New Yorker. Good stuff. Thank you.", "author": "Zell C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-04-26", "description": "Haystack, you make me fat.  But I still love you.  This place delivers the tastiest pizzas super fast.  Chewy, not too thick crust, lots and lots of fresh toppings, and loads of stretchy cheese.  What's not to love?", "author": "Helen C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-06-13", "description": "Convenient online ordering, and since it's in my 'hood I get super quick delivery service. The Mediteranean was a yummy garlicy veggie choice with a somewhat doughy medium thick crust (though I'm much more of a thin crust type). This place'll do in a pinch for my pizza cravings. Maybe I'll try one of their huge salads next time.", "author": "Rachel R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-09-02", "description": "Had a killer pinapple and ham pizza there tonight.  The service was alright, albeit a little slow with the refills on the water, which is the only thing that keeps it from gettin that last star.  It had that neighborhood hideaway feel that I miss living out in the 'burbs.  The friend that brought us there is a Noe Valley local and swears by this place, and I have to agree, they make a mean pizza.", "author": "Jennifer D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-12-24", "description": "This is a great little pizza place in the heart of Noe. You can go with a large group and sit in a booth or go as a couple.  The staff is sweet and helpful.  You can get wheat dough if you like and pick from a variety of toppings.  Overall it was a yummy place to spend a Sunday afternoon.", "author": "Anita T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-07-03", "description": "I've been a customer for a long time. Lately, most orders have been delivery, and we've ordered pizza and salad almost religiously since moving to a not-so-hard-to-find apartment on the east slope of Twin Peaks. The guys from the Chinese restaurant can find us with no problem but the delivery guys from Haystack are often dolts. One chubby Hispanic guy has been downright rude and insulting. So if your place does not involve multiple units and an elevator, try someone else. Or, eat at the restaurant. The food is worth it.", "author": "Lucas M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-07-03", "description": "Hella Good!!!  Zorba the Greek is my favorite, and my friend says the pineapple and ham (Hawaiian style) is the best in the city.  The ambiance is nothing special, but the pizza can't be beat.", "author": "Marc C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-10", "description": "When i feel like getting a pizza, I would order from Haystack and do a \"pick-up\". This way I know it's straight out of the oven and hot (I'm right around the corner from them). I've been getting pizza from them ever since they open. They are one of my favorite pizza place in S.F.", "author": "Steven J."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-11-06", "description": "We ordered $65 worth of food on Monday night and the food was dull and unseasoned. We thought we'd try their pastas and soup. I feel like they need some cooking lessons as I could have made better food than the stuff we got. I am also going to call today to let them know my thoughts. We will never order from this place.", "author": "Leeshawn N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2005-05-31", "description": "um .. tastes like Straw Hat pizza?   \r\n\r\nThumbs UP:  Delivery service and it is open late (for Noe Valley) \r\nThumbs DOWN:  Haystack needs to consider that pizza may have evolved in the past 30 years.", "author": "Jeff C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-05-02", "description": "I haven't found an AMAZING pizza place in the city yet.  However, Haystack is as good as it gets for me.  They deliver to our house.  They are quick.  They are good.  I really like their pizza.", "author": "Eric S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-06-16", "description": "We weren't feeling going out. So we ordered Haystack and I have to say I love that crust to death. It's good and thick and crunchy like a baguette. I like that the sundried tomatoes weren't oil-soaked.\n\nYuppie pizza, Heather called it. I'm not sure why.  Was she referring to the advent of sundried tomatoes as the gourmet ingedient du jour in the 90s? Wouldn't that be retro yuppie pizza?", "author": "Debbie K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-06-01", "description": "worst pizza I ever had, order a thin crust which should been called no crust. No flavor, I think I could make a better pizza with a microwave. \n\nthe prices online aren't the same as the price at the restaurant. \n\nThe people there are slow, how long does it take to get a bill!!! Do you want to get paid or what. \n\nWould not recommend to anyone.", "author": "chieh h."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-01-29", "description": "I've been going to Haystack since I was a kid and they still have the same red curly-haired waitress that used to serve us when I ate there with my family.  They renovated this place a few years back but for the most part it's the same old place.  I love Haystack's pizza but they also make a great meat lasagna.  I prefer to eat in at Haystack rather than get delivery.", "author": "Timmy C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-07-22", "description": "Got delivery from here.  Won't comment on the time it took, since we called on a hot Friday night at 8pm.  I imagine they were really busy at this time.  We got the New Yorker, which is a Thin crust with cheese, garlic & oregano and The Joly Green Giant, which has Broccoli, zucchini, fresh garlic, onions, mushrooms & tomatoes.  Both were good, but the New Yorker was our favorite.  It was really good pizza, and we will be ordering from here again!", "author": "Pele N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2007-03-07", "description": "yay for online ordering. \n\nhowever, my pizza came with a receipt that included my address and FULL CREDIT CARD NUMBER. thanks, haystack, for giving someone all the information they need to rip me off. much appreciated and unbelievable. if I could leave a zero star review I would.\n\nwon't be ordering from this place again.", "author": "Jen B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2005-08-02", "description": "I never tire of Haystack's Alexander pizza.  No better way to recover from a hangover.", "author": "P-Rock F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-12-29", "description": "If there is a place in the city that I love but don't get to enough it is Noe Valley. It is so charming and full of tiny little boutique shops. Now I am not sure if my review of Haystack is completely legit because I have not actually had the pizza here but I have heard it is decent. What my boyfriend did introduce me to here is the sauce-less buffalo wings. They still have the same kick as good buffalo wings however they are not as tangy...I love the tang! They are great because you don't go through 42 napkins as your eating. If you eat in you get to enjoy the eclectic saloon ambiance.", "author": "Sugey G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-04-19", "description": "One of the best places for a pizza when you're looking for something more than just bread a cheese.\n\nWe love this place.  The \"Cleopatra\" with eggplant, sundried tomatoes, and feta is a favorite as well as the \"Haystack\" which has everything on it!\n\nFamily owned, family operated.  Great local joint.\n\nGood for dine-in and delivery.", "author": "Liz T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-10-27", "description": "It's good.\nIt's convenient.\nIt's fast.\nIt's not expensive.\n\nL.\n\nPS: try the cleopatra  ;-)", "author": "Lewis G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2006-03-15", "description": "I love pizza.  If pizza was \"good for you\" I would eat it every day.   Unfortunattely, it is not at all \"good for you\" and therefore I do not eat it very often.  So, when I DO order pizza, its a bit of an event.  Despite the glowing reviews, I was NOT very happy with this pizza.  It took over an hour and there was practically no sauce.  The topping were good but crust was chewy and we didn't eat what didn't have toppings on it.   The crust made the leftovers nearly impossible to eat. Maybe it would have been better with extra sauce?  But for the price (not cheap!) and the lack of service and the chewy crust--I'm going to try someplace else next time.", "author": "Adrienne G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-10-02", "description": "I haven't written a review on here in over two years but I was very compelled recently to write a review in regards to the \"hot garbage\" recently that over delivered to my house.  Haystack has really got down hill and it's a bummer. Been eating there for over five years.  I ordered my usual thin crust pepperoni on the late night, as they, \" used to\" have this pizza in order.  I recieved the pizza and there were a total of five pieces of pepperoni on it and the dought was soggy and wet, literally.  Wow, now that is bonified disgusting.  I called them back to complain regarding what I did not order and they proceeded to tell me I didn't order this pizza and was wrong.  When I questioned this, I offered to show my receipt and was insulted by, \"Dino\". This guy is a real piece of work to say the least and he supposedly runs things there.  Wow.  Don't go there.  If you're paying premium sf prices, you should get a beyond decent pizza right? anyway, fuck that place, guess I'll just order dominoe's next time, haha.", "author": "Zach H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-10-17", "description": "GREAT pizza, especially with the whole wheat crust.  I like the topping selection, though they could have some more authentic italian toppings like proscutto and pancetta.  I don't know how the delivery service is, since I am just a couple blocks away.  The bottom line is, the whole wheat crust really make a huge difference and Haystack is our go to pizza place.", "author": "Ken H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-08-28", "description": "i LOVE this place,\n partly couse i grew up on this in noe valley, mostly couse its amazing pizza.\n\nI kinda have a pizza fetish, and when I try new places i get the same combo( pep, mush, olives)(dont bite!) just to see if the place i try makes that combo as good as the one i get at haystack!", "author": "rae m."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-12-09", "description": "This place totally exceeded my expectations. Was expecting an old school, minimal option pizza joint, and while it was old school, I was very impressed with the customization. Plenty of veggies to choose from, and the mini size was just right not to feel like you're overdoing it, but still filling when partnered with a salad. Like Matt W. wrote, the topping did feel generous. I wish the wheat crust was offered on the mini, but that's the only negative. Service was super friendly.", "author": "Jason B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-08-20", "description": "I've never been to Haystack but get delivery from them pretty often. I usually go for the calzone and it's always good and delivery is always fast .", "author": "Travis V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-06", "description": "I order delivery from here all the time.  They'll make a thin-crust that's not so far from New York style pizza that I really miss.  I've walked by the place and it seems like it has a fun, pizza-parlor kind of atmosphere.  The kind of place you'd take your kid's little league team after they won a big game.", "author": "Jimmy C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-02-08", "description": "decent pizza. it was good enough to satisfy my pizza craving but i can't say i'd purposely go back. it probably didn't help that they were playing honky tonk country music in the back room.", "author": "Regina C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-05-29", "description": "Another awesome Friday night with great movies and great FOOD!  Haystack is the best pizza and has really prompt delivery - which does not always happen in SF!  Their customer service is rock solid and again - the pizza is great; esp. with extra sauce!!!!", "author": "Craig L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-02-01", "description": "i ordered pizza to go a few times when i first moved to noe valley.  each time the pizza was the same:  pretty garlicky and tasty but absolutely DRENCHED in oil.  like a puddle of oily water in the middle of the pizza.  it was ok the first time when i was drunk, kind of gross the second time when i wasn't drunk and thought maybe it was a fluke, and totally yucky the third time when i realized that, that's just how they make their pizza.  i think i'll stick to escape from NY.", "author": "Natalie H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-10-09", "description": "Popeye The Sailor pizza (pesto, spinach, onions & feta) = Delicious!! I always get delivery so I can't rate the service.", "author": "Laura B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-09-20", "description": "Haystack ain't fancy, but it certainly has its place in our dining circuit.  Sometimes, you know, you just want an inexpensive, uncomplicated pizza-- the kind you might have scarfed down beside the neighborhood pool as a kid in the 'burbs.  This is that kind of comfort food.  I can't speak for the rest of their menu, but the salads are fine and the pizza has a pleasing cheese-sauce-crust ratio.", "author": "Emily D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-11-03", "description": "99% of my visits to haystack are for take-out.  consistently great traditional italian fare (it's no gialina's), haystack has become my go-to spot when i gotta get some 'za. in particular the popeye pizza (spinach, feta, etc..) is sooo good!! and i usually order a side of fries (incidentally- best restaurant fries in town!!) which i am unable to do at the pizza place closest to my house.\n\nthe service and pricing are fair.  parking in the neighborhood can be rough but unless there's some kind of extreme circumstance, added delivery time (and resulting impact to the food) rarely justifies the service! the ambience of the in house dining is not my favorite- somewhat dimly lit and 'old' (looks and feels almost exactly the same as it did when i ate here as a young man 20+ years ago!).", "author": "Jay J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-02-04", "description": "I've been going to this place for years. LOVE IT!! One of the best pizza places I've ever been to, its definitely a must. Every time I'm back in the city I have to make a stop for pizza and fried raviolli, or lasagna and garlic cheese bread. Service is great, food is wonderful, its clean, and if you're into people watching the window seats are fab. if you're in the are give it a try. I'm sure you'll love it too.", "author": "Tati C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-02-15", "description": "if you're ever in a group or family situation where everyone is arguing over what style of pizza they want for dinner, i suggest you take them to haystack. it should suffice most, if not all, of the group or family members. haystack has been serving good old family style pizza for over 30 years. so they clearly know what they're doing. my favorite is #3 (haystack combo). it's fabulous and quite comforting. kinda like family can be sometimes... while you're waiting for the pizza, be sure to check out the native american and western inspired decor. you almost want to change your name to \"howling wind\" or something.", "author": "frisco j."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-01-03", "description": "One of the best neighborhood pizza delivery places. Their pizzas have great toppings and crust and for those of you in the mood for something else there are plenty of other options.  Those that dine in will find the place very comfortable and laid back.  The service is courteous and prompt wether sitting down, picking up or getting delivery.", "author": "B B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-02-23", "description": "what's up with the decor here? i just went there last night because it was the only thing open at 10:30pm...but judging by all the reviews, i think delivery is the way to go at this place. the meatball sandwich i had was pretty good, but nothing to rave about. i think i might try delivery next time.", "author": "eve l."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-12-04", "description": "decent pizza and other dishes. the service is good, i've had times when it was slow but with a beer and a game on the tv it was fine. request a chicken pizza with only pesto (no tomato sauce) and its money...", "author": "Katie M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-07-09", "description": "my gf used to go here alot in the past and then stopped.  on a whim she decided it was a good night for pizza and since i love pizza, who am i to complain.  she suggested Haystack because they have wheat pizza crusts.  we ordered the Zorba the Great or Greek..  but we changed the toppings. we decided to substitute the bell peppers and onions for eggplant and spinach.  the pizza was really good for a wheat pizza.  the only other pizza place you can get wheat is at Blondies that we know of.  the only problem we had was with the service. it takes them quite a bit of time to remember to refill your drinks or give you a check.  other than that, i recommend Zorba the Great with Wheat Crust.", "author": "ed c."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-10-20", "description": "i think this place makes pretty good pizza. i like the thinner kind of pizza, which is yummies. i almost remember that the pesto here isn't bad either. I like that it isn't too greasy, and not too expensive either. the people that work here are usually pretty nice. it's a very cozy, what i think may be family owned place, or at least it seems that way. i came here a few times with friends and family, all in all everyone was pretty satisfied. although, i do recall trying to get a job there, and never getting a call back  -_-", "author": "Casey Z."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-07-11", "description": "All dough and no flavor.  More like a bagel than a pizza.  I don't know why it is so hard for Noe Valley to have good pizza.", "author": "Zack S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-12-13", "description": "This place has definitely gone downhill. Must be the economy but they now charge for bread, plus their soda glasses have shrunk to the size of a water glass. Those water size sodas will now cost you $2.50. Food is still good but the service has gone downhill too. I'm not sure if it is a shortage of staff but the service is too slooooow.", "author": "Benzee B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-01-14", "description": "Actually 4.5 stars -- four stars for the in-house experience; five stars for the pizza. I didn't have a bad experience eating at Haystack. Chicken sandwich was OK (not great) and the service was fine. But the story here is the pizza. Can't even try a second kind because we hit the jackpot right off the bat (cheese pizza, no sauce, with ricotta). Amazing! Best pizza in Noe Valley.", "author": "andrea a."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-11-24", "description": "just ok.\n\nthe service was by far the biggest issue.   my waiter was not friendly and hardly responded when asked questions.  i got an entree with sauce on the side.  the sauce came ice cold in a cup that was cold (so the waiter had to know this).  i had to find the waiter to ask for it to be heated up, for which i got a groan.  15 seconds later he is back~~as you can imagine not heated at all--still ice cold.  i gave up on the sauce at that point.  \n\nmy drink came with tarter/cocktail sauce all over it.  kind of sloppy and gross.\n\nthe food was pretty decent which is why i gave 3 starts.  would i go back, potentially, would i rush back...no.", "author": "n. h."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-07-31", "description": "pizza was pretty good. \n\ntook a while \n\n\nand the service was a little eh... \n\nat one point the people working there started seriously arguing fairly loud infront of everyone. \n\n\n\nbut its pizza, i dont expect much. \n\ni liked it .. .however my friend spent the rest of the night in the bathroom..\n\n\nbeware of mushrooms maybe.", "author": "R M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-03-29", "description": "This is a good local pizza place. It's nothing to write home about though.", "author": "Andy F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-08-17", "description": "Great pizza, great salad, good service...the owner makes you feel welcome. Inexpensive...homemade sausage...yum...the negative reviews are unfounded...their pizza tastes belong to pizza hut, round table, and domino's...", "author": "SFNATIVE K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-09-15", "description": "Pizza was just okay.  The calamari was awesome though!  Very unexpected.  The caesar salad was a little better than just okay.  Prices are good.  Service was pretty good.  All in all, it was an okay place to go if you're in the neighborhood and don't feel like walking over to 29th for Front Porch.", "author": "Jo M."}
