{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-27", "description": "I have been going here for 10 years now \nThere is a reason for that !\nLesley and her team do a fantastic job and we are lucky to have them here on potrero hill", "author": "James C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-09", "description": "Hazel's put some sort of meat on my tofu melt... As a lifelong vegetarian, that would be frustrating on it own. After the fact I found out that they have done that to one of my friends 3x.\n\nYou would expect a restaurant to be a bit careful with a tofu melt to not put meat on it. Its a shame because the previous occasions I had eaten there it was delicious.", "author": "Doug H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-27", "description": "Hazels is a solid sandwich spot. A potrero institution. Leslie (owner) is awesome and all the people who work there are super nice. Food is good - sandwiches and some burritos / bagels etc \nEverything always very fresh.", "author": "David G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-09", "description": "Thanks Leslie for the offer! I'll make sure to come by and try it again but no worries on the free hook-up. Updating my 3-star to 4 for prompt follow up and great business practice. Will update to 5 after great steak sando ;)", "author": "Patrick A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-09-08", "description": "Great place with a good and tasty food. However, staff faked my signature and applied their own tip. Not cool, regardless of the amount.", "author": "Chip S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-03", "description": "Closes when they wish, not according to schedule. Previously perfectly fine food. If you close at a different time consider updating your hours.", "author": "Trent W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-12", "description": "Solid sandwiches, breakfast bagels, and breakfast burritos. There's limited seating outside, so take it to go! It's fast and tasty, and the service is incredibly friendly. A Potrero Hill gem.", "author": "Christina S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-22", "description": "Well, we were in the area for Plow, and after waiting for 1 hour we walked to Hazel's, and boy where we glad we did! \n\nWe had 2 bacon egg and cheese and pancakes.... the sandwiches were perfect.... with a good amount of bacon....and eggs cooked to order, super! \n\nWe also had the pancake...... his exact words, \"There are very light\" and enjoyed them very much.... \"no butter needed\".. \n\nGreat job Hazel.... draw back.... seating..... can you create more seating.... then you can have the last star.....", "author": "Al L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-13", "description": "If you want a fast, tasty, and relatively cheap meal, Hazel's Kitchen delivers. I've loved every new thing that I've tried so far and hope to try everything else one day. Each sandwich is carefully designed for a unique combo of flavors and there are even some customer-submitted sandwich combos you can try.  Compared to the sandwich shop on 3rd, it will be less sub-like but the ingredients come together better. They sometimes toast the meat slightly and it really adds to the sandwich. \n\nMy favorites: \nChicken pesto: The chicken was a little dry and tough but it was such good blend of ingredients. Melted cheese is also one of my favorite things so this sandwich was a winner. \n\nJuan's special: sweet, saucy, spicy, bacony, and full of flavor\n\nBreakfast burrito/scramble: lots of flavor, variety of ingredients, slightly juicy, and filling enough for you to not overeat. \n\nHaley's special: I don't even remember what was in it, I just remember enjoying it a lot\n\nNot so favorites:\nSoups: Pretty hearty but not a huge fan of them; tastes a bit out of a can for me\n\nAll in all, great vibes from the server and the shop itself.", "author": "Lydia Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-06", "description": "Very small place, but the sandwiches and breakfast burritos are really enjoyable. Very good place if you want a quick breakfast or a small bite to eat. Nothing is too expensive either.", "author": "Anmol J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-02", "description": "Best. tofu. melt. ever. After reading the 1 star reviews I wanted to try it, and... you cannot go wrong. It is the best in the city.", "author": "Winter M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-05", "description": "Go here and eat the chicken melt on Dutch crunch.  It's kinda like magic.  Simple tasty magic", "author": "J B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-09", "description": "I ordered bagels through Postmates and not only was it super fast but super fast. \n\nI ordered the sun-dried tomato bagel. Sounds super simple but it was definitely one of the best spreads I've had in a while. \n\nI can't wait to try everything else on the menu", "author": "Tatiana G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-24", "description": "Amazing service, ambience, and delicious food! The hospitality was warm and seamless. I can't wait to come back for more beignets", "author": "Melissa B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-12", "description": "This place is amazing. Good food and very welcoming. I would definitely recommend and come again", "author": "Adena E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-08", "description": "The best tuna melt in the city. Quick, simple, and delicious sandwiches. Neighborhood favorite.", "author": "Jordan D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-08-09", "description": "There for lunch today.  The sandwich I had (turkey/cranberry) was good, but nothing really special.  Service was great.", "author": "Linda R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-23", "description": "Cool place to grab a sandwich or soup to go. I like to drink at blooms across street and when I need to fill my stomach real quick I'll walk over there and grab a turkey sandwich with sourdough bread. It is really good and quick. There isn't much seating so it's a to go spot I would say.", "author": "Mark P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-26", "description": "Delicious cooking at affordable prices. Everything on the menu is great. Highly recommended.", "author": "Ron B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-21", "description": "Great neighborhood spot with tasty sandwiches! Fast, friendly, and a great member of the community. The shop is fairly small on the inside, but they have some outdoor space to eat and chill.", "author": "Andrew M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-07", "description": "Working at the bottom of Potrero Hill (17th and Missouri), going to Hazel's Kitchen meant going up that big hill. I know, it's only two blocks away, but that hill is just so daunting!\n\nWhen my coworker discovered this place and told me about it, I was skeptical about going so far for a sandwich. Then, I went. It was definitely worth it! The sandwiches are amazing, a bit on the pricey side, but amazing nonetheless. \n\nFrom the outside, it looks super cozy with outdoor seating and a very chill interior. The sandwiches are all made right behind the register, and you rarely have to wait. The line does get long as people from around the area trek here on their lunch breaks.\n\nI always ordered the tuna salad or steak melts. The sandwich is enough to fill you up and still have some food leftover. I definitely miss working near the area.\n\nFood: 9/10\nStaff: 9/10\nAtmosphere: 9/10\nValue: 8/10\nOverall: 8.75/10", "author": "Evan K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-03-12", "description": "It's okay. Small neighborhood joint for breakfast and lunch (only a couple bar stools for sitting) yet they don't have coffee... a handful of vegan options, including tofu in some things. Parker cafe next door has really expensive small coffees.", "author": "Michelle G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-24", "description": "Amazing sandwiches!! I had turkey pesto sandwich and it has been several times that i have tried this place. Each time i had the best sandwich ever. Super fresh super tasty!", "author": "Evin B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-11", "description": "Hazel's is great. Wonderful local spot, quick and delicious. Favorite is the chicken melt, but have enjoyed everything there. Sometimes a crowd around typical weekday lunch hours (12:30ish), but never an issue. Grateful to have a spot like this in Potrero Hill.", "author": "Wilson L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-14", "description": "The food here is great! Staff was friendly and attentive. It's a very small comforting dinning place and we got there just in time to sit in there. I got the egg scrambler  (asked for egg whites only) they accommodated :) \nMy sister got the breakfast burrito, she said it was amazing! My niece got pancakes and eggs, she devoured it in about 5 minutes. My boyfriend got the chicken melt, I had a bit and it was perfect!", "author": "Solmayra M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-21", "description": "Holy cow: best egg scramble, anywhere, and the price is right! Cute, little, hole-in-the-wall place. Cheap, clean, freindly staff. What's not to like?", "author": "Steven P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-20", "description": "We get Hazels delivered from with Postmates quite often to work and they never fail to impress - very quick delivery too. \n\nI recommend ordering with a friend and splitting 1x Grilled Chicken & 1x Grilled Steak Melt. Absolutely Delicious. The lunch burrito isn't half bad either.  \n\nGreat Work Hazels !", "author": "Paul B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-17", "description": "Had planned to eat at a nearby cafe, but the wait was over an hour and half, so I got searching on Yelp and found this cute little Kitchen. Took a stroll up the road and from the minute I walked in I knew it was going to be so worth it. My partner and I both ordered the Chicken Melt sandwich - super tasty!!! The whole experience was extremely satisfying :)", "author": "Carol Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-14", "description": "Amazing! Really cute place delicious food. I just got the Caesar salad which doesn't sound exciting but I really was, lots of homemade spices, and the steak on it was great. Outdoor seating with a small indoor counter. Would definitely come back here for a quick or long lunch.", "author": "Luke K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-17", "description": "Hazels makes the best damn breakfast burrito. This isn't a corporate burrito full of cheap fillers like rice and undercooked potatoes. This is the delicious real food breakfast burrito that you would make for yourself if you had the time and energy. Sooooo goooood.", "author": "Meg G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-17", "description": "We stayed at an airbnb near hazel's kitchen and came here due to the rating. we def did not disappoint.\n\nOn a Monday 9am breakfast time, we are a group of 4 and we were able to sit down and had a nice sandwich. Where do I begin? Hazel's kitchen is hipster yet cozy to settle down. Genuine service and fresh ingredients. Wait time wasnt too bad after ordering, I would say maybe 5-10 min. My friend got a smoked salmon sandwich, she received a generous amount of smoked salmon and it was so fresh and so tasty. While we are enjoying our sandwiches, we see customers coming in/calling in and it is obvious that every one just loves this corner sandwich store.\n\nPoint to note, Hazel's Kitchen does not serve coffee but if you are craving for one, the store next to it has some really nice coffee.", "author": "Vivian C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-27", "description": "I needed a last minute emergency order to feed 30 people, and Carlos and the whole team were absolute champions. Helped me with all my orders, made excellent suggestions whilst under a time constraint, and were extremely flexible and overall just made it happen! Not to mention, the sandwiches and salads were positively delicious. I will definitely be back.", "author": "Pearl W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-16", "description": "What a neighborhood gem! I usually customize my own bagel so I end up with a breakfast bagel. The people are SO friendly and remember you (assuming you're a local or come often). It's located in such a cute area that you can't go wrong eating here after you grab a coffee from Farley's next door.", "author": "Cheri C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-22", "description": "These sandwiches. What can I say? I think the chicken melt is my favorite sandwich in San Francisco. The place is adorable, and the service is always friendly and fast. And before or after you can enjoy some beautiful Potrero views! Win win.", "author": "Piper A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-10", "description": "It's a very cozy place with nice outdoor seating. The food is delicious with pretty normal portion sizes and very personable service.\n\nI visited on the weekend for a relaxed breakfast and it really fit the bill!", "author": "Russell P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-20", "description": "Stopped by for breakfast. I got sandwich 5a (avocado, cucumber, sprouts, tomato, garlic hummus) on Dutch crunch bread. It was fresh and absolutely delicious! Definitely a local business to support!", "author": "Joy L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-10-27", "description": "Caesar salad was deeply disappointing. Came pre-packaged and the dressing was straight out of a bottle and tasted like mayonnaise. \"Rare\" roast beef sandwich was more like a *grey* roast beef sandwich. Upping from one star because I will admit they're fast...But I'd be happy to wait for better quality food. With so many other options in the area (Plow among them), definitely skip this place!", "author": "Celie H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-07", "description": "Ordered two office catering orders. One was breakfast burritos and  the other were sandwiches and chips. \n\nSpoke directly with the owner, orders were ready on time, payment was processed correctly , and both the breakfast burritos and sandwiches were simple yet delicious.", "author": "Donna H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-15", "description": "Lovely staff, amazing food.  Great for brunch on the weekends, very quick service in a beautiful area", "author": "Sean H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-03", "description": "Damn good breakfast scramble, especially for the price. They are super friendly and has a wonderful family feel inside the shop. Would go back. :)", "author": "Lori T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-24", "description": "Just walked by and can't wait to try some of their baked goods. Everything looked so good. Very tiny place", "author": "Johnny C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-25", "description": "Veggie Melt Gluten Free\nso wonderful and delish!\nthe GF bread is really good soft and crisp at the same time \nand the sandwich has lots of complex flavors\nI ate my second half of it 5 hours later (after putting it the fridge)\nand it was still wonderful \nI'm so happy we found this place this place\nso close to UCSF Mission Bay!", "author": "Win H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-17", "description": "Went on a limb since we had a snafu down the block.\nSandwiches were built well with right amount of ingredients and fresh. \n\nIt didn't wow me, but I will grab a sandwich from here if I'm in the area. \n\nI ordered the tuna melt and would definitely order it again.", "author": "Lyman C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-09", "description": "Sometimes everything goes right! My friend and I tried this place for lunch today, for the first time.  The sandwich menu is pretty large plus they have all these specials pinned up on left near the register.  I chose one of the specials: \"Ryan's Special.\"  It was grilled chicken, avocado, bacon and honey mustard with lettuce, tomato, onion, sprouts and cucumbers.  I chose sour dough toast but there were probably 7 bread options.  My friend chose the same sandwich.  Our sandwiches were made very quickly.  There's only a few seats (4?) on a small counter inside but it was a nice day so they had two tables for two set up out front.  We both loved our sandwiches.  In particular the veggies were cold and wet and crunchy and we were both just really into these super fresh sandwiches. They also appear to offer some salads; I'm sure they're great based on the quality of the veggies in our sandwiches.  We will come back here for lunch, for sure, as we only work a few blocks away.", "author": "Dave M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-06", "description": "I wanna talk about a chicken sandwich.\n\nWell, not just a chicken sandwich.\n\nThe Chicken Sandwich. \n\nOr, really, The Sandwich.\n\nThe Sandwich, cleverly disguised as a \"Grilled Chicken Melt\" is simply the perfect balance of deliciously cooked chicken, tomatoes, greens (cucumber!), onions, pesto, bacon, and of course Hazel's Dressing (a condiment itself that, while deserving of ballads and plays written about it, will not be discussed here). \n\nThe Sandwich is so delicious, so utterly incomparable to anything this mouth has ever tasted that, even though I will visit Hazel's Kitchen multiple times a week during my visits to San Francisco, I cannot compel myself to order any other of the sandwiches on Hazel's wonderful menu. I've certainly been tempted to - many of my co-workers would sing the praises of the other sandwiches.. Yet every time I walk through that adorable looking door, on that adorable looking storefront, the Sandwich calls to me. \"Lukas! Lukas! Why would you ever stray from perfection?\"\n\nWill I ever be able to order anything other than The Sandwich at Hazel's Kitchen? Perhaps. One cannot ever know what the future may hold. But for now, simply for the matter of simplicity, I'm not sure why I'd even think about it. The Sandwich lives in my hopes and my dreams, and will forever compel me to come back to San Francisco, no matter how pervasive the tech bros become.", "author": "Luke T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-19", "description": "This is a great small neighborhood spot in Potrero Hill serving up amazing sandwiches. I've only been here for breakfast and recommend the smoked salmon bagel with cream cheese or their bacon, egg, cheese croissant. Come here, order a breakfast sandwich, order a cup of coffee from Farley's next door and sit at the parklet and people watch.", "author": "Cindy A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-30", "description": "Stopped by for a quick lunch. The line goes by super fast, and so did my order! I ordered the 1b, Turkey, Swiss, and Pesto, on dutch crunch, and it tasted awesome. Not much inside seating, but there are a few tables outside on the street. Portions were aplenty, and I was able to save my other half of my sandwich for dinner. Quick tip: be sure to check out the specials on the wall because they sound amazing, and I slightly experienced menu remorse as I wish I had ordered the special; one was a turkey, bacon, avocado, and another one was a pastrami and sauerkrat. Ah, but I was also satisifed with my decision. I, for sure, experienced menu overload with the number of appealing options. Just the sandwich was about 9 bucks, and they do have postmates delivery (check out my code 2J8J if you're looking to save up to 10 bucks off delivery for new users of the delivery service, postmates). Overall, another great sandwich spot in SF to add to the many great ones out there in the bay.", "author": "Kenny L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-06", "description": "1/2 sandwich is more than enough, I got the 5a and added chicken. Fresh veggies!! Really cute outdoor and indoor seating. The woman/ (owner?) at the counter was a sweetheart and let me try the soup of the day. Will be back", "author": "Zoe D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-06", "description": "Very good service, delicious food, wide variety of options, and in a great location. We walked right past this place because there was a long line but after walking a few blocks down we decided to turn around and revisit one of the places we past. When we came back there was no line and we knew we had to stop. Trying to find brunch on a Sunday morning without having to wait in line can be difficult but this place was a hidden gem in my book.", "author": "Rebecca C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-02", "description": "Wish I could eat here everyday!! First, the food is amazing! It was one of the best meals eaten while in San Francisco. You need the Tator tot nachos in your life. Second, service was second to none. We arrived around 1:00 am, but the manager and chef accommodated my request to try something off the dinner menu.  Let's just say, you have to try the oxtail and grits!!! It's so delicious!!! The owner even made sure we made it to our Taxi safely! Loved the experience and would recommend this place to anyone in San Francisco.", "author": "Marie W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-13", "description": "I felt like taking a long stroll from the east mission over to Potrero for lunch one day and came here on a recommendation from a friend. There was a long line because it was prime lunch hour, but it moved very quickly. \n\nMy coworker and I found two lovely seats on the parklet outside which appears to be shared with the coffee shop next door. I ordered a turkey sandwich with all of the fixings, and added avocado (obviously). The sandwiches are HUGE! I saved half of it and ate it for dinner! I also ordered a side salad. I feel like you never know what to expect with side salads but I was pleasantly surprised with fresh ingredients like strawberries and goat cheese! Goat cheese has to be my number one weakness in life. \n\nMy coworker ordered a hot veggie sandwich that he devoured so quickly I wasn't sure he even tasted it. He also got a side of the heavily loaded cheesy mac n cheese. Delishhhhh. Although this is a little bit of a trek from my office, I will definitely come back sometime when I feel like taking a long lunch... or maybe even on the weekend :) The restaurant itself is extremely small with barely any seating inside, so take it to go or sit outside on the adorable parklet and enjoy the beautiful portero hill while you eat!", "author": "Mandy A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-08", "description": "In a world of over priced toasts, reservations for brunch and absurdly long lines. Hazels offers consistently great food without the pretentious atmosphere. It will always be a staple of Potrero hill.", "author": "Isaac O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-12", "description": "Yummy fresh food. The mushroom bisque was delicious. Would come back just for that. Had the veggie melt and some chips. Recommend. Light, healthy and satisfying.", "author": "Kristina L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-29", "description": "Never disappoints me every time I order Postmates or pick up. My favorite sandwich is the steak sandwich with special sauce. But I also love the chicken and tuna. Fruit and salad is ALWAYS fresh and delicious. Love HAZELS!", "author": "jasmine d."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-11-08", "description": "How you make a terrible veggie sandwich, well, they figured it out. I don't think I've ever tried to return food but I did here, I wasn't successful either. 44$ worth of inedible food. Not a cheap gamble. Customer service needs a facelift! \n\nUPDATE: As soon as the owner got wind of this experience she contacted me directly and was very receptive to my feedback. Seeing as how this wasn't my first time to Hazels but it was my only poor experience at Hazels, I'm chalking it up to the staff I dealt with on this day. The owner refunded me in full and was very pleasant and eager to make things right.", "author": "Ivy L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-12", "description": "BOMB-dot-com. \n\nI love their tofu melt, and I could eat it over and over. Hazel's is a great neighborhood shop in Potrero Hill. Grab coffee next door at Farley's, eat Hazel's for lunch, stroll up and down 18th street and enjoy the view of the city. \n\nOnly qualm: no seating. But you can sit on the Farley's outdoor benches/tables if you'd like!", "author": "Lauren L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-15", "description": "Perfect tuna melt on gluten free bun. Pickles, tomato, lettuce, cukes and delish tuna salad with melted cheese. Took the sandwich next door to Farley's and enjoyed a coffee and the perfect SFO sun. Very nice staff, too!", "author": "jana m."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-09", "description": "Delicious, fresh and fast service. Mediterranean salad, breakfast burrito or any sandwich is sure to please.", "author": "Melisa K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-11", "description": "Great breakfast!! Outdoor seating area small but cozy! Prices very realistic and staff super friendly!!", "author": "Kristi B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-06", "description": "I came in for a quick bite while running errands. There's a reason this place has a (quick moving) line going out the door. They truly have something for everyone, they were very accomodating of my request to get the lunch burrito without dairy. I got the lunch burrito with tofu and veggies, and it was truly incredible. Maybe my expectations were lower since this place is notorious for their sandwiches, but it blew several burritos I have gotten in Mission out of the water.\n\nA nice stop for lunch and very walkable from most of Potrero Hill. I'll be back!", "author": "Nathan T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-03-16", "description": "I'd heard the song countless times. It was on one of my fave childhood albums that I'd play on loop forever. I totally recognized \"The Sound of Silence\", but I didn't understand any of it since it was a rendition on los sandos hermanos' Spanish iPod.\n\nI feel similarly about my Ruben [sic] Special. (http://www.yelp.com/biz_photos/hazels-kitchen-san-francisco?select=nquritoW6S7otGDH5X6VNg) It had pastrami x sour kraut [sic] x swiss, but it was otherwise a departure that put it on a far branch of the Reuben family tree. The sauerkraut was barely noticeable; any Reuben-ness the sandwich would've had was supplanted by mayo (though the sign had said thousand island) x tomatoes x lettuce x frenetic cucumbers. All in all forgettable among generic sandwiches.\n\niChoose Your Own Sandventure!\nTry an actual Reuben, page 84: http://www.yelp.com/biz_photos/house-of-bagels-san-francisco?select=Dbvhr2T6vc-_OB7DJEmJLA\nTry another non-Reuben, page 306: http://www.yelp.com/biz_photos/lous-cafe-san-francisco?select=KxAQTGOCcW8oP7CMHLsmcg", "author": "Dan B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-14", "description": "I'm never disappointed with the food here. The ingredients are always super fresh - Hazel's Chef salad is the best. Staff is helpful and always smiling. \n\nA great lunch go-to for sure!", "author": "Liz G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-12", "description": "Ordered a lunch burrito with chicken breast, and it was pretty great. There's avocado, beans, and some delicious cheese inside that's all the more amazing because the wrap's been toasted. For $11.75, it might be a little pricier than I was hoping, but it's quite wow and filling. Pictures don't do it justice.", "author": "Jen A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-28", "description": "I've lived around the corner from Hazel's for more than a year and have never had a bad experience here. Their staff is so friendly & kind and they serve up some seriously delicious stuff, all made right in front of you with real ingredients. \n\nYou can't go wrong with their breakfast burritos, sandwich melts and ginormous salads (it won't leave you hungry!). I especially love their Mediterranean salad which features a generous amount of hummus and goat cheese on top for taste - really great for eating with their complimentary slices of sourdough.\n\nAll in all, I'm a YUGE fan.", "author": "Emily H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-01", "description": "Best Grilled Chicken Melt (with bacon YAY) in the city!  Fresh and delicious and that Hazel's pesto spread is Amazing!  Always busy during lunch so call ahead or grab a cup of joe next door at Farley's.", "author": "Michelle H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-04", "description": "Delicious made to order sandwiches.  Get a cup of coffee next door at Farleys and get some work done for 2 hours of free WiFi! Perfect way to spend a Saturday morning.  Ah... zen...", "author": "Alice W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-26", "description": "The melt sandwiches here are seriously so delicious. They're big and messy and so packed with flavor. \n\nIt's a tiny, neighborhood place, but the service wasn't overtly friendly, but I really have no complaints or problems with how I got my food. \n\nThe toasted bread, and the blend of meats, veggies, and sauces in their sandwiches truly makes this place a hidden gem that you have to visit to understand.", "author": "Joey S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-03", "description": "This place is pretty good in my book. First things first, their food is great. Get the scramble, its flavorful and delicious.....They also sell fresh squeezed oj and watermelon juice. Yum.\n\nThere is also a cute coffee shop next door you can grab your coffee while you wait for your food. If you know the scene here, you know that it takes an hour anywhere to get brunch in the city. But not true at this little gem. If youre hungry and dont want to wait come here...Sometimes there is a short line out the door but dont let that fool you..it moves quick. We never have to wait more then 10 min to order..  \n\nOnly down side is there isnt a ton of seating, 2 window seats and some seats outside...but thats never stopped us ;)\n\n4.5 stars.", "author": "Kristina K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-21", "description": "Small place BUT they have some good macaroni and cheese! Nice outside area to eat at close by the water", "author": "Priscilla S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-06", "description": "I love Hazel's salads, sandwiches, and breakfast burritos! It's super easy to order online and pick-up...it's a small space, so I usually take it to go. There can definitely be a line, but ordering ahead of time allows you to skip it!", "author": "Hayley S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-14", "description": "Yum yum and yum. Didn't have time to wait at Plow so walked just up the street and stumbled upon Hazels kitchen. Everything is freshly made and absolutely delish with a great selection from breakfast to lunch items. Check it out!", "author": "Meagan M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-29", "description": "love hazel's!!! love the people working there and how amiable they are. my favorites to order are the hazel's chef salad with chicken, the breakfast burrito with chorizo and their watermelon agua fresca. i live in dogpatch and hazel's is definitely a staple for us just across the 280 bridge.", "author": "Angela H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-07", "description": "Sandwiches are a little expensive, but they are good and well put together.  The staff is nice.", "author": "Michael E."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-06-05", "description": "The place looks beautiful like a little doll house. I loved the decor. \nThe food is overpriced. I ordered 2 egg and cheese sandwiches with crossaint instead of a bagel. They charged me $16. Can you believe that?\nThere is little place to sit outside.", "author": "Neha G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-28", "description": "My friend and I decided to come here after not wanting to wait 2 hours to eat at Plow, as it was right across the street. I ordered the 5b I believe it was ... The hummus sandwich with balsamic vegetables and it was amazing. Like one of the best sandwiches I have had. They gave a good sized portion as I could only finish half. There's outside seating which is super cute and the people working there were friendly :) also loved the tree of gratefulness outside. Such a super cute idea where people write notes of things they're thankful for and hang it on the tree. will be back!", "author": "Kathlena H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-02", "description": "I've legitimately never eaten a single bad thing at Hazel's. I work a couple blocks away, and I'm in there very often. \n\nSandwiches:\nI generally don't eat cheese, beef, or pork, which limits what I'll get in the sandwich department. But they're very cool about subbing something else for the cheese for no charge (avocado, yes please!).\n\nSalads:\nI've had a bunch of the salads. The mediterranean one is definitely my favorite. It's gigantic, and the balsamic onions really bring it all together. Highly recommended.\n\nSoups:\nTheir rotating special is usually pretty solid. However, I usually pass on the veggie chili that they have every day.\n\nOther stuff:\nI've never had the melts (see above about cheese), but my coworkers swear by them. They look amazing! I'd also highly recommend the tacos.", "author": "Shawn L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-16", "description": "Love Hazel's Kitchen!  Used to live right by here so would hit it up every single weekend.  Everything they do is good and fresh.  Super reliable. \n\nNotes:\n- I'd prefer many sandwiches at Hazel's over many sandwiches at Ike's\n- Breakfast burrito is amazing.  Greasy.\n- Sandwiches are all awesome.  When I want to be healthy I'll get a turkey sandwich on wheat bread and it's great.  When I don't care, I'll get an italian melt which is amazing.\n- French toast with fruit is soooo good.  Plow had a huge wait so I just came to Hazel's and got equivalently good french toast.  Actually just took my french toast over to farley's next door and got a glass of milk to go along with it.  They seem to be chill with this.\n - Lunch burrito was the only thing I wasn't crazy about.  Meat was a bit chewy.  Also, the tortilla was like a wheat tortilla or something?  Was expecting flour.  Bit odd.   A rare miss for Hazel's.", "author": "Casey P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-09", "description": "Going to Hazel's Kitchen for breakfast or lunch is the best decision you can make. Their food is so delicious, always.", "author": "Megan I."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-02", "description": "Some of the best sandwiches I've ever had. Everyones tongue is different, but they just get me. chicken melt is the way to go. Full of veggies and pesto solo. All super fresh. Bread is amazing quality, get seeded roll or Dutch crunch.   Veggie melt and steak melt are also just as good. Breakfast is wonderful, from burritos to waffles. Oh my god the salad. Spinach is where its at. Check the picture. Ide eat here every single day if I could. Ide quit my job to work here to learn their secrets.\n\nYou must go.", "author": "Robert P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-08", "description": "I recently moved to SF from the LA area and was so excited to find some new favorite restaurants (on the healthier side of the food scale). Hazel's Kitchen makes my list with the best breakfast burrito I've had in a long time! \nThe staff were welcoming and made it very easy to customize my order.\nI will definitely be going back for breakfast and can't wait to try their lunch items.", "author": "Emily S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-28", "description": "This place is take-out only or you can sit outside at the parklet area. \n\nThe Mediterranean salad is THE BOMB.", "author": "Amy O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-24", "description": "What a cute little spot in a charming area of Potrero.  Everyone working here was super friendly and the food came out really quickly even though there was a long line.  I got the Italian Melt and it had a lot of flavor.  I'm curious to come back for breakfast as that looked good too.", "author": "Blake B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-11", "description": "Best sandos in san francisco without question. The tuna, steak, italian, and chicken melts are to die for. I love the breakfast here aswell. Nothing is greasy and the food is great quality.\n\nAtmosphere is vibrant with decorated trees and outdoor seating, accompanied by fast friendly service.  Vegetarian and gluten-free options as well!\n\nAlways worth the drive from Marin", "author": "Cameron H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-10-10", "description": "Do not get the avocado sandwich, nor the side mixed green salad. Both look weird and messy, do not taste good and are not worth 9 bucks.", "author": "Valiagd P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-01-19", "description": "I initially wanted to try Plow for the first time for breakfast but learned that it was closed on the MLK holiday so I happen to take a walk and saw two cops eating at the tiny storefront at Hazel's.\n\nQuickly yelping and seeing the four stars along with two of SF's finest chowing down, I ascertained that this must be a decent place to grab a bite. \n\nThe location is in the middle of the block and has five stools for the counter that faces the sidewalk and what is affectionately known as the Gratitude Tree where customers have the chance to write notes of what they are thankful for and tie it to the tree. There are no tables at this deli/café.\n\nThis review is only for their breakfast burrito with chorizo which I thought it was nothing special. The tortilla is lightly grilled which gives it a light crunchy taste. Like many reviewers who ordered this item, the kitchen is indeed generous with the avocado that accompanies the burrito. I wish the chorizo had more kick to it as I added generous dollops of Tapatio sauce.  Price point of $6.95 is what one would expect for this average size burrito.\n\nThree stars for this friendly neighborhood deli/café and 2.5 stars for the burrito.", "author": "Richard H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-14", "description": "You took my order, and asked how my day was. I bluntly said \"sh*tty.\" Your face fell. You brought me my tuna melt in about 30 seconds and said \"I really hope things get better for you.\" You also secretly filled my bag with tootsie rolls. Thank you for making a terrible day better. (Context: Orlando Gay Massacre)", "author": "Erik W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-10", "description": "Best breakfast burrito!  I like them because they are like the ones I make at home. Not too big, quality ingredients, a smile, and a coffee from next door.", "author": "Andrew H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-03", "description": "Open on New Years day - major bonus points already!\n\nI got a bagel with lox spread on it. Super good price for what you get. Everything is really fresh too. I'm thoroughly impressed. \n\nFriendly staff as well and they play great music :)", "author": "Anthea W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-26", "description": "The Breakfast burrito is delicious! \nI ordered it with tofu, had low expectations of eating something (moderately) healthy and tasty, and I was pleasantly surprised (wowed!). \n The flour tortilla was warm, flakey and soft, but not chewy. The eggs were seasoned and cooked perfectly- fluffy and flavorful. Fresh guac and salsa- I added tapatio bc I love heat in my food. \n\nPerfect BB! Tasty, filling, healthy. Start your morning right. (And I usually avoid breakfast burritos)\n@$7.50 very worth it", "author": "S R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-12", "description": "Good sandwiches.  Great customer service.  A bit pricey, but it IS Potrero Hill.  Skip the chili - even for vegetarian chili, it's awful, but lesson learned.  It's a good spot.  The ingredients are fresh, and it shows.", "author": "Ken P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-06", "description": "Was originally planning to work at Farley's but walked past this place with a hungry tummy and ... I didn't make it to Farley's. \nThe friendly woman at the register listened to my cravings/uncertainty and suggested a half sandwich, half soup. the steak sandwich (melt) was full of perfectly-cooked steak, cucumbers, onions, greens, tomatoes, and melty cheese. Bread roll was perfectly soft and simultaneously crispy, bunch of seeds on the outside, and very flavorful. \nBroccoli cheddar soup was pretty good. I couldn't say it was the best I ever had - that being said... I slurped up every spoon of it quite happily. \nService was friendly and quick (I went around 1pm) Price pretty good - $10 for half-wich and half-soup. \nSidewalk seating (table + chair or benches and seats around the trees), parklet area.", "author": "Menaka M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-05", "description": "Love the sandwiches, especially roasted turkey and cranberries.", "author": "Ralph R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-15", "description": "How have I not rated this yet?! Holy Hazel's! It's amazing. \n\nI walk in in the mornings and get breakfast burritos or bagels, and the staff is super friendly and fast. The food of course is delicious (I particularly love the chorizo breakfast burrito, but when I'm trying to be good, I'll order a plain bagel with pb&j). \n\nSome days I'll go for lunch and get the 5A, which is a tasty and fresh veggie sandwich, which I occasionally add bacon to. The dutch crunch role is the bomb dot commmm. I could probably just eat this all day, but I'm glad they throw the healthy stuff on. \n\nLeslie is one of the nicest ladies I've ever encountered in my life. She knows her customers and treats them well. \n\nWill keep going back as long as I'm in the Bay!", "author": "Renee S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-31", "description": "Love their food. It is always super fresh and delicious. I'm a big fan of their salads. Hazel's Chef sakad is awesome with the smoked provolone cheese, makes this my go to.", "author": "Will N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-11", "description": "This place was great! I was in town for the weekend and had about an hour to kill before I was heading out and wanted to try something local. Found this place on Yelp and it did not disappoint! I got the sliced steak sandwich and I watched her prepare it in no time. Ate it at one of the little tables right outside and went on my way. I will definitely visit this place again when I'm back in town", "author": "Stephen C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-18", "description": "Excellent breakfast. Very friendly loved the Mediterranean sandwich egg bagel and smoked salmon bagel. A great option when you can't get into prowler", "author": "Chris B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-05", "description": "So great! Their veggie avocado sprouts cucumber and tomato sandwich totally hit the spot. Will definitely be coming here often.", "author": "Jacklyn L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-10-01", "description": "The sandwiches are good. But they've screwed up my request for a vegan sandwich 2 times out of 3, even when specifying that vegan means no cheese.\n\nThe first time I picked off the feta best I could. Today, it was melted and nothing could be done to extract the cheese. I scrounged at the office for alternate food.", "author": "Dave C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-15", "description": "You must check this place out!\n\nI thoroughly enjoyed the sliced steak melt. While sitting outside on a sidewalk bench savoring every juicy, dripping, delicious bite, I examined what flavors were tantalizing my tastebuds so that I could perhaps create Hazel's dressing in my own kitchen. I ate the entire sandwich, which is a lot since they deliver a handsome-sized sammy for such a reasonable price. Let's just say, my hunger was happily satiated. :) \n\nThe kitchen itself is really delightful. From the moment I walked in, I was embraced by the salsa music filling the air, the pretty  painted walls & colorful kitchenware, and the smile of the lovely lady taking my order. Oh, and the aroma of what's cooking behind the counter will lure you in, as well. ;)\n\nThis place is a five star, hands down. Can't wait to come back when my husband & I visit again.", "author": "April N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-27", "description": "Best sandwiches in the city hands down. Leslie and her team are the greatest people and radiate the friendliest local vibes. Everything is hand made and beautiful. Freshest ingredients and most delightful costumer service. No wonder they've been around almost 25 years!", "author": "Zoe G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-18", "description": "You have to try the Juan Special, the Chipotle sauce gives it a nice kick with some pineapple pieces (not overpowering).  The mushroom bisque is awesome.", "author": "Pose M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-16", "description": "The cutest breakfast and lunch spot in Potrero with a delicious menu and friendly service!", "author": "Jacq H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-18", "description": "Found Hazel's while wandering Potrero hill with my sister and Mumma. ADORABLE little spot. Kind of reminiscent of Bette's To-Go in Berkeley. \n\nAs SF natives, we can be pretty picky and repetitive, leaning towards our tried and true favorites. However, we were in the neighborhood after shopping for wedding dresses and wanted to try something new (instead of heading down Mission to La Taq). \n\nThe decor is quaint and sweet. The service was extremely friendly. The lady behind the counter (I believe she may have been Hazel) was sweet and courteous. It was a gorgeous day , perfect for sitting outside on a bench . I had a half mediterranean salad with chicken and half soup (vegetable chili) combo. Very reasonably priced for delicious food and it was only $1 extra to add chicken. The chicken was flavorful and the mediterranean salad was divine, with sauteed onions and goat cheese. The soup was  also very yummy. \n\nMy stepmum had a pastrami sandwich, and she gave it top marks, while my sister had a tuna melt that hit the spot.\n\nAll in all, the food is wholesome, clean, rustic fare. They know what they are doing here, I loved it. \n\nWe grabbed coffee next door at Farley's and sat happily on a bench in the sunshine while eating. \n\nThanks for a great surprise, will come again when in the neighborhood.", "author": "Molly C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-13", "description": "My go to sandwich shop on Portreo Hill. A hefty sandwich, nice folks, and a great view of downtown just a few feet away. Hazel's sauce takes a sandwich to an all new level...just delicious...but it's wet...so it can get sloppy...just ask for less. I order the 5a with whole wheat, Jack cheese, sprouts, hummus, avocado, tomatoes, and sauce...it won't get any better than that!!!", "author": "Richard B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-01", "description": "The gluten-free sandwiches here are phenomenal! I personally love the turkey pesto sandwich and the vegetarian chili!", "author": "Kimberly M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-07", "description": "Order chicken melt with Dutch crunch and your whole life will change. You will become addicted and you will crave it daily. Use caution and devour it.", "author": "Lief S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-03-15", "description": "If I order a pastrami sandwich I want a decent amount of pastrami on it and not a ton of veggies. What I got was a loaded up veggie sandwich with a single layer of pastrami. If I wanted a veggie sandwich with a tad of pastrami I would of ordered that. Its just not my idea of what a pastrami sandwich is. The people are nice and I have had good food from there in the past but I find it a bit expensive.", "author": "Tom B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-02", "description": "hazel's is great to grab a quick bite when you have no idea what you feel like but want a tasty, dependable meal.  my favorites are the toasted bagel with lox spread, the tuna melt (with that amazing special sauce and balsamic onions!) and their veggie chili.  the husband dreams about their baked tofu melt, we HAVE to eat here at least once a week!", "author": "Archana P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-20", "description": "Well deserved five stars on every level! Great service & delicious food! Menu diversity!", "author": "Karen G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-13", "description": "Got coffee from up the street and then got delicious breakfast here. It's a cute little restaurant and wasn't busy at all. They had delicious gluten free bagels. Love it.", "author": "Kat S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-22", "description": "They use delicious ingredients to make delicious food - I've been happy every time I've been here.", "author": "Krishna V."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-11-06", "description": "Hazel's is a tiny efficient kitchen. It includes four chairs that you might\nsit on after ordering. Coffee shop next door sells the coffee. We split the waffle\nwhile trying to wait for Plow to have two seats for brunch. The waffle wasn't crunchy but was good in it's own way/strawberries on the side plus syrup. Mostly people come in and take away. I am glad Hazel's was open on Sunday. The two seats at Plow weren't going to materialize for another 45 minutes so we moved on.", "author": "Liz J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-10", "description": "This has turned to my go to quick sandwich place since moving to Potrero. I usually go here for a quick breakfast on the weekends after a run. \n\nAll the condiments are fresh and the variety of sandwiches / burritos is enough to not get bored. \n\nThe smoked salmon bagel sandwich is great. Come with a generous topping of smoked salmon, cream cheese, onions, tomato, lettuce and chives. The whole package is very flavorful. \n\nThere usually is freshly made juice in the morning. The melon juice is my favorite, but it's a little steep at $4+. \n\nThey don't serve coffee, but going next door to Farley's will solve that.", "author": "Filip M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-10", "description": "I  LOVE LOVE this place. So cute and quirky, more than a bit of 90's kitsch revival flavor. The sandwich combo is the best, and I get the 1/2 grilled chicken with provolone and bacon on a dutch crunch served hot with a small spinach goat cheese salad (for $9.50!! can hardly beat that in this city.). There were strawberries in my salad this time, and you can add things like bacon, nuts, etc. The staff are friendly and make good suggestions on ideal sandwich combos. It's a tiny place but they have a super cute slatted wood patio straddling the sidewalk and street, lots of spacious benches around and a cafe table sprinkled here and there. So, they make it work. And, who doesn't love Potrero Hill? After you eat you can wander down the street to check out the city views. BONUS: They're right next door to Farley's coffee--one of the original hipster coffee joints, and Farley's allows Hazel's food to be consumed on the premises. Oh, yum-yum-YUM!\nNOTE: They are open until 4PM most days, so late lunchers this is your SPOT!", "author": "E L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-13", "description": "Great spot for lunch with lots of options. The sandwiches aren't over the top or too simple, they fall smack dab in the middle of the culinary goldilocks zone for sandwiches. Today I had the Reuben sandwich which has a spectacular grilled cheese on one slice.", "author": "Nicholas M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-12-11", "description": "Breakfast Burrito review only!  So I had a breakfast burrito urge this morning after a Saturday of SantaConning...  I had a photoshoot at the studio so I had to head towards the Dogpatch and decided to trek up the hill to check out Hazel's.  I love the name Hazel - the only one I know is a cute girl so I was already hoping for the best.  The breakfast burrito here is great b/c it's got no potatoes in it (win!).  I am not a fan of potatoes in most breakfast burritos b/c they seem more like filler and are often mealy and not crisp.  Anyhow, the eggs were super light and fluffy and it comes with avocado.  The cheese was pretty flavorful as well and the tortilla is just perfectly toasty (crunchy on the outside, but not so crunchy that it crumbles apart at each bite).\n\nOh if only they weren't so far up that damn hill - biking that last stretch is a pain!", "author": "Gene X."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-20", "description": "Growing up with immigrant parents, my usual lunch fare consisted of white rice, some mystery meat, and a sprinkle of aromatic fishy sauce. Oh how I would look over from my lunch table at school and long for what the other kids were having. \n\nFast forward to the future and now I don't have to long so much anymore. Here at Hazel's, they serve good ol' American classic sandwiches with tons of other side options to boot. I decided to go with the White Tuna Salad and Cheddar Sandwich with a side of avocado on dark rye bread. The sandwich was huge! Seriously, like the size of Tony Robbins' hands huge! \n\nEverything was made to order and incredibly fresh; loaded with plenty of lettuce, cucumbers, tomatoes, and onions. I was a happy camper. The tuna salad was a little one note for my liking, so I plopped myself over to the condiment bar and added some Sriracha hot sauce to the mix. Can't change my Asian taste buds, I guess. \n\nThis establishment is ultra teeny tiny and has a cute, cozy, vintage-y vibe. If I'm ever craving a sangwich again, I wouldn't mind making the trek up to Potrero Hill for Hazel's Kitchen once more. Take that, you fancy little kids at school who ate an abundance of fancy little PB&J sandwiches! Hhmmph!", "author": "Ann S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-21", "description": "I love this place.  The sandwiches are really tasty.  I also enjoy the breakfast burrito.  A definite must try.", "author": "Raja D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-17", "description": "Love love love the Strip Steak Sandwich! \n\nThe place is very small, no sitting inside but there are a couple tables outside. There is even a urban park that is becoming popular all over the city. \n\nThe strip steak sandwich has bell peppers, onions, cheese, lettuce, tomatoes, their special sauce and of course strip steak. Everything tastes fresh and yummy. I got it to go figuring i wouldnt finish it....but it was soOoo good i couldnt stop eating and just ending up finishing all of it!", "author": "Jean T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-09", "description": "I love Hazels. Solid, constant staff. Owner cares. Great product. They always try and make proper food. I've been eating there for a decade. Go there and enjoy.", "author": "BRADY K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-07-01", "description": "I'm not really a sandwich fan, but I went with a friend who absolutely loved what she ordered, so this place is bumped up to 4 stars! \n\nI ordered a sandwich in a box for $7.50, which means you can get any sandwich without bread. I'm trying to cut the carbs here! I ordered the rare roast beef with horseradish mayo and swiss cheese, and it was pretty fresh. \n\nMy friend loved her BLT on white bread. \n\nOverall, cute store, cute neighborhood, nice people!", "author": "Jeanette S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-02", "description": "I love this place.  Great customer service and an even better sandwich.  Every bite is as good if not better than the last. This is the perfect neighborhood spot.", "author": "doug c."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-08", "description": "Went a little out my way for a sandwich ... But very well worth it. Had the special with turkey pesto n bacon with everything on it. Loved it! . I have been to little Lucas in south city and is my go to spot. This place defiantly meets those standards! Awesome, friendly environment and the sandwiches are delicious. Will definitely come again.", "author": "Lauren F."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-02-06", "description": "The LOGISTICS suck.\n(2 stars)\n\nFelt like a drive-by deli. Order food here, order coffee there, pick food up where and when? sit where? Did i order the wrong thing? I don't understand the average 4-star rating for this place. Tempted not to write a review because I have no words for my experience, I'm literally searching for something to say. AH!!! This \"confused\" person does have something to say. One cook in a tiny kitchen, that's the only thing I couldn't hate on.\n\n- Food, I've had better\n- Prices, average\n- Service, ? \n- Ambiance, no seating except outside \n\nAfter my run Sunday morning, I was craving breakfast. Landed here.\n\nObservation\n- no seating inside. \n- No coffee/espresso on the menu? Was suggested I am welcome to order coffee next door. \n- Order my food (no number, no nothing, so how will i know its ready and if that's my order). Get coffee next door at Farley's (i passed). \n-Sit at a (dirty) table leaning on a slope (damn SF hills). \n- Pick up my own food asking \"is that my order?\" every few minutes. Eat my food in the cold and on a slope. \n\nHEFFER-STYLE STATUS.\n\nWATERMELON JUICE (~$2) - it was fresh and I liked it. \n\nPANCAKES WITH EGG AND BACON ($6.95) - Pancakes were typical. Actually, tasted like air and had to put more syrup then I like to get some kind of flavor. Nothing special about the eggs. Bacon, i love center cut bacon. They served center cut bacon - like 8 pieces of bacon but they were very tiny, fragile, and crispy. Would really amount to 3 full juice bacon in real measurements. yup, one of those rare occasions where I'm consuming meat/pork. I figured the deli was almost like a drive-by window, decided to get my food \"to-go\" because it'll just be another mess trying to get a to-go box later. all my food was just piled onto each other. Seriously? You couldn't separate them? I had to rearrange my food before eating it. \n\nMAYBE i should have ordered a sandwich, that's what everyone's yelping about. After my experience, i said to myself \"what a waste of a Sunday breakfast. I would have been better off eating at home saving money\".\n\nWill I be back? Maybe for glass of watermelon juice.", "author": "Jane A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-11", "description": "Fast, convenient,friendly, neighbor spot for breakfast sandwiches or a quick lunch.  Put your coffee order in at Farley's then grab a bite to eat at Hazel's!", "author": "Brian G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-28", "description": "I'm lucky enough to work near Hazels, and my co-workers took me there for lunch on my first week. Absolutely lovely place with lovely employees.\n\nBest ceasar dressing I've ever had.\n\nI get the half sandwich and salad. The sandwich is still huge, and the salad is delish.\n\nHazel is the nicest woman on Earth.", "author": "Joe H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-14", "description": "Found this place while visiting my mom in the hospital down the road! Best BLT + avocado sandwich I've ever had from a sandwich shop! Hazel is super sweet! So happy I found this gem!", "author": "Alison K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-11-16", "description": "I have never written a bad review before but today I felt compelled to say something. I came in earlier today at around 2 and the cashier looked up at me and proceeded to talk with a customer, just one other customer while I waited standing silently in front of her hoping she would take my order or at least say help, or acknowledge my presence. Neither of which she did. It was as if I didn't exist to her. Then when another customer entered she greeted them and skipped right over me. I have NEVER dealt with that kind of service in my life. As a current server, I have a higher tolerance for mishaps in the food and beverage industry, as I am in it myself and have been in this world for over a decade. \n\nThe woman in the kitchen making the food however gets 5 stars and I thank you for being attentive and prompt. But to the cashier, I just hope that you could please greet any and all clientele that walks into your establishment and greet them with a warm smile. You never know what kind of day someone is having. And here I was having a great day, visiting from out of town to my old stomping grounds, on a beautiful sunny day in the city I love and call home and I felt very put off by your lack of good service, attentiveness, and kindness. You were however very kind to your regulars who come in which I did note and found that to be wonderful. But please do be aware of each person that walks in as that is food and beverage 101 \"greet all guests upon entry into your store\". \n\nThank you kindly for your time in reading this. I'm sorry to have to give this place one star, but be advised that it is only for that cashier who worked on Nov 16 during the day. And one star is being rather kind of me. \n\nTake care. You're too cute of an establishment and in too wonderful a location to have bad service.", "author": "Samantha S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-27", "description": "I've walked by this little spot about 14 times now and it's always grabbed my attention.  Whether it be the friendly people welcoming you inside or the cute store front that captures the heart of every entrepreneur in this big little city.  Hazel's kitchen makes great food too!  I just finished my Tuscan Chicken sandwich on a Dutch Crunch roll and it was superb!  There was a lit of spread on it but this is coming from someone who eats salad without dressing.  Other than that little tidbit the flavors were mouthwatering.  The Tomatoes tasted like Tomatoes and Lettuce tasted like Lettuce, and... you get the point.  Honestly though, everything was FRESH.  The flavors meshed well and I can't wait to head back that direction to check out their morning options.\n\nGo Hazel's!", "author": "Kevin J."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-10-28", "description": "We have ordered from Hazel's for a bit over 6 months now and about half the time they get the pickup order correct. \n\nWhen you ask for wheat bread there is a 80% chance you will get rye bread instead. On pickup orders this is MOST frustrating becuase we don't realize the screw-up till after we've left the store. This has happened so many times that I've just plain given up. \n\nThe other items on the menu are OK - certainly nothing to keep going back to.", "author": "Aleks G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-19", "description": "Great take out breakfast spot- no fuss, accommodating and delicious!   Their breakfast burrito with chorizo is divine.  Love the packets of tapatio as well.  They are a bit on the slow end but what I would expect for a small operation like Hazel's.  Check it out you won't regret it!!", "author": "N P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-27", "description": "phenomenal sandwiches!  Try the Italian melt.  I'll be back", "author": "Bali M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-07", "description": "This is neighborhood goodness at its best. These folks will take care of you like your mom does before sending you off to school. The lunch or breakfast is much better mind you. The breakfast burrito is unique and the sandwiches are fabulous. This is a small place that you come to, grab your food, sit out side, and enjoy the Potrero Hill community.", "author": "Darin A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-09", "description": "Like so many people, I was utterly charmed by the pastel-diner decor of this little take-out joint.  We ended up with a whole-wheat sandwich with avocado, sprouts, and other yummie veggies and it reminded me of all that I loved about California.\n\nAs importantly, it was delivered with obvious joy by an obvious neighborhood loyalist.", "author": "William B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-25", "description": "Very tasty steak melt sandwich on Dutch crunch. Cost $9.50. Extremely fast service (surprisingly so) and highly recommended.", "author": "Jake N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-20", "description": "Made our office a super delicious lunch today!!   They worked hard to create each sandwich and salad special. Fresh ingredients, amazing flavored. Thank you!!!  Everyone loved it!!", "author": "Lauren S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-19", "description": "This place is super cute. It's a small place with window seating. The window faces the \"Thankful Tree\", where people have written down what they're grateful for and tie it to the branches. \n\nI got the cranberry turkey sandwich and a bag of chips. It was pretty expensive for a sandwich, but it was a good size! Delicious too! I'll definitely be back soon.", "author": "Nikki N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-13", "description": "kind of bumped down to 4.5 stars.\nhazel wasn't here today.\nsame steak melt + italian melt, both on dutch crunch\nbottom of sammy was burnt/scorched .. i mean black!\n\nflavors were still good.  would love consistency.  just cause the owner isn't there doesn't mean quality should suffer\n\nlet's see what results the 3rd time yields. hopes are high.", "author": "Tina F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-17", "description": "Had the steak sandwich.  Good sandwich, but minus 1 star as it was a bit too tangy and the bread could have been a bit better.  Good sauce.  Overall, very tasty, but not quite 5 stars.\n\nupdate:\nI wrote the above review after only a few bites of the steak sandwich.  Now that I've finished the sandwich, I have to say that the slight tang to the sandwich actually worked very well.  It was a bit much in the first few bites, but by the end of the sandwich I think that it actually fits very well.  Still 4 out of 5 stars as there are certainly some better sandwiches out there.", "author": "Andy C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-08", "description": "This place rules. Great service. Great Owner. Great Food. I work in the Mission Bay area and this is a go to spot for lunch.", "author": "Charles C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-20", "description": "Yummy sandwiches, cute spot, can easily take your food over to Farley's next door.  So glad to have it in the neighborhood.", "author": "Chloe B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-21", "description": "Awesome chorizo breakfast burrito. They share an outdoor seating area with Farley's next door (also excellent). I couldn't recommend it enough.", "author": "Matthew D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-17", "description": "It's money.  Super melty perfect breakfast burrito.  I'll be back for sure!", "author": "Jon S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-20", "description": "Came here for a casual brunch on a saturday. The line for Plow was around the corner so we opted for a quick an tasty breakfast burrito. It was lightly toasted and delicious. I recommend you upgrade to add bacon. I'll be stopping by again!", "author": "Michael O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-09-13", "description": "Review from a regular at Hazel's:\nI haven't had anything on Hazel's menu that I didn't like. Having moved to Potrero HIll a few years ago, I try to go to Hazel's as much as possible. \n\nHere's what I get:\nBreakfast: a breakfast burrito with extra cheese and extra crispy bacon. This is the ULTIMATE hangover helper/life saver. \n\nLunch: the 1A (turkey + cranberry) on sliced wheat or sourdough (depending on what I'm in the mood for), jack cheese (instead of provolone) and no onions. Delicious!!! The mayo-ish sauce they put on their sandwiches is AMAZING. I even bought a container of it to take camping one weekend! Everyone loved it, of course. It's the perfect compliment to any sando. \n\nOther awesomeness: the mac-n-cheese, quiches, fruit salad... mmmmm.\n\nThe service at Hazel's is perfect - they treat you like family. Leslie, the owner, is a gift to this Universe. The cooks are also some of the most friendly people you'll find on \"the Hill\". \n\nThe shop itself is small, but adorable. It's meant to be a walk-up shop. Step in, admire the cute decor, order your meal (made with love), and take it next door to Farley's if you want to eat inside at a table, or eat it outside on the cool parklet. Hazel's also just got some new patio furniture for their sidewalk dining. \n\nHazel's also CATERS!!! I threw a co-ed babyshower for one of my best friends and hired Hazel's to cater the event. We had a tray of sandwiches (the 1A and veggie), mac-n-cheese, quiches and fruit salad (yes, all the favorites I mentioned above). People were blown away at how good the food was. And Hazel's makes it super easy. I don't hire catering services often, and I was grateful for how easy Hazel's made the process. \n\nI bring people to Hazel's whenever I get the chance, and they're always thankful!\n\nIf you visit Hazel's for the first time, let them know. You'll be back, over and over and over again. Your first experience will be the beginning of a great (and yummy) relationship ;)", "author": "Kimberly N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-12-09", "description": "I love Hazels.\n\nI love Hazels so much that I will drive all the way from SF STATE because I am craving their delicious, juicy, generous sandwiches. Not only do I receive a delicious sandwich, but also legendary service. The cooks especially are always sweet and genuinely appreciate the customers.\n\nMy favorite: 1A", "author": "Jennifer C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-10-21", "description": "What a friendly, cute, neighborhood deli! If the home-like vintage decor isn't enough to tickle your fancy, then the food will.  The turkey cranberry sandwich I ordered was to die for, and my boyfriend adored his chicken melt.  We got both on dutch crunch rolls, which were not overly sweet and packed a great crunch.  Portions are huge! Hazel's Kitchen also serve salads, soups and breakfast burritos.  And if that isn't enough, it has gluten free bread too! Space is limited to outdoor seating only, but that won't stop me from frequenting this place even on the coldest of San Francisco days.  Grab a coffee from Farley's next door and enjoy.", "author": "Roxane W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-03", "description": "Adorable spot in Potrero Hill. I got the Ceasar Salad with sliced steak and a side of the Veggie Chili. I went during peak lunch hours and was in and out in less than 5 minutes!I will be going back!", "author": "Nai M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-13", "description": "Big fan of this neighborhood sandwich shop. Portions are huge and people are really nice. Always get the half sandwich and half soup combo with Dutch crunch! Ingredients seem very fresh too", "author": "Justin Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-07", "description": "This place is so awesome to have in the neighborhood. The food is fantastic, everyone is really friendly. My favorites are the 1a (Turkey, smoked provolone and cranberry sandwich) and the breakfast burrito with bacon. Now they have a really slick app for pickup orders so you don't have to wait in line during peak times. Try it out!", "author": "Ben R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-31", "description": "So happy to support this place. Small, with only a few window bar seats (which I love) but more outside seating. Great customer service, very friendly and welcoming. I've had their egg bacon bagel sammie (perfection) and also got their mediterranean salad with grilled chicken (they have half portions available which I appreciate). Excellent! Great food to grab on the go or enjoy on the spot.", "author": "Emily W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-30", "description": "Hazel's kitchen saved my life when I was was interning at the SFBG. It was a quick walk from work, and well worth the hills.\n\nThough it's a small storefront, the service is always friendly, the people are lovely, and the baked mac and cheese is beyond compare. All ingredients are fresh and tasty, and it's healthier than your average chain joint (though that's not saying much). \n\nI do have to say that I was disappointed in the size of their side salads, but as far as SF eats go, it's not terribly expensive and the outdoor patio is a huge plus.\n\nLove love love Hazel's.", "author": "Lisa C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-19", "description": "I'm fond of Hazel's. I'm here a few times a week, grabbing either breakfast or lunch and an agua fresca if I'm lucky.\n\nThat Rare Roast Beef sandwich is a home run, and so is the turkey cranberry. Service is unfailingly sweet. I only wish they didn't close so early so I could occasionally have a sando for dinner.\n\nI find both the parklet and Farley's a little awkward to eat at, so I always take it home or into work.\n\nI would skip the chorizo breakfast burrito (the only 'meh' thing I've had here), but the lox bagel is always fantastic, if a little heavy on the capers. Note that they include cucumber in their lox bagel, despite the menu not pointing this out. I don't get this cucumber thing that California tries to shoehorn into this east-coast classic, but I try to remember to ask that they omit it. Figure I should mention it if you're anything like me.\n\nMad love for Hazel's!", "author": "Christina M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-09-24", "description": "Hazel's is always so amazing. I eat there almost every time I'm in the neighborhood. \n\nTheir breakfast burritos are amazing. And when I'm in the sandwich mood - I get the 1a or 1b...both are amazing. I actually haven't tried any other sandwiches yet because these are so good, but I will soon.", "author": "Corine W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-17", "description": "We originally were headed to Plow for breakfast but the wait time was 45 minutes so we walked back and spotted Hazels Kitchen. I ordered the breakfast burrito and my girlfriend got the Belgian waffle with bacon. The burrito was absolutely delicious the best breakfast burrito I have ever had. The waffles weren't great but we will totally be back to try lunch and get another breakfast burrito.", "author": "Matthew M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-15", "description": "Just amazing wraps! Good value for a quality product!!! The steak wrap is out of this world!! Highly recommend this place!!!", "author": "chip p."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-04-30", "description": "Shady business practice. Been coming here weekly for years to get lunch for my office. Went one day and spent $100 as usual. When the owner adds up the bill for me she asks if I would like her to add the 10-15% tip. I was confused. She then informs me she usually adds the tip in for orders over $50. Hmmm...that's weird. I usually spend up to $200 here... That really adds up!\n\n\"Good to know,\" I said. \n\"Oh.. if we didn't tell you then we probably didn't do it\"\n\"Huh..\"\n\"But you can do whatever you want--here.\"\n\nFeeling pressured, I tipped 10% and got out of there. I have always given them a nice tip... on top of the tip they give themselves....that I just found out about. What!? To me it doesn't make sense that just because I have a bigger order I would be charged more for it. \n\n1: This is a deli, not a sit down restaurant where you are waited on. \n2: It is no extra work for them, just more money in their pocket for one transaction.\n\n\nMy supervisor called in to question this after I got back and Leslie denied it. Typical.\n\n\nNo thank you. I will take my business elsewhere, I'm sure one of the many restaurants in the area will appreciate it. Times are tough, and businesses should be glad that people are going there and spending their money despite the ridiculous mark-up prices... not demanding more", "author": "Kitty B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-14", "description": "I go to Hazel's kitchen almost every day. Hands down the best place for a quick brunch in the city. My hidden gem. I take people from out of town there all the time and EVERYONE talks about it when they go back home. This spot is the best. My go-to is the tofu melt on a sesame bun. Mediterranean salad with chicken is what I got today. That one comes in second. Your life is not complete until you have tried this place out. gawd damn.", "author": "Maxwell A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-20", "description": "I love Hazel's. A tiny little shop in Potrero Hill, this is the place to go for sandwiches. There aren't any tables, but you can go next door, to Farley's, and sit there. Be nice and get a drink there too. \n\nThe sandwiches here are fantastic. They pile them sky high and stuff them with tons of ingredients. I love the BLT. They make the bacon so crispy that it makes a fantastic sound when you bite down. \n\nMy favourite though, are their breakfast burritos, with chorizo. They are a huge mess, but SO worth it. \n\nThe staff here are so friendly, that every time, it's a joy to walk in. \n\nThey take credit cards, but with a $10 minimum.", "author": "Mariko F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-21", "description": "The most yummiest breakfast burrito I've ever had so far. Great place to go to if you want to feel satisfied and full", "author": "Glenna C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-18", "description": "I love Hazel's Kitchen! I eat here at least once a week and it is my go to for food on the weekends. I always order the BLT with Avocado. I don't know what they put in the mayo but it is soooooooo good. Like a little kick to it. The breakfast burrito is fantastic too! Oh and the Chicken sandwich... Everything is great. Service is fast and everyone there is so nice. I'm hooked!", "author": "Emily S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-03-13", "description": "I had a Chorizo Breakfast burrito and it was AWESOME!  I really loved the food here and wished I could have made it more than the one time I went.  I would highly recommend going here when possible.", "author": "Denise B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-11-05", "description": "Hazel's is perfect in a too-small-for-its-own-good-but-small-enough-to-make-it-cute kind of way.  The line out the door isn't necessarily indicative of the place's popularity; if there are more than three people in line, then it's out the door.  But the food is good, and they have good variety for the size of the space and the kitchen.  I only wish you could sit upstairs, although that would require them to make the front door open outward, which is technically the law anyway--hey, how did they get away with that?\n\nProbably the same way they (and seemingly every other business on 18th Street) get away with discriminating against wheelchair users by having a front step.  So I lied; I have two wishes for Hazel's, in this order:  wheelchair accessibility and the ability to enjoy my delish meal upstairs.\n\nYou can and should eat at the parklet outside, and Hazel's can and should earn four stars from me.  Just clear up that front-step issue, and four stars it is.  And maybe even five!", "author": "John S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-01", "description": "On our way to the train station and wanted to grab a quick bite to eat. We were looking for a deli/sandwich place that was reasonably priced and we could take on the go since we were in a hurry. The staff was very helpful, quick, and made sure we had what we needed . I had #9 chicken sandwich and thought it tasted great. My sister had turkey with pesto which she thought was tasted great too. I would definitely come back here in the future.", "author": "Rach R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-06-25", "description": "I lived on the Hill for about 8 months before we even noticed this spot -- and for the past year and a half I've literally been there once a weekend ever since. The sandwiches are just really good; lots of ingredients, right amount of magic mayo, fresh veggies. You can't make these at home.\n\nMy faves are the turkey with cranberry (I've been known to eat them Thanksgiving week) and the avocado-sprouts.  Breakfast egg sammies aren't as strong but the burrito is good.\n\nAs has probably been mentioned, you can sit on the sidewalk or eat at Farley's next door.", "author": "Amy H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-27", "description": "Another Potrero win! This neighborhood has really been surpising me lately.\n\nHazel's Kitchen is a deli with a great small cottage feel. They use really fresh ingredients and have great sandwich/breakfast burritos combos that are perfect for a pickup-and-go kind of day. You are welcome to eat at Farley's next door which is a cool partnership I would prefer to sit in there actual place. \n\nA perfect Sunday: It's sunny, I'm wearing a summer dress, I pick up some Hazel's kitchen and have a yummy picnic on the beach.", "author": "Raina B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-05-21", "description": "Awesome little lunch shop on Potrero Hill. \n\nI had their Tuscan Turkey sandwich twice. Its like the best sandwich I've ever eaten. And the staff is really friendly too. \n\nTry it!", "author": "Evan A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-14", "description": "Stopped here twice and will definitely be back. The vegetarian chili was very good and the grilled vegetarian sandwich was excellent. I also had the cold vegetarian sandwich and it was good. Great little spot to pick up a bite.", "author": "M G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-30", "description": "Good, semi healthy, delicious sammis and breakfast treats at Hazels. I had the grilled chicken pesto sandwich with cucumber, tomatoes, mixed greens with my cant do without sandwich sidekick....BACON! So yummillish. I was gonna order a salad cuz I was feeling like a piggy after Xmas but the sandwich was too tempting and well worth it. I also got a chocolate chip cookie to finish off my low carb diet and it was just alright. Definitely going back for another sandwich sometime soon...maybe veggies only next time.", "author": "Michelle H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-12-28", "description": "Three stars is a bit generous, 2 1/2 is more accurate, however.   Good, bad and ugly are:\n\n+\n\nReasonably priced - can usually leave w breakfast or lunch under 10 bucks\n\n-\n\nOdd compendium of menu items - Mixture of Mexican with pseudo neo deli items.   Seems to unfocused.\n\nWorkers do not use gloves or have their hair tied back or covered.  This is just gross and inexcusable in this day and age.  It doesn't take much and it's a good practice,\n\nFood is bland, lifeless and not memorable.   \n\nToo bad...there's a real need to have a decent lunch spot in the area.", "author": "Todd K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-04", "description": "I have their breakfast burrito for breakfast and lunch.  If they were open for dinner you know I'd be doing that too.  It is stuffed with huge pieces of avocado and a salsa that is like crack.  I am not a huge fan of their sandwiches but even if they were amazing I would still get the breakfast burrito every time!   They are super fast, and always so friendly.", "author": "Joyce W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-13", "description": "I literally just finished my sandwich.....It was so good that I had to write a review! Although my last experience with Hazel's wasn't the best, I decided to give it another try! WOOOOOWWW was that a good decision.\n\nI walk in to Hazel's Kitchen not really knowing what I wanted. I looked at their menu and they have all the generic choices that any sandwich shop has (a veggie, a turkey, a ham...etc.). However, once you look at TODAY'S SPECIALS....thats when the magic happens. They had an array of crazy combinations and mouth watering choices. I ended up choosing a half salad half sandwich deal (because i couldn't make up my mind on either).  \n\nSo I ordered the Baked Tofu sandwich with balsamic sauteed onions, red bell peppers, tomatoes, lettuce and pesto Aioli. IT WAS FANTASTIC! I love every bite of it! I literally did not want to stop eating it. I almost took a chunk of my hand off with it on my last bit! My mouth is still watering thinking about it. I'm not even a vegetarian and I enjoyed it!\n\nNext I had the Black bean and corn salad tossed with tomatoes, cilantro, cucumber and red cabbage! Another well executed dish my Hazel's. The vinaigrette does not over power any other the components of the salad, so you get a nice light refreshing bite each time. \n\nFinally, in every bag they give you a flavored tootsie roll! It is a great end to a GREAT MEAL!! Om nom nom!", "author": "Katie H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-24", "description": "The Lunch Sandwiches are very good.   We have order large quantities for group lunches and the orders have been spot on.   Friendly and helpful staff.  We go back there regularly and would suggest, as one of the better Potrero Hill places for lunch!", "author": "Capra C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-19", "description": "This is a great place to pickup a quality sandwich.  There's no inside seating but you can sit outside on a deck/patio shared with Farley's coffee.  It's also a nice place to go for breakfast because you can order your breakfast burrito (good but a little small).", "author": "george c."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-30", "description": "Fresh and delicious sandwiches! I also love the bagel and lox they serve for breakfast. The employees are really friendly and helpful. They don't have seating but you can enjoy your sandwich next door at Farley's.", "author": "Diana G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-23", "description": "Hazel's fits the bill for a nice big lunch sandwich. Only one veggie option, the #5, but lucky for vegetarians (like me!) it is a delicious sandwich. They also have lots of non-sandwich options, like a veggie quiche, beet salad, and other daily specials (tamale pie last weekend), which I have yet to try but mark my word I will because they look delicious. \n\nI haven't tried their breakfast fare yet, but it looks quite promising. I saw a waffle prepared for another customer last time I was there that looked scrumptious.\n\nCall ahead and they'll have your sandwich ready for you when you arrive. Glad to have you in the neighborhood Hazel's!", "author": "anna w."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-07", "description": "Cranberry sauce soaking through the paper means one of two things:\n\n- Your sandwich was not assembled very well\n- Your sandwich has an epic amount of cranberry sauce\n\nHazel's outstanding roasted turkey and cranberry sauce on a seeded roll was assembled just fine. They just happen to give you an epic amount of cranberry sauce. Fine by me.\n\nMorning dwellers shouldn't miss the waffle. Berries. Belgium. Brilliant.", "author": "Jason B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-01", "description": "Another place I've been coming to for years and am long overdue to review. This is a neighborhood staple for many folks in my household. We might look in the fridge with a frown, \"Nothing to eat. What'll we do?\" And next thing we know, we're queueing up at Hazel's for that reliable provision of tasty sandwich and salad combo that has kept the neighborhood happy and fed, watching the dogs wriggle by, saying hi to the neighbors. Good stuff.", "author": "Jaina D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-30", "description": "Wow, spontaneously walked into this place for lunch... What a delight on a cold rainy Sunday!  Great sandwiches (including veggie options), and my chicken breast sandwich had the best aioli.  Lots of kids options as well.  Very minimal interior bar seating (3 seats) but a few tables are available outside.  I will definitely be back!", "author": "Atul B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-12", "description": "Just popped in for a sandwich, CUTE place! Ordered a sandwich was made fresh didn't take long and tasted great.", "author": "Rondi K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-10", "description": "I love Hazel's! Their menu is pretty big for such a tiny place, and has everything you might want for lunch. The fact that they have gluten-free bagels and bread for their sandwiches is what really wins me over, though. Even in S.F., it's rare that I can enjoy a sandwich or bagel anymore! And they don't skimp on the lox spread. \n\nThe employees are really friendly, and the owner seems like a great neighborhood person as well. I like the community feel of the place (especially the thankfulness tree out front- such a sweet idea!) and I usually stop in about once a week for lunch when I need to get away from work.", "author": "Brandi C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-25", "description": "Hazel and her sauteed spinach...my heroes!\n\nAs a gal on the go it is so refreshing to find a fine food friend that is so:\nHealthy and tasty\nAffordable\nPlus hazels has:\nNew options (mmm barley salads!) but always old faves like lasagna and quiche\n\nHazel Will make food special for you, (chicken salad  for lil ol me)\nThere is a great setup with Farleys, the coffee shop next door, where you can get food to eat there and the staff and hazel clearly have fun and care about their customers.  Oh ya And they give you tootsie tolls...\n\nTo the left, to the left.", "author": "Melissa H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-12", "description": "Yum.  A sandwich and salads you can count on.\nVery wholesome. Great people.", "author": "P G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-08-13", "description": "Peckish on Portrero Hill?\r\n \r\nIf you put your hands up to your head cuffed like blinders and look straight at this closet of a place on 18th Street between Texas and Missouri, you may think you're in the Hamptons waiting for the Barefoot Contessa to come out in her figure-slimming caftan. Put your hands down, and then you realize you're just in front of a sandwich shop on Portrero Hill. I don't know which of the two women in the shop is Hazel, but it's a charmer of a place. They apparently serve breakfast bagels, but my friend and I came by over the weekend for one of their seven sandwiches. Except for the $4.75 PB&J (which I must try), all of them range from $6.50 to $6.75.\r\n\r\nThey also have three tempting salads, all freshly made - pasta, Greek and a corn-bean combo - which sell for $2.95 for a half-pint serving. The best deal is definitely the half-sandwich/half-salad for $6.75 especially since the sandwiches are pretty hefty. I had the roast beef and cheddar, and while the meat is sparse between the sourdough slices, it is chockfull of lettuce, tomato and other healthy goodies. I like the use of the Chinese take-out container for the salad, though I was hoping for a Kosher pickle to complete the picture. There are only two tables, each with two chairs, outside on the sidewalk and a bench, so be prepared to take it to go. Farley's is just a couple of doors down, and an iced latte would be a nice way to wash it all down. This one is definitely a cut above the neighborhood sandwich shop.\r\n\r\nFOOD - 4 stars...fresh ingredients elevate this place \r\nAMBIANCE - 3.5 stars...well, the outdoor table is nice on a sunny day...close your eyes and it's the Hamptons\r\nSERVICE - 3.5 stars\r\nOVERALL - 4 stars...sandwich shops are a dime a dozen, but a good one is worth going a few more blocks", "author": "Ed U."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-09-06", "description": "A good place to pickup a sandwich on a way to a picnic since Hazel's is close to 18th Street exit off of I280 Freeway.  Probably a 5 Star shop for Petrero Hill residents, but 3 stars for me since I live in SOMA.  One of the awards displayed on the wall is \"Best Place to Meet Locals,\" which explains how this place is loved by nearby residents.  Sandwich was made on fresh bread and ripe tomatoes.  I wished they would pile on a little bit more meat, but overall a solid sandwich.  Use this place as a takeout place, because they only have several seats outside.", "author": "トモ T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-26", "description": "I am unabashedly a carnivore.  This is a testament to how yummy the tofu breakfast burritos are at Hazel's.  At 6.95 it's a wee bit pricey, but absolutely delicious.  I keep meaning to revert to my meat eatin' ways, but can't bear to not order the tofu...  I've also had the oatmeal and it's also fantastic.", "author": "Helen F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-04", "description": "Delicious sandwiches (big enough to eat half and put half away). Friendly service. No place to sit.", "author": "Chelsea F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-10-08", "description": "The turkey with cranberry sauce sandwich blew my tastebuds away! They have such fresh sandwiches and such funky combos, it's like getting a sandwich made from your crazy aunt Hazel.\nOnly drawback is no seating, so prepare to bunker down at a park to devour their yumminess!", "author": "Brittany T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-13", "description": "Been 10 years almost since I visited last.  The turkey cranberry smoked provolone is still as good.  It's the perfect little working take out sandwich place.  I love it and always will.  Seems like new owners but the food and quality is the same!  They take cards now which makes it more convenient.", "author": "Mark M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-08", "description": "Very good sandwiches and pretty good lunch burritos.  I had the steak melt on a dutch crunch, which was pretty fantastic, and the grilled chicken + grilled veggie burrito, which was okay.  Not much seating, so either take the sandwich for a walk or sit down next door at Farley's.", "author": "Max L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-12-26", "description": "Yay!  I love this place.  I often to go Farley's for coffee, then go to Hazel's and grab one of their AWESOME breakfast burritos.  That whole area of 18th street is so homey and comfortable.  Hazel's is a little hidden gem.", "author": "Steve S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-07-19", "description": "Best sandwiches in Potrero Hill. Period. \n\nI've been frequent this neighborhood joint for years now and they always deliver. The ingredients are fresh and there's something in the dutch crutch bread that is addictive. Mmmmmm.\n\nAnyways, I've only tried the sandwiches because there are so many and so good that I see no reason to stray to the other menu options. \n\nI'm so happy that Hazel's Kitchen is so close.", "author": "Juan V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-03-04", "description": "Perhaps my enthusiasm for the sandwich I had yesterday at Hazel's Kitchen was due to my extreme hunger. But no, on second thought, it was just damn good.\n\nThe John's Special sandwich features turkey, bacon, provolone, pesto, veggies, and Hazel's dressing on your choice of bread. I chose the whole wheat--and I'm glad I did because those two slices were huge! At first I thought there was no way I'd finish even half of the sandwich, because it was stacked about three inches high with generous amounts of everything. I had to stop myself at 3/4 of the sandwich before I exploded. Oh, and I'm guessing the Hazel's dressing is some type of magical vinaigrette, because I devoured everything, including the tomatoes and cucumbers, which I'd usually toss.\n\nI also had a bite of sandwich 3b: rare roast beef with horseradish sauce. That was good, but I liked mine better. I especially loved that the sandwich was slathered with a horseradish sauce that imparted great flavor but wasn't unbearably hot.\n\nNext time I'm in this cute little neighborhood around lunch time, I'm pretty sure I'll make it back here, especially since Baked is just down the street. If nothing sweet catches your eye at Hazel's, place your order, then mosey down to Baked while you wait for your lunch to be ready.", "author": "Julie K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-02-05", "description": "Hazel's, oh god where do I start... The best worst sandwich place ever. They are the best sandwich in Potrero Hill, but only because they are the only sandwich place in Potrero Hill. The customer service is the worst, EVER. I was the Duke of this place for over a year while I was living on 20th and out of my 30+ visits they only got my sandwich order right once or twice. Yes that's correct, once or twice. Complete incompetent assholes as am I for continually coming here as many times as I did. The cashier's have a 2nd, maybe 3rd grade education and the attention span of a 13 year old boy. It is sad because they have the potential be so good. Good bread, good ingredients, great location, great menu. My advice? Pull your head out of your ass Hazel and hire some decent people that care about your customers and can stay awake long enough to make a sandwich correctly.", "author": "Phillip K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-25", "description": "If you want really yummy food to go (no seating), this is the place.  In general, I don't like sandwiches (unless I dress it up like an Italian sub with foccasia bread). But they have really good sandwiches here. My fave? Anything on their daily special menu especially their tofu sandwich on a seeded roll! I'm no Vegan either! I usually get 1/2 sandwich 1/2 salad for $8.50 and bring it next door to Farley's cafe where I can eat at a real table! Also, you can shorten your wait if you order by phone first!", "author": "Caitlyn K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-04-01", "description": "Typically, I'm good for two meals a day at Hazel's Kitchen and if they were open for dinner I would come close to paying the rent.  Everything that has been said about the sandwiches is true, but the breakfast burritos, bagel egg Sammie's and tacos are high on my list.\n\nI start my mornings brushing up on my Spanish with Alma and Juan always good for a laugh. I have become a fan #5 the vegetarian on a seeded bun. Hold the bacon Amy.\n\nThe 18th Street trail is order breakfast at Hazel's Kitchen, coffee at Farley's and then some thing sweet from Baked. A buen dia.", "author": "Steve A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-08-16", "description": "Had to wait for guy to get off his cell phone before taking my order.\nI ordered a waffle with strawberries.\nThey charged me for waffle with avocado (3dollars more).\nTook extremely long time to make.\nWaffle was under cooked, gooey, disgusting.\nBrought it back, cashier was unbelieveably rude.\nMade no attempt at any point to maintain a friendly, welcoming environment to customers. :(\nNever going back.", "author": "Astro S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-17", "description": "Awesome breakfast burrito! I would definitely recommend the chorizo and I am looking forward to coming back for more.", "author": "Delaney L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-05-14", "description": "I was staying with a friend who lived about five minutes from here, so on her recommendation I decided to grab lunch from this place. The prices are actually really good for the amount of food you get; these sandwiches are HUGE. I think they serve it on mutant bread. Half of these sandwiches is about the size of a normal sandwich you'd get at Starbucks or something like that. I got the cranberry/turkey sandwich and had them put in avocado and bacon for extra. It was amazing. I thought I would save half for later since it really is a two-meal sandwich but I ended up eating the whole thing. Just be prepared to get messy when you try to bite into these things!", "author": "Sabrina M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-28", "description": "You can get good sandwiches in this tiny deli.", "author": "Erich V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-23", "description": "I love this cute little restaurant.  Bought a sandwich there last week that was one of the best I've ever had.  Tri tip on toasted wheat with vegetable marinated in balsamic vinegar.  Yum!    And it is next door to my favorite coffee shop in SF (Farley's), and you can eat your food from Hazel's at Farley's.  \n\nWhile you're in the area, also check out Collage, a few doors down.  It is a cute little shop with some vintage pieces and jewelry and soaps and lotions.", "author": "Cynthia L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-07-07", "description": "Pretty hit or miss lunch and quick breakfast spot, but overall more hits than misses. The sandwiches are the mainstay of this place.  I've had the pastrami, the John's Special, and the tofu with sauteed vegetables: all were heaping with ingredients (a little sloppy but truly a bang for your buck, especially if you order the half sandwich for 5.25). These are all daily specials, and to mimic what an earlier reviewer said, you can't go wrong with them. The other day I ordered a sandwich from the regular menu and it was a disaster..I ordered the BLTA and there were all of 3 pieces of bacon in the entire sandwich. A very sad thing to behold.\n\n\nTheir soups are so-so; Ive only had the vegetarian chili and was not that impressed.\nTheir salads are actually quite good; I've had the chicken Caesar (the dressing was good but maybe overly garlicky in my opinion) and a few others..but I don't order them nearly as much as I had in the past since they remodeled last year (now the salads are not really displayed well, so they never catch my eye anymore).\n\nAs for breakfast...their oatmeal is by far the best deal, and probably best tasting thing I've had for breakfast there. Their bagels are only okay and compared to the cafe by my house, they are overpriced...This morning I ordered the granola, fresh fruit and yogurt for the first time. I guess it was a mistake. I mean, who puts honeydew and watermelon with their morning yogurt??? Those watery fruits don't really go well with dairy or grains in my opinion. There were a few strawberries, but they should have included bananas and other berries, in my humble opinion.\n\nI've never tried the pancakes, waffles, or the breakfast burrito, so I cannot speak to those items.\n\nA word about beverages: THEY DON'T HAVE COFFEE! They should. Farley's coffee tastes like caca. Hazel's serves pellegrino juices and Juice Squeeze, but I sincerely believe that the best thing on the menu is their Watermelon Aqua Fresca. It's not always advertised/on the menu, but when they have it, you would be doing yourself an unforgettable favor by ordering one. Really, really refreshing and delicious.\n\nContrary to what I've read here, I think the service is consistent, fast, hardworking and very sweet. The new woman who works there has botched up my order before, but I think she is getting better. I really  have no problem with the service; I don't know what the 1-star reviewer was talking about.", "author": "Reena R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-07", "description": "Love this spot, cheap and good food - and fast!  what else could you ask for?  no seating, but who cares!", "author": "Adam S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-02-09", "description": "Cute place. Super fresh sandwiches...and by that I mean literally fresh and delicious. Sit outside. It's sunny in Potrero! Or take your food next door to Farley's, but don't be rude, order and enjoy a cup of coffee with it while you're there!", "author": "L P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-04-10", "description": "If I could eat Hazel's everyday, I would. This place has such great sandwiches and side dishes. I am a huge fan of the turkey pesto, or the turkey and cranberry, with a side of fruit salad. Yum.\n\nAlso to die for? Their pesto lasagna, wish I could make it the way they do, it's sooo good. And the employees are great, quick, friendly and clean. What more could you want?", "author": "Liz S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-31", "description": "Skip Plow and eat here instead. The food is better, the servings more meaningful, the wait is shorter (by hours), and it's less expensive.", "author": "Jake H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-02-19", "description": "Ive been here quite a few times the ingredients they use are always really fresh and taste great the downside for me is that evrytime I come here they never get my order right. If I say no cucumber their it is after I get back to work and go to eat it. If i say may mustard and pesto I get back and only find mustard.\n\nGave Hazels 3 starts because I do like this little place but they need to pay attention to customer orders.", "author": "Michael W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-03-27", "description": "This is more of a \"grab something and take it home place\" for me, but I think the sandwiches are great. They do have a few tables outside and I see that you can sit down next door as well, but I have never stayed to eat.\n\n I recently tried the Rare Roast Beef with Horseradish Mayo and it was SO good!  I kept thinking about how much I enjoyed it all afternoon.  The tuna and BLT are pretty good, too.\n\nThe sandwiches are very large and loaded with ingredients.  I have yet to try the breakfast burritos, but am looking forward to it.", "author": "Mack S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-17", "description": "I live around the corner from Hazels and go here often. Good food and service.", "author": "Heather B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-25", "description": "Awesome Grilled Melt sandwiches, especially the Chicken.  You can taste all the flavors; the key is their homemade dressing.  Great Chilli also.", "author": "Ken L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-09", "description": "Delicious Jumbo artist sandwiches of all sorts! For the price and quality...this place is amazing! I love the Chicken and Beef Sandwiches. Yum! Thank you Hazel's Kitchen for providing great jumbo sandwiches at a reasonable price. I will be back!", "author": "Cat K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-07-10", "description": "Awesome bagels!!! And of course cream cheese. Yum :)", "author": "Julie P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-23", "description": "Most bomb dot com breakfast burrito I've ever had!", "author": "Sonal S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-08-29", "description": "I am highly addicted to their dill salmon spread on a whole wheat bagel with sliced tomato.  Unlike Noah's or Katz's or any other bagel place in the bay area where you have to remind your tripped out server to please cut your bagel down the middle too, Hazel's always gets this right, and makes the cut, after it's been wrapped in tissue paper so you end up with two delectably edible halves.  If I am lucky they haven't run out of bagels and I can still get one past noon.  \n\nI don't think their sandwiches are anything too special, or mind-blowing.  Except that their turkey tastes like real turkey and the roast beef tastes like real roast beef, which is saying a lot.  So kudos to Hazel for fresh ingredients.\n\nI do like the small shop feel of the place. Ok, truth be told, it's tiny!  But it has a quaint new england town feel to it.  Mainly from the decor and the red and white paperware that makes me nostalgic for a good lobster roll.  And the staff are always friendly.  \n\nI'm tempted to give them an extra star for their location adjoining Farley's next door ~ sustenance and your caffeine in one spot!  But it's just a solid good.  Down with grade inflation!", "author": "Nikki F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-08-05", "description": "Great sandwich and soup place in Potrero Hill.  \n\nThe tomato cabbage soup was AMAZING. And my grilled chicken sandwich on toasted dark rye was very tasty.\n\nWhat I like most about Hazel's is the location.  It's a great neighborhood soup and sandwich place in Potrero Hill with outdoor chairs and tables.  And it sits next to Farley's.  You can have a great tasting sandwich and great tasting coffee in one stop.", "author": "Jun B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-03-03", "description": "3 Stars  Great Sandwiches!\n\n-2 Stars \n Beyond annoyed and frustrated with the $10 limit on using debit/credit cards to make a purchase!!!\nAll the sandwiches are under $10, most are $7.50, so you are forced to buy unwanted drinks, chips, etc...\nWalked out the last time as they wouldn't take my card and I only had a five spot on me.  Lost business and not excited about going back anytime soon.", "author": "Z. G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-05-28", "description": "Delicious breakfast bagels and sandwiches in a cute environment. Super friendly staff. Take your breakfast next door to Farley's and enjoy it with a double shot of espresso. Hang out and enjoy the neighborhood vibe. What more could you ask for?", "author": "P F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-04-04", "description": "Good freakin' gawd Amani, chill the hell out! Ok- one... I've been eating at Hazel's since around when they opened, 10+ years ago. It's one of the only places I've eaten at on a regular basis since opening, that I've never gotten food poisoning from. Just fwiw.\n\nThe one time they f*cked up and put dairy in my sandwich, the owner (Leslie) felt so bad- and asked that if it ever happened again, to just call, and that they'd run-up another sandwich to my house (she knows I'm a neighbor). Ever since, she's always made sure that whatever I order is totally dairy-free, and I've never mentioned my allergy since.\n\nAnyway- the food is so homey, so flavorful, so delicious. The BLT with Avocado is amaaazing... the pre-made salads I always get when I'm going to have a long day in my studio in Oakland. When I go in first thing in the AM and they don't have what I always order already made, Juan will tell me to go get a coffee and come back in a few minutes (they know that's my routine anyway), and he always has just one little tub of my salad made-up by the time I go back.\n\nThe perfect neighborhood lunch-spot. Excellent service, and it's significantly cleaner and kept to higher standards, than most restaurants (and yes- I've worked at many). \n\nOh yeah- and now, they accept credit cards!", "author": "Nina A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-04-06", "description": "My coworkers and I go to Hazels pretty often because it's quick and tasty. We usually take it to go, but for people looking for seating there is outdoor seating and they have an agreement with the coffee shop next door, so you can eat in there too. \n\nMy favorites are the hot steak sandwich and the cajun sausage sandwich (when they have it as a special). The balsamic onions are delicious and the bread is super fresh. They also have good side salads like the beet and goat cheese salad with oranges. \n\nWhoever calls this place pricey is tripppin'...last time I checked $7-8 is pretty standard for a sandwich....especially in the potrero hill neighborhood. Plus- the $4.95 belgian waffle with egg, avocado and bacon is a steal!", "author": "Kat L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-11-20", "description": "Their sandwiches are delicious, and BIG, like split between lunch and dinner big (ok, I don't have the biggest appetite). Soups are good too in my experience. They are friendly and it feels like a nice neighborhood shop.  \nThree stars, because every time I've tried to get salads there (chicken salad, grain salad, potato salad, etc) they all have bell peppers in them, which I can't eat.  I know that I'm not the only one with serious bell pepper issues, because I meet people all the time who can't stomach them.  I understand putting them in salads, but if they're in every single one then people like me don't really have an option.  (I may be biased, but also think it's a lazy way to add some color to a salad and it seriously changes the flavor!)\nThat said, I still go whenever I'm feeling up for a sandwich.", "author": "Ms. N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-02", "description": "Teeny Tiny Sandwich Shop Makes Big Tasty Sandwiches. Bring Your Wallet & A Friend.", "author": "Jordan P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-04-06", "description": "I like to think of myself as a sandwich connoisseur...I love sandwiches!!  I really enjoy hazels....They have very healthy (not mostly meat)  sandwiches.  They are made with care, so don't go in a hurry....and I love that every sandwich comes with cucumbers and Hazels \"special sauce.\"  ..It is always nice to order a sandwich and then take it to Farley's next door.  They let  you eat your sandwich in there shop! ...that is a whole other review..(I heart Farley's)......\nAlso, she has beautiful quiches and salads to pair with your sandwiches....yummy.   I am a regular.  Hazel's is my favorite sandwich shop in Potrero Hill!", "author": "Michele K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-06-30", "description": "Pretty good food with a nice menu and a cute space, but the girl who works here is notably unfriendly.", "author": "Dr. X."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-06-20", "description": "I weep as I write. Hazel's is true love for me. \n\nBack in the day I used to live on the hill and Hazel's was my home away from home. There was a time where I wouldn't eat tuna-fish, unless it was made before my eyes - until I tried Hazels. Wheat bread, White Cheddar, cucumbers, red onion, lettuce and tomatoes. Something so simple that exhibits pure perfection. \n\nI make the pilgrimage back every visit to SF. Well worth the long line!", "author": "Deidre H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-06-02", "description": "MMMMMM Hazel's!\n\nRoast beef with horseradish! Bagels with smoked salmon! Almost like being home on the East Coast.....", "author": "Emme D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-02-07", "description": "Okay, so nobody is perfect and Hazel's had a snag with my last sandwich. But instead of just saying \"sorry\" when she found out about it, Leslie was nice enough to give me my next sandwich on the house. Everyone at Hazel's is awesome, and it's clear that they care about their customers. I'm really glad to have them in the neighborhood!", "author": "Mr. B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2006-09-28", "description": "When I first started going to Farley's I'd frequently see red-white tray-totting patrons step in and grub on sandwiches and soups. As Farley's doesn't make these items, I investigated and found that Hazel's, just a couple doors down, serves up these goodlookin' sandwich sets. As there is no place to sit- Hazel's is essentially a small kitchen and counter- they apparently have an arrangement with Farley's. Farley's will sometimes have a basket of sandwiches, presumably from when Hazel's closes shop for the day. \r\n\r\nSo I stopped by and ordered a sandwich. Granted, I ordered one of their tamer items, but I've produced superior turkey sandwiches in my kitchen. \r\n\r\nAnd when I inadvertently tipped over the top bun, I found that the sandwich maker had stuck in a leaf of lettuce that was rotten black. How the sandwich maker though friendly, either (1) didn't see this disgusting fossilized leaf of lettuce, or (2) saw it and thought it was okay, is a head scratcher. If you go, best take a peek under the lid.", "author": "dave y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-09-15", "description": "Resume: Shake Shack in CDM, deli and shakes specialist\nRecommendations: Hot pastrami on a dark rye with everything and you are half way to a perfect lunch time.  Stop at Farley's for the beverage or the wine shop up the block next to Chez Maman.  Warning to presumptious peeps: no one in any of these places will kiss your ass.  Its just plain old good food with candid service.  Kind of surprised to read the sour reviews as they have always been extremely pleasant and warm and even comp'd a meal of mine when they forgot to include the side I ordered and had to return 10 minutes later.  \nFollow up: Now I need to check out Kleins... we'll see\nGet'r done, eat here and smile like you mean it", "author": "Porfirio R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-30", "description": "This is a great cafe for a bagel sandwich for breakfast.  (And the bagel sandwiches are made with fried eggs, not microwaved.  They now also carry brownies from BAKED which is bonus.   Their lunches are yummy too... mac and cheese, fresh sandwiches, etc.  It's a good spot and I'm glad it's in the work neighborhood.", "author": "shannon a."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-04-06", "description": "This is probably my favorite stop in SF.  Everything here tastes amazing, the staff are very friendly (including the owner, who is often there making your food), and it's easy to stop over to Farley's for coffee while your food is being made.  I have never once left this place unsatisfied or unhappy.\n\nOh, and they give you tootsie rolls with every meal as if your mom packed your lunch for you.  ADORABLE!", "author": "Ehron M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-06-03", "description": "Ordered a Jon special turkey and bacon for 8.50 to go. Half a sandwich into it and 4 blocks away I realized that there was no bacon. Honest mistake but a spiteful 3 star deduction.", "author": "Lily T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-30", "description": "You really are ordering out of a kitchen. Hand made huge sandwiches. I recommend the #5 on the sandwich board. Avocado, Cucumber, Tomato, Sprouts & Jack. or the #2 Hot Pastrami & Swiss or the #8 BLT with Avocado. For real, you can't go wrong. all the ingredients are fresh and each hunk of sandwich is made with love.  Thank You Hazel's for making sandwiches hip and scrumptious!", "author": "Charlene K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-10-07", "description": "It's 4+ years since my previous review and the only thing I would change is that I need more stars. Hazel's still makes fantastic, oversized sandwiches. And now they've expanded the lunch menu to include quesadillas & tacos, plus waffles, pancakes & eggs for breakfast. The food is fresh, the people are friendly, and if you're really lucky, you get an official greeting outside Hazel's by my dog Otis. What are you waiting for?", "author": "P C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-10-03", "description": "I just got the turkey sandwich special for the second day in a row. it's SO good. I also got the beet salad, which is possibly even better.\n\nhighly recommended.", "author": "John M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2005-07-25", "description": "Mmmm... I had a great chicken pesto sandwich, with everything, here for lunch today. There appears to be no seating inside but they have a deal with Farley's so you can take it in there. Will definitely try Troy E's tip next time and get a cookie.", "author": "Bob G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-06-08", "description": "I really wish Hazel would either hire some decent help, or just stay closed on days that she isn't willing to work.  The incompetence of the staff falls into a special class that is almost admirable in its extreme:  They made a sandwich that was practically the exact opposite of what we ordered.\n\nThe girl at the counter may have been new, but it was as if sandwich concepts themselves were foreign to her, not just the menu.  \"What are these things you call 'cheese' and 'bread'?\"  We would have had better luck going through a fast-food drive-through without ordering and just paying for whatever the people behind us wanted.\n\nGetting charged $6.95 for a giant roll (\"sourdough that has been sliced\" versus the requested \"sliced sourdough\") with no lettuce or tomato, mayonnaise, or mustard is not how I want to keep the economy afloat.  We got home, and had to basically make a sandwich out of the paltry ingredients by adding our own.  Glad we had all that stuff in the fridge.  \n\nWe are considering opening up a sandwich repair shop in the Dogpatch.", "author": "Justin F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-06-09", "description": "True potrero insiders know that hazels NOT klein's is where you get the good sandwiches. the turkey with cranberry and the ham and cheese are awesome. do yourself a favor- get the dutch crunch. you'll thank me. shout out to the cookies as well. and it's adorable.\n\nNOTE TO ANYONE WHO WENT THERE BEFORE THE LAST FEW MONTHS: there was a totally mean woman who worked there. she's gone. yee haw! new staff are friendly and fantastic. when my hubsand and i split a sandwich they put onions and cuc's on my half (he's the princess and the pea i swear!!!!). one woman always laughs and goes \"oh yeah! i remember your husband!\" so great.", "author": "sarah l."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-08-31", "description": "Dear Hazel's Kitchen,\n   If it is 2:00pm on a Wednesday and a large group of people who are obviously hungover request a table...wouldn't getting them a table in due time be the smart thing to do?\n\nInstead you made us stand outside, watching the ONE outdoor table you have get filled by a group of people that looked as if they had just returned from Burning Man. Which was odd, considering I ate here in APRIL. \n\nI mean, that's just cruel, Hazel's. How come they got food before us? I'm sure I looked a lot worse-for-wear than they did, because I am not a happy camper without a morning cup of coffee.\n\nBut you finally came through for us and you let us in. Our table was haphazardly thrown together and your waitress wouldn't even look us in the eye. Good thing she brought me my coffee promptly, though. She probably didn't have to make eye contact to see that I would kill her if she did not deliver.\n\nThe food arrived quickly enough and was hot. I ordered some kind of scramble, minus the eggs. My only complaint was that there were WAYYYYY too many chunks of potato in it.\n\nTheir menu is pretty diverse, all things considered. Lots of options for whatever stupid restrictions you might have, you fucking hippie.\n\nToward the end of our dining experience, I was pretty sure we were going to die because a mighty disturbing smell was wafting through the small establishment. It smelled like some kind of electrical fire. Apparently Hazel's is still there, though.\n\nThis place was okay. Don't bring a large group here and if you're dying for caffeine be smart (unlike me) and go to Farley's before enduring the wait at Hazel's.", "author": "Pamela D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-01-03", "description": "Wow . . . apparently people either LOVE it or HATE Hazels ;-)  I am going to with I LOVE IT!   I usually get the Rare Roast Beef and i love the fact that it seems like it is my sister making a sandwich for me in the kitchen at home . . . not that my sister EVER made anything for me when i was home but that is a different set of therapy sessions.\n\nSince I work close by this is the place I go to if I need something quick.  Plus they have a frequent eating card . . . sweet!", "author": "Bruce R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-06-16", "description": "I had a fine scrambled egg bagel sammie this morning, though I was distressed to read (just now) in Tommy S.'s review that there are some unsanitary, non-handwashing habits going on.  Yuck.  One person made my egg sammie, and another took my money, so I didn't notice, but Tommy's review just seriously turned my stomach.  Bleh. Bleh.  Bleh.  \n\n(The eggs were fine, the avocado fresh, so I was fine with the edible part of my experience, and I hope Tommy's wrong, or that they've changed their ways.  I thought another reviewer's point was fair, which was that you can make just the same at home, so it wasn't extraordinary.  But it was a solid three stars.  Assuming the handwashing issue is fixed.  Blech.  Yuck.  Kills me.  Big yuck.)", "author": "Laurel B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-08-11", "description": "I can't remember why I ended up on Potrero Hill last Saturday, but it was around lunch time and this seemed like a good place for a nosh.  The sandwich combination I ordered was delicious (including the bread) and the staff were not only competent, but friendly and present for my order.  The cafe space, although small, was nicely appointed and welcoming (inside and outside).  I look forward to coming back again.", "author": "Eric B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-04-08", "description": "I really want to love Hazel's - it is an absolutely adorable little take-out/sandwich shop in my neighborhood. In addition to sandwiches, they offer a few hot  dishes (i.e mac and cheese) and salads. \n\nI have only gotten food from Hazel's twice, and both times they were out of the thing I wanted (bad luck or standard fare; I'm not sure). Yesterday I got a truly mediocre $9 \"chef's salad,\" which was clearly just standard sandwich fixings in a to go box, topped with a super bland dressing that I had to doctor-up at home (insult to injury).\n\nAccording to my husband, the sandwiches are good but a little scant in the meat department.", "author": "rachel m."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-02-17", "description": "I like the location and the retro-grandma design of the store and the graphic design. And, that you can bring your food to Farley's.\n\nHOWEVER, it's always service with a snarl and the ladies behind the counter always seem displeased to see you. The sandwiches are made of cheap ingredients and remind me of something you'd get a the deli counter of a Safeway!\n\nIt's such a missed opportunity to go full-on and keep up with San Francisco's food quality AND keep the vintage vibe. I wish they made watercress sandwiches, yummy deviled eggs and good fresh bread and quality sandwiches. Instead, the food tastes like cardboard.  The mac and cheese? Awful. Salad? Yuck.\n\nThe stars are only for the cute look of the place. The designer deserves a 4-store for re-vamping a hole in the wall to such a cute spot. But  that's not reason enough to go there, esp since it's take out only and food is not good.", "author": "Lala B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-03-10", "description": "These are sandwiches the way you wish your mom would've made them for you! A very homemade, California-fresh feel, with friendly service to boot.\n\nThere's no space to eat inside so plan to take out unless it's a sunny day  and the tables are open.", "author": "Mel C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2005-11-20", "description": "The best sandwiches in the city.  The secret...fresh, quality ingredients piled atop very good breads.  Simple yet effective.\n\nOh yes, the service is ALWAYS friendly and welcoming.  \n\nLine can be a little long at lunch time but you'll typically have your sandwich in 2-10 minutes.", "author": "Brent R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-05-20", "description": "A sandwich shop with sprouts!  Now that's a great sandwich shop in my book!  My coworker ran and got sandwiches from this place for lunch recently and wow was I happy she did!  Since everyone on the menu sounded so tasty we decided to share a couple different sandwiches.  We had the #1b Roast Turkey & Swiss with Pesto on Dutch Crunch and the # 5 Avocado, Cucumber, Tomato, Sprouts & Jack on Whole Wheat.  Both were amazing! And very filling!  I didn't even have to move on to the tasty chips they also offer.  But actually who needs the sides when the sandwiches are this good!  Can I just say \"have you checked out the menu!\"  All of the signature sandwiches sound great, they offer all of my favorite bread choices, they have sprouts!, compostable wrappers and recyclable containers and great combinations!  Five Stars for sure!", "author": "Jennifer B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-12", "description": "Yum! Always excited to see veggie chili on a menu, and thrilled when it is tasty! The double fudge brownie was amazing when resurrected from the bottom of the purse later.", "author": "Elizabeth C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-07-23", "description": "Licking cranberry off my fingers while typing probably isn't the best time to write a review...\n\nBUT, I just couldn't wait to give Hazel her 5 stars. I've been to Hazel's Kitchen quite a few times before, here in Potrero, and am now asking myself how I manage to drive by so often without stopping. Well, lets just say I'll be pulling over more frequently.\n\nI'm done licking my fingers and just finished the Roast Turkey & Smoked Provolone with Cranberries sandwich. Hazel (aka Leslie?) is not skimpy when it comes to making a sandwich. Even on sliced bread, the sandwich was huge, scrumptious and so fresh. Really, it's just amazing how she can make a somewhat ordinary sandwich taste so extraordinary.\n\nThe little kitchen has a great feel to it too. Light and airy. Great design too (thumbs up to the designer - I grabbed his card as I'm a graphic designer as well). Her young son rang me up and the little guy was quick and a whiz at math too! Great family feel to compliment the quaint environment up here on the hill.\n\nFive stars, great sandwich, great service... Thanks!", "author": "Greg Ciro T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2007-04-02", "description": "Shameful sandwiches.....\n\nFive of us ordered food (sandwiches, chili, salads) to go from Hazel's.  The sandwiches had literally TWO slices of seemingly pre-packaged deli meat, one slice of cheese, and not much else.  I ate the first half because I was super hungry, and didn't eat the second half at all.  \n\nTwo of my co-workers who ordered sandwiches actually had blue marker ink on their BREAD.  Apparently the marker that the sandwich maker used to write the type of sandwich on the wrap is of super industry grade.....\n\nOh, and don't order the macaroni and cheese, because it costs close to $8, the portion is ridiculously small, and they conveniently forgot to put the salad (that's supposed to come with the macaroni and cheese) in the bag!!!\n\nUnacceptable!!", "author": "Yelper F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-03-13", "description": "The turkey sandwich, with cranberry sauce.  It is so delicous, it almost made me cry... twice.\n  \nNot only do they make a delicious sandwich, they sometimes throw fruit-flavored tootsie rolls into their to-go bags (no joking).   I'll never forget the day I finished a sandwich from Hazel's, then discovered a green apple tootsie roll in the bag under those folded-up napkins I forgot to use... amazing.\n\nI hope Hazel's never leaves.", "author": "Greg G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-11-10", "description": "Soooo goood! Super friendly, courteous and accommodating.\nI highly recommend the hot steak sandwich on dutch crunch  and the caesar salad!\n\nSuper, super  cute neighborhood gem with high quality food.", "author": "mary s."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-04-07", "description": "I walked over there to order a sandwich to go. It was my first time and I think I got there at the right time (around 12:15) because after that, there was a big line.\n\nI ordered the BLT with Avocado on Whole Wheat.....\nYUM. I loved that the bacon was very thin and crisp. There were crunchy cucumbers and tomatoes in there along with a TON of Avocado. Usually there is just a slice or two in there but mine had a bunch.\n\nDELICIOUS.....\n\nWhat they also get extra kudos for is that they give you two tootsie rolls in your bag. Yeah!\n\nI didn't give them 5 stars because I didn't eat it there nor did I try anything else. But I am most definitely going back there soon.", "author": "Christine S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-04-06", "description": "After hearing from some buddies that the sandwiches as Hazel's Kitchen were really good, I recently had the opportunity to try a sandwich.  When I walked into Hazel's Kitchen, I liked the feel of the place with a household kitchen and friendly small business feel, the type of place I usually especially like giving my business to.  \n\nAs far as the food though, first off, a one star might be a little harsh but the rating is purely on the hot pastrami and swiss sandwich.  I ordered the pastrami and swiss sandwich and when the cashier said that my sandwich was ready, I looked at the sandwich and said, \"I think this is the wrong sandwich.\"  The cashier clarified that this was the right sandwich.  Huge disappointment, my pastrami sandwich had so little meat I couldn't even tell if I got the right sandwich because it was covered with lettuces and other garnishes. When I think of a good hot pastrami sandwich, I think of a sandwich overflowing with meat and usually on rye bread.   \n\nI have heard the other sandwiches are great from friends, but I was disappointed in the hot pastrami sandwich.  The pastrami was average tasting so if it had more meat it probably would have been worthy of about 3 stars.", "author": "Josh K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-16", "description": "i don't usually spend money on sandwiches unless they're worth it, and i don't usually get chicken cuz i all about the beef, but just had the Chicken Chipotle on seeded roll and IT WAS AMMAAZZZZIINNNGGG!!!!\n\nsandwiches are usually juicy but not soaking wet, and they're definitely thick.\n\nget at it.", "author": "Pris C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-02-19", "description": "Yummy turkey cranberry sandwich. \n\nSlow slow slow service. Like \"makes me want to jump behind-the-counter and make the sandwich myself\" slow.", "author": "Erin H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-03-22", "description": "Hazel's Kitchen is my favorite neighborhood eatery.  I have been eating at Hazel's nearly every day since I moved to the neighborhood, enjoying their sandwiches and breakfast burritos.  Recently Juan and Alma, the friendly chefs of the kitchen, have been creating some new tasty treats.  My recent fave for lunch are the tacos, and my new breakfast treat is the belgian waffle with fruit!  Mmmm!  Better than the food is the friendly service from Leslie, the talented and successful owner, and from Aimee, who remembers my order, and always offers a friendly smile.  Thanks guys!  This review is long overdue!!", "author": "erica s."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-08-17", "description": "Note: this is a review for breakfast at Hazel's - not lunch. I plan on returning for lunch to see if it's any better!\n\nBeing next to Farley's, I had high hopes for Hazel's. I was really disappointed with their breakfast selection. Completely uninspired \"egg & bagel sandwich\" was just exactly that. Literally an egg plopped on a bagel. So you gotta add tomatoes or sprouts or cream cheese, etc. Each additional topping costs more. Lame. Totally lame. The giant \"WE HAVE BAGELS\" sign out front led me to believe they had bagels. But, actually, what it should have said was, \"WE HAVE BAGEL\", as the only bagel choice that was left was a garlic bagel. Not a bad bagel, but still worth noting that they don't have much of a selection. My $5 bagel sandwich was good, but definitely not worth $5. \n\nI am looking forward to returning for lunch - hoping it'll be a better experience!", "author": "Jono K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-06-04", "description": "Been back several times since, and happy that the cash and food have since been separate each and everytime. Must've been  a new hire glich...back to lovin' you, Hazel's.", "author": "Elle N M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-08-09", "description": "Good lord, I can't even begin to describe how awesome their chicken pesto sandwiches are. But don't you worry, because I'm going to try:\n\nThe sliced sourdough is moist and firm and with just the perfect hint of flavor-adding goodness that any bread should add. The wonderful assortment of tomatoes, lettuce, and cucumbers is superbly fresh and tasty and in just the right ratio to the focal point, which of course is the slices of chicken which are quite thick and juicy. And the pesto sauce--- oh, how I love their pesto sauce. I haven't tried this option yet, but you can add their wonderful pesto to ANY sandwich for just 50 cents more, so if you're not a chicken lover too, that'd be a good way to go.\n\nPlus, everyone there is super friendly, and I don't understand why some people have said they are slow at making the sandwiches. Helllo, if there are 10 people waiting in front of you, that's 10 more sandwiches to make before yours! Just go chill outside for a while on this lovely section of 18th street. I promise it's more fun that hovering over the counter and freaking out for 10 minutes until your sandwich is ready.", "author": "Ryan L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-01", "description": "Delicious breakfast burritos, so good they melt in your mouth!", "author": "Kate V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-07-27", "description": "Hazel's is quite simply the best take-out sandwich joint in the City, and I've tried 'em all. The sammies are tasty and affordable, the place is clean, the service is warm and friendly, it's everything you need. Take your lunch next door and enjoy the ambiance at Farley's. It's a win-win.", "author": "TJ Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-08", "description": "Great food Great people. \n\nVery good neighboorhood deli.  Great for breakfast and lunch.  Food is well prepared with a very friendly staff.  Love the sandwiches.  Keep up the good work!", "author": "Larry W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-05-31", "description": "I'll give it one star because they're still in business and two stars for location, location, location.\n\nIf you like your sandwiches drenched in runny mayo, wet lettuce and tomato, and aggressive red onion pilled high then this is the place for you. My biggest complaint would be the false advertisement on the 'rare roast beef'. The roast beef on my sandwich was about as rare as 1-day old road kill. I took a bite off a second sandwich (my wife's), grilled chicken something or other, and well the overlap to my sandwich was incredible. The taste of the chicken got lost in the mayo-lettuce-tomato-cucumber-red onion juice. Y U C K  I E S.\n\nAs a general rule, not being in the restaurant business, if there's too much sauce or gunk on food, then it simply isn't clean or high quality. If this sandwich was $5 no problem, but we're talking $8 plus... and so I've come to expect more. \n\nI was so insulted by their interpretation of 'rare roast beef' that I called the manager and I was told that next time I should ask \"How rare is today's advertised rare roast beef\"? This sounded a bit absurd, should I ask my Barista at Starbucks how much caffeine does my espresso have TODAY?\n\nPrediction:  The popular breakfast burritos (which I haven't tried) will be loaded with some concoction of tomatoes, red onion, garlic, and vinegar which they will call pico de gallo... to again... hide the taste/quality of the real ingredients but to appeal to the unsophisticated palate. It's the same formula that 1001 Chinese food restaurants follow in metropolitan areas all over America... for instance.\n\nI'm new to the area so I may go back for safe choices such as bagels and oatmeal. I challenge the crowds outside to expect more from your food. Don't sacrifice taste or quality for convenience... especially as there are up and coming establishments just a short bike ride away.", "author": "Ivan A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-05-18", "description": "Change the name to Dirty Hand Hazel's with attitude!\n\nI don't know why the girls that work here have such a bad attitude, if you don't want to help people and take orders then don't work in the service industry. Also, don't take orders then proceed to help make sandwiches without washing your disgusting mits. I just noticed this today and while it wasn't my particular order that was being violated with money filth, this is clearly unexceptable  and I have every right to call the health department and let then know about this unhealthy practice.\n\nAlso, I don't know how many times we've gone in and they tell us it will be 5 minutes and we'll end up waiting 15 or 20 minutes. One time we called ahead thinking we'd just walk right in and pick them up 10 minutes later. No chance. Even though we called ahead, we got there with no one else was waiting and they forgot to make our sandwiches and didn't even apologize for screwing up. I live in this area and I think it's important to support your local shops and eateries but, Hazel's can keep their bitchy attitude and poorly made sandwiches. I'd rather go to Togo's then deal with the constant screw-ups and crabby workers. At least I'll get chips and a drink for the same price and they wear gloves while making their sandwiches. What a concept!", "author": "Elizabeth B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-04-20", "description": "Hazels is just a very, very cute little breakfast & lunch spot.  It's got old-timey charm and good little breakfast burritos.  I really love the veggie sandwich (add sun dried tomato spread), but get it on toast, the bread kinda falls apart otherwise.  Veggies are wet.  :)  They couldn't be friendlier and the place couldn't be cuter.", "author": "Emily T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-05-10", "description": "Average.  Not awesome, not horrible.  Cute little local sandwich + shop in a quaint little neighborhood.  The meat seems processed and they have a funky(for my taste) secret sauce.  Friendly and fair.  Give a try, but the best sandwiches on Potrero Hill are at Chiotra's on Rhode Island, between 20th and 21st!!   Cheers..........", "author": "Jeff N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-01-11", "description": "It's been years since I've gotten a sandwich from Hazel's, but the return visit had me asking why I waited so long?  I ordered a turkey with cranberry on dutch crunch and rather than finding a rotting piece of lettuce mentioned by another yelper, I tasted only the freshest ingredients.  My side of greek cucumber salad was equally fresh and delicious.\n\nI guess I must've gotten lucky because my sis, who eats here more often, has mentioned the inconsistency of their sandwiches.  That seems to match other yelp reviews, but based on my most recent experience, I have to give Hazel's 4 stars.", "author": "Janut B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-11-06", "description": "Super small but super great too. I really enjoy the sandwiches here. They seem to have interesting specials too. It's not to fun if its raining and there's a bunch of people since the place only holds about 5 people but it is definitely worth it.", "author": "mark h."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-01-08", "description": "The guys at Hazel's Kitchen make a good sandwich. Fresh ingredients, fresh bread, and no irritating reminder \"it's extra for avocado\", like Whole Foods gives. \n\nWe build our own: turkey with avocado, lettuce, tomato, red onion, pesto and light mayo, on toasted dutch crunch. It's addictive. Have it once and you'll find yourself thinking about it the next day around lunch time. You might just go back and get it again.\n\nThe minestrone was good, but don't eat the tiny meatball in it. It's a small hamburger lump.\n\nThis is a no frills shop with food to go. The outdoor tables are nice in the summer, but in the winter, get your food and then go next door for coffee. The coffee shop will let you eat Hazel's food at one of their tables as long as you patronize them as well.\n\nThis is 3 stars, not 4, because we've never tried the salads, which are the other half of their menu.", "author": "Simone E."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-02-21", "description": "Hazel's is cute as a button. I mean really cute. It's small. If it were a puppy, it would be a Maltese http://www.kateconnick.com/postcards/harleemalt0304.jpg or a chihuahua http://www.chihuahua.hu/kepek/tucsisztar.jpg Unfortunately this may explain Hazel's Napoleon complex - you'll understand in a moment.\n\nEach time I visit Hazel's I stare agape in amazement as a three person crew deftly whisks about a kitchen the size of a postage stamp. Not only is it small as a thimble, but kitchy like a thimble. The whole shop is tastefully done up in pastel with 100s of knick-knacks and matching dishware. One wonders does food actually come from this play kitchen?\n\nIndeed it does. And it's decent... tasting. I've had a garden salad with tuna. It was delicious - but totally weird. When taking my order to go I was like, \"Damn! This salad's heavy!\" Is this good value for my money, or just overcompensation for a pint-sized kitchen? The salad had nearly a whole mixing bowl of tuna on top. I mean, there was at least a pound of the stuff - a one inch tuna layer to dig through before you hit any greens. There was no way I could eat all that tuna. Did I mention that fisherman were out of work because the sea was now devoid of tuna?\n\nAnother occasion I ordered a roast beef sandwich and forgettable macaroni side salad. My friend and I shared at a cozy pastel table on the sidewalk. The sandwich was tasty but Hazel's hangup reared its ugly head again. The sandwhich was nearly 4 inches tall. Despite my best effort to unhinge my jaw I couldn't wrap my maw around it. I had to take a play from Napolean and divide and conquer my lunch.\n\nQuarter point added for free Ritz crackers for kids and giants, like me, to nibble on while waiting for sandwiches.\n\n(3.25 * stars)", "author": "Brady K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-10-20", "description": "Had a disappointing sandwich here today after hearing and reading positive reviews. Had the rare roast beef sandwich  which wasn't - brown is not rare. Whole wheat bread had the flavor and texture of brown Wonder Bread. Horseradish mayo had very little in it and the quality and the bread made the sandwich fall apart. Maybe I ordered the wrong thing but the experience reminds me why I don't generally like most deli style sandwhichs. Should have spent extra $$ for the awesome BLT or grilled cheese at Plow.", "author": "John B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-12-23", "description": "excellect menu, but not as good as the seem to rush orders. My tacos were pretty flavorless and soggy hot off the grill. A bit overpriced at $7.95. staff is super nice! ill give their sandwiches a try as that seems what they are known for. best to stick to mission if u want tacos :)", "author": "Sharif R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-03-22", "description": "Cute sandwich shop in the Potrero Hill area...the food is decent for a quick bite, but the service is a little out of it (though they redeemed themselves, read on) and the food isn't something you can't find elsewhere (albeit, the ingredients are very fresh and seem like veggies from a great summer day, which you can't find everywhere but you can still find them at a grocery store and other small delis).\n\nCame here today with a group of people, and my boyfriend had a roast beef/horseradish sandwich (very crisp and fresh veggies like tomato and cucumber, no soggy or shredded lettuce type fare, the horseradish was a good touch), and I had the mac and cheese (very cheesey, baked together like a mac and cheese casserole with a crumbly top, pretty good). However, the salads in the display case didn't look too fresh, I requested a fruit salad and only after I paid and my mac and cheese was ready did they tell me they didn't have any fruit salad (they mentioned they had ran out earlier, but just didn't think to tell me when I was ordering, thus, the 'out of it' ness I referred to earlier). \n\nHowever, the service was definitely nice and not snarling. The woman behind the counter smiled and said I could have a bagel instead of the non existent fruit salad. She also asked if I wanted any spread and if I wanted it toasted. That totally made up for the 'out of it' ness.", "author": "Katherine P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-03", "description": "Went in here for lunch one day. Nice sandwich selection. I got the Veggie special sandwich. sooo yummy. My friends and I all loved our sandwiches. \n\nThe only downside- mine took FOREVER to come. It's raw veggies on bread, it shouldn't take 15 minutes for it to come out, especially when there is no one else in line. My friends sandwich, with cooked meat in it, came out a full 10 minutes before mine. Maybe they were making sure the vegetables were extra fresh...", "author": "Ellen R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-02-07", "description": "Okay, Hazel's Kitchen promotes its \"Hazel's Bagels\" prominently. But I asked the woman who works there about it, and she told me they don't make their own bagels! I mean, isn't that false advertising? She seemed really perplexed why I was bothered that they call them \"Hazel's Bagels\" even though they aren't homemade. I guess they put the sandwich fixin's on the bagels themselves, but somehow that still just doesn't ring true for me. \n\nNevertheless, Hazel's Kitchen makes a fine sandwich. And their interior decor is really cute with its retro look. And they are conveniently located right next to Farley's, where you can eat your sandwich along with a big cup o' coffee.", "author": "Melinda K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-03-12", "description": "The design is quite unique and the place looks like one of those rare san francisco finds. The food was okay. Certainly not the best I've ever had and I agree with the other person who commented that it's \"service with a snarl\". \n\nI had the roast beef special which was decent though I wouldn't consider it worth the high(er) price. The best part of the sandwich was the bread.", "author": "Adam P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-05-20", "description": "I've wanted to try Hazel's for a while and finally did.\n\nWe ordered the beat salad, veggie Asian salad, and quiche. As a beet salad expert, I can tell you that this one is definitely delicious. The veggie salad and quiche, however, were a complete waste.\n\nI watched the lovely women behind the counter making sandwiches while we were waiting for our food and wish I had ordered one. The rare roast beef with swiss cheese and horseradish mayo sounds divine.", "author": "Brad C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-09-07", "description": "The first couple of times I went to Hazel's, I liked it. There were quality ingredients in my sandwiches, they were well made and tasty and the staff was nice and helpful. I've come to realize that that's because the owner took my order. I wish she would hire some people with good customer service skills instead everyone's got a bad attitude and the sandwiches have really gone down hill. The last time I went the bread was stale and this time, the ingredients were meager (I could've eaten a plain baguette and been happier) and there was really nothing good about it. I won't be going back.", "author": "amy W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-12-13", "description": "The #8 BLT with Avocado is my favorite! There is always a line, but moves quickly! Well worth it. The sandwiches are well worth the $7.50 as they are loaded to the max. They are not skimpy with their meat selection. I also happen to enjoy the tootsie rolls that are found in the bag as well!", "author": "Tiffany L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-10-30", "description": "Hazel's Kitchen has wings...\nRemember spending the night spitting blood and hatred at the world after loosing your first tooth, only to wake in stupid fascination with a dollar bill and instant belief in faries?  Makes the pliers worth another visit, right?  The owner of Hazel's forgot my add-on bacon, and gave me a  FREE sandwich the next time.  I stopped believing in that kind of service long ago.", "author": "Brad B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-11-20", "description": "their homemade dressing totally makes the sandwich.  i have only tried their vegetarian and tofu sandwiches, but those two alone get a standing  ovation in my book!  \n\ni love how they pile on the ingredients evenly.  you can wrap your mouth around the sandwich and bite down without lock jaw.  they put tlc in making them.", "author": "Sheri N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-03-09", "description": "Yum yum yum!! This little place has absolutely FANTASTIC sandwiches! It's really small inside with minimal outdoor seating but perfect for take out/to go. The line gets pretty long at lunch, but the staff works hard and efficiently to make the food in a timely manner. Highly recommend!", "author": "Stephanie J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-01-13", "description": "Yummy sandwiches, great soups/chilli, best part is that you can take it next door to Farley's which is one of the best coffee joints in town.", "author": "Rachel L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-04-17", "description": "Ok sandwiches, although I don't like them all.  The bread I had was stale and old, although that may be the exception.  The wait was long.  Other than that, an average sandwich shop.  The sub place in West Portal is much better, though.", "author": "Honey L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-01-10", "description": "Sandwiches like your grandma would make.  If she loved you very, very much.  Fresh, high-quality ingredients.  And the salads and specials are yum, too!  If you're feeling confident about your bootang, get the mac and cheeeeeeeeeeeese...", "author": "Rosie W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-08-29", "description": "Last time i went to hazels i was just getting sick and i was craving the usual - roast beef and cheddar and seeded roll. Instead i ordered the lunch box with 1/2 avacado sandwich, corn chowder soup, and bean salad. Why oh why did i order these things when sick!? Despite this, Hazels is known for consistently wonderful food, great value and those yummy little candies they always throw in the bag. Thanks!", "author": "Jessica W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2006-10-11", "description": "I had a very unpleasant experience here when I went for lunch and ordered the turkey and cranberry sandwich.  There was something that was neither turkey nor cranberry in there and I couldn't bring myself to finish the whole thing.  I'm pretty squeamish about food.  And I don't know where they get their cookies, but mine tasted like it was 3 weeks old.  I know cookies, and these were really bad.  I'm sure they taste fine when they are fresh but they really shouldn't sell old baked goods.  They should throw them out after a week or less.", "author": "Jin W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-04-26", "description": "Yummy yummy pesto sandwiches!  They even toss in a little piece of candy.", "author": "Becky P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-03-27", "description": "Hazel's simply rocks.  Ya'll fed me well for a year and a half of lunch breaks while I worked in Potrero Hill.  It's well worth the 20% grade walk up Missouri St for their three bean salad or yummy sandwhiches and friendly folks.  I hear it's named after the owner's best friend's grandmother or something, so I guess there is no Hazel hanging out in the back, but whoever she is, keep on, keeping on.", "author": "Ben V."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-01-22", "description": "I can't say I generally enjoy this place. My co-workers seem to love it, but every time I go my sandwich is beyond sub-par. My biggest complaint was the thickness of the pastrami. It was literally like trying to chew through leather. Maybe they're veggie sandwiches are alright, but I'll more than likely refrain from coming back again.", "author": "Bradley D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-11-07", "description": "UPDATE: this *was* a 4-star review. Until I went in today to get a sandwich and the woman (with long, loose hair) was handed a taste of something being made by a co-worker and then LICKED HER FINGERS while she was making my sandwich! I WAS MORTIFIED!\nI told the countergirl that she might want to suggest that the owner (?) NOT LICK HER FINGERS while making food!\nWhen The Licker handed me my sandwich, she said, 'what's wrong?', to which I replied, \"I'd prefer it if you didn't lick your fingers while you were making my sandwich. I'm going to eat it because I'm starving.\" (which I realized later wasn't a good idea, I pulled the sandwich apart and ate the half that she didn't touch post-lick, which was only the lettuce). I ended up only eating the meat, cheese and half the bread, discarding the potentially tainted veggies. YUCK! I was too hungry to think straight, or I'd have demanded a remake by a hygienic person.\nEven if the maker had not LICKED HER FINGERS while making my sandwich, it was lame today. The bread was tough, the tomatoes color/flavorless. boo. I won't be rushing back to Hazel's any time soon. Too bad, since I've had four or so great lunches there in as many weeks. I'm pretty sure I can find a sandwich joint whose cooks don't LICK THEIR FINGERS as they go. \n\nOH! And the best part?? She held up her non-licky fingers, and said, 'I didn't touch your food, I used these fingers.' AS IF THAT MAKES IT BETTER! I am horrified. Don't go to Hazel's, at least not until they train their sandwich makers to NOT LICK THEIR FINGERS (and aren't they supposed to be wearing gloves, anyway?)!!!\n\nHazel's introduced me to the gorgeousness that is dutch crunch bread. OH MY GOD, what wonder! Have I lived under a rock all this time? Maybe so.\nA turkey sandwich with cranberry sauce and provolone, on this magic bread. Perfect.\nI had some black bean soup too, it was delish but too salty.", "author": "Amani Ellen L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-14", "description": "How come my sandwiches never taste as good as the ones I buy out?  My friend and I split a tasty tuna salad 'wich from Hazel's, and we fought over the crumbs.  Delicious.  Well-priced, too, at $6ish.", "author": "Jennifer O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-10-08", "description": "5 Star Sandwiches! I LOVE their tuna. The portions are very generous and the owner is lovely. A real neighborhood gem! They catered a small meeting for me, and it went off without a hitch! Oh, and it's on sunny Portrero hill. Amazing!", "author": "jody l."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-11-17", "description": "Yes yes yes.  This place is really worth the five stars (and I don't write many of these five star reviews).  I am completely addicted to their vegetarian sandwich (#5).  Fresh vegetables, avocado, cheese all HEAPED on top of fresh homemade bread, slathered with mayo.  There are not many times one would think of a veggie sandwich being hangover food, but honey, this sandwich has killed my hangovers for years.  And the owner of the place is the most precious jewel of them all.", "author": "Sarah F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2005-12-02", "description": "mmmm turkey sandwich with cranberry sauce, best sandwich ever.  CUTE is the word to describe this place.", "author": "Debbie Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-06-15", "description": "Agreed, the sandwich is a good one.  I'll go back for the turkey + cranberry sandwich any day.  But the cookie -- I don't get it.  Best cookie in town?  Hummmm....I didn't experience the euphoria others have.  Mediocre at best.", "author": "Rufus X."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-04-01", "description": "Hazel's is a great local joint that has much more than delicious sandwiches. They have daily specials of quiche, tacos, lasagna, unique salads, baked mac and cheese, and more. I love the fact they put cucumbers on all their sandwiches and serve them toasty by request.", "author": "Mike A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-12-05", "description": "Dee-lish. I decided to try out the sandwich shop by taking a friend there for lunch. I had the BLT w/A and he had the Roast Beef. I know my sandwich was delicious but I think my friend said it best. Midway through his 2-3rd bite he said, \"Wow,\" (chew, chew chew) \"Oh my God, this is sooo good.\" 'Nuff said?", "author": "Jeff G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-10-30", "description": "A weekend staple when I can get it. A coffee from Farley's, a bacon breakfast burrito, good company, and people watching. Its just a tortilla with cheese, egg, meat, and salsa, but its oh so good...or maybe its oh so convenient....either way it warms my belly. Remember to pour on the Tabasco!", "author": "Stacy T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-08-12", "description": "My, what large nipples you have Sir. Normally, I might not have noticed, but since we ordered nearly 20 minutes ago, there are only so many places for my eyes to wander as I wait out here on the sidewalk, and you stand there so awkwardly in that oddly sheer shirt. Geez, Hazel hurry up! I spent $8.50 to be disappointed by your small, severely overdressed Chicken Caesar salad.", "author": "J F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-01-24", "description": "I've never met Hazel but she sure has a legacy of awesomeness to live up to. The lovely ladies at Hazel's make the best sandwiches and are always super friendly.  Mornings bring bagels with as many veggie fixings as you could want, all for like $2. Cheapest loaded bagel eats on the Hill. They also do a brisk business during lunch, so you will often find a line 5 or 7 people deep around high time. Well worth the short wait and a good way to meet your neighbors. Take your order next door to Farley's and munch it down with some coffee while perusing a magazine from the rack. It's ok and encouraged!", "author": "Eddie C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2005-07-27", "description": "This is a great place in a quiet nieghborhood to grab lunch. Right next to Farleys. Sandwiches are hearty, salads, fresh, and the ladies that work there, very sweet.", "author": "Angela C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-10-31", "description": "worth the wait...sandwiches made just for you, so many choices..daily salads and soups wonderful. Today my children had the kids quesadilla (4.95)...don't go if you are in a rush...nice to enjoy outside across the street in the sun! So delicious!", "author": "Nancy H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-10-24", "description": "I heard great reviews about this place and well since I was in the neighborhood, we stopped by here to get lunch. Very nice, cute little sandwich shop. They also serve homemade pasta and burritos. I ordered the turkey, swiss,pesto on wheat and she had the chicken quesadilla. I think I should have chose the pesto lasagna. But it was very good. Long line out the door though and some outdoor seating if your lucky enough to grab one.", "author": "Mauling W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-11-28", "description": "I do my laundry across the street, so I thought I would check out Hazel's while I was waiting.  I had the turkey and cranberry (it was before Thanksgiving and I was craving it.)  I thought it was delicious!  It was full of veggies and I didn't think there was too little meat, and the bread was soft and fresh (I had wheat.)  Next time I would get it without their sauce or light on the sauce because there was way too much.   The staff (two younger girls) were very friendly and fast, and it is decorated so cute!  I just wish they had fountain pop.  Next time I will definitely try the mac and cheese!\nUpdate:  tried the mac and cheese.  Disappointing.  It would have been delicious if it was fresh out of the oven, but it was microwaved.   What can you expect given the size of the location and who they are catering to, it's not a sit down place.  Definitely edible and you even get a salad to go with it (though why is it every time I go in the options are coleslaw, 3 bean salad, or fruit, come on get some variety!) but probably won't order it again.", "author": "Sarah M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-11-07", "description": "Meh, 'split pea soup' more like bland green water with slices of deli ham tossed in carelessly. They're super nice, but man, do they need to step up the soup, especially now...soup season.", "author": "Colleen B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-09-28", "description": "Okay. This is tough. I love the sandwiches here. Really I do. But I walked up to the counter and the lady behind the counter left to check out her friends new cool track bike and was gone for about ten minutes. I mean really people? Its like you haven't seen a track bike before? You have a customer, that is ready to order. You put them on hold for a frickin look at a bicycle. Sigh... i was late getting back to work and I blame this lame hipster. Get a job at a bike shop. Back to the sandwiches! They are great! Avoid hipster bike obsessed girl and you will have a wonderful meal!", "author": "Jeff R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2005-05-09", "description": "Hazel's Kitchen is one of the best sandwich joints in the whole city. Even though they really have only one veggie (the number #5 on sliced sourdough, ahem) it is quite excellent; the avocados are always fresh and the tomatos nice and juicy. However, don't forget to buy a cookie. They sell one of *the* best cookies in all of SF made by 'The Cookie Freak', which I'm to understand is a sole woman in her kitchen. The cookies alone are worth your trip! I think the homemade ones at Hennessy's on 2nd are the only cookie competition.", "author": "Troy E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-02-18", "description": "Hazel's homemade sandwiches epitomize California -- always fresh and healthy, yet simple.  They even sometimes have creative-sounding tofu sandwiches that I as a carnivore have even contemplated trying.  I come to this cute mom-and-pop shop in my 'hood on a weekly basis.", "author": "Chris P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-04-30", "description": "This is a true neighborhood spot with delicious food.  Hazel's is so inviting (maybe because they know their customers by name), but as soon you walk inyou knowyou'll be taken care of.  I love it!", "author": "Danielle W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-13", "description": "Hazel's is a cute little hole-in-the-wall where the food is prepared right in front of you.  I often stop at Hazel's for breakfast and Farley's for coffee while I'm doing laundry on a weekend morning.  A breakfast bagel with egg and avocado is a great way to take the edge off a couple hours at the laundromat...", "author": "Lindsay G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-03-05", "description": "Beautiful brunette working the register. Beautiful blonde making the sandwiches. Ridiculously cute establishment on the whole. Didn't care that they were out of eggs (it was 3 in the afternoon, after all). Delicious sandwiches. Sentence fragments to represent hungover state of trip there. Four stars.", "author": "Pete J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-09-29", "description": "The people who work there and the food is AMAZING! They were so generous with providing food for a fundraiser that I was helping to put together. Everyone who had sandwiches was raving about them. You must try the Roast Turkey & Smoked Provolone with Cranberries and the Rare Roast Beef & Swiss with Horseradish Mayo. They are both so good, I'm getting hungry just thinking about them! Not only are they delish, but they are HUGH! A great buy for your buck.", "author": "sarah r."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-04-23", "description": "Now that Klein's gone, what choice do I have for a sandwich under 4 blocks away?  Hazel's!  I used to love the place for a breakfast bagel on the weekends, but now I also get their yummy BLT with avocado.  The bacon is fully cooked and crispy, and there is plenty of avocado.  Yummy!  Not the cheapest sandwiches, but they're comparably priced to my work cafeteria and higher quality so I'm not complaining!", "author": "Amy L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-05-29", "description": "I went back recently, and they changed the mac 'n cheese.  It's OK, but not nearly what it used to be.", "author": "Lesley G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-04-06", "description": "I love this place for it's awesome breakfast burritos. Reasonably priced, friendly staff, decorated in a homey and comforting style. You can't go wrong with a sandwich from Hazel's!", "author": "Francisca J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-11-20", "description": "The other day I had  at Hazels the best BLT sandwichEVER!!!!!!! totally recommend this place, also their classic turkey provolone cranberry is delicious  and the salads mmmmmm..... and the people who work there are very very nice!!", "author": "Yvette F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-03-07", "description": "Favorite work lunch spot. They have cards that you get punched, and after ten punches you get a free sandwich. So after  going to get lunch for everyone I get a free sandwich out of the deal.", "author": "Pam J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-04-21", "description": "The #5 (veggie: avacado, sprouts, cucumbers, other veggies) is my favorite. This is not a place to visit when you're in a rush, cause they lovingly take their time to make each sandwich.", "author": "viv k."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-05-03", "description": "I ate at Hazel's for the first time today...you wouldn't think that a sandwich could taste so darn good, but this was seriously delicious food. Forget about the sides and chips, the sandwich was huge. My partner had the turkey and cranberry with provolone cheese and I had the roast beef with horseradish mayo and thick slices of swiss. Cucumber slices, fresh tomato and onions added some crunch and the bread was soft and perfect. My belly is so happy right now. The prices were totally appropriate for the food. Hazel's is my new most favorite sandwich place in San Francisco. No seating inside...a few tables outside...seems like a take away place only. Worth the trip to Potrero.", "author": "Richard F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-02-29", "description": "This place is adorable!  Sit on their munchkin sized chairs while you wait and you can be adorable too!  Their sandwiches aren't bad either.  They remind me of the kind of sandwiches my high school cafeteria used to make which were by the way, so good that I still came back to have one of their sandwiches well after I graduated.", "author": "Jean A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-01-19", "description": "Great chef's salad.  Well rounded proportions, your choice of ingredients.  Be sure they get your order correct because I happen to know one loyal yet lately disgruntled customer.  Ritz crackers and candies to snack on while you wait.  I am enjoying an oatmeal chocolate chip cookie as I write this favorable review.", "author": "Melissa B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-01-21", "description": "I do laundry across the street and always notice a line coming out of Hazel's Kitchen.  I was starving and decided to try it out.  But I waited to see if the line would dissipate.  It didn't.  I braved waiting in the cold.  I know it's sunny Potrero Hill but it's been freezing for the last two weeks and Hazel's Kitchen was on the shady side of the street.  I ordered the vege sandwich and asked for cucumbers and a small vege chili.  Hazel's Kitchen's interior looked like something I would find in a Martha Stewart magazine.  It was nice and clean.  I thought the sandwich was a tad too expensive(total $10) for what it was(not loaded enough) and the chili was just okay.  Oh and they forgot my cucumbers.  Boo.", "author": "Joni S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-06-11", "description": "Good sandwich, albeit too thick. But I really liked the quality of the ingredients that went into making the sandwich. That day, I had the carrot-ginger soup and their oatmeal-chocolate chip cookie. Both were excellent.\n\nI still need to go back one day to fully investigated their menu and assign a rating. For now, 3*.", "author": "Rahul T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-10-18", "description": "A great place to grab a quick bite to eat. I'm a big fan of their lunchbox special which includes a half sandwich (I'm partial to the roast beef with horseradish mayo), a small soup and a side salad. And when I say it's a great place for a quick bite to eat, I mean it. You are in and out within three minutes. \n\nThe only reason they lack the fifth star in my review is the lack of seating.", "author": "Scott W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-06-02", "description": "I just moved to Potrero and have eaten at Hazel's a few times now...for breakfast and lunch. I like their sandwiches and the girls have always been nice to me. I think if you are pleasant you typically get a pleasant response back.  And for goodness sake, it's a sandwich shop not Gary Danko.   I love their bagels with scrambled eggs for breakfast!  Hits the spot with a coffee from Farley's.", "author": "Kelly M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-07-27", "description": "This place is solid. They don't skimp on their fillings.  You can expect half an avocado - not just a smear - plus cucumber, lettuce, sprouts, and tomato.  Minus one point for the wimpy store-bought bread.  At 8$ a sandwich I expect a thick cut of something fresh baked.", "author": "Fallon C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-01-13", "description": "I was at the amazing Collage Gallery next door and was super hungry so decided to forgo sweets at the great Farley's two doors down and try Hazel's. My first impression was \"How effing cute!\" I loved the 50's decor and interior. I loved the story of the shop even more and I was smitten by the pics of the owner's twins. I'm a single mom and small biz owner so it touched me. I wanted to support it. I wanted to come back again and again. I ordered a piece of pre-made veggie quiche and somehow I waited a very long while for it to come out of the microwave scalding hot. I saw other folks being served rather quickly and their stuff was more complex. I was patient though I wanted to go back there and help. The server and the register person WERE very nice and I luckily had no finger licking experiences. I do have to say though, yes, they are supposed to have their hair back and yes, they are supposed to wear gloves which they were not doing. That may be a health code problem and that sucks but I'm not freaking out about it. The quiche was lovely and it was a good size too. I'll probably go back but yeah, it took too long and was too hot and I had to wait 7 or so minutes after I got it for it not to burn my mouth.", "author": "Melisa B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-04-08", "description": "I am a sucker for daily specials. I usually like to try them whenever I can. Today the sandwich specials at Hazel's Kitchen had me locked in a state of indecision for about 5 minutes. When it came time to order, in usual fashion I made a last minute decision and picked a winner. A turkey sandwich between two slices of whole wheat with a pesto aioli, warm provolone, and lots of veggies - lettuce, thinly sliced zucchini, caramelized onions, and roasted red peppers - tossed in a light balsamic vinaigrette. The beautiful colors made it even more appetizing. Mmm, mmm, good! My only complaint (yes, I know that I'm a snob) is that the turkey cold cuts were too salty for my taste, and the texture of the cut resembled the ones that come in a 100 slice bulk pack. I would've much preferred an oven roasted breast. It would be just as good without the meat. But yes, aside from that, it was delicious with a capital D. Extra points for the cuteness of the interior!", "author": "Monica N."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-03-11", "description": "Used to be a huge fan of Hazel's until today, when I pulled three hairs out of the inside of my sandwich...", "author": "amanda r."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-08-28", "description": "Decided to grab breakfast at Hazels when I was getting my coffee at Farley's next door. I got a bagel with their lox spread which was pretty good. They actually use real lox in the spread versus the over processed stuff you find at most places. You could tell because the spread was  white with pink spots, not all pink. My boyfriend got the scrambled egg sandwich. I had a bite and it was terribly bland even though I watched them season it. They make the eggs in the microwave which never fares well. They were rubbery and dry. Yuck. The service here was pretty bad. Super slow! And before you ask -- no there were not a bunch of people in front of me. I had time to go to Farley, order 2 lattes, and finish my whole latte in the time it took them to make my order. It took about 15 minutes for us to get our orders and neither were difficult to make especially considering the eggs were microwaved. I MIGHT go back to try their sandwiches but it is doubtful. I'll just stick to Farley's and their yummy pastries.", "author": "Sierra d."}
