{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-15", "description": "I won't talk. You can't make me but from service, to drinks, to food.... it's all good. \n\nI've had most things on the menu (even if just a bite, they tolerate sharing) and every single thing is delicious. \n\nThat's all I'm gonna say. You'll have to show up and check it out to see the rest for yourself.", "author": "Luba M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-10-04", "description": "Pretty bar, but I was disappointed by the cocktails.\n\nWe came here for dessert and drinks. I found both cocktails we ordered to be on the astringent side. I had the To Kill a Mockingbird cockail. My husband had a mojito, and he thought it was the worst mojito he's had in a bar with way too much lime compared to mint and simple syrup.\n\nFor dessert, my husband had the milk and cookies. He loved the chocolate chip cookies. I tried the oatmeal cranberry cookie, and it was very good. I had the panna cotta, and I loved the grape granata and fresh berries paired with the rich panna cotta.\n\nHowever, as this is a bar, and we didn't love the cocktails, I can't say that I'd recommend the place.", "author": "michelle l."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-09-21", "description": "I had high hopes for Heritage but found myself a bit disappointed due to slow service and underwhelming food. However the beautiful bar might bring me back in for a second visit. \n\nWe waited around 30 minutes for our food and I didn't find the food necessarily worth the wait. I did see a couple other reviews mention the meager portion sizes and I agree -- I ordered the salmon and while it was delicious, I thought it was a pretty small portion and only came with a few thin pieces of broccolini. A friend of mine ordered the ribeye and also found her portion on the smaller side. A bit disappointing considering the price.\n\nWe also ordered an appetizer of garlic fries that didn't come out before our entrees, so we had to ask the waiter and ended up eating the fries after our meal.\n\nOverall, I don't think I would return for dinner but the restaurant and especially the bar were beautiful, so I could see myself stopping in for a drink if I were ever in the area again!", "author": "Greg J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-30", "description": "We've been here 4x now, once for drinks and 3 times for meals both lunch and dinner.  Cocktails, food, and service have all been consistently excellent for us.  We had a birthday dinner with family recently and we did the chef's tasting menu.  The whole experience was on par with Michelin star restaurants we've been to and our family thought they had died and gone to heaven.  3 days later we are still talking about that meal.  The food & drinks were beautifully presented and delicious.  Salmon, ribeye, mushroom soup, pasta, garlic fries, panna cotta, salad, crostini.  I would happily eat any of it again.  We have lost so many good restaurants in this neighborhood in recent years I'm thrilled to see a new gem on the scene.", "author": "Gaping F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-13", "description": "My group of three wanted one last drink before we parted ways. I yelped places in my neighborhood and found Heritage Restaurant & Bar. We walked in on Wednesday, May 9th at 9:45pm. The place wasn't too busy. A few groups here and there. We easily found three seats at the bar.\n\nWe all ended up ordering the Catcher in the Rye: rye, punt e mes, amaro, grapefruit bitters ($13). The cocktail fit the bill for a last round. Good for sipping and easy to drink. The atmosphere was very casual and chill. Lots of wood decor, so a very homey type of feeling. Our bartender was also very attentive and sweet.\n\nI can't speak much on the food as the kitchen was closed when we arrived, but a nice spot for one last round.", "author": "Elena N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-10", "description": "My new favorite neighborhood restaurant.  We finally ate there last night, been away.  The new restaurant shines.  The menu is truly innovative, from appetizers to desert.  \n\nWe started with the avocado stuffed with salmon dusted with sesame seeds, and crunchy toasts, great combination.  I tried the rice cakes, topped with pickled cabbage, so good.  My husband had the pasta with prosciutto, so delicious, I hope it is on the menu on my next time.  We shared a delicious arugula salad, perfectly dressed.  We loved our choices.\n\nTheir cocktails are really good as well, I had Catcher in the Rye, my husband had a great gin/aperol drink.  For our entrees we each had a glass of red wine, decent wine list.\n\nThe service was excellent, atmosphere super nice, and awesome food, can't wait to go back.  Fun to have this new restaurant in my hood.", "author": "Carole W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-31", "description": "Dining at Heritage was a fantastic experience. Our large party was able to snag a last minute reservation and ordered the family style chef tasting menu with supplement. The group consensus favorites were the burrata, pork belly, sweet basil tagliatelle, and ribeye. The portion sizes were generous and a good value for the cost. I appreciated how the menu didn't make you choose between the dishes for each course, but instead allowed you to taste both. The service was attentive and the chef was accommodating and respectful of food restrictions.", "author": "Andrew W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-11", "description": "Happy to see that the space formerly occupied by the Clement Street Bar and Grill has been transformed into a chic, clean new restaurant. Last night I finally had the chance to check it out. At first glance from the street, the space looked relatively empty, but once inside, we could see that the bar space and many of the tables at the back of the restaurant were occupied by a congenial crowd. The fireplace in the back of the dining room added a warm, cozy vibe to the updated, streamlined decor and was a welcome sight on a damp and foggy night.\n\nAs for the food, I enjoyed the roasted chicken ($24) with cranberry beans and Brussels sprouts. The chicken was succulent with a crisp skin topped by sprigs of toasted rosemary and the sprouts were nice and fresh.\n\nMy date went with the hamburger - a bit pricy but the high quality warranted the $17 price tag. Speaking of pricy, the wine list was a bit up there, with the cheapest bottle clocking in at $48. I settled for a $13 glass of Lipstick on a Pig, a blend from California. Very nice with a dry finish.\n\nGreat, friendly service from our waiter James, who gave us the skinny on the Happy Hour - 3-6pm Everyday!\n\nDefinitely pleased with this new addition to the neighborhood and will be back for happy hour.", "author": "Carole B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-28", "description": "An absolutely great experience. Went here for a corporate dinner last night and was very pleased. We were in the back private seating area and had the three course meal for parties. Ambiance was great -- perfect lights, cool bar area.\n\nService: great! The waiters and owner were very personable and attentive - never a dull moment. My glass of wine was always filled. Food always came out in a timely manner.\n\nFood: delicious. Appetizers included the burrata and pork belly with some fruit puree. So good, very tropical/islandy. Main course included their steak and pasta which were some of the best dishes I've had in a while. The steak was a perfect medium rare and cut like butter. Some pieces were topped with a sweet puree that was remarkable. Dessert was a solid creme brulee.\n\nWould definitely recommend for a night out or event.", "author": "Michael N."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-09-19", "description": "For the price, we ordered several apps (garlic fries, chicken wings, kale salad, salmon rillettes crostini) and one main (pasta), the portions were small and tasty - but JUST small and tasty. Granted a bunch of apps can be spendy...\n\nThe balance between quantity and quality is a little off.\n\nGarlic fries: Good, but in SF, that's easy.\nChicken Wings: Good! Chicken was not previously frozen or steroid induced. Nice seasoning and great bleu cheese drizzle.\nKale & Arugula Salad: Good, but (again) in SF/CA that's easy.\nSalmon Rillettes Crostini: Meh. Nice try but not a rillete. Basically salmon spread on toast for ~$12.\n\nThe Main: Angel Hair Pasta - Just OK. Good sauced, good garnishes, overall tasty, but the pasta was all clumped together when served. Pasta was not well dressed throughout the dish --- clumps of pasta :(\n\n\nService: Meh. Dude who seated us stepped on my shoes (marked up my new kicks) when being seated!!??!! Not a word!!! Sorry??? If you know what I mean... \n\nOur server was good. Then, the same Dude who seated us, when wiping down the table next to us after service, swung a chair around (from the other table) at our table, knocking it in while we were still eating, without asking - apologizing after knocking into our table - and come to mention, my mom was sitting in a dinky plastic folding chair the whole dinner!\n\nWont be back with all the great options on Clement Street.", "author": "M. U."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-27", "description": "This used to be the Clement Street Bar & Grill (which I have never been to).\n\nThe inside is super cute - kinda feels like a train car with unique curved ceiling beams.\n\nThis place has only been open for a few weeks and you would never know it - service and the food were awesome.\n\nMy man and I split the goat cheese, pear and arugula salad. (barely a salad really, maybe 15 pieces of baby arugula - not that I minded, there was plenty of cheese and pear.\n\nThen we split the double cut pork chop - which was as good a piece of pork as I have had in a while.\n\nFor dessert - We split the milk and cookies (2 of each kind - 2 toffee, 2 peanut butter and 2 chocolate chip) I asked our server, Martin  (who came with Chef from Hawaii) if they were \"baked to order\" and were served warm. \"no\" he said - but when he brought them he told us he had asked the kitchen to warm them up, very sweet. The best part of dessert was the \"vanilla milk\" thicker than milk - thinner than a milkshake and slightly frozen - YUM.\n\nI had one cocktail and the bill for 2 (before tip) was only $88. (granted we split everything - but we were both stuffed.\n\nThis place is gonna be a success.", "author": "Amy W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-16", "description": "All of the food exceeded expectations!  Presentation, preparation, ingredients, and flavors were all on point.  Service was perfect.  Drinks were delicious.  Glad to find a neighborhood gem.", "author": "Dan D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-08", "description": "My friend and I had dinner here on. Friday night.\nI loved the food.\nLoved th ambiance.\nThis place is great for a friends night, a date night, or a family night (with kids).\nMateo was excellent and fun :), and a Robin Williams doppelgänger :).", "author": "Mary N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-28", "description": "Finally got to check Heritage out via a valentines day reservation! I didn't realize that they had a pre fixe menu for valentines until we got there, which was a nice surprise. It was $60 for a set of app, entree, and dessert. Two options each for app and entree and just one dessert option. We each ordered different apps and entrees - there was a chilled beet and coriander soup and a strawberry and guava salad, Thai spiced market fresh snapper and grilled prime beef flat iron steak. Dessert was a chocolate almond cremeaux. \n\nThe apps were both delicious! I didn't think I would like the beet soup but I was really into it. Same with the salad which balanced the various flavors really well. The fish was also pretty good and the Thai green curry it came on was delicious. It also came with just plain white rice which I thought was a tad boring but fine. The steak was pretty good and it came in a pretty large portion. The grilled veggies on that plate were superb. Lastly, I was a huuuuuge fan of the dessert I was happy there was only one option because then we got two of it!! Creamy rich chocolate with almonds and some berries and vanilla ice cream.. omg heaven. I'm drooling thinking about it right now!\n\nI need to come back on a normal day to try their regular menu but hopefully it's just as good. Our server told us brunch is also super popular there so maybe I'll try that too :)", "author": "Grace D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-05", "description": "I love the food here! The owner is really great as well. Got a chance to meet him and hear his inspiration for opening. What a cool spot and a new gem for the Richmond.", "author": "Katie B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-23", "description": "Don't let the beautiful bar up front full you: this is a restaurant. Excellent 3 and 4 course prix fixe meals. They have a fabulous salmon and steak on some nights. This is a seasonal dish, however and the menu changes frequently. Their wines by the glass are very good quality. Worth a visit. Also, the fireplace is a nice touch.", "author": "Antonio O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-21", "description": "This restaurant has the ambience, excellent food, and you can hear the company you're with. The food was absolutely tasty, fresh, and earthy. \n\nThe only thing was I could tell it was new, the wait staff seemed to be a bit all over the place. The food took a long time to come out. \n\nI want to come back once they've gotten their flow as a restaurant. The chicken was just perfection!", "author": "Bri D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-08-13", "description": "WHYYY?!?! This place has so much potential for brunch but fails miserably.  I've walked past this place a billion times and always told myself I need to try it for dinner one day but after having their horrible french toast and fritata for brunch it makes me second guess that decision.  I always thought that it's pretty hard to fck up brunch but maybe I'm wrong and should be more appreciative of places that serve the classic items.", "author": "Vince L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-04-07", "description": "Came here last night with friends six of us all together.  My wife and I arrived early and we were seated in the back by the fireplace.  When we sat down we were told that Happy Hour prices only applied if you sat at the bar.  I had never heard of any other establishment doing that.  Drink prices were high as were prices on the menu.  I had the lamb pasta, it was good, not great. Some bread would have been great if it had come with it. My friend ordered the cured meats spread and seemed a bit thin on the servings.  \nI remember the old Clement Street Bar and grill feeling cozy.  The ambiance and decor here felt like we were eating in the hull of an overturned ship-not warm despite sitting next to the fire. Debating between 1 or 2 stars.  Usually, I err on the generous side, but will stick with one.  The bill seemed  high for what we got. I'll leave it at that.", "author": "Derald C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-10", "description": "Really great food and service. You can really tell the chef is particular. Every tomato is perfectly ripe, for example. No stone left unturned \n\nI recommend the 4 course menu - great and fully satisfying meal for just under $50\n\nSame meal will cost you $180 each at state bird", "author": "Ben G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-26", "description": "I've come here multiple times for brunch and dinner and have to say that everything I've had has been delicious and reasonably priced. What I love most is that the menu is never exactly the same because the chefs seems to use whatever is fresh and seasonal. The ambience inside is very rustic and I love the fireplace. The service has been a hit n' miss since I've been coming here, but during today's brunch our wait staff was very good. And brunch was delicious!! I can't wait to come back!", "author": "Amy Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-07-21", "description": "Friendly service and decent burger with garlic fries.  Burger was cooked fine but the bread ratio wasn't ideal.  Also it was toasted it tasted semi stale. Bread wasn't toasted either which would have made a difference.  Garlic fries were good with fresh roasted garlic. \n\nFood 3 \nService 4\nOverall 3.5", "author": "Patrick C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-13", "description": "This place is great for drinks, food and of course the milk and cookies dessert, which is out of this world. The bartenders are great, they for sure know what they are doing. Food is delicious can't say anything bad about it. I do wish that the service would be better, takes forever for water refill and some servers just walk by you and don't even ask how things are going. Other then that it's a plus for me.", "author": "Roman L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-10", "description": "Popped in for some small bites and drinks.  I regretted having a big, late lunch after eating the pork belly and cauliflower appetizers.  A lot of flavor and good combination of ingredients.  \nThe drinks delivered as well-tasty and fun names.  The place had a relax vibe which was nice.  I will definitely return and next time will try the main plates.", "author": "Lou G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-05", "description": "The atmosphere was very classic. Has a nice bar setting with an old chunky register. \n\nThe bartender who made the \"bloody valentine\" drink, which was a twist of Irish coffee with raspberry made my old fashion perfect! Hats off to you. I went another time, different bartender, didn't make my drink as good. \n\nThe food was good, but a bit pricey. The chicken skewer was a bit dry. However, the pasta and burgers were good.", "author": "Mandy D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-07-23", "description": "We went on a Saturday evening to celebrate a birthday and a retirement for a party of 15 adults. We sat in the private room - it's a just a room with walls but no door. It got hot in the room, and is a tight fit for that amount of people. We had to have two separate tables instead of one big. What's the point of going to dinner together then? \n\nThe waiter was very friendly but the food was a huge disappointment.\nWe started out with a romaine salad with pesto dressing - that was pretty good. Most of the party ordered salmon, ribeye, chicken, hamburger, garlic fries and homemade pasta. The salmon was less than a 4 oz serving, the ribeye came out lukewarm but was cooked as requested, the chicken was moist, the hamburger ratio to the bread was more bread. I was very disappointed with the homemade pesto pasta - there was no flavor whatsoever. The chef should of use the dressing from the salad as the pesto sauce! Also, the inconsistency of the amount of pasta was different for everyone that ordered it. Some received a small portion, and some received a bigger portion! \n\nWe ordered two desserts - chocolate pudding, and fruit cobbler. The chocolate pudding consistency was like mousse, and came with two pieces of candy chocolate. The fruit cobbler was okay. Not enough cobbler, and the taste was just okay.\n\nDon't come here if you think you are going to get a lot of food so probably not for the young crowd of eaters! \n\nWe won't be coming here again.", "author": "Debbie C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-09-14", "description": "What can I say.... The service was friendly and the place looks nice. Unfortunately, that is where it stops. Whatever you do: do not take the Chefs menu. This is such bad value. They call this so-called \"family style\". What that really means is that they give you food for 1 or 2 people to share with the whole table for the price of 4 people... For the whole table we had 2 small salads, 1 small plate of salmon and 1 small plate of beef, and 1 panacotta.... 1! For 4 adults! We are fit and eat healthily, but this is the first time in SF that I walked out of a restaurant hungry.... For $40 per person (excluding drinks and tax), that was probably the most expensive six bites I've had in a while :) Just no.", "author": "Bastiaan G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-11", "description": "This place is A-mazing!  There was a vegetarian in our party, so I was searching for a high-end dining experience with decently priced plates and plenty of vegetarian options.  The fact that their cocktail were divine, and there was a warm cookie plate served with frothy vanilla milk for dessert was just the icing on the cake... and the waiter who took care of us was amazingly receptive and a joy to be around. :)", "author": "Rebecca J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-06", "description": "Needed a restaurant for a family dinner to celebrate my husband's birthday while we were in town visiting. We're always ones to give hot and new restaurants a try. \n\nChris took our reservation for 8 the morning a day before.\n\nOur half of the party arrived 15 minutes early. My parents have mobility issues so I dropped them off with the guest of honor while I went to find street parking. The host who sat my parents and husband gave a little history of the place on how the current owner took over the place from the Clement Tavern and remodeled the fireplace. During the remodeling, the linoleum floors were pulled up to reveal beautiful wood flooring. We were seated in the private room which can hold 16. The place was an ice cream store in the 20's and the original ice cream freezers were kept and add to the decor. The chef who had received awards in Maui (my favorite island) moved from there for his children's schooling.\n\nFor appetizers, the Asian Pear and Burrata Cheese looked most attractive. We liked the slices of Asian Pear with the guava and Thai basil. We ordered 2 fried Brussels sprouts and garlic fries. For the entrees, 3 Scottish Salmons, 2 Pan Roasted Pork Chops, 1 Roasted Free Range Half Chicken, and 2 Heritage Cheeseburgers were ordered. \n\nOur server asked if it would be all right to bring the Fried Brussel Sprouts out with the appetizer and we let her know that was fine. When the appetizers came out, one of the Fried Brussel Sprouts was missing so we asked our server's helper if it would be coming soon. It came shortly. He also delivered another one to us later after the meals were delivered saying that the kitchen had made another one and he was giving it to us so we could enjoy some more the Fried Brussel Sprouts which we had found very unique in that the outside was crispy and the inner Brussel sprout was tender. \n\nThe Salmon was excellent. My brother-in-law commented, \"That's the way that you cook fish.\" You never want to over cook fish. The Fish was ordered medium by all. Our birthday boy enjoyed the entree and the presentation of the salmon fillet on the pea purée with preserved lemon  aioli sauce, arugula pesto, dandelion greens, and beet vinaigrette. \n\nMy father and I had the Pan Roasted Pork Chop. I normally don't like Pork Chops because they can be dry. This dish was done very well. There was not much meat left on the bone by the end of dinner. I liked the sourdough raisin stuffing and wild plum purée. It was a good counter to the seasoning on the pork chops. The chive potatoes were buttery and creamy smooth. Presentation also was nice. \n\nThe Roasted Chicken looked burnt on the outside, but the meat was tender enough for mother.\n\nThe two tweens had the Heritage Cheeseburgers with no cheese or onions. One of the buns was burnt on the edge. They didn't finish their burgers, but enjoyed the \"Milk and Cookies\" for dessert.\n\nThe adults were curious about the Passion Fruit Curd Meringue Pie. It was a deconstructed pie with Yuzu pineapples and a Hawaiian almond nut crunch.\n\nWhat left a bad feeling was that we were charged for the 3rd Fried Brussel Sprout that we had not ordered which the server's helper had given to us complimentary because it had already been made. Our server argued with us that we had ordered the 3rd one on a bill that was already in the triple digits. She did take the charge off though before we paid the bill.", "author": "Belinda L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-07-15", "description": "I live around the corner from Heritage and have been wanting to try it for a while, and today on a whim we finally decided to head there for brunch. Sadly it didn't live up to its reputation or price point. The restaurant opened a bit late (not a huge deal, but we were waiting outside for several minutes past opening), coffee saucers and water glasses were visibly dirty, and the entrees (salmon benedict and burger with fries) came out lukewarm. Overall the food tasted okay, but it's not what I expect from a $50 brunch (sans alcohol) for two. \n\nIn the same vicinity and at a comparable price point, Richmond Republic and Lokma are so, so much better, so I probably won't bother with Heritage again.", "author": "RJ W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-02", "description": "For the food and rustic atmosphere I would give the new restaurant a FIVE star. The appetizers (beef skewers and sashimi) were scrumptious and the main entrees (steak and frites and sea bass coconut curry over rice were so flavorful. \n \nThe only improvement would be the service and I wish the restaurant was little bit warmer. Perhaps it was a cold evening that's why it felt cooler. \n\nI would definitely recommend.", "author": "Kay D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-23", "description": "We've been to Heritage three times now, the first time for New Years Eve. That night we enjoyed the prixe fixe menu.  Each coarse was delicious and exciting.  The staff and management is friendly and attentive. It's clear they care about their customers. The food is top notch, the flavors are bright, the plates colorful, the presentation lovely and fresh. \nThe brunch was quite food.  The puffy pancake was flavorful, custard like and rich.  The eggs benedict was perfect.  The eggs had great consistency and the hollandaise sauce was velvety and delicious.  \nThe space itself could use a punch of color, some vases of flowers would be a perfect addition to soften the look and give it a cozier ambiance.  I am so excited to have this restaurant in our neighborhood,  It's a great and vibrant addition.", "author": "Kim P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-20", "description": "LOVE this new neighborhood restaurant! Great food, good wine list, friendly service... my new favorite neighborhood go to place. \n\nI've been 3 or 4 times now, and haven't been disappointed. The food is tasty, well-thought out, and made with love and care. Oh those roasted potatoes! And the cauliflower side dish! YUM. I've found that the portions are large enough that I usually end up sharing a 2 or 3 course meal with my friend, and that is plenty of food. The desserts are creative and really good.\n\nHighly recommend Heritage. I'll be back again and again.", "author": "rebecca p."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-05-13", "description": "Let's see.  We waited 30 minutes for our food. My salmon Benedict was barely warm and the salmon appeared to be pieces of fish that had fallen off a larger piece when it was trimmed. Our waiter also screwed up the check and gave us the wrong one.  That took nearly 15 minutes to resolve.\n\nWe won't be back.", "author": ".Hon H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-10", "description": "Excellent Asian fusion style food with high quality farm direct ingredients. The chef is creative in his creations and the service is impeccable. Always a high quality meal.", "author": "Gabriel M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-09-29", "description": "I really wanted to like this place. My boyfriend and I came here to celebrate my job promotion. We ordered the 3 course food and wine pairing, which I wouldn't recommend. It was twice as much as just ordering off the menu with half the amount of food. The entree took an hour to come out and my salmon was raw. I sent it back and the server comped my meal and gave us an extra wine tasting and cookies to take home. It wasn't his fault, he was nice, but we won't be back.", "author": "Jess S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-14", "description": "Wow, what a wonderful experience!  I had the chicken... ahh yum!!\n \nChef Cameron co-owner hails from famed restaurant Spago in Hawaii.  Being its first week they have it pretty dialed in!\n\nCan't wait to come back. \n\nBest of luck Guys!  Cheers to you both!", "author": "Tanya O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-03", "description": "We've been to Heritage several times and it's always been pretty good. Tonight I had the salmon and it was spectacular, just the right balance of flavors, color and texture. The overall vibe is authentic, not as pretentious as a couple of the newer places in the Richmond. The wine selection was very good.  I have always liked their respectful remodel of the old Clement St Bar & Grill site.  It's a welcome fixture in our neighborhood.", "author": "Susan S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-02-28", "description": "I have a set of friends who used to meet at this place before it changed hands. Back then it was the Clement St. Bar and Grille. I never fully understood why they liked it. The food at that time was decent, but it was never particularly interesting (imagine a nice plate lunch). Nobody there was under 50, unless they were there as somebody's son or daughter.  (BTW none of us are under 60...just so you know.)\n\nThe clientele looks to have changed completely. Nobody over 50 except us. Millennials everywhere, chatting glibly and erupting in peals of laughter so loud that it hurt. If you don't know who Maxwell Smart was, do a google images search on \"cone of silence\", and you will get the idea.\n\nThe interior is much the same. The same uneven, barrel-vaulted ceiling sloping down to Radio Shack-style wall sconces. Hard ceiling, walls, and floors, with dark wood tables and chairs. There's a new room divider in the corner.\n\nI went back to look at the washroom area, a weak point in the old restaurant. It has been upgraded with the installation of a white porcelain trough in the hallway, intended for hand washing. The trough didn't look like it was fresh from the plumbing supply store, however, and reminded me of the troughs that you used to see in a certain class of bars south of Market. I sniffed it suspiciously and wondered about its provenance.\n\nThe prices might not raise an eyebrow among our nouveau-arrivé throng of youthful techies, but I don't much like the idea of a seventeen-dollar burger and fries. The old place, for all its faults, still had a decent chicken teriyaki fillet and salad for around $12. Most entrées now appear to be in the $25-$32 range. \n\nThe burgers arrived on what appeared to be large, glazed dinner rolls. They were pretty, but the contents were pretty small (anyone remember the \"where's the beef\" commercials?)\n\nThe salmon looked to be in the range of 2.5 to 3 ounces. Very pretty on the plate, apparently tasty, but a few ounces shy of a frozen cod fillet. Plan on eating before you get there.\n\nI had the cheapest thing I could find, a $13 salad. (Okay, I could have ordered fries for $6, but that seemed overboard, or perhaps under-board.) Our waiter assured me that it was a plentiful portion. What arrived were three or four flattened leaves of red-and-white lettuce, with a dusting of bacon bits and a teaspoon of creamy dressing. I stanched some of my hunger by eating someone else's garlic fries. They were wholesome but unexceptional.\n\nOur youthful, tattooed waiter thought he had committed our orders to memory, but returned from the kitchen minus one salmon. That diner waited until the others had finished before his meal appeared. He wisely chose to receive it in a take-home bag, and our waiter wisely did not charge him for it.\n\nWe go Dutch to these dinners of ours, and the waiter dutifully separated the checks for us. I tried to give him my credit card while the others were still fumbling for cash, but he told me he wanted to wait for the others; otherwise it would be too inconvenient for him. But he took my card anyway. I waited for it to come back, but he was busy serving drinks to other tables. Finally I went up there to get my card back, and to give him three fives instead. I didn't have the right number of single bills to leave a decent tip, but...well...you might say it was not altogether an awkward outcome.\n\nWe parted company on the sidewalk outside, with the others deciding that perhaps this place should drop a notch or so down in their estimation for future culinary forays. \n\nAs for me, I went home and had dinner.", "author": "Donald J L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-13", "description": "Great food grest service..EVEN BETTER DRINKS!  Due to the cost it can not be regular weekly place we eats, but great for a date night or family dinner out once a month.", "author": "Rayannah S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-07-18", "description": "Not sure if this is a Sports Bar with food or maybe it's an eating establishment with a bar that features 3 very large and annoying tv's. If this were Applebee's and the price point not so steep, I'd certainly  understand. But if you're expecting to have a quiet meal and spend a lot of $$, this is probably not the venue. The former occupant of this space was part of the local color for almost 34 years. And when you keep your doors open for almost three and a half decades, one has has to think out loud \"if it ain't broke,........\"", "author": "scott p."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-05", "description": "Too early to say, but really, anything would have been an improvement on what was on this site previously. The bar is well stocked with all that you would expect, beer selection on draft is a little bit underwhelming, but difficult to match Richmond Republic a few doors down. There is a selection of cocktails and seemingly a dedicated mixologist. Not really my thing though.\nFor food we tried the Salmon, which was nicely cooked, and the half roast chicken , which was a bit too big a portion, given that comes with a lot of polenta.", "author": "rick b."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-23", "description": "My husband and I love this little gem! We want Heritage to both grow more popular with locals so it stays around forever & for it to remain the hidden treasure in plain sight it's been thus far so we don't have to slit our wrists and wait in line for a seat. Regardless, we'll gladly wait in line for the top notch drinks, grade A service, and delectable dishes.\n\nThe atmosphere is just right: hip without trying too hard & cool without making you feel like you need to meet some sort of secret quota.\n\nDo yourself a favor and drop by for a cocktail & tasty bite. Or a full blown meal. Or brunch!", "author": "Vanessa R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-01-22", "description": "I can't remember the last time I gave 3 stars to a restaurant, but this one really did not impress. \n\nMade a reservation for 4 people, but last minute one person was sick- so we became a party of 3. We let the nice hostess know, but it seemed that her supervisor (guy with shaved/buzzed hair) was having a conniption when she alerted him of the situation. So after him being rude to her, and ultimately not keeping his cool in front of customers, we actually felt inclined to apologize to the hostess who we felt was being treated unfairly given the 1 person adjustment to our party.\n\nPrices were really high- 3 cocktails and 3 entrees and 2 starters will run you $210+ with tip. They advertised my meal as Tagliatalle, but it was more like linguine... just felt like they were trying to justify the price point with something usually associated as thicker, fresh pasta.\n\nMy mother in law's pork was smothered in a sauce and as she put it, was \"fine\". Husband's steak was cooked correctly, but still overpriced for the cut and only fries.\n\nNice interior, not great being on the bench seating, a little disorganized in their early days I guess. \n\nWe don't plan on returning- and it's literally 3 blocks from us- so that's disappointing.", "author": "Brianna S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-01-19", "description": "It's nice to have a place like this on Clement, and the food is okay, but it is WILDLY overpriced. I'm used to paying top dollar in SF, but seriously, they are charging for an experience that is out of their league. The burger STARTS at $18, and is just a plain old thin burger on a giant bun. For that price, this thing should include the second patty, or have truffle, or include bacon, or feature wagyu, or have some other notable quality. It's meh. We also had the hamachi, the mushroom crostini, and the tagliatelle. All were \"pretty good\" but when the final total came in, my opinion dropped. They also offer a Rosé that I know is $12/bottle for $48. I'm familiar with the markup on wine in restaurants, but 400% seems steep.\n\nFor these prices you should go to Rich Table.", "author": "Will G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-20", "description": "Relaxing environment to have your loved ones dine. Gréât place to hop by at night time to enjoy.", "author": "Josephine P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-01-01", "description": "Heritage is a welcome addition to our neighborhood. We had gone in a few weeks ago for a drink and to reminisce about the old Clement St. Bar and Grill. They made the room a lot more functional than the old restaurant. The fire place is more visible from the whole restaurant making the atmosphere glow.\n\nWe had dinner there on New Years Eve and found the food very delicious...except the kitchen rushed the main course out even before we had finished our appetizer. My husband had to send his steak back because it arrived cold. Hopefully, the kitchen will find it's timing soon.\n\nThe website claims the restaurant is \"farm to table\". I guess that is a loose term, because the menu didn't give us any indication of the farms who are supplying the kitchen.", "author": "H S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-29", "description": "Love this place. Great quality food, reasonable prices for San Francisco, and great service/ambiance! \nFood is so amazing and is like Cal cuisine with a Hawaiian/Asian flair without being gimmicky. \nHappy hour also w/ great bar drinks and good food specials.\nA place you can also bring your kids to and feel like you are eating an adult meal in a kid-friendly environment!", "author": "Andrew A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-02-08", "description": "I want this restaurant to be all that. Desperately. Unfortunately my first experience fell flat. Good food with healthy portions, but honestly not amazing. Aesthetically beautiful atmosphere. Acoustic atmosphere is hideous, especially when a tipsy large group is getting louder and louder. Mediocre in-person service (felt like we were given the minimum amount of personal attention. I get it: the very large drunk group is gonna leave a fatter tip than us, but I still expect our group of 7 to be treated with friendly respect). Distasteful telephone service: audibly put off by having to respond and accommodate.\n\nI'll return with hopes that I can come back and bump up the stars. I want to love it here and I want them to be successful. Hope they can work on their interpersonal service skills.", "author": "Karen C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-28", "description": "Amazing! Won't regret incredible service and the FOOD!!!! Wow perfect for a girls night!", "author": "Therese M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-19", "description": "Went there as a party of 4 for a business dinner. Good crowd for a Tues eve. Reserved in advance so the lovely hostess seated us at table in front of the fireplace...A+ move.\nSmall menu but well-rounded nonetheless. Two of us had the ribeye, one burger, one bass. All very satisfied. Dropped the mike on the chocolate malt bar semifreddo dessert.\nService was attentive, professional and friendly.\nI'll definitely be back", "author": "Rick W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-10", "description": "This was a wonderful dining experience. We had our family reunion here. Atmosphere was cozy with a roaring brick fireplace. Very friendly staff that served delicious food to please all pallets. And a Fabulous bar serving great spirits!", "author": "Molly B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-14", "description": "Great ambiance of a dark wood steakhouse, plenty of nooks and cozy benches, almost private spaces.  Seems like a good place for a burger or a hearty chicken or fish dinner.  After a series of Asian restaurants it was refreshing to hit a classic American bar and restaurant.  Very happy with our two patty burger with garlic fries and half chicken on a bed of creamy polenta and veggies.  Be sure to try the fried Brussel sprouts.  Excellent.", "author": "Laura S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-03", "description": "Heritage is fantastic! Cozy atmosphere, beautiful interior, and delicious food. The menu is inventive, creative, and tasty - some of my favorites were the chicken liver pate and Scottish salmon. Great addition to the neighborhood!", "author": "Alex K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-10", "description": "After a long week @ work we were definitely looking for a quick bite and heading home early.. with a slightly updated menu the food was good and the cocktails hit the spot,but I could tell the restaurant/bar was getting more busy since are last visit.. food portion was definitely fixed since are last visit as well, minus one star for food service which seem a little slow but it was busy", "author": "jonathan h."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-08", "description": "Best place for good food and drinks!  Service is excellent. Never been disappointed in any of their dishes. Great New neighborhood spot!", "author": "CR L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-18", "description": "Went tonight for the first time. They did a great job with the interior; it's beautiful! the fireplace is an especially lovely touch...don't recall it being there when the space was clement street bar and grill. \n\nthe ambiance, service and food were impeccable. i had the vegetarian dish of the day and the bff and i shared two sides: fried purple and white cauliflower, and sweet potato fries. delicious! (and free of charge because we ordered them before 7:00. wow!). the bff gave her meal (rosemary roasted pork belly) 5 stars.\n\nWe both tried the \"catcher in the rye\", one of their signature cocktails. not only was it delicious, but it was beautiful. I love how they named their cocktails after great classic novels, and the fact that their menu changes daily. So glad this place is in my hood. highly recommend; I will definitely return!", "author": "k h."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-21", "description": "The food was good! But the decor, ambiance brrrr! Cold and uninviting.\nOverdoing the minimalist, reminds me of a dining hall of a monastery!\nI don't like to feel so institutional when I am paying a hefty bill especially with the wine list prices!\nWe will wait a while before going back!", "author": "Yasmine S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-19", "description": "Great addition to the neighborhood!! I Had dinner and cocktails here the other night. We were seated close to the beautiful open fire .Ordered a cocktail \"War and peace\" which was the perfect amount of bitter!! The ribeye was cooked to perfection and so flavorful ,every bite was amazing!Everything was so fresh and from just glancing around at other customers I could see that everyone was loving the dishes being brought out! The waiter told us the menu would be Ever changing with new fresh ingredients so this makes going back to try new dishes exciting, not to mention my need to try a few more of the cocktails! I've a feeling we found our new \"go to\" Spot !!", "author": "Alannah D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-10", "description": "Visiting from Chicago we were fortunate enough to dine here. The space is welcoming, the staff was friendly and very accommodating. And the best part was the delicious food! We will definitely return.", "author": "Mary B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-04-22", "description": "Been here twice. Both times I've been brought incorrect dishes that I did not order and wait staff appears absolutely clueless. Also, if you receive all the dishes you actually do order, consider yourself lucky. Both times here we ordered a plate that never actually made it to the table. (End rant) Last bad thing I'll say is we received our appetizer before our drinks were even delivered to the table. Service is inefficient and not sure any of the wait staff is even aware. Gave this place 2 chances and both times not great service although food isn't terrible. Former waitress speaking here and can't back this place up. Just sayin", "author": "Jill K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-25", "description": "Amazing!!!! My boyfriend & I have ate here 5 times now & each time we've been completely satisfied with every dish (which is very rare). The menu changes either daily or weekly which is a welcome change & every thing we have tried has been delicious. The chef has a great knack  of joining different ingredients & flavors together. Great service.\nMouth watering!!", "author": "jil m."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-04-14", "description": "Off vibe. No diversity at all for a SF  restaurant/bar. Went on a warm, sunny afternoon. Waiter actually never said a word and waited for us to speak and choose what we wanted. He Had no idea about drinks. We Had 1 drink and we left.", "author": "Yvonne G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-04-27", "description": "The service and food were both seriously lacking. Had high hopes based on the great reviews and cool decor, but unfortunately the food/flavors didn't work and the service was  non existent (waited 5-10 minutes just to get menus after being seated, had to request water over and over, waited another 10 minutes after we had given them our credit card to pay to get it back).\n\nVery confused by how much other reviewers seem to like it. Perhaps the bar scene is better -- I did notice most people were there for drinks/bites. However, as a sit-down meal it left much to be desired.", "author": "Hillary B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-22", "description": "Took my dad here for Father's day recently, food and service was amazing. Fantastic dishes that are perfect for sharing, and the place has a really great ambiance. Definitely will be coming back, it's a great addition to the neighborhood!", "author": "Brett H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-04-02", "description": "We dined here for Easter dinner and while some of the dishes were good, the service was not. It was extremely slow and we thought they might have offered some bread, but noticed on the menu that you had to pay $4 for it. We waited almost 45 mins. for our entrees. One person at our table ordered the burger, but the meat was rare, almost raw, the bun was stale and the fries were cold. The restaurant was not that busy and I also noticed the three other tables next to us, were also waiting patiently for their food. I would have come back, but knowing how long we had to wait, gave me second thoughts.", "author": "Lisa C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-30", "description": "This cozy restaurant is such a welcome addition to the neighborhood. Warm and classy environment. Loved the touch of the fireplace in the corner and the food was incredible! \n\nMy favorites were the beef skewers with the most amazing yogurt sauce I wanted to eat it plain and the chicken liver pate was so good! The chicken and salmon were both perfectly cooked with the crispy skin on the chicken over buttery cranberry beans. \n\nDessert was amazing so save room for that! Cookies and milk and a killer deconstructed passion fruit meringue (my personal fav). \n\nKudos to the Chefs!", "author": "Christina P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-27", "description": "Four of us had dinner on June 26, 2018. We each split the Mesquite Grilled Prime beef which had a basil potato puree under it, grilled nectarines and red wine sauce. It was superb! Other diners said they had the House Tagliatelle and it was excellent. For dessert we had the Passion Fruit Curd and meringue. Fantastic flavors. \nThe menu changes daily and had 5 entrees from fish to chicken to pasta to beef. If our Prime beef was any indication, each dinner should try a different dish because they will be tasting experiences.\nPrices for entrees were reasonable - $32 for the Prime Beef and others ranged from $18-26.\nDefinitely going to re-visit multiple times!", "author": "Suzanne S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-22", "description": "The ambience was one of a kind-candlelight dinner, which set the perfect mood for a Friday night. \nThe food was out of this world...the chef clearly knows what he is doing and the cocktails were the best in the inner Richmond. The steak was cooked to the nines and the milk & cookies for dessert was an amazing touch.", "author": "Candelaria S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-31", "description": "I had dinner at this amazing restaurant with my family a few days at!  Everything from the ambiance, the supreme food and our beyond great server made it a perfect dinner!  I highly recommend dining here if you are in or live in the area.  It is sure not to disappoint!", "author": "Wendy E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-29", "description": "Oh my goodness.  The chicken.  The chicken.  So juicy. So tender.  So hearty.  Sooooooo good! Menu is revolving so I hope and pray you keep that on because that was UH-mazing.  \n\nGreat atmosphere, wonderful staff, great for grouos, reasonable prices for what you get!  Happy hour begins in January 2018!", "author": "Dianne L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-02-23", "description": "Good new spot that is trying hard. Biggest issues are likely due to still working out the details but those are: really long wait for food, although the wait staff are attentive and friendly; some inconsistently on food quality and lastly the prices are about 15% too high in my opinion. I've been twice and will try again next month.", "author": "Jay D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-07", "description": "I have lived in the neighborhood for 25 years.  I was never impressed with the Clement St. Bar & Grill that resided where the Heritage is now.  I couldn't wait for Heritage to open.  It wasn't a disappointment.  I think the prices are reasonable for the quality of food you get.  It is high for the neighborhood, so I understand where the price complaints comes from.  But they really aren't out of line.  I have eaten there several times.  The menu is always different.  The wait staff is friendly and professional.  My only minor complaint is the noise level.  But I am older and noisey restaurants seem to be the trend. I hope this place succeeds.  I will do my best to support them.", "author": "Tracy W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-18", "description": "Really good food. Keep in mind their menu changes daily, so what's reflected on their website (or the Yelp photos) probably isn't accurate. For me, this was a good thing, since the dishes they were serving the night I was there were a lot more inventive and interesting than the menu on their website. Service was friendly and attentive, too.", "author": "Todd K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-03-02", "description": "I was super excited to try this new restaurant since it's new to the hood. Drinks were delish... we got our appetizers at a relatively okay pace... but then we waited... and waited... and waited... Almost 90 minutes for our entrees (2 burgers, pasta, chicken). We asked a few times and finally got our food. My friend who was there and works in the industry was upset that we didn't get any apology or something comped... totally understand it's new and they're understaffed but just give us a , hey we're so sorry about the wait or here are some free fries while you wait. I look forward to trying again... I just hope it takes 1/4 of the time!", "author": "Stacey A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-01-07", "description": "Recently taken over from the Clement Street Bar & Grill (classic neighborhood eatery), Heritage had big shoes to fill. Not because its predecessor was necessarily a dinner destination for me; more so because it had been around for decades and long-time residents of the Richmond are hard to impress. \nWe made reservations online, which were very easy to make; 8pm on a Saturday we thought it'd be relatively quiet. To our surprise, we arrived at 7:55pm and it was packed, very lively. My husband and I waited a few minutes to be seated, there wasn't an open table when we arrived. \nOverall, service was good but slow...we waited over 20 minutes for a salad appetizer, and received our dinner after 45 minutes.\nDinner:\n- The Pear Salad is delicious, definitely tasty and worth the wait. Humboldt Fog cheese is one of my new favorites because of this dish.\n- Pork Chop - skip it. It's overcooked, dry. The mashed potato puree underneath is the highlight of this dish.\n- Roasted Chicken - absolutely delightful. Crispy golden brown skin on top with a parsnip puree underneath. Succulent and moist chicken, absolutely delicious.\n- Milk and Cookies - light but sweet ending to the meal. 6 cookies freshly baked ready to be dunked into a bowl of vanilla foamy milk. Definitely a must!\n\nOverall, a good dinner experience, despite a few kinks that service needs to address. I'll be back in the near future, but won't be ordering the pork chop (Nopa is my gold standard).", "author": "Alyssa G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-01-21", "description": "I ate here recently with friends because everything else in the neighborhood had a 2 hour wait so we decided to give this a try. First off the host who sat us was exceedingly rude and spoke to me with a tone of voice that was unacceptable. The waitress was unfriendly as well and somewhat incompetent. I am a vegetarian so I ordered their one and only vegetarian option they had. It was $19 and for that I LITERALLY got 4 mushrooms and about 1/4 cup of white rice! Are you kidding me??? It was pretty and tasted OK but I was starving after dinner. I later went home and made pasta I was so hungry. We ordered just 2 salads, 4 entres and one bottle of their cheaper wine and it was $260! WHAT A TOTAL RIP OFF! Don't waste your time or money here!", "author": "David W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-01-24", "description": "Made a reservation and stopped in last night. Several tables open in front and back of restaurant. As it was cold, we asked if we could sit near the fireplace (several tables open) and things just went downhill from there. The host was snippy from the get-go  and informed us that they had large parties coming in later and those tables were not available, so we settled on a bar table. Unfortunately, there was a huge gap between me and the table and it was uncomfortable. We requested to move again (and were polite about it). Received attitude from host about possible tables. Total pass. We had enough, got up and left. Didn't even try the food. Too bad! Many other great places to dine at without the attitude.", "author": "Kath v."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-17", "description": "This place is absolutely incredible. The staff is so friendly and accommodating, knowledgeable about the (daily evolving) menu, and thoughtful - we were celebrating a life moment tonight and Cameron, the owner & executive chef, brought out a complimentary artichoke starter. So kind and unexpected. The food tasted amazing and you can tell the staff and chefs take a big amount of pride in what they bring you. The salmon tonight is topped off with a broth that stays warm over the fireplace... the little touches like this make it the perfect spot for a date, after work drinks, business meals, or even dinner parties. Definitely check out their \"room\" - pictured - for groups, it's the perfect mix of included in the space but private enough. Overall, the aesthetic is rustic and cozy, drinks are great, people are friendly, and we will definitely be back soon.", "author": "Kayla G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-06", "description": "Food was pretty good. Drinks pretty good. Place looks cool and is big and has lots of space. Interaction with the staff was a little weird. Might give it an other try to see if that part was a fluke. Mind wasn't blown, but overall fairly decent spot.", "author": "Kaitlin S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-03", "description": "We had a fantastic experience here! We arrived with a party of 7 dinner time on a Thursday. We were immediately seated and waited on. The server was friendly and professional. The food was incredible - generously portioned and delicious. The fried cauliflower was especially popular with the group. If we weren't visiting from New York we'd definitely be coming here again!", "author": "Susanna G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-29", "description": "Have eaten here twice in the past two months - once as part of a larger party and once with my husband.  Lovely ambiance with spacious seating - you aren't piled on top of others.  The food is outstanding and reasonably priced.  The service is excellent and very friendly.  Staff remembered us from our previous visit the second time we dined there.  This is a neighborhood restaurant around the corner from where we live, and we will be regulars.", "author": "John K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-23", "description": "Delicious food and great service!  They have a side room that looks nice for small parties. The fried Brussels sprouts were amazing. We'll go back for sure.", "author": "Jenny M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-28", "description": "This place is fantastic. Extremely high quality dishes, carefully prepared by an amazing chef. Incredible value as well. Even the kids menu is delish. Very pleased. Will be a long time customer.", "author": "Stephen L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-15", "description": "You can't really review Heritage without at least touching on it's long term predecessor, the Clement Street Bar & Grill. It was old school, it was a safe place to take your parents and grandparents, it was relaxed and quiet restaurant for conversation (assuming a big game wasn't on in the bar area). Heritage has kept those last two elements intact while opening up the space and bringing a much more ingredient focused approach to the food.  There's a freshness and emphasis on sustainability that was missing before and even though the menu is pretty meat forward, I found much to love as a vegetarian.  The mushroom pasta was delicious, as were the cauliflower and the carrots.\nAnd the garlic fries. Basically I recommend getting all the sides. \n\nA lot of folks here have mentioned the cookie and semifreddo desserts; my preference was actually for the passion fruit \"pie\" which used the tartness of the passionfruit and wild raspberry to balance out the meringue. Yeah, me recommending a non-chocolate dessert over a chocolate one- weird I know.", "author": "saru k."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-02-12", "description": "Hostess and waiter/waitress pleasant and atmosphere comfortable, bench seating okay.\n\nMain concern is the food needs improving as does the menu. And it's very slow for food arrival. Food is very average and portions tad on small side.  Overall, doesn't justify the food prices.\n\n Don't come here hungry, but bar looks good.\n\nCame here for dinner, then tried their brunch.", "author": "Nan W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-19", "description": "So grateful to have Heritage in the neighborhood. Good food, wine and beautiful cozy space. Love the vibes.", "author": "L M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-11", "description": "This place was great! They were friendly, fast, but not pushy... Our waitor suggested specific beer and food for us and nailed it!", "author": "Taylor N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-01-14", "description": "I never been here for dinner so this is not a review for their dinner service , But the brunch is not good , are food was undercooked , barely warm. One person in our group ordered a side of bacon, which was burnt and dry. I had the Fried egg and ham in a croissant, which was so flavorless I couldn't finish it . Everyone at the table had a issue with their meal. The server said he would mention it to the chef ,but I don't think the chef really cares . The food was like it was pre-made and they just through it together and heated up in a microwave.", "author": "Pat C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-22", "description": "We were actually headed a few doors over for dumplings and we decided to pop in for a drink. We had a larger size party and they were able to accommodate right away. Their specialty drinks are a must! We didn't have any food but it looked great. Next time we are in San Francisco we will definitely be visiting this place again!", "author": "Marissa P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-28", "description": "Honestly, getting Wolfgang dining/culinary talent and experience in the Richmond is such a delight. I had almost everything on the menu and chef Cameron has not failed in delivering rich and powerful flavor profiles for every dish.", "author": "Chrissy H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-26", "description": "Had a date night dinner here and everything we had was amazing! Great service, food and atmosphere! Will definitely be going back!", "author": "Rachel V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-25", "description": "We ordered the butter lettuce salad, sashimi, salmon, burger and a couple desserts. Everything was excellent and presentation was beautiful. The restaurant has a very nice and cozy feel and is good for both families and date night. I will definitely be back again and cant wait to try other things on the menu!", "author": "Carly G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-25", "description": "I'd prefer to give a 3.75. Good choice if you're coming from a visit to the Legion of Honor, as our group was. Service started out great, but I think the kitchen or the waiter got bogged down in the end. Burger was excellent. Would have preferred fatter fries. Interesting cocktails. Get the milk and cookies!", "author": "Sarah N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-03", "description": "Pros: five stars on food, service and ambience. Menu changes everyday.\n\nCons: noisy and the food took a little time to come out. \n\nExpect to spend 50.00 with beverage.\n\nWe will go back.", "author": "MC C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-25", "description": "Great new spot on Clement for drinks and great food. The sashimi, tomato soup, burger, salmon and Brussels sprouts were all excellent. Milk and cookies dessert hit the spot! Looking forward to going back soon!", "author": "Joe B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-20", "description": "I thought I'd be writing the first review of Heritage, but I'm pleased to see that I'm just piling on.  Food is fantastic (loved the salad, steak, chicken and dessert), the room is more welcoming than it was as Clement Bar and Grill, the staff is very professional and the current limited menu is better than fine.  I was expecting to order a burger, but they haven't quite solved the bun issue yet, so it's not presently on the menu.  Happily, the steak was a terrific alternative.  With great food (at commensurate prices), great staff, great location, it's sure to be a success!", "author": "Barry R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-23", "description": "Everything from start to finish was amazing. Cozy atmosphere. Friendly staff. Great food. What more do you want? Recommend the steak.  And desserts were fresh and interesting and delicious. Definitely will be back.", "author": "Aindreas D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-11", "description": "This is a gem of a restaurant in the neighborhood. Always amazing food, excellent service. Cozy and warm. We love this place so much, we would be here every week if we lived here!", "author": "J S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-04", "description": "The quality and quantity of the food was excellent! The cod was tasty and prepared perfectly as were the rice cakes. Food and atmosphere are conducive to a great meal. We'll be back for sure!", "author": "Ingrid B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-25", "description": "Good food. Great service. Big space. Nice interior design with historic elements preserved. Was not crowded or loud Sunday night. Keep in mind that the chef likes to change the menu pretty often and the menu on their website was not updated. I am sure you will still get good food.", "author": "Serguei B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-14", "description": "My friends and I really enjoyed dining at The Heritage. We were there on a Wednesday evening. Each of us ordered a different entree and both the presentation and taste were top notch. We were seated near the fireplace, which added to the ambiance. The staff was inviting and service incredible.  The chef took a few minutes to share how the restaurant came to fruition. I highly recommend this place and we plan to return often and want to try their Saturday brunch next time in the area for the farmers market.", "author": "Tess G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-14", "description": "Grabbed a quick bite at the bar tonight. Cocktails were amazing. Check out the \"war and peace\" drink. Burger was cooked exactly right and served with a gigantic portion of fries. The burger is a double cheeseburger and is huge. It was perfect as a shared meal. The crostini (mushroom) appetizer was quite good, too. Different and interesting. Happy to have this new restaurant in the neighborhood!", "author": "Karen F."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-03-29", "description": "Came here for weekend brunch. It wasn't very busy. Waiter gave us a dish we didn't order. Eggs were runny in frittata. Very disappointing. Service was cold, distant. I'm honestly surprised someone came by to refill the water glasses because it was like a ghost town service-wise. I had the French toast and it was actually very good, but I wouldn't go back here because I don't think it's remotely worth it monetarily or time-wise.", "author": "k h."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-03-30", "description": "Food is not bad with some trying hard appetizers. We ordered simple steaks and chicken - not bad actually, with two appetizers, burrata and pork shoulder skewer - definitely small portion and not good deal for the price. The waiter didn't bring proper silverware for steak at first and it took a while to get attention while dining area was not that busy. The most annoying thing is they combine SF mandate and tax together in the restaurant copy of the bill.", "author": "Jongan S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-27", "description": "We tried Heritage for both dinner and weekend brunch and had great experiences both times.  The food was amazing and the service was top notch.  Will definitely be coming back.  Great addition to the neighborhood!", "author": "Matt M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-03-02", "description": "The food was good, the service slow to start and outrageous cocktail price of $16 for undersized  martini. Additionally, nondisclosure of switch in the requested like-priced spirit.", "author": "Eve O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-08", "description": "Great food and atmosphere.  Loved the fact that the owner and chef came out and presented his food. Drinks were great too. Especially liked \"catcher in the rye\". Wish I had taken some pictures", "author": "Lieh C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-01-29", "description": "Very overpriced for a glorified sports-bar. No wines under $50 and corkage was $30. The ingredients were fresh and of quality (especially the meat) but the dishes were uninspired and quite plain. As one would expect in a new restaurant, the service was only fair. A lot would need to change before I'd go back.", "author": "David B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-14", "description": "Awesome experience.  The wine list, food, and service were wonderful. Everything we ordered was delicious, well cooked, and perfectly seasoned(especially the Angus Beef Flat Iron).  The fireplace makes it feel nice and warm.  I can't wait to try out some of the other dishes.", "author": "Steve S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-02-12", "description": "As someone that can walk here from where I live I was really hoping that what sounded like a bunch of fake Yelp reviews so far here on Yelp were actually true reviews....but well. 3 stars from me. The ambiance is so close. The 3 TVs above the bar that are the first thing your eyes go to when you walk in because they seem so out of place. Maybe the art is on the way. The \"private room\" fish bowl looks especially uninviting due to the lighting. Food was so incredibly mediocre for the price. Salmon cake was bland. I enjoyed the brussels but they came out room temp. We shared the steak and it also came out room temp, and while the coloring was correct (medium rare) it felt like it might have been sitting for a bit before coming to the table. Which was especially weird because, as it was Sunday evening, there were only a few other couples there. Such a great location, interiors are almost there and the bar is gorgeous. If the food matched the prices in terms of quality/creativity I would go all the time.", "author": "Kelly T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-01-24", "description": "After reading different reviews and suggestions from neighbors I decided to book a reservation for my family and see what this neighborhood spot was all about.  I made reservations for 6 of us and went with an open mind.  We were sat in the front of the restaurant which is the least impressive section. I would recommend getting seats near the back by the fire place or by the bar.  We ordered drinks first of course and were wondering why the wine was so expensive (like all the options were pricey).  We asked the waiter if they had a house wine and he said he didn't know.  We said why don't you go ask and he stood there looking at us.  We just ended up ordering some wine and then our food.  My nephew ordered a medium rare burger, my mom a half roasted chicken, I order salmon, my sister the pork dish, niece cabbage salad and sister ordered some veggies.  We ordered one appetizer (meat skewers) luckily my sister is a vegetarian because there were only 5 skewers, super small pieces of meat for the price of the appetizer.  Burger came and instead of being medium rare it was medium well, 1/2 chicken came and was more like 2 small pieces of a game hen?   We ended up leaving after everything and outside noticed the happy hour sign which we never were told about.  WE all looked at each other and the temptation to go back in and get a price adjustment for our drinks was there.  Since we probably will never go back it wasn't worth it.  The time spent with my family was fun regardless, but could have been enhanced by everything else of course.  With all the competition in SF and great restaurants don't waste your time.  Maybe check out the happy hour if you are curious?  I always try new places and keep an open mind but this was lack luster for the price you are going to pay.", "author": "Angel C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-05", "description": "Love this place! While we still miss Clement Street Bar and Grill, the new owners of this classic location have made it their own, and provide excellent quality food and good value. And the servers really try to make sure you're well cared for. My short little legs don't work with the bar-height table format of the front room, but I guess it's a \"thing\" now. Wishing them much success and a long run!", "author": "Nora K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-05", "description": "The meal we had here was incredible!!  We started with the crudités with dirt - which was bread crumbs and a basil aioli, and the salmon poke with avocado toast. The main courses were amazing - cooked to perfection and the desserts were delicious. We were on a bit of a time crunch and they got us out in plenty of time to make our event. The cocktails, all named after novels, were delicious as well. A great new restaurant in the neighborhood.", "author": "Danielle O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-29", "description": "Great ambiance, very friendly staff and awesome food. Happy to have a restaurant like this open up in this neighborhood. Everything we ordered was delicious!", "author": "Chelsi C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-15", "description": "We had brunch and the food was really good. We tried the mascarpone  stuffed french toast and wild mushroom fritata, they were both perfectly done. It was fresh ingredients cooked right, simple and perfect. The look and feel of the place is also very nice, they have awesome fireplace towards back of the place that I didn't see from the outside. The server told us about the chef a little bit and it seems like he is super passionate about what he cooks and how he source the ingredients. I would love to go back again for the cocktails and bar bites menu sine the bar part of the place looked like fun too.", "author": "KyuHee K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-25", "description": "Delicious food, attentive wait staff but the noise level is so bad that you can not have a conversation with the people at your table. I will not be back until they do something to improve the acoustics.", "author": "Michelle L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-30", "description": "So pleased with our meal and excited that Heritage is in the neighborhood! The space is beautiful with exposed wooden beams and a big fireplace in the back. We had the leafy greens salad- a heaping mound of refreshing greens plus touches of grapefruit and other tastes. We also had the Thai curry striped bass and the stuffed delicata squash with farro. Both dishes were excellent, flavorful and comforting. We ended with the chocolate semi freddo which hit the spot. The cocktails were tasty and they have a nice wine and beer selection. We will definitely be back.", "author": "Liz O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-19", "description": "I never write reviews unless I'm really pissed or really pleased. I've been to Heritage several times now & feel it totally necessary to give a PSA, letting you know that there's a new hot spot in town & it's worth checking out.  Food is absolutely phenomenal....amazing wine/drink menu...and suburb customer service. Plus a fireplace & new happy hour drink specials. SOLD.", "author": "Lauren M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-14", "description": "What a great improvement on the Clement Street Bar & Grill.  Fantastic brunch w/bottomless mimosas!  Friendly service & warm ambiance, yes, there's a fireplace too (bonus)!  Can't wait to come back for dinner!", "author": "Kristie C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-14", "description": "I was anxiously waiting for the opening of Heritage and I wasn't disappointed!  The ambiance is great, and the fireplace is a really nice touch.  The chef-owner came out twice to say Hi and thank us for coming and our server was attentive and friendly.  I had the steak and it was fabulous.  Heritage is a wonderful addition to the Richmond!", "author": "Kathryn B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-13", "description": "Went there on one of the first nights open.  Food and drink program on point!  Staff was attentive and fun to interact with.  Beautiful remodel.  Il be back.", "author": "Chris S."}
