{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-01", "description": "My mom has taken the family to this place since I was a kid -- the puto platters are the best! The staff here are friendly and always do their best to provide great customer service. If anything, desserts here are delicious and really reflect traditional Filipino flavors. I'd especially recommend getting desserts from here if you're planning to introduce friends who haven't tried Filipino food to some good stuff!", "author": "Danielle M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-09-13", "description": "Was in the neighborhood so i decided to pass by. The store front looks like a lock down prison. Anyways..... \nI walk inside i was 3rd in line. The cashiers personality was DRY AF! No smile just a look of depress. \nI ordered cuchinta, puto, and snack sized bibingka. Im not a fan of their hopia so i definitely skipped that. \nI decided to give my mom some treats and she said that the bibingka is \"matabang\". Meaning its bland cause the sugary brown sauce is soo thin. True, we've had better. The cuchinta was mine and meh I've had better too. So definitely not coming back not worth it.", "author": "EmmettsGuRL C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-21", "description": "Hilda's bakery is unique being that corner spot in a residential neighborhood, tucked away in obscurity with little signage so it's easy for most people to overlook and take for granted unfortunately. I found this place through a Yelp search for Filipino bakeries in the city cause you know I'm all about that u-Bae-by life as of late  until now I've frequented bakeries in Daly City and South SF but haven't found much ube options in the city.\n\nI finally made a excuse to be in the area on a weekday afternoon. I lucked out on residential parking but I don't expect parking to always be this convenient. \n\nWhen I arrive the staff a middle age woman working the store was very pleasant. She answered all my questions and basically allowed me to fanboy with enthusiasm as I vented out my tecent obsession for ube. \n\nThey are well known for their Mong Hopia (crispy shells with mung bean filling) but unfortunately they don't make Ube Hopia \nIt baffles me they don't make Ube Hopia given Ube's large popularity with Filipinos and non-filipinos. Their also known for their Puto (sweet rice pastries) as well but which they do have in ube ! Though they sell out of these early and I'm meaning to come back and try them. \n\nOne of the few Filipino bakeries in the city with a local and authentic feel. Def recommend a look at it your into family made Filipino pastries  .", "author": "Jude N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-10-22", "description": "Worst cashier ever. She doesn't even speak the language. Don't come to this place. She's rude as hell!", "author": "Maria A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-19", "description": "After more than 15+ visits, Hilda's is still one of my go to spots for when I'm craving Filipino sweets. \n\nMy favorites:\n+ hopia: love the thin flaky crust and the sweet mung bean paste filling\n+ maja blanca: sweet custard with lots of coconut flavor & bits of corn\n+ kutchinta: it's one of the lighter ones & tastes great with the coconut shavings\n\nOthers:\n+ suman (sweet rice): sticky rice w/ coconut milk; wished the coconut flavor was more pronounced\n+ puto / ube puto: chewy mochi type consistency\n+ bibingka: just okay\n\nUsually kutchinta and puto are available in their display case. The other items tend to run out so come early or call to ask what they have prior to dropping by. For large orders, call a few days in advance.\n\nLimited parking in the area. Cash only.", "author": "Ruby C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-25", "description": "Hilda's Bakeshop sells a variety of Filipino delicacies. Ranging from rice cakes (puto, kutsinta, and) to their famous sweet mung bean paste filled pastry (hopia). The bake shop is tucked within a residential area, so parking is limited. When walking in, it's more of a grab-n-go kind of place. \n\nThe hopias are freshly made. Each hopia comes in a tiny cupcake wrapper.  The outer layer is flaky and delicate, the sweet, slightly thick mung bean paste stays in tact with each bite. It pairs well with a hot cup of tea or coffee. Have it for breakfast, dessert, or your next gathering! I always find myself eating a few in one sitting! \n\nOnto the rice cakes, puto (rice cake) is white, fluffy and has a slight buttery taste to it. It also resembles a mini muffin. Kutsinta is orange and more on the sticky side. It is firm, jelly-like, but has a soft and gummy texture. \n\nAlso they start running out of fresh hopia around early-mid afternoon, so it's recommended to call in advance and make a reservation of the quantity of hopia you would like to guarantee you won't leave Hilda's empty handed!", "author": "Cindy C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-01-05", "description": "I think Parking is horrible. It's in a residence neighborhood parking and Siri was not correct. It said it will on right side, but it's actually on a corner on the left side.  Parking frenzy was evident. Customers were double parked while driver stayed in car. What pissed me off was customers who got their order, stayed in parking space while others, including us, would drive down all street. This black SUV got order (saw the pink box and only business in this 'hood) and sat on her drivers seat while she ate her buy. UGGG come on people,  get your order and LEAVE, to free up a \"legal\" parking space.\n\nAnyways, I'm not a hopia fan. But if you like it, you'll probably love it. However if you don't, it might change your mind from store bought processed packages from Asian stores.  It was good as it was flaky and soft. They only have one kind-yellow (bean) filling.   Since I tried a steamed rice dough ball, a few years ago  that puto was sour and off putting.  But Hilda's puto changed my mind. It just taste like a steam rice ball. My friend said I probably tasted a spoiled one as it was super sour to me years ago.\n\nService was not friendly, but the flow was smooth and consistent. Basically say your order, get your order and get the heck out of dodge. \nIt seems if you speak the lingo, your treated s bit friendly. Just saying. \n\nI'd probably have someone buy some, but have no interest finding no parking. Business should consider parking if they get a second location. Happy customers=more business= more $$$$", "author": "Chefs Daughter D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-23", "description": "When I lived in the bay area, this was my family's go to place to go for yummy Filipino desserts! It is so good that my parents would buy a big box of Hopia to bring all the way to Canada when we would go! Yes, the outside may not be as pretty as other bakeries, but this place is the bomb diggidy! \n\n\nHOPIA. That's all I gotta say! They have the besttttt hopia I've ever tried. Compared to big branches such as Valerios and Goldilocks, their hopia doesn't compare. Here at Hilda's, it's fresh, it's flaky, and it's oh so good. Not too sweet, not too plain, but just right! \n\nI haven't had their Puto recently but I remember as a child that it was my favorite! They do only accept cash so be prepared. Parking is also a struggle to find, so also be prepared for that.\n\nDon't need to state it here but I will definitely be coming back to bring some Hopia back home in Sac! :)", "author": "Rachel E."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-08-19", "description": "Love their hopia, puto and kuchinta. Yes, as others have said the parking does suck. I would pass on their ube halaya, it wasn't that good. Worst part was the customer service, I walked in and asked if I can order 25 hopia. To my surprise I was given side eye and the response \"if we have it.\" Next, when I ordered ube halaya she goes \"umm save it for next time?\" No I'll take it now, save your shitty attitude and poor customer service for next time.  She looked like shit so I'm sure she was going through a rough patch.   But TBH your storefront looks like a ghetto crack den, grills on the window, hardly anything on the shelves... GTFOH out of here with your attitude.", "author": "david C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-09-23", "description": "We tried hopia because I read so many good reviews....it didn't disappoint.  Also tried kutsinta and puto puti...both were just okay.  Bought ulam diniguan, it was mety enough but a bit juicy and vinegary.  Went 2x to Hilda's and both experience were just okay.  Didn't get the warm homey feeling like other Filipino stores.  Should have on display the small-large containers for ulam to go.  Also won't work with you on mixing puto flavors even if willing to pay fortune puti price. 12 puto puti/12 puto ube", "author": "Abec H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-08-17", "description": "Desserts here are meh. Nothing special. You're better off going to Valerio's instead. Lol. A lot of talk about their \"hopia\" which they don't make extras on a daily basis and have to order it 1 week in advance?? Really, even if you only want 3 pieces? Also, the lady in the front is RUDE AS F***!! She sure knows how to drive customers away. Don't even bother", "author": "Claire L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-14", "description": "Probably the best hopia I have had in my life! I know, I know, a hyperbole, but it's true! When I lived in SF for college and I was missing my one of my favorite pastries from back home, I would drive here, look for parking (which takes forever btw) and order a dozen just for myself. \n\nThis hopia is the best I have had and I wish someone here in Seattle could replicate it. Unlike some mongo hopia whose center is so dry that it literally comes apart after you bite into it, this hopia stays intact! The mongo stays somewhat gooey and the outside is so flaky. I recently went back when visiting friends and bought a dozen to take home to my mom. She didn't say it was the best she's had but she did say it was almost like the hopia in the Philippines and the best she's had in the states! \n\nThey also sell other Filipino desserts such as puto, cassava cake, leche flan, etc. I would have given this place a 5/5 but damn, I can't get past the rudeness of the girl on the phone when I called to make sure they still had hopia left. I know they probably get hundreds of calls asking the same question, but whoever answered didn't have to be rude about it. That's how you lose customers, just sayin.", "author": "Marian D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-29", "description": "\"Early bird gets the worm\"... or early customer gets the Hopia. Hopia and other traditional Filipino desserts and baked goods are the best here. It's a small shop nestled by the residential area in South SF. You might even miss it if you aren't looking hard enough. It's a simple, no-nonsense bakeshop, yet there always seems to be a line for their good food. \n\nThey are most known for their Hopia - sweet bean paste wrapped in a flaky dough. You can't just eat one! It is a hallmark of Togo Filipino baked desserts. They are sweet, small, and cheap! Best to take a box worth to share with your friends and family.  \n\nIf they run out of hopia, don't fret! They cook a number of authentic Filipino desserts to try. My favorites are the Maja Blanca, a gelatinous milky dessert, and the Karioca, a fried ball of dough coated in sugar.", "author": "Kevin C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-06", "description": "I don't care how good the desserts here...this shop doesn't have any concept when it comes to providing good customer service. Basic phone etiquette is absolutely missing- she will just hang up the phone without saying bye. I learned that the girl who answers and takes orders over the phone is the daughter of the owner and she's absolutely the rudest, most unprofessional and inconsiderate person I've encountered over the phone. And believe me, I've called quite a few times to place orders. We placed our order way in advance (3 days to be exact) and she wasn't friendly at all... A few hours later, we called again to add more dozens to our order and was told there's no guarantee that it could be fulfilled. Really???!!! So we reminded her that we're not picking up until days from the time we called. And she was like \"well, we have a lot of orders\". Well, girl if you keep up with that attitude, pretty soon no more orders will be coming in. This place just lost my business and I will make sure that I tell my friends and my friends' friends to spread the word. I'll also be posting this review on all\nmy social media accounts. Hilda's, your time is up! Too bad Yelp doesn't allow us to give a \"no star\" rating because this place definitely deserves it!", "author": "Elaine C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-03", "description": "When I am in the area, I make sure I stop here and pickup their \"hopia\".  I love how it is flaky when you bite into it.  This place is located in a corner with a not so bright sign so if you are not looking closely, you can miss the place.  The place is clean and tidy inside with minimal decorations.  I've never seen more than 1 person behind the cashier.  I'm thinking it is a family run business.  Please don't stop making the hopia!", "author": "Carisa S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-24", "description": "Their hopia is classic and the best! Flaky thin crust with fresh mung bean, its excellence beats those of other Filipino bakeries.", "author": "Rachel M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-08-01", "description": "hopia is definitely worth the drive. you'd be lucky if somebody answers the phone though. customer service is non-existent. \"hot\" tip is be there early so the hopia doesn't get sold out.", "author": "Arnel E."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-07-03", "description": "We don't understand all the hype over their hopia. I have been eagerly wanting to try their hopia because we're a big fan of hopia. Whenever we're in San Diego, we go to the famous hopia store there and buy dozens to bring home to our family. We were hoping it would be the same case for this place... Unfortunately, the taste of the hopia didn't live up to its hype.\n\nThe customer service was bad, actually, more like terrible. When we arrived, there was a bell that goes on to alert people in the back that someone walked into their store. We could hear people from behind the wall and waited for God knows how long. We waited patiently and in fact, my fiancé went in and out of the store so the bell would ring again in case they didn't hear us the first time. One woman came out, said hello and disappeared. We thought she was about to help us but she never came back.  She didn't say anything along the lines of \"I will be right with you.\" Nothing about \"Sorry, we know you're here, but give us a few moments because we're busy.\" She popped out of nowhere and disappeared.\n\nAnother customer arrived and waited 5 minutes before asking us if we've been served. When we told her no we haven't been served, she said, \"oh yeah. I come here all the time and customer service is pretty bad.\" I finally got tired of waiting and called out because it didn't look like anyone was coming out anytime soon.\n\nWe were hoping the hopia would make up for the unsatisfactory customer service experience, but it wasn't good.  It had a nice texture but it lacked flavor. I'm thankful we only bought one hopia for 90cents to sample. We were planning on ordering dozens if we liked it. I'm glad I finally got to satisfy my curiosity for their hopia and we don't expect to come back either.\n\nSorry, but this place isn't for us.", "author": "JD W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-20", "description": "I love this place! My family has been going here for over 30 yrs to order puto and  kutchinta. My favorite is their hopia. Yum!!", "author": "Cherry C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-30", "description": "I've been going to Hildas for a long time and they are absolutely the best hopia you can find in the Bay Area.", "author": "Susan A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-03-03", "description": "The hopia improved when I tried in Feb 2018.  Not quite the fantastic original recipe but better than the last time I bought a couple years ago.", "author": "E J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-19", "description": "THE BEST HOPIAS EEEVVVVAAAAAHHHHH yes ever spelled evah because DAMN it's just that good.  Hopia is a flaky pastry filled with sweet mong bean paste in perfect 2 bite squares.\n\n Hilda's is a small mom and pop shop up the street from my previous job.  Never open on Mondays and on holidays if you want to just pop in for something, forget about it! You better have an order in like last year!  \n\nThey are a great establishment in the Excelsior district of San Francisco. Hella Filipinos there getting their desserts and folks in the community as well.\n\nNo parking, so have someone drop you off and start circling the block, unless you get lucky and get the lone parking in the front.\n\nI recommend getting a 25 piece of hopia (.90 each, do the math... well worth it, but you probably wish you got more )\n\nAnd on the weekends (starting Friday) they have Ube Puto (rice cake, not a spanish bad word! Get it together people lol). Yes you read that right, UBE PUTO.  One of the best ever too! They don't get hard like other putos after only a day sitting out.  It stays soft and squishy and they give you some fresh grated coconut to put on it, OMG drooling thinking about it .\n\nAnd kutsinta yum!!! get that too! The round orange dessert found at most Filipino parties also served with fresh grated coconut.\n\nI've heard their dinuguaan (\"chocolate\" meat aka pigs blood stew) is hella good too, but I have yet to try it.  But hopias, ube putos and kutsintas oh my!  Those are my go tos.  The last time though, they had fresh Karioka (deep fried rice flour balls coated in sugary syrup) and I couldn't get one because I had already bought a 50 count of hopia ( I got a big family) \nand a 25 count of ube puto. \n\nBut if you're coming on the weekends, call ahead and get your order on.  You will not be disappointed.", "author": "Nikkie M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-10-20", "description": "Hopia here is really good. We always drive all the way from eastbay to get hopia here. The reason why i gave only two stars, is because the lady who works here is such a b***. I've been here many times and she's such a snob each time we go here. She didn't even look at customers when she responds to us talking to her. I understand they have good products but i hope she learns to be more courteous to her customers.", "author": "Chen C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-28", "description": "Worth coming back a 3rd time to try my luck with obtaining their hopia. \n\nI came in today and purchased the 12 pieces of kutsinta and inquired about their hopia. She was nice enough to let me buy two of them today. (They're in high demand for the holidays right now, and in the hundreds!) \n\nThey do have some very delicious fresh hopia. $.90/piece. I took one bite and was in love. Wiki \"Filipino bean filled pastry originally introduced by Fujianese immigrants\", which explains why it reminds me of the Chinese bean/paste cakes. I appreciate that the hopia is 90% paste and 10% flaky pastry.  (I've had some bad hopia before, and this exceeded my expectations.)\n\nKutsinta = okay. I honestly am not a huge fan of this. I figured I'd try it here given how everything else has been great. But this is a personal preference issue, not an establishment issue.  (Could also be because I taste the lye water.) $3.75 for 12 pieces. \n\nI can't wait to go back and get ube puto and leche puto some day...", "author": "Fannie S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-04", "description": "I thought I was a hopia snob and that Ho-land was the best. I would always request Ho-land when family visited from Manila. That all changed when I tasted Hilda's hopia. The crust is flaky, the mung bean filling has great texture and just the right amount of sweetness. It really tastes freshly made. I've also tried the kutsinta and it doesn't have the weird aftertaste that I've tasted in many kutsinta before. Be prepared to circle around the block multiple times to find parking though.", "author": "Astrid V."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-10-14", "description": "If it weren't for their delicious product I wouldn't go here. Customer service is bad. I walked in to buy some hopias but they always tell me they don't have any and they told me to make an order. Okay understandable, but when I tried to call to make an order their phone is off with a busy dial tone. GREAT!", "author": "Kriselle N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-02", "description": "I LOVE this Filipino bake shop! They have the BEST hopia, hands down. I can not, for the life of me, find a bake shop that sells hopia that can even compare.....NONE! \n\nFyi....I suggest calling in your order ahead of time, so you know you are safe from going in and finding out that they have sold out.\n\nThe only drawback....well two.... is LIMITED freaking parking! I have to have hubby drop me off in front and then have him driving around til I'm done lol. The other is....better bring cash because that is all they accept. \n\nSo if you ever have cravings for hopia, go to Hilda's, you will not be disappointed.", "author": "Crisel M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-16", "description": "One word for this place!  Hopia!!!  The best hopia in California... I think even in the Philippines. I think these are better than the Holland and Egg Bee Tin hopia that you can buy in the Philippines. Every time I go Southern Cal my relatives ask me to bring these to them. It is cash only so make sure to bring cash. If you want to buy a lot, make sure to call ahead and order your quantities. They always run out of them.  They also have other kakanin, such as puto and kutchinta, espasol, sapin sapin, etc. But I highly recommend the hopia.", "author": "Bernadette A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-10", "description": "Best Hopia in the world!!! They run a very clean operation and their food is delicious. Dinuguan with Puto is my comfort food here.", "author": "Mary Anne B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-12-24", "description": "I'm writing this as I walk towards my car 2 blocks away from the shop. So, it's 3 stars because their puto and kutchinta are very delicious--and it's 3 stars because of the poor communication by them to the customers. I was in line for 1hr thinking I'd be able to take home what I needed, but was unfortunately told that they did not have anything extra to sell and that it's all pre-paid.\n\nThis could have been avoided if they posted a sign outside the store indicating that there are no pastries/desserts for order, or perhaps they could also properly announced that in-store if it happened in the midst of everything. So at least the people who were in line would not have wasted any more time.\n\nIn fact, they had their little boy go around the line taking names of people who pre-paid for their food--they could have instructed him to tell people like me that they're not taking orders.\n\n\n\nTl;dr I just wasted 1hr of my holiday waiting for nothing. Thank you very much.", "author": "John L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-15", "description": "Hilda's desserts got me fat. I just kept eating and eating, but it was soo yummy! My brother and I order their kutsinta and puto all the time. We usually have to call and make an order over the phone, which hasn't been a problem. It's in a difficult neighborhood to just park and pick up, but sometimes when you get a craving, it's just worth it. \n\nThe downside is if you want to order anything extra aside of your phone order, they hardliners have anything available to buy off the shelf. Everything is usually sold out, which is a bummer because I wouldn't mind spending more cash on other types of desserts they have to offer.", "author": "Pamela B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-16", "description": "My family has been ordering Filipino desserts from here for years - more specifically, puto and kutchinta. We always have these on the table on holidays like Thanksgiving/Christmas. And typically, Filipino families have these at their family gatherings/parties as well. \n\nI've tried puto/kutchinta at other places, but most of the time they are dry and are lacking in the same texture/flavor as Hilda's. Hilda's is the best place to get your kutchinta and puto. The kutchinta tastes a little bit like egg, but it tastes even better with the coconut sprinkle they provide you. A lot of my friends don't like this for some reason.. Their karioka is good too. Excuse my spelling on all these things.. \n\nTheir desserts are made fresh daily. It is, however, cash only and on holidays/special occasions, it does get busy...so definitely place your orders ahead of time. A lot of people tend to do this.\n\nIt's better to come at the beginning of the day so things are more fresh and you don't have to worry about them running out. At the end of the day, they might not have anything. But they usually have a good amount of puto/kutchinta since they are most popular for those two desserts! Could be difficult finding street parking around the shop, which is located right on the corner.", "author": "Sydney C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-12-08", "description": "I went to Hilda's & I ordered a tray of Sapin Sapin ($44) and 100 ($35) Puto for a Baby Shower on Saturday 11/7. My cousin picked it up for me and she told me the Sapin Sapin looks off. When she got to the party and we all looked at it, the Sapin Sapin lacked the food coloring that Sapin Sapin is known for...deep purple, white, then yellow. It looked gross!!!!! Not appetizing at all. \n\nWhat sucked even more, I brought it to a party that didn't have that many Filipinos, sooooo when I was describing it to people of how it supposed to look like, they were confused, and didn't want to try it. \nIt looked moldy, because the food coloring they used dyed it that way... what a waste!!!! I can't believe they even sold that batch!!!!\n\nThat never happened before and I'm so disappointed. I gotta go there to complain. I've called a few times, to complain, but no one answers. I guess since it's the holiday season they aren't picking up...too busy.\n\nThey still get 3 stars because their Puto is still the best!!!!! I'll still be back, cause even through they f-ed up the Sapin Sapin I ordered, their other items are delish!!!", "author": "CLARISSA I."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-04-18", "description": "I've been a fanatic of this bakery shop and their \"Hopia\" has gone a long way! Simply the best Hopia ever! The problem is parking sucks! I usually call in advance for pick up order and everytime i call- whoever answers is very RUDE! Hilda's bakery is so famous,  they don't care if you order or not because they are rude. Very bad customer service. So to the Hilda's bakery staff- Cheer up and be nice to people. It is because of your customers why you are still around.", "author": "Eves G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-03", "description": "I've been going to this place since 2010. I love there Filipino desserts especially there homemade Hopias. No other shop comes close to there Hopias. I would recommend calling to see if they have them available first because they sell out fast.", "author": "PremiumShotz P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-10-30", "description": "I tried calling their store to put in an order and their phone line was constantly busy.  I was scared their yummy hopia would be sold out but I just went in and they luckily had some left.  I was so happy because I was craving their hopia and their hopia is a five star.  I bought some other goodies as well (kutchinta, Puto, biko and espasol.  ) the other goodies are good too but unfortunately they sold me spoiled and rotten espasol.  My fiancé tried a bite and it made his tongue numb and it tasted like mold and smelled of earth.  Yuck!!  I smelled it and it was disgusting.  I felt bad for him because it was his first time trying espasol and now he is traumatized.  Make sure to smell your food before you leave.", "author": "K. D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-21", "description": "Today was a perfect day walked in and walked out with my delicious box of a Hopias .. only one person ahead of me..  Best Hopias in town", "author": "Patricia F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-15", "description": "Stopped by Hilda's @ picked up 6dz Hopias to bring to my relatives. I can't say enough, they really have the best hopias in the Bay Area. Been going here for sometime now & the price is $10.80 per dozen. They have other assorted desserts as well; their specialty is the regular white puto or ube puto, along w/other Filipino desserts. The only drawback is street parking, you have to keep driving back & forth to find parking. Another thing, they do not accept cheques or credit card; payment must be CASH only.", "author": "Cris M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-29", "description": "Curiosity drove me to Hilda's bake shop. Located in what feels like a residential area of SF I searched for parking and prayed that Hilda would not let me down as I crossed the bay in search of an ube flavored puto. \n\nYou see, I will drive miles for anything ube. \n\nThey were out of hopia :(  but somehow I left with half a dozen of the ube puto ($5) and a sheet of maja blanco ($15). Ube was kind of light and airy, and very light sweet taste. Maja blanco is coconut crack. Flan's tropical cousin is sold to you with toasted coconut to sprinkle over it. ((love that))\n\nNot sure if on Sunday they make less goodies as the display case was kind of bare. I was hoping to find leche puto, alas another day. Bring a wad of cash and your sweet tooth will thank you.", "author": "Hilda Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-26", "description": "Never having tried Filipino pastries before, and in the area after another session with my mentee, I thought to swing by Hilda's, if not just to pick up something interesting for my board game night.\n\nSix hopia and a dozen puto later, I rushed home (after another bakery stop) to bare and taste test my wares. Of course, not having tried either before, I had no baseline to compare them to, but, as a standalone pastry, the hopia was super tasty, and somewhat reminiscent of Chinese pastries: almost a cross between suncake, old wives cake, and mooncake. \n\nThe puto, on the other hand, was not nearly as in-your-face flavor wise. Very subtly sweet from the rice used, and super sticky, I only later found out that it's traditionally eaten with things like sugar, or other additional flavorings. Not bad, and reminiscent of Chinese fa gao, though I much prefer the latter. \n\nAnd, if it makes any difference my Filipino friend said both were pretty good and rather authentic, though the puto was much stickier than any she's had in the past.\n\n***Accessibility Info***\n\nVenue - Not accessible at all, given the two steps at the front entrance. The surrounding area is also rather hilly. That said, since the shop is pretty small, and the front door faces the counter, you can just tell them what you'd like from there, and have them bring it out to you. This DOES mean you need to have an idea beforehand of what you want, since you won't really be able to browse.\n\nBathroom - No idea, given the above, but they're unlikely to have public ones.", "author": "Johnny W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-27", "description": "I love this little bakery. Located on the corner of Persia and Paris St. in SF, this always gives me feels. The items are so basic, but they pack so much flavor. My favorites so far, have been the hopia, the sapin sapin, puto, and kutsinta. Freaking brings back memories. I don't know how long my mom's been coming here, but she the MVP for introducing me to this beaut. Always coming back and I hope they keep up the terrific work! \n\nP.S. They only take cash so don't expect too much.", "author": "Tricia M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-31", "description": "It's nice to have a spot that sells homemade Philippine pastries and sweet snacks.  I had a few items:\n\n-Bibingka\n-Kuchinta\n-Hopia\n \nThe Bibingka was a version that I didn't care too much for since it's wasn't the typical \"cake\" version.  The Hopia was good and tasted fresh and was a nice change from the typical packaged and mass produced variety.  The Kuchinta was really good - lightly flavored rice cakes with a gelatin-like consistency, these desserts have an earthy flavor, balanced with the fruitiness of the shredded coconut.\n\nDefinitely stop by this place if you're in the neighborhood.", "author": "Ken G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-04", "description": "Hands down the best hopia ever! THE. BEST. EVER. It's even better than the hopia I've tried straight from the Philippines. They also have the best puto and kutsinta. Parking is a pain. And if you want desserts around major holidays, make sure to order a week or two ahead.", "author": "Leanne V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-02", "description": "When you first enter Hilda's it looks completely bare. White floors and plain white walls. A couple of desserts displayed. But don't be quick to judge. Hilda's bakes phenomenal desserts! \n\nThis is my go to spot for Filipino desserts. My family has been going to this place ever since I can remember. I absolutely LOVE their hopia and maha blanca. \n\nTheir hopia is rich and creamy. It is a warm dessert that's worth every single bite of deliciousness. I've tried other hopias at other well known Filipino dessert spots, but they do NOT compare at all to this place. \nThe maha blanca is a milky jello with corn kernels mixed in. It also comes with a bag of crispy goodness. I would recommend using a lot of it to top off this dessert. \n\nREMEMBER to bring cash! Cash only. Also, this is not a place where you can just casually stroll in and get a couple of desserts. Usually, desserts sell out FAST. It'd be best to know what you want and place a phone order to pick it up. \n\nParking is tough! Get there ahead of time.", "author": "Mariah V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-09", "description": "As an Americanized child, my Filipino parents and grandparents often have to coerce me to eat more Filipino food, but treats from Hilda's are foods I'll willingly eat!\n\nWhether you're unfamiliar or well-acquainted with Filipino food, get Hilda's hopia. It comes in one flavor, mung bean. The crust is light and flaky, and the filling is just slightly sweet. It comes out nice and warm to enjoy. The wrapper is quite buttery, as will be your fingers if you pick it up.\n\nCash only!", "author": "Tanya A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-16", "description": "The shop is located on the corner of Paris! Initially I wasn't going to give this place a good review because there was a sign saying that the hopia was sold out but the lady ended up giving us three two dozen boxes that were in the back! After tasting the hopia I understood why it would get sold out so quickly! It's not your typical hopia that you get at the store with a variety of flavors. This hopia is the same flavor and it's absolutely delicious! I also bought puto and suman!", "author": "Michelle Ann C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-24", "description": "I have tried samples from a party I attended. The pastries supposedly was picked up from Hilda 's bakery. Unfortunately , there are menus of the website .\nThe food I tasted is decent.nevertheless, it might serve the website if it has a list of menus.", "author": "Dave C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-01-15", "description": "3 star for the bestest ever Hopia !!!! I'll even give it a 5 stars!  bUT Tita Hilda ? With all the dough rolling in the shop, I mean mean 'old $$$$$$ signs coming in, isn't bout time to do a little upgrade In the house momma :). Let's get a serious merchant account to get some cards slid in' and some serious man power to great the mega Hopia! I love your Hopia ! Okay sorry got a little carried away :)", "author": "Jennifer F."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-10-27", "description": "worst place to order over the phone....can never get thru but when you do they can't here you! doesn't make sense to even have a business number. customer service isn't the greatest either. lucky they are the only shop that sells this kinda of food or else I would never go here!!!", "author": "Khris L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-02-25", "description": "Growing up in the excelsior area, i never knew that there would be a Filipino bakery anywhere. But luckily, my mom and i stumbled upon this little heaven-sent shop.\n\nThe hopia is AMAZING. Rich and freshly baked. Way better than Goldilocks if you ask me. Even to this day, i still enjoy that nice warmth in every bite.\n\nWhat's even better is that the price is way cheaper than any other Filipino bakery i've been to.  \n\nThis is a definite go-to bakery if ever you're in the excelsior area.", "author": "Jerianne G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-10", "description": "Don't really know much about Filipino food... But I was in the area yesterday and looked up bakeries. The reviews looked good so I stopped by to check it out. The key to identifying a good bakery is walking in at 2pm and seeing that they are out of almost everything... Luckily the lady behind me in line said I could buy a dozen of her hupia:) IT WAS DELICIOUS!! \n\nAlthough we live over an hour away- I plan on returning! Hopefully nxt time we can get there earlier so that we we can try some other tasty treats!\n\nThank you for a wonderful intro to Filipino desserts:)", "author": "Lara J."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-04-05", "description": "Bad business practice Hilda's.  Called this morning to ask if they had hopia today. They asked me to call back at 5pm. Called back at 430 and told them I wanted 3 dozen.  They said it would be ready in 30 mins. Someone calls me 20 minutes later when I'm already at the door and told me that she can only give me one dozen cause the person who placed an order this morning is coming.  She said if I can wait till 530,  there's more baking in the oven. Walked around and got there around 510pm and asked if I could wait for the other two dozen and she said no, people have been calling and it's sold out.  Are you picking and choosing who you're selling to?", "author": "Dollace C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-24", "description": "Fresh hopia is made from scratch. it is sooo good. Bring cash....\n\nI definitely would recommend.", "author": "Ramil P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-25", "description": "This place is the TRUTH! I've been stopping by almost every weekend. My faves are the hopia, puto ube, leche puto, karioka, practically everything on the menu! \n\nMy sister used to hate hopia. I told her to try their hopia which she was hesitant to do. She took a bite and I saw the sparkle in her eyes. She looks forward to seeing that pink box now. \n\nCan't go wrong with any of the food here. The sweet old ladies that work there remind me of my Lola. Make sure to bring a lot of cash. Happy Eating!", "author": "Nichole P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-18", "description": "This is my favorite Filipino bakery in the Bay Area. I especially love the hopia (no other place comes close), maja blanca, leche flan, and pitchi pitchi. Yes, customer service isn't great (although the owner Hilda is really sweet) and the parking really sucks, but I think it's worth the trip. To me, it's better than Goldilocks, Red Ribbon, or Valerio's. \n\nSometimes they run out of things so try to get here earlier in the day.  Puto ube is only served on Friday, Saturday, and Sunday, which I was disappointed because it's my kids' favorite. I happened to come on a Tuesday. And if you plan on ordering for a party, always order 3 days in advance. One more thing: CASH ONLY.  An atm is really hard to find in this area.", "author": "Char D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-14", "description": "I grew up on this stuff every weekend until I turned 5. Even now, nothing can compare to the puto that is made daily here. Don't get me started on their pirurutong, which is basically biko made with wild black and purple rice and it is wonderful. They only make pirurutong on Thursdays, which means you have to go there quickly since it typically sells out by Saturday morning. Parking here is horrible since there's a bus stop directly in front or the store, so make sure you have someone else with you to stay in your car.", "author": "Isabel C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-02", "description": "The bakery is equivalent to a dive bar, hole in the wall feel.  They are always SOLD OUT of Hopia first and by the end of the day... Everything will be sold out.  They don't need a fancy facility because all of their Filipino baked goods sell faster than an iPhone on opening day.  Their lines in the afternoon wrap around the block, so make sure to go first thing in the morning!!!\n\nTIP: the phones don't work, and if they are kind enough to offer you a last second pick up time... DO NOT BE LATE!  Other people want your order and will BEG them, bribe them, to get it!", "author": "Maria B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-04-27", "description": "Whats the point of having a phone number if people doesnt want to pick up? Ive been calling since yesterday!", "author": "Esherjone E."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-04-12", "description": "I called and reserved 3 dozen for an early pick up the same day.  Since it isn't really a holiday, they have the hopia on hand and was told it's ready anytime.\n\nWhen I got there, I had to wait 20 minutes.  All the while I thought they were still baking my hopia. I got my hopia cold!!!! Don't understand why I have to wait that long. Never again", "author": "dee l."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-20", "description": "I've been Filipino my whole life and how did I not know about this place!??! \n\nAnyways, over Christmas break some family friends visited and brought over some of Hilda's hopias as \"pasalubong\" and they were sooooo good. \n\n- Filipino food 101 -\n\nSo Hopias are basically flaky pastries filled with sweet bean paste. The filling could be taro, red bean (like Chinese mooncakes), and there's even a savory one which would be made with pork stuff. \n\nWhile Pasalubong basically means \"host gift\" - a present given to family or friends to whom your visiting. \n\nAdd both of these together and you got yourself a very traditional gift to give someone Filipino your visiting, especially during Christmas/New Years. \n\n=================\n\nHilda's hopias are made with mung bean, which isn't a particurlarly sexy filling but the been paste was super smooth, velevety, not to sweet while the crust is flaky like filo dough. These snacks/desserts were even still warm in the box. These are the real deal Holyfield and easily the best hopia I've ever had. \n\n$18 for a box of 24.", "author": "Earl G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-01", "description": "My gosh this lady can cook! As a Filipino this is the best Filipino food I have tasted, their hopia and siopao is on of a kind. They are much, much better than goldilocks and red ribbon. This lady deserves a bigger store. Try it out you will for sure be hooked!", "author": "Abbey B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-01-18", "description": "I wish I can give them more than 3 stars but there very inconsistent in making here hopia, there are days when it's moist and less sweet and more times when they're hard and very sweet. There price went up too, I wish they would make it better before raising there price. Oh and hey never ever pick up the phone so don't even bother calling. Parking is bad. Good luck in finding one. Cash only  who Carries cash now a days.", "author": "Ana R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-22", "description": "Loved their hopia!!! Taste is almost the same back in the Philippines. Parking is hard so better to have another person either to buy and one is the driver and only pay cash.", "author": "Jap Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-30", "description": "Tried hopia, puto (white), babingka (not casava), and sapin.  All were smooth, delicious, and fresh tasting.  The Babingka was still hot from the oven and was soo delicious. It's like sweet rice glue with camamelized sugar gooey topping.  Much tastier than it sounds.  Not an expert on hopia but that was a good one, too.  I've seen photos here on the kind of sapin sapin I've gotten at Valerio's but they didn't have the same kind today to allow me to compare.  From the mix of treats I did have, though, they kick V's butt!  And super close to my house.  \n\nHilda herself waited on us and she was very sweet but I have been given a bit of the cold shoulder with service here in the past.", "author": "Desmo K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-12-23", "description": "Another bad review Hildas! You're a typical business owner that takes advantage of your product. Your business phone is once again the biggest and most annoying factor. When will you ever address this? Your product reflects the name Puto of your business phone!", "author": "BongBong A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-13", "description": "I come for the hopia. I do not leave disappointed. I only come about twice a year, despite living about a mile away, because every time I buy these mouth satisfying treats I eat more then I should. Between my husband and I, we can finish about a dozen. I have no food control. (Sad face)", "author": "Maria C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-12-24", "description": "Nice selection of Pilipino Pastry Desserts. Great to support a local business in the Heart of Excelsior with 29 Sunset MUNI traveling by this wonderful residential neighborhood. I went there several times.", "author": "Chanh N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-12-02", "description": "Hilda's goodies are really good, but reaching them by calling to inquire if they still have specific baked goods left is just impossible.  I have, on many occasions, tried calling them for three consecutive days, to NO avail.  You would only hear a recorded message giving you their hours; then after the voice message, the line gets cut off... Your call does NOT roll over to a voicemail where you can at least leave a message.  It is too bad that their baked goods are really good, but they need to improve on their service a bit.  It is so frustrating to call and make a reservation for your goodies for the holidays, when trying to reach them by phone is based on pure luck!\n\nRedgem", "author": "Red G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-11-07", "description": "Just got a pasalubong box of hopia from here. Never been a fan of hopia until I bit into one from Hilda's! Sarap! It's flaky on the outside (not greasy or dry) and soft and subtle mongo filling is a great combination. I got my box a day after it was purchased and it was still fresh. Even after putting the leftovers in my fridge for a few days, it still tasted great.", "author": "Michelle M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-29", "description": "Hopia... I always liked but never really craved. Now I do. \n\nI  was underwhelmed the first few bites with the Hopia. But by the third bite, I understood why Hilda's was so highly rated. The crust is so light, flaky and buttery. It's the perfect texture for hopia. The paper it was wrapped in got pretty greasy so you have to wonder how much butter is in there. But don't get me wrong, it was g-o-o-d! Definitely best eaten when warm. \n\nClean and airy space. Cash only -- leave your plastic at home.", "author": "Anna R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-06", "description": "Hilda's bake shop is undoubtedly the best in terms of food quality in the Bay Area. I buy their products in volume whenever I pitch in during get togetherness with family and friends. That being said; and in able to get a 5-Star rating, they've got to do the following: 1) Answer incoming calls promptly cause there are callers that lives a far distant away from your place. Your distant customers may want to verify if you carry any particular items such as relyeno bangus, dinuguan, palabok and others. 2) Answer incoming calls with common courtesy; like saying - hello, how can I help you? 3) Allow to accept debit cards (even with a fee) cause nowadays, not too many people carry cash anymore. 4) Be nice and share a little bit of smile to your customers at your store. A smile doesn't cause you a dime at all; matter of fact, it'll entice customers to keep coming back and bring growth to your business. Enough said and wish you all the best. THANK YOU!", "author": "Rod L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-02-27", "description": "Went on a Saturday 30 min. before stated closing time.... and it was closed. No biggie, I'll try it some other time. Just a heads up.", "author": "Irv V."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-05-20", "description": "Decided to eat my way through the Excelsior and this was on my list of places to stop at.  On my list of things to buy: hopia (based on the pictures here) and bibingka (based on some that I had had at a party awhile back).  I was sad to see that they did not have any individually wrapped bibingka in the display case but as I was ordering they brought out a tray of chicken empanada.  The bread looked as light, flaky, and buttery as the outer part of their hopia so I decided to get one.  The hopia was good but I've had better empanada elsewhere.  (My favorite is still the chicken pie at Goldilock's.)  The chicken empanada was $3 and the hopia 80 cents a piece so I spent a total of $5.40.\n\nA couple of things to note: there was plenty of metered parking on the Saturday morning I went but you might have to circle around if you don't want to have to pay.  Also, I wish I could chop it up in Tagalog fluently because I had a bit of a hard time placing my order and inquiring about their bibingka with the woman who helped me.        \n\nIf I ever have a craving for any of their goods and they so happen to have some bibingka and it's just as good as I remember it then I could see myself adding another star.  For now, a solid three stars as Hilda's is A-OK in my book.", "author": "Carnita M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-26", "description": "Hands down, the best hopia in the bay area. Low key, and has always been a tradition growing up. Cash only, but quality is superb. I always get my fix whenever I'm in the area :)", "author": "Tiff G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-12-31", "description": "It is hard to find parking around here, and had to wait an hour -hour and a half to purchase. Disorganized lines for people who reserved/pre purchased and ones in line just to buy desserts. Wish it was more organized - would of saved the hassle. Luckily- desserts don't taste horrible", "author": "Kat V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-06", "description": "Hilda's bake shop has the best hopia in the Bay!  They also have other yummy Filipino desserts.  Go now!  You can thank me later.", "author": "Funk G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-24", "description": "Best hopia I have ever had the pleasure of trying! I miss living in SF and getting my hopia fix from here =\\\n\n*Cash only", "author": "Surge C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-09", "description": "I'm surprised how many reviewers expect this place to have top of the line customer service - let's call it like it is - Hilda's has been and will always be about the baked goods.  They don't need to worry about providing service with a smile, the treats do that and more.  \n\nI've had my fair share of filipino treats and Hilda's hits the spot every time.", "author": "Warriors F."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-06-24", "description": "**GROSS ALERT**\n\nI went to buy biko (sweet black sticky rice) yesterday, 6/23/2013, and it had white molds today, 6/24/2013 (I have photos to share). Prior to noticing the white molds sprouting every where at 6:30 am, I took a few bites for breakfast, started feeling a bit sick and I've gone to the bathroom three times wondering what I ate that's causing my system to eliminate waste rather quickly. \n\nAlas!\n\nI'm from out of town and it won't be worth driving 40 miles to demand for a $4 refund. Hence, the negative review.", "author": "farida r."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-02", "description": "If you're craving some Filipino desserts, then this is the place for you. Their hopia is really good and worth the trip to the Excelsior.\n\nI would describe Hilda's as more of a catering business than a store front type bakery but they do offer a limited number of Filipino desserts for walk-in customers. For anything more than a dozen hopia, you're better off placing your order in advance.\n\nAs for the folks complaining about the not-so friendly service. If you've been to enough Asian restaurants (or Asia, for that matter) you'd know this is the norm. Think of it as the *Tiger Mom* approach to customer service. Also, these little old ladies probably have been awake since the crack of dawn to make your hopia, so cut them a break. \n\nCash is king at Hilda's.", "author": "Angela S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-27", "description": "One of the best bakeries i've ever been to. My mom would always buy hopias from this place and nothing else comes close to the hopias they sell here. They're flaky, rich and have just the right amount of sugar. \n\nThe suman is another Filipino dessert I enjoyed growing up and they have some here that are delicious. \n\nWe've been coming here for years and always make a point to stop by every time we visit San Francisco.", "author": "John A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-04", "description": "The Best Hopia u can find in the bay area - even better than the best Chinatown versions!!!", "author": "Nancy T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-30", "description": "Tried the maja blanca from my family friends birthday party. I can't to come to SF to buy some just for me!", "author": "chinita g."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-15", "description": "I can't recall a single family get-together/party/holiday/graduation/birthday/wedding/communion without dessert from Hilda's. It's located right in my old hood--represent! When I was a kid, we'd pile up in my dad's old Honda, double park, & wait while my mom ran in to pick up her phone order. When I started to drive, I took over the drive & double park duties.\n\nI don't know how to spell or describe these goodies, but you CANNOT go wrong with: hopia, puto & kuchinta (obviously! It's what Hilda's is known for!), sapin sapin, maha blanca, ube, etc. No surprise here...I have such a weakness for Filipino desserts. \n\nCash only.", "author": "Fancypants X."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-24", "description": "My mom and I stopped by this morning to get our hopia fix. Instead of the younger employee, who happens to be Hilda's daughter, an older lady stepped out of the back and sold us some hopia. The lady, who was so sweet, was Hilda herself! After talking to Hilda, I decided to give Hilda's Mart and Bake Shop 5 stars due to her story of how she got Hilda's up and running back in the late 80's. I completely support all these mom and pop shops and will be coming back from more of that delicious hopia!", "author": "Joyce E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-06", "description": "Really really good and flaky hopia.\nGreat maja blanca\nParking is REALLY tough", "author": "Geordie E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-18", "description": "What can I say about Hilda's? Always very neat, good customer service, good pastries (kakanin). They are not cheap but they are not expensive. Two thumbs up.", "author": "kat s."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-19", "description": "This bakery has the best Hopia in the world. Once you eat one, you'll want another one until you get full... Parking is hard to find so ask a friend to drive you there, and wait in the car while you buy your treats.", "author": "Lourdes C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-09-25", "description": "\"Mrs. Perez's Mart & Bake Shop,\" cause when I was younger she was a teachers assistant at my elementary school and that's what my cousins and I called her. We grew up on her baked goodies! Years later, we still order trays of the puto (steamed or baked rice cake) and kutchinta (sticky rice flour cake with shredded coconut) trays for family parties. \n\nDriving through the area we have to stop to see if her yummy turon (plantain & langka wrapped wrapped in a lumpia wrapper, fried til golden brown and caramelized) and carioca (caramelized, rice flour donut- sometimes with shredded coconut) are available. \n\nA must for any Filipino party!!!", "author": "S Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-18", "description": "My mom always have me buy her box of Hopia every time I go home to Tracy. It melts in your mouth, and is made fresh! yum, you should definitely try it!", "author": "mimay M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-12-04", "description": "This review is for customer service.  For many years, buying from this bakery during the holidays is a NIGHTMARE!  During holidays, they only take advanced orders.  But nobody answers the phone.  If they really cared about their customers, they will fix this problem.  At this time where you order via fax or thru the internet, this merchant has not done anything to bring their pos system to the 21st century.  Clearly they have great products.  I can only imagine the tons of missed sales because of this handicap.  Please do something...", "author": "Carol M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-11-29", "description": "Best Puto and Cucinta! \n\nMy BF's mom usually orders for holidays, but this year i offered to order b/c it's just sooo good.\n\n100 Puto for $30\n100 Cucinta for $25\n50/50 is $28.50\n\nPopular place.. so order early!", "author": "J-nine I."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-10", "description": "I was thinking driving around the mission district and remembered that I have to get something to bring to my parents house for my mom's bday celebration. So I called my hubby and asked him if he remembers the place where we get puto many years ago.  Of course it's been a long time so he doesn't remember.\n\nluckily, I was able to find this place... not knowing the name but just the way the location looked like.\nI was greeted warmly when I came in.\nI ordered puto and kutsinta.  I was going to get more but I saw the big sign saying Cash Only so I couldn't.\n\nUnfortunately, I'm on a no-carb diet so I didn't get to try the puto this time.\nMy family liked it though and was happy to know that I bought them from Hilda's.  My hubby (who's not Filipino and can be picky with food) thought the puto was okay.\n\nI'm giving them 4 stars for being consistent since their puto tasted as good as they tasted more than 6 years ago.", "author": "Learnee L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-25", "description": "My family have been coming here for years ordering puto and kuchinta for our family parties. And I have to say its always the first to go. It's that good!!! I don't know how Hilda makes her pastries, but her kuchintas is hella good. I don't know how to describe it but her puto and kuchintas is really good. One of the best I've ever tried \n\nYou MUST get their hopia... It's really good.. I can't explain, but it's like heaven in your mouth. It's soft, rich, warm, and flaky. Whenever I would go back to Las Vegas, my mom will always tell me to bring Hilda's hopia and I would. I would go to the airport hand carrying 2-4 of Hopias...", "author": "Gloribelle P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-04-12", "description": "I have a great affinity for rice cake. I love rice cake. LOVE. Kinda like a fat kid that loves cake, I'm a skinny kid that loves rice cake! Mochi, tteok, puto -- I love rice cake from all cultures. Thanks to Yelp, I found out about this bakery and it was like a blessing from the rice gods! It's definitely one of my new favorite bakeries where you can find fresh, uncommon, ooey-gooey baked goods.\n\nThere are SO many rice cakes to choose from at Hilda's!! There's so much here to try that I don't understand why people just get the puto/kuchinta/hopia. Here are some of my favorites you can get here: \n\n- Puto, a round ball of rice cake that is one of the most popular of Filipino desserts. A touch of salt balances the flavor nicely. You can get it in plain white or other flavors.\n\n- Kuchinta, an orange, UFO-disc shaped little rice cake. Has a mild banana/pandan leaf taste. Also very popular.\n\n- Sapin-sapin, a yellow and purple layered rice cake that is a sticky and sweet hot mess! One of my favorites!\n\n- Biko, a piece of sticky rice that is coated with a layer of syrup on top, toffee I believe. This IS SO GOOD, it's so soft and moist! This is probably my favorite by far and is a must buy when you visit Hilda's.\n\n- Maja Blanca, A sort of pudding made with coconut milk, corn starch, sugar, and bits of corn. Topped off with toasted coconut. It's a popular dessert made at home by many of my Filipino friends. It's very filling!\n\nIf you don't see anything at the counter you like, you can ask for for what you want and they will pack up your order. The woman who works there is really nice too!\n\nThe area surrounding Hilda's is quite notorious, with muggings and even shootings happening close by. I've never been a victim or witness of any crime and this neighborhood is filled with working class families, so I don't expect to encounter anything awful. Just in case though, grab your rice cakes and don't look anyone in the eye!", "author": "Enari L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-03-16", "description": "I agree that they may have the best hopia around, but a lot has to be said about their customer service. Because no matter how good your hopia is, if you have clientele who are not local, you have to deliver more than just taste to keep them coming back. I'm one who does not worry about going out of my way or paying a little extra, but I would also favor exceptional customer service over great taste. 'Coz really, we're talking hopia...there are a lot better things in life than hopia so let's get real here. \n\nIf you show up without pre-ordering, you would've just wasted your gas & time because you would likely go home with nothing. If you forget to bring cash only, be prepared to drive around looking for an ATM. When you do get there, expect no parking...bring someone else who could drive around while you finish your transaction or risk having one of neighbors threatening to have your car towed even if you promise to take no longer than 5 minutes. If you do decide to call ahead, might as well go there in person and be prepared to come back the next day. Because if you are unfortunate enough to actually have someone answer your call, they would gladly put you on hold and conveniently forget about you. Then they will leave the receiver off hook so that you and everyone else will forever get a busy signal. Kind of smart really...they don't want to deal with your complaints after they piss you off.\n\nI can't imagine a place doing such great business making its owner millions selling hopia that they are willing to lose customers over such poor phone etiquette & lousy service. Lots of luck to the owner 'coz the only way you're gonna have me eating your hopia again is if someone else gives them to me for free...would not spend my own money or  put myself through the frustration of having to deal with the incompetent staff.", "author": "Ruth A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-12-21", "description": "This review does not have to do with their food but their lousy CUSTOMER SERVICE. I have been trying to make a phone order for the holidays for the last 40 minutes. All I have received was a BUSY TONE. I made exactly 50 calls and all busy! I'm taking into consideration that it's almost Christmas but c'mon try to have better communication with your customers.", "author": "Katrina P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-23", "description": "The only good thing to come out of a short relationship was this wonderful place here. I could eat boxes of this and never get enough.  The hopia is seriously worth a drive from Reno to the bay of this was all they had to offer. I have a Filipina woman bringing me some and I can't stop thinking about it.", "author": "Thomas F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-04", "description": "OK, so, it looks like an abandoned building from the outside.  But, if you actually go inside, it is super clean, the staff is super friendly (once they come out of the back room and wait on you) and the treats are the best in the Bay Area.  The lady who served us was very conscientious about packing the treats, so that the ones with toppings would not get squished and the warm ones were positioned in some particular way (very grandmotherly - there clearly is a right way to pack them!).  Taste-wise, we have tried other top contenders and Hilda's blows them out of the water.  Really awesome.  Thanks!  As a tip, make sure to ask for the treats you want, even if not in the display case.  They often have more in the back that just haven't been put out yet.  And, you often do not need to buy some set amount of them, she will give you how many you want.", "author": "Meo K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-11", "description": "Hopia is hopia.This joint serves pretty good hopia fresh from the oven. They don't take credit cards. Fir the life of me I do not know why. Hopia is a Chinese influenced filipino desert. You can't find really good hopia here not even in china town. Thus this is the best hopia factory in town. Cheers!", "author": "Jorydude r."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-11", "description": "ABSOLUTELY THE BEST HOPIA EVER!!!!! Especially when they're warm!!! Nice texture, flaky on the outside & moist on the inside!!! Amazing w/ green or oolong tea!!!", "author": "Cindi N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-31", "description": "I love this place, simply for its hopia. I'm usually not such a huge fan of hopia, but I must have had really bad ones in the past because these are delicious! The flavor isn't too heavy, and the pastry is crisp and flaky and buttery. So delicious. I actually crave these.\n\nEverything else (sapin sapin, puto, etc) was fine. I'm not really that big of a fan of the other desserts, so I can't really speak for their taste (all kind of tastes the same to me, regardless of where it came from), but the hopia is definitely worth the trip.", "author": "Rhea K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-14", "description": "I haven't ordered anything from this place except for their hopia.  They did a great job and I can't wait to go back for more.", "author": "Carb Q."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-05-16", "description": "Hopia's pretty good a solid 3 stars, -1 star for the terrible customer service. No greeting when we entered. The display case was empty, asked the mean auntie  with glasses behind the counter if they had anymore hopia, her reply was \"how many you want?\" I replied 12. She said let me check and disappears to the back. After an awkwardly long wait she comes back and drops the box on the counter in front us. That's not service with a smile, and the hopia is missing a key ingredient ... love. So no will not be coming back.", "author": "Fresh Young Balki B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-01-08", "description": "I don't get it.  Got the hopia and kutsinta.  This place is a random white house and very bare inside but quick and cheap.  But I ended up not eating all that I bought -- I guess they're just not my thing but wasn't sure if I should rate them 'A-ok' since they weren't or 'Meh, I've had better' (I had better desserts but not better hopia/kutsinta since these were the first- and last :| )....", "author": "kiwi l."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-04-10", "description": "BEST BAKERY EVER!!! It's such a simple-looking place, but everything in it is delicious. It is a hole in the wall, but if we drive all the way to this side of the ghetto, it means that the food is definitely worth it.", "author": "Marjo M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-03", "description": "The best hopia EVER! I don't like the flaky part but the filling is soooo delicious and soft and makes my mouth water really bad! =)", "author": "Majileen C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-02-15", "description": "Best hopia I ever had in my life!  It was flakey, warm, with a crispy bottom and heavenly overall.  In the late 90s, my mom and I would drive from Pittsburg just to pick up a box.  That's how you know it's good... if it's worth the hour drive.", "author": "Rachel L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-26", "description": "I have been going here for years and I still love it. My family used to buy hopia for parties all the time. The hopia they make are flaky filipino goodness. It is made fresh everyday in this very secured building of theirs. Don't like hopia? No problem, there is a good variety of Filipino desserts like suman, buko pandan, kutsinta, etc.  The employees are pretty nice as well.\n\nYeah the prices are higher than before and yeah parking sucks but what do you expect? It is San Francisco after all!", "author": "Jayne A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-09-08", "description": "A Filipino bakeshop on Persia?! What?! Hell-o yea!! BEST, warmest, flakiest, tastiest, richest, hopia ever!! Skip the dang Goldilocks on Mission and walk your butt up the hill for these desserts. \n\nI can eat her hopias all day as long as they're warm. Don't be intimidated by the parking that's sometimes hard to find. Don't also be intimidated by the bland, white walled bakeshop - as the saying goes, \"don't judge a book by it's cover!\"\n\nMom always orders here in bulk for parties and they have no problems doing so, nice to see their wonderful lil pink boxes when there's family parties. \n\nNote- not sure if it's changed, but it's CASH ONLY.", "author": "Christine F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-26", "description": "I didn't know hopia can taste so GOOD! Especially this place...Thanks to my sista for bringing it to me. I am Hooked!!\n\nChecked out this place couple times now and you have to bring \"CASH\" only, that's the only thing inconvenient for me when I first went..and for that lost a star. I was also surprise how small this place was too but they compensate for their tasty baked goods;))\n\n Definetly what other yelpers says about this place is true and made fresh. If your going to order for the Holidays make sure you order way advance, especially for Christmas they sell out..even if you order a couple days prior.  This is a good place to splurge when you need a good treat for yourself...LOL..Enjoy!", "author": "Noemi E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-14", "description": "Hilda's puto is the bomb!!!  My kids and I love coming here whenever we're craving Filipino rice cakes.  On Sundays, they have my favorite ginutan which has tapioca, mochi balls, coconut milk, plantains, yams, jackfruit, and other yummy goodness!", "author": "Yvette T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-02-26", "description": "At the request of my mom, I was ordered to bring home some of Hilda's hopia. Apparently, it was the best hopia out there. I pre-ordered the hopia and they ask you what day and time you're going to pick the order up. I was tempted to try some of the puto or kutchinta, but I didn't. \n\nMy thoughts:\n-These aren't the cheapest little hopia. $9 for a dozen. \n-Eat it while it's fresh and still hot! That's when its best!\n-Bring cash. It was hard enough to find parking and then I realized I didn't have any cash. They don't take card. They do have a 10 min parking zone out front that fits about 2 cars. Cross your fingers that you get lucky enough to park there.", "author": "Danielle G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-11-27", "description": "Seriously the best puto, kutsinta, and hopia in the city, matter of fact, in the Bay Area! My family has been ordering from them since before I was born! They're thee best no doubt! But, make sure to place an order in advance if you want any of the above for your Christmas and New Year's gatherings!", "author": "Fallon P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-02-13", "description": "It WAS good but going down the hill. I used to pick up fresh, warm hopia before but now a days, it's cold and just not that fresh. The coating around the mongo bean is getting thicker. \n\nThe lady with glasses behind the counter is extremely rude. Poor thing looks like she hates her job so much! She's tired of selling hopia, so move on girl instead of giving us attitude ;) Anyway, today I called and she just answered HELLO, so I asked if it was Hilda's and she said with an attitude and that long \"H\" sigh, \"YEAHHHHHH.\" Then I asked if they had sapin sapin and she replied with the tone of happiness or some kind of victory that you don't get to have one (ner ner ner ner ner), \"We don't have anymorreeeeeeeeee.\"  I just thanked her for being soooo nice.  Hopefully, she got my sarcasm.", "author": "Lauren R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-20", "description": "The Best Hopia i've ever had!!! after eating this Hopia, I don't wanna eat any other Hopia but this!!! :) It's worth driving 40 miles\n4 star for the Hopia\n1 star for the lady and the owner who won't let us buy few extra, since we came a long way... they didn't care. Oh well :)\nTheir Hopia still the BEST!!!", "author": "Islandgirl R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-12", "description": "BEST HOPIA EVVVVVVVVVVER!!! Hands down better than ANY hopia I've ever tasted. I  live in the city and I ONLY get my hopia from here. Yummmmmmmmmmm!", "author": "Lalina Lalipops B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-11-27", "description": "I get cravings for the hopias from here!! They're even better than ones I've had in the Philippines! Parking is limited but the hopias alone are worth the trouble!!", "author": "Caralisa L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-02-08", "description": "Best hopia I ever tasted! not a very fun of eating Hopia  but when i tasted this one, everthing change", "author": "Mike V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-08-01", "description": "To answer my own question from a few Yelps back, turns out there *is* a good Filipino bakery in SF, and you can find it (where else?) in a bare white room on a little residential street 2 blocks back from Mission in the Excelsior.  Bonus star for the obscurity.\n\nSince I'm utterly clueless about Filipino desserts (this is one cuisine that has definitely not crossed into SWPL territory yet), I just went in and repeated the 3 magic Yelp-words over and over: Puto Kutchinta Hopia.  I had no idea what they meant, only that much deliciousness would ensue.  And I wasn't disappointed.  Hopia is definitely the most glamorous of the 3, being a Baklava-esque flaky pastry filled with sweet bean paste.  The puto are just sticky balls of sweet rice, and the kutchinta are orange-colored wafers of chewy rice goo (like the tteok you get at Korean places).  They may be a little austere for some, but Hilda's is still a must-stop for the dedicated dessert explorer.", "author": "Wes M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-08-07", "description": "I've been coming to Hilda's since the 90's, gotta love this Filipino Bakery! Make sure you know what you want and bring cash! My fave is the kuchinta, which is also first to go at any party. Try their hopia and puto! Hilda's is great for parties, so order in advance.", "author": "Marie P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-02-10", "description": "OMG! OMG! OMG!!! THE BEST HOPIA I have ever eaten!!! let me tell you... I've been eating Hopia pretty much my entire life... I'm part Chinese and so my dad always bought me hopia from many places in manila and one of the popular ones is Eng Bee Tin and once I tried Hilda's Hopias I was friggin hooked!!!  They have to put some sort of MSG or crack on there because it is too darn GOOD!!! the place is an extension of a house and really nothing special... but what else do you need except Crack made HOPIA?!! their kutchinta and puto is good too but DAMMMMMN!!! their Hopia is Legen...wait for it... DARY!!!", "author": "Paul C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-12-08", "description": "One of my friends recommended this place to me on the way back from some photography outing with the boys. He mentioned to me that they have the best hopia....i usually don't like hopia because the lack of tasting but boy this place sure knows how to get it done. The only tough thing about this location is finding parking....", "author": "Nasser D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-28", "description": "I'll start off by saying I have absolutely no knowledge of Filipino food (just had my first adobo a few weeks ago).  So I was eager to try this highly-rated place while in the neighborhood.\n\nHonestly, I would never have noticed it b/c it's located off of the main commercial streets and there are no windows or anything on the corner building.  My first impression when I walked in was \"omg, this place is so sterile.\"  I think it's more of a catering place (where people place larger orders for special events). \n\nThe only thing I could get individually was a hopia, which is a flaky pastry that's filled with dense been paste.  It was really good.  Of course now, I may be spoiled because if I ever have a hopia again, I'll have high standards.\n\nToo bad the puto and the kuchinta were only available in multiple orders - would love to have tried them too.", "author": "F. P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-08-23", "description": "Anyone who gives this place low ratings for having expensive hopia and puto must not know how long and how much effort it takes to actually make. It takes DAYS and this place is worth it. So go to Goldilocks and save yourself a dollar if you want mediocre desserts and filipino food. We ALWAYS have Hilda's cater for my family parties and it's delicious every time. \nI might be a little biased because Hilda is my \"grandma\" :) but seriously to anyone who lives or visits in/to SF, it's the best you're going to get. I've tried other franchised filipino food but nothing compares. When I get hopia from here after every school break, I bring some for my roommates (who are not Filipino) and it's gone within the night. It's that good!\nWill warn you: if you want some desserts for the holidays, you do really have to order a month in advance. Like I said, it takes 3 days to make puto so if you can imagine the craziness that goes on in the back, ORDER IN ADVANCE because the line seriously wraps around the block for pick-ups.", "author": "Renee Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-03-07", "description": "I must say I really am impressed with my TB\n\nso after a good game of tennis...tb had to drive me home...and instead of eating out he drove me here instead...although the only thing left was the puto...it pays to know that a store such as this exist.\n\ni think they mostly cater and from the reviews they are known for their hopia...next time we'll be early then maybe i can try the sapin-sapin and espasol.", "author": "Malou C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-11-11", "description": "I got to say i was massively disappointed when i arrived at hilda's after having read such good reviews on here.\n\nNow to be up front, i didn't actually taste any of the food that was sold at Hildas. I went out there in hopes of finding some good pan de sal and other random filipino treats.\n\nWhat i found was a shop that i found to be surprisingly expensive. I mean c'mon more than 8 bucks for 12 hopia??? And $2.50 for one empanada??? What is going on there? It's no wonder Dina V. spent over $500 in the past few months.\n\nOn top of that, they didn't even have bread items, atleast not that i saw anywhere around, or any mention of on the menu board (which were all prints from a normal home printer on normal printer paper.) I went there on a mission to find good pan de sal, and maybe some pan de ube. But nope, none to be seen.\n\nEveryone may be praising this place for how good the food tastes, but there's no way i'm paying those prices when i'm accustomed to prices  drastically lower than that. And it makes you wonder why with such high prices they couldn't even make the place look even the slightest bit welcoming.", "author": "Charles Michael B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-11-15", "description": "My dad's been buying hopia (mongo) - 10/box for", "author": "Katherine L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-07-18", "description": "I was so excited to try their puto (white, not ube) since reading all the rave reviews, but it was mediocre at best. Was super thick, sticky and plain - these can sometimes be considered good qualities for puto, but in this case, it just tasted like it was old. The bakery is in a sort of residential neighborhood and looks pretty barren and old (but clean) from the outside and inside. Not the friendliest worker either. Wouldn't go again.... Maybe their other baked goods are better?", "author": "Maria Y."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-11-21", "description": "Rating the food alone would make it 3 stars but the service makes it a 1 star. We drove all the way up to San Francisco from San Jose (47 miles) to buy a a batch of hopia and other food  for a family party. We had been trying to call the past few days to pre-order but the phone was \"always\" busy. When we got there they weren't selling anymore hopia. They told us and several other customers that were there for the same thing that we were out of luck and that they don't bother to answer the phone. They just  leave it off the hook and said \"so now you know.\"  Customer service is an important aspect of this business but they are greatly lacking it. Also, it's in a ghetto part of town with a lot of degenerate people close buy so watch out for your safety as well.", "author": "B T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-10-31", "description": "One of the best Hopia (Yellow Bean cake) I have ever tasted.  The bad part is you have to call to make sure if they still have them.  I sometimes show up the shop and they do not any any bean cake left for me. \r\n\r\nDuring holidays from Thanks' giving to New Year.  Call in Advance!!!.  Last year I called around Dec 4 or 5.  They told me to call back after Jan 10!!!...can you believe this!!!.   It is worth to wait.  Good New Year gift.  \r\n\r\nOther items look good too but I have not tried yet.", "author": "nida s."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-06-16", "description": "Manang Hilda must be one rich woman b/c in the past few months we've dropped down nearly $500 for hopia, cucinta, and puto. Oh yeah and on occasion for dinuguan and bibingka too.\n\nIf you're lucky your box of hopia is still warm. It nearly melts in your mouth. I have yet to taste a better hopia.\n\nThe cucinta is just right too. Not to wet, not too squishy, and not too dry either.\n\nShe gets SUPER busy around Christmas and New Year's so be sure to get your orders in early. And FYI, she's closed on Mondays.\n\nIt's a wonderful addition to bring to potlucks and parties, the stuff will be GONE, no doubt.", "author": "Dina V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-05-30", "description": "We've been going to Tita Hilda's for years. It's almost unheard of when we have our own party and there is no Hilda's puto, cuchinta, or Hopia. \nConsistent and insanely good - people expect and ask us to bring her home-made goodies to every party we go to as well.\nThe price is reasonable ( I'd pay top dollar for quality food any day) and the rest of the food that I have had on their menu is yummy too. \nThe store front is nothing fancy, the service is what you would expect from a family run business. \nWhen it comes to cuchinta, puto, and hopia - You won't find anything else like it.", "author": "Mira T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-03-27", "description": "Skip Goldilocks  and go to Hilda's instead!!!! Sorry I am being really honest here, Goldilock has nothing on Hilda's bakeshop especially the quality and freshness. Love this place, everything is freshly made everyday.", "author": "Tess C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-05-09", "description": "My awesome FIL just stepped off the plane with a big pink box filled with fresh hopia from Hilda's!  I just inhaled 5 of them, and it was heavenly!  Sweet bean filling with a flakey, yummy crust, melt in your mouth bliss!  Hilda's makes the best hopia I've ever had!  Now if only there were a Hilda's in Las Vegas...hey, I can dream, can't I?  Hilda's is now on my must-haves list when I visit the bay!  Can't wait to eat some more for dinner!", "author": "Mona C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-19", "description": "When you see a foil covered tray at Filipino parties, you know where it's from!!! ....HILDA'S OF COURSE =)\n\nHilda's hook it up when it comes to puto and kutchinta. If you are a bit daring they even have the purple puto on the weekends only too!\n\nIt's best to Pre-order desserts trays at least 48 hours in advanced via phone and then you have come to pick it up. This place is located amongst the neighborhood homes and may easily be missed. Warning to all the passer-bys, you may be surprised when you get here because there's not many bakery items on their shelves as do most other bakeries. This place mainly thrives and capitolizes on it's To go Filipino dessert party trays.\n\nBased on all the other yelp reviews, next time I'm trying their Hopia.", "author": "Cathy D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-01-03", "description": "My family has been eating Hilda's Hopia since I was a little girl living in South San Francisco. She was a part of a prayer group that would bring Our Lady of Fatima to our house every year and we have been eating her hopia ever since. \n\nThe hopia still has the same flaky outside consistency and the filling is sweet and savory and the perfect bean consistency.  I know her prices have gone up (as others have complained) but so has the cost of living and not to mention the size of her hopia! They are significantly bigger than those made back in the 80's, so I definitely think it is worth the price!\n\nAlthough I don't see Hilda in the prayer group anymore, her Hopia is still the best!", "author": "Maritel C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-09-17", "description": "A super bare-bones bakery - just a single glass display with various sweet and savory treats and a back room.  No place to sit or mingle - just the kind of hole-in-the-wall I naturally gravitate towards.\n\nTried the much talked about hopia, which was flaky, rich, and buttery, but not particularly exotic or interesting to me.  The lumpias had a tasty filling of corn and other nondescript vegetables.  Arrived around 11am and both tasted like they'd been sitting around for a few hours.", "author": "Jeremy C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-02-07", "description": "HOPIA!!!!!  their's is really good stuff...the best i've had in a LONG time.  almost as good as the ones i remember as a kid that we would buy from a filipino store in pasadena close to fedco (sort of unheard of considering it was the 80s and was too ahead of it's time for it's own good.  it eventually closed.  but they sold really flakey hopia in small pink boxes.  not sure where they got them--if anybody has similar memories from their childhood and knows this store, holla!).\n\nthe mongo filling is fresh and the wrapping is how i like hopia to be.  not too thin and doesn't fall apart too much.  it's got a buttery flavor too...eeek but yum!\n\ni totally feel the review below me on the hours of the store.  they're somewhat flakey...uh, no pun intended.  heh. my parents were up there in december and had to go back 2-3 times to try and pick some up because they were told to return at a certain time. BUT when they did it wasn't open and craziness like that.  thankfully, they didn't give up on hilda.  definitely call ahead (and a few times more apparently), you can't just walk in...at least for their hopia.", "author": "Leni A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-07-14", "description": "1 star for customer service  sucks. The owners daughter can't even smile it seems like she is force to be there at the store.No parking even in the front of the store.  They do not open on time ( 15 min late), and when they open it is cold inside and dark. The owner shows up  at 0930 ( store opens at 9:00 am) from church and asked the employee whey the light is not on.  Hopia is good and still  the same size as before  and the same price .  I will not come back again and I do not recommend this place since the are other places go.", "author": "Ja L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-08-08", "description": "Someone took me to Hilda's Mart & Bake Shop. Standing outside I was wondering where I was being taken. Inside I saw my favorite Palitau. It took me back to Via Mare / Greenbelt in the Philippines. Now I go back every week for guinitaan bilog bilog.   This place doesn't look great, but runs circles around Goldilocks and Pampanguena Cuisine.  Everyhing is freshly made.   It's kind of clinical looking.  But they get a great crowd there. Hilda's is getting my business for the holidays.  Check it out.", "author": "Roland P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-10-22", "description": "Ay nako! Ang sarap sarap ng hopia!  In other words, oh my the hopia is so good!  \n\nBased on the reviews on Yelp, I decided to venture out there on a Saturday afternoon, hoping that they didn't run out of any pastries.\n\nWalked in and it was a surprisingly small store with only one glass shelf showcasing what pasteries they had.  I was a little nervous because the people in front of me were speaking and ordering in tagalog and my tagalog is a little rusty.  Thank goodness a young woman came out from the back and started speaking perfect english.  Whew!\n\nI tried to order the ube puto, but it was already sold out. A few items that I asked for was also sold out!  I decided to go for the 12 piece Hopia and the last Karioca stick on the shelf.  Both excellent choices. The hopia came out still warm and the crust was soft and crumbly.\n\nSuffice to say, I would definitely venture back for the amazing Hopia Mungo. I'm sure the rest of the pasteries are to die for too.", "author": "Ny H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-05-31", "description": "Their hopias are absolutely addicting! I usually don't care for hopia but hopia from Hilda's  mart is a different story. I love the flakey goodness of their hopias!", "author": "J V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-09-04", "description": "The best hopia West of the Mississippi! Hilda will not disappoint you.  She makes the BEST hopia & puto. Putoooo! Real talk. No one else compares to their hopia but if u know anywhere else that does please let me know! ***Cash only.", "author": "Marcia G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-16", "description": "I've driven past Hilda's quite a bit and saw it had good reviews on Yelp, plus I never had phillipino dessert before so I figured I'd give it a shot. I've read some of the negative reviews on here and for the most part people are absolutely telling the truth. The customer service isn't great (standard Asian establishment customer service), and the location makes it a pain to find parking. Also, the cash-only thing is pretty standard in SF but the good news is there are several ATMs on Mission which is 2 blocks away. I've seen them turn large orders away because the customer didn't order in advance and Hilda's didn't have enough inventory to fulfill the order. Despite all of that, the items here are very good. I think if you abide by their rules (make larger orders in advance, bring cash, and prepare to drive around a bit to find parking) you are in for a tasty treat, especially if you've got a taste for phillipino baked goods.", "author": "Ken C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-09-24", "description": "Oh my god!  Who knew this place had such wonderful hopia in there.  Seven years ago, I used to catch the 29 up and down Persia St. and always said to myself \"This place is still open?  Who the hell comes here?\".  I do, you do, we all do!", "author": "Chai S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-08-08", "description": "BEST hopia and puto I have ever had.  I also ordered the buko pandan and was extremely dissappointed because it tasted pretty bad. Maybe it was old...4 stars!", "author": "H. A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-11-17", "description": "My family has been ordering their hopia, puto, and kutchinta here for more than 10 years now!  The quality has never changed!", "author": "Chrysantha C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-11-13", "description": "4 STARS.  Tradition, tradition.  Hilda's has been and always will be a huge part of our big ole filipino family tribe village parties, for their world-famous KUTCHINTA and \"PUTO\" (yea, that's what they're really called. i know, i know, it  also means something meaningful in Spanish, si comprende).  They're good because they bake everything fresh, daily and onsite, which is worth YOUR every cash money.  TRUST ME.  Don't ever forget the yummy block of coconut shavings to go with (always buy an extra for backup).  Fo sho, it doesn't hurt to call in advance for party orders especially during the holidays.  BTW, i said it's CASH ONLY, beb.", "author": "Carmel D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-04-10", "description": "Hilda's bake goods have been a family favorite for years!!!! It's a must at family parties. I suggest you order ahead. They will sell out! Their hopia is the best around!", "author": "Amy M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-10-22", "description": "Hilda's has been known for their puto and cucinta! They are delectably delicious and are always a staple at every celebration in my family! Better get your order in for Thanksgiving or Christmas --- they stop taking orders two or three weeks before the holiday but they are so bombarded with orders.", "author": "La C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-25", "description": "YUmmmmmm!! the casave cake and espasol are soooo good. I will come back and try more stuff here.", "author": "rocelle l."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-08-24", "description": "They have the BEST hopia in the world.  I drive all the way from San Jose just to get their hopia.  Make sure to order ahead of time because they usually run out.  Puto and kutchinta are also good.  Each hopia is 75 cents but it's worth it.", "author": "Sheila S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-01-23", "description": "Hilda has really perfected Filipino desserts! It's sooo good that people from around the bay come to this store to bring desserts for family parties. Her daughters are nice, their the ones who work in front most of the time. I live a couple of blocks away from this store, so I can say that I am truly blessed :)", "author": "Katarina V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-09-26", "description": "It is enough reason to not visit the Philippines for awhile since HILDA satisfies my craving for Filipino sweets. What an amazing bakery! We, San Franciscans, and bay area residents, those who are willing to drive for an hour to buy Hilda's desserts, are so fortunate and spoiled for having access to awesome hopiaZZZZZZZZZZZZZZZ. So sublime.  Yes, buy them when they are hot. If you live close enough to the shop. Quickly drive home, heat up some tea, and enjoy your HOPIA. Eat it with your close eyes and smile each time you chew a piece of it.", "author": "Magdalena D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-22", "description": "Good Filipino delicacies! My favorite is the hopia of course. I'm not sure what they put in it, just similar to what they put in that  krispy kreme glazed donut.  I'm deducting 1 star because I feel like every time I come here, the hopia's price increases jut like Golden gate bakery's custard tarts.", "author": "JB L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-12-08", "description": "Best hopia I've ever had.  Grew up on this stuff!", "author": "Lauren S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-02-03", "description": "Let their desserts speak for themselves. It's way better that Goldilocks & Red Ribbon(for all the Pinoys out there!).", "author": "Jays D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-10-05", "description": "kutsinta is good but kinda pricey.  Try the macaroni salad, yummy too.", "author": "kyra d."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-10-16", "description": "I love this place 3 times a year...Thanksgiving, Christmas and New Year! My family has been buying hopia, puto, and kutsinta for years and it's the best around!", "author": "Rose E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-11-25", "description": "A little out of the way from Mission Street is this little store right in the corner.  Their puto and kutsinta are the ones I have tasted and they are soooo good.  My sister from Elk Grove would always order them to bring back to their place whenever she's around here in SF.  The price is a bit up there but that's probably the reason why they are soo good, the quality and taste... parking is a bit tough, it's all on-street parking and yes, making reservations is probably a smart thing to do...", "author": "Surfer S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-04-16", "description": "My folks and I live about a mile away and we usually order just two things: puto and cuchinta. My parents have tried the other stuff and have said it's pretty good. And over the years, prices did go up a bit but you get what you paid for.", "author": "Conrad C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-08-17", "description": "i've been going here since i was a little kid. this is the place for fresh baked filipino sweets. i love their fresh baked hopias, all kinds. and of course for every party we have we order puto and kuchinta....", "author": "Justin C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-04-29", "description": "I tried the hopia because of all the very positive reviews citing it as a top item. I don't agree with those assessments. It's just okay and certainly not worth the price for me. I prefer the style of hopia that Valerio sells. I also bought a couple of empanadas. I don't remember if they were chicken or beef. Anyway, same thing as with the hopia. They're just okay. The last thing I bought was a pack of the ube puto. They're not okay. Too mushy and they tasted half-baked.\n\nIf I lived around the corner from the store I'd shop there but since I don't I don't see the point of going out of my way for the things I ate.", "author": "tom g."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-03-14", "description": "The best place to buy Puto, Kutchinta and Hopia in the bay area.   I recently tried their dinuguan which is also very good.  Goes very well with the puto. \n\nAling Hilda's sells mainly dessert items.  Few choices but all are very good.  Price is resonable.  You get what you pay for.", "author": "R H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-10-28", "description": "Yummmm...hopia.  They make the best hopia in the bay area.  It's a tad expensive but worth it.  You need to go early or call ahead and reserve because they do run out.  Their puto and kutchinta is a staple at our family parties.", "author": "Josette S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-01-08", "description": "NO STAR AT ALL if possible but looks like I have to put at least one.  One is too generous of me.\n\nWent there last Sunday at 10:00am, gates were closed.  There were 3 of us waiting and one lady was knocking on the door since they were supposed to be open at 9:00am on Sundays.  After almost an hour a lady with a bad attitude opened the gate.  We felt like it was such a big burden for her to open the gates.  They only had a few packages of cuchinta available.  Asked her if they had any puto, she said none and they're closing because they had to go somewhere.  So she was rushing us to go and leave.  Asked what time they'll be open again she said she didn't know maybe around 1:00pm.  Asked if they were going to have puto she said just come back maybe they'll have but maybe they won't.  While I was talking to her she would walk in and out towards the kitchen.  Can she be more friendly than this?  I've been to this place a few times and have encountered this woman with such bad attitude so unfriendly.  Why do they put people in the counter that seem to not like their job?  I guess this is the last time I am going to this place.  \n\nSo for you folks who like their puto go to Claire's Pastry & Restaurant on Mission in DC.  They have the same puto consistency.  Only problem with Claire's you have to order in advance.", "author": "Joey J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-01-17", "description": "HIlda's makes the best and freshest hopia ever-- perfectly flaky crust and the tastiest bean filling!  The first time I tasted one, I fell in love instantly.  They remind me of hopia from the best bakeries in Ongpin in the Philippines.  Fans of Filipino desserts, look no further.  I've had the puto, kutsinta, and sapin-sapin, but I'm an even bigger fan of the maja blanca and espasol.  These are treats that bring me right back to childhood meriendas in the Philippines.", "author": "karen c."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-09-02", "description": "They make the best hopia hands down.  It's worth the drive and commute traffic from Berkeley anyday.  Just remember to order ahead so as not to be disappointed to arrive and not have any left for your taking.", "author": "Liz J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-06-24", "description": "Hilda's bakeshop offers great family desserts.  They have the BEST kunchita evr!   Beware on special occassions, esp christmas & new years day.  It gets very packed but the wait is worth it for meeh !!!!", "author": "aggie t."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-07-03", "description": "best hopia and cuchinta ever! itheir cuchinta reminds me of childhood in the philippines. i used to go to Manaog (sp?) with my grandma before going to Baguio and i would always buy the cuchinta there. Hilda's cuchinta brings back memories :)", "author": "Therese G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-01-19", "description": "have to 100% agree with everyone - this is the spot to get some great hopia, puto, and kutchinta. and we've been doing since i can remember..\n\nevery time there's a family party - these are the staple desserts that were most probably purchased from hilda's! \n\nask anyone, everyone knows about the deliciousness at hilda's..", "author": "L B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-05-24", "description": "best hopia I've ever tasted, nuke it in the microwve for a couple of secs and you're in heaven", "author": "Michelle E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-08-10", "description": "I LOVE THIS PLACE!! My family has been ordering from this place since god knows how long. Never disappointed, always frickin' good kutchinta & puto. =)", "author": "Rachel P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-03-16", "description": "Even if the lady @ the front  who helps customers out is moody this place has the best puto and hopia.", "author": "Milana S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-01-09", "description": "got my hopia while it's still piping hot. flaky and crumbly.  there is something about the taste that is a bit off like it wasn't seasoned enough. the filling tastes good by itself and they are not stingy with it either. quick service and hopia was packaged nicely. the bakery looks clean, too. for some reason. quite pricey for 75 cents each.", "author": "poing p."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-06-25", "description": "hopia =  perfect consistency, texture, n taste. ...well worth my 75cents! puto & cuchinta = also winners but they didn't give me any coconut along wit it. bibinka = not worth da price given the portion size, otherwise it was only okay. They have a sign saying they also serve dinuguan. Not sure if that's any good.  By the way, it's cash only & they're closed mondays.", "author": "cj d."}
