{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-14", "description": "Came here and ordered a lot of food for a big group of people. Personally, I think this is the best way to tackle this place as they have many different selections that you'd want to try. The ability to order family style is an extremely powerful one as you can satisfy your cravings in multiple areas like beef noodle soup, bbq squid, pork belly over rice, fried chicken, pancakes, etc etc and the list goes on.\n\nAll of the food above + taiwan beer = happy brain and stomach. The place is very authentic and service is excellent. Food is reasonably priced. Parking is a bit hard which is one negative and portion size can be dauting for those from out of the country but this is fine for me.", "author": "Sang P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-23", "description": "The shaved ice was fairly decent, I don't think you can really mess up this dessert. Lots of brown sugar flavor, loaded with red beans, grass jelly and the taro balls. I loved that taro balls because they were huge and soft/chewy. Big portion so perfect for sharing between 2-3 people. Their dessert selection wasn't as much as I thought but hoping that they can expand it. \n\nThe beef wrap was actually pretty salty. I wish that they had the hoisin sauce instead of soy sauce, but even by itself it was pretty salty. It was a tiny wrap, but packed with a lot of meat.", "author": "Stephanie C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-20", "description": "Got the squid. It's was pretty good though I wish they served it with Japanese mayo. \n\nThey should add stinky tofu to their menu for the full experience. \n\nWould come again.", "author": "Michael C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-24", "description": "I wanted some dessert after dinner and HoDaLa was within walking distance from where I was so we decided to give it a try!\n\nIt's a nice spot and it reminds me of Taiwan in some ways. There was no wait and we were seated immediately. After looking at the menu for a few minutes, we ordered the taro ball shaved ice (substituted mochi instead of boba) a milk tea with grass jelly and we were curious about the Taiwan beer with lychee so we went ahead and ordered that as well. \n\nOur order came out relatively quickly. My favorite was the beer with lychee! I'm not a big beer fan, but this was definitely chuggable LOL. The milk tea was standard, nothing too special. The shaved ice was alright, it was too sweet tbh with all the syrup and I wasn't a fan of how hard the ice was. \n\nI'd definitely come back to try their savory foods next time! I'm not too sure if I would order their shaved iced again, but their other sweets look really good as well!", "author": "Stacey Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-23", "description": "Me and my friend came to get dessert on a Saturday night around 9pm and there was no wait. There is an iPad for you to put your name on the waitlist for when it gets busy. The vibe is Taiwanese with Asian music playing in the background and music videos projected onto a wall. \n\nWe ordered the TW gold medal Beer with lychee, Grass Jelly Milk Tea, and the Taro Ball Shaved Ice(we were able to substitute the boba with Mochi!). The beer came in an interesting glass skull jar and was really refreshing. I enjoyed the milk tea and taro ball shaved ice but my friend thought it was a bit too sweet. \n\nIf I didn't just come from dinner, I would have definitely tried their savory treats. Their steamed buns and rice bowls seem really authentic and promising! They also have Happy Hour Specials and non Taiwanese drinks like Sake, Sangria,and Soju!", "author": "Michael L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-09-08", "description": "Love the concept and how unique this place is.\n\nWhat I tried:\n*Taiwanese pork belly buns (3) - worth!\n\n*Scallion pancakes - was ok, little pricy\n\n*Beef tomato noodle soup - noodles were undercooked and too little broth. Maybe if the broth was less thick it would be better\n\n*Whole squid &noodles - worth it. Squid is good but noodles were a little too salty\n\n*Pineapple shaved ice - was ok, good for sharing \n\n\nOverall thoughts:\n*Surprisingly very crowded but on a Friday night. We took the last open table and there was a wait to be seated even when we were leaving. This location has changed restaurants/owners so many times. Looks like they are still trying to establish their menu tho. I hope this one lasts!\n\n*Tables were too close each other it was hard for people to get out without touching the table next to you and get close to them. I like the little island in the middle with seating but it really makes the restaurant cramped. \n\n*What is unique is are the Taiwanese fruit beers and snacks for sale in the middle of the restaurant as if it was a convenience store\n\n*Food ideas are good but some flavors/cooking style could be tweaked.\n\n*Quick service, quick food, loud music and overall good vibes.", "author": "Sarah W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-04", "description": "Just look at this picture. Yeah. That's right. You can be rest assured it's as good as it looks. Watch the drooling.\n\nMy friend claims after over a year of searching SF for Taiwan-style shaved ice dessert, this is the only one (or at least, the only one that gets it right). Plus, the decoration is so stereotypically Taiwanese that it actually works and makes me laugh / feel right at home singing along to 90s Taiwanese pop, complete with music video being projected on the wall, of course.\n\nI def need to visit again... but this time for the squid dish. It looks just as fantastic and terrific... yeah, I'm drooling. \n\n(Also, don't forget to check into the waitlist before you get there!)", "author": "Jeffrey C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-10-04", "description": "A friend told us about this new Taiwanese place in the city that opened up so of course we had to try it that day. The wait was quite long because we didn't check to see that they supported Yelp waitlisting. That's okay though - the absolutely nostalgic decor and bumping KTV on the giant TV screens kept us occupied while we stared the menu. \nThe prices were quite high..as a result we only ordered one Taiwan beer to share. However, we did splurge on the guabao! The plating was beautiful, but the taste was not authentic. At least they got the peanut powder right. \nWe were hoping that the beef noodle soup would be the star of the show, but our entire table was left severely disappointed. The soup was spicy, but not in a flavorful way. The noodle texture reminded no one of Taiwan, and the beef was average. Even if we didn't wait ~45 minutes to be seated, the CP (or more appropriately lack of) means that I will probably never be back.", "author": "Tiffany S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-20", "description": "Came here on a Saturday for lunch and was pleasantly surprised! My favorite thing was the ground pork over rice which was great comfort food. I ordered the tomato beef noodle soup and was slightly disappointed that the soup didn't taste like tomato. I would like to see Xiao Long Bao's on the new menu!", "author": "Mauricia L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-07", "description": "The ambiance inside leaves me feeling relaxed and laid back.  Really nice and cozy spot to sit back, chill, and hang out with friends for a late night snack.  The portions aren't too big so I'd recommend ordering many small bites and sharing around.\n\nI like the braised beef noodle soup the most.  The broth is very flavorful and not too overpowered with msg.  It's a bit spicy so beware.  I'd like to see a greater selection of desserts and drinks available.  The Taiwanese beer was an interesting selection to their menu and i'd recommend it.  This place has a taste of authenticity without having to traveling overseas.", "author": "Derek L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-21", "description": "Reminds me of Taiwan.  I use to travel to Taipei and Taichung for work about twice a month for about 3 years and have gotten to know the place & especially the people... who are really chatty.  Coming here reminds my of the place.  The tastes and variety are similar (although much larger portions to accommodate American appetites) the taste are close enough.  I've not found another Taiwanese place yet in the Bay Area so this will be it for a while.  The 魯肉飯 (ground beef on rice) brings me back the the alley next to my Taipei office.  I think I will be a regular.", "author": "Leung T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-20", "description": "The Taiwanese Pork Belly Gua Boa was delicious! I'd recommend adding red bean and tapioca dessert to the menu", "author": "Michael C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-10", "description": "Great service, interesting decor and chairs. \n\nThey play some pretty nice mandarin jams - music video is also projected onto the wall. \n\nHappy hour is until 6:30, and there's quite a few selections on there.", "author": "Charlie M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-20", "description": "Very cool Taiwanese place.  The decor is vary home-y, the food are interesting. And hey look a giant squid!!", "author": "Ivy Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-07", "description": "Ordered Sizzling Surf & Turf (steak and squid, $21.95) and the Kimchi Pork Belly Gua Bao ($8.95). This was more than enough food for two people. \n\nThe whole squid was delicious. The steak was a little too well-done for my taste, but probably most Taiwanese sizzling beef is like that, and I had forgotten. I wonder if they could cook it more rare for you if you asked. Also, the sauce coating the pasta was quite salty. \n\nThe baos were basically a really large hunk of pork belly and a single piece of kimchi. I would have preferred more kimchi, perhaps some other fillings as well?", "author": "Julia C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-04", "description": "A good Taiwanese place. Loved the Taiwanese pork belly Gua Bao, steam rice cake, sizzling beef and noodle with black pepper and mushroom sauce (a bit too salty), beef noodle soup (a bit too salty), taro mi-fun soup, and friend chicken. \n\nOthers we liked less were: stir fried preserved eggs with sweet potato leaves because he leaves were too old, winter mellow tea with grass jelly because the jelly is not smooth like what we had in Taiwan, Sapporo beer because it taste old, and rice was dry and not tasty. \n\nKeep the good work! Love the fact there is a good Taiwanese place in town!", "author": "Anya C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-06-08", "description": "Really wanted to like this place. Customer service was great. Food was alright. \n\nMixed Gua Baos- pork belly, kimchee pork belly, fried fish. I enjoyed the pork belly, would skip on the kimchee pork belly. \nFried Chicken- tastes like a giant popcorn chicken. Liked. \nSizzling Meat Lover- strong black pepper sauce taste. Steak was chewy. \nTomato beef noodle soup- average. Would not order again. \n\nWill try the minced pork rice next time. Price was totally reasonable.", "author": "Tina S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-08", "description": "Nice atmosphere and decorations. No line on a Thursday night at prime dinner time.\n\nFried chicken cutlet: this is a secret item not on the menu. Delicious, does not need any sauce, just the right amount if seasoning, fried perfectly, juicy, not too dry.\n\nTomato noodle soup: portion size was small and only contained one small square slice of a tomato, but was still pretty good.\n\nGround pork over rice: comes with a tea egg, again small portioned but was quite good, full of flavour.", "author": "Tom P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-06-30", "description": "So sad, I came back and had a very different experience. Maybe the chef was different. We ordered the beef rolls, yam vegetables, beef noodle, and pork rib rice. The veggies were way over salted. The beef roll was ok, also a bit too salty and the beef was dry. Pork rice was also mediocre since the pork was not that tender. The beef noodle was probably the best.\n\nI really hope they work out the consistency!", "author": "Sophia H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-06-16", "description": "Decent food but not exceptional, but unfortunately what I got was priced well above its quality.\n\nI have to say, looking at the menu made me a little excited, everything sounded really delicious. After looking on Yelp, I got an order of the pork belly buns and an order of the \"sizzling meat lover\", which looked very good in pictures. After eating, however, my overall analysis is that there are better options close by (just head up to Clement and go in almost anywhere - there are so many good and cheap restaurants nearby!)\n\nUnfortunately, the pork belly buns I would have to say were just pretty bland and a little dry; they could really use a little fish sauce or some other kind of sauce to liven them up. \n\nI definitely enjoyed the meat lovers more; the noodles were served with a tasty broth and properly cooked meats. It's not a soup but it's a little more juicy than say an Italian noodle dish. Definitely enjoyable, but still nothing to write home about - it was just good, nothing special. Unfortunately, this was priced at $19.95. (I did notice that price is $1 cheaper in the restaurant vs delivery)\n\nBetween the pricing and lack of anything special, 3 stars felt right. I'm not upset but i am disappointed. You can get better buns for $1.30 each just a few blocks away, or better noodles for less money even cheaper, and that's what you should do. \n\nI did notice there are some items on the menu - especially the cheaper entrees - that were not on uber eats, so perhaps I will stop by in person or get take out to try them sometime.", "author": "Chris S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-16", "description": "An awesome little convenience store/taiwanese restaurant combo right here in SF! \n\nAlthough this place is a little more hipster than I'd like, I guess you really can't have a restaurant in SF without having some sort of fusion/hipster aspect to it.\n\nThe food is pretty solid, albeit a bit more expensive than I'd like to pay, and there's plenty of cool asian snacks to check out as well.\n\nWould definitely stop by here at least once to check out their offerings, just not sure if I'm ready to commit as a regular customer yet.", "author": "Andrew T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-26", "description": "In a neighborhood of heavily Asian restaurants, Taiwanese food is actually a much welcomed cuisine.\n\nYES to the braised beef noodle soup. Just the right amount of familiar noodles, soup, and a sprinkling of veggies. I wouldn't mind a few more carrot pieces though! Popcorn chicken is an old guilty pleasure and a snack i frequently ordered at boba shops. For a similar dish, get the fried pork chop over rice. Same seasoning, just a little heartier.  Between the chicken bao, the pork belly bao and the fried fish bao - the fried chicken bao took first place. While you can get all three, just opt for 3 of those!\n\nI'd come back again despite the uncomfortable seating! Are these former auditorium chairs? No one wants to eat noodle soup in these...", "author": "Samantha L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-24", "description": "*you can reserve a spot to wait on line via yelp*\nResidential and street parking available in the area. \nThey serve Taiwan Beer here\n\nI had the fried pork chop over rice ($9) and my boyfriend had the fried chicken over rice ($9), and both dishes were a disappointment. The fried pork chop had no flavor, despite having a crumb filled coating. The fried chicken over rice was a lot more satisfying, in terms of flavor, but after eating a few bites it got overly salty. The rice dish came with some bamboo shoots and one piece of boiled bok choy. Perhaps I am spoiled by 66 in Flushing, NY growing up but this place didn't live up to my Taiwanese pork chop over rice standards. Dinner with a beer to share, after tax and tip came out to approx. $28, which isn't bad in terms of a meal for two, but the money definitely could've been better spent elsewhere.", "author": "Victoria X."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-08-23", "description": "I studied abroad in Taiwan and miss the food so much, so I was really looking forward to trying this out since there aren't many Taiwanese spots in SF.\n\nThere was a lot of variety on the menu but I settled with 3 items: popcorn chicken (happy hour item), braised beef noodle soup, and the beef wrap. \n\nMy overall impression of the food was that it was too salty. My mouth is still feeling pretty dry and it's been ~5 hours since I finished my meal. I had hoped there'd be more sweetness to the beef broth and beef wrap. The beef in the soup was somewhat tender, but the outside was slightly dry. Both dishes were meaty, however. \n\nThe popcorn chicken was surprisingly my favorite. It was seasoned and battered well. The sauces included weren't a good match though (wish they had a sweet chili sauce, they just had ketchup).\n\nI may give this place another try, but it doesn't seem worth the drive from the outer mission. I'll stick with my favorites in the sunset..", "author": "Mary X."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-13", "description": "This place is so cute! I love the theme and the theater chairs. They sell lots of snacks too, reminds me of my childhood ^__^\n\nI ordered:\n- Beef Noodle Soup Tomato\n- Pork Belly over Rice\n- Chicken Cutlet\n- Green Tea with Cheese Foam\n\nMy favorite thing here is the chicken cutlet, massive pieces and a lot for the price! The place is also a nice drinking spot too with plenty of snack foods, I can definitely see them adding more shareables like french fries with a Taiwanese twist. :)", "author": "Joann H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-26", "description": "If I were Odysseus post-Trojan War, this place would be my Ithacan homecoming. That is to say---Many moons have I searched for a decent braised beef noodle soup!\n\nHoDaLa is what's up.\n \nGet the beef noodle soup. It's spicy, the noodles are flat and have great texture, the pieces of beef are tender and flavorful if not plentiful, and the bokchoy and radish round out the soup.", "author": "Cindy T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-07", "description": "The portions here are humongous! I particularly like the fried octopus on a hot plate of noodles. It's a creative mix of two distinctly different ways of cooking food and putting them together was a heavenly blend of tastes, an absolute delight on the taste buds. The chicken cutlet was equally amazing. Tenderly cooked chicken thigh meat served with tangy mayo sauce, I enjoyed it alot.\n\nI'm not sure how authentic the Taiwanese dishes are but one thing I'm sure about, I like the food and will come back again!", "author": "Yang Shun T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-25", "description": "Yay, there's finally a Taiwanese spot in the city!\n\nCame here for Sunday dinner in a group of 8. How is that possible for such a small place where the wait time can easily exceed an hour, you ask? I'll let you in on a little secret - they take reservations over the phone!\n\nMy friend called a couple days ahead to make the reservation and it was extremely simple. On the day of, they had the table ready for us when we arrived. Some people decided to get their own thing, but a couple of us shared as well. We ordered:\n\nPork belly bao ($8.95) - comes with 3 baos, so it's essentially $3/bao which isn't bad. This was probably my favorite dish out of everything we ordered. The chuck of pork belly is huge and has great flavor. I didn't like the slightly sweet peanut crumble on it though; it was a weird contrast to the savory pork belly\n\nPreserved eggs with sweet potato leaves ($9.99) - this was okay but the portion was a little small for the price\n\nBeef noodle soup spicy ($11.95) - the beef was deliciously tender but I couldn't eat more than a mouthful or two of this as it was a little too spicy for me, especially after I tried to drink the broth. (My spice tolerance is abysmally low)\n\nFried pork chops over rice ($8.95) - pork chops were bland and not as crunchy for a dish that was fried. Wouldn't get this again\n\nSizzling squid with black pepper and mushroom sauce ($14.95) - the squid was good (probably my second favorite dish of the night) but the noodles that came with it were smothered in a strong black pepper sauce. Not a fan of the noodles...\n\nGround pork over rice ($7.95) - not enough ground pork to go with the huge bowl of rice they give you. The ground pork is pretty fatty too. Wouldn't get this", "author": "Dianna H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-14", "description": "The boyfriend chose HoDaLa for a Friday date night, which was definitely a restaurant that's outside of our norm. It was a pleasant surprise for some cheap and yummy Taiwanese comfort food.\n\nThe two of us shared the Mixed Gua Bao ($10.95), which allowed us to sample multiple flavors. We opted for the Taiwanese Pork Belly Gua Bao, Kimchi Pork Belly Gua Bao, and Deep Fried Fish Gua Bao. These steamed buns usually come with pork belly filling, but both pork belly were rather dry here. On the other hand, the deep fried fish was so delicious! The deep fried fish is paired with a slice of waffle fries for a tasty and crunchy combo. I'd highly recommend the deep fried fish for the gua baos and pass on the pork belly options.\n\nIn addition, we also shared the Pork Ribs over Rice ($8.95). Oh my goodness, the marinade smelled amazing as soon as it arrived on our table. Even better, it tasted just as wonderful! The bowl of rice was topped with two huge pieces of pork rib with a bok choy and pickled mustard greens. The flavors from the pork rib was so juicy and savory with the meat just falling off the bone.\n\nThe rice bowls are so cheap and delicious here --must get! Also, note that this place does get pretty crowded during rush hour times. By the time we left at 7pm, there was a line.", "author": "Cindy Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-07", "description": "Try to braised beef rice, the beef is tender full of flavor.\nAlso the bbq squid is BIG!\nService is good, the water and waitress are fast and are patient to answer all of our questions.\nParking is a pain, though.", "author": "Ming D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-13", "description": "Long overdue review. We ordered fried chicken and lu ro fan (pork belly rice). Both were astounding!! Highly recommend this place. \nOld schools toys and candy for sale. Simple but nice decor and friendly authentic Taiwanese staff.\nParking may be hard to find on the weekends, but weekedays is easy.", "author": "Jaime S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-03", "description": "Definitely one of the most nostalgic Taiwanese  place I've been in the states, I don't live in sf or I'll go back a lot", "author": "Viv Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-03", "description": "Great little spot for Taiwanese food & beer in the richmond. Pretty difficult to park in this area, especially during peak meal times. The place itself was not too crowded on a Sunday evening. My group of 6 was able to be seated right away.\n\nThe vibe is casual and the service was quick/efficient. We ordered two types of Taiwanese beer to share. \n\nOf the food items I really liked:\n- Taiwanese beef noodle soup\n- bao (pulled pork was the special that day, and it was excellent)\n- braised pork over rice (the sauce was sooo tasty)\n\nWould definitely return for more!", "author": "Sara S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-06", "description": "Moving up from LA, the one thing I miss the most is solid Taiwanese food. When HoDaLa first open, I had several friends send me links to check it out since I'm always on the hunt. Finally made the trek out to Richmond today to check it out and it definitely did not disappoint. \n\nWe ordered the wonton noodle soup, spicy beef noodle soup, and green onion pancakes. It doesn't exactly meet LA standards, but it definitely comes close. Will definitely be coming back!", "author": "Michelle N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-01", "description": "Every time I meet another Taiwanese person, I feel an immediate kinship from our shared heritage. Inevitably, our conversations always veer toward food, because Taiwanese food is the BEST. I'll most likely ask questions like, when's the last time you visited Taiwan? What's your favorite Taiwanese dish? Where can I get good Taiwanese food in SF? The last question always stumps people, because we just don't have many options, and I can't just Uber to Cupertino on a whim. I can, however, Uber to HoDaLa (what does this name mean tho?) for an authentic taste of Taiwan. \n\nMy friends entrusted me to order for the table, so I picked the gua bao (pork belly bun), niu rou zian bing (beef roll pancake), niu rou mian (braised beef noodle soup), and lu rou fan (ground pork over rice). \n\nThe gua bao came in 3 pieces per order, and the first bite took me back to all my vacations in Taiwan. The crushed peanuts provided a nice crunch to the tender pork belly. \n\nEveryone agreed that the niu rou jian bing was by far the standout. DO NOT SLEEP ON THIS DISH. Despite being close friends, we were all being modest and/or selfless for some reason and nobody touched the last piece for a long time until I commanded W to just eat it. \n\nThe niu rou mian was pretty spicy, which the menu does warn you about. The broth was super flavorful but it was hard for me to drink much of it without chugging water. I'd still eat it again and again. \n\nLu rou fan was what I was most excited for, but I was somewhat disappointed. W and C were nice enough to let me eat most of the egg, but the rest of it was missing something. It's such a classic and might even seem like a poor man's dish, since it's pretty much scraps of pork mixed with rice, pickled veggies and sauce, but I guess it's actually hard to do right. It's the only item I wouldn't order again.\n\nIt would probably be a 5 star place if not for a weird service encounter when C was ordering a drink. He asked if they had boba? Nope, only grass jelly. He said that's fine, he'll have the lychee green tea then. He was confused when the drink didn't come out with grass jelly, but the server accused him of not asking for it. I can see how it wasn't communicated that clearly, but I was pretty amused that he was essentially blaming the customer. This would never happen in Taiwan amirite?", "author": "Karen S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-27", "description": "Fantastic Taiwanese food, and best servers. I also really liked the decor - the owners definitely put a lot of thought in trying to recreate a standard Taiwanese storefront. \n\nAND they serve yam leaves. Which are my fav type of vegetable. Would prefer it without the preserved egg, but it was yummy regardless. Also maybe because we went during grand opening so the braised pork rice cake with a smaller than usual portion of pork. However, the flavor was out of this world and made me reminiscent of Taiwanese food stands. And tomato beef noodle soup was slightly spicy. Just like Taiwan!! \n\nPlus our server was the best. Parking in the Richmond is difficult on a Saturday and he was very conscientious that we were parked illegally (oops, what I do for food, heh) so he asked the kitchen to serve our food faster than normal. \n\nIf only this place was closer to SJ.....", "author": "Annie L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-05", "description": "I loved how you can get on the waitlist for HoDaLa through yelp so there's less time spent waiting in line in the freezing cold :)\n\nMy friend and I came here on a Sunday night around 6 pm. The wait wasn't too bad, only 20 minutes, but we got on the waitlist on yelp so really there was virtually no wait time. Our servers were accommodating and my water cup was never empty! \n\nMy friend got the spicy fried chicken wings and pork bun (both apps), I got the tomato beef noodle soup, and we also split the beef roll. I also got their milk tea with grass jelly that was good, but a bit too milky (not enough tea) and the grass jelly didn't taste super fresh (it was a bit harder than I was used to). The pork buns were amazing, super fatty and tender (!! a must try) and the chicken wings were good but nothing special (according to her). The beef roll had a generous amount of beef which I loved, but I wish there was more cilantro or vegetables inside to balance it out texture wise. The tomato beef noodle soup was yummy but a tad bit too salty/oily for me, and I can handle decently salty food... \n\nOverall I think the food was more of a 3 but because of the great service, super reasonable prices (aka dirt cheap), HUGE PORTIONS (not for apps but wows my soup was huge), and virtually no wait time, I gave the restaurant a 4. If they can make their signature dish, the tomato beef noodle soup a tad bit less greasy/salty I would give them a 4 hands down. \n\nI wouldn't go out of my way to come again but I wouldn't be opposed to going if a friend wanted to check it out!", "author": "Joy K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-03-28", "description": "Ordered the beef noodle soup, been rolls, porkbelly bao, and braised ribs! \n\nFirst off, the service was amazing. Everyone was very friendly and attentive. Nothing bad to say about the customer service.\n\nBut for the food, I've got to say that it's not up to standards. The braised rib appetizer was huge, but I could tell that it was not fresh considering that it was icy cold in the middle, the beef rolls were small and bland as well as the beef noodles. I just wished that everything was more flavorful. Pork belly boas were too fatty, so pass on that too. Don't think I'll come back.", "author": "Shirley G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-19", "description": "Came here on a Sunday night around 9pm with a party of 3. Waited about 20 minutes. *Do not recommend coming with more than 4 people*\n\nOrders: \nStir fried preserved eggs with sweet potato leaves; *recommend to try* slightly sweet veggies with soft eggs \n\nBeef wrap; YUMMMM! Also recommend, but the sauce that goes with it is a bit too salty..\n\nBraised beef noodle soup; This dish was just okay. The noodles were still a bit hard and the soup didn't have as much flavor as I expected. Although the braised beef was super tender.\n\nGrounded pork over rice; my favorite dish the whole night. It was not as saucy as the usual Taiwanese dish, which made it less salty and more enjoyable. \n\nFried chicken over rice; JUICY CHICKEN! and definitely reminds me of the Taiwanese chicken steak you get in the street. \n\nOverall, the food was delicious but a bit on the pricier side for the portion you get. Got to try the bao's next time.. (They ran out ..boo)", "author": "Jenny S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-18", "description": "SF doesnt have many Taiwanese restaurants so i was super excited to see this place open up! The decor is really cute and reminds me of Taiwan. They have some unique dishes and traditional dishes like fried chicken cutlet and lu rou fan. What stood out to me was the black pepper noodles and GRILLED SQUID! omg that was super delicious! I would go back just for that dish. Their chicken was mediocre, it was a bit dry and thin.  For dessert, we had the grass jelly and balls ice dessert and it was pretty good! I wish theyd add mee sua and oyster pancakes in the future.", "author": "Emi K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-12", "description": "It's my first time here and I loved the food. I would recommend the gua bao and Taiwanese beef noodles! It's very authentic with the spices and sauces. If you want both dinner and dessert, I would highly recommend this place.", "author": "Lauren N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-05", "description": "This is a fairly new Taiwanese restaurant that opened up in central Richmond. Parking is limited and the place is pretty small, so be prepared for a wait if coming in at mealtimes. They are still in their soft opening so I won't really speak to their service. \n\nOur table got the BBQ pork baos and a few of the bowls. I tried the braised beef noodle soup; it was hearty, flavorful, and a good portion size. \n\nPrices are very fair, especially since it's in SF, and the menu is pretty varied despite the newness of the place. Would recommend coming here if you're craving beef noodle soup!", "author": "RachEl L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-29", "description": "Very solid Taiwanese joint. I love Taiwanese food and have pretty high standards for it, and haven't really found any legit Taiwanese in SF yet.\n\nFirst thought when walking in - I don't love the decor. There's a big display in the middle of the floor piled with Taiwanese/Chinese snacks for sale, which is great for nostalgia value, but takes up tons of space that could be used for... like 3-4 more tables, in a restaurant that doesn't have much seating to begin with.\n\nI wanted to hit all the Taiwanese classics to see how well the kitchen executes the basics. The pork belly gua bao was pretty faithful to the version you'd find in Taipei, though a bit inconsistent - the first bao I ate was filled with a perfectly braised, luscious and unctuous slice of pork belly. The next was disappointingly chewy and stringy.\n\nBeef noodle soup - maybe the single most championed Taiwanese dish (yet not truly Taiwanese... but that's a discussion for another time). Other reviewers have said the broth was too salty. I didn't find it overly salty, but I did find it hard to detect any other flavor besides the salt. There was an occasional hint of the quintessential Taiwanese beef noodle spices, like star anise and chiles - but it was so faint as to be almost a hallucination.\n\nThe fried chicken rice was definitely the highlight - tender but crisp chicken thigh coated in exactly the right mix of spices that I hoped for. Definitely hoping to try the pork chop rice next time.\n\nIn the future, I'm hoping they add some more seafood-focused Taiwanese favorites to the menu - namely, 蚵仔煎 and 蚵仔米线. Overall, this is probably a top 3 Taiwanese restaurant in SF - looking forward to coming back and trying more of the menu.", "author": "Andrew W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-02-25", "description": "Date & Time:  Sunday February 25, 2018 @ 1:30pm\nLunch Date:  The Husband\nScene:  This is Us:  Husband in Barbour Jacket, Dents Driving Gloves, Zara Shirt, Acne Wall Street Pants, Crocket & Jones Fetbury Shoes.  Wife in Acne Studios Moto Jacket, Bella Freud Sweater Dress, White+Warren Scarf & Gloves, Stuart Weitzman Over-the-Knee Suede Boots & Mini Chanel Cross-Shoulder Flap Bag\nMusic:  Taiwan Girl Pop\nDecor:  Fun & Whimsical.  Candy Stand, Videos on Projector Screen & Theatre Chairs \nService:  Adorable, Sweet, Attentive Guy Similar to Leading Man in K-Drama\nImbibe:  Grass Jelly Milk Tea\nDevour:  Pork Belly Baos, Meat Sticks, Preserved Egg w/ Sweet Potato Leaves, Shrimp Noodles & Pork Rib over Rice\nTotal:  $45.38", "author": "Genevieve Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-18", "description": "I'm from Taiwan and I've been here 3 times. The taste of dishes are similar to my hometown. That's why I took many of my friends who are from different countries there to taste Taiwanes food, and they really enjoyed the food. The dishes that I recommend are braised beef noodle soup, fried chicken over rice, pork belly over rice, Gua Bao and beef wrap.", "author": "珮瑜"}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-07", "description": "You know they did something right when the Taiwanese chica I was with couldn't stop grinning at all the details of HoDaLa.  The signs, the candy, the music, the chairs brought her back to when she was a girl.  \n\nFood: smallish portions but authentic. Recommend the pork belly over rice and the bee pancakes.\n\nThe service: attentive and quick. Reminded me of Asia and their attentive service. Sometimes asian places can be lacking here. \n\nThe ambience: causal drinking place with elements of Taiwan. Only have beer and wine.\n\nRecommend coming here for lunch walking to grab boba across the street.", "author": "PJ T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-10", "description": "Value = 5 stars. Came in hungry, really hungry and ordered a rice bowl with ribs. The serving was gargantuan AND delicious! Amazing! I ate way too much (left the restaurant super full) AND had leftovers for lunch the next day and I was again, really full. \n\nThe flavors are subtle, the food fresh and tasty. The taro milk tea with boba was great and the pork belly was very tasty (my friend also had left overs). Next time, we agreed, we'd share a rice bowl. \n\nGood neighborhood feel, friendly server, fast service, large portions, yummy food. I have nothing to complain about here!", "author": "Thalia F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-01", "description": "This is my fourth time here :) super yummy and authentic Taiwanese food. My usual favorite is the beef noodle soup, which is really well done!! Soup is great, beef is not tough, very flavorful, and the noodles are good. \n\nToday we had the fried chicken over rice and were so pleasantly surprised! The batter wasn't too thick, and still added a great dimension to the already delicious chicken (not dry at all), also came with a little minced pork, which was a nice touch. \n\nI think I'd definitely be excited to see tofu pudding on the menu next!!  \n\nThanks HoDaLa for being here", "author": "Elise G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-15", "description": "I LOVE this place ! The gua bao is delicious and beautifully presented, the shaved ice is delicious and all the other dishes are outstanding as well. But, as delicious as the food is, the truly outstanding part about this restaurant is the amazing service! They're so kind and friendly and go above and beyond. Definitely try this place out!", "author": "Mimi W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-01", "description": "Yay! They have a more comprehensive dessert offering with shaved ice! I've already raved about their beef noodle soup which is sizable and flavorful.  they also have four types of beef noodle soup.  their cabbage cheese is garlicy and cheesy and almost like a healthy replacement for garlic fries. Service is always great so friendly and I am excited to try their newer noodle options and sizzling plates.", "author": "Lydia Z."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-06-26", "description": "Decent Taiwanese food, but there are better in this area (i.e. House of Pancakes and Taste of Formosa). \n\nFor the fried pork chop over rice dish - a Taiwanese staple, the pork was fried well, but seasoning had a lot of room for improvement. \n\nHoDaLa's beef pancake -- my absolute favorite food in the world, was a good effort, but missed the mark for me. While the beef pancake here is filled to the brim with meat, it definitely lacks the balance of a good beef pancake (i.e. needs more hoisin and cilantro).\n\nThe only dish that I thought was done well at HoDaLa was the beef noodle soup: definitely as good as a bowl you'd find in Taiwan. Restaurants will frequently overcook beef till it's fall of the bone tender, but that's actually not authentic to Taiwnese beef noodle soup. The best beef noodle soups will cook the beef just enough that you still are able to get the texture of the beef with every bite.\n\nI'd give HoDoLa another shot in the future, but if you could only choose one Taiwanese place to try out during your visit in SF, I'd look elsewhere.", "author": "Austin W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-23", "description": "A few of us came here for a Girls get together on a Friday night. Luckily we had reservations because there was 6 of us and this place is pretty small. They have the Tablet check in which makes things easy and keeps the line under control. \n\nWe started off with a few appetizers for the table. Pork Belly Bao, Corn with Cheese, Fried Spicy Chicken Wings, Sweet Potato leaves with Preserved Egg and a Beef Roll.\n\nFor main dishes, we each got our own rice bowls. I ended up with the ground pork over rice. The pork came with an egg and some preserved vegetables. The pork had good flavor and the egg was good. The preserved vegetables were quite salty but edible. The portion is pretty large for one person, so I had left overs. \n\nThe best thing I had was definitely the Pork Belly Bao. The corn and chicken wings were average and the Sweet Potato Leaves with Preserved Egg were way too salty.", "author": "Tiff C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-21", "description": "I absolutely loved this restaurant. It was very hyped up for me and it definitely lived up to the hype, and this is coming from a Taiwanese girl who's from 626. The restaurant decor is very throwback with a ton of good ol Taiwanese candy, snacks and posters. \n\nI went so ham and ordered 6 things for 3 people. \nStir Fried Preserved Egg with Sweet Potato Leaves - Sweet potato leaves is such a Taiwanese staple vegetable, the preserved egg went really well with it, I'm definitely going to steal this recipe. \nPork Belly Gua Bao - The flavor is on point and the bao was fluffy, delicious and with a sweet aftertaste. The sauce went really well with the peanut crumbs. The pork belly was cooked really well, it was juicy and meaty. \nGrounded Pork over Rice - Another traditional dish that was done very well. The ground pork was juicy and flavorful, it had a mixture of ground mushrooms in it as well so the texture was great. It had enough sauce to make the rice really tasty. It also came with some sour cabbage (my favorite), marinated egg and also pickled radish for garnish and taste. \nFried Pork Chop over Rice - I love how thin the breading of the pork chop was, and how juicy the meat was. The sauce was on point but it made the fried pork chop a bit soggy in the end. Overall was still a great entree especially with the bamboo shoots on the side. \nSizzling Beef with Black Pepper and Mushroom Sauce - The flavor of this dish was on point! Just like the ones you'd get in a night market. The steak was too tough imo and the noodle was overcooked. I'd skip this dish next time.\n\nMy favorite of the meal was the TOMATO BEEF NOODLE SOUP, I was obsessed. It reminded me of my childhood, and I had always been on a search for tomato based bns. This place has done a perfect job, and it had a really nice kick to the broth as well. The beef was also a perfect balance of tendon and meat. \n\nI'd have to come back here again if I'm ever visiting sf!! The service was also friendly and attentive.", "author": "Jamie Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-22", "description": "Probably the favorite spot in our neighborhood. This location used to be in flux but seems to be settled in with this little hot spot. \n\nAlways digging the gua bao options as well as the decent fried rice or pork over rice or noodle options. Helps that's they have awesome happy hour options and pricing. \n\nI'm always partial to the boba and shaved ice options they have for dessert. For now they have very decent happy hour pricing on buy one get one beer sake and other options. \n\nIt is a smaller spot so please use the yelp system or call ahead to gauge availability. Definitely reccomend to friends and neighborhood lackeys.", "author": "Brad L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-24", "description": "My favorite place to go to with my friends! I tried their fried chicken over rice, fried pork chops over rice, and pork belly over rice and they were all great! I would love to try their shaved ice in the future!", "author": "Elaine G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-07", "description": "Coming into here, I didn't know what to expect. I ordered the beef noodle soup and the Taiwanese soda. \n\nThe noodles were a perfect balance of spicy and quantity. I would have liked a little more veggies, but overall great taste. And the beef was cooked well \n\nThe Taiwanese  soda I bought was there root beer. Similar to a Pepsi, but full of flavor!", "author": "Jose O."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-07-18", "description": "Interesting environment, but unfortunately, this restaurant serves a lot of deep fried food causing strong oil scent throughout the whole place. They have the front door opened at all time, but the smell is still overwhelming that my clothes & purse carried the smell home. \nAlso, the beef noodle soup i ordered came with a couple pieces of bak choy and the veggies was really bad. They served me the ones that are supposed not for serving customers. Please see the image of the veggies I posted.", "author": "Kristin C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-21", "description": "It's cute and clean and good vibe for a hangout place. The matcha drink is fantastic.", "author": "Caili C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-20", "description": "I wanted to try this place out since it opened, my friend and I came to try this place out.  She ordered the beef over rice and I ordered the fried chicken over rice. She got 5 pieces of the beef in a big bowl with rice. Mine on the other hand had big pieces of chicken and it was breaded, the breading came off and it was spicy somewhat. We had the tea with boba, my friend had peach tea and I had the mango green tea. The teas were better than the food we ordered. \n\nI hardly give one star reviews, but the service was lacking. My friend had to get up to get someone to bring the check.  When the girl took our order it looked like she was writing it on her hand.  I am not coming back, I don't get the hype about this place, it had good reviews that is why I wanted to try this place.", "author": "Alix J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-20", "description": "I liked the spicy,  braised noodle soup. The broth was flavorful and not too oily or fatty tasting and had the right amount of spice. \n\nI would definitely like to have the stinky tofu on the menu as its the perfect snack to share with friends and family. \n\nOverall,  great food and nice atmosphere.", "author": "Albert C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-19", "description": "We originally joined the waitlist thinking there was a line but when we arrived we got seated right away. We ordered three baos: fried chicken bao, pulled pork bao, and the Taiwanese pork bao and a grounded pork over rice. The meat in all were a tiny bit dry and fatty but it was okay. The restaurant itself has a mini Asian snack market and the staff is pretty friendly here. Over would come back and try some desserts!!", "author": "Nicole W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-09", "description": "Pretty Chill spot, interior is cool. Food choices abundant and pricey. I feel like I need to have a super hard workout to go here. Food is hella filling and fattening. I'm not ready to go anytime soon. Gotta lose these lbs", "author": "Jray M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-10-07", "description": "Three stars feels about right. The food, while cheap, was low quality - the rice dishes were mostly just rice, the noodle mostly noodles. Unfortunately we were seated at a bar facing a wood wall; the reason you never see a bar like this is everyone's conversation bounces off said wall, meaning you may hear the conversation of the people next to you a lot louder than those of your dining companion. Taiwan is a foodie paradise, but this middling spot doesn't do it justice.", "author": "Nick C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-04-25", "description": "Decent Taiwanese food with generous portions! Although the service is quite slow and slightly unorganized. My friends and I waited for over an hour when there were less than 3 groups before us. The place is quite small with bar seating that's used solely for waiting - which I thought was sort of a waste since my group sat there for half an hour.. totally could've ate there.\n\nVerdict: Worth a try but not sure if I'd go out of my way to come back.", "author": "Mandy H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-10-27", "description": "The food here is so bad. We ordered the sizzling plate and it was so SALTY. The beef noodles were average and I seriously don't see how this place can get such a high rating... oh wait... they give free ice cream if a good rating is given on Yelp. This is unethical and be warned. Food is crap here.", "author": "Jason K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-26", "description": "Excellent Taiwanese food! The gua boa is delicious and the fried chicken quite tasty. \n\nThe toppings on the shaved ice are not quite as chewy as you'd find at Meet Fresh, but have more flavor. \n\nAll in all a solid place. The Bay Area needs more food Taiwanese places like this!", "author": "Ben B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-13", "description": "I wanted to like this place because it sounded unique. Service was quite slow. Really wanted to like the baos but they were falling apart and flavor wasn't as powerful as it should've been. Don't get the fried fish bao, just taste like fish fillet for kids. Pork belly and ribs could've been more tender. Definitely don't get the mifun bowl but kiddo wanted something \"plain\"... wonton bowl only had 5 wontons  the sizzling pans were probably the best but you're looking to pay $16-18", "author": "Cathrin P C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-10", "description": "This place is on the corner of Geary St. and on the outside it looks like a Taiwanese convenience store. Interesting décor gives the diner the impression that they are walking into a old style Taiwanese store.\nThe restaurant serves up traditional Taiwanese dishes, I had the sizzling beef plate which is beef stew meat served with spicy noodles and a egg served sunny side up.- $14.99\nI got a IPA beer - $6.00 which was nice and very cold.\nFood is pretty good here and the service is also very good.\nI would recommend for Taiwanese cuisine lovers.", "author": "Dirk D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-13", "description": "I am from Taiwan, all of the dishes are so good and very authentic. recommend whoever wants to try Taiwanese food come here!", "author": "Kuan-Hsuan L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-31", "description": "Came here with my boyfriend on a Saturday night, and boy were they packed with a line. Little known secret is to make a reservation, as those are first come first served and they have a limited amount they put aside for it. My boyfriend took nearly 45 minutes to find parking, so obviously take public transportation or rideshare to avoid such a waste of time. Luckily, he dropped me off to be seated first and I put in the order while waiting. The space is super small inside, but definitely gave me the Taiwanese restaurant vibe. I think it' mostly due to the decor of the space with candy and other goodies sold at the front and the seating behind the snacks. I started with a peach green tea, since boba tea originated in Taiwan. A bit disappointed that there wasn't boba with the drink. It was a little on the sweeter end versus tasting the actual tea, but it was okay. \n\nStarters:\n- Baked Cheese Corn: this plate came out a lot larger than I expected, but it was good! Cheese was good and the corn was sweet. I would definitely reorder when I return.\n- Beef Wrap: Gave this a try, but was disappointed. The wrap was very dry as a whole and the pieces fell apart so easily that it was not easy to eat. Flavor was also lacking in the wrap, and the meat had a bit of flavor but was super dry. \n\nMain Course:\n- Braised Beef Noodle Soup (spicy): The bowl was fairly large, and had a good kick of spice to it that I could handle. It wasn't overpowering so that you could taste the flavor of the rest of the dish, but a perfect amount for me to taste all the flavors. Noodles were a great texture and perfect firmness and the meat fell apart easily as it should for this dish.\n- Sizzling Whole Squid with Peppered and Mushroom Sauce: Originally I didn't want this because I don't like mushrooms, but the mushroom was just in the sauce and not all over the dish so I could deal. The peppery flavor was very apparent in the noodles and the fried squid was huge! Super flavorful and I couldn't finish the dish - had to take it home and it still was two more meals for me after that from this one dish.\n\nOverall, it was around $50 something to try all those dishes. I want to return to try the baos, but definitely filling entrees and portions.", "author": "Amanda C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-14", "description": "Man, HoDaLa hit the spot. But I'll wait a sec before going back.\n\nAs far as Taiwanese food goes, there aren't too many options in the city. HoDaLa isn't super exceptional or worth waiting in a long line for, but once the hype dies down (fingers crossed!) I plan to come back to get my ground pork over rice fix. They do the dish well and I was impressed with the quantity. The pork buns were dope too. Prices are very fair.\n\nI didn't love the scallion pancakes though. Too small and not crispy enough. Pass.\n\nThe space itself is interesting. They have repurposed movie theatre seats and an awkward high table in the center where people can wait for an actual table. They also projected Jay Chou music videos the entire time.\n\nSince it's a \"hot and new\" restaurant right now, there's a lot of buzz. We waited around 30 minutes on a Saturday evening, which wasn't terrible, but by the time we left the restaurant was overrun with people waiting.\n\nP.S. If you're looking for Taiwanese food in the East Bay, I really like Taiwan Bento in Oakland, which takes a healthier spin on traditional Taiwanese dishes.", "author": "Valerie L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-25", "description": "5 stars not because it's perfect (it is not) but because it's already the most authentic Taiwanese small-eats shop in SF. For that alone, I want them to stay in business.\n\nPluses:\n-The tomato beef noodle soup had the most authentic broth of any Taiwanese beef noodle in SF. It's casual karaoke/bubble tea 簡餐 quality, not Michelin noodle master quality, but still, it's the only truly authentic broth in town. The noodles though are store-brand and kinda blah.\n\n-The fried chicken dishes were all very succulent and juicy and good! I'd recommend the fried chicken on rice.\n\n-The decor is kinda cute!\n\nMinuses:\n-Hire +1 waiter please, even if it means raising each entree's price by a dollar. You're overworking the 1 waiter you have.\n\n-I like Wu Yue Tian/Mayday alright, but my god the music is too dang loud. You'll drive away all the adult customers like this, leaving only study abroad college students...", "author": "Ken H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-05-20", "description": "Pros\nPork belly bun and onion pancake were really good.\n\nCons\nAll the main dishes were subpar \nThe old theater chairs were EXTREMELY uncomfortable, and the springs in the seats would make you sway left and right constantly. \n\nConclusion \nThe place is only OK, only popular because of the hype IMO", "author": "Kenneth C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-11", "description": "We had their mixed buns with pork and fish,  spicy braised beef noodle soup and spicy chicken wings.  They were all very good, just like the food in Taipei night markets I remembered.  \n\nI also liked their plum juce and the taro balls shaved ice.  So delicious!", "author": "TY H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-03-10", "description": "First time here, was very excited about a Taiwanese restaurant came in sf. \n\nSoft Opening review:\nService was fast and very nice and friendly \n\nEnvironment, reminds me of taiwan, fun and cute \n\nFood: \nBeef noodle soup, under cook noodle, over cooked beef, soup is more on the salty side \n\nPan cake, under cook very sticky \n\nChicken Steak over rice, ok but more on the salty side \n\nPork rice, was ok out of all four items\n\nReview will update on their official grand opening. \n\n\nHope food quality will improve soon!", "author": "Mack A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-25", "description": "Finally another taiwanese restaurant in SF. We have been going to Taste of Formosa for years and really glad to see HDL as another option. HDL's food is really authentic, killer shaved ice and big plus for the fruit flavored beer. Only downside is the parking, that's why we always come here on week days during lunch.", "author": "William C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-04", "description": "Reservations are suggested. Busy during dinner. Order the ground pork over rice, which was perfect in every way. It has the flavor that makes you think of grandma or mom making you the most deliciously braised pork in special soy sauce flavored sauce over soft, fluffy white rice and a delicious tea egg on the side ($9). The pork buns were amazing. I love the savory flavor of the braised pork with a light brushing of peanut glaze on it. My friends thought the theater style seats were a bit awkward. The green onion pancakes were also delish and unique. Moist pancakes with a sweet soy sauce/garlic blended dipping sauce. \n\nNo waiting area so it's a bit awkward to stand around bunched up by the entrance. But there seems to be a good turn around of the tables. I'm looking forward to trying their other items on a future visit!", "author": "Thomas L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-04-07", "description": "No wait time on a Wednesday afternoon as there was only one other customer. Parking is a pain in this area, even in the afternoon so we circled around a bit before we found a spot. \n\nMy friend and I ordered 4 items: the braised beef noodle soup (spicy), pork belly baos, short rib rice and the braised beef rice. \n\nThe food was okay, but nothing blew me away nor made me feel like I was back in Taiwan. The noodle soup dish was oily. The bao was okay, but a bit dry, as well as the short rib. The best dish I ordered was the braised beef rice. There was a bit of a long wait time for the food to be ready. It took over twenty minutes despite us being the second table there. Service was okay, but hopefully things get better.", "author": "Christina G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-03", "description": "I'd give it a 4.7 rating if I could. The only downfalls were the parking (which I understand is a challenge in the City but only more recently understand better now that I don't live in Daly City) and the service was a little slow because there were only a handful of servers. \n\nOtherwise, the service was still very friendly! We went for dinner around 7ish, without reservations and only waited somewhere b/t 5-10 minutes with 2-3 parties before us. \nIt's a small restaurant and the windows are all fogged up which reminded us of the \"love scene\" in Titanic (I was tempted to wipe my hand down the window just as Rose had, haha!) \n\nAnyway, we were seated quickly... then, it took a few minutes (probably about 5) for someone to come bring us a menu. \n\nThen, less than 5-minutes later, someone came to take our drink orders and answered a few questions for us. \nWe asked for suggestions and they suggested the spicy beef soup, sweet potato leaf, and pork belly bao. We ordered all three dishes and were NOT disappointed. \n\nEverything was delicious! We shared everything and were stuffed, but still ordered dessert-- fried bao with taro ice cream. When that came out, there were sprinkles on the ice cream which I didn't care for, but then quickly learned that they don't taste like anything (they're just not my preference on ice cream is all... I know it's just sugar). The dessert was amazing. Something so simple was so tasty. It reminded me of firecakes (ice cream filled donut bars) in Chicago, IL! Haha.  \n\nNow, we were even more stuffed but we were happy we tried out this new spot. We were overall pleased. \n\nThen, it took longer than 5-minutes just to get our bill. But once we made eye-contact because all the workers were super busy. So, we understand...\n\nAgain, those were the only 2 's-- parking and waiting for the menu, then waiting for our check. \n\nOtherwise, the workers were great especially the young man (only man at least on that shift) who was super helpful, cheerful, and busting his butt!", "author": "Roxane P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-03", "description": "What's crazy is, I've wanted to try this place for a while now, and finally, after spending a week in Taiwan and earring some authentic Taiwanese food, I was able to try HoDaLa just a couple days ago. And man, this place was so legit!!!!\n\n\nReminded me a lot of the beef noodle soup I had in Taipei and Taichung. The broth here was on point, very hot , spicy, and lots of flavors. What surprised me the most was the noodles. Tasted like they made it in house and was very fresh. I loved it!!!! Then the beef, was nice and tender. Simy amazing. The Resturant itself had a lot of cool stuff that would remind you of Taiwan ( candy, snacks, Taiwanese beer). \n\nOnly weird thing is those auditorium seats they have. Very uncomfortable and tacky. They were weird, looked ugly, and uncomfortable when you sit on them. One thing I would suggest is to replace those chairs.\n\nI have still not tried their baos aka buns, but I will try that next time. Deff coming again. Great job opening this in the city! We need more of these.\n\n\nI did come here on a Tuesday night, and it was relatively empty so it was easy to get a seat. Service was decent. Don't know how this place is on a weekend so I am giving it a 4 star for now.", "author": "Nicholas k."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-05", "description": "Authentic Taiwan Food! We get the pork bun and pork over rice. All good quality and taste!", "author": "Ziyu Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-30", "description": "Gua bao was on point.\n\nThe Fried Popcorn Chicken makes you feel like you're in the Taiwan night market.\n\nPrices are amazing!\n\nThe vibe is definitely very authentic for young Taiwanese folks. They play project Taiwanese music videos on the all's. They've got Taiwanese candies at the front desk that's reminiscent of childhood. \n\nI love this place. Will definitely come back and bring my friends. \n\nGreat for a chill, low-key, delicious meal.", "author": "Chloe S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-07", "description": "The food here is super authentic. I feel like I'm back in Taipei at a night market. We tried their shaved ice, fried Bao, fried pork chop rice and Mi-Fun soup. Everything was delicious! I highly recommend coming with friends on a Friday night!", "author": "Michelle C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-17", "description": "18.02.17.  Soft Opening.   \n                  Raw review rating not final\n\nFood --- 3 1/2 to possible 4 \nService - 5\nSetting - Interesting, industrial, \n                W a little steampunk looking stools\n\nBeef wrapped in scallion pancake (special)\n   Pretty good\n   A little on the small side\n   Low grease ... Barely ... See pic\n   Soy garlic dipping sauce\n\nSizzling Beef w black pepper & mushroom sauce\n   Limited", "author": "S.K. Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-04-04", "description": "The food is good, but nothing out of this world. We got the braised beef noodle soup and the ground pork over rice. The soup was good, but I've definitely had better. Ground pork over rice was good, probably better than the soup in my opinion. I'd like to return to try their baos; however, my main gripe about this restaurant is the WAIT TIME. We were seated promptly upon arrival and were told by one of the waiters that there is a small wait time because they were still relatively new. I figured, sure, how bad could it be? 20mins? Yeah, no.. it took about an hour for our food to arrive, which arrived separately; we finished the noodle soup right before we were served our rice bowl. \n\nWould not return because of the wait time. They really need to iron out the kinks in the kitchen and be more efficient!", "author": "Leslie C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-06", "description": "Went to this place on a Sunday afternoon. They have a online waitlist timer and sign in which is amazing. For two people we waited for 10 minutes, parking was a bit difficult but that's just San Francisco. \nI got seated on the top table which is also very cool. The environment theme is set back to the old times around the 1990s? In Taiwan. I love the mood and environmental.\n\nThe food takes a bit of time to get here but I feel like is worth the wait.\n\nWe had grassjelly milk tea (half sweet and half ice) it's delicious and very milky.\n\nPork belly bun (3) small buns but it has big flavor. The pork belly melts in your mouth and the flavor soaked with the soft bun is such a good combo \n\nBraised pork belly over rice - huge piece of meat on top of the rice, with the meat sauce the rice just taste delicious \n\nBraised beef noodle soup (spicy) - this come in such a big bowl. The broth is very heavy and not oily flavored. I love beef noodle soup and every time I go to any Asian restaurant I always try they beef noodle, this place got the flavor down!!\n\nMy favorite is still the pork belly bun tho, such small bun packed with so much flavor.\n\nDefinitely will come back for more .", "author": "Sandy C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-14", "description": "HoDaLa is a casual dining option for Taiwanese food.\n\nI'm a sucker for details and decor.\n\nJars of old school candy and tea eggs set at the entrance added to the retro feeling of the restaurant.\n\nC-pop music videos from the past 10 years with the likes of JJ Lin and Jay Chou are projected onto the wall behind me. Nostalgia...*~* \n\nService was great; the servers were friendly, attentive, and quick. \n\nWe ordered 2 drinks: lemon black tea with lemon jelly, and grass jelly milk tea. Both drinks were refreshing, and not too sweet. \n\nFor food, we ordered the pork belly bao, braised beef noodle soup, and fried chicken over rice. The pork belly bao was my favorite! The flavored pork belly and preserved vegetable between steamed buns was a perfect combination.\n\nOverall, the food was good with just the right flavors, but not particularly outstanding in quality. \n\nHoDaLa is currently in its soft opening stage, so there's potential. I would return to try other items on the menu including the minced pork over rice, beef rolls, and corn cheese.", "author": "Jennifer X."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-01", "description": "Came here with some friends and we all enjoyed the bao's offered here. Pricey but worth a try as it was delicious. We tried all of em.\n\nTomato noodle soup: I would never get this. There was a flavor too distinct and too strong to even swallow. It was hard to eat.\n\nFried Pork Chop over Rice: This dish was pretty good! Nothing extraordinary but flavorful, and a good crunch.", "author": "Johnny F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-20", "description": "The pork belly buns and preserved eggs with vegetables were absolutely delicious. I would come back here again for these dishes. The custard piggy baos were cute and good. They were the perfect portion between bun and custard.", "author": "Shirley L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-23", "description": "This is a nice Taiwanese restaurant for a small group between 2-4 people if you want small tapas to share. The servers are attentive and the food/drinks are decent.\n\nOne thing I always get at Taiwanese places are honey sausages and boba. Unfortunately, this place does not serve any of those classic Taiwanese items. They listed bubble milk tea on their menu but do not serve any pearls- like most authentic Taiwanese restaurants do. I tried both the Taro Milk Tea and Matcha Milk Tea. Personally, I would get the Taro Milk Tea again because it has a strong Taro taste and is nothing compared to those powder milk drinks. The Matcha Milk Tea, on the other-hand, tasted like matcha drowned in milk (not good).\n\nIn terms of food, I ordered their popular items: pork belly buns, beef rolls, braised beef noodle soup, and ground pork over rice. Although they have a lot of tapa choices, the food here is only okay. Food lacks a bit of flavor but definitely could be improved upon. Overall, I would give this place another try if I am in the area and feeling for some Taiwanese tapas.", "author": "Monica C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-12", "description": "Goodness gracious. Where do I start?\n\nMy friend and I were just coming from a nearby music festival, and needed to find a restaurant quickly to rest our tired feet, and tame our hungry stomachs. Call it fate, call it destiny, call it what you want, but somehow we found ourselves upon HoDaLa. \n\nThe moment we walked in, we were immediately greeted with a relaxed ambience, decorative ornaments and lights, and friendly staff. \n\nThe food was served quickly but do not be alarmed because the flavor was breathtaking. Hearty portions accompanied with authentic Taiwanese cuisine made this stay worth its while. My personal favorite dish was the shrimp wonton noodles. \n\nI will definitely be recommending this restaurant to friends.", "author": "Vincent B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-19", "description": "HoDaLa means \"bottoms up\" in Taiwanese (that's what they said!). How often in the Bay do you come across a Taiwanese restaurant that's not named in Chinese?!\n\nI'm always on the hunt for good Taiwanese food, and the food here was great - better than I expected, but not amazing either.\n\nService was not as great, but the staff was super nice and humble. We came around 7:30pm on a Sunday and waited 30 min for a seat.\n\nWe ordered...:\n\nTomato Beef Noodle Soup: It seems generally uncommon to find this dish in the Bay so I was excited when I saw that they have this one! The broth tasted nice and flavorful with a subtle kick of spiciness. Meat was nice and tender with no fat. The only thing we didn't like were the noodles, they didn't seem cooked all the way. They also seemed to skimp a little on the veggies.\n\nPork Belly Gua Bao: The bao came out cold and the pork belly had a lot of fat on it. Otherwise the flavor was decent, especially the sweet peanut shavings. Looking around, a lot of parties ordered this.\n\nBlack Pepper Steak Noodle: One of the better versions I've had of this in the Bay. The pepper, garlic pieces, and noodles made for a good combination. However the meat was slightly tough and flavor-wise tasted slightly off, but we couldn't tell why.\n\nPrice-wise, the dishes seemed expensive than other Taiwanese places, however this *IS* SF so the prices were relatively reasonable.\n\nParking was a little challenging, but we parked 2 blocks away.", "author": "Scott C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-31", "description": "Best Taiwanese food ever had in the Bay Area and service is really good too. \n\nThe restaurant is quite Taiwanese style with all kinds of old style candies and drinks in the front which creates a lot of childhood memories. And interior design is quite vintage. \n\nMy husband and I ordered pork bun, meat lover sizzling plate, pork over rice and yam leaf. 3 dishes into the order, the waiter kindly reminded us \"these are usually enough for 2 people\" but we ordered the 4th dish anyway, cuz they all look really good and we love Taiwanese food. \n\nPork bun was the best I ever had and the noodle in meat lover sizzling plate was just sooo good. Also the milk tea was better than a lot of boba tea places.\n\nThe only problem was they only have two service persons and have to do call people, order food, bring food, check and clean table so it can be a bit delay occasionally. But they were both quite patient and nice which was great. \n\nOverall it was great experience. Will come back and try other stuff again.", "author": "Gemma C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-21", "description": "Saw this place on yelp after eating lunch and had to try out the desserts! Grass jelly shaved ice is a favorite and it would be super cool to see shaved snow getting added to the menu! There's also lots of Asian candies, snacks and trinkets around that you can buy.", "author": "Maggie L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-06-03", "description": "SF does not have many Taiwanese options--I can count on one hand. When this place opened, I was thrilled and didn't mind the 30 min wait to try some beef noodle soup, stinky tofu, braised pork rice. Unfortunately, it was soft opening and they didn't have a lot of menu options. No stinky tofu. But we did try the beef noodle soup, pork buns (gua bao), meat stick, and teppan. I give a three star because everything was just mediocre. I think my experience at the Taiwan cafe was better and many S Bay taiwanese cuisines serve much better and more authentic food. The beef noodle soup lacks flavor and so does everything else. I didn't think the flavor is there. The presentation is good and the store is decorated to be a reminiscence of the good old times but the food look better than they taste :(", "author": "Sharon H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-31", "description": "Came here for the first time and omg everything was so good! I ordered the braised beef noodle soup, beef roll, and pork belly over rice! Soooo delicious will definitely come back next time I'm in SF", "author": "Kristen W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-09", "description": "-Late review-\n\nI was on the road to after picking up the lady from work, in hopes to find a nice spot for dinner. Driving down Geary, I noticed a bright and new sign I did not recognize... I was like \"Ho... What... Ho Da La??\"\n\nFast forward 5 minutes of debating and finding a parking spot across the street, we decided to go in because I read \"Taiwanese\" and that pretty much sold me. The City seriously lacks some good Taiwanese food. \n\nService:\nWe came in during soft opening and the service was honestly phenomenal. The server was very helpful in explaining the menu and giving us a plethora of options. He was also very attentive and made sure we were enjoying our evening. Afterwards, he even let us Venmo the restaurant account because their credit card machines were not up yet. \n\nFood: \nYES. Finally! A spot that actually has some awesome Taiwanese food! I was hoping I was not buying into some weird... fusiony... Asian food... but surprisingly found a nice medium between hole-in-the-wall and boujie. They served flavors I recognized when I ordered their gua bao (pork belly buns), nu rou mian (beef noodles), and lu rou fan (braised meat rice) with portions that was just enough to make me feel like the price was worth it. Would I change anything about that? Definitely not. I had a great meal for a solid price point (at least in the City). \n\nInterior/Ambiance:\nIt's a bit on the darker side in the restaurant and they were playing Taiwanese favorites like Jay Chou. I believe they are also meant to be like a mini-bar and they have games and stuff too. Pretty chill atmosphere. \n\nSummary:\nIf you like Taiwanese food and looking for a spot to kick it for a solid dinner/drink. Check the place out!", "author": "Tyler D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-09", "description": "Excellent food! Catered to my kids peanut and egg allergies. Great presentation and tasty food. Friendly and accommodating service. We had the pork belly buns and they removed the peanuts. The braised beef over rice and pork over rice, chicken over rice were all really good!", "author": "Cynthia C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-11", "description": "Came straight here after Outside Lands and I have no regrets! They have a BOGO deal for pitchers of Sapporo, sangria or hot sake for $16.99. We got two pitchers of sangria, which was perfect for 5 of us. I really enjoyed the braised beef noodle soup and passion fruit green tea. In fact, we wish they offered a larger size of the braised beef noodle soup on their menu! Will definitely be back to try their other drinks and their baos.", "author": "Trisha V."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-07-08", "description": "The pork belly over rice has a great portion of meat, compared to the little meat for the ground pork over rice.\n\nI like the service though.", "author": "A L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-07", "description": "Rich authentic Taiwanese food. \nGood taste, very heart warming interior. \nAnd come get their shaved ice!!!!!", "author": "Sean N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-04", "description": "Cute dining place with tasty Taiwanese food. Chicken cutlet or fried chicken over rice is highly recommended. Good for friends hanging out and get some small bites.", "author": "Venice M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-05-28", "description": "Stopped in for lunch on the suggestion of a friend. Small place, interesting island of snacks/candy in the middle for around a dollar. Maybe that's what the name of this is themed - a whole dolla. Maybe.\n\nOrdered the spicy beef noodle, the pork belly bao, braised beef over rice and the mi fun pork Noodle soup.\n\nPork Belly Bao: Kinda can't go wrong with these. It was good.\n\nSpicy Beef Noodle: My benchmark dish and it was...  just like any other mediocre attempt I find in The City. Beef broth has the tang of bouillon use, flat in character and mildly spicy. The noodle were bordering undercooked as I chewed through a couple half cooked noodle strands. The beef was offensively firm for being braised.\n\nMi Fun Pork Noodle Soup: I had asked the waitress which dish she recommends that would have me coming back and this was it. In referencing the Plain Beef Noodle where it didn't come with actual beef, I asked if that's the same case with this. She assured it had pork in it. The broth was delicate and flavorful. The noodles slick and snappy. The pork... Where's the pork? About an ounce of pork bits. Annoying.\n\nBraised Beef over Rice: See review of spicy beef noodle, because it's the same.\n\nWould I come back? I dunno. Very average. I give it a 2.5 for this visit. Service was okay, but they forgot my Lagunitas IPA.", "author": "Bor C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-06-23", "description": "It was just ok. I order the braised noodle soup and the noodles were not cooked. Beef roll was salty and ok. The bao was not spectacular. Just ok.", "author": "Julie M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-01", "description": "The dessert is very sweet! It's like new fresh meet! The waiter is very nice! I would like to come next time! It's the great dessert bar in bay!", "author": "Xichao C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-30", "description": "I had the sizzling beef with black pepper and mushroom sauce! I highly recommend it, it was delicious. Also have the Taiwan beer! \n\nGreat Taiwanese food!", "author": "Casey D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-23", "description": "Service 5 star\nFood 5 star\nDecor 5 star\nMenu 4 star\nPrice 5 star\n\nThis is definitely the best Taiwanese restaurant in SF. The food quality, service, and environment are all excellent. I gave 4 star to the menu is because their still in soft opening. So the menu item is pretty limited. The waiter/waitress is very nice and patient. I ordered the giant squid noodle which came with a surprising huge whole squid. I will come back for sure.", "author": "Mandy L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-22", "description": "Hands down the best Taiwanese restaurant in town. It's proved by me- a Taiwanese! Must have here? Pork bun and beef noodles soup! \n\nBy the way, Ho Da La team, where is my stinky tofu with Taiwanese kimch???????", "author": "Elsa L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-25", "description": "Pleasantly surprised with this place! I've never had Taiwanese food so I can't vouch for its authenticity but the food tasted great - bottom line. I loved the spicy tomato beef noodle soup, pork belly bao and crispy beef roll in particular, but everything else was delicious as well. Service was attentive and fast and the bill was about $100 for 4 adults and 3 kids...Not bad at all! Glad we found another neighborhood gem and I hope this place sticks around!", "author": "Cee J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-20", "description": "Food was amazing. Fried chicken was bomb. Also service was amazing. Tried the shaved ice and it was great", "author": "Bk J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-08", "description": "Love the decorations! Bring back a lot of good memory of Taiwanese-style street food.", "author": "Jackie L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-08", "description": "Delicious tomato beef noodle soup! Good atmosphere inside. I would like to see some Taiwanese style coffee drinks on the new menu.", "author": "Wui I."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-26", "description": "Best shaved ice ever!~~~~ the food are tasty. The environment is also nice. The music bring me to childhood. Waiters are friendly and patient. Hope so come here each week", "author": "Hermione H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-12", "description": "deliciousfood！ recommend fried rice and the shaved ice！ the porkrib over rice is good too！", "author": "Jieying X."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-02", "description": "Great place. The waiter gave us recommendations and the ground pork over rice was great. The whole grilled squid was a good size. The pork belly bao was delicious. The service was great. I felt like I was in a restaurant in Taiwan.", "author": "Chris T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-04", "description": "This place is really bomb! Braised pork rice and the Stir fried preserved eggs w sweet potato leaves are really good! Definitely come back the next time! \n\n**They are having buy one free one beer right now!", "author": "Sze C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-04", "description": "The reservation is very convenient via Yelp.  We got our table within 10min.  The restaurant ambience is great with mix of modern and old Taiwan poster decoration. The server is friendly.  Price of the food is moderate.    \nWe ordered sizzling steak, dim sum combo, and fishball noodle.\nThe noodle soap is tasty; dim sum with shrimp dumpling/shuimai is good but only 4pieces; garlic noodle/brisket is slightly too oily.\nThe parking is relatively easy; with our 1st experiment, definitely will be back ...\nWould like to add crepe as desert to the menu.", "author": "Christopher N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-04-01", "description": "Waited around 40 min at 8 pm on a Saturday. Inside of the restaurant was pretty nice and fairly modern. No complaints about the service and decor. They have some pretty sweet Taiwanese snacks too. \n\nGot 4 pretty iconic items: noodle soup, pork rice, pork bao and a wrap. The food was pretty mediocre overall, nothing really stood out. The noodles weren't really hand pulled and felt like store bought noodles. The bao had a weird peanut sprinkle that I didn't feel like went with the pork at all. The wrap was super oversalted. Overall it was just not that great compared to the other Chinese food in the Richmond/Sunset district.", "author": "David Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-25", "description": "So good. Finally real Taiwanese food in SF. \n\nFavorites are the ground pork over rice, pork chop rice, beef noodle soup, and beef sizzling platter noodle. On appetizers skip the nap -- not bad just filling and everything else is so good. Scallion pancake is extra crispy. Stir fried Yam leafs ftw.", "author": "Adam A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-16", "description": "Love the pork belly boa and beef noodles soup. Would love to see if you can add some traditional small dishes like 豆乾..etc!", "author": "Henry W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-08", "description": "The spicy beef noodle soup was delicious and I loved the noodles. Nice texture and quality! Would like to see non dairy ice cream options on the menu!", "author": "Victor R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-05-25", "description": "Pros: they got the drink selection right as far as representing Taiwanese popular beverages... Taiwan Beer! \n\nBut their Gua Bao couldn't be more wrong... it is worse than sticking a chicken McNugget in a steamed bun. They then add honey mustard and some cabbage. Really disappointing compared to the real deal. \n\nTaiwanese Food is delicious -- the fried chicken Gua Bao is not.\n\nI was really looking forward to this place!", "author": "Jennie L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-07", "description": "Previously came to this location when it was a noodle soup restaurant. I like how they changed the paint and added lights to brighten the place up.\n\nOrdered the fried chicken over rice and it's the crunchiest Taiwanese chicken I've ever had. It was extremely flavorful and reminded me of homestyle cooking. The portion is generous and I really like how they put braised beef over the rice. The side of bok choy really balanced the dish out.", "author": "Brittany W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-11", "description": "Love the fried pork chop!!!! Soo good! Must get.  Tried it when they just open but now it's even better.  Btw - their passion fruit beer and lychee beer is delicious!!! oyster pancake in the future?  Nice ambiance on the weekend!", "author": "Kathy C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-30", "description": "I LOVE this place. My favorite dishes are anything with pork belly and the potato leaves with preserved egg. It can get crowded for dinner on weekends so make sure to make a reservation or sign in for your spot online. The interior is cute and well decorated. If you're new get the bao that lets you try one of each. \n\nI love the rice dishes- pork belly over rice and ground pork over rice are delicious. Their braised beef noodle soup is amazing as well and has JUST the right amount of spice.", "author": "Kelly T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-14", "description": "This is probably the first fully Taiwanese restaurant i've been to or seen around SF. Most of these places reside in south bay. Knowing that, I was extremely excited to try this place. It is a small restaurant in the inner Richmond area which is hard to find street parking. Walking into the restaurant, you can instantly see the whole place (it's not very big). But it is decorated with the different Taiwanese snacks that you can buy (chips, candy, etc. - most are about $2 each). We ordered a bunch of dishes to share between 5 people that included Beef noodle soup, Tomato Beef noodle soup, chicken wings, pork belly buns, veggies, etc. The dishes are not super big, but was big enough to share to 1 portion a person. \n\nOverall the food quality was decent but it is a little on the pricier side of things. I'd come back if i'm in the area and definitely would tell friends to try.", "author": "Kevin W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-07", "description": "I've been wanting to try their beef noodle soup for a while. So my dinner option was obvious when I saw HoDaLa on UberEats. I ordered the Spice Braised Beef Noodle Soup and the Beef Wrap. The Beef Noodle Soup seemed a bit smaller than expected, but it ended up being pretty filling. The broth was super flavorful and just mildly spicy. The beef was tender and savory. It was a pretty dam satisfying bowl of Taiwanese beef noodle soup! The beef wrap is just as tasty and not too greasy. That dipping sauce is amazing, like now I wanna put it on everything. Delicious!", "author": "Nana L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-26", "description": "Went twice in a week. Good stuff! Dessert is really good. Will be back for sure and will try my 3rd soup at that time.", "author": "Jeff D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-15", "description": "First time here and it was definitely a good experience,the restaurant was packed around 6:30 to 7pm...the bao's are definitely worth trying the bf and I got a trio of bao's pork belly/fried chicken/kimchi pork belly all were tasty and bao it self was just right in texture and taste...we both opt for the sizzling plates meat lovers and surf and turf, the pepper mushroom spaghetti was really good..the meat and the sausage I had were tasty and cooked just right..the surf and turf had squid and steak which my bf said tasted good...and you have to wash it down with some beer,after hodala means bottoms up in Taiwanese I was told", "author": "jonathan h."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-10-07", "description": "Pork blood cake and tw beer is not bad ! 鐵板麵還好，牛牛腩飯is pretty good . They have those pic sign for fun and the decoration is full of memory !!!!!", "author": "Jill L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-31", "description": "Solid food, the noodle soup was good. I enjoyed the texture of the noodle, flavor of the soup and tenderness of the beef. Popcorn chicken was good but it's more like your standard fare Asian popcorn chicken you can get anywhere. It is executed perfectly and was tasty but small portion for $6.99.\n\nWould like to see the intestine dog (aka big sausage wrap small sausage) and stinky tofu as they are Taiwanese staples.", "author": "Cecile X."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-12", "description": "I really like their pork ribs!!!! I would like to see ground pork and pickled veggies over noodles. great place to have lunch.", "author": "DiaMan L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-16", "description": "Food and ambiance is great. The food has a bit of excess of pepper for my taste, but otherwise delicious!!", "author": "Carol T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-07", "description": "This is our first time trying this place out. From the pictures the dishes look delicious. The decor and the ambiance feels like we are in a cozy shop in Taiwan . The seatings that they have are refurbished movie chair seats and the stools are of refurbished steel pipes. The lightings are cool too. They use the old Edison style bulbs. \n\nThis place so far is quite quaint!", "author": "Sol P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-03-26", "description": "Can't believe Chicken'licious already closed down and this opened. Then again Turtle Tower being right across the street can be hard to beat. \n\nFirst off, very nice choice of decors to the ambience and even down to the details of furniture choice. Kind of a rustic modernized twist, from those 2 Star war and iron man figurine posters at the door to the dim light Taiwanese night market looking stand at the entrance with many candies and snacks to choose from. Seems like a cozy appealing place to step into for a cold windy night with some warm food. First thing I noticed were the water cups. They're silver and bronze version of our typical red party cups haha, brownie points. \n\nNow what I actually tried were their Taiwanese pork belly bao, fried spicy chicken wings, squid and steak pasta, and their beef noodle soup. \n\nTaiwanese pork belly bao might be gimmicky but get it! Won't disappoint! Tender juice thick pork belly on the inside, very nice pairing, on point. \n\nFried chicken wings, meh they were ok. To me more flavors were on the outside and the inside were pretty bland. \n\nSquid and steak pasta.... where do I even begin with you. First of all maybe you guys should cut that up for us because it was annoying cutting that whole squid on your own. Plus it kind of ruin the presentation because it just looked like a sizzling plate of pasta with the grilled squid slapped on top. Taste wise, I would past.\n\nBiggest past up I would give it to the beef noodle soup. You would think with a Taiwanese theme restaurant this would be safe. NOPE. It was definitely on more of the tomato side of things... tasted like those tomato vegetable can soup and you just add in noodles and beef. The beef were done nicely though, I give it that. \n\nCan't tell if we were just trying the wrong things or everything we ordered was just not up to par. Maybe I'll give the braised pork over rice a try the next time I decide to go there.", "author": "Aly C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-16", "description": "I like their Taiwanese pork belly gua bao. It's very authentic with a lot of peanuts powder. Their fried chicken cutlet is also very crispy and juicy. I wish they will add oyster pancake to their menu.", "author": "Steffi H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-12", "description": "Some of the negative reviews have the right idea.  Post a bad review, shop gets less crowded, come back for more.  I wish I could give it 1 star, but I just can't bring myself to do it.  \n\nAs a Taiwanese person, everything on the menu is something my mom used to cook for me growing up.  \"Minced Pork Over rice\" dish is called \"Lo Bah Bung\" in Taiwanese and traditionally comes with a stained hard boiled egg.  \n\nI went at 9 o'clock with my cousin at night (Sunday), we were already a few drinks in and slightly rowdy.   The waiter was very patient with us, and had definitely more than accommodated us.  \n\nWe ordered 4 things on the menu: \n\nBraised Beef Noodle Soup - A lot of flavor in the broth.  Beef melts and is very soft.  Noodles are good. One of the best beef noodles soups I had.  \n\nPork Blood (Steamed) - This is one of my favorite thing to eat, and they do it well with peanut powder.  It's very chewy, and the pork blood has the flavor (and texture) of a rice cake.  Not for the faint of heart. \n\nScallion Pancake w/ fish sauce - My cousin loved this.  It was pretty good.  I'm not sure if they make this in-house or if this is a pre-packaged dish.  \n\nPepper Steak w/ Noodles - This is like Taiwanese junk food.  I loved that they had it.  Beef was a bit over cooked & dry, but otherwise a fairly good dish.  Can't really do this one wrong. \n\nOne recommendation I have for the restaurant is to add ba wan (traditional Taiwanese meat bun) to the menu (images below). \n\nBa Wan's are just waiting to be the new asian craze in the western world, just like Ramen & Soup Dumplings.  \n\nhttps://www.google.com/search?q=taiwanese+ba+wan&source=lnms&tbm=isch&sa=X&ved=0ahUKEwjJ26y36efZAhUuwVkKHdaTCcsQ_AUICigB&biw=966&bih=438", "author": "Justin L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-25", "description": "Came here a few days ago with my friend. The most Taiwanese Taiwanese restaurant I've ever seen in the bay. Also, one of the best. They're still at their soft opening, so they'll add more items to their menu later on. They have a really cute snack bar at the front and the candies are for sell. I ordered a grounded pork over rice. It was delicious and the price was reasonable. It was worth my money and will definitely come back to try their beef noodle soup!", "author": "Tiffany L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-04", "description": "HoDaLa means bottoms up in Taiwanese dialect.  It actually happened to the bowl of noodle soup which looked really bland.  the noodles has a really nice smooth crunch that I've never had, and the broth was piping hot and flavorful.  The Pork belly bun was good too.  The pork rice bowl is actually better than the top place we had in Taipei.  We will be back before traveling to Taiwan again.", "author": "Mei L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-03-11", "description": "Came here because of the good reviews, left the place disappointed, we got pork belly over rice, ground pork over rice, spicy chicken wings, and mifun.\nPork belly over rice: 2/5, 4 small pieces of pork belly over a lot of rice and veggies, at least put some sauce over the rice. Meat to rice ratio left many rice unfunished.\nGround pork over rice: 4/5, savory saucy and flavorful, the only good dish we got today.\nSpicy chicken wings: 3/5, nothing special.\nMifun: 1/5, extremely rigid, easy to break apart noodle (frozen, probably) over watery, blend soup with very few companion ingredients, the worst thing we ordered, for the price of 8 dollars we can get a big hot bowl of beefy pho elsewhere.\n\nThe food are easy to make, and most of them are pre-made but it took over 30 to get out food served in a not so busy time. Will not return.", "author": "Jesse Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-02", "description": "After Yelping a couple of restaurants, I stumbled upon this Taiwanese place--it was conveniently located and close to the Golden Gate Bridge, where my friends and I wanted to go to after lunch. I've got to say...my mood was lifted as I saw the wall with the old school (and semi recent) Jay Chou MVs. Definitely brought back nostalgic moments in early high school. The one dish that I was looking forward to was the tomato beef noodle soup..however that was the one dish that did disappoint. Maybe I have high expectations since my mama has a pretty bomb recipe..but the broth just wasn't super flavorful and the beef was mediocre. However, the other dishes that we did order--pork belly gua bao, ground pork rice (滷肉飯), pork chop over rice (排骨飯), beef wraps (牛肉捲餅), and sweet potato leaves with thousand year old egg (地瓜葉炒皮蛋) were all incredibly tasty and I highly recommend ordering them. Service was also decent--very efficient for only having 2 waitresses. The restaurant was also decorated with Taiwanese 90s toys and candies. Overall, the experience brought back a sense of home for a Taiwanese millennial and had authentic music and delicious food to top it off. Highly recommend for anyone who enjoys Taiwanese music and food! Will be back if I'm ever in the bay area.", "author": "Jenni W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-31", "description": "Small but cute place with wooden banquet seating and old style theater chairs! They have a nice selection on the menu for snacks, appetizers, soup noodles, and meat/rice bowls. We got the beef roll, which was one of the best I've had in the Bay Area, however, you only get 4 small pieces for $8. The broth for the \"mai fun\" has good depth of flavor and wasn't too salty or oily. The spicy tomato beef noodle soup only had a couple pieces of tomato, but overall hearty for a cloudy cool day. Surprisingly, the \"lo rau\" rice was our least favorite. Too much vinegar and the pork was a little gamey tasting. Staff was friendly and the food came out pretty quickly.", "author": "Ellen H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-24", "description": "We love their signature milk tea.   We love the squid and beef noodle.  Their food are very authentic Taiwanese food.   \n\nWe would like to see 瓜子肉燥飯 on the new menu", "author": "Tom Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-10", "description": "We came and ordered fried chicken and Mix Gao Bao. They were both delicious! I think they both should be on the new menu.", "author": "Paul B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-30", "description": "Great for large groups. Good food and really fast service. The Gua Boa was amazing. I would definitely come back here.", "author": "Justin B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-25", "description": "Wandered in here as I noticed it was a new business replacing the chicken noodle place. I ended up ordered the ground pork over rice which is a standard for Taiwanese food as well as the pork belly baos, which I was surprised was 3 per order! The pork bowl was super flavorful and was filling. The baos were very soft and the belly melted in your mouth. It was also topped with a really cool ground peanut mix that added a lot to it. They also had a pretty cool drink menu and a bunch of little tapas I'll have to try when I go back.", "author": "Zack W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-07-09", "description": "Glad to see someone is trying to make Taiwanese food in the city. The shaved ice was pretty gross. Too sweet with all canned fruits. Nasty. The beef roll was delicious.  The braised pork and pork chop over rice were just ok. Beef noodle soup not memorable. Glad I went once.", "author": "Fatty A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-24", "description": "The place was small for big crowds, but it packed a big flavor punch!! Loved it here ! They were all so nice and accommodating for our large group ! We ordered a variety of dishes and all were super delish ! We will be coming back. !", "author": "Mel N Viv G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-15", "description": "I'm a Taiwanese (born and raised) so when I stepped in the place, I feel home already. There are all the candies that I grew up with and the music videos playing on the wall that you can even hear it in the restroom, literally mimic three set up of cashbox in Taipei (if you've ever been to karaoke in Taipei :)) All the set ups and menu are super authentic and I'd say it's the most Taiwanese place I've been in Bay Area so far. Most of the places I've been are either old Hong-Kongese style or Taiwanese family style; however this place will give you a bit of young vibe :) Food wise, they're definitely good - can't compared to the best in Taiwan but I'd still recommend people come to try, absolutely try all the fruit flavors of Taiwan Beer.", "author": "Kathie F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-19", "description": "I don't know Taiwanese cuisine but I know what I like. Service was friendly, food was delicious, and ambiance was cool.  Affordable prices too! \n\nThe menu is not huge - that could be an issue over multiple visits. But I'll be back.\n\nAnd another thing -- we tried to go to Dragon Beaux at 2:52p, they would not seat us because they close at 3:00. We crossed Geary and went to HoDaLa, they were happy to serve us. They also close at 3:00p. Yay for the little guys!", "author": "jim b."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-15", "description": "Good place. Got the braised beef rice plate. The noodles are also pretty good too. Would come again.", "author": "Thomas C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-08-02", "description": "Ordered famous Taiwanese lurou fan. The rice was cold and undercooked. The glasses were super dusty, seem to have been out for over a month. Gave it a few tries in three different occasions in three different times... food was bad. As a Taiwanese, I feel sad for it. The deco is pretty good tho. Reminds me of my childhood.", "author": "John C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-19", "description": "I've been here a few times now and the food and service is consistently great. Love their beef noodle soup and other Taiwanese dishes. Highly recommend!", "author": "Angela C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-03-29", "description": "I order fried chicken rice, the rice is hard, not soft at all, I think it's microwave rice. But chicken taste good.\nBeef noodle soup is not bad.\nthousand egg with vegetables taste fine. BUT I found some pieces of Paper Box in the food!!!!!!\nThe gave me 10% off in the end. Service is not bad.", "author": "Ho L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-27", "description": "Super nice vibe and feels like traveling in Taipei night market，definitely will come next time！Food presentation is super joyful", "author": "Sunny X."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-04", "description": "Feel like eating at home, friendly staff,will go back for different items.  No line,just because it was Warrior game that night.", "author": "Lan C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-07-10", "description": "Food was ok (not a ton of Taiwanese restaurants nearby to compare this with)...but definitely not kid-friendly. They have a dozen TVs and loud music playing all day.", "author": "Chelsea S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-03-18", "description": "Really good service.  People love it, there was a line the whole time.  I feel like they should stick to what they are good at.  All the noodle dishes were not very good.  Some ingredients is straight from Costco.  Like how they used Costco fish sticks.  For the price of the food, I expect them to try harder.", "author": "Nathan H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-09-30", "description": "Young lady was very welcoming and made what I needed happen. Food was fast hot and delicious. But won't honor the instore advertisement to get a free shaved ice when you do the Yelp review. Not good to advertise false information.", "author": "Tiffany H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-09-21", "description": "Not impressed. I ordered pork chop over rice. The meat and the outside batter separated immediately as I cut it. Cabbage stew was ok. The baos were ok, and the meat inside was super dry. The only I liked was tofu & egg which I can also make it at home...I was hoping I could really like this place but unfortunately I don't I would go again. My go-to taiwanese restaurant is still the one in Pleasanton (Taiwan Cafe) but it's so far!!!!!", "author": "Yc C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-22", "description": "Very cool decor, meant to feel modern but vintage and nostalgic. Nothing mind blowing, but overall the food is good. An excellent addition to the neighborhood. My personal favorites are the pork belly rice, the pork belly buns, and the preserved eggs and potato leaves. Just wish everything was $1 cheaper.", "author": "Will T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-07", "description": "Ordered the pork buns, steamed pork blood cake, chicken steak rice bowl, and beef teppan noodle. The teppan noodle didn't have the runny black pepper sauce like how it's usually served, but the flavor was still OK and all the dishes hit the spot for me! The restaurant is modeled after a traditional Taiwanese grocery store, and is actually stocked with Taiwanese candies and snacks for purchase. I loved the food and environment here, and can't wait to be back again!", "author": "Yen Ting L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-15", "description": "This is a must try, I brought my family here for the soft opening and the food is really good...my daughter loves the fried Mac ' Cheese balls and the Fatty Pork in steamed bun is to die for...it just melts in your mouth, the Taiwanese ground pork over rice is very tasty and it will leave u wanting more, we ordered 4 of the fried items from the pork cutlet to the chicken and it was fried to perfection, don't take my word for it.....try it out and u will definetly be coming back !!!", "author": "Johnny H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-01", "description": "My girlfriend and I ordered the beef wrap, braise beef over rice and the Taiwanese Pork Belly Gua Bao. All three dishes were amazing. We enjoyed the Taiwanese Pork Belly Bao the most. The pork belly was super bomb!!", "author": "Anthony L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-05", "description": "Love this place! We stopped in on the way to a movie with limited time. Service was excellent, quick and food was insanely delicious. \n\nCan't wait to come back with more friends!", "author": "Magan B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-30", "description": "I really like the fried pork chop, very cripsy. i also like the fried Tofu( the dip sauce definitely brings to a different level. And it's a very inexpensive place :)", "author": "Jason J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-30", "description": "The best Taiwanese restaurant I've ever been to in the states! Beef noodle and beef pancakes are the must-tries! The milk tea is tasty too! Service is great and the vibe is just perfect. Will come here every week!", "author": "Lorenzo M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-03-25", "description": "Super rude and slow service.\nSuper NOT authentic food.\nThe rice was NOT even well cooked. \nThe chicken was salty like drinking sea water....\n\nWhat a terrible place", "author": "Tongtong L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-03-25", "description": "This is probably the worst pork that I ever had~can't even taste it~that's a horrible deep fried pork ~the veggies are half cooked, the rice is cold - maybe that's normal.", "author": "Eden X."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-29", "description": "I decided to give this place another try and this time the service was way better. I ordered the combination baos and their beef noodle soup. Everything was amazing.", "author": "Huyen C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-25", "description": "For some context, I'm Taiwanese. \n\nOrdered something for delivery, came out to about $45. Tastes alright, but nothing special. Not to mention EXTREMELY small portions. Nowhere near worth what we paid for. When I say small, I mean appetizer-size priced $5 anywhere else that they charge for $10 and up. Super overpriced for what they give you, and they forgot our beverage. I don't know how the experience is when you go in person, but if you're ordering take-out, don't bother.", "author": "John C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-04", "description": "Delicious and authentic Taiwanese food. Can't  be better. We have been here for four times and ordered different food and everything on the menu has been great", "author": "Jessica C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-15", "description": "Its my first time checking out this place with my brother, and its very comfortable sitting here chatting since this place have a nice ambiance. We ordered the Braised Beef Noodle Soup (its REALLY good and perfectly flavored), the (3)GuaBao 刮包 with Pork Belly (my brother took a first bite and was surprised at how good it tasted!), and the Pork Belly over Rice (爌肉飯). I had expected that I would like the 爌肉飯 the most, but it was dry (沒有汁) and kind of salty, and since the portions were pretty big, I had the rest to-go so I can finish it at home for a late-night snack. As for what I'd recommend to the menu, I would recommend some of my favorite Taiwanese foods: 肉圓 & 大腸包小腸. Overall, I really like this place and I'd definitely come back! ^^", "author": "Amy L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-30", "description": "Food is really good! So many more dishes I want to try. Will need to get a big group of friends to come to try more things :D would like to see 蚵仔煎，鱿鱼羹面，大肠面线 on the menu!", "author": "Siyao X."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-25", "description": "That is my first time to try Taiwanese food. I ordered is preserved egg with sweet potato leave and beef noodle soup and the taste have killed my tongue. It's so good. The important part is They got reasonable price for the food and very good service.", "author": "Eddie Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-24", "description": "HoDaLa (\"Bottoms Up!) I wandered into this place on Geary by chance. Taiwanese fusion. Super cool ambience with Taiwanese pops Tara (Fan Wei Qi ) screened on the wall, tap beer and kimchee pork belly boa to die for! They have a Taiwanese candy stand. There are cool theater seats and retro light bulbs in minimalist design. And the price point is super reasonable. The wait staff are chill and on top of it.  I'll be back with my friendz.", "author": "Todd R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-08", "description": "As I'm always on the lookout for good Taiwanese food in the city, I was so pleasantly surprised to find HoDaLa! Their minced pork is delicious and closely resembles some of the better minced pork rice I've had in SoCal. Also their pork belly (both over rice and in buns) is simply amazing. The meat is perfectly cooked and just melts in your mouth. You also can't go wrong with the beef noodle soup. Can't recommend this place enough!", "author": "Megan W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-08", "description": "This is probably my favorite Taiwanese restaurant in the neighborhood. Good decor, good service and food are decently priced. \nWould recommend getting the pork ribs over rice!", "author": "Bryan L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-30", "description": "Excellent and consistent food, with cool music videos playing on the wall. Menu is divided into soups and rice, with comfort food appetizers. Best items: sweet corn with cheese, preserved egg with pork floss and tofu, and beef noodle soup.", "author": "David M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-23", "description": "I liked this cozy place tucked away on Geary. The sign said soft opening so just take that into account. We got bunch of things-a pitcher of beer, pork guabao, green scallion pancakes, fried meat sticks, braised beef noodle soup, and fried pork chop over rice. There was a little wait when we got there, but somehow they skipped over some parties and took us to a table fairly quickly. The two ladies waiting tables are super nice and kind, which is kinda amazing. I tend to associate Asian restaurants with straight forward service aka North Korean style (just kidding) sans any smiles. The food overall was unfortunately very average and a bit of miss for me. I was totally stoked that another Taiwanese eatery opened up. The guabao was probably the best. The meat was tender and flavors were nice and not over the top like chairman bao's in the tenderloin. The buns were pretty cold or luke warm at best. The pancake was little greasy and chewy.  the fried meat sticks were ok. They are like miniature fried wontons, and not memorable. The pork chop over rice tasted really good but the meat was over cooked and became very stringy. The braised beef noodle soup was similar. The broth was really solid but the meat was very stringy, I had one piece that was tender and rest felt like they were cooked to death. But it was the noodle itself that did me in. They were just flat,\nstore bought noodles with no texture what so ever. I was hoping that for 12 dollars, I'd get fresh hand made noodles, which ironically a lot of the Asian hotpot places (which line the street) have now. So taking everything into account, I think the prices are a bit high for the quality of food dished out, but good and friendly service. Will probably wait a while until we come back. Hope they put a little more effort into the food and menu itself. Now onto Walgreens to get some floss.", "author": "Charles L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-06-26", "description": "Hmm... I really did want to love eating the food at this place because they looked so good on Yelp and just from looking on the menu. However, the quality of the food wasn't as I had expected (more on the salty side) for a pretty high price. The bubble milk tea however was very delicious, more on the milky side. I love the design of the place and had friendly customer service.", "author": "Vivian N."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-05-14", "description": "The food is not very good. The staff is friendly. The stadium seats are very uncomfortable. The sauce on the pork belly buns is strange. The fried pork cutlet over rice is ok but not the best. The soup taste is strange.", "author": "Karl K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-11", "description": "This place has a very cute interior and gives a nice homey place. My friend and I came here for late night food and it really hit the spot. They should put basil popcorn chicken on the menu to go with the boba drinks!", "author": "Michelle K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-02", "description": "Great pork belly bao and green onion pancake. We also got a squid noodle which was good.", "author": "Lisa T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-20", "description": "Best gua baos I've had in San Francisco. The Taiwanese food here is very tasty. I'll be coming back here for sure.", "author": "Vicky C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-03-11", "description": "Service was good and staff friendly. Beef noodle soup definitely not what you would get in Taiwan. It's ok, just not the traditional beef noodle soups. Scallion pancake was overpriced for the what was provided and felt like it may have come from a package. Pork rice was ok.. MSG a bit on the higher side, was thirsty for an hour or so after the meal.", "author": "B H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-04-26", "description": "I came here on a Sunday night around 5:30 pm and it was not that crowded. We got seated immediately into these uncomfortable old theatre chairs. They are extremely uncomfortable and feel very awkward. The servers brought us the menu and it looked really old and worn out, it was made from paper there was no lamination or anything and the menus smelled bad. We ordered the squid noodle, pork buns, minced pork over rice. The pork buns were pretty good however I can tell the meat was extremely fatty , I didn't like it so I took off the fat from the meat. But the bun is very delicious! And the presentation is the cutest! The minced pork over rice was just ok, I wouldn't order it again. It was not that special. The squid noodle was SO UNBELIEVABLY SALTY!! I could not finish that fish because the noodles were soaked in oil and salt and msg. It was so bad I couldn't eat much of it. The squid was pretty good but really salty as well. The service here is pretty good, all the waiters were pretty friendly. But due to the food and atmosphere I would not come back.", "author": "Carissa C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-06", "description": "What a wonderful edition to the Outer Richmond. This location has been plagued with one failure of a restaurant after another. Not anymore! Food here is amazing and fun. The staff is attentive. And the atmosphere is fun and engaging. Sorry no pictures this time to busy eating right away. Cant wait to go back.", "author": "Rebecca N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-04-16", "description": "Food is over all too salty. Not too many choices from the menu. However, service is nice. Hope they can make some improvements.", "author": "Jenny C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-18", "description": "I like the fried chicken rice the most. I would love to have 蝦仁煎 and stinky tofu on the new menu.", "author": "John S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-03-10", "description": "Horrible Taiwanese place do not go. The services abysmal they don't have enough servers. Actually only have one server.  I had to pick up my own menus. Then they never give me utensils or my plate. \n\nFor the food I would say it is not authentic. The price is OK for San Francisco but overall do not go. They should get their act together otherwise still should close up. I mean they will close up very soon.", "author": "Alex H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-05-02", "description": "Generally disappointed. \n\nWe had high hopes for this spot since it was highly rated here and its a rare Taiwanese restaurant in a very Asian neighborhood. Sadly we just weren't at all impressed. \n\nTo be fair, they did have a \"Soft opening\" sign up so perhaps these are areas they can still tweek and improve on.  \n\nThe service: very slow. The restaurant wasn't packed and there was technically no line and yet we still had to wait a while to get seated. Ended up getting seated at the bar. It'll be another while before anyone came to take our order and give us water. And it'll be longer still to actually get the food.  New restaurant though so I guess this is expected. \n\nThe food: We got a few things to share:\n\n\"fried chicken\" bao\nbeef rolls\nbeef noodle soup\n\nI put the fried chicken in quotes because this was as much fried chicken as a McChicken patty... Meaning this wasn't fried chicken at all. It's not even clear whether this was chicken. Basically think of the McChicken sandwich, cut it in half and replace McDonald's bread with a bao then add a little Costco mustard.  Thats the fried chicken bao. The pork belly looked better. We regreted our decision. \n\nBeef rolls were okay. Slightly on the small side. The beef was very tendony and the wrap was chewy rather than crispy.  Beef noodle soup was good, but not anything to come back or wait for.\n\nThe space: Overall well decorated, slightly cheesy with a 80s Taiwan theme. There is a projector that's plays Taiwanese music videos. The most entertaining part though is that the projector was connect to an iPhone and it would also project text messages and incoming phone calls.. amazing.", "author": "John S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-03", "description": "Got in slightly after opening memorial day, and managed to get a cozy corner seat by the window.\n\nPork belly gua bao and scallion pancakes for starters were very good! Extra points for the unique presentation of the gua bao.\n\nThe beef noodle soup had a pretty generous portion, and the beef was very tender. The broth was very flavorful, but spicier than I remember from trips to Taiwan. Noodles were clearly not fresh made, as some strands were sticking to each other (as can happen with dried noodles).\n\nService was good, and food came out fast. Overall, definitely a great experience!", "author": "Darren W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-03", "description": "Really authentic Taiwanese atmosphere and menu but the food can be improved. The pork belly bao was the highlight, the ground pork over rice was delicious, but the beef noodle soup had beef that was way too tough and noodles that were clearly store-bought. The fried tofu looked on point but was bland and the sauce tasted store bought. It's definitely the \"most Taiwanese\" restaurant in authenticity I've been to in SF, and I would return just for that, but I hope to see a more complete menu and definitely a better beef noodle soup recipe. Service was great.", "author": "Grace B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-27", "description": "The flavors are rich yet simple and fresh. Very larger portions--especially of meat. Presentation is nice and clean. Come here when you're looking for Chinese/Taiwan homes style very well done.", "author": "Anthony B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-03-30", "description": "Food was not executed well.  Tasted like it was from the microwave of a boba shop rather than a sit down restaurant.", "author": "Paul C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-25", "description": "I visited HoDaLa the other day for lunch and I was pretty impressed with the food quality. I tried the stir fried mi fan and it was great. I've tried other Taiwanese restaurants and as a fan of Taiwanese food I could consider this one as one of the best restaurants around. The service was also great and they are always looking after in case you need something. Highly recommended, must try it!!!", "author": "Armando C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-04", "description": "The food is very delicious. It would be perfect if they can have oyster mee sua on the menu.", "author": "Jay W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-04-16", "description": "This is the worst Taiwanese food in the bay area. I have tried so many different Taiwanese restaurants before, this place has a traditional Taiwanese display in the middle of the restaurant which is great to make people recalled their childhood memories. Service are friendly and nice. Unfortunately, the dishes taste really salty, we ordered their fried noodle with black pepper sauce and the traditional Taiwanese dishes, also their matcha milk tea and we were expecting is going to be amazing taste, but it was not! !! Milk tea taste full of sugar, and noodle taste too salty.I am sorry even the store layout looks very good and attractive, but their food was taste really bad and salty in general. Hope they can get better", "author": "Leon K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-06", "description": "Pretty good overall!\n\nOrdered:\n\nBraised beef noodle soup - 4.5 Stars, great taste and flavors, a must try here!\n\nFried chicken w/ rice - 4 Stars super yummy, taste like popcorn chicken\n\nScallion pancake - 3.5 Stars nothing special but it does come with a unique sauce\n\nMixed bao - pork belly bao 4.5 Stars sooo good! \nFried fish bao 2.5 Stars taste like frozen fish\nFried chicken bao 2.5 Stars taste like frozen chicken nuggets, if they changed it to the chicken they used in the rice, it'll be so much better\n\nWe ordered milk tea and the black tea with lemon, they were both pretty good!", "author": "michele h."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-05", "description": "HoDala is such a cozy restuant where serve delicious Taiwanese food! The beef noodle soup and pork belly bun are just amazing! I had tried different kinds of buns at many restaurants and I can say that HoDala has one of the best in the Bay. Another dish grabed my attention was the noodle with a whole squid serve on top. I never seen something like that! If you are a squid lover, definitely give a try. Overall, it was a good experience. Come and pay a visit, the pork buns wont disappoint you.", "author": "Dave Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-01", "description": "Tried this place the first time and really like it! The atmosphere is cozy and friendly. Staffs are attentive. My favorite food here is the Mi-Fun soup, the soup is tasty and the noodle has just the right texture. I would like to see they add more Taiwanese night market type of food and pork neck meat steak.", "author": "Coco C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-12", "description": "Good Asian Fusion with a diverse menu. Staff was super friendly and accommodated our large party of 16. I shared the noodle soup, rice dish, tofu, and pork belly with three other friends which were all delicious. Pork belly came in set of three so we had order another one. Would definitely come again.", "author": "Seaton N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-03", "description": "I went there twice.  I like the services there.  The waiter is polite and he chatted with us and took our advice/comments nicely.   Foods are good.  I like their pork belly over rice.  If u aren't afraid of the fat, you must try it.   And I have to mention the decorations of the restaurant.  The owner must have put a lot of heart and effort in it.  The chairs are cool - old movie theater seats.  They also sell candies and snacks in a old-style way (put them in big glass jars).  If you are from Taiwan or Hong Kong, you'll find them amusing.", "author": "Shirley C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-06", "description": "The food was SO good and actually really reasonably priced!  We got the pork buns and the fried mac n cheese balls.  Both were amazing.  Only down side is that it took over an hour for us to be seated and order and eat and get our check, but I understand that they just opened and were super short staffed.  Food was worth the wait!", "author": "Geena G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-05-20", "description": "I love Taiwanese food but somewhat disappointed.  I would have given 1 star but the service was excellent.   Great atmosphere and the place is very nicely decorated.  However, the food is just so so.  The beef was very tough to chew on and the noodle was too salty .  I'm not sure if this corner space is jinx or not, but whatever restaurant that operates at this location ends up closing.   I hope they survive and I hope the chef read my comments.", "author": "Lawrence L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-03-13", "description": "Giving a 1 star because on yelp, it's says they're ppen. Got to the restaurant and they were CLOSED!", "author": "Manny D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-04-15", "description": "Everything was too salty. It made me just trying to finish the dishes for not wasting money. My friend and me needed to drink a lot of water to get rid of that feeling. The worst thing was we even need to eat some candies, too.", "author": "Crystal T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-07", "description": "It's a cool little spot in the Richmond. Lots of small plates to choose from if you just want a snack. They also serve noodle soups and rice bowls if you are hungrier. Will need to come back to the the whole squid surf and turf. Looks promising.", "author": "Tony L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-13", "description": "Came here on a Sunday night and they were packed (not a large place). The food was decent and I would come back if I was craving Taiwanese food and didn't wana drive to East or South Bay. \n\nUnfortunately, the service needs work and they are a bit over priced. Having worked in restaurants for years, they need to figure out a better rhythm and a division of labor between their servers (two servers doing everything front of house). It's not great to see the servers fighting with each other; work together! Hope you guys guys can work out your kinks; look forward to coming back and updating this review with more stars!", "author": "Jessica C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-08-05", "description": "Had to wait 50 min for the surf and turf. But food was excellent. I enjoyed the texture of the wonton noodle and the wontons were yummy. The waiter tries very hard to serve everyone well, but the kitchen seems a little understaffed. My friend loved her surf and turf. I'd come back and try something else.", "author": "Tamara T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-08-04", "description": "so, i came here right when it opened and i was very disappointed. \n\nBeef noodle soup- i ordered beef noodle soup without tomato, yet they gave me a tomato flavor beef noodle soup? noodles were over cooked making it disgusting.\n\nporkchop over rice- the porkchop was extremely greasy and salty. the rice was just decent\n\nrice noodle soup- no flavor. it was like they cooked the noodle and put it in hot water.\n\nsquid over noodle(forgot name)- the squid was whole, so therefore it was hard to cut into it. it was also really hard to chew. the noodle also had no flavor and was really soft\n\nthe milk tea- so sweet i could get sugar high\n\ngua bao- was so cold when we ate it. compared to taiwan's gua bao...i was no where neared impressed\n\nWe ordered all of these and came out with an amount of 80$ with a tip of 10$. \nwill not come here ever again.", "author": "Evelyn H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-29", "description": "Best Taiwanese food in Sf in my opinion! Beef noodle soup was spot on with a bit of spice in broth. Beef roll was amazing, fried chicken over rice was bomb, I could go on and on. Please go! The decorations also remind me of Taiwan so much-- my friend and I basically ordered the whole menu cuz it was that good!", "author": "Sophia L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-16", "description": "HoDaLa is a casual dining option in the neighborhood to grab a quick bite of food with unique Taiwanese favor.", "author": "Pedro R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-30", "description": "Definitely satisfied my cravings for Taiwanese food! We got the ground pork over rice, braised beef noodle soup, and pork belly gua bao. There was less than expected ground pork but still pretty good. Braised beef could be more tender but the soup was decent. Gua bao was", "author": "Felicia L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-30", "description": "Taiwan numba 1!!!! Great food and service. Order the pork chop over rice and milk tea.", "author": "Kevin L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-19", "description": "Food was great! Ordered the noodles with whole squid as well as the sweet potato leaves - both delicious. Just wish the veggie portion was a little larger, overall a nice spot for lunch! Our friends ordered the beef noodle soup, beef pancake roll, and pork belly buns. All really good. For the pork belly buns, they sprinkle them with a peanut sugar, which made them really yummy.", "author": "Anna W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-01", "description": "The sizzling beef noodle plate is to die for. Our server Eddy was so nice and attentive. Will definitely come back, love the environment. Also a fan of the lychee beer! Cheers helpers", "author": "Crystal M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-26", "description": "I visited Hodala yesterday. Although they are still soft opening,it was the best Taiwanese restaurant I have ever been to! They serve real traditional Taiwanese food with a reasonable price. Plus they decorate the restaurant really well, dining there was like eating in Taipei. If you really like Taiwanese food or post pictures on social media, this place is perfect for you! (There's a promotion of 10% off for dining in untill 2/28)", "author": "Hope C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-05-23", "description": "Best described as Taiwanese street food. I tried the three buns combination. The pork belly was wayyyy too salty and overwhelmed everything. The fish fillet (literally; on a bun) tasted like microwaveable fish sticks. Chicken fillet tasted like mc chicken on a Bun, also tasted microwaved. The meat lover was nothing special aside from the 19$. Noodles were overly dressed in sauce, sausage was different( in a bad way), steak was alright nothing special. The fried pork chop was actually not bad but I wouldn't go back for it. Overall 2 stars. Overly seasoned. Decent customer service.", "author": "Jimmy C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-04", "description": "Omg best beef noodles I ever had in SF. They also serve a variety of desserts and small bites that from Taiwan. Super authentic and great value! Also, they're currently having BOGO BEER!!", "author": "Dax T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-01", "description": "The sizzling beef noodle plate is to die for. Our server Eddy was so nice and attentive. Will definitely come back, love the environment. Also, a fan of the Taiwanese Passion Fruit beer! Cheers, yelpers!", "author": "Adriana C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-25", "description": "Nice place! remind me how good the Taiwanese food is! Also it's an awesome place for taking pictures and for a meal. I ordered the beef noodle soup and it tasted just like the original ones in Taiwan. Also tried the pork belly bao, highly recommend this one!", "author": "Jimmy W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-20", "description": "Great place for Taiwai food. The milk tea is awesome.", "author": "Tianhui W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-06-01", "description": "This place has a lot of MSG. Very thirsty from eating the Porkchop over rice", "author": "Jennifer T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-06", "description": "With few decent Taiwanese authentic dishes, but some others were just OK.  The beef noodle soup was way too salty for me.  Giving three stars for reasonable prices.", "author": "Jess M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-19", "description": "amazing gua bao！ both spicy and traditional Bao Zi are tasty. And the rice noodle soup has rich flavor in soup so every sip of noodle is with the flavor. The store has a vintage style decoration. It feels like go to a snack store in he neighborhood. Amazing ambience.", "author": "B Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-04-14", "description": "To the restaurant owner: big mistake putting in that gigantic counter. Takes up too much real estate which you're not making $$ on. Get rid of that candy clutter.  You're not selling $1 candy, you need to sell tables.  On a busy Sat night with a good line of customers on the wait list, that counter space is completely wasted when no one sits there and when you could have placed tables instead. Improve your speed of service to turn tables faster.  You're missing out on $$.", "author": "Judy H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-29", "description": "rice noodle was good\npork belly over rice was a bit salty\ngua bao was good", "author": "Diane W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-01", "description": "Food is not that special but the view and atmosphere is really great. If you want small snack with a beer, here is the place to look for. The service here is really nice. Even though you are on the waiting list, but the waiter really pay attention to you, he will ask if you need water or anything he can help when you are waiting.", "author": "Vi N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-03-30", "description": "Being a big Taiwanese food fan. Knowing there's a new Taiwanese restaurant opened in San Francisco is definitely a good news in my mind! After reading all the raving reviews on yelp! I decided to check this place out! The theme of the restaurant definitely reminds me of the 80s, which is similar to the theme set from class of 302 down in LA. Due to soft opening, the menu is limited, I didn't see anything Taiwanese dessert such as snow ice or boba drinks. I ordered the potato leafs, beef noodle and mi fun! My first sip of the beef noodle soup def reminds me of spicy bean paste, soup itself is bland and noodle isn't the typical fresh noodle you find in Taiwan! Overall, I will say the beef is tender but still chewy. 3 out of 5 and definitely something I will not order. As for mi fun, it reminds me of instant noodle soup packet mix with hot water, add mushroom, green onion and rice noodle! Bland and not flavorful! Lastly, the potato leaf is actually very good. But overall, I was disappointed! I guess I will continue to drive down to South Bay whenever I crave for Taiwanese food.", "author": "Aaron L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-03-21", "description": "The main reason for the 3 stars is that the braised beef meat was too tough to chew. Otherwise the food was pretty tasty. Lots of flavor.", "author": "Jc B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-03", "description": "From the perspective of a Taiwanese American, this place is awesome.  Pretty authentic (I didn't try the fried mac and cheese balls, or other fusiony items  on the menu).  The minced pork rice and gua bao are pretty darn good. Good flavor for the beef noodle soup, but the scallion pancakes were nothing special. I also liked their green tea, although I'm sure they're going to get a lot of questions on where the tapioca is because you'd think a Taiwanese restaurant with an extensive tea drinks menu would have bubble tea.  Clean, cute decor, and great service.  This is the best Taiwanese food I've had in SF, and maybe the entire Bay Area.  Highly recommended!!!", "author": "Rob L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-31", "description": "Great food, excellent customer service from the young man working there. Pork buns are great and recommend the Sao bun with Taro Ice cream. Moreover, the wait can get a little long since it is a smaller place, however it is worth the wait. Prices is reasonable and the beers are good also. All and all 5 out of 5.", "author": "Jean-Carlo D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-01", "description": "ordered the pork belly bun and was excellent.  also ordered beef stew noodle and ground pork over rice.  they were very good also.", "author": "Phillip L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-25", "description": "Never been to Taiwanese Restaurant before but in love with the food they have!! The quality of food and Service are amazing. Highly recommend to those who live in the Bay :)", "author": "Na Gyeong L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-07", "description": "YUM. We came here for the first time on a Saturday night for take out (and thank goodness we did because the line for dine in was massive), and the food was so good we came back the next day for a round 2. I've had both the tomato beef noodle soup and the braised beef noodle soup, and prefer the braised beef. Both soups are very similar, however, and the texture of the noodles was spot on. The braised beef soup definitely has a spicy kick to it which I loved. We loved their yam leaves dish as well. The pork belly rice bowl was a bit lacking, but decent. I wish there were more veggie options on the menu (I think yam leaves was the only veggie dish if I recall...). I wish the restaurant fit more people (is the center table/bar really necessary to sell $1 candies?) But overall, very happy with the addition of this Taiwanese restaurant to the neighborhood, and we hope it sticks around! (Especially given that previous restaurants in that same location fail every few years :( )", "author": "Sophia L."}
