{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-29", "description": "I walk my dogs twice a day in Washington square park, this place is great for a quick coffee while hanging around the park.\n\nCoffee:\nThis place, even tho small, has a great variety of coffee and beverages. I have yet to be disappointed by a coffee choice light or dark. The pour over coffee is very fast and they can do a few people at a time.\n\nService:\nThe staff is super friendly each time I go. I have had a different person each time I visit and it's always someone super helpful with my coffee choices. \n\nCost:\nPricing is inline with the area and I think a great value.\n\nOverall:\nA great place for coffee and I would highly recommend to anyone!", "author": "Robert R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-20", "description": "ColdBrew on a hot day! \n\nWe found this place by simply walking past it. When they say it is a hole in the wall, it is literally a hole in the wall. And we liked it for that very reason alone. \n\nThe selection wasn't bad for being such a small space. So we decided to go with the Coco cold brew. We didn't know that it came with a whole hollowed coconut. So we use the coconut water and the coconut for our cold brew, and it was delicious. Have I had better cold brew? Sure. But the whole coconut experience made it fun and different.\n\nOn the way to work or just strolling into your next meeting, this would be a fun little place to swing by.", "author": "Adam H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-07-15", "description": "Had the opportunity to stop into this literal hole in the wall coffee spot after grabbing breakfast food nearby. They offer a surprising variety of pour over options, as well as beans for purchase, within it's small location.\n\nI ended up ordering their regular ice coffee beverage ($5.00). Nothing too crazy, but definitely gets the job done. The one server here was extremely hospitable and also gave us tips and recommendations for other places nearby (since we were visiting).\n\nI'd definitely recommend it if you're looking for a coffee spot in close proximity to Washington Square Park.", "author": "Nicholas C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-27", "description": "Love it. I just have that to say. I always go there when I can in the city and I never go when I'm in a hurry. My view of this place is nothing short of perfection. I just love how small the place is and I've never personally had a bad experience there.", "author": "Blaine J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-23", "description": "Awesome place for a grab and go coffee spot. I honestly love how the barista serves your drink by having the coffee grounds poured over coffee cups that have holes on the bottom of the glass to either another cup you want to drink there or in a to-go cup. \n\nTheir menu is simple and straightforward, and the barista are helpful and will make sure you secured your lid on your to go cup.", "author": "John Kevin G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-05", "description": "Get the \"north beach\" coffee! The red head is also a good order of you like a more citrus-y coffee! You can text orders ahead and the staff is really fun. Best coffee in north beach!", "author": "Katie B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-20", "description": "Wonderful little spot in a very unassuming location. There's only one person working at a time and never a line. I've only had enjoyable encounters with the staff and coffee. My only knock is that the coffee is a little on the steep side- $5 for an iced coffee.", "author": "David G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-20", "description": "Charming small coffee place. Came on a Thursday morning to get a Cold brew and a red head coffee for my fiancé. \n\nThe service was terrific and quick. I love the idea of hole in the wall. They have almond milk which is a huge plus. The only thing I didn't like is that they don't have brown sugar. They only offer syrups. \n\nDefinitely will come back and they take AMEX.", "author": "Leandra D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-19", "description": "Cute little cafe! It's literally a hole in the wall!! The barista was really nice and of course the coffee was good :)", "author": "Mi kyung Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-26", "description": "This is a such lovely place in my neighbor. I walk my dog every morning so i text ' a blonde please' then they text me 'you got it'. Then i get dressed and let my dog pee and pick up the coffee and walk around the Washington Park sipping coffee. It is Love!", "author": "Jiyoung L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-30", "description": "Gotta do a pour over here, it's legit. You stand on sidewalk but somehow it's still super relaxing. \n\nBought beans they were great too. Do stop by when you're around.", "author": "Javier A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-12", "description": "My family and I parked near this coffee shop on our way to The Stinking Rose. We all had a good laugh at how tiny it was (it's literally a hole in the wall). On the way back to our car we decided to stop for coffee and everyone was blown away by how good it was. My mom is very picky when it comes to coffee and she loved it! It's not cheap, but it's worth every penny if you're looking for an afternoon pick-me-up or a cup of energy to kickstart your morning.", "author": "Ashley Q."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-02", "description": "Really cute spot. Got the blonde pour over $3.50. Added a little bit of the vanilla syrup (free) and some almond milk and it was a lovely cup of coffee. Love the name of the place and can't wait to go back and try their cold brew. Supporting local joints warms my heart. Coffee places are especially soft softs!", "author": "Cicely T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-04", "description": "Place is one step removed from a Harry Potter closet, but the coffee is thoroughly decent.\n\nThe staff is consistently professional and all seem to be pros.\n\nChill vibes relaxing on the sidewalk chairs. I dig!\n\nAnd, anyone can TEXT an order in ahead of time and they'll have it set and ready when you arrive.", "author": "Brian M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-08", "description": "This place wins most appropriate name ever. Literally a 27-square foot coffee shop cut into the side of a building, and it is super convenient, reasonably priced, and good quality. It's definitely a to-go place, though if you so choose, there are a few chairs on the sidewalk for lounging around. \n\nAll of the coffees are pour overs and are $3.50 a cup. I went with the brunette which the barista recommended and it was a solid cup, strong but not overbearing. Also, you can't go ordering yourself a chocolate chip cookie dusted with sea salt. A tad too much salt but it hits the spot nonetheless.", "author": "Jason S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-31", "description": "Walked down to the bottom of the hill, delighted to find this literal hole in the wall. The gal working was delightful, even given the power was out. \n\nShe helped me decide what to order, and provided some friendly small talk while I waited for the two cups of coffee. \n\nI think she made us two cups of the redhead, given I am a redhead it was a wise choice.\n\nCoffee was delicious, not needing anything but a dash of almond milk. I'll be sure to stop back by HITW in my next visit to SF.", "author": "Jennifer W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-29", "description": "Terrific cold brew and free cookies courtesy of Homesteadcookies.com woke me right up after an early morning flight.", "author": "Katherine G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-29", "description": "Picked up a Red Head from Hole in the Wall. My first time. She was legit. Will swing by next time I'm in the hood.", "author": "Daven D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-13", "description": "It's been said many times before, but it warrants repeating...\nNorth Beach pour over.\nNot to mention that this is actually the ONLY pour over in NB.\n\nThis neighborhood is full of old school Italian cafes w extremely seasoned baristas.  They're steeped in tradition & history, or both.  Almost all are fantastic (almost).  But, if you want something more modern, you'd be at a loss.\n\nThat is, until you come here.\n\nA sliver of a space, w a lot of charm.  Exclusive real estate.  There's all of 6 seats.  That's all.  And, it's a kiosk, so you're outside.  \n\nThe Pookie is a must try.  A shot glass of coffee sweetness.  Literally.\n\nYou can get a pound to take home.  You can get some madeleines to nosh.  \n\nYou can also get some good conversation to go w your good coffee, which is the real treat.  \n\n4 stars.", "author": "Veronica M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-28", "description": "Precious! Worth the walk up those crazy stairs. I had one of the best green teas I've ever enjoyed in my life. The barista was incredibly friendly & gave me some nice SF site seeing tips. Can't wait to go back & sample the coffee!", "author": "Natalie B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-01-23", "description": "Don't waste your money on the tea.  I went here with my friend about two weeks ago, she used to go here frequently (but doesn't plan on going after our experience).  Before we ordered, my friend mentioned that they had a really good loose leaf green tea and recommended it.  We ordered two cups (for $7 total!), and the barista proceeds to put down the jar of loose leaf black tea that she was holding from a prior customer and pick up a ziplock bag with ~3 tea bags inside.  We couldn't see what type it was at first, and we were handed two cups with boiling hot water (way too hot for green tea, this type of water makes the tea bitter and ruins it) and tea bags with the labels hidden/tucked in a second cup.  It turns out the bags were from Twinings, a very cheap tea and you could get a whole box for the price charged for one cup at Hole in the Wall.  \n\nAt $3.50/cup, please inform your customers when you run out of your regular tea rather than giving them an exceedingly poor quality substitute  so they have a chance to order something else or save their money.  If you were out of your regular coffee would you just silently give people instant Folgers instead? Proceed here with caution...", "author": "Alyse K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-19", "description": "Stumbled upon this literal hole in the wall in my morning walk to Coit Tower. The owner and barista was finishing up a smoke break and casually made her way back to take our order. Perhaps it was the hints of tobacco residue or maybe it was just great coffee, but the cold brew was delicious. It was a perfect blend of smooth and creamy with hints of chocolate notes. Would highly recommend for a perfect morning cup of coffee.", "author": "Aaron C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-18", "description": "Coffee - They do drip coffee. Don't worry - vegan milk options are available, too! Their brunette roast was lovely.\n\nService - Best I experienced in the city. They're all about saying hello to anyone who walks by, and encourage strangers to have conversations instead of gazing at their smart phones. How refreshing!\n\nAmbiance - Amazing little place! I am so happy that we gave it a try. Literally, this coffee shoppe is a hole in the wall.  Grab a cup and take a picture behind the counter with the barista while waiting for your coffee to brew.", "author": "Shannon H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-01-28", "description": "They were out of espresso so the lady suggested a cold brew, pretty sure it was 90% water. Wasted 10 bucks on really crappy coffee with really crappy service", "author": "Emilee R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-23", "description": "First time there today, just moved to the hood. I Had the redhead pourover, great flavor, can't wait to try the other brews and start buying beans there. Thanks!", "author": "nathan r."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-12", "description": "This place is awesome! It's the first outdoor coffee stand I've been to. The atmosphere is clean and small, and the service is immediate. The blonde coffee is the most powerful yet smooth one they have, and it is truly tasteful. There's only a couple seats, but the city is so busy anyways that nobody is really sitting.", "author": "Elizabeth G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-02", "description": "Hole in the wall, literally.\n\nI had the blonde.\nit was so good, I keep thinking about", "author": "Rudy H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-16", "description": "I think it's pretty cute how this place is literally a hole in the wall and all of the creamers are named with that theme in mind. The coffee is pretty decent and the service friendly. It's a bit expensive, but I guess not that much moreso than other coffee places. It's conveniently located right around all the restaurants and bars.", "author": "Jenn T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-01", "description": "Absolutely great coffee and friendly staff. I visited on my last day in the area and which i had gone sooner so i could have enjoyed it every day i was there.", "author": "Nicole M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-02", "description": "Julian's weekend routine: Wake Mom up early. Get in stroller and head to Hole in the Wall Coffee for a North Beach or Redhead pour over.  Don't forget the warm chocolate chip cookie sprinkled with sea salt. Make sure chocolate gets all over face. Chat with Connor, Nick or Markelle. Listen to Frank Sinatra. Pet some cool dogs. Talk to neighbors. Decide to come back later for a coconut.", "author": "Erin H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-15", "description": "Good vibes and coffee, exactly what was needed!  Organic coconut water was great too!", "author": "J H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-14", "description": "This was a great find on Yelp after getting off the plane and  having breakfast. We walked right up to the window and the man who helped us was super friendly and nice. We talked for a while while he made our pour overs. Great spot for a caffeine fix!:)", "author": "Abby F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-25", "description": "If you find yourself in need of quality caffeine from a neighborhood vibe atmosphere, this is the place. If you look around Washington Square Park on a sunny day, and you notice all the locals drinking cold brew - that's Hole in the Wall. Give it a shot & strike up a conversation, 5 stars all around.", "author": "Marcus T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-01", "description": "This place is adorable. I thought it was closet space converted into a coffee window, but the girl who worked there told us it was made to be a street vendor type of thing! There used to be a key guy, and a shoe repair guy business prior to this little pour over coffee place.\n\nI had the redhead, light roast. it was delicious! Great stop after brunch at mama's and perfect for some weekend people watching. There's a few stools and an awning to protect you from the sun and rain. Love the idea of this place, and a great neighborhood spot!", "author": "Joanna S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-12", "description": "I was super excited to have stumbled upon Hole In The Wall Coffee, LITERALLY in a hole in the wall. I loved that it is more than just a barista and their gadgets, but instead it is a person that serves coffee to locals and guests that she knows by name. The coffee is made very personable and it creates a much closer experience. \n\nSo I asked for a light roast coffee. I was happy with the smoothness and low acidity. I was surprised that it kept me warm on this cold day and even after it cooled down, the coffee did not have too much of a sour taste. I always liked Reveal coffee, but I like it even more after having it from the Hole In The Wall.\n\nI am quite impressed that there isn't much space that is needed to create an amazing experience between barista and guest.", "author": "Linda K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-12-08", "description": "One of the smallest coffee shops I've ever been to. If you want to sit down, there are a few stools outside but there is no inside space. That said, it's literally a hole in the wall, which is neat.\n\nThe menu is limited, and when I visited there was only one option for iced coffee and it was $5. It hurt my wallet and heart to spend that much on a small iced coffee.", "author": "Nick K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-04", "description": "Just go. Best coffee. Get a Pookie shot or two and talk to Nick. You won't be sorry.  We went back the next day to get more coffee and more of Nick' great story telling.  Just go!!!", "author": "Laurel T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-19", "description": "HUGE SHOUT OUT TO JESSIE!! \n\nThis guy is awesome! he's one of my fav baristas of all time. This coffee joint is dope!! I love the simplicity of the stand and how vibrant it is. This spot is great for a quick pick up, a short chit chat, and a spot for great local coffee from SF's own Reveal Coffee Co.\n\nMe and my fam had a great time getting to know Jessie and also taking pics with him. He's an outgoing guy from Austin, TX and he loves what he does! This is what makes this coffee spot a hidden gem! I consider this to be in my top 10! The experience is great here!\n\nI'll definitely be coming back to hangout and sip on some nice cold brew!\n\nThanks Jessie!!", "author": "Allister D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-05-17", "description": "On my way west mounting Telegraph Hill (dog in tow), I wished for a window coffee place.  On the return trip, by chance, I found HINTW.  Cute place and nice service, but if you charge $5 for a small cold brew - fill it up!", "author": "T-Bone L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-18", "description": "You can literally walk past it but don't be fooled! They have some pretty good cold brew iced coffee :)", "author": "Jessica Mae T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-06", "description": "Coffee was on point.  Got the blonde (light roast) and the redhead (medium roast).  Great coffee and tips to the local food stops and watering holes necessary for tourists such as ourselves.", "author": "Abraham C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-04", "description": "I like my coffee with friendly service.  You should too because cold brew coffee is meant to be savored and enjoyed.  Caffeine is a religion and HITW serves my faith.  I love that Nick is friendly and gregarious and says hello to all passerby and dogs.  If your dog has \"been around the block\" then they get treats too.   And go get a Pookie shot.  Then start your day with your flavor of choice.  I personally like a darker roast, so Brunette hits the spot. But be daring and try a Redhead. Or try them all.  But go say hi and start your morning right.", "author": "Adrienne M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-13", "description": "Such a cute coffee spot. Love ordering a coffee and lounging around, watching all the passersby. I wish more cute places like this would open up in the neighborhood.", "author": "CaliGirl X."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-03", "description": "The name of this coffee place is what it is, literally!\n\nI got their North Beach Blend and their coffee is strong, yet smooth.\n\nIt's simple.  Get your coffee in a hole in the wall!", "author": "Tiffany D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-13", "description": "This is totally the best coffee in San Francisco!  Markelle makes the best cup eva! It's such a nice place to sit out and listen to music while enjoying a really good cup of joe.  The dark roast was rich and smooth, not bitter like most dark roasts.", "author": "Dee K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-27", "description": "First time having the coffee here! Pretty Darn Good! Coffee was very bold I like that!", "author": "Paul R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-15", "description": "A neat little coffee shop that is literally a hole in the wall. They serve pour over coffee and many different types of beans are offered. I got a pizookie or pazookie which is served in a shot glass. I thought it would be a 12 oz sorta deal but I was wrong. Regardless, it was pretty good and different. Coffee Concentrate and Cinnamon flavoring and something else. Worth $2? YEAH , gotta try something new once in awhile. I will be back to try their pour over. Neat little shop right next to a bike shop. That is pretty RAD.", "author": "Brian C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-02", "description": "TL;DR. Come get some stinkin' good and strong pour over coffee here. It's real good and worth a try if you're in the area.\n\nNow, unnecessary story time.\n\nSo here I am, arriving in Chinatown this previous Saturday at 8:30am in the morning when I have lunch plans with my friend at noon. I feel like grabbing a cup of coffee before situating myself on a nice reclining chair at my grandmother's apartment to take a nap. I suddenly remember passing a hole in the wall coffee shop about a month prior. I find it where I left it and silently giggle to myself as I realize that it's legitimately named Hole in the Wall Coffee. The name fits quite nicely since it's like a janitorial storage room for an apartment complex with a hole drilled through the outside to be repurposed as a coffee shop.\n\nI'm not a big fan of pour over coffee as opposed to espresso based drinks, but I'm already here so I order the brunette which is the dark roast. The one barista here does the pour over process in front of you and is very amiable to talk about where the beans are from and what not. There was no line when I first got here but by the time my drink was ready, there were possibly 15 people standing around this little coffee shop so it can start to get busy. There's a couple of chairs on the sidewalk to sit on, but not much. On a little table outside, they have the typical creamers, sugar, and syrups to add to your coffee (including almond milk). \n\nNow that I've wasted two paragraphs of your time and energy, I now drink the coffee and as Emeril Lagasse likes to say, \"BAM!\". It is strong, but oh so good. The dark roast is truly dark as I could really feel the caffeine running through my veins far more than I would from an espresso. I got back to the apartment in Chinatown and that nap was impossible to get. I've managed to fall asleep in bumpy swervy car rides, standing up in the shower, and once in a loud booming rock concert, but this coffee kept me up until the great caffeine market crash of 1pm. I'm lying there in this reclining chair, staring into the deep dark abyss of my $3.50 cup of coffee, deep in thought about the perplexing existence and nature of Javascript while texting my college roommate about kdramas I never watched and how his friend he always buttdials is doing. Strange stuff. The coffee here will really keep you awake!", "author": "Joshua M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-28", "description": "Amazing coffee. The Redhead cup had hints of cherry and chocolate in it and was delicious. Service was amazing, we chatted with our barista who talked to us for a long time. Amazing decor and vibe. Loved it. Must visit", "author": "Conor F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-13", "description": "I've been drinking coffee for well over 45 years, and this is a solid cup Joe, pour over takes a bit of time, but if you can be patient you'll be rewarded, I guess he only downfall would be parking, but it is smack dab in the middle of a neighborhood.\nStan", "author": "Stan W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-05-14", "description": "Coffee tasted good, the guy pouring was friendly and looked like Adam Richman, but standing on the sidewalk and spending close to $4 for a cup of coffee in a paper cup is not going to be in my \"daily grind\". With little overhead, except for the coffee, \"Hole in the Wall\" must be raking it in, and good luck to them!", "author": "Dennis C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-08", "description": "Best coffee shop ever!!! Awesome friendly neighborhood folks. The barista is awesome. She gave me some extra coffee grounds for the road when I told her my grinder broke. \n\nI would recommend the blonde roast!!", "author": "Henna A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-29", "description": "Literally a hole in the wall - this coffee joint is located along the North Beach area of SF. I ordered a pour over Brunette and was pretty happy with it. I like the fact that they have simple syrups instead of sugar packets too.\n\nNice convo while waiting for your coffee on a Sunday morning = win", "author": "Willy W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-21", "description": "Good coffee in North Beach? What is this??\n\nPretty happy I kicked off a quick yelp query and found this because I was dreading about having to hike to either Russian Hill or somewhere further than North Beach where I was for good, new-age coffee. \n\nI feel like new-age coffee is like a thing now, especially in North Beach where a lot of great and well rated cafes that serve coffee are typically the old school italian style. As much as I may love Italian foods & wines, I'm just not big into their coffee. I think its just ok.\n\nIn comes Hole in the Wall Coffee to rescue this area from the perpetual dust settling on the old school espresso machines everywhere else. They do pour-overs, espressos, and lattes! A much welcome addition to the neighborhood for certain!", "author": "Lorrie M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-28", "description": "Literally hole in the wall coffee. Its like a block away from Mama's on Washington Square, I went and grabbed two coffees while my partner was waiting in line. I wouldn't say the coffee is too special? I got the blonde roast but I think its good if you just need some caffeine to wake your ass up in the morning.", "author": "Andrew J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-16", "description": "This cute little (it literally is a hole in the wall) place is super close to my house ... great find! They serve single cup coffees. I got the cold brew coffee ($5) & she recommended putting some almond milk & vanilla simple syrup in it ... so good ! I will be back !", "author": "danielle a."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-18", "description": "Very friendly! It is literally a hole in the wall. Small coffee stand with delicious coffee. Try the blonde roast (strongest) with the vanilla sugar syrup.", "author": "Eva P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-17", "description": "Yup. This is a thing. I had no idea such a place existed until I arrived to meet up with friends next door and was a bit early on a Sunday morning.\n\nCoffee - definitely top notch. Simple options, a wonderful brew, the hipster vibe I yearn for when choosing coffee joints. They even had almond milk to drink it with. \n\nThe barista - couldn't be more chill and friendly!\n\nWhat an economical business! Literally - a hole in the wall.", "author": "Meaghan H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-16", "description": "This is the coolest little coffee shop that is literally a hole in the wall. No really. There are two bar stools and a chair on the sidewalk pulled right up to the wall. That's all. Well, there's also a garbage and a bowl to give your dog some water. \n\nThe inside feels like a true, hipster coffee shop. Not that you can go inside. Remember, this is a simple hole in the wall. But at least you can glance in.\n\nCoffee tastes fine and packs a punch. \n\nI had the $5 cold brew. A little pricy, but okay when you factor in the ambiance.", "author": "Alex K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-24", "description": "Free pour coffee, great conversation, and splendid location! Who could ask for more? The owner Zac is such a pleasure to chat with and the coffee (Reveal coffee) is very tasty! I'm cuban, so I like my coffee strong and with lots of tumbao (listen to Celia Cruz and you'll get it) and I find Reveal coffee definitely has that!\n\nLocated in North Beach, it's great to grab your cup of coffee and go sit in the park and get some good people watching in. I also love the fact that it feels like I'm back in Latin America, walking the streets and stopping by my local cafetero for my taza de cafe.\n\nCheck this spot out!", "author": "Carina M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-29", "description": "The pookie was delicious, so unlike anything I've had before. Definitely worth a try! The service was very friendly and felt like it was a local neighborhood favorite. It will take several minutes for the coffee to steep, especially the blonde roast. The sign said you could text your order ahead if you are in a rush.", "author": "Annie K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-01", "description": "Name is accurate. It's quite literally a hole in the wall. Great coffee, delicious cold-brew, friendly barista, and homemade vanilla syrup. Grab a coffee and go people-watch in Washington Square and you'll have a delightful afternoon.", "author": "Ti Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-06", "description": "Excellent coffee. If you are a true coffee fan, this is the spot. Great beans done right by the pour over method. So good you don't even need sugar or cream.\n\nDo note that if you drink espresso, etc than this is NOT your place. They only serve coffee", "author": "Robert P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-25", "description": "First time, I had a great cup of the \"North Beach\" coffee on a lazy Sunday. Very good, and neat concept for the storefront! Their beans are based on Kenya coffee, which is my favorite (except for Yemeni beans, which are hard to find). Had to skip getting a coffee when the barrista ran out of the hole in the wall, leaving customers stranded (and I was in a rush). Must be hard to not have backup to help, to get more change, etc. But, it is something to be aware of for customers. (minus one star)\n\nThey are basically selling coffee made with the same process that the Chemex has been making available since the 1940s (and the filters make the difference), but only now is being 'discovered' via Philz, Blue-bottle, etc.\n\nPrice is way reasonable (around $3.50). Tip well!", "author": "Jesse A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-09", "description": "The place is great, and the coffees are delicious.\n\nHowever, please consider changing the names of your roasts. I'm sure I'm not alone when I cringe a little hearing people discussing their preferences of 'blonde', 'brunette', or 'redhead'.\nBlonde is a classic roast name, the rest sounds a little douchey.", "author": "Sofya M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-05", "description": "Love this place- going here really makes me feel like a local of North Beach. Red head is my favorite. They recently upgraded and now take credit cards. Days when I don't stop for coffee the guys that work there still say hi! Super great spot in NB.", "author": "Taylor P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-03", "description": "After visiting the famous Tony's Pizza, my husband and I were on the hunt for some 'to go'  coffee on our way to a concert. Hole In The Wall popped up as being just around the corner. This place is a literal hole in the wall. It's a fantastic use of space. This is a 'pour over' style joint. I am from the East Coast this is was a new yet delicious thing for me. The pour over takes a little time to brew, and gave us time to chat with the barista serving us.  She was cheerful and knowledgeable about the coffee and the surrounding area. We tried the Red Head and the North Beach with a little almond milk and no added sweeteners. The Red Head was a little sweeter tasting with almost a little fruity flavor. The North Beach was a darker bolder brew. We loved both! Thanks for staying open a little after 6 for us Hole in the Wall!", "author": "Nancy N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-18", "description": "I love the idea of this literally being a hole in the wall, and the owner seemed really nice.  This impression was solidified by seeing a couple of regulars drop by.  It's solid pourover coffee; I ordered the brunette.  This is definitely a better place to get your coffee than Starbuck's especially if you care about shopping local and not drinking burnt coffee.", "author": "Jennifer O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-30", "description": "This place is awesome! love the cold brew, pookie shots and pour overs. Markelle is possibly the coolest person in north beach. So if you want some good coffee and wanna hang out, come chill here.", "author": "Mark R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-08", "description": "Super nice guy comped a delicious cup of coffee for my birthday.  Must admit I was bummed that such a highly rated coffee spot was literally, a hole in the wall!  But, quality and conversation made up for it, great start on what ended up being a bit of a coffee crawl in North Beach!", "author": "Karen M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-08", "description": "This place was so cute! We literally just ran/walked into it on our way to brunch and we just stopped to admire the concept. Being a regular tourist to the city, this sort of a place fits perfectly for SF. We got a cup of the brunette, which is their medium roast. For someone who is usually not a fan of black coffee with milk and syrup added, I actually loved the taste! If I was a local, I would stop by every morning to pick up a cup of joe before work!", "author": "Saumya S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-29", "description": "I can't tell you how happy I am that I found this place. This is the perfect neighborhood place. The owner, Connor, is as gracious as he is hilarious. He greets everyone who passes by. The cold brew was delicious and so was the Red Head, an Ethiopian with a great taste of blueberry. Even though it's out of the way, I will be back.", "author": "David G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-07", "description": "Excellent spot to stop by for coffee while on Union Street. They do a pour over drip very well. I always get the blonde roast though they have a darker one. They will not serve decaf (and why should they?).\n\nThey are very friendly and happy to chat while they are preparing your drink. There's even bar stools for you to sit at.", "author": "Victor W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-04", "description": "Literally a walk-up window that happens to have 2 stools.  No lattes...only iced coffee.  No coconut milk but they have almond milk.  Excellent coffee.  Cool spot.", "author": "Jen M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-16", "description": "Best coffee in North Beach!  New go to coffee place in SF.  In my opinion this is as good and may be even better than Gorilla coffee in NYC.", "author": "Ricardo M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-19", "description": "REALLY EXCELLENT COFFEE. I honestly think this might be the best drip coffee in the city. It's super simple, and very tasty. I usually get the blonde (their lighter roast), but I recently switched over to the brunette, and found that the brunette actually has a yummier smoother taste. I wish I lived closer to Hole In the Wall - then I would be coming by here every single day!!", "author": "Jeanette S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-05", "description": "I came here with a group of six coffee snobs and we all LOVED it. We were randomly walking by, decided to try it out, and were so glad we did. I got the red head and it was fantastic. We met the owner and he was super nice. I wish I lived in SF because I would go all the time.", "author": "Cami H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-31", "description": "There is so much to like about this place. The owner, Connor is just a great guy...funny and engaging. And this place fits so perfectly in North Beach, which does not allow chains or conglomerates. It's just a small, little coffee shop with some chairs on a beautiful street in San Francisco. A cup of freshly brewed java consumed on a gorgeous day in North Beach....it really doesn't get any better than that. Support small biz!!!!", "author": "Edward N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-29", "description": "Pros: \n1) it's right by my apartment\n2) I'm a huge coffee fanatic and the Brunette is very flavorful, hot and a great deal\n3) the staff was friendly when I visited\n4) I like the theme - definitely a \"hole in the wall\" but that's all I'm looking for - great coffee.\n\nCons:\n1) there was no coffee IV I could hook up to my veins", "author": "Karl A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-20", "description": "I accidentally left a 2-star review for this coffee shop when I meant to leave it for Beacon. Nick sent me an incredibly nice message to let me know (considering he could have been angry about it). That's great customer service! I'll be sure to try and stop by sometime.", "author": "Sara S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-07", "description": "This place rules. Great pour over coffee and the perfect little break from waiting in line at mama's. Highly recommend!", "author": "Brandon L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-29", "description": "The Hole in the Wall is a pleasant little place to catch what I could only describe aa a 'lovingly prepared' cup of coffee.\n\nAbout as small as anyone could imagine  a place of business operating out of a building, you'll find a couple stools to pull up and stay awhile. It's suited as well for that to-go cup.\n\nIf I'm not already tapped out on coffee from Cafe Trieste, I make the Hole in the Wall a regular stop.", "author": "Kevin T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-09", "description": "Hole in the Wall Coffee is much more than that!\nOne must be patient as this is a pour-over-only joint with a single man manning the bar. \nOffers light, med, and dark roast. \nCoffee was well worth the wait, crisp and clean.\nOffers Whole milk, and Almond milk, simple and vanilla syrup. Only in SF...", "author": "L A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-09", "description": "Great coffee. Very Strong (without the jitters or headaches), lasting and tasteful. Customer service as it should be. Will be my neighborhood go to when I need a potent, productive coffee.", "author": "Chris K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-24", "description": "Didn't expect it to be a literal hole in the wall!! There were only a few options for coffee, being a pour over or a cold brew. Despite all of that, the coffee was fantastic, and the service was great as well.", "author": "Jacob L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-18", "description": "Cute little pour over coffee bar owned by a photography student. If you just want a good, simple cup of coffee and friendly service, this is a place to go. Great while waiting in line for Mama's brunch just up the street!", "author": "Kaitlin W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-02", "description": "Not only is this hole in the wall coffee spot a 27 sq.ft. place filled with quaint and rustic charm, their coffee is so delicious! I'm so glad I stumbled across this place by accident because now I will continue to go there when I need a quick pick me up or some friendly conversation before work! The service is speedy when you need them to be but this is also a great place to chill on their stools or chairs outside and make some friends! Ask Markelle for \"Pookie\"! Your tastebuds will thank you and she'll play your favorite song on request dedicated just to this drink alone! It totally creates this cool ambiance!!! She's extremely friendly and knowledgeable about the drinks she serves!! I'm also not usually one for coconut drinks but I'd recommend you try their fresh coconut juice! Markelle literally made a straw hole in the coconut and it's tastes so refreshing! Such a great place!!!!", "author": "Briana O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-24", "description": "I stumbled across this spot while exploring the city (from out of town).  I needed to waste a few minutes so it was perfect.  The guy serving was hilarious and inviting....and sat and talked with a local to get some more spots to try.  I'm not joking when I say it was one of the best two cups of coffee I have ever had in my life.  Great find off the beaten path.", "author": "Matt W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-25", "description": "We only had one destination on a Tuesday morning in north beach which was to walk through a building at which we found rock star parking (thank you stu kelber!). We finished our main deed and then said to ourselves after we retreated to our vehicle, \"What's the rush, why don't we celebrate our great space by grabbing a coffee or quick bite?\" \n\nPeering directly across the street, destiny had planted itself as Hole I'm the Wall! Both of us had the brunette and thoroughly enjoyed both the wait and chat with our tall gentleman coffee professional and other patrons, as well as the pour over itself. What a charming stop when you're in north beach and on this comparatively quiet street.", "author": "Ron W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-30", "description": "What a charming little \"hole in the wall\"!! The barista was very nice and helpful with advice on the city. My friends and I all tried the brunette blend. Very tasty. And forget the traditional cream and sugar. We were offered almond milk and simple syrup/vanilla syrup. Going back for more tomorrow morning!", "author": "Safa T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-01", "description": "Wonderful neighborhood coffee spot. Great coffee and friendly baristas? Yes, please!\n\nShout out to Jesse for the awesome service. I asked him if he had enough change for the large bill I was going to use before I ordered. Because he only had small bills, I told him I would go get change somewhere but he told me to just pay him back next time. I definitely came back again!", "author": "Tammy C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-02", "description": "Found them on Yelp looking for great coffee in the area and my mom and I are so happy we found it! It's literally a window in a wall. The coffee is fantastic. We both got the dark roast-north beach blend with vanilla simple syrup. The owner(?) was very helpful giving us directions for a great walking tour to see everything on our way to Montgomery Street. I definitely recommend checking this place out for a great cup of coffee on the go!", "author": "Nakita C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-14", "description": "Convenient, simple, and unique. Was so inspired by his \"pour over\" technique and we bought ourselves our very own set when we got back to the east coast :)", "author": "Ashley M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-13", "description": "Stumbled upon this place while looking for another. Right in the middle of the street. Very fun conversation with the person working there. Even though I had my coffee black, they have almond milk as an option; their sweetener is liquid, and they even had vanilla! Worth checking out.", "author": "Yanira R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-03", "description": "Great way to enjoy the SF Fog and some delicious coffee. \n\nI come here every time I am in north beach. The staff is friendly and the coffee is great. What I love most about this shop is the fact that it's just a tiny window, a literal hole in the wall. \n\nI've tried practically all the main coffee shops in San Francisco and I'm genuinely tired of the same pretentious workers and the same modern decor. People really need to learn how to shake things up and bring a new dimension to coffee. Hole in the wall in a sense does that because it's a place you can either sit and have good conversation or you can pull up grab coffee and go.\n\nMy favorite part is the view that comes along with it. I love the San Francisco fog and I can't help but want to enjoy one of the most beautiful cities in the world. It's refreshing in the morning more than anything and I will be coming back here soon.", "author": "Jacqueline C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-15", "description": "As if I didn't have enough reasons to love my neighborhood, today I discovered the Hole In The Wall Coffee shop. I took an alternate route to work today because sometimes you just need to switch things up and I was pleasantly surprised by what I found here. \n\nAs you walk down Union you'll notice a big blue awning, an open window and a friendly face. This hole in the wall has shutters that, when opened, reveal the menu. They only have coffee but when you're walking to work, there isn't much more that you need. \n\nI ordered the blonde roast and allowed myself the luxury of the single pour over coffee method. It was nice to stop for a couple minutes instead of the usual break-neck speedwalk I do to work. I chatted with the barista and experienced that wonderful small neighborhood feeling that puts a smile on your face. What a lovely change to my usual routine. \n\nHopefully I'll be able to get out the door a little earlier so I can enjoy this neighborhood treasure more often. \n\nI didn't ask about what beans they were using but they were freshly ground and the coffee was delicious. I had mine black and the taste was strong but not bitter, just like I like my men.", "author": "Daisy S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-25", "description": "Very good drip coffee.  Great neighborhood joint.  Reasonably priced.  Friendly Service.  Accepts cc and Square.", "author": "Gloria H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-28", "description": "Great little place, friendly purveyor and great coffee.", "author": "K D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-06", "description": "Excellent spot for a quick fix. Great little conversation and good vibe. Makes the coffee fresh right in front of you. Highly recommend. Keep up the great service man.", "author": "Tyler S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-09", "description": "Stopped by this spot while waiting to sit down at a nearby restaurant. This literal \"hole in the wall\" is great and the gentleman preparing the coffee was very skilled and pleasant. He makes the most of his small space and serves great coffee. Check him out!", "author": "Luke W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-06", "description": "Tiny little shop,  literally a hole in the wall.  Easy to miss but we'll worth finding it.  The hours are a bit odd but the coffee quality is superb.  There is one man who always does the coffee pour-overs and it is a nicely intimate experience compared to other coffee shops.  While the price is a bit steep for a cup of coffee it is worth it for the personal nature of getting your cup as well as the flavor.", "author": "Skyler W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-31", "description": "To date my favorite coffee shop. Friendly service, great pour over at a phenomenal price, and literally a hole in the wall. I will be back", "author": "Jake S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-09", "description": "For coffee lovers who are into \"real coffee\" and not just foo-foo coffee drinks, you know who you are Frappacinno, mocha-choca-latte lovers, this place is for you. It's authentic, it's not a tourist trap, and it's excellent coffee! Whether you have it black or with a touch of milk and simple syrup, the favors of the coffee pleasantly come forward. Besides that, watching the process is pretty cool and the guy working the shop is really nice. I would only say, because it's so intimate and the process is so delicate, it's not a spot for a quick pour and go. If there are a few people, be prepared to have the patience to wait. It's worth it!", "author": "Ritu M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-12", "description": "Delicious coffee, unique pastries and a super friendly owner. Definitely worth trying!", "author": "Rebecca G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-09", "description": "Could do the usual coffee chain when in San Francisco or you could make the creative choice and visit The Hole in the Wall. Excellent cup of java. Place can't be larger than 10 sq ft but it's a must do and not far of the beaten path. Zach's place and he'll most likely be the guy making your brew.", "author": "George P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-28", "description": "A neighborhood gem! I have travelled across town to indulge in many different coffee establishments. I find Hole In The Wall to be a classic San Francisco staple. The service is great, the coffee is delicious and the entire concept is a unique experience.", "author": "Kevin F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-17", "description": "You may just miss this spot if you walk by too fast; located on Union street right off of Grant, this \"place\" is actually a woman serving coconut water and coffee out of a window. If there wasn't a huge sign for a menu (probably needed to make it conspicuous since it is right next to Don Pistos, who believe in being lo-hum with their no advertising signs) you would walk right past it - whew that was a big tangent right there.\n\nThere are few filters placed on top of coffee cups that are served to go. The only reason this place is 4 stars is because the woman serving the coffee was spilling it everywhere including all outside the cup which was sticky after I bought it. \n\nShe does have a nice smile though and a similarly cheerful attitude to go along with it. The coffee is nothing special but the experience of buying it out of a window may just make this place worth the price.", "author": "Minks M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-24", "description": "As someone in the service industry I highly recommend Hole in the Wall for your morning coffee! The staff are friendly & knowledgeable about their roasts! My dog & I love to start off our day sipping on a blonde or brunette roast enjoying the local banter! A great cup of coffee reasonably priced!!!!", "author": "Madeline M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-03", "description": "I had the north beach pour over and a shot of the iced coffee and both were delicious. There's nowhere to sit since it's actually just a counter on the sidewalk but the coffee is unreal.", "author": "Casey C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-27", "description": "I love the aesthetic of their shop, it's very cute. It's also very laid back. Their cold brew coffee was a little more acidic than I hoped it would be, but their coffee was good. I wish there was a little more variety to their menu.", "author": "Angela W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-29", "description": "Stopped by when the Cups promo was going and I will be returning. The barista working was very friendly and patient with my order. I don't typically drink too much coffee but I quite enjoyed their cold brew.", "author": "Rando K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-08-17", "description": "Great location and pleased that I lived so close to it! The barista was very pleasant and knowledgeable. Had a to-do drip coffee, North Beach blend (they use Reveal coffee beans). The coffee was a bit pricey. Would go to again, just for convenience.  Wish they had food though.", "author": "Toni J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-17", "description": "Not only is it my Mom's favorite coffee EVER, but Zach is great AND you can order your coffee in advance. Thankful for my neighborhood coffee shop : )", "author": "H H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-24", "description": "This was such a pleasant serendipitous find! Great hot beverages, coconut water (out of the actual coconut itself) some bagels, and great music.", "author": "Kelsey K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-17", "description": "Just when I thought this place couldn't get any better, Zac added iced coffee to his repertoire. Zac is the man and the coffee is the best.", "author": "James B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-17", "description": "Great little place to grab a drink on the go. Awesome drinks and the workers are so nice!", "author": "Kelsee G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-12", "description": "One of the best cups of coffee in the city.  Let the yuppies wait in line for Blue Bottle.  This place has better coffee, a friendlier staff, and a neighborhood feel.  I am there every morning on my way to work.  Stop by for a cup and you wont go elsewhere.", "author": "Justin H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-09", "description": "Their apt name is only part of what makes this place so charming. They serve up two roasts: a light roast dubbed the blond, and a dark roast, the brunette. Both are delicious Reveal coffees, but I have found myself particularly won over by the Blonde roast. It is light and floral, but still has a good kick of caffeine. On top of the delicious coffee, the baristas have been consistently friendly and great company while they are making you a cup of amazing pour-over coffee. Next time you are sunbathing in Washington Square Park, walk a block up Union and check this place out!", "author": "Hannah R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-12", "description": "Great coffee, neat location, friendly coffee dude pouring, and super convenient.  Because it's a walk up, there's no fluff; people on their laptops, crowded loud counter, staff who have a million things going on, etc.  It's just good coffee and that's it.", "author": "Dan J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-25", "description": "Great pour-over coffee , teas and iced coffee. Coffee is Prepared right before your eyes from fresh ground coffee beans. Does not get any better than this", "author": "jeff P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-03", "description": "Great custom blends served by a friendly barista. You really can't ask for much more from the neighborhood coffee hut.", "author": "Feliks T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-31", "description": "Excellent coffee, super cute place, and really great people! Feel so lucky to have this amazing place around the corner! Next time I must try the bagels...", "author": "Maddy D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-17", "description": "Such an excellent little coffee spot! Perfect on those Sunny North Beach mornings! Get their pour over! They do a fantastic job! Highly Recommended!", "author": "George K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-05-25", "description": "I have been living in the hood for 7 years, and this is a welcomed addition. NB has no shortage of coffee, but Hole In The Wall knows how to make it really well. What I love about this place is the simplicity. It's not a coffee house with a billion different options, it's a window into what we used to be. You ask for a coffee, the only question you get is \"light or dark?\".  No sizes, no awkward names, no half caf crap. Just a really nice person serving an incredible cup of coffee. If you are a chai fan, the only place that has a better one is an hour north of the city. Save yourself the time, and check out the hole.", "author": "John P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-24", "description": "Prices are terrific for the high quality of the estate coffees-$3 and teas-$2. Brewed right  at the counter using a direct pour method! Fav in the morning is Irish Breakfast Tea with a shot of homemade vanilla infused syrup. One of my great finds in SF!", "author": "Vince M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-29", "description": "So thankful that I have a grab and go coffee spot that serves a quality cup of coffee without the hassle of a coffee shop.  I've become particular to the light roast, which does not mean light on the caffeine! One cup and I'm ready to battle the work day.  Or weekend errands. Plus Staff is always friendly, which makes my morning that much easier.", "author": "Jaclyn J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-30", "description": "Simple, delicious coffee. The beauty of this place is there are only a couple of choices - you don't get bogged down with 40 different roasts. The coffee is superb and you get the chance to have a nice conversation with the owner.", "author": "David H."}
