{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-05", "description": "This place is great - a crowd pleaser! One of the few bars in SF that has cellarmaker on tap, plus other great beers and they make delicious cocktails. Great atmosphere, usually busy but not overcrowded. Friendly bartenders. Love it!\n\nI also really like how powerful the dryers are in the bathroom.", "author": "Andrea S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-03", "description": "Came here on a whim with a friend after a dinner & was not disappointed. Swanky, rustic vibes with a beautiful interior, I'd definitely come here if you're in the mood for drinks on a fun date night or a casual get together with friends!\n\nI overall just love the atmosphere of Holy Water. Friendly and easily approachable, but also laid back and chill. I came in with the intentions of ordering a Painkiller, but either it wasn't being offered anymore/it was seasonal/off the menu, so I was sad that I unfortunately couldn't try it.\n\nAfter the Gold Rush ($13) (Boubon, Pineapple Gum, Apricot Brandy, Lime) Good, and I can see why it's a popular drink here. However I felt that I tasted more of the bourbon and not a lot of the accents of Apricot Brandy or pineapple gum. Still a pretty good drink and a recommend!\n\nZombie ($16) (Blend of rums, Citruses, Tropical flavors & apparently death in a glass) Definitely for someone who's feeling more bootsy. I overall really liked this drink, and it definitely was a strong one. The description really doesn't lie, it was definitely a strong drink. \n\nTo be honest my favorite part about Holy Water was just how beautiful the ceiling was. I couldn't help but stare at how beautiful the ocean water ceiling was, adorned with the hanging lights. The tables are also candlelit, and the bar stool seats tie in with the rest of the rustic, wooden interior, with the fun accent pops of the wooden barrels.\n\nThe bathroom was also really clean, so that was a plus. There's also 2 TV's here as well so when there's a game it's really nice to chill. \n\nThe only minor downsides are that it's a bit loud, though I don't mind that too much, and also I wish their website would list a menu of what kind of drinks they offer. The only reference I had for drinks were the photos other people took on Yelp, most with dim lighting so it'd be helpful to see a more clear menu somewhere else.\n\nI'd give Holy Water a 4.5. The main highlights of this bar for me were how beautiful the ceiling is, and the drinks are pretty good too. Definitely a laid back, chill bar I'd go to again!", "author": "Allison O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-05", "description": "This place is cool- nice atmosphere and all- but the scent diffuser in the bathroom is suffocating. Makes it smell like a porter potty.\n\nAlso, I ordered a Weihenstephaner  and the bartender said it was \"about 6 dollars\" so I gave him my 20 and got the change and gave him a 1$ tip and then when I left I looked at the menu and re-realized that the price on the menu was $5.... I was overcharged!\n\nBut look up, because the ceiling decorations are really cool!", "author": "Nani B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-19", "description": "Instant Fan! Fun, hip, cozy Bernal Heights Bar, with hip drink menu. Totally digging the Gilda, tequila lime and pineapple buzz....May have to come back and help celebrate their 5th anniversary tomorrow!", "author": "Tara C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-15", "description": "For our third stop on a crawl through Bernal Heights, my group of four decided to check out Holy Water. (I believe a few of us have had this place bookmarked for some time. If not, I know I did at least.) We stopped by on Saturday, March 10th around 5:30pm. There wes a decent amount of people here, but we still managed to find three or four seats at the bar.\n\n*Frisco Sour: bourbon, benedictine, lemon, bitters ($12)\n*Bourbon Breakfast: bourbon, allspice dram, heavy cream, maple ($12)\n*La Paloma: tequila, lime, sugar, grapefruit soda, salt ($12)\n*Black Manhattan: bourbon, averna, bitters ($12)\n*Vieux Carre: rye, cognac, benedictine, vermouth, bitters ($12)\n\nI have no idea how much each round cost, but I'm listing the menu prices above. The menu does state that happy hour is 4pm-7pm, so if it applies to Saturdays, each cocktail should have been $9 instead, which is a great deal! I started with the frisco sour as I needed something lighter after all the bubbly and beer I drank earlier. It was a good twist on a pisco sour. Next up was the bourbon breakfast. A friend had ordered it first, but I found it too sweet, so I asked the bartender to make mine less sweet. This worked out well as I do love my boozy coffee. For the third drink, I ended up with the paloma as the bartender said a friend ordered it. He had a bit too much to drink that day, so I just took it instead of sending it back. I believe in addition to all the drinks listed, someone also ordered an old fashioned? I'm not sure what it was, but there is a misplaced drink in my pix.\n\nFun bar for our last stop down Cortland Avenue. Great HH specials with $5 beers, $7 wines, and $9 cocktails.", "author": "Elena N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-21", "description": "Cute bar in bay shore! My friend and I came for a quick drink after I landed late at night. The place was pretty empty except for two other parties but it was also 1 am. There was a bunch of parking on the street and luckily we got one right in front of the shop! \n\nI forgot the name of the drink I got but it was delicious. All their cocktails are pretty interesting and unique. They also had a bunch of beers on tap - I tried their coffee stout which was very good! It tasted like a Guinness with a bit more coffee flavor. The drinks are a bit pricey but well worth it.", "author": "Mika O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-21", "description": "Came here on a whim with my BF after we had dinner at home. We were looking for something nearby that had cocktails and Holy Water delivered! They have a great list of house cocktails, they carry a ton of whiskey which is great. I tried two of their Mezcal cocktails which were both delicious and the BF tried a bourbon cocktail and a random whiskey off the shelf. All of the drinks were great, bartenders were nice, and I love the feel of this bar - chill/local feel with a hip/swanky feel. Loved it.", "author": "Elaine N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-12", "description": "Nice and dark place, good atmosphere. Nice beers and different liquors. I think too expensive. I tried the Gold Lush and my wife the Painkiller. Good but not awesome.", "author": "Michael M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-16", "description": "Not gonna lie-this place is nowhere near anywhere I go. But...Moksa came on February 10 for SF Beer Week...and here I was.\n\nHappy about it, too. This place has just the right amount of atmosphere - interesting but not too trendy. Friendly vibe all the way around - but to be fair - I know a ton of those people were there for Moksa so maybe they aren't regulars. That's okay. The way they have the tables and barrels set up, plus a food vendor inside, it all made for a comfy, cozy environment. You can actually hear each other talk but the place was still hoppin'.\n\nWould definitely stop back in to check out the regular crowd and bar selection!", "author": "Laurie H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-24", "description": "Went to this bar after seeing all the hype on yelp! Thought it was pretty nice though it didn't blow me out of the water (hah), waiters will make you drinks not on the official menu. got a delicious painkiller per previous reviews).\n\nThe place was getting crowded on a Friday night but it was pretty easy to get a seat around a barrel table (literally around a barrel).", "author": "Christine W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-10", "description": "Totally an awesome neighborhood gem. Holy Water was bookmarked for awhile but Bernal Heights super far out from me. I know I was coming out here to grab dinner at 3rd cousin therefore I made the effort to come out earlier to grab a drink. Since I was by myself, I sat at the bar. The bartender was great. He was friendly, nice and talented. He made a drink with bourbon and coffee that tasted great. It floats too, pretty cool. \n\nI order the PAINKILLER. So pretty and most importantly, it tasted yummy. I needed the perfect picture. Which got me over 300 likes on Instagram. ha! Would love to have order other drinks but I had dinner plans. Highly recommended and can't wait to come back.\n\n$15 minimum for credit card and spiced nuts for $4.", "author": "Sandy B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-17", "description": "Wow! Get the drink that's on fire!!! Just be careful to blow it out before you drink it, lol;) I had a blast here. Bartenders were amazing and fast!!!! Drinks weren't watered down and were of high quality! People were friendly thereI really enjoyed my time!", "author": "NashvilleCutie457320 S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-25", "description": "Great bar! I live nearby, and this is a great place to get cocktails. Not too crowded, dimly lit but not in the creepy way, and the cocktails were good. I ordered a Pimm's cup, and it was refreshing and moderately priced for SF (~$12?). There are all sorts of liquor so the bartender can probably make whatever you want. Highly recommend!", "author": "Thu P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-22", "description": "5/5 Drinks\n5/5 Atmosphere and Bartenders\n\nMy friend and I stopped by here before our dinner reservation and am so happy we did. It has a great friendly vibe and the drinks are made with consideration. It's one of those bars where I would come back by myself just to enjoy the atmosphere and the drinks again, and maybe getting to meet some of the locals living in the area. Great little gem in Bernal :)", "author": "Terrie C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-13", "description": "This is a nice and quiet neighborhood bar with good cocktails.\n\nMy friend and I came here for some drinks and to catch up on a random Tuesday night around 9:30, and it was pretty empty. There were 2-3 individuals sitting at the bar and that was it. It was perfect for catching up as noise levels were pretty low for what you'd typically find at a bar.\n\nI ordered the Search for the Holy Gimlet ($11), which is gin, cucumber, lemon, and sugar, and really enjoyed it. It was a pretty light and refreshing drink that was easy to sip, which is what I was looking for on a chill Thursday night.\n\nThis is the closest cocktail bar to where I live (that I'm aware of at least), so I definitely see myself coming here again when I'm in the mood for drinks.\n\nSeating wise, they have some bar seating and also some private tables in the back. All of their seats are bar seats and don't have backs, which I was a little bit disappointed by since I was hoping to make myself comfortable if I'm going to be here for a while.", "author": "Dianna H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-20", "description": "This bar is pretty fun. It has a tiki vibe. It had a pop up Mexican food place inside so you could get chips and salsa. \n\nIt's pretty loud and they don't have dancing so just beware you might be yelling at your date. \n\nTry the Airmail", "author": "Alex M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-08-24", "description": "For such a small place, why was everyone shouting to talk to one another?!?!\n\nLate night drinking with my friends and my bratty self said I wanted to check out Holy Water. Gawd, I wish I didn't suggest this place. So noisy and loud. \n\nThe drinks were okay, but I had better. Glad I gave this place a try, but I'm not gonna go out of my way coming here again... kthanksbye!", "author": "Owie N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-28", "description": "Super chill bar with super chill staff. It's become our neighborhood bar, walking up on Cortland to have a few once in a while. Each time we've gone, we dealt with Carlos or John, both of who are very friendly and attentive, often coming back to check in on you. Carlos in particular was really good at making recommendations based on what you already ordered.\n\nThe drinks are reasonably priced and they have a wide variety of liquor. It's typically not too crowded on weekday nights, but can get pretty busy once the weekend hits. Dog friendly as well!", "author": "Gabriel R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-15", "description": "Solid service for a quick drink we wanted before dinner. The bartender efficiently handled our tab amongst a room of tabs during happy hour. Well done.", "author": "Patrick O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-15", "description": "What a cool place! We arrived as tourists having found this place here, on Yelp. Thank you fellow Yelpers!\nWe hopped several bars this night and our favorite was Holy Water.\nThe atmosphere, the drinks, and the noise were perfect to our liking.", "author": "Tristan T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-29", "description": "This is a great atmosphere with even better drinks.\n\nWe got a Viex Carre (great drink, ice, and glassware) and a pinot noir (the bartender took the time to note that the pinot was different than listed on the menu and he seemed pretty excited about the change).\n\nFun place to hang out, even late on a Sunday. Really feels like a neighborhood bar.", "author": "Brett S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-10", "description": "Cool bar serving deliciously concocted cocktails in addition to a half-dozen solidly crafted beers on tap in a quaint neighborhood.\n\nStreet parking was reasonably easy to find nearby when we came for late afternoon happy hour with my crew. The stout on tap that day was a flavor bomb with strong cohesive flavors and judicious demonstration of hoppy IBU. My colleagues enjoyed their dry martinis and ruby like sazerac potions... so much that they did not budge for a long time! \n\nLove the dark, modernized spin of a den. Can't wait to return!", "author": "Lu-Shien T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-20", "description": "Love love LOVE this bar. How can you not appreciate a damn delicious cocktail? Ugh, I'm in love. \n\nI've been here both during the daytime on a weekend and nighttime on a weekday. Both times the atmosphere was super mellow and the staff very friendly. Definitely a good date spot if you're looking for something chill or even something more intimate (after dinner at Vega of course). It's always nice to go to a bar that you can sit and enjoy conversation at. This is definitely an all around great spot. Did I mention I love it here?", "author": "Adriana G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-22", "description": "This place has such a great ambiance and the drinks are uniquely delicious!\n\nIt's located on a hidden street in Bernal Heights where only locals really know about. There are about 4 or 5 other amazing bars - each uniquely designed and fresh.\n\nThis place makes unique cocktails created with high-quality but affordable ingredients. Its a great alternative to the busy and crowded bars in downtown. \n\nI definitely would recommend this pace.", "author": "Christopher G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-30", "description": "Have to come back to experience this place again but for a first rodeo I felt a unique spookiness that is engraved by the holy water that might be the potion for a sinful night. Had Carlos as a bartender and my drink was a good mix \"old pal\" like an old fashioned but with rye. \n\nThe ambiance is for meeting up your ex at the local bar as it was funny witnessing a playful trio mentioning their circumstances .. dark, eerie, good drinks to drive deep conversation and close by", "author": "Olivia L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-07-27", "description": "Went to this bar at the reco of a friend. Drinks were fine - we ordered five - but bartender was a jerk when I sent one back I didn't like 3/4 full and switched out for another. He brought the check and said: \"yea you ordered a few more drinks, but this isn't a McDonald's, alcohol is expensive, I have to charge you, I've been making those all day and everyone loved them but you, I gave you a happy hour price.\" \n\nWhen I told him I thought that was unreasonable he charged me anyway. I own a restaurant, alcohol isn't expensive, it's super high margin, and loyalty isn't built on being right, it's built on making customers happy. \n\nNever again.", "author": "Avi D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-06", "description": "Good cocktails, with a mixed menu and plenty of types of beers and other drinks chill atmosphere,dim light, looking around the ceiling has a nice print on it like waves  the chandeliers are old liquor bottles, the staff was nice.", "author": "Branden C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-11", "description": "They have a extensive list of cocktails and a few beers.  I got the Bourbon Buck, it was good and strong.  $11 not bad.  Nice dark atmosphere, it's a tad loud inside and you have to raise your voice a little to talk with your friends.  Nice place to veg out and get buzzed", "author": "Ben S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-08-20", "description": "Eh, it's okay? I like how they have a pop-up inside with homemade empanadas, tostadas to order, and amazing sea salt chocolate chip cookies. I don't care too much for the drinks, however. The tap list is definitely eclectic, but cocktails are on the weaker side. Watching them make drinks let me know that the majority of them are ice baths. This place is also dark as hell and difficult to hang out with your friends inside. Drinks aren't expensive ($8 beers, ~$11-13 cocktails), but because they're weak and actually small in size (served in tall, skinny glasses), they end up being expensive. I was also looking forward to the decor, seeing as how it's supposed to be a church-themed bar. I got nothing of the sort inside. Probably won't be back.", "author": "Danny C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-01", "description": "Meet me in Bernal Heights for drinks?!?! My initial response was where is Bernal Heights and second, why are we going there?\n\nMy oh my was I surprises about the area of Bernal Heights on Cortland street and there are a lot of great shops, a bakery, restaurants and this great bar. I came here NYE after having dinner at Vega up the street. I expected a divy bar with the smell of stale beer to welcome me in after showing the bouncer my ID. Walking in I was shocked about the Edison light chandeliers, fully stocked bar with trendy cocktails and clean walls an eclectic choice of art. The crowd was 20s-30s and lively but it wasn't crowded or douchy in anyway. \n\nThere was a table full of new year's Eve hats, necklaces and sound makers. Some good choices of beer on tap. I had a glass of the pinot noir. Not anything to write home about but it was affordable. The service was on point and they even passed out sparking wine for a midnight toast. It was a great place to celebrate the new year and would definitely come back.", "author": "Linda L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-05", "description": "A cocktail bar where I can enjoy a festive beverage AND bring my furry buddy along?! Have I died and gone to heaven? No, I've just moved to San Francisco. Holy Water has a creative cocktail list with a slightly tiki-ish edge, and a fine selection of wine and beer to boot. They also allow your doggy pals to join you, as long as they're well behaved and on a leash. I was there in the early evening on a beautiful saturday (around 6 pm) and the bar was full but there was ample table seating. For that time of day it was very dark, but I can imagine the gloom gets pretty romantic later in the evening. I'll definitely be returning to this spot with my boo for a more atmospheric evening out with our furry friend in tow.", "author": "Maud D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-14", "description": "I've been to a lot of bars in SF and Holy Water fits the bill perfectly- easy parking, not crowded, awesome drinks.\n\nSuper chill, come in your sneaks kind of place.\n\nAlways a standby for those nights you want a drink but don't want the stuffy atmosphere.", "author": "Angela D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-21", "description": "Growing up in Catholic schools all my life, I have made it a habit to always dip my hand into the holy water before I enter or leave the church. Might sound sacrilegious, but I think I might make it a habit to go to this bar and get a drink every time I am in this area. Don't know why this bar is called holy water, but this hidden gem of a bar made me feel like a new person after a long week of BS.\n\nFor starters, 11 dollar standard rate for most of their cocktails, great fernet selection, and quality beers on tap--this truly is a holy spot in Bernal Heights. Also, the menu is very comprehensive -- it shows you what is shaken, stirred, etc. and also highlights the hard alcohol in each. I am a huge rum, vodka, bourbon, mezcal, tequila (practically all alcohol) and their menu has great combinations with any type of alcohol. \n\nMost specifically, I highly suggest their After the Gold Rush (Bourbon, Pineapple, and Apricot) and the Fresno Cocktail (Bourbon Benedictine Lemon) and the Inferno Tropicale (very tropical drink). All of these drinks are very refreshing and are a great start to a night or a quick nightcap ;)", "author": "Eric Joseph D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-21", "description": "Steffan is beyond fantastic. We are in town for a wedding, and he not only made us the finest cocktails and gave us the best service, but he told us about the best spots in town. I wouldn't mind exchanging numbers with him to find out when he's working next. Best bartender I've experienced in town!!", "author": "Nick F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-10", "description": "Great place to chill out! They are dog-friendly too! Carlos, the Bartender, is awesome! He was right about the After the Gold Rush! We'll definitely come back here!", "author": "Leslie S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-05", "description": "This place was exactly what I was looking for...a non-touristy, neighborhood bar, with good drinks. The bartender was friendly, and knowledgable. We ordered one Holy Gimlet and one \"surprise\" vodka drink to the bartenders taste. She made both drinks really well, and they tasted great! The atmosphere in this bar was really nice. We sat at the bar and got talking to people from around the area, which was awesome! The bottle display behind the bar is impressive, and the lighting in the restaurant is dim and intimate, which was perfect for a couple of low key drinks. Would definitely recommend this place, and hope to find myself back here in the future!", "author": "Amy O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-29", "description": "Cute little neighborhood bar tucked in Bernal Heights. Not really a place to rage at, but Holy Water is perfect for catching up with a friend over a good cocktail. Lighting is dim, it never gets too packed, and the decor is on par with some of the more mainstream cocktail bars in Soma / Fidi. They also have 2 flat-screen TVs mounted on the walls playing the games, which striked me as a bit incongruent with the rest of the decor, but I can see people enjoying it. The drinks are on the cheaper side too (by SF standards, at least)!\n\nInferno tropicale - Smoky from ancho chiles but not overwhelming. Awesome for someone who usually loves mezcal drinks. Similar quality even though the inferno tropicale is made with tequila.\n\nAfter the gold rush - Light and refreshing.\n\nI look forward to coming back more often and trying more of their cocktails!", "author": "Tiffany P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-07", "description": "MS HOLY WATER! OH HOW I WISH IT WOULD RAIN!\n\nThis hidden gem tucked in the heart of Bernal Heights is absolutely one of the best cocktail bars in the city. Another cocktail bar that truly knows how to balance the art of a delicious yet strong drinks. This place is ideal for a casual night to chitchat with friends.\n\nMy friend and I came here past 1 am on a Saturday night and found it to be rather quiet. Nevertheless it was their drinks that kept us talking. We had ordered their After the Gold Rush and Bourbon Rye or Rum Old Fashioned both priced at reasonably $11. We also tried their Mexican Firing Squad and I must say the bartender was a little generous with the tequila, which I'm completely fine with.\n\nIt's not a question that I will be returning here again. Hopefully soon and maybe this time will try their other house favorites.", "author": "Denzell S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-29", "description": "Living nearby is both a blessing and a curse.  \n\nThis is a nice neighborhood bar where ... to use the over used cliche ...everyone really DOES know your name.  Being tucked away in a largely residential neighborhood, you're most likely not going to come out here unless you live in Bernal or you're visiting. It does get quite loud, especially in the back.\n\nI usually just have an Old Fashioned, and I am able to choose my liquor without too much of an additional charge.  It's well prepared with two different bitters, a splash of simple syrup and either bourbon or rye, depending on my mood.  Most cocktails are $10.  Spirit selection could be better, but recently they had their own private barrel of Eagle Rare bourbon in the well.  Bonus.  I see people order something called a PainKiller, but it just looks like a slushy headache with all the crushed ice.\n\nI've tried many types of Mezcal here, served in little terra cotta cups.  \n\nLots of beer are available and the selection rotates frequently. I can't comment on that, but my friend is never disappointed. \n\nDog friendly so feel free to bring your pooch.  Hours can be hit or miss, but they are usually open by 4.\n\nCredit cards accepted and free WiFi.", "author": "Michael M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-09", "description": "This one has been on my list for a while to check out - Surprisingly roomy inside and with plenty of seating at the bar and various tables. We went on a Wednesday night around 9pm, bar was filled with mostly locals - Including a very cute white dog perched on a bar stool next to his owner. Bartenders were nicer than most, but not outstanding service. Definitely a bar for a quick and casual drink, cocktails were solid. Bernal Heights neighborhood vibes.", "author": "Jenny C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-06", "description": "Drinks are fine, quality cocktails if that's what you're looking for. Not a gay bar regardless of location but it's definitely for the hipsters.", "author": "Savannah S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-05", "description": "Been to many bars and this one is still my favorite. Amazing and well crafted drinks, knowledgeable staff and dog friendly. A neighborhood gem.", "author": "Markus S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-11-26", "description": "Place was ok, the drinks were decent but nothing to brag about. If you were walking by and wanted a drink it's a good spot. But other than that it's not worth going out of your way to go to.", "author": "D C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-25", "description": "Cool spot to come chill with friends and have some drinks. Its in Bernal Heights, a safe neighborhood in San Francisco. There's plenty of seating if you're coming with a group and they have a cocktail menu if you want to try something different. Has a hipster vibe to it and I dig it. I will definitely come back when I want to come relax and have a few drinks.", "author": "Cristal F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-14", "description": "Dimly lit and sexy with boozy drinks? Sounds like a perfect date night spot to me! I would say this place is great for a 2 or 3rd date with someone that you really like...otherwise it might be uncomfortably moody. For me, it was the perfect vibe for drinks and a date. Highly recommend!", "author": "Megan W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-03", "description": "The atmosphere was nice! And the drinks were very smooth.Only downfall was the cocktail menu.we were expecting to see the same drinks we saw on the Yelp  menu pictures but it has all changed.But there are soooo many options.", "author": "Noemi D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-26", "description": "This is the closest bar to my house where I can get a decent (and excellent) martini. I sooo appreciate being asked how much vermouth I want (4:1 please), the careful stirring of my fragile gin, and the skillful lemon-twist-making that allows a gorgeous blanket of citrus oil to be gingerly sprayed on top to revive my senses after a day where \"mama needs a cocktail\" amiright? THANK YOU for coming to my side of The City so I don't have to brave the armies of tech-nerds to get a delicious and satisfying elixir. Friendly bartenders, dogs welcome, my kind of place.", "author": "Andrea P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-06", "description": "Another go-to as promised!  when you worked all week without a break treat yourself to mellow good Holy Water in Bernal. Bartenders are the nicest around and wah-LAA! Creators of Excellent Old Fashions with rye. Like us they are big fans of Altamont \"Maui Waui\" and then all time faver raver FIELDWORK \"Over ripe IPA\" life is good....get here early for close parking- nice crowd and an occasional neighborhood perro to let you rub her chin. Oh yes and the owner occasionally bar tends and just like his team is very thoughtful in his drink prep and he is as welcoming as Cortland is savory.", "author": "Lisa S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-27", "description": "Fantastic cocktails and sweet staff and owner. I love the chandeliers made from decanters. One of the best things about this bar is the local residents bring in their dogs, I love a great cocktail and a good cuddle with a borrowed dog now and then.", "author": "Leann W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-16", "description": "In Surrey I used to frequent a watering hole with an old Eton bud that had the distinction of having been visited within four hours by Prince Edward and also a drunken purveyor of alpaca knitted hosery who laid waste to a row of highball glasses after losing six straight matches of Cheat.\n\nIn San Francisco, I do not enjoy the confluence of juniors that must be waded through like a Malaysian thicket to reach the bar to fetch a proper cocktail. Holy Water however lets me drink without the fuss, the crowd, the regret, the deep gut pain.\n\nBe modest in ruining my only home away from home.", "author": "Peter W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-10-09", "description": "We've been wanting to check this bar out so we thought we come here on Saturday night with my family.  Cocktail over priced,  too strong and no taste.  We ordered a cocktail not a shot!!!  The bartender would not even smile.  We didn't even touch the drinks.  We wanted a tasty cocktail but ended up with strong no taste overpriced cocktail drinks.  I would review this as negative number.", "author": "Rico O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-09", "description": "I ended up at Holy Water with a few friends after dinner on an early Saturday night. It was nice. Really, that just about sums it up.\n\nOK, some deets. We got in before Saturday night SF bar prime time, so street parking was pretty easy & available seating at the bar & tables was about 1/2 full. We grabbed the table in the back corner nearest the restrooms & had a cool time chilling & conversing.\n\nThe bartenders were friendly, attentive, & efficient. Even after it started getting more busy as the night wore on. Holy Water is definitely more of a fancy cocktail bar, but (being a beer guy) I found the beer selection on their 8 taps to be respectable.\n\nIt's dark inside, but not too dark. Ambiance is undeniably hipster, but there wasn't such a profusion of ironic moustaches, bowler hats, or anything steampunk amongst the clientele that I felt the immediate need to vomit up my dinner.\n\nWe all had a couple rounds & it was a nice spot to hang out. That just about sums it up.", "author": "John M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-13", "description": "Another bookmark checked off!\n\nI've never been to this part of the city before and yet, my family has always lived on the other side of the hill. Not only was it nice being in this part of the city, but to finally check out Holy Water. It's a very nice bar with wonderful decor. The bartenders here seem pretty cool. I was going to order the Inferno Tropicale, but saw they had Pimm's Cup on the menu and went with that. It was a good Pimm's Cup indeed. \n\nMy cousin was telling me some of the other offerings at Holy Water so I look forward to coming back and trying some of their other cocktails.", "author": "Vanessa S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-05", "description": "Greeaatt local bar in Bernal Heights. I loved the rustic and woodsy feel to this bar.\n\nTried the Pimm's Cup and it was perfectly sweet and sour. Tried my friend's whiskey sour amd it was an excellent silky mix of the egg white and lemony acid. The bartender (specifically the one with long hair and a beard) was super chill and laid back. \n\nThey have 8 beers on draft that you can choose from for a beer flight. Lots of space and seating at the bar. This bar deserves more attention!!", "author": "Christine K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-10", "description": "Super laid back bar with some of the best beers in Bernal Heights. I always order whatever ipa they have on tap and I've not been disappointed. A great place to start your evening or end with a nightcap.", "author": "Jane S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-20", "description": "Love this spot - good music, but not too loud!!! Plenty of seating. Great drinks from a friendly and attentive barkeep. Can't wait to go back.", "author": "natalie b."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-19", "description": "Great local spot. The interior is sure to have sparked many an Instagram sesh spent agonising over which filter and what hashtag(s?!) to use. The cocktails, and their nomenclature to boot, look equally impressive. \n\nMy siblings and I came on a Sunday afternoon, and, unfortunately, my sister and I were under the distinct impression that we were going to a coffee shop. I'll pretend that my coffee shop outfit, actual (not e) book included, is not what drove the bartender to card me (nor will I pretend that I didn't delight in not looking noticeably older than my baby-faced sister). The fabulous interiors definitely are not conducive to reading a book (unless you want everyone to hate you as you wield your phone's flashlight). Our second faux pas was in ordering a glass of wine, off the relatively short wine list. It retrospect, when a place has an A4 sized cocktail list and a half-PostIt sized wine list, it is probably best to order a cocktail. \n\nHad I better exercised my ability to read and pre-searched Holy Water, I'd have told myself to go for the cocktails. And perhaps not to bring a book.", "author": "Mairead J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-06", "description": "Dark clean decor and excellent drinks. The service was great too. They would get 5 stars if they had simple snacks to go with the drinks. Nuts, pretzels, chips would be easy to offer and encourage me to stay for more than one drink", "author": "Cynthia G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-22", "description": "Their cocktails priced at $10 a piece were really great.. for such a busy bar, definitely expect to wait awhile on drinks bc they are handcrafted and just the nature of them requires a little more patience in general. The drinks were delicious and the bartender was nice, but the noise level was a bit high for our taste. I think we were looking for more of a lounge-y bar where we didn't have to yell across the table in order to hear each other. The decor was pretty, especially the hanging book pages... this would be a good place in general if that is what we're in the mood for. \n\nThey did have a random section in the back with a grill where they were making tacos and bbq sandwiches for food... good concept to have food readily available in a bar but the place smelled like burnt butter and grilled cheese sandwiches.  Just random.", "author": "Nancy T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-04", "description": "Was excited to find this friendly cocktail bar, and incredibly happy to find that they carry Pappy Van Winkle!", "author": "Steve G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-20", "description": "tasty cocktails. Nice bartenders. sort of an old people bar but still very good. not sure why I have to make this review longer. It's pretty time consuming. I already said it's good. Guess what? It's a pretty good bar that has tasty cocktails.", "author": "Cecilia H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-25", "description": "This was my first time visiting this bar and I must say I wasn't disappointed. Being an out-of-towner in a city like San Francisco can be hard; struggling to decide what places have a chill vibe, but also welcome unfamiliar faces and offer more than a standard tall can and a not so clean bathroom. \n\nThis place hits all the sweet spots you want in a bar. A chill modern atmosphere, not a tv in sight to distract or to shout over, exceptional service from knowledgeable bartenders (thanks Mike!), and bonus! A bathroom that doesn't scare you. This place is a hidden gem off the beaten path and will not leave you disappointed if you want a quality crafted cocktail.\n\nI will absolutely be back when we visit SF again!", "author": "Alexandra W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-29", "description": "I was told they make some decent cocktails so decided to finally check it out. Definitely surprised by their way of drinks. Remind you a little of Las Vegas. Good for a change. The staff is quite decent as well but the service could be better", "author": "Chris G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-01", "description": "Sidenote: Has anyone ever been traumatized by the waiter in the Cheetah Girls 2 Strut music video? That was the cause of my depression. Have a good day :)", "author": "Jane S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-24", "description": "The Zombie is legit. Great bartender-- knowledgeable and helpful, courteous. Dude cares about his craft. I love this place :)", "author": "Dave G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-07", "description": "Great quiet place in Bernal Height for drinks. They are known for their delicious cocktails. The only downside is their lack of food/snacks. The only item they have on their menus are chili lime peanuts and beef jerky. Otherwise, good place to hang and chill with friends since they are open fairly late.", "author": "Linda L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-05-16", "description": "My goodness- the bartender here is rude. The drinks are nothing special, so I'm not sure why I'm being treated with an IDGAF hipster attitude. I ordered drinks with friends and after the bartender charged our cards, he says there's a $15 minimum, so he charged my card $2- without asking! Also when I asked questions about the drinks, the bartender was not friendly. Keep in mind, the place was quite empty. Welp- I'm not going back.", "author": "Rad S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-03", "description": "In my partying heydays, my friends and I use to joke about sitting in a pool of holy water on Sundays to repent all the sins committed from the weekend. \n\nHowever, there comes a time in life when you finally have to hang up those stripper shoes (that make you look like baby giraffe on roller skates), stop the random drunken hookups, and the reckless WhoeverCanWalkInaStraightLine is the DD. \n\nWith age and responsibilities, you may have given up the raging but you're still entitled to have a few classy cocktails right? \n\nEnter Holy Water. From the Churchill and Bloodhound folks, comes the best neighborhood bar I've been to. It's a bit of SoMa and The Mission rolled into one sans the horrible parking and [sometimes] pretentious yupsters. \n\nIt's very chill and low key with a mixed crowd.  Not a place to rage but to enjoy a good drink with good company. \n\nYou can grab a seat at the bar or come with a group of friends to hang out at one of their communal tables. There's flat screen TVs to watch the game. You can even bring your dog with you (there were 2 that night). \n\nAll is welcome at Holy Water and that's how the staff makes you feel. They're the nicest bar staff I've encountered. \n\nOn the menu are 10 artisan cocktails ($9), 8 draft beers ($5-6), 15 bottled beers ($3-8) and 3 wines ($7-8). CC's accepted. \n\nFor all you fernet lovers, Holy Water has a handful of different varieties unlike other bars that only have one: Fernet Branca. \n\nI've cut down on my drinking these days but we had just come from a banquet filled with [free] booze so I needed a \"night cap\". Ok, two. \n\nThe Holy Gimlet ($9) was well balanced with Hendricks, lemon and cucumber. Not syrupy sweet which I liked. I couldn't leave without some pre-hangover prevention so a shot of Mexican Fernet neat ($7) it was--thank you, Adrian for the recommendation.\n\nI've never heard of Mexican Fernet so I did some digging. Apparently, it was discovered early this year at a dive bar in Guadalajara. They use the Mexican Fernet in a cocktail called \"Pink Testicles\". \n\nPink balls ehhhh? (o_O)\n\nI think, I'll stop right thereeeee...I'm too old for holy water baths.", "author": "Cherylynn N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-26", "description": "This bar is awesome. Clean, spacious, friendly environment. Patrons and staff. I ordered a mixed drink, pisco punch, and it was PERFECT. Bathrooms are clean. Bar is clean. Drinks on point. I will be back!", "author": "Jennifer T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-07-31", "description": "Came here for drinks after having dinner at a near by restaurant. Our friends live near by, so it was nice to be able to just walk here. I remember coming to this place when it was Stray Bar. The place looks like it's been updated. But, the thing that remains the same is the ability to bring your dogs. =) There were a couple that were in the place. \n\nThe price for drinks are average price. I wanted something girlly/sweet, but when I asked the bartender what he'd recommend, he mentioned there wasn't anything really sweet. So, I ended up getting the Singapore Sling, I think. We were able to grab a table in the corner. The place wasn't overly packed on a Friday night, which was good. \nGreat place to come before or after dinner, or just to hang out with friends on a casual night.", "author": "Mimie L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-26", "description": "Love this cute bar! The drinks are delicious and strong! The painkiller was strong but not overly sweet.I loved it. They also have two TVs for when sports games are on. The bartenders are super friendly also! I also love that the menu includes what kind of cup your drink will come in as well as if it will be shaken, stirred or pour. \n\nDefinitely will be back!", "author": "Nia R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-06-15", "description": "Not bad neighborhood bar with sought after craft beers and outstanding cocktails. Nothing but the finest for this spot, and the eclectic crowd will surely keep your visits from becoming stale.", "author": "Jackson W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-16", "description": "Relaxed ambience, Friendly and attentive bartenders that make great drinks. Love this place. They made one of the best old fashions I've ever had.", "author": "Kevin D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-28", "description": "Adore the space. Stellar spirits at a hellava value. Really, you gotta allow dogs, huh? Sometimes they out number the people, lol. Have witnessed dog fights on occasion when crowded... 9/10 bartenders rule. One guy recently suucked - wasn't even a crumb of polite despite it being VALENTINE's Day and it was dead in there. But all other evenings they've been awesome.", "author": "Catherine C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-10-08", "description": "I went there to celebrate a friend's birthday and left very disappointed and surprised in the service we received by one, shorter dark haired waitress. She approached one of my friends and I saw her aggressively yelling at him \"You're done! No more drinks!\" and asked him and another with him to leave. She could have been calm and told them nicely. So they were heading outside and then one of them vomited outside. She went outside and made a comment requesting for them to pay 5% tip for vomiting and claiming she can ask for that. She also accused him of vomiting in the bathroom, which he did not even do. They tried to talk to her and she just ignored them and didn't want to discuss it. The other two bartenders went outside and told them they weren't welcome to the bar anymore. So they left. While I was inside with my other group of friends, the same waitress came back to our table and started clearing our drinks without asking. She was even grabbing a completely full new drink to take away. We weren't even loud or being obnoxious at our table. We were just sitting there, enjoying our time talking. Obviously, she wanted our entire group out. So we decided to just leave. We're definitely not coming back. The waitress was extremely rude. I've never experienced this type of service.", "author": "Jenny H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-28", "description": "I went here my first time tonight, and loved the atmosphere, patrons, and bartenders.  This is a great spot.", "author": "Jane F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-19", "description": "I am in love!\n\nA rad place to grab some cocktails or beers with your loved ones. The bartenders were super nice and they make an awesome old fashioned..but don't be afraid to let them surprise you with their made on the spot cocktails. My friend is a bartender himself and he was very impressed.\n\nI've never really ventured out into this part of the city but I highly recommend this place! Great atmosphere with some great drinks.", "author": "Jenn K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-13", "description": "Went here on a Saturday night and we're delighted by the attentive staff- particularly Carlos. My boyfriend and I know what we like, but sometimes what we like isn't always on the menu. He asked what we liked and made us his own recommended cocktails. They were AWESOME. Ask for his special concoction w/mezcal. I believe it's called \" la conquista\"\n\nIt's a craft cocktail bar without the pretentious vibe. Definitely my fav cocktail bar in SF so far!", "author": "Danielle M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-15", "description": "This is one of my favorite chill neighborhood bars in the city. Their cocktails are good and they have a great selection of liquor.", "author": "Katie P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-01", "description": "Great drinks, service and such a neighborhood friendly bar.  Im not a dog person so could do wothout the dogs but so appreciate their hospitality.  Have never once visited without being greeted with warm friendly service by one of the two regular bartenders on a Fri night.  No such thing as skimping on the booze here.  \nHusband is a super fan of the mini Highlifes.  I mean c'mon what bar in this city has those.", "author": "Jez S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-04-01", "description": "Nice bar on the north side of Bernal. Yummy drinks with spacious interior. And dog friendly to boot. I got the Painkiller which I enjoyed, since I like girly yummy drinks. There are other options for people who like drier, less sweet cocktails. Also some nice refreshing/light options too.", "author": "Sherry L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-14", "description": "GREAT neighborhood bar. We were there on a Thursday night with one bartender. He was pretty busy handling the bar on his own, but we still got served pretty quickly with quality drinks.\nThe drink menu is innovative. The mezcal drink (can't remember the name) was killer if you fancy mezcal.", "author": "Amy O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-19", "description": "Excellent bar in Bernal Heights in SF. Highly recommend their Holy Gimlet, After the Gold Rush, Queen's Park Swizzle, After the Gold Rush, and Painkiller cocktails! Lively and bustling place during the Saturday night before Christmas weekend. Bartenders were very attentive and friendly, made some excellent drinks with a great mix of sweet, sour, amd bitter. $10 for each cocktail on their meni isn't too expensive compared to some of the other places in SF.", "author": "A L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-12", "description": "Delicious drinks for a fair price. Bar tenders are very friendly,  the atmosphere is low key and fun! Plus, they are dog friendly!!!!", "author": "Alia K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-05", "description": "Very nice, mellow place to grab a cocktail. I had heard rave reviews about Holy Water's Old Fashioned, and being a big Old Fashioned girl, I had to try it and it was excellent, I will definitely go back to have one or two. Or five. Or nine.\n\nThis isn't the type of bar you go to to get loud and rowdy, which is why my visit on Saturday night was not as perfect as it could have been. I was traveling with a bunch of men (boys, really) who had been drinking since 3PM, so when we stopped in around 11, you could cut the air of fights, vomitting, and random hookups with a butta knife.\n\nWe were looking for the Buckshot /  Ireland's kind of vibe, which proved to be disasterous. However, after the majority of my extended party left, and we few, strong, seasoned g-hards remained, it was a very nice time. Of course by then we were all pickled, and finished our drinks and headed out in search of food.\n\nThe bar is really cute: stools gallore, large windows facing the street, dim, gold lighting. Owned by the same folks as Churchill and with the same feel of casual / classy, and of course, hipster. It's a good time if you're looking for something SOMA-esqu but not during a Friday happy hour. The crowd is a mix of hipste r/ down-to-earth.", "author": "Crystal C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-18", "description": "As a continuing part of the tour of the \"50 Best Drinks of 2014,\" I stopped here to try an After the Gold Rush.  \n\nThe place looks like your typical SF bar: dark, creative/industrial style lighting; nothing out of the ordinary.  I was there on a Sunday evening, so it was pretty empty.  The bartender was friendly, and was surprised that the drink had made a list, but he chatted us up, told me more about the drink and its other claims to fame, and made a fantastic drink.\n\nStuck around a while to enjoy and relax.  Great place to go, and the dog that came in to visit was well taken care of and loved as well.  The drink was worth it, the price was good, and the bartender was fun to chat with.  All in all, a great experience!", "author": "Jes G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-19", "description": "Nice place for a drink to catch up with old friends.", "author": "Nathan B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-20", "description": "Stopped in here after having dinner nearby on Fri. We loved it so much that when we were in Bernal again on Sat. we went back after dinner.\n\nThe bartenders are fast and friendly, and the drinks are some of the best I've had.\n\n I've had the \"Bees Knees\" at other bars, but the one made here seems like a different drink entirely.  Perfectly balanced, absolutely loved it.\n\nI hope this bar continues to do well, without losing it's neighborhood vibe. I like that while it's lively and busy, it's not packed to the gills.\n\nBeing able to get seats, and have a conversation, and have amazing cocktails=perfection.", "author": "Amanda G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-03", "description": "Such an awesome neighborhood bar! It was on my to-visit list once I heard about their opening a few months ago, simply because it looked entirely gorgeous and had a fun sounding menu.\n\nCome in person, and you will not be disappointed. It's certainly sleepy during the afternoon on weekends, so I'll have to return at night to get a better feel. However, the bartender was knowledge and friendly, and their selection of beers & hard alcohol is extensive and impressive. Their house-crafted drinks are delicious and reasonably priced for the area.\n\nBest of all, the bar is dog friendly (not baby friendly, no idea why a couple thought bringing an infant into a bar was a solid life decision). They have a water bowl, a box of biscuits, and ample space for your Fido to hang out while you grab a drink - very cool!", "author": "Claire S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-30", "description": "Another fantastic bar added to the ever growing list of cocktail bar in town. Eight great micro brew on tap, good bottle list. Great cocktails. Fantastic whiskey selection. \n\nDecor is trendy, remind me of bloodhound in many ways. Also has terrible acoustic as bloodhound.  \n\nCrowd are your late 20s 30s hipster. Chill and relaxing.", "author": "Alice C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-12", "description": "I liked this place, a lot!\n\nCame here after dinner nearby and I just adored this place. It's definitely on the outskirts of the city which is great if you need parking but still pretty easy and cheap to get to via lyft/taxis. Because it is a little outside of main city areas, the place is not crowded, even on a Saturday night which was awesome. The place is new with pretty modern and industrial decor which I love. Dim lighting, clean and spacious bathrooms and enough tables to accommodate the limited crowd, all wins.\n\nThe drinks were also pretty good. They have craft offerings if you are so inclined and also just your standard well drinks, beer and wine. They are just as happy to serve you any of those options and you won't get any judgements either way. We had an array of drinks at our table from bourbon inspired drinks to a redbull vodka so it has good offerings for everyone.", "author": "Raina B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-08", "description": "Such a cute little bar, I'm glad I was able to discover it via Yelp then convince my SF-native friends to take me here when I visited them. Upon walking in, the bar is a bit dingy in a hipster kind of a way, but still manages to be cute. The volume here is quite under control so it's a great bar to bring friends here to catch up. \n\nThe drinks are $9 a pop and they have rotating beers on tap. I had the bee's knees and the cucumber gimlet. Both were tasty and refreshing, I think I enjoyed the Bee's Knees one slightly more. During Happy hour before 7pm, they also have a beer+a shot for $10 I think. \n\nThis bar also allows small dogs so the environment was super welcoming and fun. I will definitely be paying them a visit again. Just note that they don't serve food unless you want a bowl of nuts or something (which they charge $4 for)", "author": "Stacey L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-21", "description": "Very cool open bar with a unique, inviting decor.  This place was pretty packed on a Tuesday night and the bartender was busy because it was only him working there.  We had a group of four so we ordered a lot of different drinks including After the Gold Rush, Boulevardier and Jungle Bird.   The consensus favorite was the gimlet though.\n\nGreat spot to grab a cocktail with a small group of friends.", "author": "Blake B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-18", "description": "Holy sh*t!\n\n$10 perfectly balanced cocktails.\n\nChilled out vibe, minus anyone yelling at the lone TV in the corner with the game on.\n\nParking?!? Holy crap! Granted, maybe you shouldn't *drive* to a bar, but that's another story.\n\nSolid beer list, but spirits is where this holy light shines.\n\n11th Hour! Check their website and get on that.\n\nHoly Holy Holy! Water on the side.", "author": "Alissa A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-03", "description": "Good strong drinks = + 1\nEasy parking in the city?! = + 1\nNice bartenders who are actually knowledgeable = + 1\nPlenty of seating, with tables that are actually good for groups = + 1\n \nOh, and a last star for the little stand they have off to the side where they serve tacos and bread pudding and omg... this is, no lie, one of the best tacos and bread puddings I've ever had. And I promise it's not the alcohol talking!", "author": "Sally C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-15", "description": "It's one of those randomly venture into one of your favorite bars in SF moments. Great lighting, acoustics, friendly bartenders, and feel. Had a night and day (apricot brandy and prosecco based cocktail): very well balanced.", "author": "Anna V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-14", "description": "Thursday night and one bartender trying to manage on his own, he did the best he could but if it continues to be this busy on a Thursday a second set of hands might be useful.\n\nDOG FRIENDLY is a PLUS.\nEasy parking in Bernal also a PLUS.\nUnique Cocktails also a PLUS.\nPlenty of tables for seating PLUS.", "author": "Katie S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-13", "description": "Ceiling game on point! Look up when you come here! Bartender Archie is an amazing bartender, but he's got a flat ass- but if you're into it then he's your man! I absolutely LOVE the spa cocktail and my (hawt as hell) friend got a floral gin n tonic and it tasted like top line perfume. Amaze balls. 10/10 would recommend!", "author": "Amanda A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-24", "description": "HIGHLY skilled bartenders will make you a delicious drink based on what you tell them you like. Love the ambiance and that it's dog friendly. We are so happy this bar is walking distance from us.", "author": "Sofia M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-17", "description": "Amazing drinks!! Been here a couple of times and every time we have a good time. Drinks are always so good. Service is great. Definitely recommending this place if you want good drinks and just chill.", "author": "Kharla T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-15", "description": "I enjoy having a drink here on my weekend because the vibe is awesome and bartenders knows how to make a good drink.\n\nThis place is beautiful. There is this right amount of light that accommodates romantic dates or just a group of friends. The shelfs are gorgeous. Those doors in the back with \"NO\" signs gives me the chuckle when I take care of my business. It's not pretentious, nor is it too humble. It's modern but also timeless. It's just cool.\n\nBartenders are pretty cool, too. I've seen Max most of the time because he works on my Friday. Super chill dude, and he knows his stuff. Vintz (?) and Bobby were awesome as well.\n\nIf you're looking for a good time with friends, good drinks, and parking right in front of the shop, then this is it.", "author": "Mike Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-27", "description": "I went here about a year ago and I still dream of this place!  Stopped by during its slow hours and spoke briefly with the owner/bartender, really really cool guy and very knowledgeable on all sorts of spirits, especially bourbon.  He really takes pride in his craft and it certainly shows through his wide range of drinks on the menu and variety of spirits.  Very creative... a lot unusual pairings, but it works!  Probably one of the few remaining 'true' bartenders in the city.  Need to go back soon.", "author": "Hannah G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-11", "description": "Excellent bar in Bernal! I like their decor and cocktails! Nice bar to hang out with friends in a relaxed and friendly atmosphere.", "author": "Aya I."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-22", "description": "This place is super chill and have a friendly staff. One of the bartenders became a good friend and when he left, his replacement became a good friend as well. Try their PAINKILLER. Summer isn't over yet.", "author": "Kia M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-10", "description": "A great local bar, not divey at all, industrial hip clean place with a wonderful selection of liquors and competent bartenders to whip you up a drink if the menu doesn't satisfy your needs!", "author": "Janie K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-02", "description": "The only reason I'm not giving Holy Water 5 stars is simply because it just isn't my style. It's great for what it is and I would definitely return if I was with a friend or two from out of town who I needed to catch up with, but it's a pretty chill place which isn't what I'm usually looking for on my weekends.\n\nIt seems like their cocktail specialties are bourbon based which, again, is not my cup of tea, but my bourbon connoisseur friends vouched for the quality of the drinks. And they were surprisingly cheap ($9) for the time and care that went into making them. If you don't like bourbon, they have a (I wanna say) lime gimlet that is really tasty. It was a hit with everyone in my group of about 14 who tried it.\n\nAside from the fact that it was hotter than Satan's butthole in there, the play was nice and spacious. Plenty of tables to snag if you're with a group. But again, if you're looking for a more upbeat scene or if you want to bar hop, this isn't the place for you (at least not for those particular activities). But that is to be expected; Bernal Heights is not the most hoppin' spot in the city.", "author": "Stephenie S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-10", "description": "Fair is fair, I gave this place another shot and met the owner (John) and told him my complaints.  I've gone back a few times and have gotten good service and the noise factor seems to have abated (or more likely, I tend not to go when it's crowded)  Anyhow, the drinks are good, the service is definitely a lot better, so it's only fair that I change my review to note the positive changes.\n\nBig points for being so patient with my girlfriend who needs to sample at least 2-3 choices before selecting which beer to order.", "author": "Iris F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-06", "description": "This is really a terrific place to stop for a fabulous cocktail! It has been open for a couple years now and I would always stop off on my way home from snowboarding in the mountains. It just has a great feel and is in a sweet spot in Bernal Heights! The bartender really knows his drinks and they like to mix-it-up when it comes to beers and specialty drinks.\n\nIt only gets better and better!", "author": "Jennifer K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-05", "description": "Stray Bar is no longer. In its place sits Holy Water. We love this spot as we can always bring our pup Sasha, and the guys behind the bar are friendly enough. I think Sasha can tell it's a very dog-friendly joint because we've only been a few times, and she's already gotten pretty comfy. \n\nOn top of that, great selection of beer. Cocktails seem to be their specialty as well, so one of these days, I'll go the non-beer route. \n\nI'd be happy to make this our local bar. :-) Especially during happy hour = every day until 7pm, drinks are $1 off!", "author": "Tinna H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-09-18", "description": "Decent cocktails, decent playlist, decent atmosphere, good beer selection & great decor.\n\nYour overall decent middle scale neighborhood bar, nothing to complain about.\n\nEven though I do live in Bernal Heights, the atmosphere and crowd is just a little too clique-y  for my taste, as most places are in Bernal are...To each their own...", "author": "Zhenya S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-09", "description": "What a great new space for Bernal.The signature cocktails are delicious and have awesome names.The music was stellar.Relaxed environment even on a weekend.A little pricey but the quality of the drinks and the great staff makes it worth it.", "author": "Lauren V."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-04-23", "description": "On our walk to dinner, we decided to pop into the most recent member of the BHBF. That's \"Bernal Hill Bar Family,\" just in case you didn't know (I just made it up...make it happen). A seemingly sparse crowd, we easily found seats at the bar. Initially I was put off. Reasoning being that Bernal Hill is so quaint and charming. Holy Water feels slightly out of place. I felt like I was in the likes of Churchill/Brass Tacks/any other new SF bar. After a quick talk with the bartender, it appears this new spot is from the same exact masterminds. \n\nBut stepping down from my preservationist soap box, I think Holy Water is fine. Am I upset mine and my date's cocktail was closer to the double-digit price range each? Yes. But am I thrilled they offered some bitchin' crusted almonds from a local vendor. Hells yes. They were ridic good. That said, the bartenders and co-owner who was in house were real nice. Talked us up. It was sweet. I felt like it was a hybrid of typical new gentrified bar that felt like a local watering hole.\n\nNot gonna lie, I was sort of into it. With this place within walking distance to my bed. I can already forecast my drunken-stumble from there to home. It'll be a great spot to bring visitors to my neighborhood who wants to \"grab a drink...you know, somewhere fun and nice.\"", "author": "Jon C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-13", "description": "**standing ovation**\n\nHoly Water is my new favorite bar in SF. It's effortlessly cool without trying to be. It's warm and inviting yet a bit dark and dreary in the best possible way. I'm kind of in love.\n\nI popped in on a Saturday to take advantage of their 7-day a week happy hour which runs M-F 4-7 and weekends from 2 to 7. You get $1 off signature drinks like After the Gold Rush: Old Grandad Whiskey with pineapple, apricot and a lime twist. It was one of the best drinks I've ever had.\n\nThe crowd seems to be mainly locals, which I loved. The vibe is really chill and the air is filled with the sound of conversation rather than loud music. And the bartenders are friendly and masterful at their crafts. This is definitely a grown-up bar.\n\nI also love that their signature drink menu not only shows the ingredients, but shows how the drink is prepared and what glass is used. And their selection of whiskeys, bourbon and scotch aims more for quality than quantity.\n\nYou can almost say my visit to Holy Water was a spiritual experience :)", "author": "Mariela D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-03", "description": "Reading other reviews it seems that Holy Water isn't everyone's cup of tea but believe you me, this place is totally and completely true to itself and very much on top of it's game. \n\nThe selection may be rivaled in quantity of choices but not in hand picked, curated and hard to find glory. They have some of my very favorite beers, tequilas and Scotches and the Bourbons . . . f'ing amazing. \n\nAlso, while the bartenders looked like real tough customers, they were some of the nicest guys I've ever met. Super knowledgeable and happy to let me know of things to try based on what I already knew. \n\nHoly Water is authentic in the truest sense of the word and I'm super grateful for it. \n\n5 stars all the way!", "author": "Deniz U."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-01", "description": "This is my favorite bar in SF! If you love chill vibes and cool people with great drinks then come here!!!! Mike is an awesome bartender who makes custom drinks to your liking. He's also hilarious and super laid back. Prices are reasonable and comparable to other SF bars. The interior is almost industrial like and dark but I think it's great. Bring your friends and just enjoy a late afternoon here on a weekend, you won't regret it.", "author": "Gee B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-07", "description": "Holy Water is such a gem!!\n\nYes, it's all the way in Bernal, but that's what makes it so ideal for grabbing a quiet drink. You won't have any trouble getting a table, and the libations are sure to be solid. I can vouch for the gin martinis, while my sister is a fan of their sour beers (kinda taste a bit like kombucha, if that's your thing).\n\nThe decor is also so quintessential SF in the best possible ways: industrial lighting, metal stools, rustic wood tables, etc.\n\nHighly underrated and definitely worth a visit.", "author": "Tiffany W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-31", "description": "The $10 cocktails make this place so worth it. I drank three: The Pisco Punch, the Gold Rush, and a Manhattan. All were great!", "author": "Tomas P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-07", "description": "Great local dive bar. Good amount of local beer selections on the tap. We were renting AirBnb across the street. Would go again next time when I am in town.", "author": "Denzil K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-13", "description": "Great drinks, friendly staff and not too expensive. This neighborhood gem is tucked away in Bernal but is on par with Like Blackbird. The cocktails are really good. Would be perfect for a first date.", "author": "Jane N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-02", "description": "Nice Local Bar, friendly bartender, $10 cocktails, and you can bring Fido !!! What more could you ask for.", "author": "Lori D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-30", "description": "Nice selection of interesting draft and bottle beers with fun names like Hoppy Birthday from Alpine Brewing (East San Diego), and Pleasure Town IPA (how could I not want to go there) which was from Midnight Sun Brewing (Anchorage, AK).  They have several interesting and fun cocktails and mules.  My friend enjoyed the Jungle Bird which was shaken and mixed with several fruit juices and has a fruit sidecar plus umbrella (scored points for my friend).  The place has an interesting look with cool light fixtures.  I could hang at this place if in the area.", "author": "Dan M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-25", "description": "I love the location! =)\n\nIt's a nice walk from my house. yay to that! No drinking and driving for me!  \n\nI've only had the old fashion but the cleanliness and the chill environment is enough for me to want to come back again!", "author": "Catherine K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-18", "description": "Fave bar in SF. I found it and it is here. It's a gothic type joint in barnal heights that the locals frequent with a killer bourbon/scotch selection. Happy hour is 2-7 everyday and although it's only a dollar off you don't need too many of these craft cocktails to feel loopy. \n\nI love you.", "author": "Bev M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-21", "description": "Hooray for a fancy bar with mixologists in Bernal! I'm pretty sure the arrival of this place on Cortland signals the end of what was once a quaint neighborhood, but fuck it.... we're not the #1 hottest real estate market in the US for nothing.  This will be a good spot to drink the pain of rent rates going up 40% in one year away.\n\nAlso, good option for a date night bar..", "author": "Laura S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-28", "description": "Nice bar, a bit of an older crowd and nothing wrong with that. I saw a large birthday party in the back and it looks like this bar would be good for those types of events. They also let dogs inside!", "author": "Misha T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-15", "description": "A great little neighborhood bar. I've gone there for a few celebrations (b-day, Bon voyage, etc.).  The staff do a great job of keeping everyone happy.  The drinks are great, and they allow you to bring in take out.  The decor represents the name in a clever way.  \n\nGreat for groups - they keep the music at a subdued level so you can hear people, nice.", "author": "Tonie C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-15", "description": "Great tasting drinks and great service.\n\nIf you consider \"vodka and cranberry\" a mixed drink, this is not the place for you, but if you are into delicious drinks that take your taste buds to the next level, then this is the bar for you!", "author": "David Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-14", "description": "This place is great!!! I am very happy that such a good bar opened up next door. It's like a nicer Mission/ Downtown bar without the crowd or d-bags. What's not to love- the music isn't too loud, drinks are great, bartender's are nice, and the TV's are off except for big games. I only have a couple of suggestions. The first, would be to actually finish the purposefully \"unfinished\" walls. I get it- it's a choice. But really- it's an upscale place. Everything else in the bar looks great, and shows the amount of thought that went into it. Unfinished walls= not so classy. \n\n\nOverall, I am a happy-regular patron, and will continue to be so for the foreseeable future. \n\nP.S. More IPA's on draft (personal choice)!!", "author": "Felix C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-14", "description": "Small neighborhood bar with really good beer and liquor selection. Comfortable layout. High tops. Bar stools.  Standing room. Talented knowledgeable bar tenders. Cloud theme and religious themed glassware. \n\nNot really crowded for beer week Fri night. It is Valentine's day.", "author": "Brian L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-28", "description": "Bernal Heights natives here. We love this place. The drinks are exceptional. The service is wonderful. Ambiance is fun, lively, & authetically aesthetic, but not overwhelming. Locals love this place. We'll keep coming back!", "author": "Zanna J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-25", "description": "What a great spot in the neighborhood!  Stepped in and ordered a couple drinks off the menu which I was pleased with except for the Imported Holland Cocktail (not a fan of licorice).   The bartender Mike was such a savior and explained to me the different liqueurs in the drinks on the menu.  We ended up talking and both came the the conclusion that we both loved Gin and without a pause whipped me up a gin infused cocktail that I ended up ordering 3X that night!  Let it be known, my girlfriend hates gin but after tasting this cocktail she ordered two more rounds!  To cut the story short Holy Water has a drink for everyone and If not Mike the bartender will do his best to make sure you leave with a drink that suites your taste.  Truly happy to have a bar with great service and suggestions in the bernal heights area....will refer all my friends to this bar!", "author": "Mike V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-21", "description": "Beautiful inside! Little mason jar lights, concrete floors, wooden farm tables...\n\nI love the name & cold feel of the place. Great cocktail options and huge selection of beer (sour beers too!). Bartenders are also very kind.\n\nA sweet place to come with a few friends just to talk in darkness.", "author": "Carleen W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-08", "description": "I'm hesitant to give these guys 5 stars, only because I want to keep it our neighborhood gem and discourage what happened to the Mission, to happen to Bernal. That aside, I love this bar. It gives a great mix of trendy to South Slope and is a great alternative to our wonderful dive and lesbian bars we already have. Drinks are great, bartenders are nice and clientele are generally folks from the 'hood. There is honestly nothing to complain about!", "author": "carli m."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-20", "description": "Cool new bar up in Bernal Heights~ great concept going on here just like Churchill~ Friendly and talented bartenders~This is a great bar to come and have a great cocktail without all the hustle and bustle of downtown. Great decor and feel to the bar very modern/vintage southern feel goes well with the neighborhood. Check this place out for a good chill time.", "author": "Duke Of Frisco X."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-31", "description": "Great rotating beer selection, great cocktails, friendly owners and staff, clean, new, old timey ambiance. \n\nI wouldn't say it's a destination if you're looking for a huge scene- more like a great choice if you'd like to talk to the people you go with, get the job done and like being able to usually get a seat.", "author": "martin l."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-02", "description": "Bartenders who smile, look you in the eye, and kindly ask what they can get for you? Yes, please. Honestly, the vibe of this place is amazing (I was swooning over all the decor), the drinks were fantastic, but my main inspiration for writing a Yelp review were how friendly the bartenders were. Thanks, dudes. :)", "author": "Stacey J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-17", "description": "Very unique bar in San Francisco. I like how it's really low key and casual.\nThey have really good mixed drinks. Decor of the place is great. I am still wondering if the ceiling and wall art is wallpaper or paint. Pay attention to the wall art, I believe it's related to the name of the bar. \n\nOh and they are super efficient in clean up the tables of empty glasses! I am impressed =)", "author": "Karen W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-18", "description": "Top notch spirits, good service, nice space. They allow dogs which is great for dog-centric neighborhood.\n\nMy only gripe:\n\nBAD ACOUSTICS! \nSAY WHAT? I CAN'T HEAR YOU!\nI SAID BAD ACOUSTICS!", "author": "Adriano J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-11", "description": "Great neighborhood bar.\n\nAside from great cocktails their beer menu is really fantastic and keeps you wanting to explore - first time having a sour beer was here. Also, love the setup, the theme, and the overall relaxing mood.", "author": "Jeremy H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-23", "description": "From the ambience to the cocktails this place has an amazing vibe and even better drinks. The decorations help make the place feel rustic classy with a dash of urban outfitters hipster to make a great atmosphere. The drink menu is upfront and laid out. It tells you what's in it, how it's made and what kind of glass it's in. I had an After the Gold Rush and it was delicious. I chatted with the bartender Michael and he was really friendly just adding to the experience!", "author": "Michael G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-01", "description": "Great local craft cocktail spot for Bernal folks. Happy hour is everyday incl weekends which is cool. My girl's drink is the Jungle Bird ('the bird'), kinda punch-y, nice and balanced. Beer selection (my thing) is great-both bottled and on tap.", "author": "Michael O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-22", "description": "I love this place. Finally a quality cocktail bar in my side of tow. The interior is very industrial which I like and dogs are welcomed as long as they dont piss and shit in the place (go for a long stroll and evacuate the bowels before bringing your dog here). The bartenders clearly know how to mix up a quality cocktail and their attention to detail is presented by the way they taste every drink made to ensure quality taste (and quality strength). \n\nI tried about three of their specialty cocktails, the gimlet, something thai, and something similar to the gimlet (sory its been a few days since ive gone). But each drink was excellent in their own right. I went on a Wendesday evening and the crowd was small but friendly. Its very homey and intimate, far from the stuck upness of other bars with a similar vein. \n\nAll in all this is an excellent bar for those of us who dont live on the \"yuppy\" side of town and its excellent enough for the \"yuppies\" to venture a trip down. However, please dont gentrify my new favorite bar. Thanks", "author": "Robert gene R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-30", "description": "Finally, a great cocktail bar in Bernal Heights. \n\nThe drinks menu is good; the bartenders are fun; and the atmosphere is cozy. \n\nMore importantly, it's three blocks from my house.", "author": "Dyche M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-24", "description": "Great vibe!  Good cocktails!  Only complaint is that its a very closed space so the sounds are amplified which makes it hard to have a conversation if there a handful of people in there.  Also if you have a large group then this is not the place for you.  Its a more intimate setting.", "author": "Rosh C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-05-12", "description": "I am so intrigued with this place and I finally went last Saturday. Cool neighborhood bar and unique decor. Bartenders are not friendly. Mainly locals. I tried the Painkiller and it was good but too sweet for my taste. It was a girly drink. Then I tried the holy gimlet - that I enjoyed very much. I wish they have appetizers. They only have glazed almonds and beef jerky for $5. Not sure if I will come back, maybe.", "author": "Jingle A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-16", "description": "Love the environment. Love the dog friendly neighborhood. Staff is friendly. Drinks are made nicely and they serve buffet style food(not sure how often though).", "author": "Victoria S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-06-02", "description": "Bartender was nice, they didn't have the typical stuff I like to drink though. I'm a Becky with good hair. Prices were pretty reasonable.", "author": "Thai N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-06", "description": "Went to check out Epicurean Trader down the street. ( incredible market btw) and people recommended we check out Holy water up the street as s place for great cocktails. So we went. I had the pisco punch. My daughters had the Singapore sling and pimms cup. Delicious. Mine was very refreshing. Nice flavor and balance without being too sweet. Great vibe and super cool ceiling. The other two drinks were also good. They also have beer and wine if that's what you want. Something for everyone. Would recommend!", "author": "Colleen B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-12", "description": "I had a milk stout...from which brewery, I forgot. Definitely will be back for a flight.", "author": "Maximillian M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-09", "description": "Both the after the gold rush and the holy gimlet are stars on the cocktail menu. The bartender is very friendly and the crowd is very local, if you're in the neighborhood definitely give it a shot.", "author": "Derek F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-09", "description": "You are \nTrust ME! :) :)\nTrust yourself \nNot going to have a better\nCOCKTAIL or mixed or stirred drink\nin The City of San Francisco than\nThis Bar\nDiscreet tucked away low key with\nA great sound system \nAnd\nMax!!! A marvelous mixologist who stirs up\ndrinks  from the bottom of his hearty\nHeart & Soul!\nMarvelous mescal\nBeautiful bourbons \nSour Belgium beers\nThey are all there &\nMuch More!", "author": "Lynda Beth U."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-27", "description": "Stopped here for the first time last night (7/26/14).  There were several large groups and it was quite loud.  I grew up in Bernal, so I'm familiar with the dive bars on Cortland.  This place feels more posh than dive; almost as if it belongs in Pac. Heights or something...but I'm not hating, it's nice and I like it.  Now for the best part...their drinks...tried Bees Knees and Moscow Mule...Just awesome.", "author": "Leland H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-29", "description": "What a special place... It is pretty rare that a place can achieve a neighborhood feel and welcoming atmosphere while still maintaining perfect excecution of their craft.  I'm pretty over 'craft cocktails' and fancy-everything... Holy water has managed to bridge that gap. I wish it was closer because I never want to leave, in fact, I'm always there to last call.", "author": "Thadd L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-03", "description": "Came here for Halloween for my birthday with my girlfriend. We were being served by the owner who gave us a free drink and let us try one that's going to be on the menu in the future. All the drinks were delicious and the people in the bar were nice. The bar is dim and the music wasn't that loud. My girlfriend and I had a blast and we will be back when we visit SF again! Thanks john!", "author": "brian g."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-18", "description": "OK, turned around. I still think they could make better specialty cocktails that actually make use of all the bottles on the shelf. But the fact that you can go into a chill bar on a Friday or Saturday night in your 'hood and have a drink with friends and (mostly) hear them is pretty cool. The servers are friendly and the clientele is largely not douchey. I think my first review was too harsh (because I'm a cocktail snob).", "author": "Stephanie P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-17", "description": "After living in SF for about 20 years now, I've never been to Bernal Heights. When my fiancee mentioned she wanted to check this bar out, I was a bit put off because I didn't want to try something new. They quickly won me over. It was Saturday night and raining. Yet, on this little street, they are the only place that's busy. Lucky for us, there was a table in the back. The bartender didn't make me wait and helped me out right away. While she was busy, she answered some questions about what kind of whisky I wanted in my old fashioned. I decided to give it a shot and see how good of a old fashioned she could make. She made a really good old fashioned. Normally, I like one big ice, but I've learned that not every place offers that. Tasted great, was just as strong as I like. They have a menu with a bunch of different drinks that I def would go back for just to try.", "author": "Cëma M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-06-01", "description": "Cool spot, rather plain looking. Friendly bartender. Would go back if in the area.", "author": "Dilly M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-19", "description": "Nice place to throw back a few with friends, and conversate.  This place is definitely on the radar for an encore trip. I love a place that surprises u with unique options & especially drinks, which score a 4 out of 5 with me. The 4 being that no one person should handle a bar alone it creates the oh c'mon hurry it up affect. The people were decent no fights, and the bartender created a drink for me at my request called the suicide. Try it! I dare you to drink it with a straw LOL! To everyone, remember drink responsibly, and always call a taxi or a friend after you have consumed more than the law recommends.", "author": "David T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-23", "description": "we got a winner! and first place goes to HOLY WATER!!! \n\nfirst of all on any given night you can come here to get really good drinks and there's just enough people here that keep you from feeling like a complete alcoholic, but also not too many people to annoy the hell out of you for having your neighborhood bar being taken over by riff raff. \n\nadd to that friendly staff and some delicious bar nuts in mason jars behind the bar (ask your drink pourer for these), and you've got a five star bar in bernal heights! \n\nhere's the kicker, if you've got a canine companion that you just can't leave home alone, well then bring them here!!!! holy water is 100% dog friendly, and off the leash is completely acceptable.  but don't be that jerk that brings your \"not friendly\" dog here....all the dogs roam around and drink some water and even have treats behind the bar.....but don't go ruining it for everyone else!!!!! :)", "author": "omid a."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-06", "description": "Excellent cocktails and reasonable price. I wish the ambiance and seating were warmer and more comfortable, respectively, but it's still a decent place to spend an hour to unwind, sampling their good beer selections or cocktails. Ask for Mike and use his expertise to choose an appropriate cocktail. Mike is wonderful, talented, humble and kind, but we also had another bartender who was rude and obnoxious, but that doesn't appear to be the norm. Try it out and have fun in Bernal.", "author": "R L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-27", "description": "Yummy old fashioned and a wonderful wide variety of IPA's on tap - score! Great neighborhood bar and dog friendly. Best part, $1 off drinks during happy hour (til 7pm). I recommend a visit when you're in the hood.", "author": "Misty A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-30", "description": "I came here with my boyfriend on a Tuesday night - decent cocktails, friendly bar staff and reasonable prices. Not super comfortable decor though, so it depends what ambience you're looking for.", "author": "Orla M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-09", "description": "Went in on week night, very chill place, cool, casual, darker atmosphere, great place for a relaxing drink or two and not to mention really friendly bartenders!", "author": "Thomas C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-27", "description": "Best Gimlet ever! Jungle Bird is also very delicious. ;) Love the ambience and Leilani the bartender is cool and super knowledgeable. This will be my regular spot for sure.", "author": "Jeehyun T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-03", "description": "Tasty, consistent and inventive drinks.  Can get a bit LOUD with all the hard surfaces but overall a cool nifty bar to have in the 'hood.  We stopped in recently for pre-dinner drinks and had a blast.", "author": "Rick G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-18", "description": "This tucked away bar doesn't feel like SF..in a good way. The drinks are wonderful, inventive and strong and the space gives you room to breath and relax.", "author": "Etha D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-18", "description": "Three drinks for $20, it was happy hour but pretty good deal for this town!  Two of them custom drinks per bartenders recommendation, and he nailed what we were in the mood for with both.  Chill atmosphere, very nice staff, great selection... wouldn't change a thing.", "author": "Joe B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-02-09", "description": "If I lived in the neighborhood I would come here all the time, but it's not really worth the trek. Drinks were good but a tad pricy and the crowd was very good looking.", "author": "Kate M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-09", "description": "I love the fact that an amazing bar with even more amazing beers on tap is just a  few blocks from my house in Bernal. The staff is great, always making sure you are hydrated with water and never have had to wait to long for a drink. Music is always a plus for me and this place never disappoints in their selection.", "author": "Nico B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-01", "description": "Excellent bar! I frequent this place during weeknights and it is always a great experience. The bartender is really friendly. And they have great beers to boot! Would definitely recommend.", "author": "Amy L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-07", "description": "one of my favorite bars in the city, hands down. Great cocktails, very cute, mellow.", "author": "Fred A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-14", "description": "Much needed upscale addition to Bernal.\n\nBartenders are really friendly.\n\nComfortable, welcoming vibe.\n\nCocktails were fantastic & reasonably priced $9ish (Moscow Mule was one of the best I've ever had).\n\nDecor is a bit gray for my taste (think industrial w hint of rustic). Definitely look up & admire the Japanese block print wallpaper on the ceiling. lighting & artwork make for great conversation.\n\nJust opened so if wasn't crowded but I'm sure that will change :-)", "author": "Amy B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-10", "description": "What a nice surprise in Bernal! We don't spend too much time over there but now we have a reason to leave our hood and head over. Great drinks and really nice staff. It's reminiscent of their sister spot Churchill but much more of a local hood feel. The only downside is that it's not in Noe Valley - we need something like this over here!", "author": "Cynthia L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-23", "description": "I made my first pilgrimage to Holy Water during the Fiesta on the Hill celebration on Sunday, Oct 20th.  The spiritual rebirth of Stray is complete.  The sanctuary and sacraments are truly born again.  The bartender (Cora?) was transcendentally charming and attentive (and I am not used to such attention as I am 25-30 years older than the typical patron at these kind of places). Yea, though I walked home through the valley of the shadow of death, the mescal cocktail I had delivered me from evil and restored my soul.  I will come here again and again.", "author": "John T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-05", "description": "definitely my favorite bar in SF. the best drinks, best decor, and overall best environment.", "author": "Anthony A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-08", "description": "I'm a local, and while I miss the old Stray Bar, I really, really like this place. It's low-key, and it doesn't have any of the pomp of other places with a similar repertoire of cocktails on offer. The prices are reasonable, the service friendly, the bathrooms clean, and the space is nice. And it still allows dogs and shows the games when they're on. I think it's a great addition to the neighborhood.", "author": "ashley h."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-05-06", "description": "the atmosphere aint my deal but the bartenders were really cool and their are multiple local beers and spirits which is dope...other than that tho theres not enough for me to want to frequent it...", "author": "Bane V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-22", "description": "went here with a friend Saturday nice.  fun place.  good drinks, service was good too.  I think I may have had one too many, he he", "author": "Alejandra H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-30", "description": "Chill atmosphere, great cocktails, excellent staff, good crowd and a solid beer selection. If nothing on the cocktail menu suits you, then the guys behind the bar are nice enough to mix up an off menu drink. It's so refreshing to find a place where the bartenders are happy to make you a cocktail instead of acting aloof.  Keep up the good work.", "author": "Jonah N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-19", "description": "great atmosphere and good drinks.  it was nice that the bar wasn't super crowded like other parts of the city.", "author": "Lucas F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-20", "description": "Excellent cocktails, friendly bartenders, prices are good.  The ice in the Moscow Mules helps make the drink!  I am a big fan of equal coldness distribution and this is super refreshing.  Good beer selection - would be even more superb if they added a seasonal brew like He Said 21st Amendment for Fall instead of the Watermelon Wheat.  It is noisy with the concrete walls and floor, but all and all, a great addition to the neighborhood!", "author": "K V."}
