{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-25", "description": "This is a great spot if you're still craving dessert after scarfing down some delicious Asian food in the area. The soft serve portions are pretty small. If you're concerned you can always share with a friend. \n\nI got the POPCORN SOFT SERVE. I like having a good crunch with my ice cream, and this did just the trick. There is plenty of popcorn on the top as well as in the center (genius). They drizzle caramel in it as well to give it an added flavor. The soft serve was perfectly creamy. \n\nI would definitely come back to try some of their other flavors.", "author": "Kevin N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-11-02", "description": "Stumbled across Honey Creme after eating dinner across the street. My boyfriend and I ordered the Strawberry Milk Tea and a Cotton Candy Affogato. \n\nI thought the drink and soft serve was ok. However, my boyfriend loved it. Not sure if its because he loves ice cream, cotton candy, and coffee. But, he loved it. He pretty much devoured the soft serve and I probably ate a couple bites. \n\nI would return if I was in the area, but I probably wouldn't go out of my way to return back. The place is worth a try if you are in the area.", "author": "Kathleen L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-09-30", "description": "I've seen this place all over, and finally came down to try it. I came here with a couple of friends on a Saturday afternoon around 2pm. There were only a few seats, but it was empty so there was no problem getting a spot to sit. We asked what flavors she recommended and she told us the most popular was the honey or the honeycomb. \n\nWe got the honeycomb ($4.75) and added boba ($0.50). Honestly, it was kind of underwhelming. The ice cream was creamy, but had no flavor whatsoever, unless paired with the honeycomb. There was only one chunk of honeycomb so it was hard to spread it with the rest of the ice cream. I wish they layered honey in it (though I guess that's why they have the honey flavor you could pick). It melted pretty quickly (but I guess that's understandable with soft serve). The boba was good and soft, so I would definitely get that as a topping again. Also, a bit pricey for the size of the dessert. \n\nI would be open to giving this place another try if I was in the area, but I would probably get a more flavorful option, like Chocolate or Oreo.", "author": "April L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-29", "description": "Honey Creme is an international chain from South Korea and they've started a slow expansion to the US with San Francisco being their first West Coast outpost and Milpitas being their second. \n\nIt's a small shop located in the Sunset district and is a few blocks from San Tung.  The interior has limited seating but it's clean and bright and features a large, easy to read menu highlighting their signature soft serve options and their flavored ice cream cone choices.  Our order:\n\nHoneycomb Ice Cream - $4.50. it's a beautiful dessert with luscious swirls of milk soft serve mixed with ribbons of honey and a very nice and impressive cube of real honey comb on top.  Flavors are delicious and it's easy to see why this shop has the hype behind it.  The soft serve isn't too sweet and the honey matches very well with everything tasting fresh, organic and high quality.   Several other patrons tried the cotton candy version and it's also impressive and great for sharing.  \n\nIf there's one caveat, it's that the close-up photos all make the desserts look larger than they are in real life.  You really don't have a good reference in the store but if you can see their cone selection, you notice how petite the desserts are and the cup choices are similar in size. \n\nOverall, even with the smaller than expected size, I loved the flavors and thought it worth the cost.  I look forward to Honey Creme's continued expansion and will look out for a Peninsula location if they have that in their future. \n\nHoney Creme accepts credit cards including Amex.", "author": "Randy F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-25", "description": "This place is a little pricey, but it easily became one of my favorite dessert shops to visit whenever I'm in SF. It's a small shop and is rarely busy (perhaps due to minimal seating?), but the quality is great.\n\nMy go-to drink is the honey green tea with 75% sweetness. I recently tried the honey milk tea and that was pretty bomb too. I appreciate how the tea flavor is still apparent in all drinks they make.\n\nOne of the unique things about Honey Creme is their soft serve ice cream. The earl grey with boba is PERFECTION. Boba is well cooked with a nice chewy consistency and the earl grey has a fragrant flavor.\n\nParking can be really difficult since it's metered or street parking. My boyfriend usually drops me off and I run in to order. We're from Sacramento and we've filled up two stamp cards now... so yeah, we love it!\n\nBonus: There's a restroom! Yay!\n\nDefinitely visit if you're in the area!", "author": "Karen T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-09-02", "description": "Okay dessert place in Irving street\n\nI got ice-cream with honey comb ($4.75). It's soft serve icecream with honey comb. Nothing special. For the price, I'd rather go to gelato place nearby lol If you've never had one before, it's worth a try though!", "author": "Clare L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-13", "description": "One of the best and yummiest soft serve places in SF!\n\nI really like Honey Creme because their soft serves are not too sweet, and although it doesn't look like much, it is actually pretty dense and filling. They also have a lot of different items on their menu like smoothies and coconut pudding. \n\nIf you are unsure of which flavor to get, you can ask for a sample. The cashier/worker was super nice and patient. I decided to go for the earl grey soft serve (their new seasonal flavor) and my friend went with the original with a shot of espresso. The espresso and the slightly melted soft serve, made it taste like coffee soft serve. \n\nBe sure to get a stamp card too, so you can save up and get that free soft serve!", "author": "Kristine P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-10-19", "description": "I had been wanting to try this spot for a while, I really liked the concept of this place and the desserts looked really tasty in the photos! I ordered the soft serve with rainbow sprinkles and a honeycomb for about $5. When I received my order, I was surprised by how small it was compared to the way it looked on the menu photos. I neglected to convey that in the photo I took, but for lack of a more uniform comparison- it looked the size of a Starbucks small coffee cup in the menu photo and came out a similar size to the Starbucks espresso cup. Main reason for the low stars- the actual soft serve was bland and completely nothing special! I've had better from a fast food chain. :/ It looks good in the photo I took, but that's no substitute for actually BEING good!", "author": "Shav S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-03", "description": "Service with a smile. Plus delicious soft serve. \n\nI returned today after visiting shortly after they first opened. I then tried the organic mixed grains. It's a subtle combination of savory and sweet.\n\nThey now offer tea, shakes and slushes. The choice of milk is whole or half and half. I ordered a matcha latte with half and half. It was nicely balanced - not too sweet or bitter. \n\nI will return to try other options - probably the honey comb with the soft serve, since I noticed many people like it. They also offer seasonal flavors of the soft serve, with a great variety of toppings. Visit when you're in the area!", "author": "Carol W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-07-15", "description": "My wife is a huge fan of HoneyMee from LA.  So naturally, we decided to check the place out (on National Ice Cream Day, nonetheless).  The thing that makes Honeymee is delicious is the flavor of the soft serve combined with the great tasting honey (and honeycomb).  \n\nThe flavor of the ice cream was lackluster, making us question why we were paying $4.50 for McDonald's level ice cream.  Also, it's an extra $1 for the honeycomb.  I can appreciate the store supporting our bee's, but that's a bit steep.  \n\nI tried the cereal ice cream, which wasn't bad, but again, for the price that we were paying, I'd want something better than \"not bad\".  All in all, a solid place, but I wouldn't make the trek out there, unless David Chang decided to feature it in an episode of Ugly Delicious.", "author": "Jason L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-09-30", "description": "The soft serve was mediocre, you get overcharged for the tiniest square of honeycomb and the cotton candy topping is course and dense. Staff is nice, but passing next time.", "author": "Rachelle T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-03-09", "description": "Thought the soft serve here was very similar to The Milk Bar in NY. I ordered the honeycomb on the original soft serve. It was my first time trying honeycomb but I had some expectations on how it would taste and feel. The honeycomb in everyone's photos here on yelp looked goopy and moist but the one I got was kinda dry:( Once the topping was gone, I got kinda bored with the soft serve alone so I tossed the rest. It just wasn't sweet enough. My friend had the dark chocolate which was good... but don't think either was worth $4.50.\n\nWe came in after dinner on a Thursday night. Parking was easy, found a spot right out front. The seating is limited. The place is pretty small. There was a group of very loud teens we had to sit like elbow to elbow with. But once they left it was alright.", "author": "Mary R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-24", "description": "I have been meaning to try this place because of their tea soft serve and boba! The seasonal flavor i got to try was the earl grey tea soft serve (not sure if they had black tea before.)  The soft serve tasted just like earl grey tea and the boba was perfectly cooked! I do have to say, the soft serve was a tiny bit icy but I didn't mind it as I have been craving tea flavored soft serve for awhile. I'm not sure if the other menu items are like this, but I would still come back to this place is they make the season flavor a permanent menu item!", "author": "Jacqueline T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-11", "description": "Two things I'm a sucker for: Soft Serve and honeycomb. And MATCHA. Ok 3 things.\n\nThats what I had:\n\nMATCHA SOFT SERVE w/HONEYCOMB - $4.25\nI really enjoyed this refreshing desert. Don't expect it to look as green as the photo, and you probably wouldn't want it to, haha.  The honeycomb gives it it this extra texture of sweetness, on Top of the subtly sweet and creamy matcha soft serve. \n\nThis place doesn't seem to get so busy so there's plenty of room to sit and enjoy your soft serve!  The staff is friendly and I enjoyed my time here.", "author": "Tu-Anh N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-05", "description": "The honeycomb cone was delicious and just the perfect portion size.  I love me some honeycomb!", "author": "Roger E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-03", "description": "Surprisingly a great place for boba. I loved my drink and actually was pleasantly surprised having their soft serve. Parking around this place is horrendous just like any SF establishment but their drinks and ice cream made up for it many time over. I didn't enjoy their avocado drink that much though. Try out their soft serve, it's good.", "author": "Jan R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-04-22", "description": "Came here and got the honey soft serve. It really was just ok ice cream and there was honey drizzled around. Considering that was their speciality, really expected something special. The portion is also really small. The photos make it look much larger than it really is.\n\nAll in all, I feel like this is just basically Dairy queen soft serve with honey.", "author": "Victor D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-04", "description": "Pretty solid boba and dessert place for San Francisco.\n\nCame here and got a bunch of drinks with Honey in them. they didn't disappoint.\n\nI tried the cereal ice cream and it was just okay, but definitely come by for some decent (very sweet) drinks and dessert!", "author": "Andrew T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-10", "description": "I love cereal milk from Milk Bar so it was such a pleasant surprise to see cereal milk at Honey Creme! However, it honestly can't compare to Milk Bar. At first I thought it was great Bc it's so creamy! But I wish the soft serve was a little sweeter. \n\nBut I love the organic grain mix!! It's super delicious! I'll just stick with that from now on :)", "author": "Janice H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-13", "description": "I had the earl grey and milk soft serve swirl with honey drizzled on top. The froyo wasn't very sweet, which I loved, and it was really fluffy. Don't think I've had that texture of froyo before but I liked it. The honey flavor was pretty subtle. My friend ordered their matcha boba tea and thought it was too sweet and not enough matcha flavor. I'll check it out again when they change their seasonal flavor.", "author": "Alice W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-11-26", "description": "Walked by Honey Creme & Tea after dinner close by. My girlfriends and I wanted a small treat and decided to go in after seeing all the delicious photos/selections on the menu and how it reminded us of HoneyMee.  We shared one Himalayan Salt Dark Chocolate. The soft-serve was smooth and milky. The milk flavor was a little too empowering for my liking and I was pretty much finished with my portion after 3 scoops. \nThe shop doesn't have many seating options. There is a long bench against the front window to enjoy. Luckily, we were able to find space on the bench to sit and eat on a Friday night.", "author": "Michelle S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-29", "description": "The One Where Sandy Bought Soft Serve in the Cold.\n\nSo... this place is aite.  I think I was just surprised with how small the serving was for the price (I mean, I could have gotten a pint of Magum at Safeway).  Regardless, the soft serve was still tasty.  I had the Dark Chocolate and my hubby had the honey comb.  The store uses something similar to the \"magic shell\" you can buy in stores where it turns the liquid dark chocolate to a hard shell upon impact with the cold.  It was a nice touch. \n\nThe honey comb is probably my favorite because what's not to love about a honey comb?!  \n\nWas it the best soft serve I'd ever had? No.  Would I come back again? Probably not.  With so many other dessert joints, I will only come back if my friends from out of town asks to go.", "author": "Sandy H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-09", "description": "Love this place. It's expensive. But it's luxury comfort food with soft serve and honey. \n\nWe came here Sunday night right before close and the two gals behind the counter served us up right.\n\nI ordered the honey comb, and the ice cream assembler didn't put my honey comb on top of the cone well and it plopped on the ground. She gladly gave me a new honey comb piece. \n\nTheir creations are so trendy and instagram worthy. \n\nMy friend also got the cotton candy topping which tasted like honey and was to die for. \n\nHONEY HONEY HONEY!!! I love this place. You've got to come here anytime you come to the city. No complaint, always perfect.", "author": "William R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-09-22", "description": "Under \"Ice Cream\", they have listed a variety of flavors, or so I thought. Ordered the \"Dark Chocolate Ice Cream\", but instead received vanilla soft serve dairy with dark chocolate fudge....for $5!\n\nTurns out this place only sells 2 flavors of \"ice cream\" and everything under \"ice cream\" are merely toppings. Told them they need to rename it to \"Ice Cream Toppings\". The last time I was this disappointed, I purchased Vietnamese springs rolls for $7 and two Chinese egg roll sized (cut into 6 pieces) was served.", "author": "Ben P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-18", "description": "Honey Creme & Tea is your standard soft serve ice cream place around the corner. It is 'instagrammable' but other than that I don't think it has the big 'it' factor compared to the other ice cream places in SF.\n\nLocation: It's on Irving where there are plenty of asian food places. I came after studying at the UCSF library. Small intimate shop and there are seats and tables inside. \n\nSize and price: Pretty much as everyone said here, the serving size is smaller than it appears on camera. Take your average milkshake that you get a your fast food place and cut it half for a visual representation. It is $4.50 for a cup with toppings. There is a picture of the menu here.", "author": "Amica J."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-10-15", "description": "Trick of the eye... not everything instagrammable actually tastes delicious I have come to learn.\n\nBasically, I'd rather pay $1-2 for a McDonalds cone than eating an overpriced but beautiful treat here. The consistency definitely veers on the creamier side. I think the soft serve itself lacks flavor (not sweet enough for me I think!)\n\nAround $4.50 each. Pricey but if you're looking for something cold, it beats paying $8-9 for Froyo across the street.", "author": "Cindy W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-11-06", "description": "Honey Creme is not to be confused with the popular LA chain. The store is very cute, and the service is nice, but the frozen yogurt is pretty mediocre and the avocado smoothie was not tasty.\n\n* Avocado Smoothie - 2.5 stars: Tasted really thick and bland. Boba was not good.\n* Matcha frozen yogurt - 3.5 stars: Pretty good but prefer Matcha Love in San Jose. They have one seasonal rotating flavor. \n* Original - 3 stars: As most described, this is pretty bland and probably intentionally so because it is served with honey. \n\nCute IG-worthy spot, sub-par frozen yogurt.", "author": "Jess C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-15", "description": "Great soft serve in Inner Sunset! I came here with a friend on a Friday at around 2pm. The place was pretty empty, so we decided to eat there. We shared a honey soft serve, and it was delicious! Just enough sweetness without it being overly sweet. And since we both weren't that hungry, it was the perfect size. While we were eating there, they were also playing some kpop (for all you kpop fans out there), and the service was quick and efficient. Overall, this is a great place to grab some dessert, and I would definitely come back and try their other flavors!", "author": "Lisa C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-09", "description": "The affogato soft serve combines creamy soft serve & great coffee flavor. Personally think it's one of the best items on their menu. The size is not too big where you feel overwhelmed either. The Oreo shake with boba is also a good creamy drink for those who enjoy cookies & cream flavor.", "author": "Nicole M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-11-30", "description": "I was so stoked to try this out since I didn't get the chance to the last time I was in SF. But it did not live up to my expectation. \n\nFirst of all, it's a very small shop and I think it was not so easy to spot while you're just driving past. There are also no tables for you to sit, so it is definitely a grab and go place. \n\nThey are famous for their soft serve using organic milk and the instafamous thing to order is with the honey comb of course. So I got the matcha, milk swirl topped with honey comb. The ice cream was smooth and soft, not very sweet at all and the taste was very mild (not too milky  if you know what I mean). And the honey comb pairs really well to complement the ice cream with some sweetness to it! However, the honey comb is pretty small so you really have to portion it if you want to have eat it throughout your ice cream. For the matcha flavor, I really wish that it would taste more like matcha. The taste was just very mild.\n\nI also got the avocado milkshake which was okay. Nothing too special.", "author": "Dream-Suphada L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-24", "description": "Came here for their seasonal flavor, Earl Grey. The soft serve was pretty good. My friend loved it! I would try their other flavors if I was in the area again.", "author": "Elaine G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-23", "description": "Honey Creme is my favorite soft-serve place in SF - my go-to order is the Cereal Milk (in a cup), though I've also tried the Organic Grain and Honeycomb soft-serve and would highly recommend those too.\n\nUnlike other ice cream places, Honey Creme's soft-serve is way more milky (which I love!), and not too sweet. It doesn't melt too fast either, so no need to hurry to gobble it down. The texture is creamy and smooth and pairs well with honey/caramel syrups.\n\nI usually come here once a week after getting pizza at Arizmendi's around the corner. Perfect place for a quick after-lunch dessert!", "author": "Yuan J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-08", "description": "Me and a bumble BFF was looking for a dessert the other day and found Honey creme usa! It was a warm day in the city so having something that will cool us off is a great idea! We love their soft ice cream because it's light! They have Earl Grey as their seasonal flavor it's really good and The affogato is good too!", "author": "Emily Ann F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-07", "description": "We love honey and ice cream- have had it a few different ways- this was nothing special- got two ice creams- one honey drizzle and the other just honey comb- wish this was just one option- honey drizzle with a piece of comb- I also was looking forward to the green tea ice cream with honey comb but I guess it was seasonal. Seems like a popular thing right now and the other flavors on the menu shadow next to the option of green tea. The cotton candy is a cute option. \n\nIt was really hot and muggy in the building and wish we had access to like water or something - a lot of ice cream places do... maybe it's an SF thing. \n\nLastly was sorta dirty the counters were dirty and the tables were dirty- the display case kept confusing customers. Twice while I was in there people kept trying to buy items that look like they are for sale in their case but weren't.\n\nAnyway- I'd probably look for something else to try before coming here again.", "author": "Jennafer F."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-10-04", "description": "Been wanting to try this place for a while, but sadly, it was a disappointing experience. The portions are really small for what you get, and the soft serve is extremely bland. I generally prefer my ice cream to be semi-sweet, but seriously there was no flavor at all. There was a bubbly woman working behind the counter, but she wasn't very helpful when it came to helping me decide what flavors to try. I let her know that it was my first time, but still no suggestions, even when I asked for some. I ended up just ordering an original on a cone and an Oreo soft serve.  Also being a honey lover, I was curious to see what the honey flavor tasted like, so I asked if I could try a small sample. She seemed a little confused and unwilling to offer me a sample. But once she finally did it was a tiny droplet. Seriously the tiniest droplet ever LOL. Honestly, I was taken aback at how stingy this business was with even a small sample of honey. Most ice cream places will offer you at least a sample or ask you if you want to try a flavor, but forget about it at this place. I found that surprising and off putting. Having ice cream is supposed to be a cheerful experience, but certainly not here.", "author": "Phan .."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-10-29", "description": "It was ok but really not that much better than soft serve anywhere else. Definitely not amazing. The honey and honeycomb is great but the main thing is the soft serve so meh... the honey would go great on Salt and Straw ice cream...!", "author": "J D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-09-10", "description": "Sigh, I really wish this place served ice cream as good as it looks.\n\nWe came here after a long and hot afternoon wandering the Japanese Tea Gardens. I ordered the option with the Caramel Popcorn on a cone.\n\nHonestly, I should have gotten one of the cup options. The cone itself was brittle and weak - after a couple licks, the ENTIRE TOP LITERALLY BROKE OFF. I wasn't able to finish my cone because the top (that was holding the bulk of the ice cream) literally broke off into my grungy hand. I just threw the remainders of my sad forlorn ice cream in the trash. \n\nThe guy behind the counter saw me throw my ice cream in the trash. He then said \"Oh i was going to offer you a cup for your fallen ice cream\".  Obviously it was too late BECAUSE I JUST THREW IT IN THE TRASH, DUH. I'm not sure if this is terrible of me to say, but I almost expected/hoped he would offer to make me a new cone. It was obvious that I barely had any before the entire thing broke off and went into the trash. Wouldn't it be better for them to spare an extra scoop of ice cream in exchange for a better Yelp review? Because that service would have definitely helped.\n\nThe milk ice cream itself was only tasty on the first few licks. After a while, it just became bland and tasteless. The Popcorn was a bad idea because it kept falling on the ground as the ice cream melted. All around just a bad design.\n\nSkip this place - it might look nice for the photos, but you're not getting quality desserts. Also, don't be fooled by the colored cones on their menu. ALL their cones are the normal boring beige color.", "author": "Rebecca W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-23", "description": "Sooo yummmyy. It was my first time here and I tried their new \"Cereal Milk\" flavor, which was layered with cereal bits and caramel. My friend got the plain soft serve with honey and that one was really delicious too. \n\nThe only reason why I'm not giving it 5 stars is because service was a bit slow. There was a family in front of us that had already ordered (who knows how long they'd been there) and was waiting for two bags of cotton candy. My friend and I got our orders the same time they got their cotton candies, but even that took a while. To be fair, there were only 2 people working but it looked like they were taking their sweeeet time. \n\nRegardless of time, it was still good and I'd probably come back. Just don't expect to get your ice cream right away.", "author": "Vivian L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-03-04", "description": "I've been to this place a handful of times since I live walking distance, and it's not a place I would rave about, but it's not bad. \n\nI've tried the original flavor with honeycomb, the affogato, the matcha soft serve with honeycomb, and the original with grains. First of all, the original flavor is pretty plain. I appreciate that it's not overly sweet, but I would have to say it's more on the bland side, and out of all the toppings I've tried so far, the affogato would have to be my favorite because the espresso makes up for the bland flavor. The honeycomb is aight and the mixed grains is the worst so just don't get that one. I honestly didn't know what I was thinking when choosing that. The mixed grains added to the blandness of the soft serve if that's even possible and made it dryer. Lastly, the matcha wasn't matcha enough. From the pictures on their menu, I expected it to be more green in color, but whatever as long as it tastes good, right? Well, the matcha flavor was hardly noticeable either! Not super impressed but like I said before, they're not bad and I would probably go back. It is in the pricier side of things because each soft serve is $4.50 - $5 and the portions are smaller but I don't mind that part too much.", "author": "Christina C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-28", "description": "The first warm day of the year in SF and I found myself walking home from work and needing a co treat.\n\nI've walked by Honey Creme & Tea since it opened, but today it called to me!\n\nWalked into an empty store front and was greeted by a small, clean space with a cheery employee.\n\nThey have a large digital display of their offerings and The moment I saw Affogato I knew I must have it!\n\nMy order was served up quick. I first tried the soft serve by itself. A white velvety soft Creme with a very mild, not too sweet flavor. Then I dug down to that still slightly warm expresso and spoon to mouth... BOOM I was hooked. \n\nSpoonful after spoonful of the glorious Creme and coffee until the bitter end. \n\nLoved it! I'd stop in again for sure.", "author": "Meghan L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-04", "description": "Excellent excellent excellent. Both flavors, earl grey and milk, are extremely delicious and fresh tasting. Every flavor looks bomb. They serve one with fresh honey comb. We tried the half and half Oreo, the milk and cereal, and the milk with rainbow sprinkles. Everyone of them was bomb. But my absolute favorite is the coconut pudding. So fresh and light and yummmmm. Want to try all the flavors!!!", "author": "Alex K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-31", "description": "Cute spot with very instagrammable desserts. I got the classic vanilla soft serve with honey and while it was more or less what you'd expect, it was the perfect sweet treat at a pretty reasonable price. Wish we had one of these on the East Coast!", "author": "Cheng X."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-11", "description": "I always end up coming here on my cheat day for their earl grey soft serve ice cream or grapefruit tea when I want something refreshing.", "author": "Pee W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-07-02", "description": "To be honest, I wanted to like this place more than I actually did. I'm the kind of person who desperately craves soft serve ice cream, so I stopped by to get some one night. I think the soft serve itself doesn't really have much flavor and it leaves a bit of a weird aftertaste. Also, the portion is super small for the price you pay. I did however think the mango slush with lychee jelly that my boyfriend got was quite good! So, I'd probably go back for the slush but it's definitely not one of my go-to places.", "author": "Claire C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-03", "description": "I love love Love Honey Creme! I am a huge fan of soft serve so I've been excited to try this place for a while now and I'm so happy to say it did not disappoint. The soft serve is so rich and creamy without being too sweet and the addition of the honey compliments the soft serve perfectly. I got the cereal milk so mine was topped with some type of cereal that tasted like a mix of Frosted Flakes and some kind of cinnamon granola...not sure what it was but it was bomb af! Very much looking forward to trying other toppings as flavor combos!\n\nI'd say the only downside is that it's kinda pricy for the amount of soft serve that you get but I don't mind that too much.", "author": "Paige M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-14", "description": "Amazing and thoughtful service. My son loves the honey cup, my husband loves the affogato cup and I love that they make the effort to use organic milk and honey as a sweetener. Tonight, the little one wanted to try the organic cotton candy cup and we were awestruck when it came out. So much fun.", "author": "Vicki H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-09-15", "description": "Got the regular frozen yogurt with honey. It was not very good.. the frozen yogurt had no flavor at all.. I tried a sample of it, but thought I'd give it a try anyways. \nMy friend also tried their new earl gray flavor. Tasted pretty good but wasn't anything special. Probably wouldn't come back.", "author": "Steph W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-04-19", "description": "Giving this place 3 stars because there are many ice cream shops popping up along the same vein that serve similar items--milk flavored ice cream with various toppings, and I've definitely had better. I happened to be on Irving St. for dinner, and spotted Honey Creme while walking up and down the street waiting for San Tung wings. \n\nFirst impression: I was immediately drawn in by the minimalistic decor--everything was very neutral with white and wooden walls, which I appreciated. They also had a super cute rotating rainbow ice cream cone display which made for aesthetically pleasing pictures! I also was impressed with how many items were on the menu. I'm a regular at Milkcow in Fremont, which only has about 10 different topping combinations as compared to Honey Creme, which had many more. The store itself is pretty small with only one bench and no tables, so it's not really a good place to hang around with friends.\n\nWhat I Ordered:\n\nCereal Milk: (3/5) It was okay...definitely not bad, but not noteworthy or anything. It definitely looked better than it tasted, unfortunately. The ice cream was not very sweet, which is usually a good thing for me, but it didn't taste like anything at all which was frustrating. It also melted remarkably fast! The cereal on top was a nice touch, but didn't add enough flavor to the ice cream itself. \n\nService: They took my order quickly and promptly, and I didn't wait longer than 2 minutes for my dessert, which is definitely appreciated :)\n\nOverall, it's a cute, reliable dessert place, but I wouldn't go out of my way to come here.", "author": "Stephanie N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-04-14", "description": "Located two stores down from Manna, it's easily a dessert place after dinner. I went with the honeycomb soft serve and they had a special flavor of the month: milk tea. This is my first time but, I had soft serve(original flavor) at MilkCow before so I wanted another flavor. The milk tea flavor is pretty good at first, but the more I eat, the less appealing it was. It definitely tastes good with the honeycomb was it was also really waxy where it left little bits in my teeth(weird hmm). Once the honeycomb is gone, the soft serve is okay afterwards. The cup may look small, but 8oz of soft serve is a lot, easily shared with one or maybe even two others. Honey Creme is an alright place, I'd come back if I was craving soft serve. You get to take Instagrammable pics so I guess you can say it's worth it!\n\nINSIDE:\nThere is a long bench right next to the window display so you can sit and enjoy your soft serve. Kind of like Tpumps with the long bench.", "author": "Lisa W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-18", "description": "Ordered a popcorn soft serve and affogato soft serve. Taste pretty good. The soft serve doesn't have much flavor on its own but when mixed with popcorn and caramel, it gives a sweet taste. Overall experience was great and ice was good.", "author": "Lily T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-11-30", "description": "# 22 Honeycreme *Rod Boba SF Rating * 4/4 *Rod's Yelp Rating *2 stars \n\nHoneycreme I was not expecting to review but I cruised pass the place and noticed that they sold milk tea. I asked the lone  worker if they did indeed sell the magic goods I'm exploring and she confirmed my suspicions. \n\nThe drink itself had a stronger than normal tea taste which was not to my liking and the boba was slighly below average which caused it get a 4/4 rating in my (milk tea/boba taste 1 to 10 scale).  It registers at #22 out of 30.\n\nNice venue itself however.  Please see my comprehensive rankings below:\nRod M tours San Francisco in search of the BEST standard milk tea with boba. I have individual reviews for all the places listed below.  Check out my latest reviews for the most up to date list. \n\nI recently embarked on a completely pointless quest to rank most of the Milk Tea/Boba Places in the area.\n\nRules: I ordered a simple milk tea with Boba (regular sweetness, ice etc.)\n\nRanking explained:  #1 (listed at the top)  is my favorite/ #30  (listed at the bottom) is my least favorite. \n\nRod Boba SF Rating = (Taste of Milk Tea / Taste of Tapioca Balls) on a Scale of 1 to 10 (10/10) being the best score possible\n* Please note that I like my boba a little bit sweet. I don't like it too milky, too strong of a tea taste or too watery.  I prefer fresh tasting larger \"boba\".  Powdery drinks (those places that simply have a plastic carafe that they pour out of ) and boba that tastes \"old\" get docked on my rating scale. \n# 1 Itea *Rod Boba SF Rating * 9/9 *Rod's Yelp Rating *5 stars \n# 2 Puppy bobar *Rod Boba SF Rating * 8/8 *Rod's Yelp Rating *5 stars \n# 3 Asha Tea House *Rod Boba SF Rating * 7/9 *Rod's Yelp Rating *4 stars \n# 4 Caffee Central *Rod Boba SF Rating * 7/8 *Rod's Yelp Rating *4 stars \n# 5 Cool Tea  *Rod Boba SF Rating * 7/8 *Rod's Yelp Rating *4 stars \n# 6 The Boba Shop *Rod Boba SF Rating * 7/7 *Rod's Yelp Rating *4 stars \n# 7 Good Earth Café *Rod Boba SF Rating * 7/7 *Rod's Yelp Rating *4 stars \n# 8 Hanlin Tea *Rod Boba SF Rating * 6/7 *Rod's Yelp Rating *4 stars \n# 9 Keep it *Rod Boba SF Rating * 6/6 *Rod's Yelp Rating *4 stars \n# 10 Wonder Tea *Rod Boba SF Rating * 6/6 *Rod's Yelp Rating *4 stars \n# 11 Tpumps *Rod Boba SF Rating * 5/7 *Rod's Yelp Rating *4 stars \n# 12 The Ramen Bar *Rod Boba SF Rating * 6/5 *Rod's Yelp Rating *3 stars \n# 13 Sharetea *Rod Boba SF Rating * 5/5 *Rod's Yelp Rating *3 stars \n# 14 Tanca *Rod Boba SF Rating * 5/5 *Rod's Yelp Rating *3 stars \n# 15 Boba Guys *Rod Boba SF Rating * 5/5 *Rod's Yelp Rating *3 stars \n# 16 Steep (not Steap) *Rod Boba SF Rating * 5/5 *Rod's Yelp Rating *3 stars \n# 17 T&T Café *Rod Boba SF Rating * 5/5 *Rod's Yelp Rating *3 stars \n# 18 E Tea *Rod Boba SF Rating * 4/6 *Rod's Yelp Rating *2 stars \n# 19 Steap (not Steep) *Rod Boba SF Rating * 4/5 *Rod's Yelp Rating *2 stars \n# 20 Maggies Café *Rod Boba SF Rating * 4/4 *Rod's Yelp Rating *2 stars \n# 21 Sweet Heart Café *Rod Boba SF Rating * 4/4 *Rod's Yelp Rating *2 stars \n# 22 Honeycreme *Rod Boba SF Rating * 4/4 *Rod's Yelp Rating *2 stars \n# 23 Elixiria *Rod Boba SF Rating * 4/4 *Rod's Yelp Rating *2 stars \n# 24 Quickly *Rod Boba SF Rating * 4/4 *Rod's Yelp Rating *2 stars \n# 25 Plentea *Rod Boba SF Rating * 4/4 *Rod's Yelp Rating *2 stars \n# 26 Mi tea *Rod Boba SF Rating * 3/3 *Rod's Yelp Rating *2 stars \n# 27 Ten Ren Tea *Rod Boba SF Rating * 3/3 *Rod's Yelp Rating *2 stars \n# 28 Wonderful Foods/Dessert & Café *Rod Boba SF Rating * 3/3 *Rod's Yelp Rating *2 stars \n# 29 Out the Door *Rod Boba SF Rating * 3/3 *Rod's Yelp Rating *2 stars \n# 30 I Café *Rod Boba SF Rating * 3/3 *Rod's Yelp Rating *2 stars", "author": "Rod M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-11", "description": "Gave this place a try after dinner with my friend. I opted for the soft serve with dark chocolate which was creamy and not overwhelmingly sweet. My friend got honey which fit perfectly with the soft ice cream. I usually don't care about ice cream but it was surprisingly good not too sweet and went well with the honey.\n\nI highly recommend a stop in for a refresher! Sweet but not overly sugary! Just right for full filling a sweet tooth. :)", "author": "Lin L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-16", "description": "Simple concept: Throw some toppings on yogurt. \n\nWhile this may seem very \"been there done that\", the toppings that Honey Creme offers are more unique than other yogurt dessert spots I've encountered. For one, they put a straight up HONEY COMB in your yogurt. Whuuuuut. That's new. Also, (as the name implies) they love dousing your yogurt in liquid honey as well. \n\nMy recommendation is to try the new \"Milk Tea\" yogurt. I think it's far more interesting for the taste buds than the original flavor. Then top the milk tea yogurt off with these adorable chocolate beans and honey. Simple, but the milk tea yogurt gives it a little kick of flavor that makes Honey Creme more than a run of the mill fro-yo. \n\nBottom Line: Classic yogurt with a flare of honey(combs) buzzzzzzzzzzzz.", "author": "Jaime W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-14", "description": "I got the honey comb soft serve in a cone. There was not enough honey to go with the soft serve, so it got bland really quick because the honey gave flavor to the flavorless soft serve.\n\nThere watermelon slush bubble tea was refreshing, the pearls were warm but wasn't a problem because the cold slush made the pearls cold.", "author": "Sally W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-05-03", "description": "Frankly, this place feels to me like more of a 3.5 star rating. \n\nI ordered their soft serve ice cream with the cotton candy and my friend ordered the soft serve with the honeycomb.\n\nAt first taste, I thought it was really milky and creamy. But the more I ate, the more I felt that it was sort of plain. I don't think the vanilla and the toppings were that special in flavor. In addition, the cup was pretty small for how much I really paid for it (~$5).\n\nIt's definitely worth a try, but I wish the serving size was bigger.", "author": "Victor L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-10-07", "description": "Very similar to Milk Cow in Fremont, except they have matcha ice-cream In addition to the regular. I liked that both ice-cream wasn't too sweet. It was just sweet enough. The matcha didn't have enough matcha flavor compared to other ones I've had. As for the regular flavor, it was milky enough as the one at Milk Cow. Overall it was good, but not great. If I'm in the neighborhood and it's hot out, I will definitely stop by again.", "author": "Stephanie K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-09-22", "description": "I think the place and concept is really cool, that's why I tried the place. Overall, the milk ice cream is okay. Not too sweet or not sweet at all but I keep comparing to McDonald's soft serve. Maybe I'm not use the real milk flavor. I got the honey comb flavor where you will literally get a honey comb. The amount of honey given is very little to the ice cream so I really wanted more honey to supplement the ice cream.", "author": "Jackie N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-24", "description": "Cute little place with unique flavors. We had the popcorn ice cream and the flavor was just right! Would definitely recommend !", "author": "Gwendolyn W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-10", "description": "Ordered the Honey Comb ice cream, amazingly made! The ice cream is so creamy and delicate, I'm amazed. I also ordered the coconut pudding, it is light and fresh, perfect for summer. \n\nThe whole atmosphere is very nice. I will definitely be returning to try their other ice creams and snacks.", "author": "Marisa B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-11-13", "description": "I tried their matcha soft serve with a honeycomb, but I got a slight hint of the matcha flavor. I was kind of underwhelmed, I liked the honey more than the ice cream itself. I'd be willing try something else on their menu if I go back.", "author": "Leslie S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-08-15", "description": "I'm going to compare the soft serve I got at this place to the soft serve I know best, $1 cones from McDonalds. Comparatively, Honey Creme has much higher quality soft serve. It tastes well made. It's creamy and milky. I got the soft serve with popcorn and it added the perfect amount of texture and flavor. However, it is pretty pricey, close to $5. Even though it is higher quality, I don't know if I'm willing to pay 5 times more. AND parking sucks in this area, so if I was craving soft serve, you'd be more likely to see me going to a drive through under those glorious golden arches.", "author": "Kim W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-06", "description": "Came here when they first opened. Their concept is Korean soft serve ice cream with a drizzle of honey comb on top. Ice cream are made with fresh organic milk with cream and the honey comb is sourced from US bee farms. Not much flavor in the ice cream but they don't use artificial sugar which is a good thing. The honey comb is sweet which puts the sweet into the ice cream if you take a small scoop of honey comb and combine it with a scoop of ice cream and eat it like that! My biggest thing with this shop is their \"Hollow middle\". The ice cream itself is in a small cup already combined with a hollow middle, there isn't much ice cream you are getting. I told them about the \"hollow middle\" and they said that's how the machine makes the ice cream when it comes out into the cups. Thought I should mention that so first timers will know what they're getting into. It's definitely worth a try as they have many forms of soft serve ice creams to choose from including the organic cotton candy and pop corn soft serve.", "author": "Annie L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-07-29", "description": "5 stars for 'Gram-ability; 2 stars for creativity; 1 star for actual taste.\n\nI got to try the original and green tea soft serve flavors. Both were underwhelming. As other reviews indicate, the yogurt is not at all tart and tastes unsweetened.\n\nThe cones looked interesting, but the honeycomb really didn't taste like much. With so many other options in the bay area, I probably won't come back.\n\nParking situation is always tricky in SF and this spot is no different.", "author": "Michelle K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-10-07", "description": "I got the chocolate ice cream with caramel on top. I thought it was just basic plain ice cream. It was just instagram and snapchat worthy. The store is cute itself. It was $5.00 for one small cup. I don't think it was worth it. I rather go to Let's Roll that is 5 blocks away from that point.", "author": "Julia D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-31", "description": "Came to honey creme to see whether it was comparable to honey mee in SoCal... although presentation was similar, the taste of the organic milk soft serve is lacking in texture and taste. Like some of the reviews on here, the milk flavor tasted really bland with no milk taste whatsoever. The honeycomb was nice, but the serving size and price is not ($4.75). \n\nThe organic mixed grain was also disappointing as well.. tasted like crushed ice cream cone.... nope. Not paying for that when i can crush my own cones and buy vanilla ice cream from elsewhere.\n\nWill definitely try the other flavors, but not anytime soon.", "author": "Samantha W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-02", "description": "My favorite spot for ice cream after dinner or grapefruit tea when my coworkers and I need a break.", "author": "Paty V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-28", "description": "I loved the delicate sweetness of the honey with the smooth creaminess of the ice cream. T'was was one of the best combos i've ever had and is my favorite ice cream of the moment. PS to avoid the uber sweetness from the honeycomb topping if you were to just eat it on its own, i recommend taking a smidgen of honey with each bite of ice cream.", "author": "P C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-05", "description": "It's just soft serve ice cream with some toppings, but I really like this place. I've been coming back ever since I first tried it. If you ever tried Milk Cow in Fremont, it's very similar to that. Honey Creme is a lot cleaner and they take their time making the soft serve so it's not served messy. \nTheir soft serve with honey comb looks really yummy in pictures but the texture is hard and I didn't like the beeswax taste. The cotton candy with soft serve is alright, nothing special. \nI would only recommend the soft serve with honey in a cup or cone, but I prefer the cone the best. I love how they swirl extra honey in the cone, so it's not all just soft serve once you reach the cone. I also love how it comes with a piece of thin cardboard to stop the ice cream or honey from dripping onto your hand. There's something special about the honey that makes me come back; I love the taste.", "author": "Kristin H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-03-11", "description": "This place is very artsy but the actual ice cream is alright. The honeycomb is fun to eat and have but it isn't enough for the whole ice cream. I got the matcha and it doesn't taste like a strong matcha. All of the flavors are very mild. With all the pictures I thought that it would be bigger but in real lift the cup is smaller than my hand.", "author": "Samantha W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-11-23", "description": "The pictures are pretty, but for me, the taste did not really match up! I tried Honey Creme on a whim with a few friends since we dined next door at Manna. I got the soft serve with honeycomb, my friend got it with chocolate, and my other friend got it with honey. \n\nI would definitely recommend getting the chocolate and/or the honey. The honeycomb, while pretty, was not my fave because I didn't really like the beeswax feel or taste... It was too hard and I felt like I wasn't meant to ingest that. We saw people after us order the soft serve with chocolate and honey, and I can see how that would be a good idea. You definitely need toppings for the soft serve though! It sort of just tastes like frozen cream. Maybe a little more sugar, or vanilla..?", "author": "Tara A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-02-22", "description": "I told my sister I wanted an \"instagrammable day in the city.\" This was our first stop - because what Instagram account would be complete without a picture of something unexpected atop your ice cream. \n\nThe ice cream itself was good, but not amazing. It was dense and lightly sweetened, and I appreciated the accompaniment of real honeycomb (my dentist did not). The cotton candy was a fun touch, but made it difficult to eat the ice cream from the small cup beneath. Overall, while amused by the concept, I thought my order (plain soft ice cream, with honeycomb topping and cotton candy) lacked flavor. Perhaps getting the chocolate syrup or affogato would have better piqued my taste buds.\n\nTip: You can add cotton candy to any cup (at additional cost of course). The menu implies you have to get the plain cup if you want cotton candy.", "author": "Vivian N."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-05-25", "description": "I was entirely way too underwhelmed by this ice cream. I usually love soft serve and just wanted a little something sweet for a night cap, but this ice cream wasn't really sweet, it wasn't really anything. It was very bland, and at $4.50 a pop, I would have rather gone to the market down the street and bought a box of it's it's instead. Save yourself the trip and head to Hometown instead or even Easy Breezy or Let's Roll. All of these are better choices and more worth the $$$", "author": "Anna P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-29", "description": "This is probably my brother's favorite dessert place to go to because of his obsession for soft serve drizzled in honey. But I don't mind going with him as I love this stuff too! It's super creamy compared to the Costco very berry sundae. I wish they had a bigger size because we can never get enough of the soft serve! I highly recommend the soft serve with honey - very simple but delicious. You also get a stamp card for each order.", "author": "Sarah F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-21", "description": "Why is there not a line out the door?? These custom made little gems of organic soft serve ice cream with unique toppings and swirls are amazingly delicious. They are not your typical American gargantuan, but just the right size to enjoy. \n   Being the first time there, I asked for recommendations. They told me which were the most popular choices. I chose the chocolate Himalayan Salt Dark Chocolate and the Cereal Grain. The chocolate on top froze into candy like those swirl toppings that crack with your spoon when you go for a scoop-yum! while the chocolate swirled around the cup stayed soft and swirled into the ice cream. My husband, little daughter and I could not stop sharing the two until they were all gone. If this place were closer to home, it'd be my first choice for ice cream, over fancier places like Ici or Smitten! The combinations of flavor with texture are just delicious. It is NOT dairy queen, like another reviewer said. This is gourmet soft serve!", "author": "Helen L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-11-25", "description": "We went to Honey Creme around 4:30pm on Black Friday 11/25, and ordered the seasonal offering of the coffee milk tea and with the employee's friendly suggestion, chose the dark chocolate as our topping, since they did not have tapioca available.\n\nThe flavor was very light in coffee flavor, so those that are a lover of coffee may be a bit disappointed, but it may be better than choosing original, which it looks like some people are not a fan of because of the lack of flavor.  The dark chocolate gave it a little more depth of flavor and the bottom, which is where I was holding the cup, had more of the melted chocolate. It wasn't very creamy and we quickly finished the small cup.\n\nWait time was non-existent since there was no one inside the store other than one employee.\n\nPrice: $4.50 for a pretty small cup.\n\nWould I come back? Probably not since it wasn't that flavorful...\n\nRating: 2.5 stars out of 5 for OK flavors, cleanliness, and quick service.", "author": "Gilda W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-24", "description": "Honey Creme was amazing!\n\nSmall and simple soft serve shop. \n1 flavor ice cream (2 if you include the recently added Milk Tea flavor, not sure if it will be a permanent flavor though). Several different toppings. You can add more than one as long as it will fit. I got Honeycomb and cereal topping, mine came with a real wax honeycomb, extra drizzled honey, and basic cereal on top.The soft-serve ice cream itself is NOT sweet, it really does taste like frozen milk. For me, the honey adds just the right amount of sweetness, the honeycomb broke down easily oozing out delicious honey! YUMMMMM. Cereal was a nice crunch! The size is perfect....looks small, but it's enough! My boyfriend and I shared one cup.\nI will come back to visit again.\n\n*Parking was a pain. Look out for people walking to their cars, sitting in their car or just drive a couple blocks down. No biggie.", "author": "Rachel M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-08-23", "description": "The organic true milk soft serve is creamy, soft and not too sweet with a fun selection of toppings available. It's not that Honey Creme is bad, it's just a little boring. I've been here twice and both times, I gave up after a few scoops in because the taste is just a little bland.\n\nI've tried the dark chocolate and popcorn topping and I have to say that the popcorn (really kettle corn) is better. I had half expected the popcorn to be stale, but it wasn't at all! \n\nI didn't feel that Honey Creme is worth the price. Unfortunately, I think I'll likely always walk a few blocks to go to Easy Breezy for my dessert craving instead.", "author": "Tiffany U."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-16", "description": "There seems to be a trade off between healthy and lots of flavor. Honey Creme serves fresh milk soft-serve ice cream topped very simply with either honey, honey comb, chocolate, espresso (affogato), organic cotton candy, popcorn, or organic grains.\n\nI tried the soft serve ice cream topped with honey. It's definitely not overly sweet, but lightly sweetened with the honey. The flavors are very light and original and I definitely feel less guilty when eating because they are relatively healthy ingredients. \n\nHoney Creme is a Korean company that originated in Taiwan. They are already located in many Asian countries, but this is their first US location...in San Francisco! Most Asian desserts are not too sweet so this would fall in line with their style of desserts. It's definitely a very healthy and refreshing treat. There's not many ice cream places that keep it so simple. The shop itself is a walk-in shop with no tables or chairs, but there is a bay window for sitting. Definitely a good choice for those that like dessert yet want to keep it healthy.", "author": "Jean S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-07-18", "description": "I'm always lured into places like this. First Milk Cow in Fremont, now this place. I went out of my way to check this place out after gallivanting in SF. Of course finding parking in the area was a BIT CHallenging. \n\nMind you, it was a very hot day in SF, so I was surprised there was hardly anybody in the store. Came in and browsed their menu. After a few minutes of indecisiveness, ended up going with the original soft serve on a cone with a honey comb topping. When the lady took my order I pointed directly to the picture of the soft serve in a cone (on the placemat looking handheld menu). Ended up getting the soft serve in a cup. I was a bit disappointed when my order was up, but in the end it worked out for me. It wasn't as messy and complicated to eat...judging by how difficult it was for my friend who got it in a cone..she had it bad. lol\n\nI was underwhelmed by the taste of the soft serve. BASIC. I think the Mcdonalds soft serve tasted better and had more flavor. The flavor was so subtle. They should call it barely honey creme ice. The honey comb did compensate for flavor with it's sweetness. But towards the end, it was just a mouthful of wax that I rendered inedible and had to spit out. For the amount I paid, I could buy a Mcdonald's soft serve almost 5 times. Why am I always lured into places like this?", "author": "Vicky L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-06-12", "description": "Well, this place is a cute little shop on Irving St and had quite a lot of business the first time I walked past it. Seeing all the customers, I decided to try it the next time I visited the area. My friend and I visited around dinner time on a Thursday and was glad there was no line or no crowd. The staff was friendly and the venue was pretty small. There is only a tiny wooden bench area near the window. \n\nWe ordered the Honey to share. This is basically the original frozen yogurt with honey drizzle. The honey added a nice touch, but the frozen yogurt literally had no taste whatsoever. Compared to Milkcow in Fremont, Honey Creme is a bit lacking. It was a nice and refreshing cup of frozen yogurt but I wouldn't come back again. The flavor could use some improvement!", "author": "Catherine S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-08-08", "description": "I was craving soft serve so I found that honey creme was near by and I decided to give it a try.  It's pretty similar to Milk Cow in Fremont. It was a cold day so there wasn't anyone in the store so no line. The cashier was really nice and presented me with a menu when I walked in.  I wanted the honey comb but I also wanted some chocolate syrup so the ice cream wouldn't be so bland because I felt if I just got the honey comb it wouldn't be enough for all the ice cream in the cup.\n\nI got the chocolate syrup with a honey comb (To add a honey comb to your ice cream it's an extra $1)  So I paid $5 for a small cup of ice cream which was pretty expensive. The honey comb itself is good and is filled with honey but the only problem is you have to spit out the wax every time you bite into it. I think the soft serve could have had more flavor in it.  It was tasteless to me without the honey or the chocolate. \n\nOverall this place is just okay but if you're in the area and never tried honey with your ice cream I would say to check it out.", "author": "Sherry L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-02", "description": "Slightly different from standard US fro-yo flavors. The original tastes like plain greek yogurt in ice cream form. How is that? Cuz the recipe is Taiwaneezy, fo-sheezy. \n\nFor real though, straight from the website:\n\"Genuine Taiwan fresh-milk and dense whipping cream are the key ingredients in this fabulous Honey Creme recipe, making the ice cream soft and delicious.\"\n\nWa-Boom. There you go. I got the most popular flavor- Honey Comb (basically original w/ a chunk of honey comb). The honey complimented the plain flavor. For those who want to taste the rainbow, there are lots of topping options- cotton candy, boba, churros, cookies, etc. \n\nI like fro-yo. I like trying new things. And my taste buds skew toward Asian flavors, so I can appreciate this place.\n\nPS- For the millennials, this fro-yo is hella instagrammable. #nom", "author": "Joanna L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-12", "description": "Since its been super hot lately, I finally tried Honey Creme and thought it was good but not something to crave or go out of your way for. \n\nFor starters, 4.50 for vanilla ice cream plus toppings is not worth it for the taste and size, but totally worth it for pictures and for that yummy honey flavor. I am a huge honey fan, so I ordered the mixed grains and regular honey comb flavor. \n\nThe mixed grains has a lot of honey and texture to it so I highly suggest getting this. Their honey combs are good but have a waxy after taste! It's also an extra dollar to add a honey comb to your order of it doesn't come with it already. Compared to other dessert places, their Creme is very light and you can make it sweet by ordering the popcorn, coffee, or other flavors with it. If you order something more simple, you'll be left with just vanilla ice cream. So I suggest getting whatever has the most honey and toppings to treat yourself!!!", "author": "Eric Joseph D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-01", "description": "This place is worth the pain of parking! Though at close to $5 or $5+ per treat, this is definitely a treat. \n\nMy friend and I shared a cup of their honey flavor and added their organic cotton candy for $0.75 extra. I was quite surprised to see how tiny the cup was. However, one cup was plenty for the two of us! I wouldn't be able to finish one on my own! I loved the taste of the honey. Tasted light and fresh! The milk and cotton candy were also delicious!\n\nIt's a really tiny place with just one windowsill to sit. They should expand and add more seating with the amount of business they have. Just one person taking orders and one person crafting so you may want to be patient. Will definitely be back to try their popcorn and organic mixed grains flavors!", "author": "Kristi T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-05-25", "description": "With astronomically high rent these days, San Francisco businesses have to be creative in creating a product that's cheap to make with a good ROI.\n\nAlthough a Korean and Taiwanese franchise, Honey Creme is damn smart. \n\nHere's what $5 will get you:\n\nA cutesy instagrammable picture.\n\nExcept....\n\nI'm a dinosaur and don't use Instagram so I got a tiny flavorless cup of creamy blandness akin to a McD $1 soft serve (as others have mentioned) sans the vanilla and sugar.\n\nHit it and quit it, and onto the next hype...\n\nOTHER NOTES:\n*Honey Creme's first U.S. location.\n*Cute, novelty dessert item ($3.75 - $5.50) to instagram but nothing more. \n*Only one soft serve flavor available: milk. Thick, creamy consistency (melts quickly and there was a huge empty core) but taste like a plain ice cream base that someone forgot to add to. I'm a boring vanilla girl and I don't like cloyingly sweet items but this was just like eating \"creamy nothingness\" as another yelper had mentioned. \n*Must add toppings (honey, honeycomb, popcorn, chocolate, etc) if you want to taste anything but there wasn't enough honeycomb to evenly distribute to add some flavor. \n*For Asian soft serve ice cream, Matcha Love is infinitely better. \n*One small bench for seating.\n*Difficult street parking.\n*Cc's accepted.", "author": "Cherylynn N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-07-05", "description": "I think Honey Creme is hyped! It's a cute concept, but not worth it for the quality and price. I'm also comparing this place to Milk Cow in Fremont, which I think has better quality soft served ice cream and is cheaper. The ice cream at Honey Cream,to me, is reminiscent of McDonald's soft serve. It lacks depth and I wouldn't really say it's milky. The toppings, like honey and cotton candy, makes up for it, slightly. I also find this expensive as they give you a small cup for $5+ dollars. At Milk Cow, for that price you can get a large cup of creamy goodness. \n\nThis shop is pretty small and it has no seating. People end up sitting on the window sill or standing in the middle of the floor. As people kept coming in, my friend and I resorted to standing outside in the cold, with our cold desert.\n\nSince Honey Creme is the first of its kind in the area, I think it's an OK spot to hit up if you're in the mood. My friend says there's a Milk Cow opening in Tanforan mall, so Honey Creme would have to do for now.", "author": "Amanda T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-21", "description": "I've had an account for ever, but this is the first time I've felt the need to write a review. \n\nEvery time I'm in the sunset, this is the place I crave! My regular order is the mixed grain, but I also recommend the honey, or plain if you've never had milk ice cream before. The popcorn, affogato, cotton candy, and honey comb are all beautiful, but mixed grain and honey are sooo good!\n\nTheir milk ice cream is smooth, creamy, and not too sweet. Ask to taste their matcha, but honestly it's just not as good as the amazing milk. \n\nService is always fast and friendly. The place is convenient and always kept clean. Also, they have stamp cards! But I wish they used fivestars. \n\nHighly recommend!", "author": "Debra F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-07-14", "description": "I really don't know how I feel about this place...\n\nOn the one hand, who doesn't love honey and soft serve ice cream?\n\nOn the other hand, who would honestly pay almost $6 for honey and soft serve ice cream??\n\nI'll just quote the boyfriend on this one: \"I could make this from McDonald's ice cream and a packet of honey.\" (Though it won't look as hip!)", "author": "Lucy Z."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-06-21", "description": "I was super excited when this place opened and to be honest I've only been here once but it was actually pretty decent! \n\nI got the organic mixed grains with honey and wow! I'm surprised by how well it went together. It's true that the soft serve itself is not flavorful nor sweet, but it does have a creamy milk flavor that gets enhanced with the toppings! The mixed grains kind of tastes like sesame/ peanut powder and it gives great flavor! The honey makes it slightly sweet but not too sweet. \n\nMy friend did get the honey one and she didn't like it because it was too simple and didn't have enough flavor for her. She kept comparing it to mcd soft serve. But I feel like you can't compare it to mcd soft serve because they have ton of artificial flavoring and it's actually really sweet. So if this tasted anything like mcd soft serve and you added honey it would be way too sweet and would taste terrible. \n\nOverall, I would come back again for more of the organic mixed grains soft serve and maybe to try the other ones as well. \n\nTotal for 1: $4.50", "author": "Stella J."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-03-11", "description": "I tried this for dessert after eating at Manna nearby, and I was disappointed. I ordered the original with no toppings, but it really had no flavor. It was so whipped and airy that it just tasted more like whipped cream. I only ate a few bites and then threw it out (which I NEVER do with ice cream). \n\nIt's a cute little space, but the prices are pretty steep if the taste isn't on par.", "author": "Lauren A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-25", "description": "Reading previous reviews is rather entertaining: it ranges from complaints about the soft serve as tasteless, to relief for finally having a dessert option that's not overly sweet, to raving praise about this cute new shop, to musings pondering why people rave about Honey Creme.\n\nAs a paradoxical person who has a sweet tooth but continuously complains about desserts being too sweet, I rarely find mildly sweet desserts since evolution has shaped our population to gravitate largely towards sugar. Honey Creme satisfies my preferences, as their soft serve is deliciously more milky than sweet, well balanced between creamy and light, and notably photogenic.  \n\nI tried the Mixed Grains, consisting of a caramel drizzle and mixed grains that I couldn't quite identify. (In any case, I can fool myself into being guilt-free for eating something called mixed grains). As many Yelpers have pointed out, there is a hollow core but I found it insignificant since the soft serve is piled so high to a decent overall portion size. The main issue I found was the heterogenity of the toppings: most of the topping/sauce was on the top and the bottom, leaving the middle largely plain. I suggest mixing it well to avoid leaving disgruntled over plain-tasting ice cream.\n\nPrices are standard for dessert in SF, at $4.75 for a cup with topping and $5.50 for cone, and they even have a stamp card! (This is the city where $4 gets you a piece of toast or a cup of pour-over coffee.) I think I'll be sticking with the cups because I don't see anything too special about the cones, besides the colorfulness and the whimsical cone boquet decor. Along the same vein, their whole shop is clean and modern, with lots of good backgrounds for Instagrams.\n\nI will be back to try the other flavors, especially dark chococlate since it looks like one of those sauces that solidifies. The honeycomb is popular but in my opinion it looks odd and chewy, more for the looks. I also chatted with the servers to ask about upcoming flavors, and they said they will be adding a cereal one soon and a coffee milk tea soft serve in the near future! (Another reason to come back is because this time my nails were unpainted and I forgot to wear my rings... first world problems)", "author": "Edna C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-05-12", "description": "I really wanted to give them 5 stars, I really do! It was definitely 5 stars the first time I went at 9:30pm on a Tuesday night when there was nobody there. The soft serve was creamy, thick, rich and perfect! Honey was sweet and delicious. Totally hit the spot!\n\nThen I went again at 6:30pm Thursday and the consistency of the soft-serve ice cream was totally whack! It was icy and melted really quickly; it did not seem like it was churned long enough in machine. Nothing makes me more disappointed than lack of consistency in a place that I initially enjoyed and icey ice-cream!\n\n $4.50 gets you a small cup of soft serve with honey. If you also want to add a honeycomb, its an extra $1. I recommend going just for honeycomb only or straight honey only because both can make it overly sweet. I was just too greedy.\n\nI'm sure I will be back since I want to try the Affogato next. They brew the espresso with a Nespresso machine. Other flavors include popcorn, organic cotton candy, dark chocolate syrup, chocolate beans, and of course original. I really hope they get their consistency down!", "author": "Janny S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-27", "description": "I was very excited to try this place since the Sunset area doesn't really have a soft serve place that has toppings. \n\n-The concept of this store is very simple: soft serve with particular toppings. I ordered the popcorn soft serve and my friend ordered the honey comb soft serve. \n\nI would definitely recommend you to try it if you've never been here. It'd be a pretty cool idea if they had soft serve with boba!", "author": "Erica K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-02", "description": "Lots of critical reviews here, but I liked it. $4.50 for a cup of ice cream with your choice of topping. \n \nI tried the organic mixed grains and the affogato. Get the affogato if you're a coffee lover because it's topped with a shot of expresso, mmm. \n\nCons: there aren't tables or seats since the place is small. Also, $4.50 is a little steep for the amount given. \n\nOverall, I had a great experience here. Service was good, the ice cream was delicious, and portion size was perfect- not too small and not too big.", "author": "Corinna T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-05-03", "description": "FINALLY. Norcal is slowly catching up to Socal's selection of food/desserts. From boiling point to din tai fung to 85C to potted plant milk tea and now the ever so popular raw honey with soft serve. \n\nBad days call for comforting desserts. This satisfied my every craving and especially reminded me of good desserts from LA's Korea town. \n\nHoney creme is from South Korea and Taiwan originally. Reviews are asking, \"I dont get what's so special about this\" and people are wondering \"what makes this different?\" \nThe soft serve is made with fresh milk and creme and the honey is from the bee farms. If you're not super into fresh ingredients or if you're not too big of a food critic, then yes, you really won't care so much for this. \n\n::Dessert::\nHoney 4.50: If you dont like it too waxy/thick, this would be a better choice than honey comb. Light and refreshing. But if I'm comparing to the ones in LA, i think the soft serve was a little off. The honey was pretty good though. The first bite everything felt perfect. As I ate more and more the soft serve was not bold enough and felt a bit plain in flavor and there was definitely not enough honey. In socal, they have a whole bottle of honey  available on the counter for you to use. Overall still good though, I believe they will improve over time. \n\n ::Atmosphere/Service/Parking::\nThe place was very clean cut and simple. There are no tables only one long bench along the window. My friend and I came on a Tuesday around 8:30pm and there weren't that many people. \nService was good. The cashier answered all my questions. \nParking always sucks. It's Irving. But luckily we found a spot 3 blocks down. \n\nWill come back to try another flavor to write a better review:) Hopefully it wont disappoint.\n\n::Update::\nCame back for the dark chocolate!\nDark Chocolate: they sprinkle the cup with chocolate syrup then add in soft serve and top it off with chocolate syrup that hardens at the top of the soft serve. Overall a pretty good combo but again, something was off with the soft serve. I came with a different friend this time and she also felt that way too.", "author": "Chena N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-30", "description": "Grand opening on April 30th! I'm so glad something similar to Honeymee in SoCal opened in SF. \n\nThis is Honey Creme's first USA location. There is only 1 flavor ice cream with assorted toppings ranging from honey, popcorn, affogato, cotton candy or dark chocolate. You either have a choice to have your soft serve ice cream in a cup or in a cone for extra ($1). There are 17 choices you can choose from. \n\nHoney Creme's signature is Honey Comb Soft Serve Ice Cream. Of course, I had to try the honey comb on a cone. The presentation is simple and cute! The soft serve ice cream was simply plain and smooth. The honey comb added the perfect touch of sweetness to the ice cream. Perfect for people who want to indulge ice cream but don't want all the sugar. \n\nNo tables or much seating available, except one long bench. If this cute little shop is packed, you should probably just order your soft serve and eat it while you walk on Irving street. \n\nIt is a bit pricey for soft serve ice cream, however I'll pay for the presentation and the delicious soft serve. \n\nI will definitely be back to try the other flavors. \n\nWelcome Honey creme!", "author": "Kathleen U."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-03", "description": "Delicious organic soft serve ice cream that just opened in the sunset district!\n\nMy attention went straight for the affogato (soft serve ice cream with a shot of espresso) and they perfectly complimented one another. The organic soft serve had a perfect amount of sweetness and texture. The only complaint is that I didn't have more!\n\nI couldn't stop thinking about it and took my friends there the following day. I had their soft serve with honey and it was super delicious! I would highly recommend Honey Creme!", "author": "Linda K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-29", "description": "Today was their grand opening and since I've never actually tried the whole \"Milk and Honey\" combo before I thought to give it a try! It's finally made it's way to the bay!\n\nICE CREAM:\nThey serve only 1 flavor ice cream with a variety of toppings - majority honey themed (obviously). You have the option of either eating your ice cream in a cup or cone (+$1). The presentation is quite simple and nice. The ice cream itself tasted like heavy whipped cream but in ice cream form - in a good way. \n\nWe got the ice cream in a cup with organic grains and honey. I liked how they add honey and grains at the bottom and the middle of the ice cream so you get a mix of everything. They were pretty stingy on the honey and no surprise there was a gap in the middle of the ice cream.   \n\nFYI, the ice cream in a cup is way smaller than it looks - mini Starbucks cup status. \n\nSERVICE:\nI had a lot of questions and the cashier was really nice and answered everything :) Since there was no one waiting in front of us, our order came out within 2 mins. \n\nAMBIANCE:\nVery clean and brightly lit. There's only 1 long bench for seating and no tables, so be prepared to order and go elsewhere to enjoy your ice cream! \n\nOverall, love that this whole milk and honey thing has made it's way to the bay, and definitely want to try other place now, so I can compare and contrast. It's a bit pricey in my opinion for the amount you get, but I will be coming back to try their other flavors!", "author": "Samantha F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-05-01", "description": "Meh.  Soft serve is crazy popular in Asia and when I heard that Honey Creme is opening their first US location and in my hometown out of all places, I was thrilled!!  While service was friendly, their soft serve did not blow me away as I had expected.\n\nDon't get me wrong, the soft serve itself was indeed velvety smooth.  You can taste the quality in each cup but at the price point they are charging and for the size, I won't go out of my way to come back.  We got ours in a cup and unfortunately, the core was hollow, leaving plenty of room for them to pack more.  One flavor that I did not get to order but noticed that they weren't skimpy about their ingredients is their affogato.  Off to the side, they were making shots of espresso out of their nespresso machine and if you like drinking nespresso drinks, you also know that those pods itself can be quite costly.\n\nI welcome them to the neighborhood wholeheartedly as it's always nice seeing new additions in the Sunset.  If I'm in the area for dinner, sure, I'd probably be back to check out some of their other toppings.  However, they definitely have some tough competitors within a 2 block radius.  For some crazy reason, more and more froyo, ice creamery, and sundae shops are popping up in the upper Irving area so being the newbie in the neighborhood, I fear that they will have to creative with their marketing to keep the steady flow of customers from returning once the grand opening novelty wears off.  I heard they were offering BOGO coupons but yesterday when we were there, we got a free cotton candy coupon for the next visit instead.\n\nGranted yesterday was their soft opening, their seating/ventilation can be improved.  It was a hotter than usual day in SF but it felt like an oven inside Honey Creme.  Many folks ended up spilling onto the sidewalk outside since they could not bear the hot heat inside the store.  Not to pick on the design/spacing of the store itself, but I wished the space was better utilized for customers to have a seat/table and enjoy their soft serve while inside the store.  By the front window, there's a long bench (no tables) that strangers are sitting up close and right next to one another enjoying their soft serve.  Maybe a counter w/ chairs or stools for that area would have been better suited?  Or, break up the bench by adding some tables?  Just some thoughts but I am sure they will continue to improve as they settle into their space.  \n\nBonus: they do offer a frequent buyer/stamp card so definitely make sure you get your stamps for each order! :)  Cash only for now too.", "author": "Janetto L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-13", "description": "Plain and pretty plain soft serve is now becoming the hype ever since instagramming your food became a thing. It seems places like Honeymee in LA and Milkcow in Melbourne are starting to pop up and this is the first place in SF with it. \n\nI came here on a cold foggy Monday with another friend and I got the organic mixed grains soft serve while my friend got his as an affogato style. It's a good simple dessert perfect for winding down after a meal, but something I don't think I could eat all the time. I think what I like most about these desserts are the simplicity of it; it isn't overwhelming and something that  you can take your time eating (unless you don't mind brain freeze!). Each soft-serve is between $3-5 which is typical of one of these specialty places.\n\nI'll be back to try something different! It's inexpensive and gets the dessert job done. I think it's interesting they opened in this area because they're competing for dessert business with Holy Gelato, SF Hometown Creamery and Easy Breezy. Hopefully they're able to stick around!", "author": "Kathleen S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-23", "description": "I mainly come here for the boba. To me it has the best boba in the city. They only have around 10 options but they are all superb!! I've never had a better jasmine green tea than here. Their fruity ones are really good too like the lychee and strawberry. The boba is the right texture and sweet. \n\nThe creme is pretty milky and not super sweet, but if you get it with honey or the honey comb it's a perfect combo!", "author": "Monica E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-01", "description": "This place is pretty interesting. Organic soft serve ice cream with honeycomb?? Who would've thought! \n\nParking - it may be a little tough since it's a busy street. There's metered street parking as well as residential. \n\nService - they were great! Greeted at the line with menus. Very friendly and they even replaced the honeycomb that fell off my cone with no hesitation! \n\nFood - \nHoneycomb cone - I thought it was pretty good! Presentation was nice and the paper that's on the cone makes it way easier to eat. The organic soft serve itself was crisp and light. Definitely very refreshing. There was also a piece of honeycomb on there with some drizzled honey. The honey tastes great with the soft serve but I would say the honeycomb itself was overwhelming. The piece was so sweet on its own but too small to bite into smaller pieces. It would be cool if the honeycomb pieces could be broken down to chunks. \n\nNot in a hurry to come back but if I'm in the area, don't mind if I do!", "author": "Coco L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-30", "description": "New Korean soft serve joint in San Francisco!\n\nParking is located all on the streets and metered till 6pm or you can just try to find parking around the residential areas. \n\nThe inside of this place is definitely clean and inviting. They have a \"bouquet\" of cones near the front door and it's a pretty nice thing to look at, lol. The menu is on the wall ahead of you but they also have menus to hand out in case you can't see too far. They have cups and they have cones and it all comes down to what you would rather have on your soft serve. My friend and I opted for the cone as a base and she got it with the honeycomb while I got mine with a honey drizzle. Together the total was around $10 and one downside to them right now is that they are currently cash only. There's a Bank of America across the street, though, if that helps. \n\nService here was friendly. The cashier handed us a menu when we came in and they even replaced the honeycomb after my friend dropped hers on the floor. \n\nOverall, I thought presentation was lovely. I was excited about eating it and the soft serve wasn't overly sweet and tasted refreshing. The cone itself was interesting. Whereas most cones that come with ice cream don't really taste like anything, theirs tasted sorta sweet even without the soft serve. Honey was sort of disappointing. It doesn't melt in your mouth and instead just stays as a clump in your mouth. And it's honestly sort of pricey for what you get, but oh well.. It's San Francisco.", "author": "Venus L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-03", "description": "Not sure what they put in their soft serve, but it's definitely tastier than most. Saw this place trending all over Instagram one day and decided to give it a try. \n\nThe SO and I came on a Sunday afternoon and there wasn't much of a line. It's definitely a small no frills place -- just get your ice cream and walk around or eat outside, no seating room inside. Their menu looks like it's still being developed (e.g. they have cereal milk ice cream featured but apparently it'll come in the next few months) but for now, there are still about 20 different topping options for your soft serve.\n\nPrices are definitely high, but I guess everything in SF is expensive these days. I paid about $4 for a cup of ice cream -- they also have loyalty cards and wily cashiers who were quite the smooth talker in encouraging me to come again in the future.\n\nI kept it pretty simple and just got a honey soft serve. Their soft serve really is something special -- it's not too sweet, they nail the texture, and there's something in it that honestly just makes it taste better. It's not the shitty soft serve you get elsewhere, and I actually prefer it much more than Gott's soft serve which is one of my other favorite places. \n\nIf you like honey, I think the honey option is actually tastier than the honey comb -- I noticed other people only getting one little honey comb, which I guess is a burst of honey, but I appreciated that they thoughtfully drizzled the inside and outside of my soft serve as to properly coat it with honey. Really yummy subtle flavors. \n\ntldr; pretty good soft serve, will likely be back -- definitely of higher quality than other places", "author": "Jasmine X."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-01-13", "description": "I'm a honey fanatic so I knew I had to try this Taiwanese frozen yogurt spot as soon as I saw the sign. Turns out, it's really more about the creme than the honey. After getting some recommendations from the very friendly people behind the counter, I went with the honeycomb. I guess I had an incorrect idea of what to expect because I was expecting that kind of crumbly, melt in your mouth honey comb that I've had before, but this was just a hunk of waxy honeycomb which I didn't end up eating (not even sure if you're supposed to) because I felt like I was chewing on a candle. Also, I guess I thought they would have drizzled some more honey on the froyo itself, but they didn't (there is another flavor option that's just honey drizzled over), so my dessert really didn't have a ton of flavor. The yogurt itself was richer, creamier, and denser than is my personal preference. It's great if you like a really decadent, heavy kind of frozen treat, but I found myself pretty full after eating less than half. \n\nAt $4.50, it's an expected price point for a specialty dessert like this, but I guess I was hoping for something more unique and distinctive. I took a look at their website and I noticed that there are lots of really cool sounding flavor combos that weren't available at this location. I would have been all about that rose jam with popping grape cotton candy! I don't even know what that is but it sounds so fun! This location had more of the basic options, like an affogatto or boba flavor. \n\nThat being said, it would be great to share one of these to get a little sweet taste treat. Though it's not anything I haven't tried before, it's still a super cute little space, really nice service, and I'm all for embracing any Asian dessert import!", "author": "Christina P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-06-15", "description": "Pretty good but definitely nothing special in terms of taste.\n\nFirst of all--it's soft serve. Sure it comes with some fancy toppings to make it Instagram friendly but at the core of this business is $5 soft.serve.\n\nI got the popcorn and it was a nice afternoon snack and photographed beautifully BUT the actual soft serve doesn't taste like anything. As a vehicle it's great because it's actually the absence of flavor. I kept trying to pick up notes of vanilla or tart or SOMETHING but seriously, takes like cold air...maybe cold nonfat milk? \n\nService was kind and the store is minimally decorated, one long bench for seating, clean, etc. I think the \"hand crafted\" part of their tag line means that they put the toppings on by hand since this tastes like run of the mill commercial soft serve mix. \n\nWon't seek this out again since there are other ice cream and soft serve places on that part of Irving that offer more value. Fine to try once but won't blow you away.", "author": "Semuteh F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-05", "description": "THERE'S ALWAYS ROOM FOR DESSERT! No matter how much you had to eat and alcohol to drink.\n\nAfter finishing from carbon we ventured off to try this lovely place. Menu is really simple. It's soft serve with honey and different toppings. Options are in a cup or cone. Perfect way to end the night with full tummies and great company. If you have a salty sweet palette I recommend you get salted caramel popcorn. It's fckn amazeballs! This place caters to all ages. Place is a bit small so it can get crowded real fast. Once you get your soft serve go hang out in the front and people watch and have great conversations.", "author": "Mary Ann B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-05-12", "description": "Meh. This is your fancied up McDonald sundae. You will remember this place because it's different than other ice cream shops, but not because of how delicious the desserts were \n\nMy friend and I shared the honeycomb sundae ($4.75). Here are my thoughts: \n\nPROS: \n- Yay it's a new way to indulge sugaaaaarrrrr\n- Pretty to look at since it's served in a clear, plastic cup \n- Ice cream is not too sweet, and the drizzled on honey adds on an extra kick of flavor and scent\n\nCONS:\n- THEY DON'T FILL UP THE ENTIRE CUP. The ice cream was swirled around the center of the cup, leaving the center of the cup empty\n- Pretty average ice cream. Ice cream itself was kind of flavorless so all of the flavors came from the add-on items. You are basically tasting the syrup\n- No seating so you just grab and go\n- You can't try the flavors before buying \n\nI think most people come here because they want to say they've been here, not to really enjoy the dessert. It's a fun way to eat ice cream but I think I like the $1 sundae at McDonald just as much. Haven't had too much luck finding a good ice cream shop in the Inner Sunset yet. Just a little disappointed.", "author": "Wendy F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-01", "description": "I was skeptical another ice cream/froyo like place could survive in Inner Sunset, but Honey Creme is fast becoming one of my favorite post-dinner dessert places!\n\nTheir soft serve is not sweet and not too milky or creamy (I recommend Easy Breezy's custard if you want a thick and decadent frozen treat) but there is something about this type of texture and taste that I can't help embracing. I think it's an Asian thing (not surprising, Honey Creme appears to be a Taiwanese/Korean mini ice cream chain!). \n\nI've tried the regular honey, the honeycomb, and the mixed grains. I really love honey and the two honeycombs that come with the honeycomb are enough for the amount of soft serve you get, but I don't think the honeycomb (the regular honey, even less so) is worth the price (despite how Instagrammable it is). You're better off buying an original and putting on some honey or fruit you may have at home. \n\nMy favorite flavor by far is the mixed grains. A drizzle of caramel is a lot sweeter than honey and it does a better job complementing the mellow soft serve. The flavor and scent of their \"grains\" reminds me of kinako (roasted soy powder, like the kind you find in warabi mochi). Like I said, this sort of dessert appeals to Asian sensibilities.\n\nThe price could be more Asian ($5 for a small soft serve is a bit hard to swallow) but at least they have a loyalty card program!", "author": "Tiffany H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-06-09", "description": "Final thoughts: Creamy but lacking in the taste department.\n\nCame here with my cousins after dinner. We shared 3: Honey comb, Honey, and Affogato. Just the soft serve itself has no taste. Honey comb was very sweet and waxy tasting (2/5stars). The honey with plain soft had a hint of sweetness (4/5 stars) and the Affogato was not sweet at all with a shot of coffee. It also melted fairly quickly, so I had a milky coffee after a couple of mins.(3/5 stars) Servers were nice and very welcoming!", "author": "Tiffany C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-09", "description": "I haven't been to the spots down in SoCal so I can't compare it to those, but I've been to MilkCow in Fremont and would say that Honey Creme is definitely better! I had the honey soft serve and it was so good that I ate the whole thing in 5 minutes-- I was actually tempted to get seconds! I kind of wish there was more honey in it but I still really enjoyed it. \n\nWhile it is a bit of a small portion for $4.50, I can definitely taste the quality so I don't mind paying extra for that. I would say that it's kind of like a McDonalds soft serve but much more elevated LOL. The employees were also really friendly and efficient when I went so that's a plus! I actually wanted to try the cereal milk one as well but they told me that it's coming soon so I'll be back for that. Overall I'd say it's definitely worth a try!", "author": "Marny N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-09", "description": "For me personally, I thought the affogato was perfect! \nTaste was light and refreshing with a creamy base of (not overly sweet) frozen yogurt, when topped with the hot fresh brewed coffee it held up well, not melting to quickly, adding the rich sweet honeycomb was perfection! I was fully satisfied and happy ; )\nVery happy & friendly staff was also appreciated.", "author": "Laurie C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-05-02", "description": "Must be the angle, but all the photos of the Honey Creme cups make the serving size seem  huge. When my boyfriend and I ordered our first Honey Creme honey cup, we were surprised to see that it was actually, pretty small. For the price ($4.50), we were hoping to get a large, red Solo cup sized serving of soft serve ice cream. Granted, we are getting a little older and probably shouldn't be eating that much honey infused ice cream, but I'm just not quite convinced that it's worth the price. \n\nThe soft serve was creamy and light, and we are still curious to try the honey comb, so we may just give it another shot.\n\nThe location is a bit small with limited bench seating, so I do see it getting crowded on weekend evenings.\n\nCASH ONLY for now.", "author": "Camille B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-11", "description": "This place is super cute, and the ice cream was delicious and organic! Which was interesting that the cotton candy and everything else was organic. It made me slightly less guilty eating it haha.", "author": "Allix H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-10", "description": "A unique texture and flavor for a soft serve; the fresh honey comb was a nice touch but fair warning it's super sweet so a small bit goes a long way. I will admit, I didn't care for the wax bits that you get from the shell but at least you know its the real deal. \n\nThe selection is limited but varied enough to accommodate most, the nieces and nephew were really excited about the cotton candy, which was made to order\n\nYes, it is expensive for what you get and isn't something you would get on a regular basis but its a nice splurge", "author": "Eddie W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-09-10", "description": "So this is soft serve ice cream that can be topped with honey, coffee, chocolate or cotton candy. I felt like I had a pit in my stomach after just a few bites. They were friendly and kind but we prefer SF Hometown Creamery just around the corner for their made from literal scratch ice cream. \n\nNo one in my family loved this place. We all shared one small original and 5 of us didn't even finish one small cup as we were not that excited about it. Currently looking for a trash can. Great service. Not excited about the product.", "author": "Nettie A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-09-04", "description": "I finally tried this place but I was super disappointed . I felt that it was basically vanilla ice cream with honey on top ! The service was quick and easy . \n\nThe soft serve was good but I didn't see any WOW factor to it . Not saying this place is bad but for $5 a cup I think it cans be better or they need to change the price .\n\nFor the price I prefer to go to another dessert place , it almost felt like it was a regular McDonald's ice cream with chocolate on top instead it was with honey .", "author": "Tiffany K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-16", "description": "Super cute! Couldn't help but take a picture there is so many things to try I gotta go back. They have flavored teas and so many kinds of ice cream! The honey comb one is pretty sweet and creamy. A very clean minimalist atmosphere.", "author": "Ashlee K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-05-16", "description": "Probably closer to 3.5 stars overall - I'm happy to have tried it, but probably wouldn't make a point of coming back.\n\nThe desserts are very pretty! I think that's a big part of their appeal. The interior, though small, is cute as well with decor that fits their overall image. Staff were friendly and prompt, and they take credit cards now.\n\nThe problem, I guess, is that the soft serve itself was very bland when I went. Texture was on point - thick and creamy - but the parts that didn't have contact with the toppings (honey and mixed grains powder in my case) had zero flavor. This wouldn't be so bad if the topping distribution were better, but basically the whole middle section tasted like creamy nothingness. \n\nI'm not sure how they would improve the distribution issue, but I did like the flavor of the mixed grain powder mixed in with the soft serve where I could get it. (It tastes a lot like the sesame powder used in some Japanese desserts, if you've tried that. A nice, mild yet nutty flavor I really like.) As it is, though, for the price I'd rather hit up one of their local competitors (Easy Breezy, Holy Gelato, or Hometown Creamery...)", "author": "Delia Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-12", "description": "I'm a yelp snob, but keep coming back here for the seasonal tea flavored ice cream and also get a rose tea with boba.  They are generous with samples if you are wary of tea ice cream (which I usually prefer over their base flavor).  Honeycomb topper is a must, items come out instagram ready, and staff is friendly and patient.  Downside is there is little space for seating, but I usually walk with my stuff anyways.", "author": "Dan P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-10-15", "description": "Came here last night after dinner nearby and decided on sharing one order with my friends since we were so full. It was $4-5, but the order we had this time was a small Honey Creme Cereal Milk - yum! The crunchy with the ice cream was a good texture combo with honey randomly throughly the entire thing. The vanilla is pretty good there too since it's the base of everything here. I want to return to try something on a cone someday.", "author": "Amanda C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-04", "description": "Always seen this place on people's social media and I finally got to try it a few weeks back. I got the affogato, which is espresso in the soft serve. It was a nice blend of flavors. \n\nWe came after lunch, so my suggestion is that if you aren't too hungry and just wanna try it, share with a friend or two. If not, it'll become too much and that would just be a waste to toss it out.\n\nThis place is just like Honeymee in LA.", "author": "Karen Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-27", "description": "I love honey and soft serve so was excited to try the two combinations together. Came by on a random weekday at 2pm and the shop was empty but had a decent stream of customers come through during the 20 minutes we were there. Apparently the concept originated in Korea but there are also honey creme stores all over Asia. \n\nThe base is milk soft serve but they had a variety of different toppings you could add ranging from honey, honey comb, espresso poured over the top to a cotton candy topping. There's only one size and is actually a bit smaller than what I'd expected from the pictures. We had the honey drizzle topping which was quite good with the milk soft serve. The soft serve wasn't sweet at all so the honey was a good complement. I don't like my desserts very sweet so this was just the right amount for me. Though the honey really is just a thin drizzle so it may come off bland to those who have a bigger sweet tooth. They also give a punch card if you plan on coming back frequently.", "author": "Queena T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-07-08", "description": "Honestly, considering there are two extremely delicious ice cream places literally a street away, they have nothing worth going for.\n\nFirst of all, they charge $4.50 for a small cup that's much like a child's cup of apple juice. Extremely tiny.\n\nSecond, the photos are misleading. It looks like a small cup from Starbucks with all the makings of a frap, but that's not at all what you're getting \n\nThey have two flavors of this soft serve. It's called vanilla and matcha. \n\nBut it's ACTUALLY Plain and Slightly Bitter Green Tea. \n\nThey add some chocolate syrup to the cup and then some chocolate drizzle on top. \n\nAnd it looks good, except it's just plain yogurt with chocolate syrup and they charge you $4.50!\n\nDo yourself a favor and go to The Creamery. Or better yet, go to Holy Gelato! That is amazing. \n\nThis place is just not worth it. So sad.", "author": "Carmen C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-07-18", "description": "Overall: So you always see pics on facebook/ instagram of your friends who visited certain places or restaurants.  This is definitely one too.  Join your friends and the crowd.  Try out Honey Creme serves soft-serve ice cream.  \n\nIce Cream: The ice cream was unique, however there's just one flavor - vanilla.  You add toppings to customize it to your taste buds.  Portions are quite small, but small was good bc it was a tad too sweet for me.  \n\nPrice: Ranges $4-$5.  They do accept plastic and offers you a stamp card.", "author": "Stephanie Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-08", "description": "I scream, you scream, we all scream for honey creme! Honey Creme is very similar to Milkcow in Fremont and I'm just happy to see Korean/Taiwanese desserts making their way across the ocean. I really enjoy their soft serve ice cream because it's not super sweet. It's like eating milk in a ice cream format. Very creamy! \n\nI got the original because I didn't want anything sugary that night but I did try my friend's dark chocolate version. Not a whole lot of chocolate and I don't find it worth the extra bump in cost.   You can get your ice cream in either cup or cone and for the cups, they give these colorful plastic flat spoons. The cup is small and it's about the size of a tall Starbucks cup. \n\nI think they offer stamp cards because they stamped my receipt and told me to bring that in next time I come. The space is really small and there's no tables to sit at. They have a bench to sit on in front of the window but this place is more of a grab and go.", "author": "Diana C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-02-25", "description": "Hhhmmmm.... \nTaste is just right. Not too sweet. I tried the honey. \nI would come back and try a different flavor. A bit pricey tho.", "author": "Dianne Jay S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-29", "description": "I've had this place bookmarked since it opened, today I finally managed to go.  All the choices they offer seem pretty fun and creative, even though everything looked great the affogato really caught my eye.  I know the most popular soft serve is the honey topping one and I will make sure I try it next time.\n\nThe concept itself is pretty simple, it's a soft serve and topping that they add on.  The affogato was made right in front of me, I didn't know how it would turn out with a soft serve and I must say it was pretty good. My only complaint is that for $4.50 the portions are pretty small, usually soft serve is relatively cheaper than ice cream.\n\nI'm probably going to come back to try the honey topping, even though in my opinion it's overpriced.", "author": "Josh Giosue D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-30", "description": "Fast service, very simple menu to choose from!!! No tables set up but a bench to sit. The portion is very small for the price which is $4.50 a cup but the flavor is on point! It's not too sweet and very smooth. \n\nWe ordered the honey & affogato. Honey was a very good addition to the soft serve, the honey wasn't too overbearing. The affogato was good too, it tastes like coffee soft serve. \n\nOverall, pretty good experience and I will be coming back to try the 'coming soon' flavor Cereal & Milk !!!", "author": "Vanessa Z."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-06-30", "description": "Honey Creme is one of those places that everyone should try once (mostly for the IG/snapchat) but I wouldn't go out of my way to get it. The concept is simple: a vanilla soft serve with your choice of toppings. I had the affogato, which had a shot of espresso poured in, while my friend had the honey. I liked how the flavor of the coffee mixed with the light sweetness of the soft serve, but it might be a little too bitter if you're sensitive to that. On the other hand, the honey was a lot sweeter than the soft serve but they balanced out nicely. However, I would recommend not getting both honey and honeycomb as that would end up being really sweet - diabetes is not worth the picture LOL.\n\nAnother con is that this is pretty pricey at $4.50 a cup. You're paying more for the picture and not the actual dessert, but at least their tile wall makes a nice background. Parking in this area is horrendous of course but this is SF, so what do you expect? This is a simple dessert concept but there's definitely room for improvement.", "author": "KC W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-07", "description": "I have joined a hive mind by the lure of this crème of the crop of soft serve. Instead of a cherry on top of your ice cream, Honey Crème replaced that with a honey comb. Trust me, it's the bee's knees. If nature's natural nectar is bee-neath you, there are other drizzles, cotton candy, and caramel popcorn that will to sting your sweet tooth. This original South Korean ice cream parlor is bright, clean, and inviting to their swarm customers.", "author": "Alexander W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-05-18", "description": "The soft serve hype is starting to take over and now there's finally one that has opened in the sunset, making it very easy to satisfy my sweet tooth cravings since I lived close by. Came here two Friday's ago while on route to the Giants game. I thought it would be crowded because it was a Friday night and the kiddies just got out from school. Nope! Walked in and there were two people in front of us still deciding so we ordered ahead of them since we knew what we wanted. \n\nWe got one dark chocolate to share. Since I haven't been to HoneyMee in SoCal or Milkcow in Fremont, I don't have much to compare it to. The texture was there in terms of creaminess but at the same time, it wasn't very sweet. There's also a gaping hole in the middle of the cup. The chocolate sauce helped to give the soft serve some sweetness so that helped. \n\nPaid about 5 dollars for a small serving of soft serve that lacked a little in flavor. Also read on Yelp that they took card but when I was there, they said it was not yet operational. Won't go out of my way to come here again as parking is difficult. But if I'm passing by, yea I'll make a stop by here if the cravings are strong.", "author": "Cynthia T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-06-10", "description": "Cute little place for soft serve/ice cream. This site is clean and welcoming. They also have a very cool tower of cones in a vase. I really want to touch it. \n\nI had the Honey Comb, the entire time i was searching for the flavor because the milk flavor is so light is hard to distinguish. Overall, I don't get the hype...\n\nIf there are many guests, I can anticipate a long wait since there's only one person who makes the order.", "author": "Jess W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-01", "description": "What a concept fresh honey comb on top of ice cream , it's a great combination of flavor and beautiful. Great treat", "author": "P C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-03-19", "description": "Very cute and some what similar to Honey Mee in socal but not quite as good owing to the soft serve lacking flavor. I had read the reviews before coming and thought people were just not used to a more plain soft serve with honey accenting it as I'd had Honey Mee multiple times in socal. \n\n...But the reviews were right, the soft serve is simply lacking in flavor and sweetness, it was almost like a soft cold filler material than a treat, the honey does help but it was closer to just eating honey. Or honey over a less flavorful cold whipped cream. Perhaps a good way to illustrate is that I would never order the plain soft serve without anything else here, where as at HM i might be persuaded to eat the soft serve alone. \n\nThat being said, if i was in the area I wouldn't mind coming here again, but I wouldn't make it a point to visit or insist any one else come try it. If you are craving HM, this won't satisfy. One of the few times where the imitator surpasses the original.", "author": "Susan L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-05-23", "description": "After seeing pictures of Honeymee in LA, I was hoping this food fad would make it to SF. \n\nWas pretty disappointed. The ratio of honeycomb to soft serve just doesn't make sense. Guess it would be ok if the ice cream had more flavor...but it does not. The honeycomb is pretty delicious. 2 stars for that. Negative 3 stars for everything else. \n\nMore honeycomb pls...and I will be happy!", "author": "Emily Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-01", "description": "Looking to have dessert after Easter lunch, we happened upon this place. Pleasant store, with friendly service. I had the Affogato and it was delicious. My sister had the affogato with cotton candy topping. We definitely recommend this place.", "author": "Robbie H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-14", "description": "This place is fire! I got mine with the honey drizzle on it and it was delicious :) I ate every bite and will for sure be back.\nEveryone working there was really friendly too!\n\nOverall great experience, although it is a little pricey for the amount they give. Still 5 stars :)", "author": "Hayley D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-12", "description": "This is a review for Honey Creme's boba. We had the honey tea with honey boba not knowing what to expect. Honey Creme's marketing focuses solely on their soft serve not their boba drinks. Their honey boba drink was delicious! The honey tea had perfect sweetness. They placed the perfect amount of ice and the boba had good sweetness, chewy and delightful. Some boba places don't sweeten their boba enough so it can feel like you're just chewing texture. Honey Creme's boba is just perfect!", "author": "Caroline N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-18", "description": "It was 52 degrees out but I really wanted to try this place. I passed people who held the Honeycreme cup and I thought dang that's a pretty tiny cup but I can't judge it by its cover.\n\nOrdered the soft serve with mixed grains, and it reminded me of snacks from Hong Kong. The mixed grains included things like peanut and sesame in powder form. The soft serve itself was very fresh and 100x more quality than McDonald's soft serve. You can taste the difference for sure.\n\nSurprisingly I didn't even finish my cup, I was full 3/4 of the way so I ended up throwing the rest away. I didn't want to waste it but they definitely packed a lot of soft serve into the cup. A little on the pricier side but definitely will stop by again if I'm in the area.", "author": "Julian Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-12-08", "description": "I had been dying to try this place for so long, but my experience was very underwhelming to say the least. I love honey and got the honey drizzle soft serve, but I could not justify paying $5-$6 for the small cup. The ice cream was plain vanilla and very mediocre, and the honey was standard as well. Not that I expected anything above and beyond, but I felt like I could easily make this on my own for less than a dollar. Also, the location is rather small and besides the window ledge, there isn't really any seating.\n\nHowever, I recently tried the yogurt + honey from Souvla which is similar and I'm a big fan.  For some reason, the tart-y flavor that comes with yogurt tastes like a better combo to me than honey + ice cream.", "author": "Alice S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-11-01", "description": "It was decent soft serve (think higher grade McDonald's soft\n\n-I got the affagato and yes it's just soft serve with a shot of coffee.\n\n-A little pricey for the size", "author": "Kimberly C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-25", "description": "I really liked the ice cream I got at this place. I got the cotton candy topped on their classic ice cream with coffee put on top. I really liked the flavor the coffee brought out. I  recommend people trying that. Plus it is really cool to see the cotton candy melt away (look at the photos and video I posted). I think that just the plain cream ice cream alone, doesn't have much flavor, but if you top it with something it will be a lot better. Their matcha ice cream was pretty good too, the flavor was strong in that. So for all the matcha lovers, check that out!", "author": "I K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-28", "description": "This place is really good on a sunny day in San Francisco! I like the concept of having one or two flavors of soft serve with different toppings to choose from; it makes things more simple. They also have boba here which is pretty good, too! My only complaint is that the shop is small but it really isn't supposed to be a place where you hang out, which is cool! Good ice cream and really yummy honey comb.", "author": "Dom B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-08", "description": "My buddy put me on to this place recently. My usual stomping grounds are in Richmond and Inner Richmond when I am around. I always knew Sunset had some very good spots but I am sometimes a creature of habit. \n\nThe shop itself is not very big but realistically your orders are meant to be taken to go anyway. There are a plethora of flavors to choose from regarding soft serve ice cream. \n\nMy buddy ended up getting a new flavor that arrived which is the cereal milk. I had tried something very similar at Momofuku milk bar so I decided on a tasty chocolate based flavor. \n\nThe employees there are super nice and polite. They are very patient while you peruse the menu offerings (I used the word plethora before for a reason) and sometimes makes suggestions. \n\nNear the entrance there is a very impressive construction of cones. I did take a photo but due to some people stealing photos on here I unfortunately will not be posting it. \n\nWarning. This place can be very addicting if you live near the storefront. But you will walk away with some soft serve happiness each and every time.", "author": "Gregory C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-10-09", "description": "This place reminds me of Milkcow in Fremont. It's a little less milky tasting here than at Milkcow but still a good swirl of soft serve. There are a lot more options here. They have colorful cones that come with some type of melt guard to catch the dripping ice cream or toppings. I had the chocolate ice cream which reminded me of those chocolate dipped ice cream cones because the chocolate they put on top hardens. My boyfriend got the affogato. It was pretty good for being espresso that they make from those k-cup like pods.", "author": "Nicole S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-29", "description": "161129 My favorite ice cream place! My favorite would be the Dark Chocolate or Affogato :)\n\n*Note* these two are semi-sweet, so if you looking for sweet , try their Honey Comb or Cotton Candy.\n\nThe Affogato is the original soft served ice cream with a shot of espresso floated on top. This is definitely a good choice for coffee lovers. It's super creamy!!! *Sweet level : 1/5* I love that it's not too sweet, the taste of espresso with lightly sweetened ice cream is perfecto! \n\nThe Dark Chocolate is the original ice cream with Dark Chocolate around the cup & on top. The Chocolate hardens in a thin layer, which is super cool. This was just too delicious, *Sweet Level : 3/5* \n\nThey also use organic milk for their ice cream !", "author": "Tiffany F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-28", "description": "This place is really good, I don't know what the bad reviews are about.. Its super creamy, not too sweet or bland, it's just right. The milk cereal and popcorn ones are good", "author": "Jason B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-19", "description": "Honey Creme is so good, I will gladly make the trip all the way out there to the Inner Sunset from west Oakland, just to enjoy it.\n\nFor those of you who may not be familiar with this, it is Korean style soft serve ice cream that tastes like an ice cold glass of milk, usually served topped with honey, or with a piece of real honeycomb on the side. I recommend the latter; the waxy consistency of the honeycomb might take a little getting used to, but it's well worth it. It's out of this world delicious.", "author": "Eric L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-06-17", "description": "Honey Creme is basically soft serve ice cream (vanilla only) that comes out of a taylor ice cream machine. various add-ons (honey comb +1), cotton candy, drizzles extra.\n\nlicks:  soft serve vanilla (8oz?) 3.75\n-smooth, luxurious taste, sweetness level low unlike Frosty's\n-many toppings available, small square honeycomb +1.\n-comes in cup not cone, with spoon..\n\ndrips:\n-only young females present buying honey creme, just an afterthought\n-service quick by single server.\n-value is in the eye of the beholder. either u like and pay or no like, no pay, value, i.e. kouign amann, cronuts, krispy kreme, et al...", "author": "Victor G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-21", "description": "I'm surprise to like it more than I anticipated. Not too sweet and not too tart. I got their most popular which is the **HONEY COMB\". They use organic milk and surprisingly not too heavy, more like a sweet milk. Was very refreshing. The honey comb which I like better than the regular honey. You can use the cube of honey per your liking, instead of having regular honey drizzle all over. I enjoyed my cup but I think it was a lot, I do recommend sharing one. Service was friendly and I got my order almost right after I paid. That's fast service for you.", "author": "Sandy B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-27", "description": "We decided to try this place and stopped in for an afternoon ice cream treat.  A clean well maintained store, their menu was posted on wall behind the counter. With my terrible eyesight, I was relieved to find a handheld menu on the counter :). \n\nThe organic ice cream, sweetened by honey, appeared to be the main flavor, options enhanced with different toppings such as caramel corn, cotton candy, honeycomb, dark salt chocolate, espresso, and chocolate bean.  There was another flavor called Organic Mixed Grains which appeared to be it's own unique flavor--very interesting, for ice cream.  May try that next time. On average, cost for a small cup will cost around $4.50 each.  \n\nWe ordered the Affogato (ice cream with espresso) and the Himalayan Dark Salt Chocolate (ice cream drizzled with dark chocolate with salt), each in cups (cones were another option). The ice cream was not very sweet at all, as you would expect ice cream to be, but more rich and creamy--even the espresso and the dark salt chocolate toppings on each were not terribly sweet.  The taste was quite unexpected but refreshing and enjoyable!", "author": "Terry W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-30", "description": "// 3.5 stars overall //\n\nDear Honey (Creme),\n\nOh how I've missed you for so long. \n\nYes, Milkcow (in Fremont) will always be credited for introducing the idea of Korean milk (\"plain\") soft-serve ice cream  to me. Milkcow, you have been good to me though you've just gotten to the point that your soft-serve is too sweet and is just a constant cycle of the same flavor profile over and over again. \n\nDespite the fact that you, Honey Creme, offer the same varieties of toppings such as the infamous honey-drizzle, classic chocolate sauce, fluffy cotton candy, and honeycomb, you have added handheld alternatives such as cones (with a tray for less mess) and my new favorite; the affogato (espresso poured on top), which is unique and works well as a combination. So kudos to you.\n\nAffogato // $4.50 // 4 stars - Say what?! Did I just pay almost $5 for unflavored ice cream that is essentially the high-end version of McD's with some extra coffee as an added bonus? Honey Creme seems to think so by throwing in white walls to make it more Instagrammable, by making their soft-serve aesthetically pleasing, and by boasting about higher quality ingredients (at least they use a name brand [Horizon milk] // organic). Well, that is Honey Creme's philosophy. \n\nAfter thinking straight about the whole experience, I think it's fair for what they give. For one, it wasn't cloyingly sweet as a result of the ice cream being more milky and plain tasting though was still plenty sweet especially loaded with extra toppings. The consistency was a lot nicer since it was thicker and creamier. Also, the portion sizes though manageable were quite generous especially since it was thicker than normal. On a side note, if you order it with a cone, you pay almost a dollar more but you essentially get more ice cream along with a cone and a nicer looking dessert (perfectly swirled + contrasting dark cone + golden yellow tray for color).\n\nThe overall aesthetic that Honey Creme aims for is simplicity. The place itself is small with an open kitchen, its lone communal bench, white and yellow glossy brick wall panel, and colorful bouquet of stacked cones for display. The employees were polite, patient, and very efficient in completing our order.\n\nMy only complaint that really involves all stores of this type are that they should offer multiple flavors though that defeats the concept of Korean soft-serve. Generally speaking for Asian-style soft serve ice cream, I've only found Momofoku Milk Bar in New York, Matcha Love in the Mitsuwa Marketplace in San Jose and Cha Cha in Hong Kong to offer other flavors such as Green Tea and Black Sesame.", "author": "Jacquie H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-10-20", "description": "Was excited to try this place out but wasn't that impressed the yogurt itself was kind of bland. The honey comb was a nice touch but as you eat it you end up with pieces of wax and it's sort of weird because I had to spit out the wax as I kept eating the yogurt.", "author": "Tiffany L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-24", "description": "Anyone can easily split a cup to satisfy that sweet tooth. Breaks down to about $2.50 for 2 people so I like that! I recommend only getting the honey with the ice cream because the other combinations look very overwhelming, but that's just me!\n\nI'm borderline 3 stars because of the lack of seating and the cashier sitting down on her phone since nobody was in line. BUT giving Honey Creme 4 stars for ease of ordering, modern vibes, and an awesome pic for all you Snapchat addicts!", "author": "Brandon M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-05-25", "description": "I was thrilled they opened something similar to milk cow in Fremont!  The use of soft serve with a drizzle of honey is the new thing. not too sweet, but the perfect amount.\n\nbut why only 3 stars? this soft serve did not resemble anything to milk cow In Fremont and just tasted like soft serve from McDonald's.... not saying McDonald's is bad, but the price tag for this honey and soft serve was $4+ and I was not thrilled at all.  skip the honey comb unless you are trying to do it for the gram. the difference from milk cow was the advertisement of the organic whole milk they use, I'm not so sure what milk they use here..\n\nthis $4-5 will help you with 100 likes on Instagram, but not so sure about the taste of it. hyped up, I will leave my taste buds and cravings to milk cow in Fremont. also, in my cup, there was a big whole in the middle, where the soft serve was supposed to be. uhhh, fill me up next time please!", "author": "Josie L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-06-16", "description": "Many of my friends having been posting pics of this place on Snapchat and Instagram, so I thought I should give them a try. \n\nThe place is nice and cute, but $4.50 for a small plain vanilla soft serve is not worth it. I found their soft serve to be thicker than most yet a little bland. Now the toppings are pre-selected, and they don't offer much of a variety. I got the mixed grains with honey, which I thought would have been granola, but instead tasted like crushed graham crackers. My friends got the dark chocolate which was good when you mixed it in with the soft serve and the honey comb which was good but had a weird after taste. \n\nThis place has the potential to be a nice dessert spot, but they definitely need to expand their soft serve selection and provide more toppings if they want to compete with the other dessert shops on Irving.", "author": "Denzell S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-05-01", "description": "first Honey Creme in the US. people stop comparing it to Honey Mee. Honey Creme is the original ice cream chain found in Taiwan, Korea, Singapore, and Philippines. Honey Mee is a copy of Honey Creme. \n\ncash only at the moment. it is too hot in there. I suggests they get some AC going because the moment they hand the ice cream to you, it starts to drip. Only a bench seating. one person handles the money and order, one person pumps the ice cream and one person does the toppings. they need a better system because the orders get backed up and people are waiting for their orders and the small shop gets crowded fast. \n\nI got the honeycomb. be aware that you will be eating the natural wax of the honeycomb. that wasn't pleasant. I was disappointed how hollow the ice cream was. for the price and the hollow core ice cream, it was a ripped off. ice cream is not too much. only comes in one flavor and can do different topping.", "author": "Jules L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-05-01", "description": "Sorry to kill the buzz.. Ok couldn't resist the pun. But seriously, it was just okay. Us three amigos wandered over after a filling dinner and decided to pop in. I had the original soft serve with Honeycomb for $4.75. The soft serve is great texturally but has too subtle a flavor. The honeycomb was good but the square was a little small for the comb:ice cream. The serving size was adequate if you are already full. Makes for a cute photo but I'd probably go elsewhere for ice cream.", "author": "Angela L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-09", "description": "A new Boba and soft serve shop in town. Organic soft serve in a colorful cone! Boba and sundaes too. Boba was fresh and the honey tea clean and refreshing. Nothing artificial about any of the tastes. Friendly quick service.", "author": "kirstenbb c."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-20", "description": "They specialize with their ice creams and it was not a disappointment. I love how they have stamp cards too. I just wish their drinks could be better.", "author": "Casey Y."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-05-25", "description": "This place reminds me of Honeymee in LA (http://www.yelp.com/biz/honeymee-los-angeles-2?hrid=JZRANlAOlJVVMmG1aZ6adA&utm_campaign=www_review_share_popup&utm_medium=copy_link&utm_source=(direct))) which I wasn't impressed with. \n\nHoney Creme is expensive ($5) and flavorless which forces you to add toppings. I got the one with the honey and it tasted like straight cream and honey. Don't let the pictures deceive you, it looks better than it tastes.", "author": "Cindy A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-05-23", "description": "After hearing the hype about this place, I had to come by and check it out. Came in around 9:30pm on a Monday and there was no wait. As a coffee lover, I went ahead and ordered the Affrogato. \n\nAt first bite, it was already a miss. There was no flavor to the soft serve. You pretty much need to add some sort of flavor since it is completely bland.\n\nYes, it is something Instagram worthy but it's definitely not a memorable experience that would make me want to go back for more. You're honestly better off ordering a McDonald's $1 cone.", "author": "Kristine C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-18", "description": "Best soft serve / vanilla ice-cream I've ever had. Most ice-cream is too sweet for me because I feel that they use a lot of sugar and it masks the delicate flavors of anything else. \n\nI'm lactose intolerant, but was able to process this ice-cream better than anything else--maybe because it's made with organic milk. \n\nI love the flavor of organic milk and cream, and the flavors of those things really stand out at this joint.\n\nI wish they made layers of ice-cream and honey--instead of only drizzling it only on top--so that it is better distributed throughout the dessert. I'll ask them next time...", "author": "jolie L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-11-11", "description": "This place is bad. The consistency of the soft serve is nasty and the photos in the menu don't reflect the ice cream at all. Got tricked by the beautiful green matcha ice cream photo and the real thing was unrecognizable. They don't use the real naturally dark green matcha. And even if they do, they dilute the shit out of it with whip cream-like ingredient. And if you can imagine that, that's what my ice cream looked like. Looked pale and tasted gross. Ate two bites and threw it away.", "author": "Momoe K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-27", "description": "My first time tried this Taiwanese franchised ice-cream in Hong Kong. I am happy to see them again in San Francisco. The soft ice-cream is very smooth and not too sweet. I had the regular and the Milk Tea flavour ice cream and both were good. However, the location is difficult for parking. $4.50 - $5.00 for a small cup of ice- cream is a bit pricey but I don't think Mc Donald ice-cream sundae taste anything close to this at all even though they are both soft ice cream.", "author": "Katherine L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-26", "description": "Got the honey comb ice cream! It's prefect. Ice cream is not too sweet so it's prefect with the honey!", "author": "Maple L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-22", "description": "Seriously addicting. I'm so happy I found this place! So many flavors to choose from but I decided to get the honeycomb. The organic milk ice cream is not that sweet at all which is why I really liked it. You can scrape the honeycomb with your tiny spoon so you have control of how much you want per scoop. I am definitively coming back to try the cotton candy and affogato", "author": "Gwen M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-06-20", "description": "If you want decorated soft serve come here!\n\nThought this would be some dense creamy goodness but it's very similar to soft serve in texture.  The signs do say \"soft ice cream\" though.\n\nI tried the one with coffee beans, was not impressed.  I'd much rather indulge in traditional ice cream.  They are super photogenic little cups of dessert though, I'll give them that.", "author": "Christina L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-05-19", "description": "Can live without it\n\nNot memorable\n\nservice was nice, cute decor, open space\n\nI thought the consistency wasn't smooth or creamy enough. Didn't have much flavor? Just a typical ice cream in a cup with toppings\n\nI rather eat $1 ice cream from McDonald's or go to Soulva for Greek yogurt", "author": "Carol Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-01-07", "description": "This place is okay, it's basically creamy soft serve with somewhat fancy toppings.  I'll admit that I get the craving for this stuff once in a long while, but it's pricey for what it is.  I got the soft serve with the honeycomb.  It was a pretty pricey dessert.  I ended up getting the scraps of the honeycomb since there wasn't much left in the box.  This was both good and bad I guess as it made it easier to eat, but didn't look so great presentation wise.  I can see where this place might have appeal if you want a nice photo, but it's mostly just looks.  The soft serve itself is nice and creamy, but I don't think it's exceptional.", "author": "Bryson L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-08", "description": "New ice cream joint opened so my family and I decided to give it a try. With so many ice cream shops around the area, their specialty is the fact that they use organic milk for their soft serve. Decided to get their original with the honey to see if it's truly organic.\n\nEspecially coming from trying Honey Mee in LA just a week ago, perfect time to make a comparison! Honey Creme's soft serve does truly taste organic, the flavor is very light. I could understand why some of the reviews would say it's bland. I liked the light profile because it allows the honey to come through. I prefer my dessert not overly sweet so the soft serve with the honey made a good balance. Their honey is a little bit on the sweet side so I would imagine it'll be sugar overload if the soft serve was packed with sugar which I'm glad it didn't.\n\nSuper cute shop, glad the line wasn't too long so we got served really quickly. In and out in about 10 minutes. Compare to Honey Mee, I prefer HC's soft serve, HM's honey. Would definitely come back to try the other flavors!!", "author": "Elaine Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-06-01", "description": "hype. People spend more time trying to take the perfect Instagram pic than enjoying it. With that being said, here's my review\n\norganic/glorified McDonalds cone for 5$.  Make sure to order with topping or else you'll be tasting absolutely nothing. \n\nI ordered one with the honeycomb. I enjoyed it, but a lot won't.  Such concentrated sweetness in the tiny square for some. \n\nWill I come back? maybe", "author": "Angelica C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-07-12", "description": "For \"specialty\" soft serve ice cream, I thought Honey Creme was just okay for the price you pay. I will say that they give you a pretty large amount and the ice cream itself is tasty, but I didn't really detect anything special about it? It's a pretty small space with window seats aka a ledge you can sit on, not actual chairs or stools. They make each order pretty quickly, and I liked the popcorn topping my friend got! I chose the cotton candy topping mostly for the Instagram pic, but it really wasn't worth it and was kind of hard to eat if you actually wanted a spoonful of cotton candy AND ice cream.\n\nI do like the idea of real honeycombs added on, so I would go back with a friend to just try that. Overall, save your money for the specialty ice cream shops all over San Francisco unless you're in the Sunset and really, really craving some soft serve!", "author": "Grace C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-04-06", "description": "I tried Honey Creme last week with my friend and it was A-ok. They have very limited menu and the boba took 15 minutes to prepare which kind of suck because my friend finished his ice cream by the time my boba came out. I just got the peach tea with honey boba. Simple, nothing special. My friend had the ice cream and he said it was just regular ice cream with chocolate on top. Nothing special.", "author": "Monica W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-30", "description": "Great customer service! Tasty soft serve! (I tasted a little coconut flavor dunno why lol) the honey comb is so much tastier than milk cow's at Fremont ( Fremont ones I felt like chewing a plastic towards the end while this one quickly dissolved in mouth!) \n\nDef a neighborhood gem for ppl living in the city!", "author": "VIvian Z."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-09-02", "description": "I love me a food adventure!\nHubby and I stopped by after a date night dinner at Social Kitchen.\nThis place was kind of kitchy and hyped up bc it's trendy, but I enjoyed my treat nonetheless.\nI ordered the Dark Chocolate, and my love ordered the Affogato.  Not the biggest fan of dark chocolate to begin with, but the drizzle on mine hardened like old school Magic Shell, and was waxy, just the same.  But I'm an ice cream addict, and that was not enough to deter my enjoyment.  The Affogato on the other hand was DE-LISH.  Perfect blend of flavors, def not too sweet.  Hubby won with this one, and I will def order this next time around. \nToppinsg just feel a little stingy.  But I guess its really all about the soft serve.  Consistent with other reviews, the soft serve was not very sweet.  But it's not meant to be!  Just heed warning before your visit so you're not expecting something else.  Don't compare or expect the $1 McDonald's cone, bc you will not be happy. It is still enjoyable, trust me!\nAlso, no hole in either of our cups.  Honey Crème reads your reviews yelpers! :)\nWouldn't mind coming again for the Affogato next time in the area.  Fun to try.  But not a \"WILL TRAVEL FOR\" kinda dessert for me.", "author": "Arcie Marie D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-24", "description": "Maybe it's because I'm getting to \"THAT AGE\", but I thought it was great that the soft-serve at Honey Creme wasn't very sweet. Plus, they use organic milk. It's like a mini victory to me: \"Diabetes, I am curbing you for another day!\"\n\nI ordered the Honey Comb, and while the serving size did look small, it was more than enough for an afternoon treat. The honeycomb was about a cube inch in size, which was very sweet and complimented the subtle soft-serve. I broke off pieces of the comb as I ate, which reminded me of eating honey with plain yogurt. Refreshing and did not sit heavy in your stomach afterwards.\n\nI'll definitely venture back, but docking off one star mostly because it's a fairly pricey dessert. And at over $5, the cones are even more expensive than the cups!\n\nNotes:\n\n- Place is very clean, staff are nice and friendly! Helpful when I needed to get napkins.\n\n- Line is long, but moves fast, since there's only one flavor of soft-serve and the only difference are the toppings.\n\n- Yes, they do take credit cards! (Square)\n\n- Yes, they have a stamp card! Buy 10 get 1 free.\n\n- Only one window bench, usually filled up with a group of high schoolers. Did I mention I am at \"that age\"?", "author": "Vicky F."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-07-29", "description": "Yeah, definitely not worth the price for an average tasting soft serve. It tastes bland and it melts quickly. I mean it is cute for pictures but I'd rather buy boba or get Mc Donald's soft serve instead.", "author": "Linore R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-22", "description": "Super friendly service and a nice addition to SF! My sister and I came here on a Saturday afternoon. The parking was horrendous but we eventually found a spot. There was barely a line outside and the inside looked very cute and small. The lady at the counter even showed us the menu and recommended what we should try, since it was our first time at Honey Creme. She recommended the honey comb, chocolate, Afogato, and another one. My sister got the honey comb and I got the caramel popcorn. It was ready in less than 5 minutes. The soft serve looks really small when they hand it to you but it actually isn't. The soft serve was really creamy and not too sweet. The popcorn gave it a crunchy and sweet and savory taste! The honey comb wasn't bad as well. Will definitely come back again!", "author": "Jeanette Q."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-06-08", "description": "My friend and I stopped by for a treat after a jog. I thought it would be like Milkcow, but I was kind of disappointed. Next time, I'll save my calories for something better.\n\nRating Breakdown:\n1/2 Stars for Taste -- \nI got the original flavor while my friend got the affogato. The texture of the ice cream was creamy, but there was something off about the flavor. You know the difference between diet and regular coke? Or the difference in the empty icing of a supermarket cupcake and the buttercream deliciousness of a real cupcake? The ice cream flavor at Honey Creme just wasn't....rich enough. It definitely fell flat. \n\n0/1 Stars for Value --\nSo I paid $3.75 for a cup of mediocre soft serve. My friend paid $4.50 for an extra shot of decaf espresso. To be honest, save your money and get a soft-serve at Costco. It will taste much better for half the price.\n\n1/1 Stars for Customer Service --\nThe people working were and patient as my friend and I deliberated over the options.  My friend and I were discussing the pros/cons of having caffeine so late in the evening, and the cashier very helpfully pointed out that she could make the shot decaf. Our ice creams were ready very quickly.\n\nNo bonus star because I will definitely give this place a hard pass in the future. \n\nTL;DR: Meh. Pass.", "author": "Abby W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-05", "description": "This place is adorable! \n\nIt's a little hard to look for parking but it's definitely worth the hassle. The staff is super friendly, greeted my friends and I immediately when I walked in. I got the original honey comb and dark chocolate. Personally I like the dark chocolate more, but the honey comb texture does perfect with the soft serve! Coming back soon! \n\nTip: as of 5/5, they're only taking cash for now", "author": "Tracy V."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-06-26", "description": "Literally paying $4.50 for a small cup of soft serve and chocolate sauce.... Is so not worth it. It's super hyped. It's something to eat one time, and never again.\n\nFirst of all, even getting the hardening chocolate on top tastes like nothing.. I had to swirl the chocolate to actually get flavor. The flavor of vanilla isn't strong at all, you might as well get jamba juice across the street or even boba.", "author": "Char C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-07-27", "description": "Cool concept and Interesting flavors. Tad pricy for the size, but the taste was creamy and smooth. We ordered the honey comb and coffee flavor. They legit brew fresh coffee and pour it directly into the yogurt. WHHAT. That was cool. Other than that, I do not think i'll be back just because the taste wasn't too flavorful and was more on the bland side.", "author": "Mary L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-04-17", "description": "3.5 stars. The soft serve ice cream is really soft and smooth. Very nice. I liked the honey flavor of the honey comb, but I just didn't like the chewy wax. I'd prefer just straight honey.\n\nThere is a bench for sitting inside but no tables. So it's not a comfortable place to hang out for too long.", "author": "Ali F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-12", "description": "Perfectly whipped soft frozen cream. Barely any ice, dense, smooth texture. Luxurious! Not too sweet too.\n\nThey could benefit from adding flavors like black sesame and matcha though. Currently it's just toppings. \n\nThis is the only US location. They have tons throughout Asia and Australia.", "author": "Alias A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-21", "description": "We always saw a long line when we walked by this place but never understood the hype, so when we walked by one day and saw no one in there, we thought it was the perfect time to try. I ordered the honey and added chocolate for a total of $5.  I watched the lady made the froyo, and was surprised by how small the cup was. It also seemed very quick and straightforward to make this, with only a few simple ingredients, so I thought it was quite overpriced. Once I tasted it, I thought it actually tasted quite good- I can taste the fresh milk in the froyo, the dark chocolate tasted gourmet, and the combination with honey was perfect. I enjoyed this dessert and the portion was good. I'll probably come back from time to time, but not as frequently as I would like to given the price (and this is not sit down place).", "author": "Sarah W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-07-28", "description": "Wow. I'm surprised about how high the rating is for this place. I LOVE ICE CREAM, and this place was kind of a disappointment. \n\nI ordered a premium soft ice cream with dark chocolate. I had no idea what I was eating. It was literally flavorless with no cream taste. Usually soft serve has a good vanillay and creamy taste, but I swear there was no taste. Even the chocolate had no taste. It's true when people say this soft serve looks better than it tastes. \n\nI can't really recommend this to any one, but I know many people would love coming here just to get cute food pics- that seems like a good idea.", "author": "Wendy T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-08", "description": "This place is so cute! I am a huge cotton candy lover so I was beyond excited to try this place out. Even though I came for the cotton candy I stayed for the ice cream! Lol. No but seriously the ice cream was delicious. I personally do not like my ice cream too sweet and their ice cream is perfect. I feel like it's a really good combination with the cotton candy. I can't wait to come back.", "author": "Priscilla R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-05-12", "description": "Honey Creme originated in Korea and now has its first U.S. storefront in SF!  Like many of the reviews here, the soft serve is lightly sweet.  However, I didn't notice the strong milk flavor that some people mentioned, but that could be due to the sweetness of the honeycomb.  The employee told me customers were hesitant to try the honeycomb because of the bee's wax making it look inedible; I ate it and liked it: sweet, sticky, nice chew, and melts in your mouth. \n\nGive them some time & I may return during a warm summer evening.", "author": "Jessica S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-12", "description": "Awesome soft serve from Asia! Got the honey soft serve which is pretty much a classic staple flavour now. The soft serve wasn't overly sweet, which was definitely a plus. The taste of the milk was quite strong, which I also enjoyed. \n\nThe taste of honey complemented the soft serve quite well. I especially enjoyed scrapping the hardened honey off the side of the cup. \n\nWould recommend.", "author": "Yu S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-09-03", "description": "The soft serve is pretty but not much too it. There are tastier cold dessert spots in this area. Do yourself a favor and go to San Francisco's Hometown Creamery across the street instead.", "author": "Elsie M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-07-17", "description": "It's the perfect amount per person, so if you're planning to share - Goodluck!\n\nThe place is lovely. Something about white walls and pops of color makes me feel giddy inside. Very simplistic and cute. Love it.\n\nThe service was great. Very tentative employees! \n\nThe honey isn't too sweet. The honey comb on the other hand was, and I was just not a big fan of the flavor but the guy next to me loved it! \n\nThe soft serve had the perfect texture. Yes, that matters to me.. Some places just don't get it right. I'm just always on a hunt of a place that will serve soft serve like McDonalds do!\n\nAlthough the soft serve had the perfect texture, it lacked flavor.. Badly. I then realized that it wasn't actually vanilla flavor soft serve but just plain milk soft serve. \n\nI think if a place is already going to have few selection on flavors (toppings) then the least they can do is make the main keep component, which is the soft serve), taste flavorful.\n\nI wouldn't go out of my way to come back here again. If do think this place is unique and if you're around and craving for some soft serve, then definitely give this place a whirl!", "author": "K B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-07-29", "description": "Bad ice cream. The service was super bad and they ripped me off with the ice cream they left a hole in the middle. The next day I went to complain and they came up with a lame excuse saying \"Oh we did it so you can get the scoop of ice cream with honey.\" Lamest excuse ever. Also if I could I would give it 0 stars because of the experience. Don't get anything from there ever you'll get ripped off.", "author": "Adam S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-12-13", "description": "I almost never give One Star, yet this place rightly deserves it. This place is a corporation out of Taiwan and tied to a \"majestic\" investment firm.  It is a chain business. This is where a local, community small business should be.  Support the regional economy. and its families.  Not junk like this hole.\n\nHoney Cream does the most intelligent thing possible. Their products, like honey and cream, come from 6,500+ miles across the Pacific Ocean; whereas, Sonoma County is only 45 miles away.  So this must be extra special ice cream? Unless your tongue is numb, and you are a mindless human clone, the soft serve lastes like typical vanilla ice cream with a few molecules of honey.\n\n(Consumers should not permit their selves to be misled and exercise intelligence. Ignore the advertising spin and searches. Research concrete information on where your food comes from.)", "author": "David S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-08", "description": "Delicious, creamy milk flavored soft serve ice cream that can be compared to Honey Mee in LA if you're curious. I like that it's not overly sweet. However I would say price point wise it's fairly expensive especially since if you get ice cream in the cup, there is a hollow center. Hopefully this can be improved.", "author": "Wendy L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-16", "description": "Enjoyed the Cereal Milk flavor. Rich and creamy with a little crunch. Cornflakes mixed with oats drizzled with honey. They fill the cup first with the cereal oat mixture and then added the soft serve over it. Love the cereal crunch at the bottle of cup. The perfect size and not too sweet.", "author": "M S E."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-05-11", "description": "I've heard a lot about MilkCow in Fremont and the other honey soft serve ice cream joints down in SoCal so I got really excited when Honey Creme opened in the sunset!\n\nIt was my first time having honey soft serve, and I liked how it wasnt overly sweet. I had the soft serve with the mixed grains (which was basically powdered peanuts/almonds?) and it was good. I was trying to figure out what flavor the soft serve was, and the friendly employees told us it was milk flavored. Portions were kind of small, but we shouldn't be eating too much dessert anyway right? The employees are super friendly, service was great. I'll have to come back in the future to try the other flavors.\n\nAnother note - this place is cash only, but I'm sure they're going to fix that soon.", "author": "Annie L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-15", "description": "The coffee(espresso) honey cream was SOOOO good.  I've never had anything like it.  The texture and creaminess is what does it for me.  Im a huge fan of coffee anything and this combonation was out of this world.  \n\nThe shop is small, clean and quint.  Service was fast and friendly however it was on the expensive side.  \n\nTreat yourself to some Honey Creme!", "author": "Henry S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-21", "description": "The coffee milk tea soft serve was delicious with its subtle flavor, and creamy, smooth texture. For anyone who loves espresso & ice cream as much as me, you definitely need to try the affogato :)", "author": "Jackie S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-08-14", "description": "I got the matcha green tea and it was terrrrrrrible. Cheap hot pot green tea ice cream is better than this stuff. The first taste you get it like frozen hard milk fat and then you get an awful super bitter matcha. No thanks. I'm sure their original is way better but stay away from the green tea", "author": "mackenzie e."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-02", "description": "We attended the soft grand opening on 4/30. It's a small and cute place. Unfortunately, like others have mentioned -- there's a small bench available for patrons to sit on. Currently, there is only 1 machine and a small area set aside to assemble toppings. \n\nI truly appreciated the fresh cup of espresso that went with along my affogato. The espresso is brewed to order. (There is a bin full of Nespresso capsules.) I think they use decaffeinated coffee? A lot of the customers ordered their signature soft serve with honey. I wish the portion size was a little bigger for the price. \n\nThe soft serve is not your average soft serve that you would get a McDonald's. It's packed with more milk flavor. I will be back to try the cereal & milk flavor -- hoping it will be on par with Momofuku's cereal milk soft serve!", "author": "Jay Z."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-06-17", "description": "Honey I'm disappointed! \nI am such a fan of this concept and was so excited to try it since it was in the neighborhood. I've tried a similar one in SoCal, unfortunately that one was much better.\n\nThe soft serve was creamy but bland. My friend tried the affogato which was by far the favorite, def recommend trying that! Popcorn one was also good, and the whole honeycomb piece was fun but tasted just alright. Really nothing special here, and the worst part was for a tiny, almost sample size, cup of \"nothing special\" it was $4.50! Seriously... \nAlso staff was friendly, always appreciate that.", "author": "Fiona D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-08-04", "description": "I don't like this Honeycreme business. I don't understand the hype. \n\nI'll take it straight up: Vanilla ice cream with honeycomb. \n\nThe ice cream itself was okay. Soft serve style with no indistinguishable difference than McDonalds. I mean, I guess one could argue that it's a tad creamier but that's just splitting hairs. Their big seller is their honeycomb. Fresh pieces of honeycomb. How else could you get it? No way am I climbing up trees. But, actually, you can get them easily at the Farmer's Market. \n\nSo, was the honeycomb good? Of course. With the ice cream, it definitely was. So what's the big deal then? Can't we just buy a tub of vanilla ice cream from Safeway and a bag of honeycomb from the Marina and call it a day? \n\nWell, we live in a society where convenience is everything. Thus, essentially how the creation of Honeycreme came to be. It wasn't bad ... but it wasn't out of the world either.  \n\nCome here for your instagram photo. And don't miss the colorful cones :)", "author": "Fiona L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-09-27", "description": "3.5 tiny cup of milk-based soft serve at 4.25 with honey drizzle inside cup (or can have the actual honeycomb add on) like those found in LA and Asia. for me, more of a novelty and not a regular go to like a taiyaki soft serve.", "author": "Rob C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-16", "description": "I wanted to try this place today and its great. Love it. Also great service. I wanted to have something as an alternative for honeymee since honeymee is far. Although, I feel like the ice cream here doesnt have honey in it when honeymee did. Its just vanilla ice cream with honey comb.", "author": "Michelle N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-11-01", "description": "THE WORST KNOCKOFF Honeymee I've ever had. This placed tried stealing the look and flavors from Honeymee, but they didn't even get anywhere close to the taste of Honeymee. I got Honey and the honey itself seemed like it was honestly from one of those bear bottles from the supermarket. You can honestly get MUCH better honey from any farmers market! The soft serve had no taste to it and the consistency was lacking. The price is totally not worth it and I will not be coming back. Save yourself the $4.50 and wait til you go to Socal to try the real thing. \n\nP.S. They're also really stingy with the amount of honey they give you, especially compared to how much Honeymee would give you.", "author": "Cindy P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-08-23", "description": "Waiting for our dinner table we wandered down the street and saw people lined up inside and getting the fancy cotton candy version and it was fascinating. So after dinner we popped back over and shared an affogato. There was absolutely zero flavor to this thing, except for the flavor of the coffee. Truly...just no flavor at all. It didn't need to be sweet...it just needed to have some flavor. Ugh. We got one to share and neither of us wanted it. It went in the trash. That's expensive trash.", "author": "Laurie H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-23", "description": "I love Ice cream with a honeycomb!! I first tried one of these at Honeymee in LA and I was super happy to find that similar stores exist up in Norcal. Aside from this store, there's also milk cow in Fremont that pretty much serves the same thing. I'm not a huge fan of sweets so I think the ice cream with just the honeycomb is enough. They do have a lot of other options where they add honey or chocolate fudge on top of or in lieu of the honeycomb. Personally i think the honeycomb's the best part! :) A+ Now if they'd only open one closer to downtown :P", "author": "Annie Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-19", "description": "I think a lot of people don't appreciate Honey Creme for what it is. It's a simple milk soft serve with toppings. In this world of crazy desserts (baked bear... afters... rolled ice cream), this place is a no gimmicks (well maybe that cotton candy topping), simplistic dessert shop. \n\nIf you like Honeymee in SoCal, it's basically the same. And in it's simplicity, it's delicious. \n\nYes, it's a bit overpriced, but what in the city isn't? Prices are comparable to Honeymee in SoCal as well.", "author": "Jeannie L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-03", "description": "Haven't tasted many soft serves but Honey Creme soft serve seemed more fluffy and not overwhelmingly sweet. \nIt's apparently hand made and fluffed with organic milk.\nTried the cotton candy, affogato, and caramel popcorn...\nMy favorite is the cotton candy.\n\nCotton candy is made out of pure sugar cane and delightfully good!!!\n\nPay an extra $1 and you'll get it on a fancy cone.", "author": "Dee R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-06", "description": "Surprisingly not sweet which was satisfying. The consistency is so light and creamy. I opted for the chocolate beans which was pretty good, the beans weren't overwhelming - a light caffeinated kick.", "author": "Briget P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-01-13", "description": "I had such high hopes for this place but it just wasn't as good as I thought it would be...\nI came here one afternoon and decided to get a soft serve with a honey comb. I was pretty disappointed after trying it because it had little to no flavor even with the honey that was in it. It was also almost $5 which was pretty pricey to me but I thought in the beginning that it would be worth it but it ended up not being as good. I might return if there's any improvement but as of now, I don't think I'll be back.", "author": "Cee H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-07-06", "description": "I so wanted to love Honey Creme. Ever since I went to Honeymee in Orange County, I've been obsessed with organic true milk ice cream and real organic honey. What's the difference between Honeymee/Honey Creme ice cream and regular ice cream? The \"milk ice cream\" trend uses quality milk and fewer ingredients for a truer milk taste, so the ice cream tastes thick but still soft, and much less sweet, with no artificial tastes. So far so good, but the Honey Creme ice cream was nowhere as good as Honeymee.\n\nThe topping options are creative and fun - you can get the honey or honeycomb, but they also have cotton candy, popcorn, mixed grains, chocolate, or more. I think this is the first and only location in SF that serves true milk ice creams, so it's still worth giving a shot.", "author": "Kate M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-13", "description": "There are so many ice cream option on Irving Street and I am determine to try them all by the end of 2017. Honey Creme is a good addition to the line up. They offer a more unique twist on soft serve ice cream. I ordered the Organic Mixed Grain, which is tasty. The ice cream itself is not very sweet/flavor-neutral, and the consistency is slightly airy. Mixed grain itself has the texture of crushed cheerios and tastes very similar. I would say that the ice cream is lighter in consistency and sweetness compared to frozen yogurt/ice cream/gelato/McDonald's Sundae. If you're craving something sweet, I would not recommend this place. If you want something worthy of posting on social media, then come here. Service was quick and friendly. No inside table seating.", "author": "Daryll G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-14", "description": "Stumbled upon Honey Creme after spending the day at the park, chose a chocolate covered original - and it was perfect! The ice-cream was soft and light, and the chocolate formed a crunchy-sort-of-shell texture. Yum. Going to have to make this place a must anytime I'm nearby...", "author": "Jodie B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-03", "description": "The soft serve is super thick and creamy and barely sweet. Love it! \n\nThe small cup is a perfect portion size, however, I do take issue with the gap and spaces in the center of the soft serve. You know what I mean. A hollow soft serve ain't cool. \n\nI usually get honey or cotton candy at these places but I felt inspired to get the whole honey comb. It was fun until I spent most of the evening picking cold, hard wax from my teeth :D", "author": "Jacquee P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-21", "description": "I don't know why this place has lower reviews.... \nI've never been to honey mee so maybe that's why.\n\nAnyways I ordered the regular honey soft serve. I was tempted with the honey comb but wanted some more even distribution of honey. They were a little heavy on the honey but still tasted great! I shared with my BF and I'm glad we only got one bc it does get pretty sweet after a while. Yah it can be \"expensive\" but considering how much ice cream they give you, it's not that bad. \n\nI do have to say, maybe they can play some background music bc when I walked in it was like DEAD quiet. There were a few people eating their desserts but it was eerily quiet. \nWith several local honey options, it'd be cool if they let you choose your honey! Just a thought.\n\nCute little store and worth a try. Share one though!", "author": "Elaine L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-10-06", "description": "Gave this place a try after dinner, their soft-serve isn't all that. I got the honey comb soft serve and the comb was waxy which made me feel like i should've just got the one with just honey drizzle. The cup is really small compared to the pictures and i would come here only if was in the area craving soft serve, but honestly i would rather get McDonalds soft serve because it pretty much tastes identical to that but pricier.", "author": "Korina D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-21", "description": "I have to admit the first time I tried honey creme, I didn't like it. I thought the creme was too bland and that there was not enough topping. It grew on me...especially now that I know to ask for more topping (oats are my favorite). \n\nStill a hassle to eat the honeycomb with the creme though. You have to bite into the honeycomb and it has a very strange waxy texture. Be prepared to realize that the cup itself is pretty small. The pictures really do not do it justice. \n\nThey also have a loyalty card if you plan on going often....or even if you don't plan on going often get one just to hoard haha.", "author": "Anna H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-01", "description": "I heard this place is really popular in Taiwan and that totally makes sense. Their soft serve is legit - creamy and not too sweet. It's so good even without toppings! The price is a little steep at $4 per cup, but it is the perfect amount! I ordered the one with honeycomb and loved it. The honeycomb looks small, but it is super sweet so it was definitely enough to complement the ice cream. My bf got the affogato and loved it too. Didn't get to try one of their colorful cones or other toppings like popcorn, honey, cotton candy, etc., but I plan to next time!", "author": "Stephanie G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-05-23", "description": "It's a cute gimmick, I'll give them that. The soft serve can be addicting and the toppings are complimentary but I have to say, take a picture of your food because it's basically included in the price. 4.50 for soft serve isn't really worth it in my opinion. This is definitely one of those places where you come here to add to your Instagram. Besides the price, I will have to say I did enjoy my dessert.\n\nTo elaborate on the food, I ordered the soft serve with honeycomb. The soft serve had a nice subtle creme flavor, with no overbearing flavor and basically compliments whatever you add to it. However, I would recommend just ordering the regular honey because you get more honey that is evenly spaced out in the treat. I don't think any of the treats stand out from each other so it is much more of a preference thing. Just pick which ever flavor looks most appealing to you!", "author": "Jeremy M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-04-30", "description": "Surprisingly disappointing. First day of its USA opening (it's a chain in Asia) and was super pumped to try it out since SF never usually gets 'first opening in USA' of anything and as you all know, I LOVE desserts, especially soft serve. A few things happened: 1) they didn't accept card even though they had a square register 2) the honeycomb fell off after ten seconds (no lie), this is my first and ONLY pic. When I asked for a second honeycomb bc their first one literally tanked after the first pic, no apology AND they squished the soft serve that I couldn't even take another pic  3) I found a hair on my spoon and when I asked for a new one, no apology either, just handed me a new one. Overall, I'll chalk it up to opening day oversights so I'll give it a try in a few weeks again and hopefully it'll be better. The soft serve was also a little bland and the cone didn't taste that great either. Next time, I'll just get a stupid cup so I won't get disappointed.", "author": "Vanessa K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-05-08", "description": "This is a cute and fun but underwhelming soft serve shop. I am hoping that they expand their menu offerings to spice things up a bit. Come here for a plain vanilla soft serve topped with simple ingredients like honey, honey comb, chocolate chips etc. Prices are a bit expensive relative to the serving size. I thought that the soft serve tasted OK but was not amazing. Service is friendly and the line moves quickly. It was nice that they were offering buy one get one free coupons on their opening day after they ran out of soft serve.", "author": "Alice H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-17", "description": "Waiting for friends to cross the bridge.... stopped by Honey Cream for some milk tea. They use real honey and fresh honey comb. The original milk tea i got is very refreshing", "author": "A Squared T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-06", "description": "A good place for a creative twist on soft serve. I have tried both the honey and chocolate flavors. Honey was by far my favorite. The Honey Cream is similar to soft service ice cream, however it is much much creamier. Quick friendly service", "author": "Andrew N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-05-06", "description": "It's like a slightly less sweet McDonalds soft serve. With Costco honey drizzled on top. For $4. \nPASS.", "author": "Christine Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-19", "description": "Don't be fooled -- that tiny little cup WILL kick your @ss. I was all, \"What is this, a kiddie-size portion?? I'm gonna kill this thing in like 5 seconds.\"  20 minutes later, I was STUFFED and the cup was still like half full. It's much, much richer than it looks. \n\nThe flavor was milky, creamy, and not too sugary. It's basically soft serve made of lightly sweetened heavy cream. I ordered the honeycomb version and thought the little hunk of honeycomb could've been bigger. I was done with that part in like 4 bites. \n\nService was cheery and quick. The great thing about soft serve is they can cycle through orders quickly so even if there's a long line, you'll get served in a matter of minutes. \n\nIt was good, but next time I go I'll work up a bit of an appetite first and see if there's another topping option that'll go further than that itty bitty piece of honeycomb.", "author": "SfMom O."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-06-19", "description": "Umm.....yeah that basically how I feel about the ice cream.  I ordered ice cream with honey, it taste like plastic, I can tell they are using cheap low quality honey, ice cream itself is tasteless, no flavor.  I would say McD is taste way better than them.  Overall nothing special", "author": "Beth G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-21", "description": "Ice cream, what? The cups look so cute. Lol Anyways I walked into this place and the two gentlemen greeted me. I asked for recommendations and they suggested \"dark chocolate, cereal, or the honey comb\". I chose the dark chocolate because I was craving something really really sweet. \n\nThe gentlemen behind the counter made my \"dark chocolate\" and recommend a tad of sea salt on top, which made it really bomb as f**k. Haha. \n\nTheir customer service is so great. Parking can be a problem, but it is worth coming to this place. \n\nThe cup may be cute and small, but don't let the size fool you because I had my boyfriend help me finish my ice cream because it was so much.", "author": "Anriella D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-01", "description": "The fact that I don't have to go to a fast food joint anymore to get soft serve ice cream.. I'm in love!\n\nIn fact, I don't think I've ever been to a place that specializes in soft serve ice cream. I went in not even knowing what I was buying actually, I just saw a bunch of pictures of it in Instagram and snapchat. When you walk in there are big words that say \"organic soft serve ice cream\" and that's when I was sold. They have a giant menu on the wall as well as laminated paper menus to look at for the people with not such good vision. The service I received was very inviting and you could tell the people working were VERY interested to see how people react to their hand crafted desserts, smiles all around! \n\nI'll definitely be back to try different items on the menu, mainly the cotton candy one. But I went with the honey one to play it safe and boy was I in for a good time. It wasn't too sweet which is what I was afraid of but I mean come on, who's goes to get soft serve ice cream expecting it to be light sweet?\n\nOn the other hand don't be fooled by the pictures, the portions are pretty small. But like I said this is handcrafted organic soft serve ice cream. I expect them to have larger sizes in the future as well as a way to pay besides cash. But for now, DONT FORGET TO BRING CASH.", "author": "Antonio J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-07", "description": "This little place is such a gem. The inner sunset was lacking good organic ice cream! Tried this place in Taiwan before so I was so excited to hear that this one opened up in SF. \n\nMy favorite here is the cotton candy affagato. Great blend of sweet , bitter, and fluffiness. Can't wait to see if they add some more flavors into the mix. \n\nI highly recommend a stop in for a refresher! Sweet but not overly sugary! Just right for full filling a sweet tooth. :)", "author": "Linda W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-17", "description": "Simple menu, simple flavors done right. Not sweet by itself, the honey adds just enough to the soft serve. It tastes like cold milk, not tart like yogurt. I really liked the milk tea flavor with the honeycomb (sourced locally).", "author": "Lora A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-09-17", "description": "Tried this new place, not great. They only have vanilla.  It's the consistency of soft serve yogurt but has no flavor. I suppose you are supposed to get a topping or something. Seems like it's designed more  like a quickly than an ice cream place. Walk an extra block to the San Francisco Hometown Creamery for some good ice cream.", "author": "Steven B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-01", "description": "Deeeelicious! Best soft serve I've had compared to Milkcow, I ordered the popular honeycomb and the honeycomb pairs well with the original soft serve. They make the soft serve themselves, the same ingredients as they do at their overseas' stores. The environment felt so welcoming, with great customer service! Cash only for right now, but they will accept card soon (:", "author": "Suki L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-03", "description": "I loved this placeHoney soft serve ice creamit was so good and not too sweet if compare to honeymee and milkcow. This one is perfect for our tastes!!!", "author": "Khloe M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-22", "description": "The ice cream here is yummy and while I tried to get a pic of the honey comb my phone battery died. I also accidentally left it on the bench around 3:10pm-3:30PM on 5/21/17. If you found it, please charge and turn on and friends will try to call or reply to this post. The phone has a pink case with a popsocket on it. Please and Thank You!", "author": "Amanda L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-17", "description": "Cute little ice cream shop! Very limited flavor choices, but I got the cotton candy with milk ice cream and it was delicious (and super fun to eat).", "author": "Emily A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-30", "description": "This is a recently opened soft served ice cream parlor.\n\nThere is only one type of soft serve flavor but you choose the type of toppings you want. The general price per item is $4.50 for a cup that is bigger than that of bi-rite ice cream. For the uniqueness of the concept and the fresh ingredients on top of the high quality ice, cream, it is a really good place to go to for a snack on a sunny day or dessert after dinner.\n\nThe soft serve ice cream itself is probably one of the best ones I've had and I think is well worth it. You cannot compare it to that of McDonald's or Costco soft serves. It's not too sweet and is light and creamy.\n\nFor the toppings I tried honey comb (their trademark), mixed grain, and chocolate. I highly recommend all of them.", "author": "Stanley C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-19", "description": "Came to Honey Creme with my girlfriend. The place is pretty clean and has a relaxing atmosphere. There is a bench by the window to sit. The gf and I shared a soft serve ice cream with honey and a mango slush. I usually don't care about ice cream but it was surprisingly good not too sweet and went well with the honey which tasted like local honey. As for the mango slush, it tasted like fresh mangos and the sweetness and ice was just right. So if your an individual that doesn't like things too sweet, I would recommend this place for dessert or a hot day.", "author": "John C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-10", "description": "Inner Sunset isn't short of good ice cream and a big variety of them: if you aren't in the mood for gelato or frozen yogurt, you can always go to a grocery store and pick up some yummy Three Twins.  How would Honey Crème bring something different and special? I was a little dubious.  \n\nBut then again, I have never had honey comb mixed with creamy soft serve before either.  The simplicity is beautiful: the right amount of sweet and creaminess, no other flavors getting in the way.\n\n$4.5 seems reasonable to me. Blue Bottle Cold Brew is $4 and I just paid $5.5 for a boba drink so let's not dwell on prices from a decade ago anymore.", "author": "Candice B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-05-10", "description": "I got the honey comb, it tasted like wax! The soft serve was good, I just need to eat it right away and try another flavor next time", "author": "Karen T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-20", "description": "Simple menu with quality ingredients. The base is the soft serve and you can pick from a small selection of toppings  (cotton candy, kettle corn). The soft serve is frothy and not excessively sweet. My favorite is the affogato (for the espresso lovers out there) that reminds me of a Frappuccino except on a soft serve.", "author": "Conely C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-10-17", "description": "Both stars are purely for the service. The guy working here was extremely nice and we got our order quickly.\n\nHowever, the soft serve itself was subpar compared to other similar places I've gone to. It wasn't very creamy/milky and after eating it, both my friend and I didn't feel that post-ice cream satisfaction. We had gotten the new combo that has the cereal topping, and the cereal bits tasted a bit stale. All in all, we didn't feel like it was worth it for the price (~$4-5 each).\n\nTL;DR: Would not recommend and probably won't be coming back unless nothing else is open.", "author": "Natalie C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-03-11", "description": "Probably some of the softest ice cream I've next to frozen yogurt. I got the Chocolate Bacon with regular ice cream with extra chocolate. The ice cream was nice and soft. Chocolate was rich. The bacon and extra bacon were cooked pretty well and not burnt. I would definitely like to see them add more cream flavors in order to spice up the selection. Might also be great to have different sizes available.", "author": "John M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-07", "description": "Came here after dinner. Wanted something sweet but also some coffee. For those coffee lovers out there, must try Affogato.  It was so creamy and sweet. Lots of coffee flavor. They use real expresso shot for this! So bomb!\n\nWill be returning again :) yummmmmm", "author": "Crystal Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-11", "description": "i legit.. woke up the next morning craving the \"matcha\" plus honeycomb ice cream. honestly heaven. the matcha actually taste like matcha!!!! most places sugar down matcha.... which truly takes away from the original flavor. the honeycomb was AMAZING. a little at a time... so rich, sweet, and tasteful. my best friend introduced me to this cute little shop, absolutely no regrets.", "author": "Juliet Q."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-06-16", "description": "Was okay - I liked HoneyMee better. I ordered the classic ice cream with a honey comb. The soft serve had a weird, artificial-esque aftertaste, but I couldn't quite put my finger on what exactly it was. The honey comb was tiny and the bits got all uncomfortably stuck in my teeth. Also I think this place is pretty overpriced but I'm glad I tried it. If you want dessert, there are plenty of better ice cream options in the city. 3 stars for presentation and the very nice servers.", "author": "Wendy C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-04", "description": "The portion is totally worth the value. Their ice cream tastes soft and not too sweet, perfect for my taste buds. I tried the honey one and the drizzle of the sweet honey in combination with the creamy ice cream was perfect. Service was quick and they do a good job placing the soft serve ice cream into the cup and decorating it perfectly so that it's camera-ready! I will definitely try one of the exciting and unique flavors next time!", "author": "Tina R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-01-10", "description": "Very small spot with a bench along the window. The staff takes their time so you're not served a hot mess. I got the original soft serve in a cup with honey drizzle. While it was good, I wouldn't say I was blown away. However, that doesn't deter me from stopping in again to try a different flavor. I mean, what kind of monster would I be to not give soft serve a second chance?", "author": "Selena L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-07-01", "description": "Had to come try honey creme since they've made it here to sf. Theyre originally from Singapore, and that's probably why the hype for their soft serve is so crazy. I think it's pretty expensive for the quality & portion (8oz cup) - $4.50 for a soft serve with drizzled honey. Wouldn't go out of my way to get this - don't think I'll be back, good customer service though.", "author": "Angela L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-05-15", "description": "Tasted a lot like a McDonalds sundae but cost a lot more. I was happy to let my wife finish it.", "author": "Penny S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-02", "description": "This is for all the haters out there. This place was super yummy! Soft serve is smooth and creamy and not overly sweet. I got the pop corn topping and thought it was delicious! I will definitely be back to try other flavors! Staff was very friendly and helpful and service was quick!", "author": "Anise N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-09", "description": "I love honeycreme! But I do think their honey quality could be better. I've went to a sister store or competitor in socal called Honeymee and their honey is much richer. Base soft serve is the same across the board.\n\nMy favs are the original and honey drizzle. I think all honeycombs are too waxy when served with ice cream. Caramel corn kind of becomes soggy but it was still pretty good. Cotton candy is really for the kids but whatevs dude. Affogato is gr8.", "author": "Becca W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-08-08", "description": "Did it for the ig picture lol\n\nUpon entering the cashier greeted us and gave us menus. The soft serve was around $5-6 depending on what toppings you wanted. I got the cone with the honey comb and it wa just alright, nothing special. The honey comb was full of honey, but I didn't like the fact that i had to spit out the wax every other bite. \n\nOne of the workers saw that my honey comb was falling and rushed over to offer me another spoon to hold it in place. Very attentive and accommodating! \n\nGood service, but the price may be a little high on what you are offering.", "author": "Helen C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-03", "description": "I had the affogato with the cotton candy on top. The coffee pairs quite well with the soft serve- I liked that it wasn't overly sweet. I definitely could have just ordered without the cotton candy - I feel like I was just chowing down on the cotton candy to get to the ice cream and not actually enjoying it.Cute, new dessert concept but It's quite pricey at nearly $5 a cup. It is soft serve after all...", "author": "Jennifer W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-10", "description": "The moment we walked into this beautiful store, a friendly employee greeted us with hellos and told us about their signatures in the store. The tasty ice cream really was an escape from all of reality. I would really like to commemorate the employee for doing such a great job. Although and order was made incorrect for one of my friends, the employee ensured that she was satisfied. In addition to that, she helped us take a group photo,which I really appreciate. I would come here again! Thank you for a wonderful experience.", "author": "Bernice L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-05-20", "description": "I was craving something sweet and decided to give Honey Creme a try! It is a small location on Irving street with one employee working. It was a slow day so we got helped right away. Decided to get the affogato and the honeycomb. The soft serve itself was just okay. Not sweet which wasn't what I was looking for. The affogato was pretty good but the honey comb I couldn't even finish. This is a kind of place that I was glad to try it out but probably will not return.", "author": "Michelle T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-07-18", "description": "I'm confounded by this place. On the one hand, it's nice to have a light dessert, but on the other, it basically has no taste without toppings! Definitely not your American-style soft serve. Lacking flavor sans-toppings, it was difficult to get through even one serving between two people. Blah. Going to stick with ice cream or fro yo (so many options in the area!) next time. ;)", "author": "Shendi X."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-05-21", "description": "Meh. I honestly wouldn't come back to this place. There really isn't any variety, and the soft serve tastes exactly like Strauss'. I opted to get mine topped with cotton candy because I love cotton candy. It was honey flavored, which was novel to me, but they ruined it by putting so much salt on it. :( My cotton candy also blew away in the wind, but that was probably my fault for not holding onto it. Be sure not to copy my mistake! ;)", "author": "Rachel H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-26", "description": "Whenever I'm craving caramel popcorn I'll for sure come here. The first time I came here, my boyfriend ordered the honey comb and I ordered the caramel popcorn. He pretty much devoured his and then mine -___- The second time I came here (without him lol) I ordered half chocolate bean and have caramel popcorn because I couldn't decide. Customer service was great, always ready to answer any questions or give you suggestions.", "author": "Jasmine Z."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-06-24", "description": "Glorified soft serve. It was just okay and quite pricey for what you get. Albeit does taste better than regular soft serve bc it is \"premium\". You can taste the difference. It's smoother BUT I highly doubt I would come again and spend $4 per cup.", "author": "Dina V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-29", "description": "Great quality soft serve with some really fun, funky, and tasty toppings like cotton candy, chirps, and popcorn. Only drawback is that it is pretty pricey for what turns out to be a very small quantity of actual soft serve. Otherwise I would highly recommend!", "author": "Monica M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-30", "description": "We ordered the organic cotton candy and honey comb soft ice cream. The soft serve ice cream was delicious. It is kind of pricey considering the portion it came in; smaller than a tall cup from Starbucks. The cotton candy was salty but it contrasted well with the fresh soft ice-cream. I would be back to try the other flavors.", "author": "Curry S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-05-09", "description": "Not bad!!! It's not a dessert I would get often but once in a while cause I feel like there's other things better but for a quick go go dessert, this place is pretty good. I got the popcorn one and I really liked it, they gave decent amount of popcorn which was nice since I feel places like this tend to be a little stingy on the toppings. Customer service was pretty good too! Would come again!", "author": "Hiusan W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-09", "description": "Went in on a evening last week to avoid the crowds during usual business hours. New ice cream place on the block means everyone's going to be there fog or shine. I ordered the honey soft serve and the customer service is good. I got my order fast and the ice cream is delectable. Definitely will try the other flavors but hands down the classic honeycomb or honey is the way to go if you are a first timer. The soft serve consistency is spot on and the light sweetness of honey blends right in to the vanilla. I had expected the honey to harden in texture a bit because of clashing with the cold soft serve but the drizzle of honey was thin enough to avoid it. I'd definitely recommend this to any ice cream lovers out there wanting to try something different.", "author": "Serena C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-07", "description": "Honey Creme is one of my favorite ice cream places. The silky, creamy texture is decadent plus the addition of the honey comb makes it a premium novelty ice cream. 5 stars for deliciousness, but 4 stars for value. It costs approximately $5, which is equal to most boba dranks.", "author": "Alex Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-06", "description": "There is no shortage of ice cream joints in the Inner Sunset but Honey Creme stands out in offering a good quality soft-serve.  What I love about it is that it is not overly sweet.  I had the dark chocolate topping, which hardened on the top, adding just enough sweetness.  Staff were nice and efficient.", "author": "Renee C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-13", "description": "Its such a cute place and their ice cream tastes really good!", "author": "Luna S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-19", "description": "Very delicious, light soft ice cream. Not too sugary which I like. I got the honey which tasted like raw honey straight from the honeycomb, it fit perfectly with the soft ice cream. Also got Mango slush. All their slushes are made with real fruits which is not very common these days in this area. Best mango slush I've had in a long time. The fruits to ice ratio was just right.", "author": "Kattie P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-05-19", "description": "I would give my overall experience here a 3.5 star. I got the honeycomb one and my friend got the plain one. We both didn't enjoy it as much. For honeycomb it was a bit too sweet because of the disproportional amount of honey to ice cream. The ice cream also tasted very moussey and plain.. The ice cream tasted very similar to McDonald's self serve and it's very different from the honeymee in SoCal!", "author": "Anna X."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-15", "description": "Popcorn flavor reminds me of eating a caramel drumstick ice cream. Place looks clean, wish it was bigger with seating but then again it's just added expensive to the consumer so oh well.", "author": "Yale D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-09-02", "description": "We got the matcha honeycomb soft serve. It doesn't have enough sweetness or match a flavor  and tastes too creamy for a softserve. We literally threw out majority of the ice cream, which made us sad.", "author": "Linda L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-01", "description": "The ice cream doesn't have a lot of flavor. There's a hint of vanilla in it that isn't too strong. You do need the toppings for there to be some kind of taste. I tried the honey comb one and I didn't like it since there wasn't really any taste or sweetness.  I went again and I tried the dark chocolate. It was better than the honey comb imo. the portions are ok I guess?? It felt like a lot to me since I ate before I went here but if you're only getting dessert and haven't eaten then it probably wouldn't be enough", "author": "Annie L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-10", "description": "Finally tried this place since they've opened. This place is pretty simple and bare, I guess it's because they're new. Pros: the honey ice cream is not overly sweet, it's the right balance and it was yummy! They also have in hand menus where you can read instead of squinting your eyes at the upper menu. \nCons: cash only! At least for now they said. Needs to have more seating and tables perhaps? Portion is small.", "author": "Amy T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-21", "description": "Their honeycomb Ice cream is really sweet and milky, the shop is quite small and the portion is a little smaller than appears, but still good!", "author": "Ken H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-16", "description": "Great dessert, just wish there was a higher ratio of popcorn to ice cream (I love the texture and crunch)! Quick service, clean store.", "author": "Erica D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-05-16", "description": "ehhhh. Was so excited to try it the first time and was like its gotta be a 10.. What was the hype about? They use Horizon Milk and powder and topped it off with alot of Honey. \n\nI wasn't too fond of it and my kid and teenager loves desserts but wasn't too fond of it either and was in fact gross off how much Honey they use. Not jsut that but why isn't the ice cream as good as they should be to a teenager and kids taste buds?\n\nWas ok but nothing to really ramble about.. Went one and never returning. No biggy. I rather go to my local Whole Foods-isle and pick up an organic honey ice cream. \n\nI honestly can say I have had better..Nothing to rave about.. ehhhh\n\nOtherwise the colorful cones are cute and the honey comb display is ok. good luck..", "author": "Kamaela M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-06-11", "description": "Really smooth soft serve.  The prices were a bit steep, most of them close to $5 for a small cup.  The honey comb that I got to top off my soft serve was unique, but I definitely wished I got the regular honey because the beeswax in the honeycomb was very chewy.  They also charge extra if you want a little bit more honey!", "author": "Kay A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-21", "description": "In a world where everything is over sweetened with massive amounts of sugar, this is a god send! I love that the soft serve is not too sweet at all and super rich and creamy! I love that it's simply sweetened with honey and that the menu options are simple. It really just cuts to the chase. \nIt's like a cold, soft, fluffy marshmallow that isn't sugar laden.  One bite can bring you back to simpler times. Maybe kids these days overindulge in such extremely sweet concoctions that when something isn't as sweet, it's just not good enough. Maybe my taste buds have evolved over time with age and I'm better able to discern and appreciate the finer subtleties of life.  Perhaps it's just Creme and Honey, what were you really expecting? \nThis really hit the spot: not too sweet, cold, creamy, rich and oh just right! I felt like Goldilocks as she tried the perfect porridge.  \nNote: it's pretty expensive for soft serve ice cream ($4.75?) but it was worth the experience!", "author": "Tu L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-15", "description": "The ice cream is really good. My fave is just with honey. It mixes really well.\n\n9th and Irving though...", "author": "John R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-25", "description": "Delicious vanilla soft serve with a selection of interesting and yummy toppings, like organic cotton candy and caramel popcorn.", "author": "M M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-15", "description": "There's a lot of critical reviews here, but I liked it. It had the right amount of sweetness and the small cup is a perfect portion size.", "author": "Julia C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-05-04", "description": "In short: place is aiitte.\n\nI was a little excited about this place when I noticed it across the street, so I had to try it. I guess I fell for their marketing. Stupid buzzwords like \"premium\" and \"hand crafted\" got to my inner sucker and after eating it, I felt pretty apathetic about it.\n\nIt's really just soft serve. Expensive soft serve where they could have given out bigger cups, or at least fill the cup up instead of just keeping it hollow in the already small cup. Very underwhelming once you get it and realize that you just spent $4-$5 on something that McDonald's sells for cheap. Value to price ratio needs some improving.\n\nAs for the \"premium\"? I guess they use real honeycomb as a topping if you want to call that \"premium\". I guess. And I guess \"hand crafted\" is technically correct, since someone is using their hand to put on some miniscule topping. I guess.\n\nMaybe this is one of those 'fool me once' places. I don't see myself rushing back any time soon. It's like...good enough to eat again, but not good enough to go back..you know?\n\nyou knowwwww", "author": "mark t."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-09", "description": "the ice cream is very good. We ordered the honey one. It is just perfect together. Tasty and healthy !!! I will become a regular ..", "author": "SumVivian S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-12-03", "description": "I had the popcorn one. At first it was nice but after like eating half, I got tired of it. Share one with a friend instead. Saves you guys money, for the cost of it. Great for a first time, but the ice cream isn't that big of a deal to come frequently.", "author": "Liseth M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-12", "description": "Small servings, but just enough. Perfect location next to manna where I pre gamed before dinner. The honey tasted so good and the frozen yogurt was so smooth and milky.", "author": "Fernilla S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-06-01", "description": "Everything mediocre, except the price. If you want to pay $5.00 + tax for something you can make at home on a 1/2 working brain, come here. The wait, the wait for a single order was seven minutes.  What was she doing, milking the cow!", "author": "Suzanne H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-20", "description": "Cute little soft serve shop in San Francisco. Decor was very plain and simple, and the presentation for the dessert is definitely there. The employees were very welcoming and friendly. I ordered the honey soft serve and actually enjoyed  it despite their Yelp reviews. The texture of the ice cream was reaaaallly smooth and creamy. I suggest ordering the honey or dark chocolate because the cream itself is pretty plain, so the toppings add a little more flavor to it. I'll stop by again next time I'm in town to try their affogato, which is an expresso topping.", "author": "Jamie N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-10-03", "description": "I was so excited to try this place but was so disappointed! Nothing special at all especially for the price.", "author": "G O."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-08-28", "description": "+/- THE FOOD\nDefinitely a fun dessert but not that great. I decided to be bold and try the cotton candy affogato and it was just okay. They first swirl the soft service with the espresso and then attach a small piece of cotton candy on top. Then, they pour a small shot of espresso on top of the cotton candy to melt it (not sure why, it didn't taste like anything). Finally, they top the soft serve with a huge piece of cotton candy. The cotton candy was fun to eat but it didn't really incorporate well with the soft serve since you can't really eat it together. The soft serve was actually quite bland and even with the coffee, it didn't taste like anything! It wasn't sweet at all, which made it a bit boring to eat, after you finished all the cotton candy. I did try a bit of the honey ice cream, which was better since it had more flavor to it. This place is also a bit expensive ($5ish) so I wouldn't really come back often, and even if I did, I would only get the honey ice cream.", "author": "Cindy C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-24", "description": "Don't expect anything more than simply delicious, not too sweet, creamy soft serve ice cream. It's way better than McDonalds (who thinks that's good??), and it's not Cold Stone, so don't expect your ice cream to be laden with stuff. The consistency was smooth almost like custard, the chocolate topping was very good. Yeah, it's a little expensive, but for a special dessert, it was worth it. Friendly service, didn't have to wait too long on a Saturday afternoon. Parking isn't easy, so prepare to enjoy a nice stroll in the Sunset unless you have the blessing of the parking goddesses.", "author": "Yankee S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-04", "description": "I got the cotton candy affogato ice cream. I love how dense and smooth the ice cream taste and how cool it is when they are making it. I will come back again to try the honeycomb flavor.", "author": "Coco P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-03", "description": "The ice cream here is delicious.  It's a favorite in Korea so worth trying.  Love honeycomb in my ice cream.", "author": "Ernest S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-05-20", "description": "Had the soft serve with honeycomb. The ice cream was nice, soft and flavorful. A slightly different flavor than typical but not a bad thing. The honeycomb in my cup was tiny, even compared to the tiny cup itself. It cost me $4.75. I know SF is pricey but wow I can't rationalize that amount. It was nice trying it but I would not willingly come back at that price.", "author": "Danny Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-06-08", "description": "Meh. I was disappointed with the ice cream. It doesn't have much flavor and does not live up to hype. The affogato was good but didn't make up for the lack of flavor of the ice cream. Definitely costs more than it is worth.", "author": "Sarah K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-23", "description": "Simple menu, but delicious products. Currently eating the Affogato soft serve. I've been here twice so far and I love the thick, creamy consistency. I also appreciate that the soft serve isn't too sweet, since most desserts become overwhelming after only a few bites. From the products I've tried so far, this isn't the case. Glad this place exists, will be coming back soon.", "author": "Kelli K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-24", "description": "I surprisingly really like this place. I've tried their honey comb, popcorn, and afagato. I'd say afagato is my favorite so far. Their soft serve isn't too sweet, so the toppings they put on it gives it a nice balance. Staff is also super friendly! Great place for dessert.", "author": "Lina C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-11", "description": "My whole family really enjoyed this place exactly for the same reason some reviewers don't like it! Honestly think they opened this in the wrong city though. We looked online to see if they had other locations and were not at all surprised to discover they are a chain from Asia. Their flavor is light- not too sweet. If you are used to regular American ice cream and desserts- and enjoy the sweetness of it, you will think this doesn't have taste. But for those who are more reserved in their intake of sugar, this hits the spot!", "author": "Jai L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-24", "description": "Very tasty soft serve ice cream, the honey comb is tasty and sweet.  It goes well with the creamy texture and the not so sweet of the soft serve ice cream.", "author": "Stevezee C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-05-06", "description": "Before I begin my review, here's a little background information about Honey Creme:\n\nHoney Creme is a company with many locations throughout Asia and is owned jointly by Taiwanese and Korean companies. This SF location is their first in the U.S. They are known for using fresh, organic ingredients that are found locally, and for garnishing their soft serve ice cream with real honey combs harvested from bee farms.\n\nNow onto my review:\n\nI came here the day Honey Creme opened and the timing was impeccable. SF had unusually warm weather that day, making me crave ice cream like a fat kid who loves ... well, ice cream! I, myself, am not a big fan of ice cream, but looking through the photos that IG users have posted worldwide, it had really excited to try it out!\n\nGot there in the afternoon and totally bypassed any line they probably had in the morning time. The staff were friendly, energetic, and eager to take your order. Looking at the menu, though, I was a little disappointed. It's still somewhat limited, and the selections are fixed in portion size and no customization of toppings are allowed. They also didn't offer some of the items I saw online, like the Yuanyang Milk Tea with Boba - ( http://www.honeycreme-icecream.com/img/our_flavors/introduction/Yuanyang_Milk_Tea_With_Boba_Cup.jpg ) or their Churros - ( http://www.honeycreme-icecream.com/img/our_flavors/introduction/Churros_Cup.jpg ).\n\nI chose to just get a cup of their original ice cream ($3.75) to share with my friend. The cup was small, maybe too much so for many, but was the perfect size for me and my friend. To my surprise, it was good! Refreshing, airy, and not cloyingly sweet. But I also felt like I could get this kind of ice cream at many places in the city. And since I was sharing it with my friend, we asked if we could also get an extra empty cup to split the ice cream with, but they only allowed us to get two spoons. Maybe they're on a budget because the cute logos printed on the cups cost a lot?? But I honestly didn't mind because they were generous that day and gave away coupons for a free ice cream. How nice! The interior of the shop was also sweltering, and the only seating was a bench beside the window with no more sitting room, so we had no choice but to go outside to eat the ice cream. TIP: Eat fast, cause it melts fast!!\n\nI'm glad a shop like this has opened in the area, but right now, it's just a little too gimmicky and feels like a passing fad. Once the IG users have taken their photos with the shiny, golden honey combs on their soft serve, the competition will be too fierce if Honey Creme doesn't offer a wider selection or offer customization options. In the meantime, I will go back to use my free ice cream coupon. ;)", "author": "Enari L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-08-21", "description": "I was excited that they opened one in San Francisco, so I finally got to try the honey comb one. I think it is pretty pricy for a small cup of soft serve, and it really doesn't taste anything special. They also don't have any seatings inside. The ice cream itself is decent, but it's not worth the price. I would not come back again.", "author": "Maylene F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-05-14", "description": "Reminds me of soft serve at McDs but jazzed up with honey and other fancier toppings. Prices are a bit high for the portion size but I guess it's like getting a fancy drink at Starbucks. At least you get your dairy intake for the day with the soft serve. Get a stamp card if you plan on coming often.", "author": "W A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-07", "description": "lovely cute and quaint. got the caramel corn topping and it was wonderful. their caramel is very good. the serving was a great size too. it's a very simple place. worth a visit.", "author": "Elizabeth H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-25", "description": "Even though I just paid near $5 for a cup of soft serve vanilla ice cream and a piece of honeycomb yesterday, I still am giving a 5 star review.\n\nAt first, when I received the cup, my honest first thought was \"I can't believe I just paid $5 for vanilla soft serve that I couldve gotten at McDonalds for less than half minus the honeycomb\". My thoughts changed pretty quick as I devoured the first few bites.\n\nDespite the reviews saying that the soft serve tastes like something you could get at McDonalds, I found it to taste much smoother and tastier than anything I could get at McDonalds. The honeycomb really does make a difference when you eat it together with the ice cream, it really was a delicious pairing! Granted $5 is steep for a small cup of soft serve and a piece of honeycomb, I'd say it's definitely something you should try. Heck, I paid $5 for it yesterday and already feel like getting another one today!\n\nTwo people behind the counter, young guy and a young girl who I heard is the owner. Not much to say about the service as all they need to do is take your order and make it. The girl was extremely nice though!", "author": "R C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-06-03", "description": "Average ice cream, it was pretty to look at but the taste was nothing out of ordinary. At least I got to update my Instagram.", "author": "I Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-03-26", "description": "Parking sucks out here, but it's Irving street so I get it. It was my first time here- just popped in with my friends. The flavors are different than what I'm used to at other ice cream shops. If you love chocolate/coffee/cotton candy flavors, then you'll be happy here. They do have a milk tea flavor, but it was too sweet for me. I stuck with the original milk flavor with honeycomb- it's really airy and light but after a while, it got too sweet. IMO there's too much ice cream in the cup for one person to eat, but the pricing is fair. I might come back and share a cup of ice cream", "author": "Ali C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-15", "description": "This place is so cute. I came in here for my first time. Honestly, everything on the menu looks bomb. The worker helped me pick out what I should get. I ended up getting affogatto which is basically espresso type of ice cream and it was so good. Definitely will be coming back to try out the  other flavors.", "author": "Ana C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-08-09", "description": "Just looking through the pictures it gave me a good feeling about this place. Unfourtanely, the taste was way different than I expected. I ordered the basic honey comb but was dissapointed by the plain taste and the last bit of honey on the bottom of the cup.", "author": "Melanie N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-07-10", "description": "It's \"OK\" ice cream, nothing very awesome, especially when you're paying over $4 for a such a tiny cup.\nAround here there are so many ice cream shops lately, I don't see myself coming back here, organic milk thing maybe cool, but not strong enough reasons to pick specifically this store among all other ice cream shops around here, plus there is \"Ice cream Bar\" on Carl/Cole.", "author": "Micky F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-08", "description": "The cup is definitely really small like some of the other reviews suggest, but their service here is amazing and there is a difference in their soft serve compared to other places. It's thicker and tastes more real and organic than most soft serve. It's a bit on the pricier side; my friend and I shared the Honeycomb option and it came out to be $4.50. I'd say share the dessert because even though it's pretty small, if you're coming after dinner, it seems really heavy due to the thickness of the ice cream and the toppings. All in all pretty good. I'm not sure if I'd come often, but if a friend wanted to go, I'd come with.", "author": "Chris V."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-07-10", "description": "This place was highly disappointing. The flavor of the actual soft serve tasted chemical, I couldn't finish mine despite it being a hot day. I will not be coming back for this strange concoction.", "author": "Diana B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-05-26", "description": "It taste like regular ice cream... Nothing wrong with regular soft vanilla ice cream and nothing special for the price I paid. Meh.", "author": "ABC Z."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-06-10", "description": "Why pay so much money for something absolutely TASTELESS?\n\nHoneycomb was cool though.", "author": "Folashade M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-06-10", "description": "3.5/5 \n\nThere is no way of justifying the whopping $4.75 price tag... The ice cream was mediocre and like every other non self-serve ice cream/froyo shop, you're going to get a hollow center. The honey comb makes the ice cream 10x more interesting than it actually is and I guess creates an opportunity for an insta pic... But personally, I didn't really enjoy the honey comb.The waxy texture resembled old gum. The mixed grain ice cream was surprisingly good though. I forgot what the powder consist of, but it somehow added an interesting flavor (in a good way) to the ice cream.", "author": "Tiffany W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-06-04", "description": "Agree reminds me of a glorified McDonald's sundae.  Soft serve with a drizzle of honey didn't impress me.  Not sure what all the hype is about.", "author": "Zoe B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-07-10", "description": "Flavourless junk. Seriously my gf and I both threw ours out. I had the original honey cream and it has almost no flavor whatsoever. If you must go, get a lot of toppings because the base ice cream is awful.", "author": "Alex S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-05-17", "description": "Got the popcorn one and it was very good. The person really packed in a lot of popcorn and I really appreciate that. The workers there were very nice. But for $4.50 for just soft serve ice cream I think it's just too expensive. I would come back to try the honeycomb one though.", "author": "Celia Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-03", "description": "I think this is the best fro-yo in San Francisco. Fatty, creamy, not too sweet. Perfection! Organic dairy to add another plus.", "author": "Michelle C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-05-31", "description": "Good but average regular soft serve ice cream. Considering the name of the place, I thought all the ice cream was made with honey or something creative, only to find out it's just regular tasting vanilla soft serve. I was disappointed.  You actually have to order one of the honey-related items on the menu to get this \"honey creme\", which I didn't know until after ordering my dark chocolate (because I'm a chocolate person) and by then had already spent $4 on a very small cup. Personally I will walk down the street to the San Francisco Hometown Creamery & get something unique, rich & creamy next time. 3 stars only because it's ice cream, period.", "author": "Emily S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-13", "description": "I've been meaning to try this place out for a while - it's sort of tucked away on a less busy part of Irving Street, near 10th Ave. The concept is fairly simple - milk flavored soft serve with a variety of toppings. Their name sake is honey (honey comb, or honey), but I ended up trying the special Cereal Milk ice cream. The soft serve appears bland at first, if you're expecting vanilla, but I sort of like it. It's not too sweet and therefore you don't feel like you're overloading on sugar when you eat it with the very sweet toppings (e.g. honey). That said, I didn't end up finishing my whole cup because at the bottom (where there's no topping) it didn't taste like anything. But in concept I like this place!", "author": "J L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-05-02", "description": "This place uses the same white soft-serve \"ice cream\" (if you want to call it that) as a base for their \"ice cream\" offerings --  The only difference between their offerings are the toppings and mixed-in amendments - most of which appear to be made primarily of sugar. \n\nSo - try a taste of the base \"ice cream\" before paying 4 to 6 dollars for an order with toppings. \n\nWe ask for and tasted a sample.  \n\nIt is NOT ice cream.  Frankly don't know what it is but it has a distinct chemical after-taste.  We couldn't even finish the sample --  it was ghastly and went straight in the garbage bin. \n\n They refer to many of their toppings as \"organic\".  The fake \"ice cream\" cannot possibly be \"organic\" --  actually it cannot possibly be ice cream.  Most of what you are paying for in their very small servings is the \"ice cream\".  Save you money for something that is and tastes real. \n\nWe can't think of a single reason to pay 4 to 6 dollars for frozen chemical glop topped with a tiny bit of so called \"organic\" sugary substance. So although we live in this 'hood we won't return to \"Honey Creme\" \n\nTheir offerings may LOOK \"pretty\" but in this case pretty is as pretty TASTES and and this stuff TASTES pretty gross.", "author": "Yelp E."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-05-02", "description": "first of all, i've lived in the neighborhood for 22 years and the recent proliferation of chain stores and especially asian corporate businesses saddens me and detracts from what used to be the charm of the inner sunset.  that said, honey creme's corporate product is overpriced, unimaginative, and as dull as, well, vanilla.  since when is ice cream from a machine such a precious commodity?  $4.50 for a very little serving, either in plastic or on a really lousy cone.  find a local business to support.  this place doesn't deserve your money.", "author": "Alexandria B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-09", "description": "It was pretty good.  It was light and fluffy and great if you're lactose intolerant to a certain degree.", "author": "Lorey P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-05-16", "description": "A new ice cream place right on Irving! It's a cute small shop with some nice looking ice cream. The people were nice and the toppings they had are really different from other places. However, the soft serve ice cream was not what I expected. It was definitely different from other ice cream places. I thought it was going to taste like vanilla but it tasted like plain milk which was different from what I am usually used too. I got the ice cream with coffee bean while my friend got the one with dark chocolate. I didn't like the coffee bean one. It taste like the corn pop cereal BUT my friend's dark chocolate was really good. I will definitely get that next time or the honey one. I should give this another place a try and get a different topping. I shouldn't let my first visit stray away from this cute little place. I will still keep this review a 3 star, but my mind might change the next time I come here", "author": "Peter N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-17", "description": "Great place for a quick dessert! It doesn't take too long even with a line out the door. I love their ice cream, it's very creamy and smooth. It is not a big portion but I think for the price it's worth it. I just wish they have more than one flavor of ice cream.", "author": "tim y."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-09-30", "description": "Sugary toppings on cheap soft serve ice cream that made our stomachs feel...ugh.  Much better options in the area for the money.", "author": "D S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-08-21", "description": "Too sweet and flavorless. I would recommend go to other ice cream stores in the neighborhood.", "author": "Nan Z."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-05-19", "description": "some pics def make them look bigger than they appear but the cups are about palm size. the soft serve wasn't too sweet which was nice. tried the chocolate and honeycomb. i added the cotton candy on my chocolate and it wasn't as sweet as other cotton candy. since i got the cotton candy it took awhile for my order since they spun it right on the spot. so the chocolate is suppose to have two premium dark chocolates...one for the base and the crunch...i wasn't that fond of the base. wish they had the other flavors:  http://www.honeycreme-icecream.com/our_flavors_en.html like 【Rose Jam with Popping Cotton Candy】,【Yuanyang Milk Tea with Boba】and 【Tiramisu】", "author": "she q."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-05-11", "description": "We stopped by to get the kids a treat.  It was ok.  The ice cream is tasty but nothing spectacular.  We got the chocolate syrup.  Again, it was ok.  Honey creme is really expensive for what you get - the soft serve was hollow inside the cup.  The cup is already small so you get even less than what you think.  I think we'll go to easy breezy for the size and selection next time. Or maybe get two pints of ice cream from the grocery store.", "author": "G. W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-04", "description": "I thought that this place was pretty good. I ended up going with the Chocolate Beans flavor and paid $4.50 for a pretty small cup of ice cream. It tasted great and that's not the reason I'm leaving a 4-star review. The portion size felt a bit small to me given how expensive this place is... The ice cream did taste great, as I mentioned, but you pay quite a lot for not very much.", "author": "David P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-05-15", "description": "Fun place with such a cute vibe! I got the popcorn covered soft serve. It was very good, but nothing too spectacular. Definitely wanted to try it, but from now on I'll be spending my $5 for ice cream down the street at one of the other shops.", "author": "Tony G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-05-14", "description": "I paid $5 for a cup of soft serve ice cream and a tiny piece of honeycomb on top.", "author": "Tim M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-12", "description": "I've been here several times.  The best was the first day it opened.  The texture was smooth, creamy, and lightly sweet.  That's was perfect.  It was so pure and tasted heavenly.  Why not 5 stars.  Recently the soft serve is inconsistent in taste. It was icy and sweeter tasting.  I think the price is also a bit high for a small cup of soft serve.  I will definitely come back.  I hope they will be able to make it more like the first day I had it, creamy and lightly sweeten.  Please do not add more sugar!  Don't make it like other soft serve.", "author": "Dee A."}
