{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-14", "description": "I've never actually had coffee here, but this is my favorite place to get San Francisco made treats.  My old boss got our team little boxes of caramels several years ago and I was pretty much hooked ever since.  I recently bought boxes for 10 of my coworkers across the country and mailed them to everyone. Needless to say they were just as obsessed with those sea salt caramels as I am.  \n\nBtw, if you want to buy these during the holiday season you should definitely pre-order.  It's highly unlikely they will be available to purchase in-store.", "author": "Jessica F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-12-01", "description": "Yelp's search algorithm refuses to show this place in its dropdown menu of suggestions as soon as you finish typing the word \"hooker.\" And yes, Hooker's Sweet Treats is smack dab in the heart of the Tenderloin, so what could possibly get more San Franciscan than that? \n\nWhile this infamously gritty neighborhood is a little rough around the edges, it has plenty of character. No, these aren't just any hooker's sweet treats you'll sample here. These are artisanal salted caramels that were clearly made with love and you'll sit at the communal table (found in every up-and-coming restaurant in San Francisco) and savor every single bite. \n\nEnjoy it while it lasts, because you'll only get two or three bites out of every caramel, which makes it hard for me to justify the price of these caramels. The flavor combination found in the dark chocolate, small pieces of pretzel, and rice cereal in the Party Girl Caramel was admittedly quite tasty, but none of the salted caramels really wowed me. This place reminds me of the pricey creative cookies you can find at Milk Bar in D.C. or New York that are unfortunately never really worth it. I think I'd much rather treat myself to a box of See's Candies to get more bang for my buck or resort to the discounted candy aisle at Walgreens the day after Halloween...", "author": "Amy C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-16", "description": "Love love LOVE this place!!!! Hook is the best. Excellent treats for family and friends! My clients love these so much it's now expected whenever we meet....", "author": "Anne L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-13", "description": "Mastery of excellence. \n\nTop tier. Some of the best caramel I've ever tasted. 3rd nut blew me away! Spectacularly delicious! Ideal presentation. A box of their sweet treats would make a great gift.", "author": "Rosalyn W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-22", "description": "REVIEWER # 244\n\nYou would never know this place exist...well at least I didn't. It took a friend to tell me about this place and once he told me the name of the little joint I LOL'd! (Laughed out loud).\nYes, the name names me chuckle but the chocolate has me coming back for more!\n\nDID YOU KNOW: That this store was on the cooking channel \"Unique Sweets\" and trust me when I say, the owner David, does make unique sweet treats.\n\nYup, you heard me right, David the owner is the one that makes these sweet treats sweet....Okay so that may be cheesy but you get the drift! The store has been around for 6 years! Wowzers! I would have never known since I have never heard of this little gem before.\n\nThey offer a handful of flavor combos but the base on them all is a salty buttery caramel that is both creamy, chewy and doesn't stick to your teeth. Seriously, how often do you find that? They have about6 or 7 flavor choices that all run $2 a pop and considering the size and handmade-ness of them all, it's pretty worth it. \n\nI was so impressed with the work that David does that I had to order the $20 box of 10 pieces of chocolates. 6 or 7 of those are specialty flavors and 4 are the original flavors.\n\nHonestly I love all of them! They all have unique flavors and special names and I admit they are unique names as well such as:\n\n-Party Girl Caramel-The sassy and spicy chocolate \n-Straight Boyfriend Caramel-The curious chocolate who really wants a little TLC. This chocolate consists of 3 types of chocolate, peanut butter cookie base, & candied peanuts. Yum\n-The Towne S/more Caramel-Who has been around the block awhile! HAHA\n\nOKAY...so you get the picture right? Very unique names they are!\n\nThere specialty includes: handmade salted caramels\n\nThe sweet that started it all: the OG, a buttery caramel encased in organic, fair-trade dark chocolate and dusted with smoked sea salt\n\nMy Recommendation of them all: the 3rd Nut caramel, an OG chock-full of almonds, cashews, and pecans\n\nOther sweets that they sale in the store: strawberry-chocolate-chip bread pudding and caramel pralines, which 7x7 deemed one of the city's best cookies\n\nLocal retailers that sale Hooker's products: Sightglass Coffee, Rare Device, and Bi-Rite Market\n\nBIG thanks to Daniel who was the cashier in the front and helped me with my order.\n\nBIG SHOUT-OUT to David for making this delicious tasteful chocolates that will definitely keep me coming back for more!\n\nOverall, I would definitely recommend this to all my friends especially the ones that are new to town. This is such a hidden gem that sales the BEST DANG CARAMEL CHOCOLATES. They make perfect gifts for birthdays, anniversaries or just to treat yourself.\n\nTrust me you will have NO regrets!\n\nREVIEW 63/196", "author": "Porsche C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-17", "description": "This place is a golden gem in the TL inconspicuous. And amazing.  I love it\n\nAmazing caramel Treats and odour in the. Morning. The bread pudding changes weekly and at delicious. \nCan't wait to come back every two weeks for a treat. So unique and delicious \nThey also have day old discounts.", "author": "David C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-23", "description": "This is my go to spot for nice gifts.  I even run by here to grab boxes for sweets when I'm going out of town to bring as gifts.  Hooker's makes a superb product.", "author": "Pauline C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-12", "description": "Love Hooker's style...Adorable classy cool spot with an outstanding Americano, really friendly service & a fun theme. Another shining little gem in the TL.  The caramels are excellent the vibe is cool inside & I will definitely be back. Great spot for meeting someone.", "author": "Chelsey G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-15", "description": "There were two customers in front of me. I was acknowledged and it didn't take long before I got to order a French press and their famous bread pudding. The coffee was $3 for and single about 12 oz. Bread pudding was delicious, $6. \n\nI noticed that there were many repeat customers that live around the neighborhood. I overheard the owner greeted the customer and said \"will it be the usual\" followed by his first name. That' excellent customer service and people will be back. \n\nI haven't tried their lattes or their caramels or bars but will get it next time I go. Their coffee is from Sightglass which is pretty popular in SF.", "author": "rod h."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-09-15", "description": "I know a local business like this depends on good reviews but why would they have such bad customer service then? They gave me a lukewarm chai latte so I said something and the barista is like now you've taken a sip I can't make it hotter and I was like ok but it's cold. So he made me a new one and it was still lukewarm he was like is it better and I was like it's still kind of cold and he threw my money at me and said take your money. This never happens so I don't know what's wrong with you. It is not even tasty either. I'm sorry I did not bite my tongue and pretend to enjoy a lukewarm $5 chai latte but I chose to stick up for myself. And as a woman that probably pissed him off. Should have known with the misogynistic name.", "author": "Ashley U."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-02", "description": "Wednesday around 10am I was the only customer and bought a tidy box of the devil's desert that I'd sampled after forgetting about a Xmas gift of the stuff plus a coffee to go and 2 day old pastries about 27 bucks with tip.\n\n\nI ate the box of chocolates over two days instead of sharing. Damn you. I'll try not to visit they have the correct ratio of salt to chocolate, I see red wine pairings the devil's haidmaiden ...", "author": "SF T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-14", "description": "Amazing Chocolates / Scones and coffee. \nThere owner Paul is very friendly and the other people working their are also.\nLimited seating, Pet friendly for afew dogs at any one time only.\nThe assorted gift box of chocolates $20.00 for 10, were a huge hit for my peeps. Thank you!", "author": "Séamus C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-06", "description": "Oh my goodness, best caramels ever! I was staying in the Tenderloin district for a conference and was so excited Hooker's Sweet Treats was only a few blocks from my hotel. Even if you are not in the area, you 100% need to make the trip over.\n\nI was looking for a gift/souvenir for my husband and these caramels did the trick. The shop is very neat, warm and rustic and looks like it would be a great place to grab some coffee and relax. There are 7 types of caramels and they look and smell delicious. Because I couldn't decide, I bought the mixed box of 10. Each box is packed in front of you and beautifully wrapped in twine. \n\nMy favorite was the original, which is their signature sea salt caramel covered in dark chocolate. Holy moly, probably the best candy/chocolate I have ever eaten, truly decadent and incredible. The box is $24 for 10, so pretty pricy, but worth it...take it as an investment in your happiness :) \n\nOne regret....I wish I had bought more!! I will definitely be buying some online for holiday gifts and for diet splurging.", "author": "Vaish P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-15", "description": "I am addicted to these amazing creations. David and his crew work hard and it shows in the end result. Mouthwatering, sweet, delicious handmade caramels!! If I'm visiting friends out of town or state, this is my go to, unique SF gift to bring as a gift.", "author": "Kevin H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-09-04", "description": "After a terrible disappointing visit to farm:table, I walked over to Hooker's Sweet Treats to try some of their bread pudding. I liked this place, not because it was anything special, but because the staff was friendly, the atmosphere was comfortable and the coffee was good. \n\nThe bread pudding itself was decent, although it relied a bit too much on the caramel sauce and nuts as toppings to carry it. I've definitely had better bread pudding elsewhere.\n\nOverall, if I were in the tenderloin for some reason and needed something sweet nearby, I might stop by here again. I wouldn't go out of my way for it though.", "author": "Mark O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-28", "description": "These chocolate caramels are the best I've ever had!! The original is my favorite (caramel, sea salt and chocolate) however, I got the mix box of 10, it's a bit pricey but I think well worth it. I can't wait to try the rest of the flavors. \n\nThe owner is really nice, we were the first customers at 8:30 am on a Tuesday which we enjoyed because it's a very small store. We were able to talk to the owner about the caramels, and the stores appearance on the cooking channel. The coffee was good and they also had some pastries that look delicious. \n\nI recommend Hookers on your list of culinary destinations in the city.", "author": "Natasha E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-04", "description": "Everything here is delicious from the cookies to the sweet treats to the bread pudding. Friendly faces greet you and are very helpful if you ask them about recommendations and such. The place is small but kept very neat and tidy and is kind of hidden in a part of the city that most people won't visit. Stop by if you have a sweet tooth, or not. Highly recommended!", "author": "SF N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-08", "description": "The best caramels in the US.   Amazing.   My go to for sending an amazing gift.   Everyone that received them loved them.  They usually end up ordering more.  They only ship at specific times of the year, so check the schedule.  Also if you want to get them around a holiday you will need to order early.   3rd nut caramels are my fav.  Order them, you will not be disappointed.", "author": "Cydney W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-30", "description": "The salted caramels are one of the most amazing treats you'll ever try!", "author": "Mabel Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-28", "description": "What a cool neighborhood spot! I really enjoyed meeting David and Daniel and sampling the delicious bread pudding! On about a half-dozen occasions I have picked up a large box of the assorted hand-made caramels and taken them with me to share with coworkers, friends, and family and the delicious sweet treats were *always* well-received!", "author": "Lou S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-01", "description": "Me: Sorry, couldn't think of what to get you for your birthday so I got you Hooker's. \n\nBobby: uh ... come again?!!  0_o\n\nFor sweet beginnings and happy endings, give the 3rd nut and original Hooker caramels.\n\nBest birthday surprise ever.", "author": "Janice C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-03", "description": "This is...THE BEST CHOCOLATE/CARAMEL....I've ever had. Oh my goodness. The caramel with a little bit of sea salt on top?! It's JUST the right amount of sweetness. Amazing.", "author": "Jessica M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-11", "description": "I went here a few months ago with some of my co-workers and I am still raving about it to everyone. These little caramel treats are to die for. My co-worker got the bread pudding and while I am not a bread pudding fan at all, Hooker's Sweet Treats bread pudding might have changed my mind. I got the sea salt caramel and if it wasn't so expensive per treat, I would've bought them all. Highly recommend!", "author": "Amanda N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-24", "description": "Very rich caramels; but oh so delicious! Especially love the white chocolate one and love the hint of salt!", "author": "Siv L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-15", "description": "The caramel pecan seasalt bar is addictive! \n\nI ordered one planning to eat half, and save the other half to bring home for the husband. But it tasted so sweet, bitter, crunchy, and salty at the same time - that I finished the whole thing by myself. So I had to buy another one to take home for the husband. \n\nAfter dinner, he opened the bag, started eating that bar, and said \"I'll just have a bite\", I assumed he would save me a bite. But before I knew it, it was gone! Nothing was left, not even a crumb!\n\nEvil! (The bar, not the husband)", "author": "Wendy K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-22", "description": "Love this little place! It's in my neighborhood and I stop in once in a great while, too much good stuff! I tried the sweet potato bread pudding, with salted caramel on top. Holy fuck balls, Batman! It was one of the best things I've ever shoved in my mouth. I'm a HUGE fan of bread pudding, and this one takes first place. Great customer service to go along with it. A must try!", "author": "Cesar R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-29", "description": "Our absolute favorite place for homemade Carmel's. Every place else never compares! A special gem of a place with great friendly staff too!", "author": "Karen S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-09", "description": "I've been following Chef Matthew Pangelinan for several years now, the way one loyally follows anyone who is worthy of the effort. The hairstylist who gets it just right... the mechanic who is the only one who can keep your 300K mile German car purring like a kitten... the doctor who knows how to give you a shot without inducing winces that would make Dick Cheney uncomfortable... you drive a little further to stick with them. If you don't, you end up with a crooked bowl-cut, a broken-down car, and an injection site that looks like something out of Trainspotting.\n\nThis place, simply put, creates desserts that are fine enough for fancy occasions, accessible enough for everyday consumption. I'll even pop in for a latte and a caramel on a Saturday afternoon if I'm in the neighborhood. Absolutely delicious. Trust me, stop in for something sweet and something caffeinated... you'll never pop in to visit those hacks at Ghiardelli again...", "author": "Sean B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-13", "description": "Really great place for coffee and a sweet bite. Dangerously close to my house though :) \n\nI stopped by for a cappuccino this afternoon. I was actually hoping to try their bread pudding or biscuits but they were out of biscuits (gotta go early for those) and the lemon/cherry bread pudding sounded a bit too daring for my taste buds. I did, however, get a peanut butter chocolate cookie which was AMAZING and tried a few of the salted caramels-all delicious. \n\nGreat addition to the neighborhood and the people who work there seem nice/down to earth. It'll be my new coffee place/afternoon pick-me-up. The caramels also would make a great SF gift (they were making them fresh when I came in!).", "author": "Semuteh F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-03", "description": "I am not really a caramel person, but had read an enticing review that made me want to go here. When I arrived, there was a large chunk of 3rd Nut on the sampling plate. I also ordered the Happy Ending. I ate 3rd Nut first and loved it. It was the perfect balance of salty and sweet. The Happy Ending was nice, but I couldn't taste the orange essence, and the white chocolate was a little too much w.choc. Next I tried the original, but I didn't like it as much as 3rd Nut. Then I tried the S'more, which had a great blend of flavors. I returned today to buy a gift for someone, and look forward to getting more for myself another day.", "author": "Eva UnTiger S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-10", "description": "Got there around 10AM and were lucky to have our first pick of the caramels. We got three: the Original Hooker Caramel, the 3\" Nut Caramel, and the Straight Boyfriend Caramel. We also bought a praline cookie. All were delicious, especially the 3\" Nut and the Straight Boyfriend...totally worth a stop of you're in SF!", "author": "Sneha K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-02", "description": "I tried their chocolate caramels today which were fantastic!! The atmosphere was really cozy, and I got many photos inside there. I'll be right pretty soon!", "author": "Joel Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-17", "description": "Of the dozens of bakeries, cupcake shops and ice cream parlors I visited in my week-long quest for diabetes on my vacation to San Francisco, Hooker's is one of the few that is a MUST visit.\n\nThis awesome little coffee/sweet shop is located in the heart of the dilapidated Tenderloin neighborhood. Along with Brenda's, it is one of the few reasons that make it completely worth the trek through this shady, homeless infested neighborhood.\n\nI don't know where to begin with how great this place is. Let's start with the most important part, the sweets.\n\nWe ate like it was our last meal ever, and not just the last day of our vacation, and ordered almost the entire menu. It was all well worth the accompanying sugar shakes:\n\n- Banana-Salted Caramel Bread Pudding ($5):\nThis is one of the greatest things I've ever eaten...ever. It is a very generously sized piece of sticky bread, dripping in salted caramel and bourbon sauces, and covered in delicious pecans, all served HOT. There is really no better taste possible.\n\n- Praline Caramel Bar ($3):\nThis bar was amazing. It was extremely moist and each bite had a delicious combination of chocolate and pecans in addition to the great taste of the praline base.\n\n- Peanut Butter Chocolate Chip Cookie: ($2):\nI know I say this too often, but this was really one of my favorite peanut butter cookies ever. The cookie itself had a really deep peanut buttery flavor, which went extremely well with the chocolate chips studded throughout. There were also whole peanuts baked into the cookie which added a nice salty crunch to the cookie.\n\n- Salted Caramel ($2):\nAnd finally, we also tried one of the salted caramels, which is what they are most known for. Keeping with the nut theme, instead of getting the original flavor, we tried the \"Third Nut\" caramel. This was very delicious as well and the chocolate combined with the many different nuts was a great taste once again. I wish I fully checked my shame at the door and ordered at least one of each of the other two types of caramels as well since they sound great (the original, with sea salt on top, and the espresso chocolate, with pistachios on top).\n\n- French Press Sightglass Coffee ($4):\nTo go with all of our sweets we also got some amazing coffee. I normally need at least some sweetener or milk on my coffee, but this was so good I didn't need to add anything. The flavor was so rich and it was nice and strong without being too bitter.\n\nTo add to the enjoyment of our sugar feast, the place itself has a very nice atmosphere. It feels like an old timey candy shoppe from the old west. In addition, the staff is super friendly and very helpful and nice to talk to. They engaged us in conversation, which was actually very pleasant, as opposed to some places where it can get pretty intrusive and makes you wish they would just leave you alone.\n\nThe friendliness of the staff just made the whole experience that much better. They also offer nice boxes of caramels to go. We loved it so much we bought a gift box of 10 caramels to go for $20.\n\nDo not be deterred by the neighborhood and make sure you stop by Hooker's, you will not be disappointed.", "author": "Mike C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-29", "description": "This place should be on your SF bucket list for all its heavenly caramel treats! We had the most perfect \"breakfast\" this morning with their Apple Cherry bread pudding (divine!) with 2 cappuccinos. Also got the 10-pc box of caramels as a gift to go. Highly recommend a visit here!!", "author": "Shilpa J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-27", "description": "How can $6 make me soooo happy?!?!?!? I've been wanting to come here for awhile, but every time I stopped by it was closed. I finally gone after I went to Turtle Tower. Okay, so it cost about the same as my bowl of pho at Turtle Tower, but the dark chocolate salted caramel banana bread pudding is that good! I got one, to-go, but right when she gave it to me in the little box, I felt it was warm. Hot even. I had to open it right away to take a bite! It already looked so pretty I didn't want to disturb it. I never thought bread pudding can have so much sauce to it. Warm, creamy, delicious caramel sauce! It keeps the bread from being too dry, but surprisingly the bread doesn't absorb it all and make it too sweet. She even added pecans over it. I don't even like pecans, but now I have an exception!\n\nThe bread pudding itself is very cake-like soft, but not too soft. It's chewy, and there might be a hint of rum possibly (?) cause it has that very small rum flavor that tastes great with bread pudding. There's also some hints of dark chocolate, but it's not very heavy. If anything, it added a bit of bitterness to the pudding, but it balanced the caramel very well. Surprisingly, after you eat it, although it looks really heavy, doesn't feel very heavy. Like you don't need water right away because it's so overwhelmingly sweet. Very impressed. It's $6, but if you like sweets and cake and salted caramel, then it's almost a steal. Either way, I can't get enough of it and now I keep thinking about it!!!", "author": "Jessica C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-10", "description": "I noticed all the amazing reviews for this place on yelp and decided to stop by after a late lunch at nearby Lahore Karahi. Unfortunately, they were already closed :( \n\nHowever, a really sweet man let us purchase a box and a bag of their caramels. I tried a caramel that had pretzel sticks and chex on the top, a generous layer of caramel, and a dark chocolate layer on the bottom. I was pretty much BLOWN AWAY as soon as I took a bite! It tasted so so good and was really the perfect combination of sweet, salty, and rich. The pretzel and chex added a bonus crunch factor, which I really enjoyed. I'm planning on gifting a box to a friend who really loves caramels, and I'm positive she will go crazy for these. \n\nThe shop is located in tenderloin, which might deter some, but these caramels are really worth it!", "author": "Fatima K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-21", "description": "I was hooked with the first bite of a 3rd Nut Caramel. Their caramels are so good that I have not come across one person who has not liked them. They are definitely a small shop but that is a good thing in my opinion since it allows you to see their complete operation.\n\nAs long as they are open I will be go to them to satisfy my cravings for high quality caramels. Plus, you gotta love the names they give their treats.", "author": "Ray S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-15", "description": "Elite caramel makers and a sweet coffee shop/dessert bar..... Pun intended. Also, try the bread pudding.", "author": "Ben Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-09", "description": "Breath of fresh air for the Tenderloin.\nAdmirably cute, interesting, one of a kind candy/ coffee shop.\nEasy to park and neighborhood vibe was good and safe as the police station is close by.\n\nWait staff was helpful to explain chocolates and caramels.\nEasy place to buy a nice quick prepacked gift that is unique and tasty.\nPrices are high... which is in alignment with the experience and uniqueness.\n\nEveryone should get a Hooker (gift).\nHighly recommend the salted caramel.\nNot so much a fan of the other treats since I am not a chocoholic.\nVery strong coffee will wake the dead.\n\nWorth a stop if you are in the Theater District or out Union Square.\nThey might have started a trend to establish The Tendo as the ultra hip place to eat.", "author": "Janis C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-22", "description": "Love love LOVE this place.  It's my go to for all my client gifts. Who doesn't love home made camels?!.", "author": "Anne L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-24", "description": "Wow. Never knew the taste of handmade chocolates could be so good!  Delicious. No going back to packaged chocs for sure. The neighborhood's a little dicey, but cute shop. Looks cozy and loved.", "author": "Sue W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-08", "description": "Whenever I come here, I always feel like it's Christmas... The smell of the baked goods just warms you up... Not even taking into account that they taste GREAT!!! Seriously... The cookies, the bars, the bread pudding, and even the savory cheddar cheese scone that i had were all DELICIOUS!!! I actually first heard about this place because they have great coffee apparently, which is 100% true. They use a French press and brew each cup individually and it tastes amazing! The staff is always the sweetest; the first time I came here, they offered their salted chocolate caramel on the house as it was the one \"that started it all.\" It tasted great and normally I don't like caramel. This place is seriously a jewel in the tenderloin. If you have a sweet tooth and haven't been here, you are missing out!", "author": "Kunal N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-29", "description": "Arrived about 15 minutes before the store closed and it looked like they were closed already. All the chairs were up on the tables and the door was only open just a crack. Still, I stuck my head in and was expecting to be told to go away, but the nice gentleman there just looked at me and said \"Hi\". I asked \"can I still get some caramels?\" and he was very nice and told me that I could still get caramels. Hubby and I came in and had a pleasant chat with the guy while deciding what to get. Ultimately we decided on getting the sampler box so we could try one of everything (the guy was a good salesman ;) All of the caramels were delicious and I would definitely go back and get more. Just like the name says, they are a treat!", "author": "Goldi J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-06-29", "description": "It has been MONTHS since I've been able to stop by Hooker's. I finally had the chance today and satiated my cravings.\n\nI took a friend with me because she had never even heard of bread pudding before. Now I got her addicted to it.\n\nThey only serve one flavor of bread pudding every time I've gone there and that hasn't changed. Today, they had Salted Caramel/Banana bread pudding. They also had a new chocolate piece in their display case so I got that for myself.\n\nThe new piece was an espresso caramel made with Ritual coffee, coated in dark chocolate, and topped with pistachios. Very delicious. I love that the caramels are soft to chew! Buttery, sweet, goodness. $2.50, I think. I don't remember.\n\nThe bread pudding was as delicious as I remember if not better. The bourbon caramel sauce is perfect. I wish they had put a little more on the plate just for my pleasure. $5. \n\nService is sweet and attentive. And cute.\n\nWONDERFUL place. Now that my friend's into it too, we're planning on going back again soon.", "author": "Sofia R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-11", "description": "I just discovered this place and now I am in love with it. In love with their caramels, the coffee and their maple pecan scone. \n\nAfter training for two hours most mornings, when I am done I am dying for some great coffee and light morning snacks. I have turned this into kind of a mission, attempting to try a new local (screew Starbucks and Peet's) coffee place every day I train. The problem is, now that I have discovered Hooker's it is much harder to justify going someplace else. \n\nThe first time went there, I got in just as they opened and you could smell the warm scones fresh out of the oven. The sweet smell of baked bread and maple permeated the air - I was in heaven. The small venue allowed me to unwind after a hard workout, sipping my coffee and mentally getting ready for the day. \n\nSince I am also a huge fan of caramel, I had to get a few for later that day, but I wasn't expecting much. I have gotten used to caramel just not being that good, since I grew up with my dad making caramel, perfecting his recipe over the years, such that I now don't care for any place that can't make an equally good product. To my surprise, Hooker's is as good as my father's, lovingly crafted caramel. Mind blow.\n\nDo yourself a favor and go here on your next morning coffee break and start your day off right. Also pick up some caramels for later, you won't regret it.", "author": "scott h."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-19", "description": "Caramel cashew cookie nut bar...oh em gee. Stopped in here with a friend to pick up treats for another friend ( he begged her to go to Hooker's Sweet Treats as soon as he found out she was visiting San Fran from NY). She bought a 10 box of a couple kinds of caramel. We tried a sample and it was delish. I'm not really a caramel person and had no intention of buying any. Then...I spied a tray of caramel cashew cookie bars on the counter and had to have one. So. Damn. Good. I was breaking off corners and nibbling on it all day. Now I wish I bought a lil something to go. They're closed on Sunday & Monday so no more caramel goodness for me before my flight out of town. But you lucky SF bastards should get some hooker treats in your life", "author": "Fatimah M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-24", "description": "All I can say about this place is get there early or you are going to miss out. \nThe gent who owns this little spot makes everything that morning on-site... at least from what I remember.\n\nI admire that this is one of the few places I know of that serves espresso alongside a small cup of sparkling water (palate cleanser). \n\nA sweet cheddar biscuit paired with an Americano, ended with a salted caramel are my favorite round of treats. \n\nThis place is small and has a homestead kinda feel. I like to sit by the window or on the wood bench outside and just \"people watch\" while sipping my Americano or espresso. :)\n\n This is always a treat when back in San Francisco", "author": "Sierra L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-19", "description": "The bread pudding covered with melted caramel and walnuts is top notch.  This along with fresh coffee will make any day sweet. It's a cozy place and you can definitely relax and enjoy your bread pudding . They also have other caramel treats. Definitely a new type of San Francisco experience. Will return for sure!", "author": "Nixon L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-06", "description": "Found out about Hooker's through our brokers who are obsessed with their caramels.  I ordered 8 assorted boxes of the ten-piece (at $20 each).  Totally worth it.  I've never had anything like it before.  Every bite was a piece of caramel heaven and you don't want it to ever end.  So far I've had the Straight BF Caramel (white chocolate) and the 3rd Nut Caramel - both of which are absolutely fantastic.  I want more!!!  Seven of the 8 boxes were sent out as gifts (note the packaging is pretty cool too).  Shout out to David who was so accommodating with my order request.  Thank you!  I hope to come by the store one of these days to try out their other treats.", "author": "Merlyn A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-13", "description": "I work at a bank and their website is blocked. With a name like Hooker's, it figures right?\n\nMy coworker and I braved our way through the TL on Hyde Street (always full of character if you know what I mean) and made it to this yummy shop.\n\nThe caramels are so good! Not too sweet but so flavorful. The cookie was also amazing. They even gave me a free caramel for my bday. How sweet is that?", "author": "Betty C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-25", "description": "Is it too early for Hooker's?\n\nI received a box of the salted caramels as a gift in the AM and usually I don't like eating sweet sweets for my first meal.  Once I opened the box, I knew I couldn't resist to try one.  The saltiness from the sea salt made my mouth water but the sweetness from the caramel made me slurp everything back up.  \n\nI might not be single but it's never too early, or too late, for some Hooker's.", "author": "Linda N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-21", "description": "As good as it gets. Seriously good coffee, espresso or French press coffee.Salted caramels... I have no words for quality here. Outstanding.", "author": "Monica S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-21", "description": "I love ordering Hooker's original smoke sea salted caramels as gifts for friends.  If you want to find a delicious local caramel made in small batches, definitely check out Hooker's Sweet Treats!  If you want to order for the holidays make sure to place your order online or for pick up, by the middle of December.  They will sell out the week before Christmas!", "author": "Wendy S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-27", "description": "I have never in my life been a fan of caramel - prior to my first visit here, I could safely say that I hated it. Hooker's caramel, on the other hand, is absolutely otherworldly. I have been transformed from someone who would rather eat anything else, to a raving madwoman who would trek through the Tenderloin just to buy one square of their chocolate-sea-salt-caramel concoction of joy.\n\nAs if that weren't enough to convince you to go, they serve sightglass coffee and are quite friendly.", "author": "Alyssa W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-19", "description": "Hooker's caramels are organic, handmade in small batches on site, and hand dipped. The caramels (3 kinds) are $2 a piece. They also had cookies, bread pudding, sweet cheddar biscuits (sold out), caramel bars and Sightglass Coffee. The bread pudding actually has their caramels in it so it sounds worth trying.\n\n* Original Hooker's caramel: A soft, chewy, buttery caramel square surrounded by thin coating of dark chocolate sprinkled with smoked sea salt. It was a little too salty but the salt helps cut into the sweetness of the caramel. It was softer, fresher and saltier than See's. \n* Latte: They don't have nonfat milk (boo) but you can choose between whole milk from Straus or soy milk. The latte was thick and lukewarm; a disappointing execution for good beans. \n\nThe shop has old fashioned charm with an open kitchen, one big communal table, a wood cabinet and old b/w pictures. The neighborhood isn't pleasant though (try not to walk around too much). You can get their caramels at Bi-Rite, Rare Device, and Sightglass.\n\nIt's not cash only and they have a frequent buyer program. Use the same credit card and they'll keep track of it for you (I'm not sure what you can earn and when).", "author": "Lolia S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-02", "description": "With this place being so close to me, I guess i really should go more often. This is not a place to go when you are on a diet. It is a place you to to reward yourself or someone you love. \n\nI had never really liked or tried bread pudding before. After I was called out for that, I decided to go ahead and finally give it a try for real. This was the best place in the world to do so! They use melted salted caramel and i could not be happier. I wish i had a straw to drink it up. It is soo good! I always get it to go, but the location is really cute. \n\nThey are open earlier during the day so its always good to make sure to go right after brunch if you want to top of a great morning!", "author": "Ashley H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-21", "description": "Hooker's is awesome.  Everything I tried was excellent.  The bread pudding was outstanding--perfect consistency, perfect sweetness, and the caramel sauce is lick the bowl delicious.  I would like to go and try a different bread pudding every day if I could.  The other treats are also great.  The caramel bar was delectable as was the peanut butter and chocolate cookie.  The caramels themselves were good as well--some better than others.  I'd suggest simply trying the original ones as they are a good riff on traditional chocolate covered caramels.  \n\nMoreover, the staff is friendly and pleasant.  I love this place.", "author": "Julie M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-28", "description": "People who say the caramels are expensive need to be slapped. Its a quality, artisan product that needs to be sold at a profit to sustain business. \n\nAll the caramels are great. I like the Original Hooker the best.\n\nTheir  bread pudding is the my favorite of all time! I'm a HUGE bread pudding fan and its my favorite thing there. The flavor can change up but the texture/caramel stays constant. I can't stress enough how awesome it is. \n\nI don't love their other pastries (sweet cheddar biscuit, cookie) but I don't care. \n\nI don't love Sightglass coffee but its the best quality coffee in the immediate area. \n\nDecor is charming. Service has always been pleasant. An absolute gem of a cafe in our part of the TL", "author": "Monsieur_Meursault _."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-09", "description": "This is my favorite place. The coffee is good, caramels are awesome, service is great! I go every chance I get!", "author": "Crystal L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-25", "description": "A hidden gem in the tenderloin, these guys not only perfect caramels, but they're willing to go out of the box. Pun may be intended.\n\nI've only been there once (boo!) and needed to go before I left the city. I grabbed several different kinds of caramels including their original and \"the straight boyfriend\". I also tried some other pastries that they had for the day and they were also amazing. I couldn't get through the day without eating all of them. I almost made another trip to get more (I am a fatty bo batty sometimes) but they close early on a Sunday and are not back open until Tuesday. My brief addiction subsided by then.\n\n The prices were not bad for my splurge ($13), can get more for your money than going to Mr. Holmes bakery.", "author": "Samantha E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-14", "description": "This is truly a hidden gem in the TL. Just FYI- it does close at 2pm on Fridays. I bought a 10 piece sampler box to take to work and it was a hit. The 3rd nut and original caramels were super delicious- but really all of them were amazing. Probably the best caramels that I have ever had. I can't wait to go back for more and try the bread pudding.", "author": "Reena P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-06-15", "description": "Date & Time:  Tuesday June 15, 2010 @ 11:30am\nCompanion:  The Husband\nScene:  Foodies\nVibe:  Quaint  \nDecor:  Charming & Cozy.  Circa 1880's.  Antique Mirror & WallPaper.   Blue & Brown Color Palette.  Pew Seating & Upholstered Chairs.\nService:  Nice Warm Couple\nImbibe:  SightGlass Coffee\nDevour:  2 Boxes of Salted Caramel & Bread Pudding\nTotal:  $21.50\nNote:  My Top Pick", "author": "Genevieve Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-19", "description": "So good.  This is the coolest sweet shop.  It's a great addition to the neighborhood.  Favorites are the salted caramels and the bread pudding.\nHOWEVER: PLEASE, PLEASE expand your hours.  Would love to be able to hang out here in the early evening.  Something like this could really turn around the area.", "author": "Ric S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-09-23", "description": "(See pic) Review #1251. What's a sugar breakfast with an excellent Sightglass iced Americano? Hooker's Sweet Treats!\n\nIt's in a white and blue setting, one big communal table, super sweet service, all on Hyde Street that can easily be missed. It's a few blocks farther from the tourist centric area so it's more for locals.\n\nThe stonefruit (apricot, peach and ) bread pudding was excellent as the fruits were seasonal with the happy sweet caramel.\n\nThe flourless chocolate brownie was very light on the weight but rich in the middle. The chocolate middle was so nicely chewy.\n\nThe only savory item here is sweet cheddar scone that was also very fresh and sweet and savory at the same time.\n\nThe Sightglass iced Americano was a perfect drink for a hot afternoon with all the sugary happiness.\n\nOf course you don't want to miss out all the chocolate sweets. The espresso, caramel and the square that has the espresso in the middle were all so very rich.", "author": "T L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-07", "description": "Items Selected:\nBig Easy Bread Pudding with Raisins, Pecans, and Melted Caramel\nPeanut Butter Chocolate Chip Cookie with Melted Caramel\nCaramel Bar with Cashew, Dark Chocolate, Smoked Sea Salt, and Buttered Caramel\nSweet Cheddar Scone\n\nLocated just a few blocks from my hotel and garnering praise for their dark chocolate caramels since 2010 it was largely for airplane snacks that I visited David \"Hooker\" Williams' small store before flying out on Tuesday afternoon and as much as the trio of bagged items would trump anything at SFO or LAS it was what I ordered in house that instantly placed Hooker's Sweet Treats on my rather short Bay Area \"must return\" list along with Knead, Humphry Slocombe, b.patisserie, and Saison.  Small in size and surprisingly hip in feel despite the Tenderloin locale a visit to Hooker's will likely entail a short walk amidst some of the area's most unfortunate yet once inside the cozy confines a more pleasant scene unfolds with wood and hues of blue strewn in NOLA-themed décor while notes of vanilla, cinnamon, and sugar permeate the air.  By all definitions an artisan operation with Williams working both counter and kitchen it was with friendly smiles that questions were answered and taking a seat at the windowside bar it would not be long before my order arrived, the caramel still bubbling as it dripped down the side of a golden mini-loaf into a fancy shallow bowl.  Generally preferring this style of pudding to more free-form versions served via slice or scoop the beauty of Hooker's Big Easy begins in the bread - a golden eggy thing with soft custard beneath crunchy top - and spruced up with raisins along with candied pecans for taste plus texture the dish is brought to new heights in the salty buttered caramel, a flavor surprisingly not too sweet but instead 'just right' in allowing cinnamon notes to shine for an almost savory finish...a flavor I'd later find equally present in all three takeaways, the smoky complexity of the cashew bar particularly satisfying when paired with coffee as I awaited yet another delayed plane.", "author": "Michael U."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-23", "description": "This place helped me discover a love for salted caramels I never knew I had. Each bar is absolutely delicious, and while it might seem like a single bar isn't worth $2 when you get it, once you take a bite in and realize one bar is really all you'll need, it's worth it. My favorite thus far is still the original salted caramel, but they have an awesome variety that is worth checking out. \n\nOn a related note: I don't recommend their coffee, just because it seems over priced for how little you get. I recognize that sight glass coffee doesn't come cheap, but it still seems like they are nailing you a bit on a small brewed coffee for $3.50 or above. Maybe it's just me.", "author": "Michael Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-22", "description": "Carmel gems so sweet to eat or gift. Double thumbs up treats.", "author": "Alexander T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-25", "description": "It's the best place to hideaway and get a great cup of coffee and caramel if you're dare to fall in love!", "author": "Melissa G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-05-21", "description": "I felt a bit awkward searching \"hookers\" on Yelp, as I was a bit unsure of what may pop up.  Luckily, Hooker's Sweet Treats is so popular that it was the first result.  Hooker's Sweet Treats is located in the Tenderloin area, and it's a hidden gem.  \n\nMy boyfriend and I planned to visit Hooker's after seeing it on a list of the 10 best bread puddings in S.F.  \nhttp://www.refinery29.com/best-bread-pudding-san-francisco/slideshow#slide-2\nWe visited on a Saturday afternoon around 12:30 p.m. and were warmly greeted by two men working.  They were very friendly and helpful in explaining the products that they offer and they made us feel at home.  We ordered the bread pudding, which happened to be banana-chocolate bread pudding that day (the guy said that it changes every few days).\n\nThe bread pudding ($5) is pre-made, but warmed up in the oven when ordered.  At the time of ordering, they also prepare the delicious caramel sauce.  It took about 5 minutes for the bread pudding to be brought to our table and it was well-worth the wait.  In the meantime, one of the guys brought us a bottle of water and two mason jars as well.  When the bread pudding arrived at our table, I'm sure both of our eyes lit up.  It was a fair-sized piece of bread pudding topped with pecans and drizzled/surrounded with a delicious, flavorful caramel sauce.  The bread pudding had a nice slight crispiness to some of the edges and was very moist on the inside.  The center of the bread pudding is filled with chocolate and a piece of caramel- a pleasant surprise that I wasn't expecting.  Overall, it was delicious.  If you like caramel, you will love this dish.\n\nThe bread pudding was plenty for my boyfriend and I to share- but another woman ordered one for herself- so it can be done.  The shop is not too big, but there was plenty of seating because it wasn't really too busy that afternoon.  It's cutely decorated and I hope to come back soon to try out their caramels.\n\nNotes:\n-They serve Sightglass coffee.", "author": "Samantha L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-11", "description": "Can we say delicious caramels that are slightly raunchy without being adult porn shop? I mean the sweetness is just perfect and the flavor concepts are borderline revolutionary. \n\nI trekked up from Berkeley to the Tenderloin and i was so not disappointed. The service was excellent and recommended a gift package within my budget. The brothers not lovers was exceptional and I nearly died of happiness after I stuffed the entire thing in my mouth. Do not that's what she said me. It's immature and middle schooley. \n\nIt has a cute antique vibe to it and I think I'll be back to sample more goodies and possibly some of that coffee!", "author": "Radhika P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-14", "description": "Droooooooool.  This is by far my favorite San Francisco spot for treats.  \n\nEvery time I head out of town to visit friends, I grab a gift box for them with a variety of caramels.  The funny thing is that I don't really like caramel, but I love Hookers.  The bread pudding is also to die for, but it's probably not that healthy to eat one by yourself. Definite worth a trip!", "author": "Y L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-11", "description": "CASH ONLY.  Walking up Hyde St I saw 2 guys get arrested by about 5-6 SF cops during the AM, I was heading to Hooker's Sweet Treats on Hyde @ O'Farrell.  It's a small place with a communal table and some chairs.  Order at the counter.\n\nI had a hard time deciding what to get because everything sounded good, just kinda pricey.\n\nI finally decided on the chocolate banana bread pudding $5 for a small rectangle.  It was made that morning.  He put it in a take-out container and then added some caramel sauce.  I was just going to take a few bites, but finished it.  It's GOOD!\n\nGot a 3pc box dark chocolate sea salt caramels $7.  Small, very salty, creamy & smooth caramel.\n\nSpiced iced coffee $2.5 sounded good, a guy recommended it to me.  They use Sightglass coffee.\n\nSome people after me asked for lattes which I didn't see on the menu - ask & you shall receive.  Not sure how much it cost.\n\nRecommended.", "author": "Ann L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-01", "description": "Literally the best caramel you will ever eat. Out of this world. One of my co-workers was gifted a box of these and neither of us knew what it was. We were blown away once we dived into the box. Seriously made my day. I couldn't stop talking about it!", "author": "Alice B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-28", "description": "OMG, I had to sit down when I ate this.\n\nA friend DRAGGED me here to try out one of the sea-salted caramels. And usually we have all had enough sweets to compare good and bad. The soft, sweet as well as salty chocolate covered melt in  your mouth caramel hit me so hard in the taste buds I actually had to sit down. \n\nIt made me weak in the knees. My favorite was a plain pistachio topped treat, but now I will be haunted by the taste that I now know is out there.", "author": "Jerry K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-28", "description": "I was never a caramel fan.  Most of them I tried were too sweet, too sticky, or too chewy.  But ever since I had my first piece of Hooker's at Sightglass coffee, I am hooked. Now this is my one and the only caramel place. I think it's really a payoff for using the simple and quality ingredients.\n\nBTY, the 3rd Nut is truly nut lover's heaven, and the Sea Salted Dark Chocolate is coffee's best friend.", "author": "Stacey C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-07", "description": "The coconut, carmel, macadamia nut cookie-square is easily the best cookie on earth.", "author": "A B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-11", "description": "During another work trip, I made it a point to get a Hooker for lunch while in the TL!  Har har har har. \n\nGo figure, Hookers is a CASH only business.  Har har har.  \nAll of my lame jokes aside, I loved the Salted Caramel that everyone speaks of is life changing!  I was fortunate to snag a few bites of my coworker's Chocolate Peanut Butter Bread Pudding, which was straight from Heaven! \n\nThe décor of the place takes you back to the days of the Wild Wild West.  The menu is simple and written on the chalkboard which is to the left when you walk into the establishment.\n\nNot a fan of the TL, but am definitely a fan of Hookers.  Guess I'll need to pack my bulletproof vest with me the next time I head to SF, just so I can get my hands on some Hookers.", "author": "kristine f."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-02-08", "description": "Definitely a problem in the making... \n\nReceived a box of these tasty treats for Christmas and didn't share any (had to ration them).  Brought a fellow candy lover in this afternoon to sample these delicious treats.  She loved the salted caramels as much as I do and bought a box to gift a cousin.  On the walk back to Union Square we joked that maybe her cousin would prefer a Starbucks gift card so she could keep the caramels for herself...see, Hooker's Sweet Treats are a problem in the making!", "author": "Kim A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-12-18", "description": "One star for the delicious caramels (and bread pudding).\n\nOne star for the great service I've received in the past (cute gift boxed candy for my wedding gift bags).\n\nMinus three stars for the recently imposed limit on how much candy they will sell you.\n\nI needed eight 3 piece gift boxes for the holidays. I was told I could only purchase three 3 piece boxes or one 10 piece box per visit. Um, ok. I asked if I could place an order and pick them up later in the week ( I realize it's all hand made and understand it's a busy season). I was told no, it's all first come first serve. Hmmmm...ok. \n\nThankfully there are plenty of awesome candy shops in San Francisco that were more than happy to take my money. \n\nI realize in hindsight I should have just ducked outside an sent a few of the 'loin locals in to buy my candy in shifts, oh well.", "author": "Hannah S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-08-10", "description": "I tried some Hooker's Sweet Treats the other day.  A few blocks over at a stand at the corner of Larkin, a pleasant young lady wearing a skin-tight leopard-print mini-skirt and five-inch-stilettos was also offering me some of her sweet treats.  Both preferred cash, but the lady was charging considerably more for her sweet treats that she refused to display only until after I agreed to purchase, so I went to Hooker's instead because they were much cheaper and I could see them making the treats I wanted to buy.\n\nHaving the insatiable sweet tooth that I do, I ordered everything on the menu on my first visit: a couple of dark chocolate covered caramels topped with sea salt, a sweet cheddar biscuit, a peanut butter chocolate chip cookie, and a raisin and pluot bread pudding topped off with warm caramel sauce.\n\nThe salted dark choco-covered caramels were delicious and hit almost all parts of the palate -- sweet, salty and bitter.  Haven't had a better peanut butter chocolate chip cookie in recent memory.  The raisin and pluot bread pudding, warmed up in their convection oven, and topped with warm caramel sauce was heavenly -- thick and dense yet still very moist with a crisp and dark golden-brown crust on top.  The sweet caramel sauce also had a very slight and subtle bourbon or whiskey kick to it.  I've had bread pudding from a number of places in SF and some pretty good ones in New Orleans as well, where it's more popular, but this was easily the best I've ever tasted.\n\nI went back the following weekends for some more bread pudding.  Once it was chocolate and pecan and the other, chocolate banana.  Not as amazing as the raisin and pluot, but still excellent.", "author": "Erich D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-27", "description": "The peanut butter cookies were soooo awesome! I was mad that I only got one. We also got the sampler caramels, but my favorite was the one with the pretzels. Definitely worth a trip if you're in the area.", "author": "Chrissy M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-10", "description": "Did someone say Hooker's? Why, yes please! Being Hooker virgins, my friend and I made our way out here after a mediocre lunch out at John's Grill, in search of some post-meal sweets, and showed up at this cozy little cafe in the middle of the TL, comfortably occupied by a variety of fellow patrons, deep in their studies, reading, or other cafe-ish preoccupations/\n\nWe settled upon some bread pudding, coffee, and a salted caramel to share. While the coffee and salted caramel were both okay, the bread pudding, of the coconut and pineapple variety, covered with a bourbon syrup, was amazingly tasty, and well-worth trying. And I don't even really like coconut!", "author": "Johnny W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-15", "description": "Wait, am I in the Mission?  Hooker's Sweet Treats smack in the middle in the Tenderloin, who would've thought?  Quite happy to discover this cute little place!  \n\nWe made it in just before closing on Sunday, and unfortunately they were sold out of a lot of items such as the bread pudding and iced coffee.  But the sweet cheddar biscuit was delicious and the Sightglass coffee well appreciated.\n\nI will be back soon enough to try the famed bread pudding and the salted caramels too.", "author": "Joanne G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-08-12", "description": "There are a lot of hidden gems within the Tenderloin, and Hooker's Sweet Treats is definitely one of them. \n\nMy friends and I visited on a Sunday morning around 11am and it was pretty quiet. Just a few patrons coming and going with their dogs in tow. Inside, there are some bar stools set up along the window and then a large communal table in the center. We love the laid back vibe - took pics with our phones and the photos look very vintage! \n\nWe ordered a little bit of everything on the menu...chai, a latte, coffee (I feel I'd get the coffee again because it arrived in its own French press and was good for about a 3-4 cup serving...delicious dark roast too!) - for eats, of course we got a couple of the salted caramels, a peanut butter chocolate cookie, a cheddar biscuit, and the bread pudding of the day which was coconut blueberry in a sweet bourbon syrup. Everything was sinfully rich and paired wonderfully with our drinks. \n\nDefinitely coming back again and again - I love Hookers!", "author": "Elaine W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-05-22", "description": "Strawberry bread pudding and a soy spicy chai.\n\nThat's all you need to know here.\n\nThe strawberry bread pudding will dance in your mouth with such rich decadent flavor - that you won't be able to put down your fork.\n\nNot even for a second.\n\nAnd the soy spicy chai's frothy crown will cushion that pudding in pure Hooker's Sweet Treats elegance.\n\nTrust.", "author": "Jessica T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-23", "description": "Hooker's Sweet Treats? Where did they come up with this name? Vulgar jokes from the interesting names aside, the cafe is located in the not so pretty side of town. \n\n== Food ==\n\nSalted caramel. This is where all the action is at! There's currently six unique flavors with interesting names attached also. The original is amazing! Highly recommended if you're here for traditional salted caramel. One bite of this and I was in heaven.\n\nCappuccino. They make a pretty good cappucino. The bitterness of the cappucino goes really well with the sweetness of the caramel.\n\n== Service ==\n\nService was awesome. Really friendly people.\n\n== Overall ==\n\nReally good stuff! Will definitely go back again even if I have to venture through the not so nice part of town.", "author": "Steven B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-14", "description": "my favorite spot in the TL. tiny. cute. and pretty much perfect.\n\nyou have to get a caramel.  if you just want the coffee, go to sight glass.", "author": "Casey L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-08", "description": "I've been here a few times while I do laundry across the street. Their chocolates are very sweet but great to snack on once in a while. Their names for their chocolates are hilarious. Try them out!", "author": "Miko L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-05-16", "description": "I am currently buzzing my ass off after my breakfast of outrageously sweet caramel, banana, pecan bread pudding washed down with a small pot of rocket fuel that is their french press coffee.   \n\nI can imagine the crash and withdrawals that I am going to endure this afternoon thanks to this morning's powerful fix.  They say you can never recreate that first high, but I plan on chasing that dragon again ...real soon.", "author": "Dru P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-13", "description": "It's great to see that there are more up and coming businesses choosing to make the Tenderloin their home. Hooker's is a great coffee shop that servers hand crafted drinks using Sightglass roasted beans. It's nice to see that they are using a local roaster and not trying to cut corners by using one of the big roasters. \n\nI was lucky enough to try one of their cheddar biscuits with my coffee. The biscuit was flakey and had a nice spicy kick to it. It was extremely well with my latte. Since I went with the biscuit, I did not get to try one of their famous caramels. I will definitely try one of those next visit. \n\nThanks for the great cup of coffee Hooker's", "author": "Michael C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-25", "description": "I read review regarding Hooker's bread pudding and stopped by to get bread pudding to go. This treat is delicious and tastes like a thousand calories. Hooker's bread pudding is an amazing treat to give yourself once in awhile or you will weigh 400 pounds in no time. The owner is lovely and welcoming. I cannot wait until I have more time to sit down and enjoy my next bread pudding with a coffee and talk to the owner.", "author": "Sheila T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-23", "description": "When in SF DO NOT MISS THIS PLACE!!!!\n\nYour life will be incomplete if you don't try any of their salted caramels", "author": "David S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-07", "description": "We always get these caramels for special occasions and birthdays. Make sure to eat them within a couple of days of purchase. They don't keep well. Though it's hard for them to last more than a day in our household :D", "author": "Jen H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-01", "description": "Until recently, I never really understood the draw of salted caramel. These, however, are excellent. Not too soft or too chewy, the right amount of chocolate coating, and not too much salt either. Just enough to pop.\n\nAnd putting these most excellent salted caramels in baked goods? Mind = blown.", "author": "Amanda S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-25", "description": "Can we just wipe the drool for a moment...\n\nTheir caramels are so delightful and unique!  Come for a treat or enjoy a cup of delicious coffee.  Seating is limited, but I haven't been here when it was crowded.", "author": "Casie M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-10", "description": "Im in love with Hookers. \n\nSweet sweet devil sweets!\n\nI'm not big on candy, but I love love love some salted caramels, and Hooker's does caramels right.  These little babies are incredibly addicting but so worth the extra brushing you'll have to do on your chompers.  And if you feel like something a little less candy a little more hearty, indulge in their freshly baked goods (ahem, the bread pudding is to kill for, as in i would KILL YOU for it) while sipping on your latte or cappuccino.  \n\nDont be initimated by this area/neighborhood.  The TL gets such a bad rap, but its not nearly as bad as everyone makes it out to be.  And trust me, for these treats, you wont even care where you are.  Everything is good.  EVERYTHING.  I am never disappointed in this little shop of heaven.", "author": "Juv C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-09", "description": "Location isn't super-convenient, but inside is cozy, service is great and the quality is off-the-chart.  Had their banana bread pudding with berries, which was soaked through with sauce.  Decadent.  French press coffee and a walnut maple scone.  Loved the decor as well.", "author": "Richie T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-24", "description": "If sex was a food it would be Hooker's Chocolate covered caramel. I think I went to heaven when I took my first bite of one.", "author": "Julianna I."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-27", "description": "Thank you for this gem. \n\nGreat everything, great attitude, great decor. \n\nBread Pudding? Cheddar Biscuits? Salted Caramels? SightGlass Coffee?\n\nEverything on the menu is amazing. \n\nHook and Matt are super nice people.\n\nKeep killing it Hookers.", "author": "Carson L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-25", "description": "I was early for an appointment in the city so I figured I'd yelp a near by coffee shop. \n\nBeing in San Francisco, there are a million coffee shops in walking distance, but the name Hooker's Sweet Treats caught my eye (I have a sweet tooth!). The pictures from other yelpers definitely sealed the deal that I would be trying out this establishment. \n\nI bought one of their Lemon-Blueberry Bread Puddings. I ordered it to go since the location is little and all the tables were taken and figured I just go back and eat it in my car.... it didn't make it to the car. I busted that thing opened as soon as I was out the door and devoured the warm gooey DELICIOUS bread pudding. Three blocks later, I have no yummy picture to share with you all but I definitely recommend if you are near Hooker's Sweet Treats go in and get a bread pudding!", "author": "Jasmine M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-24", "description": "Yum, yum, and yum! The little coffee pastry shop is a little slice of heaven in the Tendernob. Swept from some French country town, for sure, this place boasts some of the best hand made caramels, delicious coffee, and quaint ambiance that will make all your worries melt away. \n\nWhile they have different deserts to choose from, I always go for the classic - salted caramels. With a cup of cappuccino done just right it is a treat that makes me smile with every bite (and chew) I take. Heaven.", "author": "Yelena K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-09-14", "description": "Whenever I am feeling under the weather I cheer myself up with something sweet and sinful- and no over the counter candy bar will suffice! I was at Civic Center Bart this morning and used the yelp app on my Droid to get the address and cross streets for Hooker's Sweet Treats in the TL. After finding out it was 0.4 miles away I paused wondering if it was worth the walk the way I was feeling. Well I had Madison with me and she needed her morning walk so I figured what the heck, it's at least down hill on the return trip. \n\n@10 minutes later I arrived in front of Hooker's. The only thing out front that differentiates it from any of the other poorly maintained buildings was the clean wooden bench for customers to sit on. In other words you'll want to know the address before you attempt locating it.\n\nThere was a cute young hipster couple in front of me who ordered french press coffee and carmels, other than that I was lucky to have the place to myself while I tried to choose between the offerecd sweets. I finally decided on a mocha (with soy of course my LA friends) and a sea salted carmel square. Because I love sight glass coffee I already knew the mocha would be perfect, not too sweet, but sweet enough you don't need to add anything to it. An impressive job of steaming the milk to the perfect temp, stopping just before it would scald your tongue but still having enough heat you know it won't be cold the last few sips.\n\nThe carmel was heavenly. About a perfect square inch and a half inch thick it was dipped in chocolate and sprinkled in sea salt. It was the most delicious carmel I 've had in SF, even the texture was perfect. And the way it complimented my mocha.. ahhhh!! I reccomend that you buy two because one is absolutely not enough. At $2 each that may seem expensive but it is worth every penny. I had to walk a block back because I made the mistake of only buying one! Bring $10 with you and I promise you heaven and perfect satisfaction. The barrista will be happy as well because that leaves him $1.50 change for a tip!", "author": "Lisa H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-05-22", "description": "If you are in the area and craving something sweet or coffee you can't beat this place!  The salted chocolate caramel is amazing!  The guys working are always friendly and cool!  Even provided a doggie treat and bowl of water for our old dog this last visit!  Spread the word so this treasure place sticks around!  \nThey also do cool little gift boxes for those you/we deem worthy to share this bit of deliciousness with!\nHooked on Hookers!", "author": "Sean M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-03-07", "description": "Excellent caramels, rude staff. Considering their location, there are far better places to spend your time.", "author": "Ren R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-09-21", "description": "I have to give them 5 stars. The sea salt caramel is just that awesome and so is their spicy chai. The 2 guys behind the counter were super friendly and chatted with me about my weekend plans, the Folsom street extravaganza and let me try a piece of the caramel they were making. \n\nI had bookmarked Hooker's back when my manfriend lived close by. I never got a chance to check it out, forgot about it and today I knew I would be in the neighborhood and searched for it again. \n\nDo you know how awkward it is searching for \"hooker\" on Yelp while in the T-loin? Especially when there are legitimate hookers around the corner... however I don't think they are on Yelp...\n\nThey have other items (like bread pudding) that I will definitely come back to try.", "author": "Sara P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-26", "description": "This rating is based solely off of their bread pudding. I've been approx three times, all for the same sticky sweet dessert. It is much sweeter than most bread pudding, mainly because of the sauce that is drenched over it as it is served. Very rich. One serving is enough for two to share just from sugar overload. \n\nStill waiting for a chance to go back for the caramel. The guys inside are always very friendly. Feels a bit mom and pop.", "author": "A K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-13", "description": "We showed up as they were closing but they were still kind enough to sell us a few treats. My favorite was the cashew-caramel-shortbread cookie. I'd make a point of going back here. It's legendary for good reason.", "author": "Laura H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-18", "description": "Tried the pineapple/blueberry/coconut bread pudding. It was swimming in  caramel sauce. The first bite was overwhelmingly sweet, but if you get enough bread pudding and just drizzle a bit of sauce on to, it's perfect. I love the quirky name and the atmosphere.", "author": "Alice W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-23", "description": "Great coffee and incredibly delicious treats! Laid back, New Orleans feel with great service and a friendly owner.", "author": "Amanda T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-26", "description": "Hooker's, Hooker's, Hooker's...\n\nHubs and I went to Hooker's right when it opened on Saturday before starting our food expedition around SF.  The place is super cute inside and the staff are very friendly.  We got the 10 piece box with 8 original salted caramels and 2 of the new salted caramel w nuts atop dark chocolate.  We sat on the cute bench outside of the store and ate one of each.  Personally, I thought the caramel part was too soft.  I prefer it to be a tiny bit harder.  Regardless, the delicious morsels had us wanting more.  But no, we had to restrain ourselves because we knew that there were so many other food places we had to go to that day.  It had the perfect amount of saltiness and the dark chocolate covering them were mm mmm good!!  Only bad thing is that they're $2/piece!  I would still go back if I was in the area so I guess that says something.", "author": "Lanna K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-29", "description": "Lovely staff! Expertly prepared coffee. Delicious treats. \nI'm glad these guys are in my neighborhood. A beacon of light, in the heart of the TL.", "author": "Lalo H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-04", "description": "After reading about the salted caramels here I had to take a long break from work to treat myself to some of Hooker's Sweet Treats.  You can buy them singly at around $2 a caramel so it's a rare treat but it is so worth it.  Quality salt and nice soft chewy caramel.  Worth every penny.\n\nI also wanted to try their cookies but it seems they often run out in the afternoon.  So call ahead if you want a sweet treat after lunch.", "author": "Jean K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-07-08", "description": "why so much for a caramel? No caramel on the planet is worth 5-6 dollars.\n\nAlso, I got yelled at for sitting on that bench outside.\n\nI wonder how this got \"best of the bay\". it really is shocking to me.", "author": "Stevie D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-02", "description": "If my mother lived close enough I would walk to her house, ring the bell and slap the hell out of her. These treats are incredible!!!! I was gifted with the smore caramels for my birthday this week, I dont want to talk about how quickly I ate them all. Totally worth crashing from a sugar high. I'm told these are ideal for special occasions, if thats the case, everyday is a celebration.", "author": "P F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-18", "description": "After being dissapointed by a few of the coffee shops that had high yelp ratings in the neighborhood, I finally found a gem. The best Americano I ever had and the cheddar scone was very good too, thank goodness I can leave San Fran on a great note!!! Ty I'm a happy hooker", "author": "Sook K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-15", "description": "Bread pudding --- amazing! Though should probably share with someone\n\nHot chocolate --- pure and delicious\n\nSea salt caramels --- got the box of three....HEAVEN! The one with nuts was especially great.\n\nGreat little place, and the owner was so hospitable! \n\nWorth the trip over", "author": "Linda H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-03-14", "description": "Coco brown hookers are my new found addiction.  \"Hey baby, what's it gonna be?\", they ask me.  I wave my Jacksons and point to everything.  \"Ok honey, daddy wants the Tenderloin special...line up girls.\"  She winks and says, \"Sugah, you're in for sumthin' sweet!\"\n\n\"Honeydosugachocolate dumplin' yeah Sista with a certain sumthin' sumthin' Flavor with a cocoa kinda flow Baby, baby act like you know\" (Musze 1996)\n\nI received a couple boxes as a gift from San Bruno yelper, Kim A.  OMG!  This sh*t is crack!  I'm a huge fan of salted caramels and these delectable treats are amazeballs!  Substantial, gooey and generously salted.  The hardest part is pacing yourself and not indulging in more than one at a time.  Another new found addiction.", "author": "Kalani C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-04", "description": "What a find! Tucked in the Tenderloin, who knew that this neighborhood was hiding something sweet. Love it!", "author": "Hans D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-09-19", "description": "My friend gave a glowing recommendation, so I made the trip to Hooker's and was overjoyed with the atmosphere, latte, and treats!  It was the perfect start to my Sunday morning.\n\nTo drink, I ordered a double-shot latte.  The latte was delicious and paired perfectly with the caramel-covered praline and peanut-butter chocolate cookie.  The caramel used is the perfect blend of sweet and buttery, and it just melted in my mouth as I enjoyed the blend of flavors.  The peanut-butter chocolate cookie was a delicious surprise.  The consistency of the peanut-butter leads me to believe it was homemade, and the final product was a super-tasty cookie.  \n\nThe atmosphere is pleasant and well-decorated.  The best I can describe the decor is masculine and western.  Every decoration is carefully considered and placed.  Also, the owner (Hooker) and assistant (Matt) engage with the customers in conversation and lend to a personable, fun experience.\n\nI will be recommending Hooker's to all of my friends, and as soon as you try Hooker's, I know you will be doing the same.", "author": "Justin D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-30", "description": "I actually rarely eat sweets but their salted caramel is just insane!!  Seriously.. Gotta try it.", "author": "Ken J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-12-01", "description": "I had the carmel and coconut bar with a friend of mine and a peppermint mocha. MMM MMM So delicious. They used organic milk which is always cool with me. \n\nThe shop is very small with limited seating and a cute little bar with stools right against the window. The service was really nice and the treats live up to the name. Actually, the guys are cuties that work there so you get some eye treats also. \n\nI'll need to go back to review the other treats they have available. Further investigation needed (wink wink). \n\nGo there. You'll love it.", "author": "Cia G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-28", "description": "Tried this place out because we saw it featured on UNIQUE SWEETS- sooo good! I always thought maybe the show exaggerated how good the goodies are- yeah, no- they're even better than we expected!!", "author": "Chris G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-12-18", "description": "I was gifted a box of Hooker's Sweet Treats caramels this week & wanted to scream (from a mountain top) every yelp hyperbole I swear I'd never use...best I've ever had! Changed my life forever! FOREVER! Touched my heart, soul & tastebuds in a way no food ever has! Ah-may-zing! Nothing compares!\n\nThe sad thing is, none of those are really exaggerations. The stuff was so good that I dragged my BFF there today to get my fix again. $2 each, we got a mix of dark chocolate salted caramels & nutty caramels w/ a thin, chocolate coating on the bottom (I *just* love surprises!) So super buttery. And the best part is that the chocolate outside isn't a hard, separate shell...it's as soft as the caramel & when you bite down, it's one cohesive flavor combo & texture. Good ingredients all around. \n\nWhoever thought to combine chocolate & caramel & sea salt deserves a kiss (with tongue!) \n\nThe Hyde Street coffee & confection shop is adorable (blues & browns, my favorite!) We sat & had ceramic cups of Sightglass coffee (which we didn't fancy; BFF & I are hardcore Philz advocates.) I'll be back for them caramels. They make good gifts, if they last long enough to get to their rightful recipients (odds of that happening: unlikely. I'm keepin' them for myself!)", "author": "Fancypants X."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-02-09", "description": "I don't generally write Yelp reviews, but I felt compelled after reading Clace F.'s review on 2/8/12, as I am the lethargic customer mentioned in the review.  This false account of the service doesn't sit right with me.  \n\nBeing a regular, I often come in lethargic (who isn't in the morning?) and sit down without a word, and the owner, David, knows what I want.  That being said, the reality of what happened:\n\nI walked in, sat down, received eye contact from the owner, and proceeded to sit quietly and wait for my coffee as I do most mornings.  You, dear reviewer, were already there and waiting for your bread pudding.  A few minutes later a gentleman walked in and up to the counter to order, to which the owner told him there was another customer before him (I believe he was referring to both of us actually).  He explained the coffee was made to order and the French press would take some time.  I took the situation as the owner just letting the man know it would be more than a minute to get his coffee, as he looked in a hurry.  The man obviously was and left.\n\nAs for regulars laughing, you are again mistaken.  The owner commented to us that good coffee takes time after the man left.  There was no laughter.  The comment wasn't a joke.   We agreed.  Noticing a man doesn't have time to wait isn't a comment on him, but mere fact.  There are mornings when I am in a hurry and do not have time to wait.  I would appreciate a business owner warning me of a wait.  It means he is paying attention to the fact that I am rushed.  \n\nGlad that's cleared up.  Now I can get back to work and school, so I can wake up tomorrow lethargic and know there is great coffee (and bread pudding) right across the street.\n\n--Lethargic (and satisfied) regular", "author": "Christine T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-11", "description": "Best Caramel treats! Every single one is amazing. I recommend buying them all! Top if of with a cashew bar:)", "author": "Cristi B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-08-16", "description": "I came here because my dad's middle name is Hooker (no jokes please, it dates back to the civil war) and wanted to buy him a San Francisco treat.  My father, Joseph Hooker Killingbeck, IV, (no relation to the shop) a chocolate connoisseur, took one bite of the dark chocolate salted caramel and I quote; \"This was the best I've ever had\".  \n\nI agree.", "author": "Alex T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-01", "description": "After some very boring time filing court documents I thought I would treat myself. Ron said we needed to visit a hooker. At first I was leery until he led me in here.\n\nHo-ho...funny man. I must admit this place has a really great name!\n\nBread pudding and a nice french press cup of coffee turned my day from rather blah to Hell-yeah in the time it took for me to enjoy it. The ambiance is decent and the service was polite but rather ho-hum. However the delights they serve easily push this to a solid 4+ on the ole rating scale.\n\nI will be back to sample more of what they are selling because the first and last bite of that pudding was so damn good.", "author": "Nick B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-13", "description": "Don't leave hookers without trying the bread pudding and Carmel bite", "author": "Mel S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-28", "description": "Definitely a diamond in the TL. I love this place. A little hidden, but this place makes delicious treats and very fresh french pressed coffee. I've had a variety of their snacks, and the salted caramels are the way to go (nut and chocolate). The coffee is delicious, and and the place has done a great job creating a very nice ambiance where you can sit and enjoy your treats. \n\nI've been here twice in the past two weeks, and the service has always been great. Although they cook everything at the spot, it doesn't smell super buttery which is a bit odd. With the name and location, it's always funny when you are searching for this place and what else pops up. Can't wait to go back!", "author": "Laura H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-02", "description": "The best of the best! After two years of going to this café, it is still a pleasant experience to have their pastry and coffee. The people are friendly, the service is great, and the pastries to die for!", "author": "Khashayar F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-02-10", "description": "A local treasure filled with yummy goodness, great coffee, and wonderful service. I finally had to write a review on yelp, and decided that Hooker's Sweet Treats deserved my first review!! By the way, their bread pudding is to die for and should be shared with someone special!!\nThanks Hooker's and see you soon!", "author": "Naomi C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-03-27", "description": "Caramels were on the chewy chewy side, no complaints here. Iced Americanos are a-ok too. I paid $10 for two caramels and two iced americanos.", "author": "Josie C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-11-08", "description": "I am HOOKED on Hooker's Sweet Treats!!!\n\nWhen I first heard of this place, I was pretty pervy minded. Until a friend dragged me over here did I finally understand what she was talking about. \n\nHere's what's up: \n*  Dark Chocolate-covered Caramels with sea salt\n*  Sweet Cheddar Biscuits\n*  Strawberry Bread Pudding. \n*  Spicy Chai Latte\n\nFriendly service, a local neighborhood business and this place satisfied my sweet tooth for the week. \n\nHooker's has a late 1800's antique feel to it and is almost like walking into a confectioner's store. \n\nLeave your plastic cards at home, this place deals with CASH ONLY.\n\nI think I am salivating for more again..", "author": "Jason C. J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-07-25", "description": "I'm addicted to hookers... wait... that sounds very wrong...\n\nAMAZING salted caramels. amazing. $2 a pop but will make all caramels you've ever had obsolete. Really great packaging and super cool all around. I can watch him make caramels all day. The place is cozy and has some pretty cool antique bits scattered throughout. I have a sickness and the only treatment is more hookers!!", "author": "Melissa W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-31", "description": "Great spot! Can't believe I've been living a block from here for two years and never knew it existed. Love the caramels just bought a box to take to home to my parents. Perfectly packed in a little box that fits right in my carry-on", "author": "Conrad G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-07-01", "description": "Don't get any funny ideas about the business name!\n\nSo I finally got a chance to buy these delicious handmade \"sea salted dark chocolate covered caramels\". They come packaged in \"eco-friendly\" boxes. http://www.yelp.com/biz_photos/hookers-sweet-treats-san-francisco?select=zo_zUVkL_KrVqT5uxwCIeg#6J1hD1E67oqQIH3PgXrDuQ I love that they look like elegant little old-world candies. http://www.yelp.com/biz_photos/hookers-sweet-treats-san-francisco?select=zo_zUVkL_KrVqT5uxwCIeg#mU9Ju1IqyGA7tFUlfaEGNQ The sweet caramel and rich dark chocolate are accented by sea salt, for a unique flavor. http://www.yelp.com/biz_photos/hookers-sweet-treats-san-francisco?select=zo_zUVkL_KrVqT5uxwCIeg#HFFTLEDI36h8E75u-NjmTg The ingredients used are certified fair trade and organic. The caramels are sold in boxes of 3 pieces ($7) or 8 pieces ($15). http://www.yelp.com/biz_photos/hookers-sweet-treats-san-francisco?select=zo_zUVkL_KrVqT5uxwCIeg#4V5MbWP9-9MTejU3Ujo9qA Yeah, not exactly cheap, but similar to pricing of gourmet chocolate by the pound. The website mentions that online ordering will start in the 2009 fall season via email (info@hookerssweettreats.com).\n\n** Update: Originally the treats were sold thru Sightglass Coffee on 7th Street @Folsom (daytime), and The Perish Trust on Divisadero. The cafe opened in June 2010 (gritty neighborhood, near 38 Muni bus stop), serving Sightglass brand coffee drinks ($2.50-$4.50) and adding many other delicious goodies - hot caramel sauce topped bread pudding ($5, seasonal flavors), cookies ($2-$3), etc. (caramels are now $2 each). And they now accept credit cards.\n\nCafe hours: Tue-Fri 8am-4pm, Sat-Sun 10am-2pm\nClosed Mondays.\n\nEnjoy!", "author": "Luis C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-28", "description": "Bring your insulin because this place ail put you into diabetic coma.  A beautiful, restful diabetic coma.\n\nI happened upon Hookers when I found them at Sightglass coffee.  I was an immediate convert.\n\nI took some to a client and now that client demands them everything I visit. \n\nDon't miss the bread pudding.  It ail add 1000 sit ups to your work out.  But it's worth it.", "author": "Danny D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-08-12", "description": "Espresso iis yum and very strong. Caramels, caramel espresso cookie bars, and cheddar biscuits all yum. Its small, lovely, and precious. Definitely a neighborhood spot. When I'm in the TL I stop here, I wish you opened earlier and stayed open later :()", "author": "Elizabeth T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-15", "description": "Tucked away in the heart of the TL, it may take you a few passings by to notice this neighborhood gem. \n\nThe interior is cozy, and charming knickknacks and antique goodies are artfully tucked away in nooks and crannies and strewn about on shelves.\n\nAlways a solid cup of coffee (Sightglass) no matter what you order, and the accompaniments are absolutely delicious. Bread pudding and sweet cheddar biscuits top my chart, but I can't leave out the salted caramels, either. They make a great post coffee snack, and are available in larger quantities for gifting that special someone-with-a-sweet tooth.\n\nService is quick, and the staff, courteous. \n\nMy only real complaint is that they don't serve iced latte's. I have to venture elsewhere for my caffeine fix on the hot (indian) summer days. Probably something to do with not wanting to ruin that amazing texture from the heavy cream they use. Hello, Clover!\n\nCash only bar, so come prepared. \nAnd bring a friend!", "author": "Carol C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-12-09", "description": "A hidden gem of the TL.\n\n I don't have a sweet tooth - so I usually skip on the treats, BUT the coffee is great, and staff is super nice. Over the summer, I enjoyed their spiced iced americano.", "author": "Pedro H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-11-05", "description": "To sum it up: No Fault Candies (salted caramels) and Desserts\nReturnability: Every day\nSuperstar Factor: On the superstar scale, Hooker's Sweet Treats is the candy shop/cafe equivalent of the porn star you want to dive into again and again.\n\nMove over, Crack. There's a (relatively) new addictive substance in town. I mean, Hooker's is not like a Saison or Coi. It's that sinfully delicious dirty (it's actually quite clean) darling that you can't take your mind off of. This candy destination, located in a convenient, but not very sweet part of town (which does not detract from its magnetic qualities in the least), is one of those places I cannot find any fault. It is certainly one of the TL's little purveyors of mouth pleasure. For one thing, it's cheaper than the other kind and secondly it's for sure less likely to cause infection. The pumpkin bread pudding with the baked in chocolate covered salted caramel was heavenly. The coffee is Ritual. The staff is friendly. Chocolates go one for $2, three for $7 (for the packaging) and ten for $20. I love the salted caramels, especially the ones with nuts. Honestly, who doesn't like nuts? Am I taking this whole \"hooker\" thing too far? I know, I know. Despite the colorful local \"help,\" the hooker in Hooker's Sweet Treats is actually the proprietor's nickname.  \n\nAnyway, let's talk more about the important things, like this bread pudding. Sultry caramel wraps its arms around a dense, moist and not overly sweet pumpkin bread pudding. The bread pudding cradles a secret heart of oozing chocolate and caramel. And, yes, there are nuts on top. ;)", "author": "Jess C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-12", "description": "Salted caramel goodness..'nuff said.", "author": "Kim G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-13", "description": "This place was the bomb! Got the bread pudding for a work meeting and everyone loved it!", "author": "Jeremy J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-15", "description": "Great bread pudding with wonderful caramel sauce. A must for the sweet tooth. The 10 piece sampler is slightly high in price but definitely worth the price. Find an excuse to go for them and you won't be disappointed!", "author": "J Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-25", "description": "This place is MARVELOUS. \n\nI confess it is my new addiction. I can't get enough salted caramels. Not to mention the mocha is just superb, not too sweet and is the perfect thing to wake up to. \n\nWhile they may be known for their salted caramels and other confections, please try the cheddar biscuit. It is SO good. Not to mention the bread pudding could totally help me gain a few pounds. \n\nThe decor is fabulous and the staff is always friendly but never too overwhelming for early morning visits. It might be in the TL but make a trip over here, look out the window at the tweakers and the pigeons that are going through it, and lastly enjoy this San Francisco gem.", "author": "Jeremy R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-05", "description": "This place was featured on the cooking channel so decided to give this place a try. Their salted caramel is outrageous. The bread pudding is phenomenal. Don't forget to take some to go. The whole team is extremely nice and gave a great explanation of the sweet treats philosophy. There were two additional customers that walked in stating they heard great things about their chocolates, so they needed to try. Give this place a try! Fair warning this stuff is addictive. Metered (credit card) parking is available on the street.", "author": "L G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-20", "description": "Sightglass coffee runs a close second to Four Barrel, in my opinion.\n\nBut I prefer my beans robust, like my mens, not sure about you haha.\n\nThat said, this is a tiny coffee front filled with lots of sweets (that I've yet to try) and a whole lotta love from the sweetheart barista behind the counter. \n \nSupport your local coffee shops!", "author": "Josie M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-03-29", "description": "When life gives me lemons, I get Hooker's. Here's my short list: dark chocolate-covered caramels flecked with sea salt (yes), a nutted version with a base of dark chocolate (my preference), a spiced chai latte (!!!), sweet cheddar biscuit (more exclamation marks), and unreal peanut butter chocolate chip cookies. Cash only. Closed on Mondays. Great if you live in the neighborhood. Worth the walk in.\n\nI generally find myself crestfallen after stomaching a Monday back at the office after a weekend of blowing off steam after a week of bottling up the dark matter. So come Tuesday, when the lights at the crosswalk on Geary conspire against my preferred steady pace through the throngs of tourists, junkies, kids and conventioneers, it's with great pleasure that I walk in the opposite direction, down Hyde and into a shopfront that'd be easy to miss and one's usual, hurried pace. \n\nAnd what light. I'm not talking the luminescence of the several few scattered Edison bulbs, or the lamps in the back illuminating the baking area, nor do I speak of the raw sewage-colored light reflecting off the building facades across the street. No. This is the light of warmth. From David \"Hooker\", the friendly gent that runs the place, to the slight heat coming from the ovens in the back, the smell of baked goods and the patina on the collection of slightly nautical, if not coastal Americana inside. \n\nOf course, the salted, dark chocolate caramels are excellent. Subtle in taste and texture; just a wonderful bit to let hang around in your mouth. It tells great stories, but doesn't cause a ruckus. The other version, boasting a base of dark chocolate and family of nuts in a small Vanagon of caramel resting on top, really topped it for me. Add to that subtle wonder of the Original, and put the lovely, nutty pleasure of nuts. Crazy, baby. They have Sightglass Coffee. The spiced chai latte is both refreshing and savory, perfect for any climate, and the peanut butter chocolate chip cookies just slay. Like everything here, it's subtle: the peanut butter flavor just playing rub-a-dub footsie with the chocolate, a base of moist yet almost chewy cookie, and peanuts. \n\nMy personal favorite: the sweet cheddar biscuit has a wonderful, almost cornbread texture (when cornbread is moist and cakey), with a slight spice somewhere in there. Eating that and walking to work makes me think that the lights on O'farrel are changing just to keep my walk leisurely, despite the engineering of people with big brains, who program those lights to change at some pace that's a mystery to me. A mystery it should remain.", "author": "Roy M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-05", "description": "Great hidden gem and the place gets bonus points for  letting us tell friends we got chocolate from hooker's in the tl.", "author": "beverly l."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-29", "description": "Hands down first in class. I'm a caramel and cupcake junkie. I will be shipping to east coast. They are worth the trek through the neighborhood.", "author": "Marci H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-12-11", "description": "The Cajun Corn Bread is to die for.  This place has gotten me seriously hooked on Sight-Glass coffee.  I mean, it's gotten to the point now where I am buying in bulk and grinding my own all day at work.\n\nHonestly, I love the minimal, no frills, no-ego atmosphere this place brings.  It's welcoming, but isn't implying you stay for 6 hours and work on a laptop.  It's everything you love about neighborhood coffee shops, but without everything you hate about Starbucks and Peets.  It's not even fair to compare.\n\nDavid knows what he is doing.. and I beg you to let him make you a cup of his Joe.  You won't be at all disappointed, unless you are expecting a laser light show to go with it.", "author": "John D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-13", "description": "ok.  I hope that my readers understand that this is a dessert place.  I'm serious.  Please don't judge me.  All I did was drink coffee and eat some pudding/chocolate with my fellow staffs.\n\nSalted Caramel Chocolate:  It sounds pretty weird but actually, it's real good.  \nFrench Press: I loved it\nBread pudding: descent...actually pretty good....=)\n\ntoo many great coffee/dessert joints in SF.  I'm not sure if i'll be ever back due to many great joints in SF.  It didn't hook me in any way.", "author": "Jang David K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-06", "description": "This was a delightful find that my GF made while watching a cooking show.  We tried pretty much everything on their menu and enjoyed everything.  I had the cheddar bisquit and thoroughly enjoyed it.  The Coffees we had were good and obviously the sweet treats were very good.  So good, we bought some to take home with us to So Cal.", "author": "Michael D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-06", "description": "Absolutely amazing and most definitely worth the walk over - I got a selection of each available caramel and they were all unbelievably delicious.", "author": "Audrey G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-05", "description": "A week of brothels* and Hookers.\n\nI can't comment on the, um, other offerings in the Tenderloin. But I can say that this Hooker and his caramel praline cookie is awesome. The caramel is baked right in. He turns quite the trick.\n\nHe charges by the cookie. Not the hour. The deed goes down in a well designed space filled with vintage artifacts.\n\nYou will leave feeling anything but cheap and won't feel the least bit ashamed. You might even become a repeat customer. And tell everyone.\n\n*http://www.yelp.com/biz/the-old-ship-saloon-san-francisco#hrid:MWVVzV4YqKf_nclhlpBNXA", "author": "Jason B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-05-08", "description": "I have been to Hookers about 4-5 times now and I am 'Hook'ed ;)!\n  \nEveryone who works there is really friendly and I am was really impressed that despite not making it there in about three months, \"Hooker\" (the owner) remembered our conversation that we had had there previously.  Definitely very receptive to feedback because I had asked about Sunday hours back when Hooker's was closed on Sundays, and sure enough, now they are open on Sundays!\n\nI have tried the coffee which is really delicious and also the bread pudding, praline cookies, and the caramels.  There is no hit-or-miss here, I have never had anything that I would not get again.\n\nI plan to continue visiting this gem and hopefully will soon be able to call its neighborhood home and able to visit waaay more often!", "author": "Chad P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-31", "description": "i know my DH loves me because he bought me a box of Hookers handmade salted caramels. DEEELISH. worth every mm of fat that will be on your hips after each bite lol  \nadding this place to my list of favorite chocolate places", "author": "joyce l."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-04", "description": "This place has a very small candy selection, but if you love salted caramels, oh my!  They have versions with and without chocolate.  \n\nThere's a hint of graininess in addition to the chewiness of Hooker's caramels that I like better than the texture of a typical caramel.  And I loved the salty-sweet taste.  They are a *little* too sweet for me, so I made an open-faced sandwich of the caramel with my own dark chocolate and that was a perfect level of sweetness.  \n\nMy very favorite is the three-nut chocolate caramel; again, the nuts cut back the sweetness a bit.  Next time I can get over there I will definitely be buying some more.", "author": "Susan C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-11-04", "description": "A hidden gem of a place. Awesome space, awesome unique treats, and awesome staff. Coffee and cake brought to our table. That type of service is rare at coffee shops these days so the extra touch is appreciated.\nTip: They are known for their caramels but try their specials, you'll be surprised.", "author": "C T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-05-28", "description": "I was dead set on choosing one of the many disappointing spots I've visited for my next review - after all, I have to worry that my integrity as a reviewer would be questioned by either algorithm or person for writing reviews which are suspiciously dandy. \n\nWell, I can't, please believe me natural-language-reading machine: this place merits the reputational risk.\n\nWhy?\n1. Fantastic Sightglass beans accompanied by the expert hand at using them which they deserve.\n2. Those caramels... Well, I don't feel that I need to say anything about them, since the issue has been chewed over (pun intended). I agree with every word and with respect to both types, new and old. I'll just say that the new type is so sweetly salty that I am afraid I am running the risk of an addiction.\n3. The caramel cookie (not the choclate chip. haven't tried that one).\n4. The people.\n5. The music.\n6. The curio whole in the wall and the delight you derive from sitting there on the bar stool and looking outside while reading.\n\nAfter all that complaining about the inaccessibility of wifi would just be grousing.", "author": "tal n."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-12-20", "description": "I've seen the buzz as well as walk by, but just never made it into the store.  But not today!\n\nWowie, one salted and chocolate coated caramel later. I've only eaten half and it's amazing! Soft, rich, wicked complexity and with just the right amount of salt to jolt you awake to pay attention to all of it.\n\nCap it off with a thickly foamed americano with a healthy dose of cream...\n\nSomehow, these piles of papers at work don't seem so horrible after all!", "author": "Rebecca R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-09-24", "description": "Hooker's in the Tenderloin? Who'd a thunk it?!\n\nI can poke fun at the name but the sweet treats coming out of this tiny storefront are no joking matter. The salted caramels pack a salty/savory punch while the cookies are flavorful and well worth the $2.50.\n\nThis little shop is well worth searching out if you have a sweet teeth and need a fix during your weekday.", "author": "phil h."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-10", "description": "Unique decor, friendly staff, strong coffee.\n\nA wonderful addition to the neighborhood. \n\nThe treats are TO DIE FOR!", "author": "Stephanie B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-02-15", "description": "Who would've known that hooker's sweets would be such a treat :). I love everything about this place, from the decor to the friendly staff to the amazing coffee and sweets. I was so overwhelmingly pleased with the banana bread pudding that had to come back for more. Great strong coffee as well.", "author": "Andreia G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-07-09", "description": "Had an Americano this morning and it was just what I needed to try and get my day started. One of the best places to get coffee in the city, if not THE best in the Tenderloin.", "author": "David G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-02-24", "description": "I received their caramels as a gift once, and I thought they were amazing. The store itself is adorable, although it has little seating. Their coffee, caramels, and desserts were great! Would definitely come back here again.", "author": "Yvonne P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-02-26", "description": "Yay for Hookers! Incredible coffee. Awesome people work and own this adorable cafe. The caramels I'm told are amazing, being vegan I haven't tried them myself but every person that visits me freaks out about them. I actually send them to all my family members through out the year to bring them a little joy from Sf. Don't miss this excellent gem of a cafe in the heart of the city.", "author": "Eryn L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-21", "description": "Was in San Francisco for work and yelp steered me here. Came back for a second visit. Amazing. Espresso, bread budding salted caramel. Wow.", "author": "Jim D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-08", "description": "Given the proximity of the place (less than a block from our apartment), its ambience, the quality of its offerings, the amiability of the owner and his help; this should be my favorite coffee house, and not just my favorite in San Francisco, but anywhere I've been.   \n\nQuite frankly?  Can We Talk?  \n\nI can't stand their coffee.  \n\nMy partner, the guy who drinks instant when camping (yecch) threw his out.  I'd never seen him dump coffee before. And that was after more than a month of regular visits.  We tried...\n\nBut coffee, like wine, is subjective;  one person's swill is another person's nectar, and a lot of people seem to have no issue with their coffee, so that's all I'll say.\n\nI gave this place four stars because everything else is so well done.  There are lots of coffee houses in San Francisco, even if our district can't seem to get any good ones; either the decor sucks, or the owner is depressing (and in one place it's both), or it just has the wrong vibe, but few have put so much effort into the aesthetics of the place (\"Sugar\" on Geary comes to mind) as Hookers Sweets, while still maintaining the quality of the food (if not the...okay, I said I'd drop it, I'll drop it).\n\nWhen I go out of town I come here for the salted caramels, as part of the \"Taste Of San Francisco\" locally made foodstuffs I take as gifts for those we're visiting.\n\nSo, while I now brew my own coffee at home, I'd still recommend this place if you're in the area.  Enthusiastically.", "author": "Paul T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-08", "description": "Effin ridiculous. And by ridiculous I mean ridiculously amazing. I've only had the bread pudding and it's delicious. Definitely a must try if you have a sweet tooth. The shop itself is adorable and the people that work there (maybe one is the owner?) are very nice. If they were in walking distance I'd probably have bread pudding everyday for lunch. Fortunately for my waist they are not.", "author": "Holly E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-12", "description": "I love sweets. I am not a caramel fan but I have to say this place puts crack in every batch. I found them at bi-rite and after sharing my nut caramels with a few friends I had to find the establishment of these amazing delights. Hands down the nut chews and coconut chews are the best the coconut nut caramel taste like a summer sun tan. I actually enjoy these so much that once I accidentally spilled them on to the TL side walk and street. My precious caramels were on the city street right next too dog poo and I normally would never ever ever pick them up but I couldn't let these babies go and had to pick them up obeying the 5 second rule of course. I shared them with friends and they enjoyed them with out knowing this little secret. They are really that good.", "author": "Christian A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-06-25", "description": "Very cool little cafe tucked away on a mostly residential street in the Tender Loin. \nSight glass coffee, and french press at that! Great Espresso drinks. Organic dairy products. On par with Blue Bottle, and Ritual.\nfriendly service. please note, French press takes a few minutes, so please be patient. \nAnd the most amazing Peanut Butter Chocolate Chip cookie I HAVE EVER had! \nLooking forward to trying out he other delicacies.", "author": "Kelle K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-07", "description": "I love you Max & your sweets! Max is a super sweet guy who eased me into caramels. I'm not a big fan nor did I realize how complicated caramels could be but everything that came out of his mouth made me want to get all the sweets. I got the original salted caramel, a espresso one and the PARTY GIRL which was AH-mazing!! And a cookie :) thank you for making my 5 pounds heavier but I'll be back fosho :)", "author": "J C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-11-23", "description": "I don't drink coffee anymore.  I just can't handle it.  My stomach is a delicate fragile lotus blossom.  But that doesn't mean it understands why I've stopped imbibing the siren caffeine.  Lou and I came here after a soup and noodles lunch.  He wanted coffee and a sweet, I wanted a pony.\n\nThey have dark chocolate covered salted caramels here.  The pieces were irregular and on the small side.  The price said $2.  Luckily it came with 2 pieces.  Still small.  I'm planning on making these in a week to give as presents.  These were soft and creamy.  Not chewy or tacky.  Billowy, waiting to be released from the robe of organic free trade sustainable local chocolate.  \n\nThe Americano Lou ordered was SO STRONG that it made my stomach curdle.  Strong is not the correct word.  FRAGRANT.  or maybe flagrant.  It was so coffee-coffee that inhaling the ether of steam as it flowed upwind to where I sat on a stool gave me the jolt of stimulation.  Lou's cookie was ok, except it had peanuts in it.  I'm allergic to peanuts, Lou.  But I ate a bite anyway.  Oh boy.  Now my throat is a bit itchy.  twitch twitch.", "author": "Christina C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-04-18", "description": "I love Hooker's!!!\n\nGreat coffee, awesome chocolate treats and you gotta try the bread pudding, the best I've ever had!\n\nBest coffee shop in the TL hands down!", "author": "Emilio G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-29", "description": "For about a year now, the steampunks and I have been talking about how there needs to be a steampunk cafe in San Francisco. We've made plans to try to build one, but nobody has the funding so it's still on the drawing board. This place is a little bit too small and specialized to fit our needs (a couple dozen folks gathering once a week to talk about gadgetry and corsets), but it gives me hope that something a little larger might spring up in the near future. \n\nAs for the place itself, it's got a wonderful old-world feel to it and sells some of the best caramels I've ever wrapped my lips around. If you're wandering the 'Loin and have a craving for sweets, I highly recommend Hooker's.", "author": "Kathleen P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-02-24", "description": "yum, yum, YUM!! These are some of the best caramels i've ever had. Since everyone said the bread pudding was sooooo good, i am definitely going back to get some......Along with some more plain old salted caramels. ; )", "author": "Erica S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-11-16", "description": "I know what you're thinking.  Since when did Hitarho open her own shop??!  \n\nNo, no- these aren't MY sweet treats.  I gave up that life.   If you think you saw me it's an imposter.  An imposter I say! \n\nThese treats, are the real deal Holyfield though.  Dark chocolate covered caramel w/sea salt.....mmm....I have it bad for salty-sweet combos.  These hit the spot.  I bought 3 in a cutesy box.\n\nAnd the bread pudding?!?  Sitting at the table, I tapped/stomped my feet while I ate it (think She's a Maniac/Flashdance scene) cuz it was so good.  Perfectly baked to a crisp on top, but so thick to the slice, and the caramel sauce was TDF.\n\nWould love to try some caramel corn and chocolate banana bread pudding next time.  I'll be back.  See you there!", "author": "Rho T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-11", "description": "Top 3 ways to tell you're at a Hipster joint\n1. All the men are wearing skinny jeans\n2. It takes them ten minutes to make one cup of coffee\n3. Kitschy digs\n\nI'm so happy hooker's chocolate opened their own place so I can have their chocolate all the time. Just got chocolate this visit but will be back to try all their other goodies.", "author": "Sophia C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-07-31", "description": "This place sells some of the best chocolate anywhere but what they are famous for is the saltes caramel they sell. It is all handmade and is absolutely delightful. You can get it fully covered in chocolate or only part dipped. Despite its location in the dangerous Tenderloin area, I cannot recommend highly enough a trip here during the dailight hours.\nAnother SF must visit", "author": "deCabbit"}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-05", "description": "What can I say but WOW!!!  These are the best caramels I have ever tasted !! Not only are the flavors FUN, but the size of these babies is awesome !! enough to let someone have a bite, and still get my caramel on !!!!  The folks at Hookers are not only experts  at making caramels, they are super nice to boot !!!   You won't be able to eat just one !!! YUM", "author": "Mary M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-08-10", "description": "Never been here, but yesterday the boss was nice enough to leave me a box of chocolates on my desk. Knowing that I don't care for sweets he brought me some dark chocolate because I can't turn that down. \nIt was heaven! who would have ever thought, that sea salt would taste so good on a chocolate?!!! \n\nHEAVEN!! Everyone in my family is a bunch of Dark Chocolate monsters, thank you Hooker's for allowing me to find the perfect Christmas gift for extended family. (and its only August!) \n\nHookers = Heaven", "author": "Anna P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-06", "description": "My friend lives across the street from Hooker's and from time to time I receive a box of his sweet treats and when I do...I jump up and down and do a lil dance, make a lil noise....and I get down that night...on those caramels.  These are hands down the best caramels I have ever tasted.  They melt in your mouth....melt people!!  They are so creamy and buttery and mixed with the sea salt on top and chocolate (original caramel)....it's like heaven on earth.  I'm hoping that I can actually make it into his shop so I can try other of the treats I see on Hooker's FB page. Yes, I am a Hooker's stalker! But seriously you should see the posts of their breading puddings and cookies.  Yes, I'm a bit obsessed.  If you are in their area, do yourself a favor and stop in.  Don't be afraid of the hood either.  It's not as bad as people think.  Share a caramel when you walk out and you'll probably make a friend for life.", "author": "Natacha M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-20", "description": "Just moved to the neighborhood and found my sight glass coffee. Add a tasty bread pudding with locally sourced ingredients and I can start to see more of this place in my future.", "author": "James H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-05", "description": "Best bread pudding and it's a new one everyday.....a little too much caramel on top but still suuuuuper delicious. Love the coffee too, very good and strong. To sum up my mornings at Hookers I'll quote the guy behind the counter \"Espresso and bread pudding....breakfast of champions.\"", "author": "Devin S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-23", "description": "Amazing Latte.  The sweets are perfection.  An OASIS in the neighborhood!", "author": "Eric S. R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-10-10", "description": "I sooo wanted to love this place. And I did!\n\nAmazing coffee, amazing treats, amazing people, amazing amazing.\n\nYo, folks. Stop sucking down sugar-infused drinks from Starbucks made by people who don't know steaming milk from taking a dump. Support excellent, authentic coffee shops like Hooker's. Once you do, you'll understand why.\n\nSquare.", "author": "Victor S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-12", "description": "Finally got to come here before they closed. I'm not really a big fan of caramel, but Hooker's sea-salted dark chocolate covered caramel? SO GOOD. I need to buy a bunch next time. super cute store and friendly staff - wish they didn't close at 4 !", "author": "Lily Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-07-25", "description": "Great local coffee and sublime sweets = a terrific combo.\n\nI'm hooked on the mocha at Sightglass Coffee and was recently swooning over the wonderfully bitter yet smooth chocolate that is used in their mocha and was told that there's more where that comes from at the newly opened Hooker's Sweet Treats.\n\nHooker's Sweet Treats is a oasis in the midst of the TL. The space itself is inviting and has been lovingly decorated. I love the bank bag upholstery job on the chairs. Clever and functional. \n\nI was disappointed to discover that they don't sell that addictive chocolate sauce by the jar and it's more of a coffee joint than a sweet shop, however, the bread pudding with caramel sauce was amazing and how can you go wrong with a Sightglass Coffee chaser? \n\nI'm hopeful that the chocolate sauce for which I covet is offered by the jar in the near future.", "author": "Lee H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-07-06", "description": "I give you five stars because I am exceptionally excited about a new coffee joint in my hood. I love good coffee, but I hate hungover bike rides to four barrel, so Hooker's is a fantastic idea. My only compliant: will you please consider extending your weeknight hours? Possibly closer to 8 if the market is there. I'm unfortunately a commuter at this point, and leave before 8am and arrive back after 6pm so I'm totes missin out on your fabulous treats and you're missing out on my coffee loving and BREAD PUDDING!!!! WOOT!!! spending obsession. \n\nI'm all for negotiating our relationship, hookers. \n\nciao!", "author": "Tim L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-12-05", "description": "It's been about what, 4 years since Bi-Rite Creamery popularized the combination of salt and caramel?  It's now fairly common as an upscale ice cream, in cookies and in a mash-up with another recent food trend, on cupcakes.  If I had eaten a plain old salted caramel before having one at Hooker's, it must not have been a memorable experience.\n\nBut Hooker's salted caramel is nothing short of perfection, balancing the sweet and bitter of softly pliable caramel and a delicate dark chocolate coating with the playfully light bite of a few flakes of salt.  This is a caramel you can eat without fear of losing a filling (I don't have any) or a tooth (I have plenty).  At $2 a hit, they are expensive as a confection, but affordable as a luxury product.\n\nSimilar care was taken with the $3 peanut-butterscotch cookie.  It too balanced sweet with salt, soft cookie with sticky butterscotch and crunchy peanuts.  Again, it's a bit expensive if you have a daily fix, but priced right or an occasional indulgence.\n\nHooker's also does a commendable job with the coffee, using Sightglass coffee roasted not even one mile away.\n\nFinally, Hookers makes good use of a small space.  It looks very up-to-date San Francisco meaning it is old-timey in that vintage hip sort of way, yet still feels comfortable.", "author": "Suo L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-06-21", "description": "These caramels are the best I've ever had. YUM!\n\nCan't wait to go back (ahem, tomorrow) for some caramel corn and bread pudding.", "author": "Alicia C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-02-15", "description": "Wow...I would have used OMG but it's already been used enough! These things are AMAZING!!\n\nGot 1 of the chocolate-covered salted caramel & 1 of the salted caramel with a chocolate bottom layer. They were delicious! \n\nThe mouthfeel is 1 of a kind. The chocolate melts in your mouth as you chew the caramel which isn't overly chewy & doesn't stick in your teeth. The salt on top is a small portion but you don't need a ton b/c they are large flakes & have big flavor. The combo of nuts is divine & altogether they make a dessert that you should \"treat\" yourself to much more often than that bag of potato chips. \n\nThere's a reason there are so many 4-5 star reviews of this place. So glad they're in my neighborhood! Too bad they're not open on Sunday...maybe I should take a star away for that...nah!", "author": "Marissa H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-04", "description": "Love me some HOOKERS!!!! I'm not a coffee but adore their espressos, all carmels, treats and staff. Just a incredible place. It's small, sweet and neat. I will always love these HOOKERS.", "author": "Cook E M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-04-19", "description": "MORRRRRRRRE SALT! Oh my heavens the salted caramels are amazingly-tasty treats. I bought myself a tiny box of three to celebrate for my birthday, and they were so mouth-wateringly good I had to go back and buy the big box!\n\nOh heavens they're delicious. The texture is exactly right, just firm enough not to ooze at room temp. \n\nIf you go to Sightglass Coffee, be sure to try Hooker's Mocha as well - a dark chocolate ganache spooned into your latte will have you queueing up for a second cup, guaranteed.\n\nWish we had more than 5 stars :)", "author": "SisterMable S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-19", "description": "I was NEVER into dark chocolate until I had a Hooker's Dark Chocolate Sea Salt Caramel. When I was introduced to it, I immediately turned it down for it was dark chocolate, sea salt, and caramel. I couldn't imagine that combination be any where near good! But once I bit into it, it all made perfect sense. Mmmm..the smooth sweet caramel mingling with the sea salt that really complimented the creamy decadent dark chocolate....all inticing my taste buds....yum!!! Ahhhh...they are pricey for a little piece of heaven. $2 for one square, surely this is a place you would go to treat yourself for a hard days work. Can't afford this stuff everyday with the amount of money I make. Nonetheless, undeniably the best spot to get sea salted caramels in the city!", "author": "Fran M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-09-17", "description": "The chocolate was mediocre at best. Pretentious to the max with a rude cashier. No wifi, you can't have a conversation with out getting dirty looks. Oh and if chocolates are 2 dollars each, what makes you think that I'll think that getting 3 for 7 dollars is deal.", "author": "Deenie J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-12", "description": "IMHO, Hooker's is known for its caramel. I got a caramel pecan cookie here once and have been hooked since. It's no surprise that they are know as hooker's sweet treats. The cookie is fresh and the caramel is rich and dense... so for all you caramel lovers out there, please make this a must-try spot to satisfy your sweet tooth.", "author": "Cassy H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-27", "description": "Don't let the smell outside fool you. You didn't step in anything. It's just the smell of the Loin especially in the morning. This place feels like a cozy cottage with treats of the legal variety in the form of their incredible caramels. They also make cookies and other baked goods which are great. Farm Table is right around the corner, so if you're in the area for whatever reason (real hookers, crack, etc.) be sure to check out these two places, your stomach, and possibly your Loin will also thank you.", "author": "Mike C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-12-04", "description": "This place is really really greaf!!! I just love the Mocha that I got! It was made with organic milk ( that's a standard here)! It was way better then starbucks, what a real mocha should be! Sweet but not overloaded a d still balanced ( they use there own chocolate for the mocha as well)!\n\nI also got one of the salted carmals and it was uber amazing! Just the perfect balance of sweet and salty!! \n\nI can't wait to go back and try the breac pudding, it's next on my list! So glad to call this my new coffee spot!!!", "author": "Noelle L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-11-28", "description": "Brad pudding yummy! And the change the flavors all the time! Even though the neighborhood is a tad bit sketchy the dessert more than makes up for it!", "author": "Stephanie D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-03-31", "description": "if you didn't know this place existed you'd walk right past it and never know it was there. actually, i take that back. if you didn't know it existed you would never even walk past it because what the hell are you doing in that neck of the woods with no destination? the tenderloin is no place to be without good reason. \n\nthe caramels, covered in dark chocolate and sprinkled with sea salt were good, however i'd prefer it if the caramel itself was salted as well. the bread pudding was tasty and moist and the caramel sauce was super sweet.", "author": "Regina C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-10-30", "description": "uhh LOVE.\n\nwhen my friend and I first visited here, she was going nuts about how cute the place is.  The teas are good (I'm not a huge coffee person so can't say much to that).  We've tried the bread pudding but I actually like the sea salt caramel chocolate and this pecan cookie thing better.  The service is wonderful.  I love the owner! My friend and I basically try to come here once a week to \"study\" aka talk with our books open.", "author": "Christine B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-09-17", "description": "I so wanted to love this place. I have the biggest sweet-tooth in the world and have a special place in my heart for caramel. \n\nMy experience was very unpleasant and did not make me want to recommend this place to anyone. In fact, this is my first negative review. \n\nCustomer service was definitely lacking! Unfortunately, this place has a $20 minimum for credit card transactions. Being that this was my first time, I wasn't aware of this fact and didn't have any cash. The employee was beyond rude and was very insulting. I have never seen a $20 minimum. If the minimum was $10, I may have bought an extra carmel. I apologized because I wasn't aware of this fact but the employee was still being abrasive. \n\nFinally, they did take my credit card. Customer service is something I take very seriously. I will admit the caramel was tasty, but I will never be a customer again. \n\n**The gentlemen taking my order was very pleasant it was the other employee.", "author": "Amy V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-09-02", "description": "First of all, the owner, I think his name is David, cleans his own windows. We're talking about personal attention to details and you'll find it in every nook and corner of the cafe and cookies. You'll be treated to a wonderful space, great treats, good coffee and interesting people and in and out of the cafe. Nice going Hookers!", "author": "Andrea Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-03-02", "description": "I could drink the bourbon-caramel sauce they pour over the bread pudding all day long. The little salted caramel candies are amazing. My Friday sweet tooth is so very satisfied!", "author": "Lynn M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-01-03", "description": "Who are these reviewers? where am i?! there is seriously a place called \"hookers\" in the Tenderloin that serves fancy pastries? what happened to the old neighborhood full of real people, great food, queer bars, and dive bars? so strange.", "author": "Hank T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-09", "description": "The space is great, the people who work there are incredibly nice and cute, the hours are pretty good, and the caramels are excellent - but I still just don't think they're $20 for 10, $7 for 3 excellent. And while salty and sweet is a hard combination to beat, the caramel praline bars sort of ended up beating that flavor to death for me. But I'm disappointed they don't seem to have the caramel corn around any more, so how tired of that combo can I really be?", "author": "Lisa K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-10", "description": "Came here for an afternoon delight and enjoyed it. I felt like I was at the general store from Oregon Trail, except with cooler music and a cute boy at the counter. Both he and the owner were very helpful and engaging, which compensated for the high prices and cash-only policy. Tried my friend's peanut butter cookie, which looked like a dehydrated Blondie bar, but surprisingly turned out delicious: chewy with delicately flaky surface, mellow yet flavorfully nutty without tasting like junk food. I purchased their chocolate covered salted caramels; liked how they were smoother rather than tackier, thus lending the salty/sweet contrast a real emulsifying and full-bodied quality. \n\nBoyfriend found a used tampon at the foot of the entrance which turned him off to the place, but I'd take the hop for more Hooker treats.", "author": "Nicole L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-11-24", "description": "First time coming in today, but I'm proud to say that it's the first coffee shop to meet all my criteria of an awesome coffee shop.  \n\nThe French press is good, the atmosphere's amazing, music's great, AND the workers are really nice.  Free delicious caramel sample taken to us as we sat, and they've had real conversations with everyone who's come I'm so far.  Top notch, hands down.", "author": "Jon O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-29", "description": "OMG, the Salted Chocolate-Covered Caramels are amazing! Sweet, salty, and subtle. A must get for anyone's first time to Hookers. Also, the box of 3 or 10 make a great gift.\n\nAs for coffee, they have delicious french press made to order and the barista makes a great cappuccino.", "author": "Tevy D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-28", "description": "Hooker's is a killer little coffee shop with a whole lotta style, and right in the heart of the ole Tenderoni.  I want to say that these guys are helping to contribute to the \"Tenderloin Renaissance\", but that would mean that the Loin was once cool, which it's never been.  More appropriately, Hooker's is one of the Tenderloin Pioneers, as more and more unique little shops and bars open up and give people a better reason to come here than just an STD or crack cocaine.", "author": "Ted T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-16", "description": "I really wasn't expecting the sweet treats to be as delicious and well-crafted as they were. I tried the three different caramels they had. Caramels are my favorite, and usually places do them too hard. These were made just right. The consistency not of the \"stick-to-your-teeth\" variety of caramels so often found, but rather so soft and delectably chewy. I used to date a guy who made old-fashioned chocolates and caramels, and his caramels really were the best I've ever had.  I stopped missing him a long time ago--apparently I won't have to miss his candy anymore, either.", "author": "Jille E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-14", "description": "It was the weekend. It was early I was up and wanted coffee. I had been told about Hooker's and was excited to sample their wares.\n\nI came to the door...but it was locked! I looked around assuming I had made some pre-coffee morning mistake and was trying to enter a door that lead to the needle exchange clinic the tenderloin is notorious for! But no. I could see through the window that there was light and movement inside the establishment.\n\nI tried the door again, desperate for caffeine on this cold unwelcoming morning, but it would not yield. I was confounded and confused till magically the door was opened by an angel who informed me that the shop was not open till 10am. It was 9:30. They were kind enough to take me in, however, and make me a delicious cup of french pressed coffee.\n\nIt was transcendent as were their delightful treats.\n\nI had a chocolate covered macaroon that was a gift from the heavens. You can't go wrong with the place.\n\nSweethearts and sweet treats!", "author": "Jack R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-06-30", "description": "You can tell someone put a lot of thought into the look of this place! But obviously, that is not as important as the taste! They have only a few items on the menu but just looking at it made my mouth water. \nBread pudding? Caramel & Praline cookies? Yes please! The cookies had a hint of salt and the sweet/salty combo were making my tongue dance. I forget what the bread pudding was made of but the guy asked us if we wanted the caramel sauce on it or on the side. As if he needed to ask! Pour that sauce, man! It was very, very sweet. I know it did have bits of apple and banana. My teeth protested a little but my taste buds definitely appreciated it.  \nIt would have been FANTASTIC with coffee but I'm too sensitive to caffeine to have any. But wow! If you are lucky enough to drink coffee at all times of the day, come here and order some sweets to go with it! You're welcome!", "author": "Amanda W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-29", "description": "I learned about this cute little treat shop on the Cooking Channel on \"Unique Sweets.\" If its on the Cooking Channel, then I have to check it out. I ordered the original salted carmel and the peanut butter chocolate chip cookie. They were both delicious, oh my gosh. I almost turned around and went back to the store, but I remember self-control. However, I will be going back for some more.", "author": "Baseemah R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-20", "description": "very specialized place.  got the Brothers Not Lovers caramel (sea salted chocolate espresso caramel covered in dark chocolate and topped with pistachios).  definitely good.  perfect bites of soft salty sweet caramel.  should make a great artisan gift.", "author": "Rob C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-08-18", "description": "Homemade chocolate granache inside my coffee, please sir may I have some more?! I was licking the inside of the cup.  \nThe mocha is the way to go, it's not too sweet like the typical powdery sugary stuff at other coffee shops.  Hooker uses bittersweet chocolate, sightglass  coffee and steamed strauss family milk. Delicious treat! \nCan't wait to go back with an appetite for cheddar biscuits, bread pudding, and cookies!\nThanks for coming to my hood.", "author": "Kimmy C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-09-11", "description": "It's great to have a coffee/sweet treats shop half a block away.  Unfortunately, I'm at work most of the time they're open.  \n\nThe spiced iced coffee is delicious!", "author": "Sergio R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-07-03", "description": "I love hookers! And chocolate. And coffee. \nReally, they're awesome. \nThank god I can now find ALL of these things in the TL.\nAnd of such amazing quality...\n...except for maybe the former.", "author": "Adrienne F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-07-01", "description": "Hookers is a new front-runner in artisan coffee in the Lower Nob Hill Area. Sadly, Lower Nob Hill is not blessed with a plethora of roasteries like the Mission District is but, thanks to this magnetic new start up, we've got one of the strongest players in the game right here in our own quaint little area. \n\nThe coffee and espresso is roasted by the amazing, and amazingly new, head honcho of master coffee in the city: Sightglass Coffee. Always expertly prepared by Hookers's beautiful/handsome baristas who know how to make a latte into a piece of art...even if you're taking it ToGo, as I often do.\n\nThe man responsible for this new gem of a location definitely knows what he's doing, especially when it comes to his \"sweet treats\". I thought his sea-salted, chocolate covered caramels were the best thing under the sun, with its soft and rich texture and its savory saltiness... But then, this morning, my boyfriend brought me what he's cookin up now, his latest creation: Praline Caramel Cookies - OUT OF THIS WORLD DELICIOUS. Seriously.\n\nHooker's Sweet Treats is: Coffee and Hand-made treats done properly by people you like.\n\nIt won't be long before its the most popular place in the area, so you might as well not try to fight it, like you did Gaga.", "author": "Gilbert B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-06-24", "description": "Only 1 visit, heard about them from Sightglass coffee which features Hookers chocolate in their mocha (excellent). Quality chocolate caramel treats here. Had one in the store and bought a box for friends at home, lucky bastards. The guys working were great, friendly and helpful. Definitely recommended!", "author": "Brandi H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-09-27", "description": "A place named Hooker's in the heart of the Tenderloin that makes a truly excellent cappuccino....5 STARS.", "author": "A L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-06-18", "description": "I LOVE this place. It's a tiny little gem that just opened up in my hood. \nA great spot where you can sit and enjoy coffee for two served up by some nice folks and split some hot bread pudding drenched in the best caramel sauce I've ever tasted. \nNeed a last min gift? Pick up a box of salted chocolate caramels that are to die for.", "author": "sarah d."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-10-17", "description": "By sheer default (intriguing business name don't you think?), I knew that I wanted to see what Hooker's Sweet Treats was offering. \n\nIt was quick and painless. I walked in, saw what I wanted, asked how much and how long it would last. \"Five minutes, shorter if you take it all at once. I'll even give you a bigger one...\" Slightly taken aback, I quickly realized they were referring the size of the caramel.\n\nThe dark chocolate covered caramels topped with sea salt was perfectly balanced. The bitterness of the chocolate was just right and offset the sweetness of the caramel in harmony with the sea salt. \n\nThe price was right and I was completely satisfied. I would suggest that everyone pay Hooker's a visit for a sweet treat.", "author": "Mark Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-09", "description": "The Bread Pudding w/caramel sauce, simply put \"KNOCKED MY SOCKS OFF\"", "author": "Freddie L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-07-31", "description": "French press coffee + triple fruit bread pudding + super friendly service + country kitsch atmosphere = perfect place to caffeinate and enjoy a sweet treat on a late Saturday morning. \n\nI'll be back to try the caramels.", "author": "Robyn M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-07-19", "description": "We residents of lower Hyde Street are happier people because of this lovely, delicious little cafe.  The caramels, cookies, and bisquits are absolutely incredible (we like to stop by early in the morning, when some of the baked goods are still warm).  The coffee is great, and the staff are warm, friendly people. It's just a wonderful, wonderful place.\n\nPlease give this great little business the support it deserves. Give it a try next time you're in the neighborhood.", "author": "Christina R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-18", "description": "The staff, the owner, and the candy is all that.  I love what David is doing.  Great job and thanks for lifting the bar in the hood.", "author": "Joe D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-02-05", "description": "I can't believe I haven't reviewed Hooker's yet! I've been coming here for about 2 years now as they are located only two blocks from where I work. Hooker's is a little gem tucked away in the Loin and I'm actually glad 1) it keeps the hipsters away and 2) it's like a secret between the Tenderloin and I. They used to make the best ginger/caramel popcorn but stopped. Their bread pudding is amazing as well their cookies and salted caramels (their treats are a bit pricey but it's made on site so well worth it) HOWEVER you should come in early as all the treats are usually gone by the afternoon. I love, love, love their coffee drinks; their iced spicy coffee is a must try but did give me a tummy ache (too strong for me).  The owner is wonderful and supports everything we do (I work at an after school program nearby).", "author": "selina n."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-17", "description": "dude my family is hooked on there treats. folks are friendly and engaging. Just a warm feeling when you walk in...once you try their stuff you'll keep coming back...", "author": "Daniel M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-04-11", "description": "Hooker's salted caramels are so yummy that I had bought some to bring home to my friends and I ended up eating almost all of them. Its in a very tiny coffee shop in the tenderloin and if you walk too quickly you will miss it. I was using my GPS on my phone and had to back track a couple steps because if you blink you will pass right by. I'm so glad they do mail order!", "author": "Christy T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-24", "description": "Salted caramel chocolate treat is so delicious!", "author": "Tanasan S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-07-12", "description": "This is my sweet spot in the City. Brought 2 out of towners for a client meeting and this place helped sealed the deal. \n\nVery nice place, and a great spot to walk from City Center or Union Square!", "author": "C L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-07-19", "description": "There simply aren't words to describe the experience of eating the amazing sea salted dark chocolate covered caramels created by \"Hooker\", of Hooker's Sweet Treats.  You're not just eating chocolate, you are consuming a piece of heaven.  With each and every bite, your mouth is delivered a bit of rich chocolate, caramel that is the perfect taste (sweet, but not too sweet) and texture (doesn't stick all over your teeth) and the sea salt on top kicks all the flavors up a notch.  I've made myself sick on these, they're so flippin' good.\n\nIf you can get your hands on the Orange Caramels, I HIGHLY recommend trying these as well.  Again the texture is perfection and the combination of the sweet caramel infused with orange is just about the the best thing ever!!!", "author": "J B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-03-28", "description": "REALLY??????????????  I can't believe how good the salted chocolate  was.  A perfect compliment to the perfect espresso.  Need atmosphere paying tribute to the early 1900s.  Service was excellent.  Will be back.  Very neat gift idea.", "author": "April M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-02-28", "description": "Delicious + adorable. The guys who work here are super friendly.", "author": "Anne T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-05", "description": "I only come to Hooker's with a friend who is willing to spend $3 for a cookie. Not me, thanks, because I live in the real world.  Everyone I know says EVERYTHING Hooker's makes is truly delicious...but the only reason I accompany my friend is because of the one cute guy that works there.  Now HE is a sweet treat.", "author": "Mr. G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-08-14", "description": "The first time I passed by their dark exterior I had to make a comment\n\n\"Hookers on Hyde? I thought they just stuck to Larkin.\"\n\nMy walking companion made equally charming commentary as we passed a local middle aged resident shouting solicitations at cars between sips and slurps of her shiny goblet of King Cobra or Steel Reserve. Classy for a sunny afternoon.\n\nBut as charming as this dew of sundrops was, she didn't hold a candle to Hooker's itself. Upon entering the dark exterior opens up to a small, warm, rustic but homey interior. I don't know why but I was instantly feeling a Little House on the Prarie vibe in a great way. A large dark wood table flanks the left side of the cafe and the menu is simply displayed in the corner of both the front window and to the right of the cash register. A large chalk board to the upper left promotes the daily special. When I went there were cheese biscuits, caramel praline cookies and yes, bread pudding for offer. I was recovering from a long night of talking (not in a bad way) but was in high spirits. The cappucino I got was fantastic, the right balance between frothy and hot. A salted caramel added to my perk me up-pick my up, holding the attention of my taste buds. I slurped that bad boy rather than chew until I was all but slobbering caramely goodness. See I can be classy too!\n\nThe happy warming feeling inside was matched by mellow mood music and a nice guy behind the counter who made me my tasty beverage. He expertly made my drink, paying attention to detail while remaining friendly and charming with those of us indulging in the pleasures of Hooker's. The vibe is mellow like the library and unpretentious. Definitely a place to consider if you enjoy \"me time\" with your coffee. Maybe a tad bit pricey for an everyday excursion but just like people who indulge in the other kind of hooker in the neighborhood sometimes you just have to treat yourself to the talents and treats that someone new has to offer. Cheers.", "author": "Veronica G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-27", "description": "small cafe with just a few seats in a gritty area.  Sightglass coffee and an assortment of salted chocolate carmels.  Great gift idea.", "author": "around town e."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-08-14", "description": "I had the mocha and while it was good, I've had much better for a more reasonable price. I wasn't feeling the atmosphere too much either, the only thing that I really enjoyed from Hooker's were the caramels.  But even the candy was far from being worth the price . . . Sorry Hooker's :(", "author": "Beatriz A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-05", "description": "I learned about Hooker's through Yelp while searching for something different for Valentine's Day. What a great find! I went into the store to buy an assorted 10-pack of salted caramels. I also ended up buying a bread pudding to take home, and they gave me re-heating instructions. The men in the store were extremely friendly and helpful, and it was nice to watch them making each caramel one-by-one right there. Both the caramels and the bread pudding were amazing. They were also a bargain - $20 for a 10-pack, and the caramels are BIG! Plus they are completely scrumptious. We will absolutely go back again for our own consumption and for gifts for others.", "author": "K B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-05", "description": "Such a charming space! It's the kind of place you feel bad getting your coffee to-go. Delicious cheese biscuits and good french press -- unique, stout-like coffee. Next time I'm trying their salted caramels. Very friendly customer service.", "author": "Emily B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-11-12", "description": "Awesome and the owner is very cool. Had great coffee and chatted with neighbors.", "author": "Anna C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-05-24", "description": "I just bought the coconut-pineapple, blueberry bread pudding!, i know what your thinking, and yes it was delicious. i wish i tasted when it came out the oven, but by the time i had a bite, 5 hrs had gone by. it  was still delicious though.. the shop is uber cute and the salted caramel was divine.. best way to get a cavity. anyhow iff your in downtown san francisco, you might wanna walk down on hyde & check them out. it's kind of a sketchy neighborhood but i guess that's downtown sf for you!", "author": "Jocelyn C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-04", "description": "My husband and I discovered the wonders of Hooker's Sweet Treats shortly after they opened and have been devoted fans ever since.  When planning our wedding, we crossed our fingers that the shop made wedding favors and we were in luck!  We worked with David to customize the packaging for the favors and sent our guests home with delicious caramels.  We've been getting rave reviews from our guests ever since.  If you're looking for unique SF wedding (or everyday) treats check this place out!", "author": "Erica W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-24", "description": "Chocolate covered salted caramels...AMAZING.", "author": "Amy A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-21", "description": "Love the praline cookies, am addicted to the salted caramels. Cute little store front, friendly customers and sweet deliciousness. Mmmm...salted caramels", "author": "Hayesvalleygirl .."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-02", "description": "the salted caramels and those SWEET CHEDDAR BISCUITS are so good!! it's a little bit pricey and not in the best area of town (luckily we were in town for a short visit and happened to stay in the apartment building right above the establishment) but definitely worth a try.  great service and the smell inside is just heavenly especially right at opening when all their baked goods are coming out fresh.", "author": "Jen K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-09", "description": "Awesome little place. I missed it the first time I walked by, but eventually found it (its the black awning on the east side of the street). The interior was small but homey and had a nice by-gone era vibe to it. the coffee was good, but the chocolates were amazing. I had the caramel and sea salt one, and it was one of the best I have ever tasted. Only downside: the crazy on the street outside yelling \"its weed, not crack\"", "author": "Cory H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-01-27", "description": "I don't give just anyone 5 stars. Whoa. These are the best. Really. This is *exactly* the kind of caramel I like the best, just like my parents make. Thick, chewy not sticky. And the dark chocolate on these is actually delicious, high quality tasty chocolate. And then the salt! Oh my! The salt! Wow. I've had other salted caramels that I've loved.. but these are firmly in first place for my favorites ever. Thank goodness I go to sightglass often!", "author": "Jessica S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-05-23", "description": "This cafe & sweet shop is a little San Francisco gem.  I found it accidently walking back to my car after doing some volunteer work.  I was just looking for a nice cup of coffee.  This place has some great coffee and some great small batch / artisan sweets.  Whoever is making the sweets is talented and has a lot of passion!  I had something wonderful made with caramel and nuts.  The salt on it was perfect and so tasty.  It went so well with the French press coffee I ordered.   The staff was friendly and happy and the shop decor is fun and hip.", "author": "Herman W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-14", "description": "Ahh sweet perfection in every way. The coffee's amazing the caramels are amazing and his cookies are amazing. I just wished he had tea and longer hours.", "author": "Catherine C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-17", "description": "Everything they offer is absolutely delicious. The right kind of new business is the area, too. Friendly, respectful, positive, yes, but after all, it's really about the coffee and the sweets and they are both SUPERAWESOME.", "author": "digiTED .."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-08-10", "description": "Talk about an oasis in the middle of the Tenderloin. Tucked away on Hyde just before O'Farrell, this little coffee shop and dessert location is pure tranquility. Step in to soothing music, great staff behind the counter and great coffee. I can't wait to go back and grab some treats.", "author": "Rebecca D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-01-29", "description": "The chai tea latte was pretty strong, could be sweeter. The salted caramel is good but too pricey. Good experience I don't know if I would go back again though.", "author": "Anna H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-11-26", "description": "I came here with a friend, who recommended and also highly reviewed the place a week or so ago, and had a great expierience. friendly staff, the bread pudding was amazing (I don't even like caramel THAT much and ended up devouring mine). The chai i had was also tasty, will come back soon", "author": "Luis S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-19", "description": "Great coffee and WONDERFUL hand made sweets!! GO CHECK IT OUT.  And THIS is coming from someone who doesn't like sweets!", "author": "Ani N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-26", "description": "Their salted caramels send me into a weightless tailspin of heady goodness. Hot damn. Get them at the Perish Trust or now Sightglass Coffee.", "author": "casey c."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-11-18", "description": "Bless you David, this place is great. Coffee is just what I need most mornings, if I get up that early. Sweet cheddar biscuit = heaven. The new Cran-Pear bread pudding is so nice I'm going to eat one in about 20 min (11.18.2010). The caramels are the perfect match of salt and sweet. Nice work.", "author": "C G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-18", "description": "I was extremely pleased with my visit to hookers sweet treats. The coffee is wonderful and the people there are great. I didn't know it was cash only and just had my card on me, but the owner was so kind and told me not to worry and just come back later to pay..you can't always find great customer service like that. Thank you for coming to the tenderloin Hookers!", "author": "nikki r."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-09-21", "description": "So cute! The snacks here are amazing! So delish! I smoke a bowl and then go get there cherry bread pudding (that they make to order) and an espresso, which they serve with a shot of sparkling water to boot. Nice one! The ambiance in this place is so amazingly vintage it reminds me of restoration hardware, but more authentic. They usually have cute music playing and it doesn't hurt they have a cute super friendly guy who works here. Coolness in the TL? Yeee.", "author": "Chris T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-06-23", "description": "This place is dangerously close to my house. The coffee is deelish and the caramels are WONDERFUL. They have just the right amount of sweetness, a perfect combination of salty and sweet. I love the sea salt so much it would be amazing if it was all over them, but I do understand the restraint. Love. This. Place.", "author": "Madeline L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-06-22", "description": "yummy salted dark chocolate caramel was amazing. i am still thinking about them. thanks for sharing at Gfest yesterday ( i was at Mamas Empanada's truck)", "author": "Liz B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-02-13", "description": "The salted carmels are awesome. Waiting for a box to make their way to Canada right now!", "author": "susan c."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-10", "description": "Location wise, it could be a lot better.  The salted caramel is THE BEST I have tasted by far.  Pure heaven!!   It's pretty pricey  but it's all handmade and the quality shows.    Bread pudding and caramel bourbon sauce is freakin awesome.", "author": "David M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-07-24", "description": "I thought I'd arrived at pb nirvana with their peanut butter and chocolate chip cookie. The cookie is thick and moist, and the dough has a rich  peanut flavor, punctuated by crisp whole peanuts, and plump chocolate chips. Mmmm.", "author": "Aiko S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-11-07", "description": "The most amazing bread pudding and salted caramels!! Will be back to try more from the menu. Support local small businesses!", "author": "Dana R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-06-02", "description": "Amazing coffee and out of this world caramels. No really, its like heaven. Chewy, but never stick caramel dipped in dark rich chocolate with a light sprinkling of sea salt.  This is a little gem in the Loin that deserves a visit. The interior space is incredibly sweet and welcoming, the folks from The Perish Trust helped make it what it is and it shows. Its small but bring a book and have a seat. You'll love enjoying and impeccable cup of coffee and a sweet treat is the awesome little space!", "author": "Jenny E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-06-18", "description": "We were lucky enough to stumble on this place just before they officially opened and they asked if they could try out some cappuccino and bread pudding on us!!  Awesome place.  Can't wait to go back!!", "author": "Karen B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-07-02", "description": "So happy to have finally had a chance to try Hooker's! I've had Sightglass coffee on many an occasion, but it's great to have some right in my 'hood, especially when it's so expertly prepared. Tasteful decor, bigger than Farm:Table, and the sweets are terrific.", "author": "Dido H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-06-30", "description": "this place is a diamond in the ruff! \nno words can express how refreshing it is to see a place like this in a sea of so many businesses that don't really care about the customer or the product they are serving.\nGod bless you hooker! i am so glad to have this gem so close to where i live and I always look forward to popping in for some coffee and treats. \neveryone should experience this place at least once.", "author": "amar g."}
