{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-08", "description": "Horsefeather was one of my favorite places that we tried in San Francisco. When we arrived we were told that we had a 30 minute wait for a food table, so we went to the bar to try one of their craft cocktails. My drink was by FAR the best. I tried the \"Mamajuana\" because strawberry just sounded refreshing, and it exceeded my expectations. The description is \"gin, strawberry compote, martini & rossi rubino, \"rainwater\" port, yuzu, guajillo\". \n\nPrice: \nExpect to pay $12-13 for a cocktail, and $15-$20 for a dinner entree.\n\nService: \nGood service for a small, busy restaurant.  \n\nThe only disappointing thing that happened was with dinner. We sat down to order, and it took a little time for the server to get our orders. We had been looking at the menu for about 10 minutes and so we had a pretty good idea of what we wanted. Two of the things my husband tried to order were sold out for the day (the burger and the tuna bowl) so he ordered pork tacos....only for the server to come back and say they were sold out of pork tacos. We ended up not staying for dinner because there wasn't anything else that he really wanted, and while in San Fran we wanted to eat GOOD. \n\nI would definitely go back to Horsefeather, and I can't blame them for being busy or sold out of items. It's a small, local, neighborhood bar with food on the side. The cocktails alone would bring me back every time.", "author": "Hillary S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-05", "description": "*Drinks only review*\n\nWas walking by after visiting Alamo park and thought \"this place is so cute, must go in!\" I had no clue it was actually a well-known spot in the city. \n\nWe walked in around 530 on a Thursday and it was pretty empty, but by around 630 the place was packed! It definitely got loud, especially inside.\n\nThe patio is adorable. Looks like a greenhouse with glass ceilings and I was able to see part of the sunset as I sipped my drink. The inside is cozy but much darker. I would not sit inside during the day. Service was also great. Our waitress was very friendly and the other gentleman always kept our water glass full. \n\nWe just had drinks (sparkling rose and beer) but next time I will definitely try the cocktails! I was surprised cocktails were only $11-13 for how good they looked--not bad for SF! The only thing I wasn't thrilled about was that my rose was served in a coup glass instead of a flute (personal preference, I'm not a fan of coup glasses as they spill too easily). So I'm wondering if I can request a flute next time. \n\nThe food also smelled amazing. Everyone was ordering burgers. Will come back soon!", "author": "Priyanka C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-15", "description": "tl;dr good food (but a bit expensive), unique cocktails, and a cool southwestern vibe.\n\nI originally put Horsefeather on my wishlist due to a recommendation from a bartender at Holy Water in Bernal Heights. I'd been waiting all summer to visit Horsefeather, and I finally went during my last week in San Francisco! It was worth the wait for sure. Definitely a memorable experience.\n\nI'd say the best thing about Horsefeather is the cocktails! The menu is unique and every cocktail you get is even more refreshing than the last. I started with the Sun Country, which was probably my favorite. It was definitely reminiscent of driving through New Mexico at sunset during a roadtrip. I also loved the Mama Juana. If you like strawberry, this will be your ultimate refreshing cocktail!\n\nThe food was also pretty good, if a little bit expensive. We had the ceviche and the poke, both of which were light and went along well with the cocktails since the food was also refreshing. \n\nI have to mention that the atmosphere here is also great. Everyone's really chill and it's the perfect place to sit down with some friends and talk over a few cocktails, even when it's crowded!", "author": "Claire C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-12", "description": "I went here with a coworker after work. Their poke was excellent and very flavorful. Love the back area of the restaurant, very private and good for a date. Only bummer was the food prices were quite expensive and the service could have been a bit more attentive and friendly. However I did have a positive experience and will be back.", "author": "Jordan S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-28", "description": "This place was packed on a Wednesday night at 7:30. Had to wait 20 mins for a table for 2 but grabbed a drink and stood in the bar area while we waited.\n\nThe decor in here is amazing! The front area is very Brooklyn hipster plant life while the bar and back are sexy, wooded and give Speakeasy vibes.\n\nEven though we were waiting in the bar, the server was very attentive and helpful, which is kind of rare for a packed restaurant. \n\nThe menu is limited, but everything looks amazing. We had the pork tacos which were fantastic and had the best cilantro I've ever had. Just really spot on tomatillo. We also had the mussels dish which our waitress warned us was served cold. It was served with the most delicious grilled bread and we were very satisfied with our bites and drinks. We ordered wine, sparkling rose and tequila shots, but will have to be back to try their extensive cocktail menu. \n\nExcellent place but probably not good for groups!", "author": "Kylie F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-09-21", "description": "I've been here for both brunch and drinks. I found the brunch a bit mediocre but the cocktails here are really nice. I would recommend this for a drinks date because the ambiance is lovely but the food is overpriced", "author": "Sharvari J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-07-15", "description": "Great cocktails and food, but this place can get really loud and crowded. It's also a bit too dark for my liking, since I could hardly see my food. It's also kind of hard to get a table without waiting for a substantial amount of time, which I don't think is really worth it. The food was okay-- it wasn't outstanding to the point that I would come here again for dinner anytime soon. The kimchi mac and cheese was quite good, although it was a bit too salty. The halibut ceviche was overpoweringly sour, but I liked that it came with taro chips. The best thing at our table was probably the cheeseburger.\nThis place wouldn't be one of my \"go-to\" places, but I would be willing to come here again for drinks.", "author": "Christina W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-02", "description": "Great drinks spot for dates or just catching up with friends. I love the mezcal drink (Sun Country). I've actually had food here which ranged from good/fine to wow I surprisingly really love their burger.", "author": "Sophia L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-02", "description": "I came for brunch and it was fairly quite around 1:30ish on a Saturday. We were able to sit in the outside area (it's really inside, but with plenty of greenery and sunshine). Our waitress was very friendly and nice, but I think it was only her working so it would take a while for most things. We got:\n\nMimosa: Heavier on the champagne : OJ ratio, just the way I like it! Lots of bubblies and refreshing good flavor!\n\nKale salad: My friend loved this--it's not massaged kale, so it's crispier. The veggies looked very fresh and tasty, but my friend said that he thought the dressing was a tad too salty from the pecorino cheese.\n\nBacon side: Very salty, but ultra crispy and delicious! I actually prefer my bacon less crispy, but it got many compliments from our neighbors around us.\n\nTrout scramble: The eggs were done nice and soft, and the trout actually tasted more like smoked salmon--not that I was complaining. It was a very tasty dish and the rye bread sopped up all the juices after I was done. Absolutely amazing! \n\nOverall, Horsefeather is a unique, nice spot for brunch, but just make sure you are patient as they are a bit understaffed.", "author": "Monica L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-08", "description": "I rarely feel impressed by brunch. They can look beautiful but the taste is usually just meh. The trout scramble at Horsefeather however is so delicious that I'm still thinking about it sometimes. Damn, I'm hungry and it's almost 10pm right now.", "author": "Novalina N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-23", "description": "Came here for cocktails with friends that were in town from LA.  It was really hot out and I feel like the inside area was too warm.  There's a patio-like area in front that would be super cute to sit in, but it was packed.  \n\nAnyway, cocktails were really good. I'll definitely come back for food.  Some people sitting at a nearby table told the cheeseburgers were some of the best they ever had.  I'm sold.", "author": "Jessica F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-16", "description": "Horsefeather is unnecessarily loud and crowded, but it's fun and they have decent drinks (and reportedly a pretty damn good burger). Also a pretty unique looking spot. \n\nThere's a cool atrium-type enclosed patio area with heaters; recommend trying to grab a spot here because it gets incredibly loud and crowded in the main bar and seating area. \n\nCocktail program is good, but nowhere near elite. Fun place to meet a few people if you can grab a spot. Servers are not all that friendly so do what you will with that info.", "author": "Nik G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-12", "description": "Ended up here when Barvale had an interminable waiting period, and it was a nice consolation.  \n\nTheir food menu is pretty sparse, just a handful of items but fairly diverse.  I ended up having their cheeseburger which was solid, nothing extraordinary but quite good, like a gourmet Big Mac :) The cocktails looked good but I was not drinking that night, so can't speak for them but if they were on par with the food, I am sure they would be solid too.\n\nService was about what you'd expect.  \n\nWould return here to try the drinks, and it's a nice addition to the Divis strip.", "author": "Saminda W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-29", "description": "I had such a good cocktail experience at Horsefeather about a month ago so I decided to come again to try the food! I wasn't disappointed! \n\nI ordered the same Strawberry Hill cocktail.... guys, it's still really good. My friend and I split the kale salad and the double cheeseburger because, balance. The kale salad was super good, reminded me of how I cook kale at home... EVOO, Himalayan salt, lightly sautéed. Pumpkin seeds, apple slices, pomegranate seeds... a very fall dish. I really enjoyed the salad! The burger was very tasty as well! DOUBLE so it's definitely one to split- my friend and I added egg and avocado. The beef was juicy, the burger was saucy, the bread was toasted---- SO GOOD. Also they give you salt and vinegar chips no the side, we all need a break from fries every once and a while. The chips were nice since the burger was so heavy, I can't imagine having fries as well.\n\nSplitting 2 cocktails, kale salad, and burger with avocado and egg--- $35 each. Yes a little on the pricer side, you can probably find cheaper and just as good food/cocktails in the city but this place is good nonetheless. I do plan on coming back here again. \n\nVery impressed with Horsefeather!", "author": "Marcie A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-24", "description": "Man I just had the best burger ever!!! The service really kept it from the five star, our drinks and food were fantastic. Kimchi Mac and cheese and the burger were different than your usual versions but I would take them this way any day!!! The burger was on a sweet bun and very juicy. The kimchi was not strong and the cheese made a nice pair. My drink, \"cool breeze\" tasted just like what you would think a cool breeze would taste like. Head on over to this cute little place for drinks and food!", "author": "Linette S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-19", "description": "Really nice cocktails. Very loud by 8pm. The bar was pretty packed. The bar tenders were nice. The decor, like others have mentioned, it very cool. \n\nIt's super close to the Independent, which I'm sure lends itself to bigger crowds on show nights. \n\nThe food looked interesting, but did not have a chance to try it. I would recommend their drinks for sure.", "author": "Kari M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-10", "description": "If you're a fan of delicious hamburgers, great cocktails and a tight wine/beer program then look no further than Horsefeather. \n\nI'd visited this place many times before and had the awesome cocktails, but never ate until yesterday. I'd heard from friends that the burger was amazing so I figured that was the play. Guess what? Awesome. My friend had the chilquiles with carnitas and they were also delicious. Very surprised at the quality of food! \n\nBest part of the day though was their outside patio seating. It's tough to find a great patio in this city and the neighborhood only boasts a few others, so this is one of the better options in the area. Plus, it's protected by four walls and the wind is a non factor. \n\nMoral of the story, great patio brunch spot with solid food and drink!", "author": "Benjamin F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-14", "description": "I LOVED Horsefeather! A friend I shared two dishes for brunch. We decided on the double cheeseburger and chilaquiles. The burger was so juicy I had to ask for a lot of napkins. I don't think I've ever had such a juicy and tasty burger. The second dish was chilaquiles. This was another amazing meal. We cleared both plates. For our cocktails we both had the Blood Marys, and the flavor was delicious. The Bloodies has the perfect blend of spices and spiciness.", "author": "Danielle S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-04", "description": "Drinks were great and average priced.  Venue is a bit tight, but it seemed like everyone was out in the town.  We ordered the pulled pork tacos and I have to admit, it was pretty delicious!  3 tacos for $13 and I believe those were the cheapest items on the menu.\n\nFor drinks, I tasted the California Cooler and it was refreshing.  Next drink of consumption: Strawberry Hill- it was different, but quite delicious and very well presented.  If you like the bitter sweet taste, I'd highly recommend it.", "author": "Thuy V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-16", "description": "Wanted some after-dinner drinks\n\nWas surprised by how much they give you in the shaken/stirred. Almost too much of a good thing...\nWould have been perfect for a hot afternoon.\n\nGot the smoky Sun Country which had mezcal base. Wife got the rum-based Bahama mama.  Both well-made, but for the usual SF priciness \n\nNot a bad wait - walked up to bar and ordered/got drink pretty quickly.", "author": "Marshall Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-10-27", "description": "Jennifer L's review from 8/21 is spot on. SF prices are getting out of control, and you're definitely paying WAY more than you should. I came here with a group of 4, and between us, we had 5 beers, 1 cocktail, two pours of some sparkling rosè, and a poke to share. Total after tax, tip, and the SF health fee? $124. Damn. Service here was pretty slow as well, so I can't say that's enough to warrant additional stars. As I sat at the bar waiting for my drink, I couldn't help but laugh to myself on how the menu pretentiously claims I'm getting a \"well executed craft cocktails\". My drink was literally a shot poured into a glass over some ice, and stirred. Would I come here again? Probably not... Either I'm getting old, or I've become more stingy but there are cheaper ways to hang out with friends over alcohol.", "author": "Austin W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-29", "description": "We were having dinner nearby, so we came here for drinks first.  Even though parking in this area is always annoying and the streets were pretty crowded, there wasn't a wait around 5pm on a Sunday night.  We were able to grab the last 2 seats at the bar. \n\nWe only had time for one round of drinks. Our bartender put a lot of care into our drinks.  It was nice that she started us off with water without us having to ask.\n- Sly fox: bourbon based, interesting with the hint of 5 spice\n- Tiki peat: looks like a fruit punch, but not overly sweet since it's got some peaty scotch as a base \n\nThe food menu actually looked really good. The people next to use got some double cheeseburgers and a kimchee mac n cheese, and I was so tempted to get some food, but we were out of time.\n\nPrices are reasonable, and I like the set up they have there. I will definitely come back next time I'm in the area.", "author": "Marilyn T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-26", "description": "I can't even begin to tell you how happy I am to have found this hidden little gem. I work off of Divisadero Street, and in the evening. After a typical evening shift of using my brain to critical think, my stomach is always looking for a good fix after work. With that being said, anything open after 1130pm is on my radar. Instead of grabbing a usual taco or burrito in the Mission, the other night a friend and I decided to try Horsefeather. Once again an item bookmarked on my yelp list since late last year. Upon scrolling through the yelp pictures even the drinks alone sounded mouthwatering. The Cooler for example had horseradish listed as one of its ingredients. Who does that? I'm a fan of horseradish in general... I've had it on prime rib, I've had horseradish cheese, but I'm my alcohol... yes please! The food, the drinks and service and exceptional.", "author": "Janelle D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-30", "description": "Where do you go in the middle of the night when you're really hungry? Horsefeathers would be a very good choice if you're not dragging children along. The food was most excellent the service was very nice. I was really surprised by how good the food was. We just had a hamburger. Which sounds like a simple thing. But a really good burger is a delightful experience. And this was right down to the last bite.", "author": "Terra K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-05", "description": "Stopped by for some cocktails with the BF before getting our game on down the street at Emporium. I got the Matilda Bay cocktail - gin, manzanilla sherry, kiwi-ginger gastrique and lemon. Delicious and refreshing. The place was packed and the food looked good too.", "author": "Elaine N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-07-31", "description": "Had the poke and the cheeseburger, with a beer and a Sly Fox cocktail. Food was good, better than average I'd say, but the service was incredibly slow. Took 25 mins for our table of 2 to be served waters.", "author": "Julia O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-10", "description": "We are lucky this restaurant is in our neighborhood. Such a good gem to have nearby. They have very nice craft cocktails !! My hubby ordered a drink called Mistic, which has tequila, ancho verde, grapefruit, lime and brown rice. Such an interesting combination but it works. He had couple of them there .  We also ordered few pull pork tacos and halibut ceviche. Food was delicious and fresh. I love  how they served taro chips with the halibut ceviche in lieu of regular chips. My lemonade was served with sprinkling soda to add an extra layer to a normal lemonade. The restaurant has a very good vibes. There are people hanging out drinking and some like us sit down at a table for some food and drinks.  It's a very nice hangout place on a Sunday afternoon.", "author": "Becky K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-02", "description": "Drink review: came here for a quick drink last week and loved it. It was a really nice day so we sat on the front patio and pretty much had the place to ourselves for an hour. We ordered their strawberry drink which was super good. Other people were ordering food and it looked bomb! I'll definitely be back to try the fried chicken as a ton of people were ordering it. Great place to have a quick drink and people watch.", "author": "Mira B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-11", "description": "This place was great! Cute restaurant with a retro/modern feel! I ordered the Swedish meatballs and they were amazing!", "author": "Taylor P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-02-26", "description": "Came here on a lazy Sunday afternoon looking for something new to try.  Had always walked by and the place was always closed.\n\nCame in the late afternoon.  The place has a sunny atrium which is quite cozy on a sunny day.  Inside is quite dark and where you will find the bar.\n\nDisappointed that I saw a full menu outside but found they only served a limited brunch menu.  So are they a bar or a restaurant?\n\nWe ordered a Crab scramble and a breakfast burrito.  I had a coffee while my colleague had an alcoholic beverage and I had a coffee.  The food came fairly quickly and both dishes were really tasty.  I wasn't offered refills fir coffee though.  My waitress was also the part-time bartender and very friendly.  \n\nI'd definitely come back to experience more of the menu.", "author": "Erik H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-08-21", "description": "What the what. Whyyyyy did I pay $95 for four drinks total?! And one snack???? Ugh, SF prices and restaurant/bars who abuse these rising costs make me so mad sometimes. \n\nOkay, listen. I'm all about wonderfully mastered speciality drinks. I truly am. But really? The prices here are outrageous. Staff was nice-ish, but short with my friend and I. I asked a few drinks about some drinks and the waitress gave a quick, uninterested suggestion. She never came back to ask how my drink was (wasn't good). \n\nFor the price of the drinks here, I'm expecting a whole lot more engagement from the staff, and more well crafted cocktails. Both of which, I did not receive. Would not come back for the price I paid. 2 stars.", "author": "Jennifer L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-10", "description": "Love the ambiance and scene here. Hipster luxury. Brunch menu options were very enticing. \n\nThe melon dish didn't quite deliver. The curried raisins were overpowering.\n\nBut looking at the burger at the table next to me made me drool and I will go back.", "author": "Andrew K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-23", "description": "Good place but the music is waaaay too loud. The cocktails are expensive and it's difficult to get a seat. I'm not sure what the hype about this place is. 5 stars if I had stumbled on it but I'm only giving 4 because it was hyped up so much and it really wasn't as great as made out", "author": "Alva C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-03", "description": "Stumbled into Horse Feather on the last day of our trip to San Francisco.  One of the highlights of our whole weekend.\n\nWe started with Bloody Mary's, delicious but on the spicy side.  Would definitely recommend.  Also had the breakfast sandwich, was able to share it and it was very filling.\n\nAlso had a old Cuban and another cocktail that was very refreshing with cucumber and mint essence.  Our bartender was Dzu, he was very welcoming and hospitable.  We would have continued ordering cocktails had he not ended his shift.  We knew we needed to get out to explore other places but would recommend Horse Feather to anyone looking for a unique place to eat and enjoy a good drink.", "author": "Jessica M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-08-01", "description": "Drinks are pretty good, food is way expensive for what it's worth at least for dinner.", "author": "Ricky S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-15", "description": "had a great first experience at Horsefeather.  We showed early (630) and were sat immediately.  the place is really comfortable, nice decorations, everything seemed tasteful but casual as well.  service was quick (a lot of others wrote about slow service, maybe because it wasnt very busy?)  nice options for cocktails and beers.  we had the blackjack and california cooler.  complete opposite styles and both were tasty.  \n\nthey were doing a pre fixe or down sized menu choices (valentines day) and were down to change to the pork tacos to a vegan style.  they used some sauteed and grilled mushrooms and the tacos were delicious.  we were really impressed.  the kale salad was also well done.  and to top it off I pulled an idiot move, knocked my cocktail over.  broke the glass and spilled what was remaining and they replaced it at no charge!\n\nwe will be returning.", "author": "Mike O."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-02-01", "description": "Too slow and staff extremely rude. They couldn't care less about making us feel welcome. The first waitress was good albeit slow. The last one however was very rude and she looked kind of irritated by us. \nWe protested by leaving a small tip and she questioned us for leaving a small tip. When we explained that service was sub par, she left mumbling something. \nThey charge 20% gratuity to charge 4 cards. Ridiculous!!", "author": "Nityananda J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-24", "description": "Checked out a show at the Independent over the weekend and decided to pop into Horsefeather. The ambiance was cool. I personally liked the decoration and overall theme of the bar/restaurant. On arrival the restaurant was packed. 20 minute wait for a small of 4. Not to bad. The cocktail menu had good variety. Friends ordered cocktails ( I happily sampled). The California Cooler was the most memorable. My glass of pinot was average for the price point. With little time to eat we stuck to appetizers. \n\nI ordered the Halibut ceviche and was completely let down. Words of caution, the ceviche was completely over salted. I couldn't bare the taste after a few bites and stuck to my glass of wine. This restaurant has a lot of potential. I may stop in again for drinks but unsure I want to risk the chance of sub-par food.", "author": "Ralph A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-04", "description": "Came here for dinner on a Saturday night around 9. We had to wait a little while for a table, but it was worth the wait. I got the little gem salad with fried chicken and am still dreaming about it weeks later. Does the salad cancel out the fried chicken, or does the fried chicken cancel out the salad? Still pondering this one.\n\nSince this is a bar/restaurant, it's pretty dark and noisy, but the design of the space is beautiful. Will be back!", "author": "Emily F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-22", "description": "Horsefeather joins cool kids Nopa and Bi-Rite on the DivCo corridor. And they're all on the same block! \n\n* real estate prices on this street just went up 100% *\n\nZiryab is long gone but Horsefeather is a MUCH needed neighborhood bar that's not divy like Madrone on the corner. Horsefeather is still approachable, but the look is definitely polished and a little vintage. From the wood paneling on the gorgeous bar, intricate glassware and the dog friendly atrium-style patio, which I imagine, is THE spot to be during brunch on weekends.\n\nThe cocktail menu is as interesting as can be expected from the guys of Future Bars. In house syrups, seasonal ingredients and unusual flavor combos (celery juice & horseradish in the California Cooler?) will surely lure you in. \n\nSince we came in for drinks post Nopa, I limited myself to one cocktail. I made sure to choose the Strawberry Hill. This cocktail goes down super easy and will remind you so much of summer. I'm surprised that in the middle of winter, I can taste ripe berries and get the fresh citrus, along with a hint of gin. The black pepper provides an element of surprise. If I didn't have cocktails at Nopa, I can easily drink 3 of these ... before dinner.\n\nMad Dog is another great choice. The blended scotch is softened up by the port wine hibiscus syrup. The floral notes doesn't dominate and blends nicely with the orange scent. Fabulous night cap!\n\nI'm rediscovering my love for the DivCo corridor and I can see myself hanging out here post Nopa/Souvla/4505 meats or before spending serious $$$ for groceries at Bi-Rite. You'll have to stop in, the sweet, personable staff makes it hard not to.", "author": "Janice C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-22", "description": "What a great find! We stopped in for a late brunch before walking to Alamo Park. The drink menu was great and I enjoyed the Matilda Day as a gin lover. The breakfast sandwich was delicious and the tater tots were AMAZING. It was a little dark inside since there was no available seating outside near the sun so I felt a bit like a vampire. But the ambiance overall was very cool. The girls on staff were very kind and we enjoyed a casual, no rush meal. Also kudos for having nice and clean bathrooms!", "author": "Megan L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-15", "description": "Impressive service and cocktails. We will return to try the food. Better for groups of 2-4 people. Hip spot.", "author": "Vicki L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-15", "description": "Awesome neighborhood bar. Love the heated patio during cold winter nights (it does get a little too warm though, IMO). \nCame on a Friday night for a late dinner date. So glad they serve food later than most places. Cocktails are delicious. \nThe fried chicken was really good, crispy and well seasoned. Did not expect the Brussels sprouts/greens on the side to be a stand-out!", "author": "Ashley L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-01", "description": "Beautifully balanced cocktails and friendly bartender. Horsefeather was a great atmosphere in the front area where you get the sun but don't have to sit outside if it's windy or a little chilly. Other restaurant goers sometimes bring their pets which is a great little addition. The sly fox was delicious and the wait staff is very friendly and extremely helpful.", "author": "Richard P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-02", "description": "We got the ceviche with taro chops which was very good (love those chips). My favorite was the tuna poke bowl, the flavor and seasoning was on point", "author": "Morgyn T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-23", "description": "This place is awesome! The food here is great along with the drinks. Average prices, but the venue is pretty cool. \n\nNot much else to say, I would just come here if you can!", "author": "James D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-08", "description": "The outside her is adorable. Cocktails are delicious and waitstaff is friendly. What more could you ask for?!\n\nI didn't have any food sooo can't speak for it but definitely worth checking out.", "author": "Jennifer A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-21", "description": "The burger is to die for. Great spot for dinner or drinks with friends in Lower Haight.", "author": "Tess H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-23", "description": "My girlfriends and I do a ladies brunch every month or so. On Saturday, April 15th, my group of eight gathered for brunch at Horsefeather. They don't take reservations, so the plan was to meet at 11am. I arrived around 11:15am. Three in our party were already there, so we managed to grab a table for eight and everyone just filtered in afterwards. It wasn't very busy at the time.\n\n*Foraged Mushroom Scramble: with goat cheese, bagna caudo, brussel sprouts, toast ($15), add Bacon (+$3)\n*Chilaquiles: with two eggs over easy, salsa rojo y verde, cheese, avocado ($16), add Carnitas (+$3) x2\n*Breakfast Burrito: with housemade chorizo, home fries, scrambled eggs, cheese, arbol salsa ($15)\n*Pozole and Slow Cooked Eggs: with chili verde, tomatillo, hominy, curtido, avocado, tortillas ($16) x2\n*Almond Flour Waffles: with strawberry cream cheese, maple syrup, macerated berries ($14) x2\n*Kale Salad: percorino dressing, fuji apples, pomegranate, candied walnuts, avocado, cotija cheese ($14)\n*Halibut Ceviche: with charmoula, avocado, cucumber, tortilla chips ($16)\n*Double Cheeseburger: a blend of chuck, shortrib, brisket, housemade bun, special sauce, smoked onion, lettuce, beer chips ($16), add House Bacon ($3)\n*Sergeant Major: rye, cold brew, vanilla almond milk, maple syrup ($11)\n*Bloody Mary: tomato, horseradish, dijon, grapefruit, worcestershire, dill, garlic ($11)\n*Arrowhead: cocchi americano, grapefruit juice, diplomatico, bitter lemon soda ($12)\n*California Cooler: gin, celery juice, lime, thyme sauvignon blanc syrup and sparkling wine ($11) x3\n*Red Rooster: aperol, brown sugar, ancho reyes, pineapple riesling syrup and soda water ($12) x3\n*Sightglass Coffee: bottomless ($4) x5\n*Bailly Lapierre Brut, Sparkling Cremant: Burgundy, France ($11 glass) x2\n\nWe basically ordered the whole brunch menu. My favorite was the mushroom scramble. So savory and cheesy. And I adore mushrooms! The halibut ceviche was also very tasty. A nice fresh contrast to all the heavy breakfast food we ordered. Another favorite was the burger, but I didn't try it. My group loves bacon, but they don't offer it as a side, so we just added bacon to a couple dishes and asked that it be on the side. It's only two pieces as an add on, so order accordingly. I wasn't in the mood for cocktails, so I stuck to bubbly, but everyone seemed to enjoy their drinks.\n\nFun place for brunch. I always like trying new spots. (Well, new to me anyways.) And if you come with a bunch of people, you can basically try the whole menu. A great way to spend the afternoon with good company.", "author": "Elena N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-07", "description": "Friday night: excellent vibe, not too crowded. The bouncer does a good job at keeping things cool. Dark but refreshing atmosphere great music. Bartenders are highly-skilled masters of their craft. Even if you can't decide on something off the exciting menu, the bartenders will make you something special based on your preferences. \nI didn't have the food but I'll definitely be back to try everything!", "author": "David P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-20", "description": "This is one of my favorite bars on divis. The vibe is super cool. The front patio room is a nice place to sit when it's sunny out. The main area of the restaurant gets pretty dark but it has a nice feel to it if you're there at night. I've never had a bad drink here and the food is bomb. Great chicken and mac n cheese.", "author": "Kara J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-05", "description": "Great place!\nThe Cocktails are always surprising me! The wine list is small but terribly efficient, old world/ New world, you have good options!\nThe food is really good too! A delicious mixe of different inspirations. I'm usually going there for a drink and finally ending up having diner there too! One of my favorite place on divisadero!", "author": "Geraldine F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-20", "description": "Nice place to grab a drink. They had a small but good cocktail menu. The bartender seemed very knowledgeable about any drink you might want. The food was good. I had the kale salad with fried chicken. One of the better kale salads I've had. Would come here again with a friend.", "author": "Ian C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-10-07", "description": "I introduced several friends to this restaurant by bringing them there. \nFood is decent and most of my friends (myself included) do not mind the over priced items, including the $17 poke bowl.\n\nBut the service sucks - without fail.\nIt's definitely disappointing as this was my old neighborhood & I'm just delighted to see another nice-decor food place. \n\nThe servers - different women when we went lacked basic courtesy - obvious in their lack of manners. Their tones of voice tell you they can't care less.\nThey dress fun and pleasant but definitely do not have the \"pleasant\" welcoming manners that I come to expect servers.\n\nOne of the several examples of my experience @ Horsefeather:\nWhen one of the servers got confused about our order (e.g. 1 dish each person or 1 dish to share... ,etc.) her chosen spoken words, tone of voice & facial expression blamed us for confusing her. While that's not to the degree of \"bullying\", we did feel uncomfortable and \"unwelcomed\" at this establishment.\n\nWhile I as usual tipped 20%, I feel compelled to write my 2nd-ever Yelp review.\nWhy 1-star? Because while the food was pretty decent, the music was too loud (during the day /lunch as well as in the evening /dinner) and again the staff who didn't seem to care at all with their lack of service-oriented manners (a training issue ?) and attitude (a personality issue?) time and again has now prevented me from going there anymore. \n\nI am curious what the criteria are in hiring servers at this place?", "author": "Y L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-06-12", "description": "The food was tasty but the cocktails fell short - not as spirit forward as we'd hoped. \n\nWe ordered the Kale Salad and added the fried chicken which was AMAZING. And we also split the kimchi mac and cheese (skipped the egg on top) and that was quite good as well. \n\nWe ordered the Golden and the Sly Fox for our first round of cocktails, and the Cisco and the Tiki Peat for our second round. \n\nThe Sly Fox tasted herbal and watery which was a bit disappointing. The Golden was herbal as well because of the genmaicha but remained complex and interesting. The Cisco had way too much campari and the Tiki Peat tasted like the Hawaiian Punch you can buy at the store but with a little alcohol. \n\nOverall, we'd come back for the food but order beer next time.", "author": "Britta T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-29", "description": "This bar has such a cool vibe. We grabbed a quick nosh of the tacos and kicked them back with a refreshing cocktail. Definitely inventive with a decor that reminds me of Alice Water's restaurant Chez Panisse meets a smaller version of NoMad in NYC. Throw in some Tiffany glass and it would be perfect.", "author": "Kevin J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-26", "description": "I had the fried chicken with corn bread and and corn. The chicken was well fried, and savory(a little too much salt). But the additional sweet sauce and sweet side dishes over powered the savory chicken, causing it to lose the balance it needed to wow me. I would definitely recommend changing the sauce on the chicken and reducing the salt. I would surely go back and try other dishes! The waitress we had was so nice :)", "author": "Joy A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-30", "description": "After seeing a show at The Independent, my boyfriend and I decided to pop in here for a drink. We noticed that yelp had them labeled as one of the top cocktail bars in SF. They absolutely did not disappoint. Our bartender was amazing and extremely friendly. We ordered a Corpse Reviver & am Old Fashioned. 100% can say they were the best cocktails we've ever had. They were perfectly flavorful and delicious. We also ordered the poke, which was phenomenal. Horse feather is a place I will be recommending to every person I know visiting the area!", "author": "Kierstyn J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-26", "description": "Really pleasant place for good drinks -- not cheap. Our party of three felt like just about the only table that wasn't a date.", "author": "Carl B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-07", "description": "Fantastic and friendly service, creative and top notch cocktails. A great selection of small bites and good vibes all around.", "author": "Terrence J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-18", "description": "Hayes Valley - aka Hip AF Valley (pure speculation, I'm an out of town visitor); thanks for having us and also thanks for the food. Horsefeather has everything you want: menus that have cool handrawn arrows on them, a nice cocktail program, beautiful plating, and a very friendly waitstaff. We came and ordered the pancakes and the hash.\n\nSounds pretty basic, eh? Guess what - WAS NOT. Cheesecurd pancakes with sweet saltanas, savory Fernet nibs, and creme fresh. While a stack seemed like a tall order, it was just right. They came with a side of maple syrup, but honestly - not even needed.\n\nPastrami hash - zomg, beautiful. Not your grandma's mess of heavy regretful meats and potatoes - but a beautiful light mixture of onions and light servings of meat + a very runny egg. \n\n(I'm regrettably lactose intolerant so I did NOT get the burger but OH MY GOD I will come back for it - looked AMAZING).\n\nWashed down brunch with some beers and left feeling - good (which is a rare occasion when doing brunch in general). Usually I bounce out of brunch and straight to bed. Definitely coming back for lunch or dinner!", "author": "Leisha B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-30", "description": "A friend of mine who works in PR (Bread & Butter) found out about this place through work and I made her take me here just based on a photo of one of their cocktails. \nI can't believe I didn't know about this place before! The ambiance was great, although the restaurant is little small, it was packed. The drinks were amazing, but took a little while to come out. Totally worth the wait though. I got the Cool Breeze and I probably could have drank 5 more of them, they were so good.\nAt first I was a little hesitant about the menu because it was rather small. But man, if you can make food that well, you really don't need to put more items on the menu. The food was AMAZING. I got the double cheeseburger and it was perfectly cooked with a ton of melted cheese. My friends got the poke bowl, kimchi mac & cheese and the fried chicken. Everything was superb. I highly recommend checking this place out if you haven't before, I will be coming back for more of the fried chicken!", "author": "Elisha I."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-28", "description": "Pleasantly surprised!\n\nHip vibes and super cute outdoor patio. Caught myself turning to look around at the succulents on the wall and people watching a lot during my meal. \n\nCame in on a Saturday for brunch and didn't have to wait. I think this is one of those hidden spots people don't quite know of yet. So keep it on the DL! \n\nOrdered the pastrami hash - honestly I didn't know exactly what I was eating on every bite because there was a lot going on! Lots of flavors and textures but it all worked together very well. Looks like a small portion but I was surprisingly full afterwards. \n\nWould come back! And so thankful to have found parking a block down here with no meter or time limits! Yessss", "author": "Carissa G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-10", "description": "Was a little skeptical when my friend suggested we come for brunch because it's a bar, but WOW the food was amazing!! 4 of us shared the trout scramble, breakfast sandwich, chilaquiles and kale salad. All 4 were great, and my favourites were the trout scramble and breakfast sandwich -- amazing flavours and textures! \nI'll definitely be back. The table next to us ordered the burger, which looked so good -- I'll have to try that next time!", "author": "Rachel L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-17", "description": "Their brunch menu was lite, but the food was great and perfectly portioned. I had the Mushroom Toast and my husband had the burger. We enjoyed the burger, the meat blend with short rib made it really good. The mushroom toast blew it out of the water though! My husband was so excited when I let him finish the last few bites. So much flavor! It was slightly sweet with the caramelized onions which went great with a the California Cooler which was slightly salty from the celery juice. \n\nDefinitely a great spot for a reasonably priced fancy cocktail and/or for brunch!", "author": "Tara J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-05-12", "description": "I'm horribly guilty of reacting too quickly and with my emotions. Last week, I got into a fight with a friend over something stupid (isn't this always the case?)\n\nThe hormone-charged, keyboard warrior in me wanted to send a text message to rip him a new one (or two) and end the friendship. So, I sent the text....to myself. I kept myself busy and the next day, I looked back at the text message. \n\nEgg on my face. How foolish of me - there's more important things in this world like Rob Kardashian and Blac Chyna's baby-to-be. Geez, it's been like 3 months?! That is one smart girl. *Cha-ching*\n\nOk, I know...who the phuck cares? \n\nI read that Horsefeather was one of the most highly anticipated bar openings in 2016 (from former Bourbon & Branch, Local Edition, Foreign Cinema, and Blue Plate employees). At the time, I bought into the hype so I waited for a week to mill things over. \n\nThe conclusion? \n\nHorsefeather's cocktails and the app that we sampled were mediocre for San Francisco standards (sounded better on paper). Absolutely nothing wrong with that but true to what they're going for, it's more of a neighborhood bar. Even then, my favorite neighborhood bar: Holy Water in Bernal Heights has much superior craft cocktails: https://www.yelp.com/biz/holy-water-san-francisco. \n\nOn the cocktail front, Horsefeather have 10 cocktails on their menu divided by stirred and shaken. They're reasonably priced at $10-$12. \n\nFor my first cocktail, I tried the California Cooler - Celery juice, lime, thyme, sauvignon blanc, horseradish, sparkling wine, gin ($10): http://bit.ly/27gSByR. It was really refreshing but reminded me of a boozy juice detox drink. \n\nThe next cocktail I tried was the Sun Country - Lemon, vanilla, orange juice, chardonnay, mandarin napoleon, egg white, mezcal ($12): http://bit.ly/1UVYEnz. I love egg whites in my cocktails a la pisco sour and a gin fizz and this is the first time I've seen it served with ice. The ice cubes took away from the otherwise creamy egg white foam and the cocktail wasn't very well balanced. I had to force myself to finish this before we left. \n\nI tried a sip of my friend's Strawberry Hill - Strawberry, lemon juice, red wine, black pepper, cinnamon, gin ($10): http://bit.ly/24OdnUl which fared better than the cocktails I had ordered; refreshing and fruity with a nice kick from the black pepper.\n\nFor food, there's 9 items on the menu ($10-$16): quinoa salad, beet salad, spicy ravioli, halibut curry, pulled pork tacos, ceviche, chicken wings, burger, and fried chicken. The kitchen closes at 1 am. \n\nSince we had dinner reservations elsewhere, we only ordered the \"Claypot\" Chicken Wings w/ fish sauce, caramel, fried garlic, ginger, jalapeño, cilantro ($11): http://bit.ly/1OlfnPW. This was basically Chinese soy sauce chicken wings (similar to what you get at a Chinese deli) but with a hit of pungent saltiness from the fish sauce. I think I would have enjoyed it more had I not made a batch at home just days before. \n\nService was cordial but lacked that warm, neighborhood feel. There was only one server and bartender at the time so it did take some time for us to receive our drinks. \n\nSit at the enclosed front patio area as there's lots of natural light coming in and it's great for people watching. It's also dog-friendly (front patio only) which is a big plus. The bar area and the tables in the back area were stark and dark.\n\nParking wasn't an issue since we came for pre-dinner drinks at 5 pm but good luck after that. \n\nI know everyone is sick and tired of hearing about the Kardashian clan but am I the only one highly anticipating the name of Rob and Blac Chyna's future baby?\n\nI just hope it's not related to a compass....", "author": "Cherylynn N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-03-15", "description": "This place is the worst. I was rushing past a huge group of people to get out to get my cousin who was kicked out. When I returned I was told I wasn't allowed back in because I touched some girl with white hair that works there. Ha ha ha sorry basic girl I am not interested in anyone except my wife. All my friends thought I got in a fight cause that would be more my style. Obviously they singled me out not only because I was a minority but also because I'm gay. I was there the night before without any issues. If I looked like a basic gothere wouldn't be an issue but because I looked like a super lesbo I guess I am a predator. I have never had this issue and I'm sure I never will again. It's a sad day to see how this place is nothing but a bigotry establishment! Never in my entire existence have I have been accused of touching anyone inappropriately boy or basic girl.\n\nUPDATE 3/16/18  *A Feather For My Thoughts**\n\nI read how the business owner responded to this review and couldn't help but be offended and embarrassed for its blatant lack of any responsibility and failure to even vaguely address my review. As a business owner you really need to pay a little more attention to the words written. First off your generalization of how you normally would care, or normally would reach out to a genuine concern experienced by a patron pretty much reaffirms your bigotry. Lezzz be honest if I looked more feminine, or my skin was a lighter shade we both know it would have never been an issue for me to bump into a few people or push them to the side of the bar because I was distressed after learning my little cousin had been kicked out of your establishment and was intoxicated out in the middle of the street in a city he was not familiar with and did not even have his wallet. Firstly, I will admit I am sure I was probably rude and in a hurry to go make sure my cousin was ok. Even though it was apparent he was with my party in your establishment(mainly because we were the only people of color in the bar) you failed to let us know you had kicked him out because you felt he was too intoxicated. I admit I would have been upset but I still would have respected that you had the decency to let me know. So when I raced out to go check on him(without my phone, wallet, hoodie, or jacket) I have to admit I found your lack of concern and empathy extremely concerning, for any of your patrons. You kicked someone out of your bar extremely intoxicated without notifying his party, then when I became upset and ran out of the bar, you kicked me out and made false claims I inappropriately touched one of your staff. I have never and would never touch someone or grope them inappropriately, especially not in your bar. There is a huge difference between pushing by someone, and grabbing them or sexually groping them like you are accusing. I see that you are quick to casually be judge, jury and executioner in this half assed response to my review by claiming you have witnesses. Well quite frankly I had witnesses too and not a single one of them said that I inappropriately touched Malfoy, here's a little learning moment for the community, just because I look GAY and am GAY, does not mean I must want you.  You even overcharged us and illegally charged us for drinks we didn't have, probably thinking we were too drunk to notice. Just an FYI, this drunk/gay/brown woman checks her statement, and AMEX was just a phone call away. \nSan Francisco used to be a city of diversity, welcoming attitudes towards differing cultures and backgrounds, and that inclusive feeling of even though we are all different we are all in it together. Now as we begin to see the domination of $$ over ethics, assumptions over questions, and a general \"it's all about me\" attitude I can't help but think that this is a microcosm for everything that's wrong with America right now. Your treatment of a minority/lesbian woman regarding sexual conduct is unacceptable, your response to my review is condescending and unacceptable. So, in closing Horsefeather is everything that is ugly and wrong with San Francisco and our country as a whole. You might as well start selling hats that say, HORSE FEATHER, make America Straight and White again! Maybe you could put up a few Trump posters up in the front window and really let the neighborhood know your true political ideals. \n\nCHEERS \nYOUR FAVORITE LOCAL GAY aka HORSE OF A DIFFERENT FEATHER!", "author": "Eisa m."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-08", "description": "The food and service were wonderful. The beer list and food menu are small but mighty. Fabulous spare rib, brisket and chuck cheeseburger on a sweet potato bun. Pickles are made on prem and were spicy and very tasty. Potato chips were also great.", "author": "Geri B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-08", "description": "Nice location, beautiful bar and restaurant, but pricey. They have good beer and I tried the chilaquiles, which were good, and it's not easy to find good chilaquiles! The outdoors patio is really nice for days with good weather. But as I said, expensive, $15 for the chilaquiles (jeez if you think what chilaquiles really are and where they come from), beer was good.", "author": "Martino P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-05", "description": "My friend and I stopped by for a drink before dinner, and wow this place was packed! Luckily, we were able to grab a table so we could sit and enjoy our cocktails. The bar tenders and staff were very friendly. \n\nI had the Cool Breeze, and it was so delicious! It was very citrus-y with a hint of herbiness. My friend had the California Cooler, which was more earthy and \"robust.\" The cocktails were so, so pretty! \n\nI hope to come back soon to try out more of their drinks and the food.", "author": "Doris K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-07", "description": "Came here for drinks after brunch with a girlfriend. This place is super cute! I love the rustic decor in the front area with the plants and glass windows, feels like a green house. The bar area is also cute. Their cocktails are unique and refreshing, I enjoyed the two that I had. Would totally recommend and return!", "author": "Marie D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-20", "description": "I went with a coworker while in the area for work. It's a small place with dark features and lighting. Very sleek. There's an outdoor area, almost pseudo patio, that was full when we got there around 7. We were sat immediately and after surveying the menu, we decided to just get a drink there instead of eating. The menu felt limited and we didn't see anything that stood out to us, but there were lots of people there who were loving it! I ordered the strawberry hill cocktail and it was delicious. So flavorful.", "author": "Mollie S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-30", "description": "Was hanging out with my friends here and had a great time. Each of us ordered a drink most of us like it (so bad I forgot the name of the drink I ordered). Would like to come back next time. \n\nMinus one star for the long wait.", "author": "Beth G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-15", "description": "This place was actually pretty good! The ambiance is really cute. My mom and I had their ceviche, beet/arugula salad, and lasagna. They were all great and the perfect amount to share. The ceviche was the big winner for me but again, all super amazing. Their specialty cocktails were also yummy and unique as well, but I've had better ones in the city - my favorite cocktail spot is Alembic. But we had a great time and I would certainly return!", "author": "Jenny M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-04", "description": "I met with a colleague here a couple days ago and it's FANTASTIC. I absolutely love the vibe and the space, it's relaxed and beautiful and the staff is so personable! They knew my colleague by name and checked in with us often to see how we were doing and if we needed anything. The food is phenomenal! I had the poke` bowl, and was not disappointed. I am not from San Francisco, but next time I'm in the city I will definitely be coming back.", "author": "Jeri A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-09", "description": "Great cocktails... and really good fried chicken (probably one of my favorites in the city!).", "author": "Rosie C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-06-19", "description": "TL;DR - Amazing drinks, tasty (albeit slightly overly salty) food, and slow service. Definitely check out the drink menu and stick around for the food if you don't mind slower/distant service.\n\nWe went here on a Friday with a huge group to try all the noms and drinks Horsefeather has to offer. I mean, it has to be good right? Being from the same branch as Foreign Cinema (one of my all time fave places to eat).\n\nSetting- Almost a hole in the wall-ish vibe with minimal seating inside. There are indoor and outdoor seating areas but none of them will really accommodate groups bigger than 4-5. \n\nDrinks- All amazing. I had 2-3 and they were super creative and fun.\n\nFood- Pretty tasty, imagine Foreign Cinema but more bar-ish. Between everyone in the group, we tried all the dishes. Everyone loved the burger and the agnolotti. Note, I would pass on the chicken because I think there was a bit too much garlic or onion in the slaw for me. \n\nService- Yikes. This is where it kinda went downhill. We did have a pretty big group and without the organized seating, we were spread out around the bar area. We each ordered separately (but with the same tab) and things got strange. The servers were kind of rude when taking additional orders. The orders came out SLOWLY. I mean, we waited a good 30 minutes between getting each order for the two of us. In the end, we ordered a dessert and after 30 minutes, we asked the bartender(because we sat at the bar) if the order was going to take much longer because we had to leave soon. She came back and said that our server didn't even put in our order. The server came by and didn't even say sorry, she was just like oh, so do you want me to put it in then? I was irked because our group tab definitely went over 1K and she couldn't even feign a little remorse for not putting in a order? On the other hand, ALL the bartenders are AMAZING and on top of their game.", "author": "Crystal Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-17", "description": "Yum. I've been meaning to come here for a while. I had a California cooler (refreshing drink), fried chicken (soooo yummy and I am PICKY about my fried chicken.  It had Brussel sprouts lightly pan fried and hummus), and the kale salad (surprisingly warm, but tasty).  Really reasonable prices and great bar vibe. Will be back!", "author": "Deal G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-28", "description": "My friend and I came here for dinner, and we were seated within 30 minutes. I was hesitant between the burger and the poke bowl, and went for burger (naturally!) which was really good. \nWe had wine, not cocktails, but the cocktails looked great, seems good for next time!\nWhen you walk into the bar, it has an area that's much more well lit, but it's very loud there. We sat inside which was a lot quieter.\n\nI'd like to come back here just for drinks as well as it was a cool place.", "author": "Riham B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-07", "description": "I only had drinks at the bar, not food. I actually didnt know they serve food and I'm pretty sure they didnt at the late hour that I arrived. The bar was just super! Very well laid out and the place is super classy too! It was perfect for a late night date with a fancy cocktail at about $12 each. The mezcal cocktail was the best Ive had hands down. The service was also fantastic! They forgot about one of the drinks I ordered because it was busy and there were three different bar tenders taking different orders. So even though it came out only a little late, they comped it on the house. This was super nice and 10/10 will party here again", "author": "Kim P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-09", "description": "Eat here! Horsefeather's food is so tasty. The pork tacos are delicious, tender, fresh and simple. They are really quite perfect. The Tuna poke bowl and ceviche are also delish with nice clean, fresh flavors. \n\nMy first drink was the Cisco. I enjoyed it but the Campari gave it a distinctly medicinal flavor. I tried the night train which was smooth. It had a good espresso and cacao nose but the flavor was more branca menta. My friends had the Champipple and loved it. After my Cisco I asked for a Penicillin they didn't have ginger syrup so they couldn't make it but the bartender came out to my table and talked with me about alternatives and I ended up with a great lemony bourbon drink that I liked so much I sucked down 2 of in 40 minutes (stop it!).\n\nThe ambiance is great. It's pretty has interesting, Art Deco accents, has the perfect dim lighting that makes everyone look more attractive and artistic than they are IRL and brings some added life into the mix with live plants, reclaimed wooden walls and an atrium style room. My only decor complaint is the tables in the front section are extremely close, but we can call that added intimacy. \n\nI'm a huge fan. If you are looking for a delicious and unpretentious meal, savory, satisfying cocktail with great ambiance, horsefeather is your place!", "author": "Katie M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-05", "description": "Been here for both drinks and dinner. Their dinner is standout, and comparable to Nopa in taste. Cheaper than Nopa though. \n\nHighly recommend the fried chicken (must!) and pumpkin ravioli. Decent portions and price for the area.", "author": "Stephanie T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-02-10", "description": "Showed up at 1230 on a friday night with three friends.  Hoping to catch a drink and late snack before their kitchen closed.  Place wasn't full by any means.  We stood at the bar to order drinks and were ignored by all of the bartenders.  I think there were three.  Walked out and ended our night at NOPA.  \n\nFor all it's hopes of being a \"neighborhood bar,\" this place fails on that front.  I've lived in this 'hood since this place was a hookah bar. \n\nI wonder what'll be there next.", "author": "liz s."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-14", "description": "The fried chicken is soooo good! I came with a party and of four and we had their fried chicken, poki bowl, tacos, and  This place is so under rated. Their drinks are great and service is awesome. I'd come back and come early to avoid the wait.", "author": "A L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-08", "description": "We first were attracted to the aesthetic of Horsefeather while walking around Divis, and vowed to come back. Took us a while, but finally found an opportunity! We only had drinks here, so I can't speak for the food...but we were so pleasantly surprised by how innovative and tasty the drinks were! Often, we find cocktail spots to be a bit too experimental, but Horsefeather does a fantastic job in being creative yet keeping it real. I LOVED the Strawberry Hill.\n\nOnly downfall is that the space beyond the glass house is much less cool (aka more generic) than the exterior. And it gets a bit cramped because the space is pretty small. But makes for a fun, intimate time!", "author": "Lydia W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-11-11", "description": "The crab cakes were very crispy and delicious. The martini would have tasted better without the ice chips. Clean, nice ambiance. Justin is also super friendly and can share his knowledge of things all shaken or stirred.", "author": "Kimberly H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-23", "description": "I love this new place! The vibe, food, and drinks are all super hip, and it's a worthy contender amongst Divisidero St bars. I came here with a few friends one weekday evening. The bar was already full so we had to wait for a table to open up, but the waitresses were helpful with that. Both the sunroom and indoor sections of the restaurant are visually appealing.\n\nWe ordered drinks while we waited, and I settled on the California Cooler because I was in the mood for something refreshing. Delicious! My friends got the Nightrain cocktail which was tasty too. Perfectly strong and flavorful. Once we were seated, we ordered a few dishes. My favorite was the one I picked, which was the Beet Green Mascarpone Ravioli. SO GOOD. It was a decent amount of food for a light dinner, and the flavors were on point. Would recommend.\n\nI'll definitely be coming back here and introducing more friends to these awesome cocktails and food selections. I would get here earlier next time to grab a table, but then again I don't blame Horsefeather for being so popular!", "author": "Stefanie C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-01", "description": "The poke bowl was so yummy to eat, great drinks too! Very cool atmosphere loved the music played. Probably my favorite bar on Divisadaro.", "author": "Stephanie J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-10", "description": "Really nice bar. Was packed when we got there on a Saturday night, but still managed to get some standing space. My husband had the rye cocktail and I had the gin cocktail with basil. It was just fantastic. So refreshing!! The bartender was also very nice. Overall a great place to relax", "author": "Ashmita V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-30", "description": "Great cocktail spot either before or after going out.  My wife and I came here before a show at The Independent.  We had the Thunderbird based on our waitresses recommendation and it was perfect.\n\nGreat date spot with good drinks.", "author": "Blake B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-16", "description": "Lots of signature cocktails that's aren't over-priced (mostly $11), a wonderful convivial atmosphere, relatively quick service even when full (which seems to be its regular state) and finally, lots of small bites to nibble on with friends. A great place to meet a small group and enjoy frittering away the evening.", "author": "David A R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-15", "description": "This place is one of my favorite spots on Divis. The wide selection of food will make everyone happy. The drinks are inspirational and the bartender's are true artists. Can't go wrong with brunch or dinner!", "author": "John V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-10", "description": "This place has a swanky feel to it. With dim lighting and diverse music choices, it's a great place to bring friends. They overdid it with the tartness of my California Cooler but my poke bowl was exceptional.", "author": "Brittany S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-26", "description": "Came in last night for quick grub and drink. I had the cheeseburger, my friend had the tacos. The burger was dericious, but at $12 it was like a super duper mini. The bacon bacon burger was huge. My friend said the tacos were alright. \n\nI was glad to see my fave bartender is back from the now defunct tsk/tsk.", "author": "Pickle R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-29", "description": "We loved it here and so will you!\nHorsefeather has thoughtfully crafted menu that (I would imagine) appeals to just about everyone!\nWe had:\nThe Double Cheeseburger with Bacon\nKale Salad\nFried Chicken\nCoconut Curry Shrimp\n\nTheir burger is hands down the best in the bay. I know, I know...that's a bold statement, HOWEVER, if you're an In n Out fan you will respect the slight juicy, wildly flavorful, gooey cheese, perfectly soft bun that makes this burger spectacular. \n\nThe Fried Chicken was awesome. I was hoping for thighs, but they do boneless breasts. The chef nailed it. It was perfectly cooked, crispy and full of flavor. The honey sriracha and hummus on this plate just further support the killer Chicken. \n\nKale salad...full of flavor. Lots of cheese. Really good...a little salt heavy, but I like salt so I was a -ok!\n\nThe Curry Shrimp rounded out the whole meal. Bright flavors, perfectly cooked shrimp, it was just damn delicious!\n\nWe will be here all day if I itemize the cocktails we had so I won't get into it, BUT we had 5 different drinks and they were all awesome. My front runners are the Strawberry Hill and the Red Rooster. \n\nThe service here was attentive, thoughtful, and just all around good people!\n\nWe already can't wait to go back!", "author": "Lindsay D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-10", "description": "Amazing for brunch. The menu is short, but everything on it is a slam dunk! Highly recommend the breakfast sandwich, chilaquiles, and trout scramble. The service staff is super accommodating, and the atmosphere has the trendiness of a SoHo cafe but the comfiness of my grandmother's porch.", "author": "Jeddeo P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-09", "description": "The menu is simple and delicious. I loved my burger and the ceviche, both really yummy. The tacos are also delicious and come in good portions. The cocktails so good and fresh tasting, and there is a good selection of beer as well!", "author": "Kyla H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-08-27", "description": "Too bad the service has now twice been terrible, even when there are multiple empty tables, because the food is 4-star tasty.  The food came first, we had to ask for our wine twice and it arrived when we were almost done eating, and we had to ask for water literally four times. Seems the bar and servers should take a lesson from the kitchen.", "author": "Super D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-07-12", "description": "This was one of the worst experiences I've ever received as far as getting attitude from a bartender. I get it that a lot of millennials do not know how to be kind and friendly, but this person made my friend and I feel so unwelcome. As if we were bothering her for sitting at the bar and ordering a couple of extremely easy drinks (i.e.: beer and shots). My friend and I are in are early 40's and the bartender seemed to be half our age. She was so pretentious and rude and it was blatantly obvious she did not want to service us. My friend and I had not been drinking at all that day, so there was no reason for her to be so rude. \nI did tip her 20 percent out of habit. But she didn't deserve it. I left feeling very upset and probably won't go back, which sucks because I've lived in this neighborhood for over a decade. I said bye and thank you on our way out, and she ignored me. So I said it again and got a sigh and an eye roll as she said a \"thanks\" that seemed to take all her strengthback to me. She really gives this new generation a bad reputation and her energy is very negative.", "author": "jessica h."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-10-24", "description": "The place was ok, Music was really loud and the communal feel is cute. We sat at the bar, its cute for the area. The food didnt look appetizing honestly, it looks like fresh deli/buffet food. So we stuck to drinks. If I lived near the place I would return, but I wouldn't go out of my way for it.", "author": "MK M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-07-20", "description": "Beautiful enclosed front patio with heat lamps. Great place to grab a cocktail and some bar bites with a friend.\n\nI really wanted to like the cocktails and food, but everything was mediocre. I switched to beer, and I'm not a beer kind of girl! \n\nI would be more likely to go back if they at least had a happy hour, but they don't.", "author": "Jaching H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-06", "description": "My favorite bar right now in a city that has plenty... I just walk in and say \"Red Rooster, please\". Always great service, and sometimes it's not terribly crowded, so you can have a conversation. Love it!", "author": "Pamela A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-21", "description": "Bartenders were cool, very System of a Down vibe but friendly. Nice selection of Belgium beers. There's some outdoor seating as well. Would have liked a more impressive food menu, was not very inticed by the selection. If they'd build their menu or update the current dishes I'd be more enthusiastic. Definitely nice for drinks though!", "author": "Lauren K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-12-06", "description": "Brilliant tuna poke bowl, really delicious. The burger is good as well. Though the chips are a bit boring. Could have had more taste of vinegar. Nice atmosphere and interior. A little slow service.", "author": "Nico T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-19", "description": "The food was REALLY good.\n\nI had the fried chicken and friend had the pasta.\n\nWish they had a better beer selection, but I found something that I was able to enjoy.\n\nService was OK. Nothing spectacular.\n\nProbably a good idea to get here early. Seems to get pretty busy.\n\nThat being said, would definitely come here again.", "author": "Dan M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-16", "description": "Hot spot on Friday night for sure, very loud and crowded. The drinks were great, so I will definitely come back - hopefully when it isn't so 'oh MY GOD'", "author": "Melissa C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-17", "description": "A very hip place with nice decor and ambience.  The space is a bit tight, which makes it cozy, or too crowded, depending on your personal space needs.  It definitely gets rather loud, sometimes it gets too loud to hear your dinner partner, which is not ideal for a sit-down place, even if it does double as a bar.\n\nThe drinks are decent and the prices are reasonable, but not cheap.  I would say the food is over priced.  The cheapest thing are 3 street style tacos for $12 and $16 for a small poke bowl is just too much.  The food is good and well done, but they should knock their food prices down by $3.00 an entree.", "author": "Alice S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-27", "description": "The current Pumpkin ravioli is to DIE for and the fried chicken is currently being served over a bed of Brüssel sprouts and sweet potato purée. SO SO GOOD. Portion size was pretty good. Four healthy size raviolis came on the plate. I am so excited to go back!!", "author": "Jordan M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-24", "description": "Solid place for reasonably priced fancy cocktails and the food, although pricier, was delicious. \n\nCame here on a weekday night around 8:30 and got seated immediately. The strawberry hill was fruity and delicious though the sun country was my favorite since I'm a sucker for drinks with egg white and the underlying smokiness of the mescal was perfect. \n\nThe burger was solid- nothing super extraordinary but tasty and just what I needed to remedy my evening hanger. Chips were a nice complimentary touch.", "author": "Sophie C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-03-09", "description": "Drinks were very good. Kale salad was outstanding. We tried most of their menu and the rest was good, though not memorable. All plates are too small to be full entrees, so it's really a bar and not a restaurant. This was a bit of a letdown as we were there for dinner. Service was very friendly and executed well.\n\nDefinitely a good place for a drink or a late nite snack/drink.", "author": "Steve T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-07", "description": "Super cute spot with friendly staff and tasty food! I have been for dinner, but was really sold by their brunch. Very casual and was not crowded, perfect for a Sunday brunch. The cocktails were also amazing, there was a coffee cocktail that really stole the show.", "author": "Marc U."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-06", "description": "I treated my husband to drinks and a casual dinner here. It was absolutely perfect for an impromptu date. Loved the overall vibe and my husband was obsessed with the cocktail menu. Would definitely go back!", "author": "Lauryn Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-20", "description": "Great burger!!! Reasonably priced well made drinks. House made bacon. My friend was bummed that the duck was off the menu but the tacos were also darn good", "author": "Mischa H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-13", "description": "Best cocktails I've had in SF. I tried 3 different cocktails and each one was fantastic. Try the cucumber cocktail and the mezcal. You won't regret it.", "author": "Doc R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-26", "description": "Favorite place in the neighborhood (or anywhere in the city) for late-night grub (or any other time as well!) Ever changing and always delicious food menu, talented and well-informed bartenders, good jams, company and ambiance :)", "author": "Teresa L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-01", "description": "Just a really fun vibe with great service and even better drinks. I had the cool breeze which was absolutely fantastic and made my night. \n\nLooking forward to coming back. The entrance looks intimidating, but the inside and the environment are just so welcoming!", "author": "Ayush T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-30", "description": "First off, It's disappointing how scarce cocktail bars are in the Richmond District. And no... Soju cocktails don't qualify as cocktail bars (sorry Asians). I'm talking about speakeasy lounges that serve handcrafted cocktails where I can vent about my quarter-life crisis. Not trashy pubs and $1 shots where college kids get hammered.\n\nWith that said, after having dinner around Inner Richmond, the closest thing I could find was Horsefeather---and it was PERFECT.\n\nWalking in you feel like you're in a greenhouse or a rustic shed---totally SF hipster. I came in on a Wednesday night at around 11pm and there were a handful of people eating and drinking. The food smelled delicious, which unfortunately I didn't try, since I was still bloated from my dinner. \n\nThe cocktails ranged from about $10-12---which is average. I know the cardinal rule when drinking is to never mix lights and darks, but I felt being a little rebellious. The Nightrain was perfect to get the ball rolling since it had whisky and bourbon. The California Cooler came in clutch to help cool me off. \n\nBottom line--- I need to come back.", "author": "Denzell S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-22", "description": "Horsefeather is a welcome addition to the Haight/Divis area, but has some room to improve in the service department. They make great cocktails, the space is trendy and stylish, but the service frustrates me every time I go. Most bars don't have table service, but this one does. It's usually busy and crowded, with many people just going straight to the bar to order. Unless you plan on staying at the bar or just standing, it's best to snag an open table the moment you see it. There's not a clear seating situation (i.e., no hostess), so you just have to rely on the waitress noticing you to even get a menu. Basically, it just doesn't seem like a streamlined service experience, and it just seems to take forever to get a drink. And it's super loud, so not a great date spot or place for intimate conversation. Better for a group of friends who don't mind getting a little bit loud.", "author": "Fiona F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-23", "description": "Chase and Louie are my mains!!! They both have me smiling from ear to ear while I enjoy my drink...it's quite intoxicating. The lighting in this place is really flattering and the atmosphere is intimate and calming without feeling stuffy or pretentious. It's good for group gatherings or dates. I have yet to try the food but every time I see a dish served I always see the bottom and people looking very satisfied. Horsefeather is my night cap spot or a place to unwind after a long day/week. \n\n10/14/17 update - Mary (stay gold)! As if I needed another reason to love this place. Eric, Joey, Jackie and Hollywood I love you! The low key vibe makes this place a winner. Super gracious, smooth rnb and interesting conversation makes this place a stable to infinity.", "author": "Trish Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-13", "description": "This place is amazing. The beats are on point! Food was delicious and the bar tender was so nice.  I'm def coming back!! Keep up the good work!", "author": "Jewels S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-20", "description": "Make sure you get here early. Place does get packed. We got here at 5pm on rainy day and was able to swoop up one of their last large tables. To drink, I had the sun country and chimpipple, which were both good. To eat, ordered the pumpkin ravioli, cerviche, and tacos. They were all very good. Wish the portions were a little bigger for the main meals though. The service was ok. Our first server wasn't the best, took forever to get her attention to order and then forever for drinks to come out. I don't know what happened to her, but we never saw her again, so we just waived down another server, who was much better. Still service was slow, but at this point I think they were just understaffed. Overall, drinks and food were good.", "author": "Lisa T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-12-11", "description": "Had an early dinner here on Saturday, just before seeing X at the Independent. Nice cozy (dark) and classy atmosphere, so nice for a date. \n\nThe menu didn't make it clear whether the dishes were intended to be full entrees or more \"small plates\" for sharing. The server clarified that 3-4 dishes would be right for two people, so we ordered poke, kale salad and fried chicken (with a honey sriratcha glaze!). It was all good, especially the chicken and the kale salad. My spouse liked the poke, but couldn't tell if there was actually any fish in it, so seemed a bit light on sashimi chunks. We then decided to try the coconut curry shrimp. It had some nice sized shrimp, but unfortunately, the sauce was so salty, we thought maybe they had accidentally spilled the salt shaker into the pot. I doubt the chef actually tasted this before serving. \n\nOverall, a nice place, with some good dishes, but uneven food experience. I would try again. Service was friendly and helpful. Good cocktails.", "author": "Fred E."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-08-06", "description": "The drinks were delicious but there was nowhere for four of us to sit or stand. We asked before entering if it would work, and they directed us to a standing bar near the back of the restaurant, but then we were asked to move by the waitstaff no fewer than FIVE times over the course of our 30 minutes there... each time, we would move where they told us to, and then a couple minutes later would be asked to move again. It was preposterous. Needless to say, we found somewhere else for our second round.", "author": "Nicholas S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-31", "description": "Walking down Divisadero, we intended on stopping by a bunch of bars if possible - We did end up stopping by this one, but only because SF bestie Stefanie C. so highly recommended it (on yelp of course!). \n\nThere's opening seating in the front, and in the bar that's first come first service which is nice because we spotted a nice area in the front right outside the bar doors. They have heat lamps in the front so it made it kind of warm. \n\nI ended up ordering the Sun Country which had egg whites, but then also had these huge ice cubes in the drink. I didn't like that much. Environment wise, it was as expected. Fun though otherwise. \n\nOverall good place to grab a drink in this area.\n\nProtip: glance inside to see if there's some free tables to grab a drink!", "author": "Nina Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-22", "description": "Stumbled upon coincidentally. Grits, salad and hash were incredible and drinks were too. As good as the food was (and it was great) the service was better. Will return soon", "author": "Megan M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-06", "description": "Had the double cheeseburger and shaken cocktail. Calm ambience with dim lighting. The burger cooked as I ordered and I had avocado and a fried egg added to it. Great flavor!", "author": "Sujen S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-25", "description": "What sort of voodoo magic the chef does to make kale edible is beyond me, but s/he does it! Eat the kale salad. It's amazing. And the chilaquiles. Good beer and wine list and cute outdoor (dog-friendly!) seating.", "author": "Meghan M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-11", "description": "Excited about this place that took over the old Ziryab space in Alamo Square neighborhood. Craft cocktails created with care, order taken with a smile, resulting in a very reasonable bill ($10.88 for a Mad Dog cocktail, and that's including tax) and an inventive drink. \n\nThe space is beautiful and ambient, with some outdoor seating below gas heaters. The crowd is a little young, but that's to be expected, and I will continue to come back to skew the average age here.", "author": "Shirley Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-03", "description": "We went with 6 people at 11 am. Great time to go. Very comfortable with heaters in the front. The mushrooms are to die for! Burrito was very hearty. Chunky and spicy Bloody Mary which is good. Purple cream on waffles is awesome. Overall we wanted to give 6 stars.", "author": "Laura F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-05-05", "description": "Underwhelmed by the cocktails and atmosphere. \n\nI m walked past where during the day and noted the cute patio, and decided to come back. I wasn't very impressed. \n\nThe cocktail I had was very mediocre -- the extensive list of ingredients made it sound much more inventive than it really was I think. \n\nThe crowd seemed like a bunch of people on a first tinder date.", "author": "Rita K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-06-04", "description": "I love the ambience. Good spot to hang out with friends. Having said that, I simply wasn't impressed by either the food or cocktails. Nothing wrong, but nothing exciting either. On top of that, the service was sub-par. Had to wait quite a bit to get the menus, and after I got my drinks they forgot about us again.\n\nAnyway, interesting spot. Probably will try once again to see if the experience is better.", "author": "Ankur V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-13", "description": "LOVE, LOVE, Love it here! Spectacular drinks and yummy food. This isn't your average bar food peeps! You can tell the bartender your favorite types of alcodol and let them mix up a specialty for you...you won't be disappointed!", "author": "Karen F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-09", "description": "Creative drinks and friendly service in a cozy environment. Such a beautiful art-deco style bar. I had the Champipple which kind of tasted like a sophisticated adult Sangria. \n\nAlso, they serve food until 1AM, so head here after shows at the Independent for some late night snacks!", "author": "Meredith M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-03", "description": "Super cute, totally adorable place. We just stopped in for a drink after dinner at Nopa but would definitely go back.", "author": "Karen G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-01", "description": "Really good quality cocktails, and this is judging from just one.  Their main bartender looked like he had a little science experiment going on as he focused on each cocktail and methodically measured the ingredients.  Our cocktail (shoot I forgot the name) was sweet just enough and it hit the spot.  This place was hopping on a Friday night, and I liked the vibe.  I'd come back!", "author": "Maile N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-01-13", "description": "A terrible bar with nothing to offer. Drinks that take 20 mins to make and servers who are bossy and pushy. I had a group of friends that went here and we were all disappointed with the service and staff. I am sad that this bar/ restaurant even exists. Please do yourself a favor and don't go.", "author": "Griffin C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-16", "description": "I've been here for dinner twice and brunch once and each time I was blown away.  The menu isn't the biggest thing around, but everything on it is superb.  Smaller plates, great for sharing.  The place is small and you don't have a lot of room between the tables, but it's nothing that should stop you from enjoying yourself.  Great for a date, or a quick bite before a show at the Independent.  Enclosed patio out front where they allow dogs ... greatest thing ever for you dog owners out there.", "author": "Jarrod H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-08", "description": "Felt the need to finally review this place. I live in the neighborhood and have been giving the benefit of the doubt to servers/staff the past 4-5 times that I've visited. Clearly, there is a pattern. The service is terrible. Twice that I've gone for dinner/drinks our order was completely forgotten (twice!) \nToday I was there for 1 &1/2 hrs and never once had a server come back to ask if we wanted anything else... or refill out water. When I finally flagged someone down to ask for a beer it was slid down the communal table 1/4 poured and with attitude.  Not to mention that same server preceded to spill a glass of water on another patron without any sincere remorse.  This place is never busy because the service stinks.  And the food is... meh.\nDon't normally review but given the numerous bad experiences I had to speak some truth. Hopefully they will take these reviews in to consideration and instill some empathy and work ethic into the staff.", "author": "Sharon K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-27", "description": "Very cool and stylish place. We had kale salad and the tuna dish and both were amazing.  They have a decent beer selection and the bar looks very well stocked", "author": "Mirjam S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-04-06", "description": "Whilst the restaurant was relatively quiet, and we were enjoying our time, the owner asked us to move tables without any clear rationale. The poor way he handled this has left me with a sour taste for his establishment.", "author": "Josh B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-25", "description": "Truly, amazing. And fun too. Trust me.\n\nI highly recommend.\n\nA must try.\n\nOne of a kind.", "author": "Donald K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-02", "description": "Oh my lord! \n\nOUTSTANDING FOOD!!! \n\nOur family were visiting San Fran, randomly spotted this gem, went in for brunch, and oh an what an amazing  brunch it was!! Everything on the menu looked so good, so to ensure we don't miss out we ordered everything and I'm so glad we did.  I can't remember the names of the meals we had but they literally were all delicious,oh and the cocktails! These guys know what they're doing. \n\nIf I lived in San Fran this could be my regular Sunday brunch spot, can't wait to come back and try the dinner menu! \n\nYou guys rule, wish more places nailed food like you do!", "author": "Sepi S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-29", "description": "This place is fantastic! Haley is the sweetest host and the beer selections were great, will be coming back for sure. Make sure to try the burgers and craft drinks !!", "author": "Jonathan G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-01", "description": "There are so many great gems on Divisidero, including Horsefeather. The front patio is charming and bright, the bar area is cozy and has a neighborhood feel. The cocktails are delicious here and the bartenders are friendly and patient with you! I'd totally come back here over and over again!", "author": "Lauren L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-09", "description": "Great addition to the neighborhood. Cocktails were creative, excellent and the staff was great. Can't speak to the food as we just had drinks but I tasted the Mad Dog, Strawberry Hill and California Cooler; all three were on point. \n\nThe California Cooler was the star of the show - don't miss it if you like gin based drinks.", "author": "Ash K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-23", "description": "Cool ambience with a great crowd, good selection of beers for a wide range of palettes . Did not eat but my friend said the shrimp curry was spot on, will go again.", "author": "Awasi A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-02-03", "description": "I've lived in the city for ~5 years and go out to eat 5+ times/week. The night we went, the service was hellacious: hostess pretended she called after we checked in (to let us know the table was ready) but never did, waitress was curt and unwelcoming, service was extremely slow; overall pretty poor. Food was mediocre. Ambience was solid. I live a few blocks away but would only go back to grab a drink.", "author": "Chris H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-30", "description": "Awesome atmosphere. Came around 8pm on a Friday table for 2 and sat almost immediately. Really good unique cocktails, and the food was amazing and filling. Got the kale salad, pulled pork tacos and the tuna poke bowl. Food came super quick and service was very friendly.", "author": "Toby C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-10-10", "description": "I love the look of this place...lots of succulents and there's both a loungey indoor darkly lit area and a bright, well-lit outdoor area (with heaters!). The bar is beautiful. Food-wise and service wise is where there was a downfall. \nI was content after going here the first time and ordering the kale salad which is doused in a creamy dressing. It was what I was in the mood for at the time but really a bit overdressed. \nSecond visit, I ordered the beef and broccoli which was rather salty, also very overdressed, and some\nof the scallions tasted like soap. My friend ordered the pastrami which was honestly terrible. Flavors were off and didn't meld well with one another. Portions were small given the price. I'll go back most likely as I enjoy the vibe, but might just stick to drinks or apps. \nOh, so the other thing was that our waitress was way out there during the second visit...her facial expressions and even little comments were so bizarre and made us a tad uncomfortable. She wasn't professional IMO and didn't give genuine recs or give off any positivity in general. Odd..", "author": "Caitlin G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-11-23", "description": "Great cocktails, beautiful environment, & pretty decent eats too! Love this neighborhood joint. Why the 3 stars? Took us almost 30 minutes, 2 different requests after initial order just to get our drinks. Ridiculous. I went back & almost as bad the same indifferent service. The server would deliver a neighboring table's order & head back to the bar, not even look up or around at the other tables clearly trying to get her attention. Who is training these waiters to be so blasé? Step up your service game! Your tables shouldn't have to send up smoke signals to get your attention.", "author": "Jamie R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-22", "description": "Gorgeous. Good drinks. Not so spectacular on the service. I don't know why yelp decided that this review was too short. Im tired of reading long reviews.", "author": "Gernaut A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-21", "description": "Great drinks and food! I ordered the Champipple and the tuna poke bowl.  The heated porch was also great.  The only downside was that it was really loud and crowded (we were lucky to get a seat at 7 on a Thursday). I will definitely be back.", "author": "Janelle F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-25", "description": "The fried chicken with 2 sides is so incredibly delicious! It came with hummus and Sriracha Cole slaw, WOW!  The drinks and ambience are also great. I recommend sitting at the tables in the front- a cool outdoorsy vibe indoors. Gorgeous spot with excellent food and service!", "author": "Jezzica B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-04-13", "description": "The bartender I dealt with wasn't super great considering they're going for a complex cocktail vibe with their menu. I've never had resistance in explaining the elements of a drink. Their drinks also represent themselves as complex but are just so-so. Was not blown away. Prices are decent. I met the owner and tried to give feedback but he wasn't interested. Feel like they could be more upscale if their cocktails were better and they were nicer. Cute decor.", "author": "Cathy L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-12", "description": "Cool spot! I'm a fan of the other bars that these owners have built around the Bay Area (Tupper and Reed in berkeley, Bourbon and Branch in SF), and this place did not disappoint. It's simple yet has a very warm neighborhood feel to it. Drinks are standard prices, and very delicious. Also had quite an extensive food menu for a bar. Would definitely come back.", "author": "Tanay J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-05", "description": "I can't write anything less than a raving review. This place is a savior for quick yet incredibly flavorful food. It's SOOOO delicious and with clean ingredients. Thank you guys for existing. My favorite spot in SF. And without being a scene!! Thank you again.", "author": "Megan M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-04-17", "description": "Beautiful bar, inventive cocktails... but no vibe in this bar. The bartenders are very cold limit unpleasant. I live close by, but this place is definitely not a friendly neighborhood bar.", "author": "Arnaud M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-29", "description": "I was able to snag a table in the lush front patio for drinks with a friend after work. The ambiance and the delicious drinks are a winning combination. We didn't stick around for anything other than drinks, but the food offerings were tempting.", "author": "Patricia D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-04", "description": "Staff is attentive and friendly. The atmosphere is fun and bright if you sit outdoors with lots of greenery and sun shining through the glass ceiling. They also have heat lamps to keep you warm on those gloomy afternoons. We didn't have the food but this is a great place to chill with friends before dinner or after lunch.", "author": "Marie r."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-08", "description": "Dropped by here late on their opening night on Wednesday. Didn't realize they had JUST opened. Great spot! Delicious drinks, nice atmosphere, amazing bartenders. Definitely going to come back here. Looked hella crowded earlier in the evening, so I might just keep coming here in their later hours.", "author": "Nodira K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-02", "description": "Glad we stumbled upon this place. Perfect ambiance for a late-night dinner and cocktail. Drinks were unique and very boozy. We split 3 dishes between 2 very hungry people, and it was the right amount of food. Great interior design, and we sat in the enclosed (heated) patio. Nice mix of young/old, diners/drinkers, different tribes of people.\n\nSeat yourself. You have to be active in getting your server's attention. Service is hands-off (which was fine for a slow intimate meal); probably not for you if you demand a lot of attention from your waiter or are in a rush.", "author": "Tara P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-12", "description": "Live in the neighborhood, tried Horsefeather for the first time. Had a delicious cocktail and the fried chicken, both were excellent.", "author": "Mary R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-04-27", "description": "Not anywhere near the same quality as Bourbon and Branch - which I heard was related. Perhaps just the same theme decorator? I wish they focused less on themes and more on quality drinks. As usual I did the Sazerac test. The drinks didn't pass. Merely decent to.. a friend refused to drink hers. Not sure how they hired or trained but I sure hope they improve. I'll update my review once I notice a difference.", "author": "Esso E."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-05-05", "description": "Visited horsefeather on a Wednesday night. Place has a nice vibe but the service, prices, and food portions were well below average. I ordered chips and queso and got a small bowl of queso and about 20 chips. Finished all the chips and had leftover queso. Asked waitress for more chips and she wanted to charge me. Charging for more chips is amateur. Beer selection was awful. Ordered a vodka soda and it tasted like soda water. Not right the proportion of vodka to soda. For a cocktail bar this seemed off. Their signature cocktails were great, but everything else very mediocre. Overall not worth a return visit.", "author": "Kyle W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-15", "description": "Wandered in last Friday for the cocktails and stayed for the food! Burger was on point and had some of the best wings I've ever had!", "author": "Philip M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-14", "description": "Delicious, thirst quenching cocktails and super friendly, engaging staff! My new spot!", "author": "Vanessa S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-22", "description": "This spot was clean with great service, fun place to grab a cocktail. Bartenders were friendly with good recommendations on drinks.", "author": "Teddy Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-11", "description": "The front patio is cute, good chilaquiles, and good Bloody Mary. If you get here before 11, there shouldn't be a huge line. You can also ask them to turn on the heaters if it's cold!", "author": "Sofia R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-16", "description": "We came for some specialty cocktails because we heard they're great but wow, the food.  Who would have thought?  Unreal. Cuisine A++.  We had the ceviche and the raviolis and we can't stop talking about it.  And yes the drinks also lives up to the reputation.", "author": "Mister H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-11", "description": "Love the ambience. Snag a table in the closed-in front patio if you can. Food is also great, particularly the pork tacos (with homemade tortillas) and fried chicken.", "author": "Brady W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-15", "description": "Finally ventured over to this new spot on Divis that's had a buzz since it opened. Horsefeathers is a new American bar and grill featuring expertly crafted cocktails, beer & wine, and a select but delicious menu. It was a solid winner the afternoon I popped over for some Halibut ceviche and a Sun Country Mezcal cocktail. Though a tad cold due to the SF's random days of summer fog and an open air courtyard, one cannot fault it's well appointed decor, good food, and great drinks, plus when Talking Heads, \"This Must Be The Place\" played, so maybe it is.", "author": "HUNTER B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-06-14", "description": "Rather short cocktail list, and strong fare to boot. Still not a bad place if it's not packed", "author": "Tom S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-05", "description": "This place is exceptional! Burger is really solid! Drinks were good, and the staff was friendly!", "author": "Zachary T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-20", "description": "Very cool place.  We sat in the enclosed glass entry area for brunch.  I had a great cocktail, the Howland, and it was delicious.  I had the albacore and my companions had burgers.  The waitress was very cool (bangs and tattoos on her arms).  Overall wonderful!  I'd go back!", "author": "R M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-08", "description": "Holy crap, came for a beer and stayed for dinner. Worked my way through the killer cocktail menu before I realized that pulled pork tacos and fried rice sounded amazing...and they were. Do yourself a favor and eat some food here. Love Eric.", "author": "Eric F."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-09-10", "description": "Last night I ordered a drink from the menu that was so syrupy sweet I couldn't drink it. I let the bartender know- in as nice a way I could- and asked for a dirty martini instead. I had my money out to show I was willing to pay for the second drink, but he told me it was on the house. After a few sips it was very apparent that he had served me a drink with little to no alcohol in it. It was just icy olive water. \nSo if you don't like your drink at horsefeather- be sure to keep it to yourself. You may end up with a bum drink and a really good reason to never go back.", "author": "Mikayla C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-07-31", "description": "Pretty nice design and decor to the space. I like the menu with shaken cocktails and a pretty solid beer selection. Did not get the best vibes from a bartender that passed me up repeatedly which had the effect of deciding to close my tab rather than grab another drink. Prices are a bit steep. Will not be coming back.", "author": "Brad M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-18", "description": "This would be a great place to meet a friend after work for a drink. The interior is beautiful. The drinks are great. The food is good, but not the main attraction. We came on a weeknight and it was very busy so we were lucky to grab a table way in the back. It was dark, like, waaay dark back there. I'm all for low lighting but this was overkill. It's a new place so maybe they're waiting on adding lighting in that section or something. The service was efficient and friendly considering how busy it was.", "author": "Jerry L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-25", "description": "Love this new edition to the Divis bar scene. Great vibe and decorations. Lots of locals hanging out, not overly packed and excellent extra dirty vodka martini!", "author": "Jeanna B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-09", "description": "Wish they opened earlier! Great drinks and great food. Awesome vibe, def be back soon!", "author": "Ron M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-02-23", "description": "Ridiculous. Won't accommodate any dietary restrictions and was offered a discount for the inconvenience but then the manager rescinded the offer. Slow service, to boot.", "author": "Tara S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-07", "description": "I had probably the best burger of my life here. The bun was to die for. Cute patio outside, too.", "author": "Gina T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-10", "description": "Quite possibly my favorite brunch in SF. The drinks are original with subtle nuances and far exceeded my expectations, even with eight years of mixology in SF under my belt. The ambiance is great-- could spend all afternoon on the sunlit and plant-filled patio. The two dishes we shared were fantastic-- everyone should try the chilaquiles, and the house-made bacon made me momentarily forget that bacon is overdone.", "author": "Stuart G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-12-30", "description": "Why on earth would your well vodka(Smirnoff) be $11? Are you insane? Your specialty cocktails range from $10-$13. Let me ask again. Why on earth would your well vodka(Smirnoff) be $11? You suck.", "author": "Mojo M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-07-16", "description": "Ugh where to start. Came here today when it was relatively quiet - 5pm. Sat ourselves on the patio and waited and waited. Decided to belly up to the bar and STILL waited even though there were 3 people behind the bar. My husband made a sarcastic remark about the wait being equal to the wait outside and someone heard and finally gave us a menu. We ordered a couple of drinks and food. When our food was delivered, we'd finished our drinks and the bartender said \"do you want some water?\" We thought it was odd that he didn't ask if we wanted another round. We ended up ordering another round from a different bartender. The entire time we sort of felt like they just didn't want us there. They were clearly most interested in talking & joking around with each other over providing welcoming service. The only positive was the kitchen - they hustled and were quick to fire up the orders. Spent a regretful $115. Don't waste your time or money here - Nopa down the street is MUCH better.", "author": "Noel A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-17", "description": "Visited here for a friends birthday drinks two weeks ago. We were seated in the front closed in patio area which was a great place to be seated. I ate the beef with oyster sauce and it was one of the best meals I had had in a while and for such a reasonable price. Other people at the table had fried chicken and commented about the perfect portion size. I am not a big gin drinker, actually I hate it but the strawberry hill was delicious and I stuck to it all night. The rest of the table collectively had all other cocktails on the menu and we all tasted them, not one disappointed! Fantastic restaurant and can't wait to go back again soon.", "author": "Relle C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-13", "description": "The patio in the front draws in a crowd but even on a Friday night we were able to grab a table inside. The food and drinks were delicious and i would defiantly suggest the Albacore Poke.  Cocktails are between $10-12 which is pretty average and the bartenders know how to make some good drinks, i myself got a gin gimlet. Only reason I am knocking a star off is for the poor service. Get ready to make a scene if you want anything since they have you seat your self and then you have to fight for the attention of a waiter or waitress to  grab a menu or order a drink.", "author": "Emily V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-01", "description": "This place is amazing!  The ambiance, the decor, the food and drink - wow!  My husband and I came in for some quick drinks to check out this new place.  We were amazed at the thought and detail put into the cocktails.  I had the California Cooler - Celery juice, lime, thyme, sauvignon blanc, horseradish, sparkling wine, gin.  What an interesting combination of flavors -and it was so tasty!  We also had the ceviche.  The owners definitely put some time into selecting the decor, the detail of the entire place really shows.", "author": "Michelle H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-11", "description": "Horsefeather looks amazing! Beautiful light wood and blue accents, perfectly chilled cocktails from a great staff. Creative food options too! Very exciting. Delicious! Get the Nightrain and Champipple. And chicken wingggggggzzzzz", "author": "Katherine D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-07-11", "description": "Popped in here yesterday for a bite around 5pm. No too packed, waited for a couple to finish at the bar and sat down with friends. The female bartender was friendly and brought us a menu. Great so far. A second bartender appeared soon after, however this guy was not friendly. His \"I'm way to cool\" tuff guy attitude was an immediate turn off. The bartender I'm alluding to has a freckled face. My friend asked to taste an IPA, which this guy seemed even more hostile to.\nHe went on mixing drinks in front of me so I leaned forward and asked him if they had any non alcoholic drinks. He basically told me to zip it because he was way too busy to talk. You my friend need to find other employment ( maybe a dive bar somewhere )!! Every bartender I have come across can mix drinks and talk at the same time, they are also generally nice people!! \nWe departed the bar not wanting to deal with this for the rest of our time here. We sat in patio and did receive great service from our server. She was friendly sweet and helpful. Food was great and an otherwise good experience.", "author": "James H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-06-18", "description": "This place is mediocre at best. I was really excited to finally try out Horsefeather bur left extremely disappointed. The bartenders are straight up neglectful and rude. How long does it take to get a drink around here? The answer is way too long. The cocktails are decently priced 10-12 dollars but aren't worth the wait or the attitude the bartenders have here. The food is good though and would be the only thing that would bring me back here. I would recommend sitting at a table where the servers will go up to you and you don't need to interact with the bartenders. I will probably avoid this place in the future and get a far better cocktail and service next door at Nopa.", "author": "Chelsea R."}
