{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-09", "description": "What a great concept! Having something very, very similar at Turkey, we wanted to give this place and my god it felt like home!\n\nYou can choose from tons of different combinations and regardless what you choose it will always be tasty, that I can guarantee. If you are around and if you feel like you need a quick bite to eat, this place won't disappoint you.\n\nAll my \"Kumpir\" fans out there, this is very very close to the real deal.", "author": "Ali O."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-08-26", "description": "I really, really wanted to like this place. Baked potatoes are my #1 underrated food, and a restaurant dedicated to them sounded excellent! Unfortunately, the reality wasn't as good as the idea.\n\nThe restaurant seemed run-down, first of all. The fake wood paneling was super dated, and the table my friend and I sat on wobbled like crazy every time we took a bite. I suppose that fits the touristy vibe of Fisherman's Wharf pretty well, but it's not what I was looking for.\n\nI got a sausage spud because sausage is the best meat and was super underwhelmed. The potato was tasteless (even as potatoes go) and the veggies, while fine on their own, really didn't go with it. The sausage was sort of cold and not very tasty either, and there weren't nearly enough green onions for a potato of this size (though I'm the sort of guy who orders extra extra green onions on his ramen, so take that how you will).\n\nIt also seemed mostly if not entirely unseasoned. Baked potatoes need a healthy dose of salt and pepper at the very least, and I expected a potato specialty shop like this to innovate on top of that.\n\nIt gets a second star solely for potential. Hot Spud is an excellent idea, but the execution was far, far off-base.", "author": "Shawn W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-13", "description": "As the quintessence of fast casual on the West Coast, Hot Spud is worth looking into after a long day at Fisherman's Wharf for a quick bite to eat after some sight seeing. Sure it may be a small chain, but the pre-set options combined with the \"make it your own\" bar make it an excellent alternative from the food traps in the Wharf. \n\nThe restaurant also boats a large cooler of drinks, including wine and beer. I would say a meal costs around $10 without the beverage.", "author": "Sarah W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-28", "description": "Cool place and idea but $$$$. Fresh ingredients and a huge potato. Lots of gluten free options and a clean environment. Friendly staff too. My son loves it.", "author": "Ben T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-18", "description": "This place looks like a dive however it is a great place to get a loaded baked potato! Staff is great and you won't have to wait for long to receive your food!", "author": "Chris C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-22", "description": "Ah-mazing salad tonight.  Fresh crisp veggies, perfect chicken and delicious balsamic dressing!!!Simple, real food at a good price.  Pick one of their salads or potatoes or build your own.  Nice people, clean and quick.  I hope to pop in for a potato tomorrow.  Eat here. (And they had beer)", "author": "Theresa B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-01", "description": "This was a wonderful local chain in the area to escape the tourism of San Fran. The food was amazing and there was great variety. The wait for the food was a little long, so don't expect a quick stop, but well worth the wait. The prices are great and there is also a Seven Eleven next door if you want to take a break and stock up on snacks or grab a slurpee!\nI tried the wharf which came with crab meat, corn, and red and green onion.\nYum! Also - beer is $3.50 for a bottle!", "author": "Jonna Leanne P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-03", "description": "Great salads and potatoes.  Toppings made it \nunique. Best part it is off the tourist area and not crowded.", "author": "Malinda P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-27", "description": "Satisfying! We were pleasantly surprised as we went in with somewhat low expectations since it's fast food. Restaurant is pretty clean, service is good, and spuds are tasty and filling. Lots of choices with respect to the options and it's a pretty good deal (about $10-11 per spud if you get meat). We just wanted something quick and uncomplicated, and this fit the bill (can't go too wrong with a baked potato).", "author": "Maria F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-10", "description": "After visiting the pier, my friend and I were looking for a spot to eat. This place was not too far of a walk and sounded appetizing as it had been raining all day. I ended up getting the Thai crunch salad which was so filling and delicious. My friend created her own spud and said the same thing. I loved this place for a quick lunch. The workers were  helpful with accommodating my vegan needs, while answering any questions my friend had with suggestions.", "author": "Leslie R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-15", "description": "This place is like Chipotle but for baked potatoes, and as a baked potato lover, it's a dream. I always do a create your own and add the hot wing sauce- SO GOOD. Worth trying out and the portion size is really big. Good lunch spot", "author": "Rosie L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-09-08", "description": "It's was okay. Service was good but nothing to write home about. Kinda hidden area away from all the tourists but easy to find.", "author": "Ramiro S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-24", "description": "Popped in here after completing a Big Bus Tour. As I was near Fisherman's Wharf, I determined I HAD to have some crab. I order \"The Wharf\". I thought the concept was a baked potato with toppings but once the order was taken, they grabbed a spud and started to mix all the base ingredients together. They then repacked the potato then loaded it with my preferred toppings. \n\nBonus points the owner let me charge my phone while I ate!", "author": "Marcy H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-06", "description": "Now this place was remarkably awsome.. came here for lunch and I ordered the wharf spud while my friend ordered the shrimp spud.. these big potatoes are jam packed with flavor and mixes together really well.. would def come back here again", "author": "Brandon V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-13", "description": "Great food, good service! Potatoes are GIANT! You can order off the menu or create your own!", "author": "Amy D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-04", "description": "My wife and I really enjoyed the spuds!  My wife had the chicken spud and I had the vegan!  2 thumbs up!", "author": "Riley S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-13", "description": "Pittsburgher who needed a quick, yet gf meal....and Hot Spud hit the spot! Waitstaff was quick to help and describe possible allergens -- super helpful! Potatoes were baked to perfection -- creamy on the inside and crisp on the outside. Toppings galore to choose from and a great choice of bottled bevies. \n\nI topped mine with roasted cauliflower, sauteed mushrooms, and peas....the accompanying chipotle lime aoili completed the meal!", "author": "Heather R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-31", "description": "Finally got to try the spud and it's so yummy!\nPreviously I had always gotten the fiesta salad which has a cilantro dressing I'm in love with. The spud is a simple concept but it is filling and scrumptious.\nIn particular I like the chicken spud (without olives and instead add mushrooms). The potato which can be a bit bland is flavored with a nice kick of hot sauce. Ingredients taste really fresh and spuds are made on the spot. \nThe sweet potato brownie is also a delicious guilty pleasure. The brownie is a soft and does not have a heavy chocolate taste (which I love) and the sweet potato blends well with the chocolate. \nHot spud is definitely one of the gems in the heavily touristy areas.\nWould definitely recommend!", "author": "Julia K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-24", "description": "I came here last weekend.\n\nPros: \n*positive, friendly staff \n*smaller crowds than most other places in the area \n*delicious potatoes\n\nCons: \n*direct light from the setting sun shining right in your face \n*toilet seat is not attached to the actual toilet \n*paying $50 for four baked potatoes\n\nAll told, if it's 6:00pm and every other place within walking distance of the water is incredibly crowded with an hour-long wait (and you can ignore the fact that you could make this same food at home for $3 per person using a microwave) Hot Spud makes for a decent spot to grab a bite.  The staff was very welcoming and accommodating, and everyone in my party of four ate their fill, with no complaints about the flavor.  But whoever owns the place would really do themselves a favor by adding some infrastructure, such as a soda dispenser for fountain drinks, a more intuitive customer traffic pattern, shades on the windows to keep the direct sun out, and a toilet seat with some self respect.", "author": "Jeff T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-22", "description": "I wanted to go to any restaurant where they have unique eats for lunch right before I head to Chinatown for its flower fair.  Last year, my family and I haven't planned a field trip to travel from our city to Las Vegas or Los Angeles during our staycation.  I would had the chance to go to many interesting eats. :^(.  But, I never worry; still hope for me if I had enough money.  \n\nAt Hot Spud, here's one interesting eat I couldn't wait to try: stuffed jacket potato.  I passed by this place on New Year's Day; this time, I came in here to buy a one big jacket potato, just like a baked potato I used to have in Sizzler's, but even bigger for lunchtime.  My stuffed jacket potato I quickly ordered was the Veggie Spud.  I liked to assume my choice of having greens in my spud relate to what's uncontrollably growing out of the big potato in a make up sci-fi movie, a perfect creation for my taste spud.  I chose Alfredo sauce, but that's fine if I end up with a scoop of sour cream unto my Veggie Spud; as long as everything is delicious. With a free cup of water, I finished my meal and leave after that.\n\nLove how Turkish workers make stuffed jacket potatoes.  The ingredients they use are gluten free and MSG free.  Food served like hot potatoes and customer service is excellent.", "author": "Jimmy C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-01-21", "description": "The first time I came to Fisherman's Wharf I passed by Hot Spud, but didn't get a chance to try it, so I made sure to put it on my to-do list for the next time. And now here we were! \n\n- Steak spud: this was such a huge portion! The potato was quite buttery and rich with the Alfredo sauce and cheese on top, layered with morsels of beef, topped with onions and peas. The whole thing was quite heavy (but what was I expecting XP) and one dimensional though, and none of the elements particularly stood out.\n\nI don't think it was anything super out of the ordinary (and not your typical cheap fast food - make your own potato is about $8-9), so I probably won't be back. But it was nice to try Hot Spud, since I've never actually been to a place that exclusively serves baked potatoes (or jacket potatoes, as they call them), so definitely something to check off that bucket list!", "author": "Joanna C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-01-15", "description": "If you are gluten-free in San Francisco, your choices can be pretty sparse. So this was a welcome place to eat while we were down near the wharf. Nothing fancy, but a little pricey for what you get--A baked potato with a set of toppings. If you want something plain, you can ask them and they will go off menu, but know that you'll pay $10 to get butter, sour cream and cheese on a potato. \n\nThe chicken comes with buffalo topping, so if you have a wing lover in your party, it's a pretty good bet. They also serve beer and bottled soda.", "author": "Paula M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-05-21", "description": "A quick lunch that is relatively inexpensive and hearty one block off the main grid of San Francisco. I got the potato with crab, corn, and spinach.\n\nI give this place a 3...an average 3. The potato and crab were cooked well, but the corn was cold and the spinach was unwashed.....dirt crumbles are not a tasty food spice additive.\n\nWould return if invited, but probably wouldn't suggest it", "author": "Dan W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-13", "description": "The chipotle of potatoes. Very chipotle-esque. My boyfriend thought we should try this place out since I love potatoes. And this place markets itself as a very healthy place, so why not? \n\nRight away, we were greeted by a very friendly staff. That's one thing that makes them stand out: they were all nice from start to finish.\n\nYou have a choice between taking something already on their menu, or you can make your own. My boyfriend got the shrimp one ($10.95) without black olives, and the worker gave him the option of substituting the black olives for something else.\n\nI made my own. And I'm pretty picky, so all I wanted was a potato with butter, cheese, salt (already included), and bacon ($1.50 additional charge). My create your own was $5.25, but cost extra to include my spinach and bacon. That's not super bad at all for my pickiness.\n\nI was a little disappointed that the spinach was raw and not cooked, because I like the taste of cooked spinach way more than raw spinach. But on the plus side, the potatoes are huge!! Overall, it tasted pretty good. Definitely want to try out more combos if I'm in the area. I can see that this place can become filled, but not too crowded.\n\nNOTE: 3 stars alone for the food because it's good but I wouldn't go out of my way to come here. But what really sets it for me is how great the staff treat you and care about you!", "author": "Rachel M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-09", "description": "I wish they had a place like this in San Diego! There is nothing more satisfying than a baked potato after a half marathon...\n\nI had the shrimp potato and my fiancé had the steak. I was warned that the sauce on the shrimp potato may be hot, but it had the perfect amount of spice! It tasted so yummy with the shrimp. My fiancé devoured his steak potato. The only complaint I have (other than not being in San Diego) is that there was too much sauce on the potato. That's just my opinion, some may be on the saucier side. \n\nHighly recommend this place if you're around Fisherman's Wharf! You will not regret it!", "author": "Eileen S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-10", "description": "This restaurant is a new take on subway or chipotle, except with baked potatoes. You can build your own baked potato, starting at around $8.50, and going up to around $12. The potato was a nice change of pace from salads and sandwiches and is big enough for a full meal, but seems a little pricey to pay $10 for a potato with a few toppings. #sfproblems\n\nThey also have build your own salads for around $7. \n\nMy suggestion: Also offer baked sweet potatoes", "author": "Elena K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-03-05", "description": "First time I visited this place I really liked the place! \nSecond time I visited this place I did not like it as much. The vegetables were raw and the meal didn't taste as good.", "author": "Sairam B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-02", "description": "Comfort food at its best! While in the SF area I noticed them and had to give it a try. So glad we did!!! The baked potato was super creamy-yes...a creamy baked potato!  I enjoyed every bite!", "author": "Felicia C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-14", "description": "Found this place on a Celiac website. It's a cute place and the girls inside were very knowledgeable. They seemed to know what they were talking about when it comes to items being gluten-free. We really enjoyed our potato with butter, cheese, green onions, sautéed mushrooms, broccoli, and bacon. It was a great midday lunch. Thank you Blanca and Pilan for a great experience!", "author": "Jennifer J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-07", "description": "Finding food that is plant based and vegan acceptable is a challenge at Embarcadero unless you are looking for garlic fries... Yelp suggested hot spuds and I  gave it a try. The woman who helped me with my order was incredibly nice and knowledgeable on the matter. Her advice was very helpful. She did not offer any vegan cheese or the like so I am not sure if they have any. I did not want any so I didn't ask either. I got a make-your-own spud with fresh Spinach, broccoli, tomatoes, olives and extra avocado. And I recommend the Thai peanut sauce!! The potato skin was nice and salty,  I was happy with my meal. I didn't think it was spectacular but filled me up, was tasty and felt good.", "author": "Anna P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-25", "description": "The food and service were awesome. The workers were friendly and helpful to make the suggestions from the menu we choose. We will definitely come back here again in the future.", "author": "Kristopher H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-04", "description": "Everyone at one point in their life wishes there was a place where you can get only a really filling and heavy-topped baked potato for a reasonable price and this place is that place. It was amazing and the baked potato with crab was exquisite.", "author": "Nathaniel B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-10-05", "description": "First time visited due to it was right across of our hotel and yelp rating was good, this is personal opinion, it was not so good as it described as yelps rating. First of all, pricey 2adult and 2childs: $52 for fast food. Second, you could literally make this better at home, of course. Lastly, salad was disappointment. Crunch Thai salad? No crunch at all with minimal flavor. But taste was fairly okay. \nLike I mentioned it is personal opinion, my son liked it.", "author": "Soo L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-30", "description": "Super cool place. I've never been to a place that just specialized in Potatoes. My girlfriend has, but it was in Ireland. That should give you some context. For a place specializing in potatoes, I thought the quality was very good. I got a potato with steak, peas, carrots, mushrooms, olives, and some kind of sauce that almost remind me of Alfredo, but not quite.\n\nOverall I would come here for a quick lunch again, no question.", "author": "Sam R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-20", "description": "Quick service. Simple, delicious food with many topping options. Sweet potato brownies weren't available but is one of the spud desserts. The ambiance was fast food bland. Reasonable prices.", "author": "Emily B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-01-03", "description": "I got the signature dish, steak spud. It has steak, alfredo sauce, potato, scallion, corn, peas, melted cheese inside a roasted potato. It was all right after a long day of hiking. It fufilled my cravings :) There's also a \"make your own spud\" with the items you wanted to add into your potato. It's abit like chipotle style when you make your own. They also have potato desserts as well, which seemed interesting..", "author": "Lynh N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-12", "description": "Yum yum.my Mom sister and I were looking for something gluten free and ran into this place. The food was amazing the service was great. I would for sure be eating here again", "author": "Tfabulous R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-20", "description": "Cheesy, buttery, fatty baked potato goodness!  Our office had Hot Spuds catered to us through Chewse and it was delish!  They accommodated for those who are dairy free and vegan as well, and offered greens for a no carb option.  \n\nThe potatoes were served piping hot and were huge.    They were moist too.  Loved the make your own potato bar.  Topped mine off with sour cream, chives, some feta cheese, grilled chicken and beef, tomatoes, sautéed mushrooms and bell peppers.  The meats were well seasoned.  The toppings were fresh and pleased everyone's palettes.  It was a very filling and tasty lunch.  I just wished that they also offered more sauces (only had a thousand island like sauce and buffalo sauce) or a Greek yogurt option substitute for sour cream.", "author": "Cat C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-01", "description": "Vegan options!!! Make your own potatoes! The best part is the amazing service. They were all sweet and accommodating. Friends got a shrimp and sausage and they loved it. The buffalo sauce is vegan and AMAZING. Definitely recommend!!", "author": "Crystal F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-24", "description": "Get your potato on! \nI was walking the streets of Fisherman's Wharf, looking for a non fussy and quick place to grab a bite when their logo caught my eye. I am a fan of everything with potato and it looked like they had interesting toppings to go with it. \nYou order at the counter and they bring the food to you. I got chipotle shrimp hot spud. I only wished there was a little more cheese on it. But maybe it was healthier that way? I really enjoyed the skin of my spud. It was lightly salted and chewy. \nI really recommend to stop by here if you are in the area and feel like getting something different than your typical FW chowder and seafood.", "author": "Magdalena K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-08", "description": "Great family owned place\nYummiest spud ever\nGreat vegetarians options, we loved our spud with corn, spinach, green onions and avacado\nWe would come here again", "author": "Soofia F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-16", "description": "This place is sooooo good and it's so different! It's your traditional baked potato but with better options and better toppings! I got The Wharf spud and added shrimp, you pay a little extra for the shrimp but it's worth it for the extra seafood in the potato. I've also tried the Steak spud which is not as good as The Wharf but it's still better than any other baked potato I've had. I like how they put a different twist on something we've known for years. I would definitely recommend checking this place out because I don't know any other place like it!", "author": "Alysha D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-24", "description": "This restaurant needs to open another one in FiDi/SOMA! There are so many employees in downtown who are yearning for healthy and cheap food. This is the best food I've had under $15 which satisfied my nutrition goal and also had good taste. If it is in SOMA, I will probably go there 5 times a week.", "author": "Kelvin Y."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-07-01", "description": "Food is pricey for what you get . I ordered a couple of shrimp and chicken spuds for my family and the amount of meat and sea food was very less . Each dish was priced at 10-11 dollars and I could get much better food for the money I paid here if I had the time to look around for more options . Shrimp has just 4 small shrimps in it and chicken a few pieces here and there..", "author": "Swati S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-10", "description": "Our first visit to the bay area. We found this place to be a great stop for lunch. I have two have two lovely ladies in my life that have celiac (gluten free) not a choice but a must have. This was a welcome place to eat down by the wharf. It's not fancy but very simply a baked potato with good toppings.", "author": "Raymond W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-12", "description": "FULL AS F$&K This place hit the spot the topping were a lil weird being cold the peas and corn I wonder if the can warm those up but I'll definitely return I had the steak and I add chicken perfect combo more then enough toppings get extra sour cream cause it's a huge potato but it reminds me of home the way the potatoes are roasting in the oven I'd come here to study or write!", "author": "Rolin S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-22", "description": "In an area that is seafood based - this place was a blessing! \n\nTheir baked potatoes are HUGGEEE! And they have a LOT of options. Essentially it is a build your own potato bar which lets you decide what you want to eat. My suggestion is to get a baked potato with Alfredo sauce as the topping. You will not regret coming here! \n\nAs well very friendly staff.", "author": "Amit T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-05", "description": "Awesome service, welcomed as soon as we walked in the door\nand spud was delicious  \nwe had veggie and the chicken 1.\nPrice was right too", "author": "Kristy W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-23", "description": "The hot spud potato based dished remained me dishes that are served in North India with butter and pepper. So Yummy.  It is a simple recipe which is loaded with vegetables and cheese.", "author": "Srini K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-15", "description": "I would highly recommend this place to anyone who is searching for a big hearty meal. You get to customize a giant potato by choosing all your toppings. There is a variety of choices regarding meats, veggies, cheeses, and sauces.\n\nThe service was nice, the workers are very sweet and helpful.\n\n*I also tried the sweet potato brownie and it was delicious*", "author": "Gloria P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-09", "description": "This was an awesome place to eat great food, courteous service , and it's just awesome I love it thank you for the great service hot Spud!", "author": "Kim L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-08-18", "description": "We were on our way to hotel at Fishermen's area and saw that place. I am not sure the business run by Turkish people or not but the food is almost \"Kumpir\" which is a baked potato stuffed with some meat and vegetables and kind of a street food in Turkey. Being far from home, we wanted to give a try. \n\nThey were almost closing at wait was 10 minutes for next potato but somehow they made it faster. To go containers are good quality. We paid about $12 for the one with meat, meat cubes were a bit chewy but overall taste is okay. They have many seats to dine in.", "author": "Ceren A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-09", "description": "When craving a baked potato, chances are that if you come upon this place you will be enticed to enter. Yes, I fell for the gimmick, and rightly so. I was hungry and in need of carbs. This place suited me just fine, but in hindsight, you really can make your own at home for way cheaper. \n\nI got a loaded baked potato with butter, shrimp, broccoli, sautéed mushrooms, cheese, and sauce on the side. The spud wasn't bad. It was a nice size and filling however it lacked flavor, and I would have preferred more butter. But it still wasn't too bad and got the job done? Would I do it again? Eh, probably not. Nevertheless, if you're a tourist with a hankering for spuds with toppings, this is the spot!\n\nLikes:\n-convenience\n-unique idea\n-interesting toppings\n\nDislikes:\n-cost\n-lack of flavor \n-a bit expensive", "author": "Tracy T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-28", "description": "Been there a few times and is outstanding service, nice employees and good food. Never fails to impress. Although the seating area is small, the food makes up for it. Usually not too packed. Would highly recommend it to anyone stopping by.", "author": "Jacob B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-19", "description": "Went Easter Sunday after getting off the Big Bus On/Off Tour bus.  Meet the owner and he explained the concept to us.  We ordered and got a great meal!  Will definitely go back when I am back in SFO.  \n\nFood was fresh.  And they know how to make something without cheese (my wife has an allergy to cheese)!\n\nGood experience.", "author": "Brian B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-04", "description": "When craving to eat potato, this is the place to go. The place is clean and bright with the menu right in front of you when you walk in through the door. Someone will take down your order and give you a slip with your order to go down to the left where you pay and pick up your order.\n\nI ordered the steak spud without black olives (not my favorite) and end up getting the sweet potato cheesecake and the sweet potato cheesecake to try as well.\n\nThe steak spud was very filling and delicious. Definitely a better choice than the some of the other fast food places around the wharf. With its reasonable prices and friendly service, this is indeed a good place to try, and maybe just maybe, you might find that you like the food too.", "author": "Jen M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-22", "description": "I ordered the veggie potato with chipotle sauce. At first, I was hesitant because of the price but once the potato came out, I could see the price was worth it by the size of the potato! The potato itself was delicious and creamy. \n\nThe service was efficient and friendly but the only negative comment I could make was that the veggies on my potato were cold and would have preferred them warmed.", "author": "Ashley B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-08", "description": "Craving a large hearty baked potato with ALL the fixins but don't have time to make it yourself? Go to HOT SPUD! I live in Hayes Valley and will make the trek to touristy wharf just for this! For me it's worth it. Significantly better than the baked potatoes at the cheesesteak place at the food court in Stonestown mall.  I LOVE that you can see all the possible toppings and tell them what you want on it.  Even better.. the basics are included (butter, salt, cheese, etc.). \n\nI typically reserve 5 stars for extraordinary experiences. I would like to give this place 4.5 stars but since I can't and it's been such a favorite spot for years it deserves a stellar review. \n\nI usually get butter, salt and pepper, cheese, scallions, sautéed mushrooms, bacon, sour cream, and occasionally will add either peas, corn, steak, shrimp, or Alfredo sauce.  SO DELICIOUS! Grab and go enjoy your heart potato lunch in a nearby park!", "author": "Mel D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-04-28", "description": "We stopped into Hot Spud for lunch while wandering around the shops near Fisherman's Wharf and had a decent bite to eat.\n\nDécor: It's a small shop with just a few seats to stay and eat, most seemed to grab and go, but it's clean and flooded with natural light. The ambiance is chill and relaxed and it's a nice change from all the tourists wandering around outside. The menu is large and can't be missed and there was not a large line at all when we were there. In fact, it was very quiet (not sure why).\nBathroom: unknown\n\nStaff: Everyone was nice and friendly, willing to help with any questions.\n\nFood: The potato was PERFECTLY cooked and delicious! I had the buffalo chicken one and it was very, very tasty. I just had it as it comes and a cup of free water. It was a solid little lunch that filled me up pretty well indeed.\n\nValue: The do not overprice their spuds here. You leave with a satisfied belly and a wallet that still has some cash in it.\n\nI enjoyed this lunch spot and would return in the future. However, I'd try a few more places first.", "author": "Mark B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-03", "description": "Great concept!! Came here for a quick bite. I tried the chicken spud and it was better than I expected.  The ingredients were fresh and a lot different toppings to customize your own baked potato. It's more like a twice-baked potatoes. The insides of the potato is mashed and combined with ingredients and then topped with more ingredients.  A great comfort food.\nI also tried their sweet potato brownie.  It was light and airy. Not too sweet. The sweet potato really worked well in the brownie. . \nOverall, love this place for when I'm feeling for some comfort food.\n\nPS- Skip the restroom if you don't need to use it. It's not the cleanest", "author": "stella c."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-27", "description": "What an excellent concept. This makes for fora great quick lunch or snack before going in the big bus tours or just grabbing something to est. \n\nIt's tasty and satisfying and you do not have to feel gross afterward. I had the veggie spud but I wish I had gotten the shrimp spud because my husband's was delicious! \n\nThese potatoes are huge too so hope you brought somewhat of an appetite. \nI can see this place coming up with great new spud ideas like maybe shrimp jambalaya or something fun.\n\nThe staff was very friendly and helpful, my only complaints were that it was kind of warm in this place and there is no ice for beverages. But otherwise a great place to grab a bite :-)", "author": "Nasha W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-26", "description": "San Francisco has an embarrassment of great eating experiences. The competitive dining environment as well as the enormous food choices in the city, mean that if an establishment is not delivering a high quality product, it will not be long before the word gets out, and the eatery will either improve or fold. Hot Spud gets that all to well. A cozy location blocks from the pier means it sees a lot of foot traffic, but being just off the pier, it can be missed. Someone decided to take me there and I was not disappointed, in fact the first taste of my gourmet steak potato was pure delight. The ingredients are fresh, the steak tender,and all the toppings add to an incredible offering.", "author": "Jimmy L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-20", "description": "They should call this place Super Spud. If you're not wharf-bound specifically for a bread bowl or some Ghirardelli, get food here! Check construction blocks it, but it's still open. For anyone wondering, the chicken spud's sauce isn't too hot, so don't let that put you off.", "author": "Alex B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-07", "description": "This place was definitely exactly as I expected haha. You get a giant potato completely covered in various toppings. I got the veggie spud which had generous helpings of corn, broccoli, and other veggies. I got the hot wings sauce but they only gave very little so I dumped a bunch of tapatio sauce on everything. There was also only a little cheese which was pretty disappointing. The potato could have also been baked a little longer. It was pretty good but would have been amazing if the insides were softer and the edges crispier. Very filling for the price and the restaurant, tho not very exciting or extravagant, was very clean", "author": "Jackie P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-25", "description": "So delicious! This place does Gluten free well and my MIL did not get \"sick\" from any cross contamination. We all got the shrimp potato and it was super delicious and a huge portion. Will visit again.", "author": "Danielle W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-24", "description": "Great spud! We had the chicken and steak spuds. They were massive and we didn't need to eat for the rest of the day! Plenty to power us up for the ride around the waterfront and across the bridge. The addition of hot sauce made it extra special. Yum!", "author": "Amber W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-12", "description": "Interesting concept. Ordered steak spud. Pretty delicious and filling. A bit on the expense side given it is a fast food store.", "author": "Y C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-08-20", "description": "I got the veggie spud and boy was I disappointed. Maybe it had something to do with us doing a take-out or maybe that we were the last order of the day. But the spud was bad. Bland, flavorless and dry :/", "author": "Sagar J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-09", "description": "Pretty good place (not great but good) reminds me of a Subway Resturant for spuds.  Starts with a base and you build from there.  Everything was fine but not outstanding. The potato was cooked well but the toppings (we got veggies) are cold.  Feels kind of weird in the mouth.  If they would roast the corn, grill the veggies it would definitely take things up a notch.  Not convinced local products are being used much, as rows of cans line the wall in the prep kitchen.", "author": "Sharon J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-22", "description": "Pretty solid food at a reasonable price. Especially given the area that it is in. The ordering process is a bit slow though", "author": "Xiao W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-24", "description": "Four and a half stars, round up to 5.\n5.5 stars for the brownies. Worth the visit alone.\n\n4 stars for the potato. It was as good as a potato could be but I'm not sure any potato could fully get me to 5 stars.  \n\nDefinitely would go again and the staff is awesome.", "author": "Greg A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-13", "description": "love love love this place. this is maybe my third or fourth time coming and I'm hooked. so hooked I had to hop on here and do a review! the price might seem a lot at first, but they're definitely worth it! delicious and hits the spot every single time.", "author": "Heather H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-25", "description": "We walked past this restaurant and stopped in here for lunch. It was a great find. They have found so many different ways to prepare a potato. You can also customize it to your liking. The service is excellent and the food was very tasty. My daughter described it best - \"it's like subway, but for potato's\"", "author": "Nadia G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-08", "description": "Love this place!\nWe had super friendly service, and completely safe gluten-free meals which tasted great! Lots of options to choose from, drink selection was perfect, and we sat at the window and watched the people go by as we ate. We will absolutely be back next time we visit San Francisco!", "author": "Erik K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-28", "description": "Awesome FOOD!! Baked potatoes on crack!! Definitely a must stop!!! Priced perfectly!!", "author": "Jos J."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-05-23", "description": "Nearly every table was dirty, the walls  and doors to the bathroom were black and grimy.\nWould not here again, food not very good.", "author": "K. K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-12", "description": "Hands down best tater I've had. They allowed me to try the different sauce toppings, it was honestly a perfect dinner.", "author": "Amanda P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-20", "description": "Nice place to crave something different.  Make sure you are really clear with your order, they are quickly writing down what you are saying in code, and 2 of our 3 orders were wrong.", "author": "David H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-26", "description": "Went here this past weekend and loved it! The man who helped me, helped me create a vegan order and it was delicious! Or as we would say back in Taiwan, 很好吃! (hěnho chī!) :D", "author": "Xiang P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-10", "description": "A really good spot to stop by if you're hungry for some cheesy potato goodness. We got the Veggie Spud and it was really good! Definitely get the sour  cream on top since it really ties in all the flavors together...", "author": "Sneha K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-10-04", "description": "I expected more from this place. I am in love with the turkish concept behind this joint, but I was disappointed this time.\n\nWe ordered the wharf (crab), the shrimp and the steak spuds. The crab was okay; my girlfriend liked it more than I did. The shrimp was really good, but I wish it came with more shrimp. The steak spud was disappointing because the steak was pretty dry. It was close to closing time so maybe that was a factor that contributed to the dryness of the steak.\n\nHot Spud, you owe us a juicy steak spud!", "author": "Omar A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-08-05", "description": "The food tasted good but the shrimp spud had exactly 4 pieces of extra small shrimp. I mean come on you are located in pier 39 and sell a backed potato at the price of all you can eat buffet where you can have unlimited baked potatoes, the least you can do is add a good portion of shrimp", "author": "Jibo N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-27", "description": "I've been passing this place for a long time but the people I hang out with never wanted to eat here. I'm finally here with someone who will eat here with me!\n\nSeriously the most expensive baked potato I've ever eaten but it was really good! It's exactly what I expected and imagined it would be.\n\nI would come again for the food, but not too frequently for the price.", "author": "Karen P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-12", "description": "The food was wonderful very delicious, the girl that took my order was very nice however it was a bit in the dirty side. Or else it would have been 5 stars", "author": "Daniel A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-29", "description": "- delicious chicken spud, plenty of food after a morning of walking\n- friendly staff\n- different vibe than the rest of the tourist traps nearby\n- one star off for cleanliness", "author": "Mari E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-16", "description": "As others have said, the people who work here are super friendly.  The food is really fresh and you can make the potato have whatever toppings you want.  It is a terrific quick and inexpensive option in a very touristy area.", "author": "Stacy C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-02", "description": "The chicken spud. It is all about the chicken spud.  Sooooooo good!  Oh if this place was in a more convenient location than the warf I would come here all the time.", "author": "Daniel A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-22", "description": "My potato was created to amazing goodness. I tried the veggie one with all the free toppings. Sooo good. Definitely a must try and the price is really good for the area (fisherman's wharf). \n\nIf you order online they had some kind of promo as well for $10 off your order of $15+ for your first online order.", "author": "Herman S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-14", "description": "This place makes a great bite to eat if you're tired of the crowds and fast food! The baked potatoes are huge and creamy, and the staff is lovely. I can't really say anything about the price since I get a discount for working on Fisherman's Wharf, but if you're looking to maintain a budget, get the basic Create Your Own spud without the meat. You get all the free ingredients, four veggie choices, and a sauce - still really tasty and filling! I personally get a spud with mushrooms, spinach, peas, and currants with the chipotle tartar sauce. They also offer free cups of water if you're thirsty, so points for that.", "author": "Brandi R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-30", "description": "Pleasantly surprised. Fast, good quality food. Worth the value especially in Fisherman's Wharf", "author": "Lyn D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-23", "description": "Hot Spud was awesomely good! Wifey ordered the chicken and I got the steak. Each bite was full of flavor. A nice mix of ooey gooey cheesy goodness, heaping loads of sour cream, meats, and veggies made this one hell of a meal.", "author": "Brian B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-24", "description": "Hot Spud was just what I was looking for when  I entered the premises with 6 hungry 12-year-old boys. They took the rather complicated orders with ease (each kid wanted different toppings) and they had so many workers behind the bar all the food was done in a jiffy. The manager was very nice (I mean, I had SIX twelve year old boys! He probably wasn't thrilled!) and the kids enjoyed the meal. More details: the place wasn't sparkling, but clean enough. The tables were taller and placed all around the room, so the diners all could each without being on top of each other.", "author": "Cate R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-14", "description": "One of the best spots at Fisherman's Whraf. Food was extremely delicious and prices were low. Try the special one with shrimps, absolutely unique.", "author": "Ilker D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-23", "description": "Best cheesecake ever----AND it is gluten free!!! So glad I don't live here or I would want to go pick one up every.single.freaking.day.", "author": "Sheri R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-16", "description": "Wow!! The potatoes are good, and I don't even like potatoes. That says something about this place. I was hesitant when I saw the prices though but when the potatoes came, I can see why! They came out loaded and generous of toppings. I had \"The Wharf\" with crab meat in it and some lemon sauce, which I don't exactly recall the name, but I recommend it. It's really good. Husband had the chicken spud which has some kind of hot wing sauce on it, and he said it was good.  We didn't try the dessert yet, but, if we have time, we're for sure going back for the dessert.", "author": "Daisy S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-07", "description": "You will, in fact, receive a hot spud when you come here. Hot Spot is like a Chipotle, but with fluffy baked potatoes instead of burritos. I got the traditional - just chives, butter, cheese and bacon, and it was a satisfying little lunch. The niece got something with shrimp, which might sound like a weird combo, but she ate it and enjoyed it. (I think. Teenagers tend to be less communicative than we would like.)", "author": "Han C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-02-19", "description": "Hot Spud is like a Chipotle but for potatoes instead of burritos. The idea seems cool but in reality it is still just baked potatoes with toppings (lots of toppings). It is just not something to get too excited about unless you are a real potato lover.\n\nTried the Shrimp Spud and the Wharf. The shrimp one was tasty. The sauce has a good amount of kick and the toppings went well with the potato. The Wharf, on the other hand, got boring quickly. There were not a whole lot of crab meat to go around and the sauce was mellow. I wanted to redress my potato with some extra condiments but found nothing of interest. \n\nEven though I am not in the camp of potato lovers, I must say that they did a great job baking the spuds. The texture was soft and flaky all the way to the skin.", "author": "Mona W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-02", "description": "Tried this place after randomly seeing it while walking around. Since I'm a potato lover... it called out to me. I looked it up on Yelp real quick, saw good reviews and decided try it. At first I was a bit thrown off by the price but wanted to try it anyways. I'm sure glad I tried it! \n\nMy brother and I decided to split the steak baked potato since we were on our way to get clam chowder at the pier. It's a good thing we split it because it was big!! The guy did not go cheap on the toppings and I loved how they mash the potato instead a bit for you with cheese. The steak tasted good and was tender. A steak potato came with steak, peas, corn, cheese, sour cream, onions and we added bacon. I devoured my half and combined with my calm chowder and coffee, I was beyond stuffed!\n\nThis is not your run of the mill baked potato from the restaurants. They have about 5 or 6 baked potato combos or you can customize your own. If you create your own, it will start at about $7.50. For a combo potato, it's about $10, and with bacon, came out to be about $11. It's 65 cents an extra topping. After getting the potato, I did not feel that it was as expensive as I had originally thought since it's a pretty big potato. I would come here again next time I'm on the pier!! I saw their Thai Crunch salad and it looked really good. I will have to try that next time!!", "author": "Carol N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-30", "description": "First time at Hot Spud. The taters are great with a ton of topping options. I had a salad that was really good also.", "author": "Jer-Ray S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-08-14", "description": "No hand soap in bathroom means employees can't have clean hands. Slow service despite slow business.\n\nShrimp spud was good though.", "author": "Richard L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-28", "description": "Had my first hearty baked potato experience here (other than my failed attempts at home with a microwave)! Every warm bite was a mouthful of sweet corn, soft potatoes, savory bacon, and bits of chicken! The price was about $10, not bad considering how close it is to the touristy Fisherman's Wharf area. The tables were clean, and the customer service was nice and quick. The staff spoke in an energetic, welcoming manner. I loved how casual and welcoming it was. Both the customer service and taste of the food were overall heartwarming and memorable. Will definitely come back again!", "author": "Jane S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-06", "description": "I came in about half an hour before close and they had to make more potatoes--20 mins, they said. Pelin was so sweet and knowledgeable about what ingredients I could have (I'm vegan) that I didn't even mind the wait. I expected it since it was nearing the end of the day. She piled on my veggies--I need them for a long night of studying. Thanks Pelin!", "author": "Danica N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-06-04", "description": "If u enjoy baked potatoes, then you'll enjoy this place. It's a bit pricey for my wallet, but I've found that in SF nothing is cheap (I come from LA). But I really enjoyed my spud!", "author": "DEBB D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-20", "description": "Fast\nGreat \nClean\nEasy to find \nWorth every penny \nSecond time I was there even better", "author": "Mukhammadiev B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-29", "description": "After spending some time in Edinburgh and enjoying their great wealth of jacket potato shops, I was really hoping to find something like that back here. After a little searching, I found Hot Spud. \n\nThe good: Hot Spud is super cheap, has tons of toppings, and the food is great. If you ever find yourself dining with a vegetarian or gluten-free person, it's a great place to go because there are tons of options that suit those diets. They're also very generous with toppings, and portions are large enough for all but the biggest gluttons.\n\nThe bad: Since it's right by the Embarcadero, you can be super close and still need 20 minutes to navigate around all the tourists and get into a parking spot. I got lucky once and found a metered spot, but on my second trip we ended up using a paid lot. It was $5 for every 30 minutes, and it took us about 20-25 minutes to eat and get back to the car.\n\nThe restaurant was also really dirty both times we went. Tables and counters just didn't seem to get wiped down quickly after people used them, and there was a garbage smell wafting in the door that was a little gross. If you're concerned about dirty tables, bring a wet wipe or dampen a napkin. \n\nThe desserts were also not terribly appetizing, maybe because it's harder to bake good gluten-free desserts. They just looked dried out. On the other hand, if you're gluten-free and used to not having many dessert options, you might think they're great.\n\nIt might sound like I have way more negatives than positives, but I do feel like the food and insanely cheap prices outweigh the bad stuff. Still, I wanted to outline both sides of things because it may not be an acceptable tradeoff for others.", "author": "Stefanie H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-13", "description": "Most amazing potatoe I've had ever! Got the shrimp spud and man it's packed with flavor not only on top of that the customer service is amazing. If I'm ever back in The City I'm for sure stopping back at this place!!", "author": "Joshua P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-21", "description": "Great gluten food option for a quick and healthy meal! Salads offered too! Good customer service.", "author": "M A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-16", "description": "Service: excellent. very courteous and helpful and cooperative with special needs. Food: SPUDS ARE AWESOME! Great portion with a bunch of combos and toppings that mix well. The fiesta salad was excellent! The dressing was sooo superb and all the foods are well portioned. Worth it. Go try it only $8-10 a plate", "author": "Vanesha T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-26", "description": "Delicious fast vegetarian and meat lovers meals. I had a mix of both worlds vegetarian spud with bacon, Chipotle sauce and sour cream. Delicious!!!! Highly recommended from an aussie spud meal connoisseur.", "author": "Em G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-21", "description": "This place was right around the corner from our hotel. It's in a nice central area right near Fishermans wharf. \n\nWe went there about 30 minutes before closing, and they were very accommodating and welcoming. I choose the shrimp spud, and it was tasty and the flavours were there. The potato flesh was mixed with cheese which was a nice tasty surprise. And the potato skin was nice and crispy.\n\nOverall it was tasty and satisfying but there is only so much potato that I can take. It was definitely good value for money because the potato was huge!! I got bored towards the end but Never the less it was tasty. If I was in San Fran again I would go back!", "author": "Peter A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-02", "description": "A warm welcome, I felt very much at ease, beautiful interior. It was very good. I enjoyed the service thoroughly and the food was amazing! I will most likely come here again very soon!\nI would highly recommend this establishment considering the total picture, tasty food, good service, decent pricing.", "author": "Amelia K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-14", "description": "Who doesn't love a baked potato bar??   \n\nHot Spud is a fast casual restaurant (a la chipotle style) where you can build your own baked potato.  Everything here, including the sweet potato cheesecake and brownie, is gluten free, which is amazing!  I got the baked potato with spinach, avocado and broccoli- delish!  The potatoes are cooked to perfection (seems like I can never be that patient at home)...moist but not mushy.  Thoroughly enjoyed my meal!", "author": "Cassie P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-03", "description": "Potato Lover 4lyfe. \n\nI  ate two potatoes within a 6 hour time period. definitely the best stuffed potatoes I've ever eaten in my life, and I've had my fair share. Hot spuds was located right under my hotel room and as I passed by I knew I had to try them. So sad today is my last day in San Francisco. Please open in the LA area.", "author": "Ary Z."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-01-27", "description": "Really cool idea for a restaurant. Execution was just a wee bit weak though. Potato wasn't especially great. It's San Francisco, I just can't imagine needing to go here with so many places around the Fisherman's Wharf area. It's not that much cheaper than the other nearby restaurants either. \n\nI will say though it's fun. And totally worth coming up with your own fun combination. Go with friends. Make it fun. Just don't expect really top notch quality. It's just good.", "author": "Nathan B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-12", "description": "Potatoes, hot and tasty. If you come here you'll get a large potatoes cooked hot and soft (not mushy) and a bazillion ways to dress it up. Better yet, the service was friendly and out to please....  While I was wondering if there was enough cheese on mine (it was hidden under some of my toppings) one of the cooks did not hesitate to throw more cheese on mine to make me happy.\n\nGreat bet for something savoury and fast. If you want starch after pigging out at the nearby Ghirardelli factory, this is an excellent counterbalance.  \n\nP.S. bar seats have outlets for charging!", "author": "GB M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-15", "description": "Love this place! I used to come all the time in high school but sadly this location is out of the way for me. I'm still glad I got to come back recently because the spuds are still very delicious. I ordered the chicken spud and it was amazing. So cheesy and full of flavor. I had bacon in mine which I'm not sure if they added in on accident but it was a nice addition. My bf had the steak spud and he loved it. I wish this place wasn't so far so I could frequent it more often. Prices have gone up since the last time I've been here 4-5 years ago but it is reasonable considering this is Fisherman's Wharf.", "author": "Lushi Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-27", "description": "Excellent for a very filling quick bite. The spicy tartar sauce on the shrimp spud had just enough kick.", "author": "Wanda C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-22", "description": "Before I was forced to go gluten free a year ago, I would have said a hot potato restaurant would be a horrible idea. Now that I am gluten free, this concept is the best idea since sliced bread (all puns intended).\n\nHot spud serves 100% gluten free baked potatoes in a variety of styles to match your craving. Chicken, steak, or veggie style they have multiple ways to satisfy your hunger. You can also make your potato to order interactively picking and choosing your toppings from the several meats and vegetables they have for toppings.\n\nThe staff here was very efficient and quickly assembled my order of 3 potatoes. \n\nI recommend the chicken.  It had a touch of spicy buffalo sauce that added the perfect kick.\n\nI'm very happy I stopped in for dinner and can't wait until they start opening some of these locations on the east coast. I need some more \"go to\" lunch locations and this chain would certainly fit the bill.", "author": "Aaron T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-22", "description": "Great tasting spuds with many options and good price. Service was also great! I would eat here again", "author": "Alan Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-17", "description": "This place is in Fishermans Wharf in San Francisco, and as  cool as the wharf is this place just made it even Better!! This is a must try!! I highly recommend it. We ordered  two potatoes one with shrimp (forgot the name) and one with crab (The Wharf). Both were to die for very fresh shrimp very fresh crab very large potato very fresh food awesome toppings everything was A1. Because I was with my friend and it was our 1st time we each got our own so we could sample them both, but one definitely was big enough to share. The staff greeted us immediately immediately when we came in and walked us through the sort of salad bar of toppings and let us make it to order removing and adding what we did not want the staff was very friendly very helpful and also offered a variety of potato desserts (sweet potatoe cheesecake and a chocolate/sweet potato brownie) I will return and so should you!!!!", "author": "Maya B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-19", "description": "Eat here!!!! Delicious and large portions!! You can taste the freshness of the food and it is well priced!\nWe had the Caesar salad and the steak bud - both of which I'd eat again!!", "author": "Alyssa J."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-08-14", "description": "Okay so this place has the key phrase vegan. THIS PLACE IS NOT VEGAN AT ALL. They serve lots of potatoes and chicken and beef and crab and bacon and cheese. All I was able to eat was beer and a Thai salad which was okay but not very good for $10. Go somewhere else or you'll be a sad disappointed hungry vegan. @Hot Spud--remove vegan from your key phrases OR add some actual vegan food to your menu", "author": "Megan T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-05", "description": "This place has a real cool concept...came to grab a quick bite which was perfect for my girlfriend and I.We had the Steak Spud,brew, and Hazeltnut rice pudding. Hit the spot.", "author": "Sosa O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-23", "description": "After 5 years this place is still awesome. Returned to San Fran and had to visit! Got the Wharf with crab and my husband got the Chicken one with Alfredo sauce. He was so impressed at how good it tasted. Still one of my favorites!", "author": "Daniella W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-11", "description": "Super delis! Light n perfection=D Great for this San Francisco weather. Price is right and walking distance from our hotel n pier", "author": "Jessica V."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-03-09", "description": "Walked in about 10 minutes prior to close and was told it would be to go only . No big deal , but felt rushed to place our order. Potatoes aren't anything special but we're tasty . For me the menu seemed a little limited , especially with all the possibilities you have with a potato .", "author": "Greg E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-10", "description": "The spud with shrimp is really really good! The shrimp is cooked to perfection and when it hits your taste buds, you ill be forever happy.\n\nI love treating myself after a long day of classes on Tuesdays. I think I've earned it.\n\nummmm hmmmmm", "author": "Court S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-04", "description": "Great food, unique experience, fair prices. My wife and I both had The Wharf. It was loaded with crab and had a nicely paired sauce. Very tasty and filling. Reminded me of a chip place in England.", "author": "Robert R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-26", "description": "Unique San Fran food at it's best.  Where else are you going to get a potato covered in excellent shrimp, chipotle tartar sauce, corn and olives?  It's a really unique dish and a very affordable lunch destination.  \n\nThey have a good selection of unique bottled soda/beer as well.  The food options are pretty varied as well, and you can also create your own custom potato as well.  The available toppings include bacon, steak, chicken, sausage, shrimp, crab, avocado, a variety of cheeses, and so much more.  There should be something for everyone, unless you don't like potatoes.  Then you're probably out of luck.", "author": "Curtis C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-20", "description": "Great concept and a well appreciated departure from the usual fast-food. The staff was friendly and the food was finished really quick and fresh.\nWe were unsure about the size of the portions after looking at the pictures. Let me tell you: it is plenty. Not to forget that it tastes very good. We had the sausage and the BBQ chicken spud. \nOn top, when you are looking for a gluten-free meal, this place is ideal.", "author": "Sven D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-27", "description": "My partner and I were on a mission to find a really good snack to hit the spot while on the pier. Found this place and it did just that! Staff were friendly and a bit flirtatious  they weren't in a rush to charge us and made us feel very welcome. Chill atmosphere and good music, couldn't take more than two bites without singing along. The food was bomb! Cajun Shrimp Spud and the Warf Spud were on point. The shrimps were a bit spicy just like I like it! Underneath the shrimp was a good sized spud topped with green onion, corn, black olives on the side and cheese. Decided to pass on the sour cream but finger licking good nonetheless. The Warf Spud was very tasty to my liking. I could do without the mound of purple onion but the green onion, sour cream, crab meat, and corn were satisfying. Will defiantly hit up this spot.", "author": "LeleAndJenJen .."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-08-24", "description": "My gf brought one over to my house for lunch. I reheated it up in the microwave and it still tasted good. \n\nSHRIMP SPUD -Grilled shrimp, chipotle tartar sauce, corn, black olives, green onion-Minus  the olives. Yuck. The chipotle tartar sauce is what makes it taste good. They give alot so it covers your whole potato. For over $11 for a bake potato with only 4 itty little pieces of shrimp...not sure if it is worth it.", "author": "Karen H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-13", "description": "The colors reminded me of Sbarros and the set up is basically a Subway/Chipotle...for potatoes.  I don't think this place is so good that you should go out of your way to visit but they definitely know how to make their potatoes! The potatoes they use are big and are cooked well. The guy making my baked potato didn't skimp on any of the toppings and stuffed it full. \n\nIt was a nice change for me since the only time I really eat baked potatoes is if I make it myself at home. This place is around the corner from the Boudins (across the street from the Wharf Inn) and if you're in the mood for a little non-seafood snack, then this is a good place to check out.", "author": "Tina M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-01", "description": "Let me just start off that this may be biased.  I love potatoes in all forms and you could put pretty much anything on a potato and I'll still enjoy it.  I got the wharf which had crab and corn and other things I'd never imagine on a potato but DAMN - it was good.  I scarfed that bad boy down in maybe 15 minutes and almost wanted another one.  Thank goodness this isn't in my hometown or I'd be superfat.", "author": "Julie P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-10", "description": "I had the wharf potato with all the included add-ons (butter, sour cream, cheese). It was delicous. I was worried it would be a lot of onions but it turned out great. I did need about 8 mints after but it was worth it.", "author": "Brandi W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-06", "description": "Finding a spud cafe in US made us happy. We chose the veggie one. The spud was delicious but a bit different from Turkish concept. For example i have never eaten a spud with green onion & broccoli:)  Green onion was well-matched with spud but broccoli not. They can add more pickle and corn in it. The staffs were friendly and helpful.", "author": "Zehra A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-23", "description": "Not quite fast food but not quite a restaurant. Made fresh to order, I made my own with 5 or 6\nIngredients and it came out great. Unique / Nice choice in an area with a lot of the same choices. Worth a look!", "author": "Mike C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-31", "description": "Good food. Served in chipotle style boxes with potatoes. Portion sizes are large and it's quite filling. Definitely worth a try!", "author": "Piyush K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-29", "description": "Who doesn't love a perfectly made hot Spud what the perfect array of toppings. I most definitely recommend trying at least once!", "author": "Layla W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-15", "description": "Yum! Great idea. Fun spot to get a huge baked potato! It's not cheap, but the toppings are fun and delicious. People working there were really nice. Will go again! \n\nThey should get something to put on the bottom of their chairs though. they are so loud on the tile floor. Like crazy loud. \n\nEverything is GF, another bonus for the GF people in my family.", "author": "Keri V."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-07-09", "description": "Contrary to most reviews here, the jacket potatoes are not anything to shout about. Potatoes had very little flavor. Wouldn't bother visiting again.", "author": "Jeremy H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-20", "description": "No exaggeration, they are the best fast food restaurant at Fisherman's warf. I'm their reguler customer and have tried their chicken, steak, vegie and shrimp spud so far. All of them were super delicious. Stuff is friendly and place is really clean. They are not like reguler fast food restaurant, only prices are like fast food restaurants but the rest of all is A+ quality. Thanks  guys for awesome food and service!", "author": "Osman K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-17", "description": "Fantastic! My only wish would be that the potato itself was a bit hotter (so it can super melt everything together). But seriously, that's a very small complaint.", "author": "Cori N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-17", "description": "Simple, healthy and very tasty. Good job guys!!\nI created my own, with not much of toppings, it's just perfect. And all this for a reasonable price.", "author": "Pika C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-12", "description": "Excellent vegetarian options available at this spot. I love baked potatoes and hot spud serves it up perfectly with multiple sauces and toppings to make it delicious. We stepped in to try 1 and as a group of 3 ended up 4 different combinations based on their vegetarian selections. All the other options have meat but they offer flexibility, fantastic service and a quick meal when needed.", "author": "Anisha A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-03", "description": "Up four from three Yelp stars - one extra star simply for a solid lunch/diner spot among the sea of disappointing Wharf eateries. \n\nGood spuds. Decent salads. Friendly service. And fast.\n\nMost of their ingredients are regional/local. Don't be afraid to make your own potato - this way you'll get exactly what you want. And know that they'll do half size salads!", "author": "Mark M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-28", "description": "Probably the best value ($7-$10) and healthiest dining option for tourists and hotel guests in the Fisherman's Wharf area. And the only choice for anyone who requires gluten free food.\n\nNot the best location, next to a 7-Eleven. http://www.yelp.com/biz_photos/hot-spud-san-francisco?select=sFjzFIWKmHn2sD9yoMfuag#YFcAathNcCPBS5PJS0uQYw But the space inside is clean and modern. The interior design seems like a 60's or 70's style - birchwood counter tables, curved shapes, and bright colors (white, orange and lime).\n\nThe staff is welcoming and efficient. http://www.yelp.com/biz_photos/hot-spud-san-francisco?select=sFjzFIWKmHn2sD9yoMfuag#wD94ynH5JrnzV3bH2zzDng I got the steak spud ($8.95) http://www.yelp.com/biz_photos/hot-spud-san-francisco?select=sFjzFIWKmHn2sD9yoMfuag#qRsHsFdPe4b9N1DDkyTAYQ topped with some veggies. It's the most popular menu item.\n\nFor a lighter meal, try the made to order salads. They're all vegetarian (some have cheese), and u can add meat for $1.50-$2.50 more (chicken, beef, sausage). I like the Thai crunch salad ($7.95). http://www.yelp.com/biz_photos/hot-spud-san-francisco?select=sFjzFIWKmHn2sD9yoMfuag#Op9ECHaaGGzep-U19yHFXQ\n\nThe menu also includes: soup (cup $2.95, bowl $4.50) and desserts - sweet potato cheesecake, rice pudding and brownies. They also serve wine and beer.", "author": "Luis C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-12", "description": "It's a good option for celiac people. Almost everything is gluten-free even the deserts.\nThe attendants are super gentle and the potatoes are delicious. \nWe'll definitely come back!!!", "author": "Aline Naiane D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-26", "description": "Yuuuuuuummmmmm! Fast, delicious. The restaurant was super clean and the employees were kind. I had the wharf special and it was So good. The kids created their own foul potato combinations (olives, chicken, broccoli, sour cream, beans. What?) and they were content. Overall, a yummy way to warm up from the cold wharf wind.", "author": "Courtney B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-23", "description": "Hot Spud is a fun and casual shop which fills a restaurant niche I never knew I needed: delicious and highly decked-out baked potatoes. For such an off-the-wall place, Hot Spud was really clean and well-organized, with fresh ingredients and friendly staff. For SF, the prices aren't bad either and although I didn't get my 'spud' to go, service was fast enough that this would be a great choice to grab lunch or a snack with friends.", "author": "Eric M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-04-09", "description": "I basically paid ten dollars for a potato with a little bit of steak and mushrooms. Not worth lol", "author": "Robert L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-05", "description": "I've been here twice and each time, my potato was BOMB!!! My only complaint is random people coming in to ONLY use the bathroom. I know this may be tacky, but they should have a key so that only paying customers can use. Warning, this is very close to the pier, so pretty touristy.", "author": "Al Q."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-07", "description": "Shocked at how good this was! Loved the selection of fresh veggies!", "author": "Jessica L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-03", "description": "It was pretty good! Something we can't get in la for sure :) couldn't finish half! So for the price, it's a big portion. It's a good experience when you're new to San Fran", "author": "Megumi T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-14", "description": "I frickin' Love this place. Perfectly baked potatoes are hand crafted with fantastic fresh ingredients. I live on the other side of Nob Hill and make the trek over about once a week. Yum\n\nIf you are a picky eater, or have food allergies, or like to pretend you have food allergies, they will work with you to create a potato that is perfect for you.\n\nI eat either the Chicken, Beef, or Sausage spud and don't customize it because their recipes are perfect. \n\nI really don't like peas but their peas taste like they were picked about an hour before I got there. They are delicious. All their ingredients are the best. \n\nOrder your potato at the counter. You can stand at the glass divider and watch them make your potato or just go over to the self serve cooler and grab a drink, pop the cap, and take a seat while they make your food. They will call you when it is ready and you then go to the register and pay.\n\nThey have sparkling fruit sodas that are delicious plus a selection of beers and soft drinks.\n\nIf you are a local, let them know at the register and they will give you a discount. I wish they were on the Market Street side of town. They'd have lines out the door if they were in SOMA. It's worth a trip over to the Wharf. Take the F Market Trolley, the Cable Car from Powell, or just walk over on the gorgeous Embarcadero and treat yourself.", "author": "Kyle P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-15", "description": "Came across this place and decided to give it a try even though I just ate. The concept alone was worth giving this place a try in my opinion...how can you say no to a place that specializes in baked potatoes?! \n\nThe options are pretty crazy, and they have a wide selection of toppings to choose from. We got the sausage spud that came with sausage (of course), corn, olives, sour cream, stadium sauce (whatever that is), cheese, and butter. Didn't think it would be as good as it was, everything seemed to mesh well surprisingly.\n\nI wouldn't drive all the way to the city just for this but I will definitely come back to try their other crazy combinations next time I'm in the area!", "author": "Kristin M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-11", "description": "The best baked potato or\"jacket\" potato I've ever had. It was the bomb.com. I had the custom xtra cheesy bacon shrimp broccoli with butter, sour cream and green onion potato. Off the charts! I could stuff my face with a hundred of these delicious tators. A must if you're at Fisherman's wharf. I definitely had a foodgasm.", "author": "Robin W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-27", "description": "Awesome!  We were walking at the wharf and my daughter who is vegan was hungry so I searched vegan options in the area and this place popped up. They were Very accommodating with my daughters vegan requests and there was something for all of us to eat! Delicious and fast.", "author": "Charmaine M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-31", "description": "We are visiting in town and came because they advertised gluten free menu items. If you love potatoes, you must come! The staff is friendly and the potatoes and salads excellent. I had the shrimp spud. The shrimp was excellent. I can't say enough good things!", "author": "Kathi C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-18", "description": "Fun concept. Like a subway but with potatoes! A little pricey but it's SF and in the tourist area so that would be expected.", "author": "Wildeflower M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-08", "description": "Subway of baked potatoes. Long line, but that was to be expected during July 4th near Pier39.\n\nI got the Wharf one, which came with crab, cheese, scallions, and a lemon sauce. Really good, but not as hearty as I wanted. Would probably get a chicken or steak-based option next time.", "author": "Codey O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-06", "description": "So I've walked past this place saying I'll try it and never did and boy did I miss out! I just got a veggie spud with Alfredo and it was delicious. If you enjoy loaded baked potatoes you gotta try it. I'll be trying out the steak or chicken one next time. They have a shrimp and crab one as well so great options. Check it out if your in the area, reasonably priced, great customer service and delicious :)", "author": "Meme K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-12-27", "description": "Just ok. Was really excited about the concept, but not super impressed with the execution. The place didn't seem particularly clean and the ingredients did not seem very fresh.", "author": "Jenny J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-27", "description": "Whether you are just visiting or are a local, if you don't go to this one of a kind restaurant while your here, it's seriously your loss. This place is unlike anything I've ever seen and it's delicious! The sweetest people work there and the food is quality. It's like a burrito bowl but potato. It's so yummy omg seriously my favorite thing in San Fransisco in all my 18 years of life", "author": "Courtney M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-15", "description": "Delicious. We got a The Wharf Spud. Delicious.\n\nWe were concerned that it wasn't busy when we walked away in but now... That's a plus. No line and its amazing. I will visit again when I visit San Francisco. A little gem from the other busy restaurants in the area. \n\nNot expensive $10 a spud... And huge. You can share and still be full.\n\nStop by and taste it for yourself.", "author": "Diana F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-30", "description": "Good wholesome food, just what the family needed after a few days of rich,  sweet dining. \n\nReally enjoyed a change from the usual fare at Fisherman's wharf.", "author": "Geof R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-02", "description": "Great fast food and it is gluten free which is a big plus for me.", "author": "Ellen M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-01", "description": "I consider myself to be a potato head, it was only right that i would fall in love with a potato haven such as Hot Spud. I usually get the chicken or shrimp spud, both are to die for. I love the chipotle tartar sauce and could eat that shit on anything. I highly recommend this hot spot!", "author": "Tinai J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-07-03", "description": "We walked here because it got 4.5 stars and my daughter loves baked potatoes. I got the crab spud. It was okay. We also ordered the steak spud, which was better. Friendly atmosphere.", "author": "Rica A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-26", "description": "Everything I've had here is awesome. Take the fun experience of fast-food, but make the food itself more delicious, healthy, and satisfying, and you've got Hot Spud.", "author": "Webb P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-19", "description": "A little pricey but still good, I go here a few times a week because I work near it.  Definitely worth a try if you like potatoes.  Go with the chicken or steak spud!!", "author": "Aaron P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-30", "description": "I met my sister here for lunch since she works at Fisherman's wharf and has evolved past clam chowder in a bread bowl. This place seems to be frequented by area employees and the occasional wayward tourist. The location is tucked away from the main thoroughfare so it's not as packed as other spots and you can easily get in and out in time to catch a bus tour or scheduled activity. As far as the food, It's a simple concept that works perfectly: Pick your spud, throw on some culinary accessories and dive-in. There are salad options but they specialize in baked potatoes which come with cheese, sc, butter and onions. Go crazy with the topping add-ons at a reasonable cost or pick one or their creations. My potato  was cooked perfectly and I went with the veggie, zero regrets. My sister swears by the shrimp chipotle spud which was tasty but definitely has a kick. My meal was less than $10 with plenty of leftovers for another go around. Highly recommended.", "author": "Kat T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-14", "description": "Great and fun option! The baked potatoes and salads are delicious! The restaurant employees are very clean and change their gloves without us asking (I am vegetarian) out of 11 people they only made 1 small error. They kept all the potatoes organized so we could easily tell who's was who's. Also, they have a large variety of vegetables. The line was short and our order took about 6 minutes. Just be wary- he potatoes are pretty filling and pretty large. (About the size of your foot)", "author": "Swati D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-06", "description": "My sis and I were trying to get a good and reasonably priced ($10 or below) place to have lunch, and we were sick of subway. We chance upon this place and ended up loving it a lot!", "author": "Ting H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-03", "description": "I bought a spud to take out to eat in my hotel room. The service was extremely accomadating. Very friendly.  They let me create my own combination with no issues.  And OMG...that spud was slammin'. The Veggie comb, added chicken and sour cream. DELICIOUS!  An easy and great solution to hunger if you don't want tourist trap food or expensive dining.", "author": "Jomarie B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-02", "description": "Loved this place!!! I love anything potato!!! But this was a great concept! Customize your own potato!!! The potatoes are huge, they are extremely hefty with the toppings, and they taste incredible!!! We went here repeatedly during our stay and I truly wish there was a hot spud in CT!! Friendly staff and really good price!!!", "author": "Morgan W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-06", "description": "I am not a baked potato fan, but when I saw Genevieve Y's and Wilhelm Y's review and photos for Hot Spud on the same day, I was sold and decided to go the next day after work.\n\nParking was easy to find but I think we just got lucky and found a spot right in front.  Bf got the steak spud and I got the wharf to go.  It took less than 10 minutes for both potatoes to be ready.  We were also given samples of their brownie.  The staff was very eager to please.\n\nYum, I LOVED my potato!!  It was HUGE and I was only able to eat about a third of it.  There was a good amount of crab meat and I loved the cheesy, buttery, and salty goodness.. soo good.  I also loved, loved, LOVED the green and red onion.  BF loved his steak potato but beef isn't really my thing.\n\nI didn't like the brownie.  I thought they tasted like bananas, but bf mentioned that they were supposed to be sweet potato brownies.  I took one bite and that was enough.\n\n-1 star.. it's kinda pricey for a potato.", "author": "Vivian H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-02-16", "description": "Baked potato (large) with toppings is the theme. I stayed away from the sauces, seemed like overkill.  Small seating area.", "author": "Mike M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-28", "description": "If you love jacket potatoes ... this is the place ! You can either choose or customise it with veggies and dressing :) loved it!", "author": "Priyanka P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-16", "description": "Add on is 2 for $0.65 each my love and I added avo & mushrooms which are not a bad deal!\n\nGreat customer service!\n\nYummy hot spud!\n\nLove the atmosphere and the workers, super chill and helpful!\n\nWill always return! Thanks you guys!!", "author": "Shells M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-14", "description": "We were looking for a good yet cheap way to end our first night in San Francisco when I came across this place on yelp. \n\nSERVICE: The servers were nice and helpful while taking our orders and assisting us. \n\nAMBIANCE: Underwhelming but in a good way. Besides, I would really rather have an underwhelming ambiance than underwhelming food, which brings us to...\n\nFOOD: We ordered Steak Spuds, the sweet potato brownie, rice pudding, Mixed fruit salad (??) and shrimp spud. Everything was delicious! I mean, personally, I didn't like the rice pudding but my sisters adored it and finished all two servings. The salad may have been a little bit too overdressed as well but it was still good.\n\nI'll try a spud restaurant here in LA and see if I like it as much. After all, I can't go to SF just for spuds. Or can I?", "author": "Lee P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-08", "description": "This is the best place to eat in the Wharf.It is a giant patatoe and awesome fresh toppings in it.Their price is really good for that food and the customer is very friendly.", "author": "İsmail Cem E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-02", "description": "Service with a smile. This shop has old fashioned service.  Great attitudes and terrific food. One day I'll venture beyond the signature veggie spud with Alfredo sauce.  But don't see that happening anytime soon. \n\nYou pick your beverage from a wall of fridges just beyond register.  Desserts are good, especially the mini cheesecakes. Just be sure they're not at room temperature and come from the fridge locker.", "author": "Karl S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-30", "description": "We went on a Sat afternoon and the restaurant was not busy during lunch.\n\nWe had a shrimp, a steak and a crab baked potato.  It is definitely not fancy food but the food was delicious.  The workers were friendly.  It's a good place to grab a fast bit in the area.", "author": "Mike Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-30", "description": "Hot potato goodness!! Delicious toppings and awesome filling meal", "author": "Roxanne R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-10-16", "description": "Wow - major star inflation.  Perhaps a lot of tourists come here and give it high ratings but I have lived in SF for 11+ years and I am super picky. \n\nI work in the area and got a salad to go the other day.  The service was very efficient and friendly but the food was terrible.  I got a chicken ceasar, thinking that it was a pretty sure bet.  The salad was terribly overdressed, the lettuce wilted, the croutons yuck, there was barely any chicken and just all around NOT tasty.\n\nI would not go back, though their potatoes appear to be good.", "author": "Jen K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-16", "description": "I had the pleasure of stopping by to get a meal here recommend by a good friend of mine. I truly did enjoy the shrimp one. It was delicious and I would definitely visit here again when I'm in the are. Staff is friendly too", "author": "Mirlena Z."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-03-08", "description": "Nice concept. Service was strained ... Warm potato with cold fillings made me rate lower ... Great concept though", "author": "Jonelle L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-13", "description": "This place is perfect. I know sf has a lot of good options, but this place is unique and down right delicious. I'm sad to leave sf only eating here once. I'm a very adventurous Easter but my travel companion is extremely picky but this place more than satisfied both of us. \n\nDO IT!", "author": "Chloe G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-06", "description": "So we decided to go with spuds over sandwiches. Yummy!!!! The Wharf was delicious and the crab was fresh. They welcomed substitutions. The salad was fresh and lite. They have one of the best restaurant brownies I've ever had. It was a bit pricey, but for fresh great tasting food with unique flavored, it was the right choice for us.", "author": "Teri J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-26", "description": "A great place for something quick and good. The shrimp potato is amazing. The simple baked potato is my favorite tho. Great meal for the price. Sweet potato cheesecake is a yummy treat too. The staff is happy and friendly. Love it!", "author": "Brandi R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-01", "description": "Really good food, both tasty and high quality. Service is friendly & efficient. I came here as part of a Girl Scout trip - the staff was courteous to  and patient with all 6 of our 5th grade girls. All 8 of our orders came out quickly and as ordered. I wish I lived closer so I could come back!", "author": "Mrs. M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-06", "description": "Wow!  This place is really the bomb.  I had to do a little convincing with the wife and kid in order to get them excited about a baked potato lunch.  Money was getting tight and we were at the tail end of our 1 week vacation.  I saw the positive reviews of my fellow yelpers and thought it was worth a try.\n\nFirst off the owners/managers take great pride in the cleanliness and customer service.  The place was spotless and they make everything to order.  No problems with substitutions, additions, etc.  I went with a steak potato, while my wife and son built chicken spuds.  Large selection of toppings here, almost reminds me of a frozen yogurt  bar.  The potato skin is soaked in olive oil and seasoned masterfully.  \n\nThere should be one of these in every strip mall in LA and the OC.  This is a really great place and amazingly affordable.  The 3 of us ate until stuffed for $25 in the heart of Fisherman's Wharf.", "author": "Scott A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-23", "description": "Always tasty! Something different, gluten free friendly and quick service! Food is always fresh!", "author": "Nicole S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-20", "description": "crew was nice and friendly..place was clean and serves Ice cold beer..the chicken spud was so so delicious! will most definitely be coming back soon..\nthanks you guys for cheering up my girl after she was acting hangry!", "author": "Henry M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-12-21", "description": "Okay, it was a effing potato.  Was it good?  Sure, but it was a potato....\n\nSo, if you're in the mood for a potato, then, hey, you're in luck, because this place has them.\n\nI thought the food was good, I got the sausage potato, it had sausage, some veggies, some sour cream and sauce.  I was tasty, but I don't know if I felt like it was a real meal.  Maybe it's the lack of carbs, but that's probably not a bad thing, maybe it was the lack of a real amount of protein.  I think maybe that's it, for the price, the protein is under represented.\n\nI'd offer the following suggestion, a way to eat the skin afterwards, like if you got a big side of butter (real butter) and sour cream and maybe some cheese.  And an open grill to melt and heat, now that I could go for.\n\nA baked potato, and then when you are done, you get a potato skin appetizer, that would be backwards, but it would beat just throwing the skin away.  Or worse, eating it plain.\n\nAnyway, I'm not bagging on the place, it was good, but that's about it, good.", "author": "Michael B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-15", "description": "This place was literally right across the street from our hotel. We decided to check it out because a.) it was convenient and b.) it had good reviews on Yelp.  \n\nSo after taking a stroll in the city we went, and were immediately greeted by the workers. This is basically a Chipotle-style place with potatoes. You can basically get a custom made spud, with all sorts of yummy toppings. I got mine with steak, corn and cheese, and some other things that I can't quite remember. \n\nEither way, it was very good and healthy compared to other options we had. The price was definitely  reasonable! \n\nWorth checking out if you're in the Fisherman's Wharf area.", "author": "Jessica C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-28", "description": "Good variety of product.  Deceptively filling.  Nice crew.", "author": "Loren H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-12-15", "description": "This is a nice change of pace.  I love baked potatoes, and having the ability to load it up as I want is even better.  The food is very affordable and I walked away full.\n\nThere are plenty of choices.  I added beef, corn, feta and hot sauce.  They automatically mix in a little butter and cheese when they prepare the potato.  They chop up the insides almost like mashed potatoes.\n\nThey do have options other than potatoes.", "author": "Brandon S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-06", "description": "Great place, tried their chicken spud, was very filling and totally enjoyed it, most recommended for those who wanna try something new!", "author": "Jashan S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-08", "description": "Great food, good variety. I suggest you decline sour cream on your \"spud.\"  The rest of the toppings are flavorful and there is already sauce. The sour cream they offered (and I accepted) only diluted the great taste. They have perfected the baked potato.", "author": "Matt W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-11", "description": "I love it. Who doesn't love potatoes? You'd seriously have to be a monster to hate on a good old fashioned baked potato.\n\nThere are always two dudes behind the counter and they're the friendliest people. Service is just excellent. They're speedy and efficient. You couldn't ask for more.\n\nInside it's extremely clean. In fact, the set up reminds me a lot of Chipotle, only better lit. \n\nAs for the baked potatoes themselves, the only thing I dislike is that they, by default, come with an insane amount of sour cream. I'm fairly confident you can ask them to reduce it while they make it (Chipotle style) though and I'll probably do that next time I'm there (which I definitely will be).\n\nOther than that, they're well baked with generous portions on the side. The price may seem a bit up there for a baked potato but don't be fooled. These are definitely a full meal. \n\nI want to see Hot Spud go nationwide because I fucking love potatoes and I really, really like this place. \n\nThe only thing stopping it from being 5 stars? More potato options. I want to see more than just salads and baked potatoes. \n\nGo HAM with those potatoes. You can create SO MUCH with a good fucking potato and I want to see them do that. \n\nOtherwise, if you love potatoes like I do, make the trek over to Hot Spud. It's worth it.", "author": "Jaehak Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-14", "description": "I just got a steak spud here. So tasty and fresh food. You can customize it at your preferences. Staff is very welcoming. I greatly recommend it if you are around. Clean and healthy. Much better than all tourists focused places here. \nI will definitely come back.", "author": "Serge P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-07", "description": "Got the steak spud. I replaced the peas with bacon, which turned out to be a great combination. The amount of toppings was appropriate for the amount of potato. It was a good portioned meal and very flavorful. The steak was well marinated and cooked perfectly, tender and pink on the inside. Only thing I think they could improve on is making the potato skin crispier, which would make it into the perfect hot potato. This is a unique concept for a restaurant and a joy to experience. Reminded me of chipotle in the sense that it was a casual but savory meal.\n\nAlso got the sweet potato brownie, which was especially delicious for a gluten free dessert. Very rich and moist and dense, shared it with another person and we could barely finish it.\n\nGreat service, restaurant is casual and clean. A bit on the pricier side but it is practically in Fisherman 's Wharf. Overall would definitely come back.", "author": "Justin T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-05-26", "description": "So, I chose to try this place out because of the great reviews. I love potatoes and shrimp, so I thought I'd put those two together in the a potato.  It was good and filling. \n\nThe chairs on the other hand are really loud and annoying when you move them around the restaurant. The place also needed a good cleaning. Food on the ground and disgusting bathroom.", "author": "April S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-09-02", "description": "Our Thai salads with chicken was gross.  This place seems very touristy.  Even though the concept is neat, we were just not feeling this place but I can't say you should not try it for yourself.", "author": "Gabriel M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-06-12", "description": "This is a great little restaurant that was conveniently located across the street from our hotel! My family and I ate here after arriving in San Francisco and checking in, so we were pretty hungry! \n\nI got the Shrimp Spud with Chipotle Tartar Sauce and it was woo good! I stepped away for a bit while my hot potato was being made; and when I got back, my food was waiting for me (picked up by my sister or cousin)! They told me that there was supposed to be 5 shrimp on my spud,); but they only had 4, so he reimbursed me 75¢! Super cool!\n\nThe guy working there (I believe he's the owner), was really nice and friendly and the place is nicely decorated!", "author": "Faye M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-17", "description": "Yep .  Five stars.  Great service for starters followed by really good food.  I love this idea and the owner said that due to demand he is adding sweet potatoes to the line up soon.", "author": "Jake R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-16", "description": "Perfect  indulgence for me I crave hot spud all the time best place I been to in a long time", "author": "Nicole A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-08", "description": "Amazing, beautiful, sexy baked potato stuffed with cheese and veggies $8. It reminded me of traveling in Istanbul and baked potato bars on every corner. Hot Spud is very celiac disease-friendly with many gluten-free options including desserts! It is not worthy of a special out of the way trip if you are not nearby or not gluten intolerant. If you are local be sure to tell them, it is an extra 10% off your order (tourist tax). This is a perfect wintertime food (it is not very healthy but it's OK)!", "author": "Shannon Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-05", "description": "This place is so good! Even before I finished my hot potato, I wanted another one. The potato is really more like mashed potato than a baked potato - it's so soft and cheesy. Be careful - you'll start craving this place.", "author": "Theresa M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-03-04", "description": "Well, they've got a neat idea going on here: take a baked potato, throw on some standard toppings, and then add a few extra unique specialty items. And voila, you get a specialty baked potato! I can't believe that no one else has tried this yet, so, why haven't I heard about it before?\n\nSadly, it sounds better in theory than it does when executed. That's not to say the food is bad, oh no. In fact, it's not bad at all, but, the steak potato was certainly not something that wowed me, or left me with the distinct impression that I'd ever crave it and come out here for it.\n\nBut, if you're in the area, are hungry, and like yourself some fancy potatoes, $7-8 will land you a huge, reasonably tasty dish. We actually shared it between three people, but that's because we had made prior food stops, and had a few more to make after this. Still, I imagine one potato can easily make for two meals for one, so there's good value to be had here.", "author": "Johnny W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-05", "description": "Um. Wow! This place is amazing. I don't think I've ever enjoyed a potato this much. We had the chicken  (minus the hot sauce) and the sausage.  Both were spectacular!  If you are in the area- a must try! Live that it's gluten free also. I asked what a sauce was like and they showed me the recipe.  Pretty cool place. 5 stars all the way.  Great food, great service.", "author": "Jennifer A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-01-12", "description": "4.5 Star average? For a glorified baked potato? Really? \n\nI was hanging out in the city with some friends when we decided to have an early dinner (everyone was starving). They wanted to try out Hot Spud. \"Sure\" I said as we headed in the direction of pier 39. I should have said \"how about 'no.'\"\n\nSo I like the concept of Hot Spud. Someone cooks a rather large potato, splits it open lengthwise, adds cheese, veggies, meat, and some type of sauce. A gourmet baked potato. Sounds good, right? So then why was this place such a disappointment? I ordered their chicken spud (chicken, bacon, corn, olives, green onions, and sour cream) and I thought that the potato itself wasn't that great and the chicken was way overcooked. Much too dry. I expect much more from an establishment with 4.5 stars.\n\nIn short: Food is \"meh,\" price is okay, this restaurant is just okay. I probably will not be back considering that there are plenty of dining options in the area.", "author": "John B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-16", "description": "I want to make a point of saying that I AM a San Francisco local. I've of course had better food in the city. However- I gave this place 5 stars and Ill tell you why.\n\nI was recently diagnosed with Celiac Disease and have gotten sick at several places in SF with awesome food claiming to be gluten free. Shame on me for not explaining that I am not Paleo by choice as many gf people in SF are but I have an actual allergic reaction to gluten. \n\nThe staff was accommodating and knew exactly what my condition meant as far as contamination. They changed gloves and explained that only a few salad toppings had gluten like their wonton strips. My husband and I were at America's cup and heading to North Beach for a Comedy Show afterwards and needed a quick bite to eat. I saw that they were Gluten Free friendly on yelp and checked them out! \n\nWe both were really happy with the chicken spud. Nice, warm and filling potato for a cold day on the pier. We split one and that was plenty. I don't care if it may be a tourist spot. I just think a real gluten free, celiac friendly place with good food deserves an awesome review. It's not a bistro or even a nice sit down place, it's a sort of fast food/cafe for a quick bite. \n\nI didn't get sick either and felt awesome! Great experience and am planning on going back! Awesome idea for a food joint!", "author": "Cassie B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-22", "description": "Enormous baked potatoes. Gluten free everything! They had sweet potato cheesecake and sweet potato brownie, both gluten free. For a celiac, that is a dream come true. Absolutely delicious, and the price is reasonable. I have to go here next time I'm in the city.", "author": "Kim D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-12", "description": "Let me start by saying I am a huge baked potato fan.... When I saw this place was just below the hotel I was staying, well I was glad that a least something went right with the hotel experience (See my other reviews for that experience). \n\nOrdered the steak potato and it was exactly what I was hoping for. Steak was cooked perfectly and the rest of the toppings were a perfect complement. \n\nThe guys behind the counter were extremely friendly and the place was clean.\n\nWithout question, I will be returning this trip and every future trip.", "author": "Eric L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-09", "description": "What a cool little place!\n\nPerfect for a smaller meal after a flight, or lunch. \n\nDefinitely will return.", "author": "Eric D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-21", "description": "Their potatoes are huge and honestly worth it's price. I wouldn't suggest getting your own if you just want a snack. The combinations a pretty weird but they work well together. I got the steak spud and I was just  couldn't really finish it by myself though.", "author": "Nikki D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-08", "description": "I'm upgrading one star based on consistency, flavor, and all-around niceness. Took in daughter for the first time yesterday....she ordered a simple potato with traditional fixin's and gobbled it right up. I ordered the Wharf again....yep, total rut....and again loved it. And they are so incredibly friendly there. Why can't you open one in uptown/downtown Oakland? I'm telling you, the lunch business would be out the door! Yum-a-licious.", "author": "Laurie H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-06-28", "description": "I was really excited about working in the warf and having my usual potato fix, but today was a less than stellar experience. Usually when I come here it's quick fast friendly service but today it seemed a little quite than usual. The menu has so many options so making a decision can be tuff. The Oder taker which was a African man was very rude while taking my order, I asked for a basic spud with cheese, sour cream green onion bacon butter and shrimp. I asked for extra cheese also but I guess he did not listen for that modification he just pointed to the items I had mentioned and asked do I want this also. So finally I get  my order the cook attempts to ring me up a 2nd time and I'm thinking why don't you guys communicate or specify that this order is paid. I really didn't feel welcomed this final visit. I also asked for the manager and nobody knew when he came in, so I just told them I will not return and I'm also going to tell everyone else that works with me about this experience. I won't even recommend this place anymore to none of my customers that are interested in a quick bite thank you for taking my money and not giving a shit about me.", "author": "Adrian C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-28", "description": "It's time to profess my LOVE of the Hot Spud. I've been a loyal customer from the day they first opened their doors. I've probably consumed about 200 spuds since then. I'm an addict. They are my spud dealer. I've managed to cut my spud consumption down to about one a week, but the temptation is always there. I never thought I could love potatoes as much as I do. These are NOT your ordinary baked potatoes though.... \n\nMy favorite spud is the shrimp spud. It has Cheese, butter olives, corn, and onions. I add warm sautéed Mushrooms. It is topped with perfectly grilled shrimp. The key ingredient is the Chipotle sauce. I've tried to make this sauce at home and I just can't. It's the most creamy blend of deliciousness. There is a mixture of spicy, little sweet and a dash of lemon. I've reached the point where I request an extra cup on the side. I scrape that spud clean and basically drink the remaining sauce. Like I've said, I am an addict.  \n\nI also like the ambiance. It's perfect for eating alone or eating with a group. The music playing is always a good beat and the colors are cheerful. The staff is awesome. I just feel good going there and it's an overall great experience. \n\nSo if you're wondering whether or not you should check out Hot Spud, I urge you to do so. Just not between 11:30 and 12:00 on the weekdays because that's when I get my fix and I don't want to wait on a long line. ;) ENJOY!\n\nP.S. You get a discount as a local.", "author": "Daisy F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-09", "description": "My boyfriend and I totally came here just to use the bathroom since the area is touristy and public restrooms are not readily available, and felt obligated to buy something out of courtesy. We lucked out with Hot Spud! God knows I love a baked potato, and this place is my heaven. We shared a Chicken baked potato, filled with the usual sour cream, butter, cheese, scallions but it also had delicious chicken, olives, and bacon.\n\n I wish I had one of these closer to home. I know I could easily make it myself but it tastes so much better when somebody else does it for you. Anyway, they also serve beer which I didn't know until after we had payed.", "author": "Alison M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-23", "description": "Great food and convenient location near pier 39 and fishermans wharf parking. I always take the time to eat here every time I end up visiting San Francisco", "author": "Matthew P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-23", "description": "Surprised I haven't reviewed before.  Not in my immediate neighborhood, so I only go occasionally.  The potatoes are large and flavorful and well cooked.  The toppings are generously portioned.\n\nThe staff is super friendly and often gives me the 10% neighborhood discount.  They typically are cool about substituting like for like, and if they recognize you might comp some crunches or extra sauce.  A good karma place, I'm smiling as I type this", "author": "Steve S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-01", "description": "Best. baked. potatoes. ever!\n\nI love potatoes, and have had many baked potatoes. Hot Spud definitely tops the list! If you happen to be in the Fisherman's Wharf/Pier 39 area, you should definitely check this place out! The customer service is amazing, the employees are friendly, and the food is absolutely delicious. I came here with my boyfriend on a weekday at around 4pm. It wasn't packed, but there were people dining which made it a little difficult to find a seat. \n\nFirst off, there are SO many options to choose from, so you will definitely not be disappointed. I opted to make my own potatoes with bacon, cheese, sour cream, chives, corn and a side of alfredo sauce. My boyfriend got the cheese, steak, and sour cream potato with a side of chipotle sauce. The lady who took our orders was super sweet and she even suggested what sauces we should get with our potatoes since all of them were made in house. The wait time was about 10 minutes for a potatoes which wasn't bad.\n\nThe potato was baked to perfection! Earlier, I saw one of the employees mashing/mixing the potato which I found odd, but I soon realized that he was mixing the cheese into the potato instead of piling it on. The bacon wasn't the best since it was pre made, but it was alright. The alfredo sauce, which I HIGHLY recommend, really took the potato to another level! So perfectly creamy, mm! My boyfriend's steak was so juicy! I found myself scraping the sides of the potato to get the leftovers.. something I rarely do lol.\n\nLove this place! Remember, get the alfredo sauce and the steak!", "author": "Joyce E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-11-12", "description": "Service was very good, they answered all the questions to make a good decision. \nSpuds are very tasty. The place is very good, clean and with good music.", "author": "Mari C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-31", "description": "**** 4 stars ****\nI found this place on yelp yesterday since i want to have a great last day of 2011! Therefore, I went there today!:) The male staff is pretty nice to me and my friend!\nAnd i got a steak spud is so delicious and i am full when i was done! Even though i went there at 1pm and didn't eat any food! But my friend got a sausage spud is soso, i think it's too sour for me. Overall this is a great area to have a lunch!", "author": "Kassidi L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-08-04", "description": "TOURISTS BEWARE: Hot Spud is in no way representative of the quality or type of food in San Francisco.  In general, Hot Spud has a nice concept that's not there yet - if they can retool their recipes a bit, they could be churning out some seriously good-enough-to-create-a-line-on-weds-night comfort food.  \n\nWhile some of the toppings are good, you quickly work your way down to a potato with nothing but a huge dollop of butter - basically an unflavored starch-and-fat overload.  It's kind of like eating a cupcake with good frosting but flavorless but fattening cake\n\nI think tweaking the recipe of their \"naked\" potato to have some basics (e.g. Ikes's \"dirty sauce\" or In N Out's \"animal style\" sauce) would help a lot.  The same is true for the veggies which steamed and flavorless - sauteing the veggies and/or adding some seasoning/sauce would make it a much better meal overall.  We all like frosting but it would be nice to eat the whole cupcake.  \n\nOn a positive note, I did like the shrimps, basically a quick saute with salt/pepper garlic - unfortunately they count out exactly 5 smallish shrimp per potato, so the party ends pretty quick.  \n\nAll in all a star for a nice concept and another for friendly staff but minus three for the food - especially since this is likely forming many tourist's impressions of food in SF.  Sigh...", "author": "Rosers M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-13", "description": "Thank heavens for this place cause I could never satisfy my baked potato food craving in SF unless I happened to go to a steakhouse. So awesome in every way from the menu offerings, to the staff, to the location. I've started to make it a lunchtime habit here on my days off - hopping on the Muni 47 inbound, and afterwards I take a walk through Pier 39 down to the Ferry Bldg. Love the friendliness of the staff - they offered me a discount on my last visit even though I didn't work around the area. My fave spud is the veggie which I add shrimp, jalapeno, and chipotle tartar sauce to. Definitely try their sweet potato dessert offerings too - the brownies are the bomb - Mmmmmm delicious!", "author": "Elaine W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-25", "description": "I had the chicken spud, it was very good and filling. I'm a big fan of the buffalo sauce", "author": "Bryan C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-05", "description": "I enjoyed the food here! Came here last week after taking the Ride the Duck tour with my boyfriend and it was delicious.\nIt was walking distance from both Fisherman's Wharf and Pier 39 (right in between). We walked in and there was a short line. There were the right amount of options on the menu including a build your own spud which includes 4 vegetable toppings. We paid then sat down. I really liked how the place looked as well. It was simple but the colorful wall made it look complete.\nLemme just say that the Chipotle Tartar was bomb diggity. The potato was baked nicely and man, everything about it was so good. They also have a mini table of condiments, napkins, and water for the customers.\nThe people working were pretty kind but seemed to be a little bored hahaha.\nAll in all, my boyfriend and I enjoyed our food and experience at Hot Spud. We plan to go back soon to try more from their menu. If all is well during my second time here, I will gladly change my review to the full five stars!", "author": "Shannon C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-02", "description": "On my lazy day off I don't like to even get dressed, so I always order delivery. Its mostly pizza, cheesesteaks, or Chinese, and I always feel guilty after eating it. So today I decided to search for a healthier option and I am SO glad I did. The fruit and nut salad was perfect and I couldn't pass up the wharf spud, which was truly amazing. Delivery was fast and I'll definitely be ordering again soon.", "author": "Liana C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-07-17", "description": "Cool concept, but tastes like your average baked potato. I didn't put any sauce, butter, or cheese on mine, which is probably why it tasted so plain. The chicken was a little bland and not very tender, but the potato was huge.", "author": "Thea S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-06-03", "description": "The food is good here, but just yesterday I received food poisoning from the salad. I feel like I'm dying.. I am never eating here again.", "author": "Mark Q."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-13", "description": "I have been coming here for 3 years! I love getting lunch here when im on my lunch break. I love the staff. They do there best to remember my name ha! They all pretty much remember my usual. Steak Spud, Extra Alfredo, Sour Cream, with Bacon. Same for 3 years. Staff are really chill, the owner is very polite and takes ALOT of pride in his  establishment. For $10 you get a full meal and I have no problem paying $10 for a stuffed stomach.", "author": "Kyle R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-13", "description": "Great food. Jacket potato at its best. You can dress it up with your toppings. Yummmm. I wouldn't get the salads though.  It was basically ice berg lettuce with bits of other stuff. The spud was delicious though.", "author": "Prachi P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-11", "description": "Very good food for the price. No waiting and a friendly staff. We'll probably return again during this visit to Fishermans wharf.", "author": "Jim F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-05-18", "description": "My potato was overcooked so the bottom quarter and the outside was leathery and thick.  The rest of it was fluffy and very tasty and perhaps the potato isn't the point once you fill it with toppings but still I expected to be able to eat the spud.", "author": "Megan B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-07-20", "description": "Came here tonight and got the fiesta salad. It's a typical mexican inspired salad that consists of lettuce, black beans, corns, tomatoes, and tortilla chips. It's not bad, but honestly nothing too special either.\n\nService is friendly, but waaay TOO SLOW. I waited 15 minutes since the family in front of me take forever to order since the employee took the order very slowly. Even after he took my order, he talked to the lady behind me and ended up taking her order at the same time. This is time in most places, but it seems that every spuds order comes with 10 additional questions, so this slows my order even more.\n\nIt's a cute place to eat in the Wharf, but way too slow for my liking.", "author": "Novalina N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-08", "description": "Delicious meal worth repeating.  Friendly bohemian wait staff.  Freshly prepared original menu offerings.  Had chicken spud, shrimp spud and crab spud.  All were enjoyed and all of my family had a clean plate, even my 11 year old daughter.  Great variety of local beverages.", "author": "Mona M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-11", "description": "ITS TATOES BUT AMAZING!!!!   I love their chicken potato combination that they have on the menu.  Its a great mix of spicy and creamy awesomeness", "author": "Andrew C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-29", "description": "It's Hot Spudded check it and see,\nInternal temperature over 103!\nDon't worry baby, it's all gluten free.\nHot Spudded, Hot Spudded!\n\nYou don't have to read my mind\nTo know I want that shrimp chipotle done right\nHoney you oughta know\nSauces and dressing here are made from scratch\nUsing local ingredients you just can't match\nI wanna know, what's taking so long to get here from the wharf! \n\nNow it's up to you, we can eat on a secret redezvous\nJust me and you, I'll show you spuddin' like you never knew.\n\nThat's why it's Hot Spudded check it and see,\nInternal temperature over 103!\nDon't worry baby, it's all gluten free.\nHot Spudded, Hot Spudded!", "author": "Kevin C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-11-26", "description": "Oh please, it's a decent-sized baked potato to which you can go with one of their combinations, or tell them what you want to pile on. An overall rating of 4.5 stars for this place sets the wrong expectation.\n\nI chose the one that comes with crab.  I'd say the crab applied was skimpy, but fresh and tasty.  The scoop of sour cream on top was so cold that it turned the hot, steamy potato fixins into a coolish emulsion when I mixed it in.\n\nLeft with a full tummy, and certainly my potato craving has been sated for a while.", "author": "Lxs S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-03", "description": "Very nice idea for people who eat only gluten free food. A jacked potato (instead of a sandwich) filled with crab, shrimps, meat or vegetables. Highly recommended for a cheap and fast lunch.", "author": "Giulia D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-28", "description": "Great selection of potato toppings. You can get just about anything you want. This place is a couple of blocks away from the wharf, but it is worth the walk. When the the food was great, what really impressed me was the level of service the staff gave to everyone that came in, whether they were paying customers or not. A very old Asian lady came in and sat down at a table next to the front door. One of the guys brought her a glass of water and talked to her as she sat there. I saw her the next day at the pier and it appeared that the lady was homeless. The kindness that the staff showed is rare.", "author": "Bill G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-07", "description": "Good salads. The place doesn't look as put together as I originally thought it would. But that's no biggy. There isn't much variety to the menu. Just salads and potatoes.", "author": "Rachael D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-14", "description": "They will customize any menu item to meet your special dietary restrictions. Then they'll add extra of the stuff you can have. What a great customer service touch.", "author": "Brian F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-22", "description": "Right when we walked in and looked at the menu, the guy behind the counter assured us that he can alter any order according to how we want it. He gave us some time to figure out what we wanted and helped us as soon as we were ready. I ordered a create your own and when I said shrimp, the guy told me that it would take about 7 minutes because they grill to order. It was delicious and tasted really fresh. The service was quick and great. The guy was also very friendly.", "author": "Lora P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-24", "description": "Never had a potato meal before, but really enjoyed the steak mix. Was served nice and hot.", "author": "Kay T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-12", "description": "Great catering services! Cemil was very helpful in setting up a menu for my team. It ended up being way too much food, but that's ok because it was also cheap. We will definitely order from them again!\n\nThey also get extra love from me for being so gluten-free friendly. Go hot spud!", "author": "Natalie P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-03-29", "description": "Amazing! Not only do I love it.. but it has a my fiancé's (he's a jacket potato loving Brit) approval.\n\nThe cheese infused with the scooped out mashed potato and then placed back into the skin is the best part.. definitely adds a lot of flavor in every bite. I've only tried the chicken and veggie spuds.. looking forward to trying the crab and shrimp options. Try the hot wing or chipotle sauce with your spud.. it doesn't disappoint.\n\nJust wish they weren't located in Fisherman's Wharf. It isn't the trek over there that I mind, it is the tourist overload that is overwhelming when I get there.", "author": "Seema M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-25", "description": "This place was my first meal in California. I really didn't want a potato, so I was glad when there were other options. My travel buddy had herself a lovely shrimp potato and she could not stop raving about it. \n\nI had a Thai Crunch salad and it was fantastic. All sorts of delicious tastes and the like. the gave me dressing when I asked for it with no glare or resentment to be seen (you'd be surprised how rude some Boston counter-people can be)! Yay!\n\nMy one reservation was that with all of the fresh foods, the tangerine slices were clearly from a can. No less delicious, but it didn't really fit the scope of fresh everything. I adored, somehow, the counter girl scrubbing actual potatoes in the sink. That's a big thumbs up.", "author": "Cronut C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-03", "description": "This has been the friendliest place I have been. The food is absolutely amazing and they accommodate to any food choices you ask for. After me and my friends first potato, we asked if we could get a half a potato. Though they normally don't do it they were happy to do it for us. I definitely recommend anyone here that wants a delicious, filling and affordable meal.", "author": "Shan L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-03", "description": "Was on a foodie mission in the city and after stuffing our faces with food from the Ferry Building and clam chowder bread bowls at the wharf we were on the way back to the car when we saw Hot Spud. \n\nI didnt think there was any room left in our bellies but after seeing the concept and consulting Yelp we decided to share one! We ended up with the shrimp potato with the chipotle sauce. This was probably the best baked potato I have ever had, I was mad I had to split it with my friends. \n\nNevermind the bread bowls, next time Im in SF its all about the spud. Now if only there was one in LA :)", "author": "jeff l."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-29", "description": "Ever feel in the mood for a potatoe? This is the place to go. It was walking distance from our hotel, and a quick bite before our tourist adventures. They have every kind of potato you can imagine, plus nice salads. I got the steak potato which was delicious. My husband got the Mexican salad which he enjoyed. It wasn't a long wait, and not crowded at 11:00 when they first open.", "author": "Kristen F."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-05-25", "description": "The manager was extremely rude. I asked for a couple of napkins before I ordered and the manager completely blew up and said the napkins were only for customers. Unfortunately I didn't stay long enough to find out if the food was good. Poor management will not earn you my business. Too bad for him.", "author": "Rajeshni N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-25", "description": "This place is more like a fast food restaurant and thus different than I expected. However, the food was great and the price reasonable which is hard to find around the wharf. We would definitely come back.", "author": "Jürgen H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-06-03", "description": "Wow! Really surprised at how good it was here. \n\nA nice treat and would love to see one closer to home!\n\nWhen we got home we tried so hard to recreate one of the spuds we tried, no match to the real thing!", "author": "Erin N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-29", "description": "Almost the whole place is gluten free!! Very fresh and very fast! Delicious giant potatoes!", "author": "Kelly T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-07-30", "description": "I can't remember the last time I said \"no\" to a potato.\n\nWhen I saw Hot Spud on Yelp, I immediately told my coworkers that I was going there Friday after work, whether it be alone or with them.  So, coworker K and I headed there after work around 6:30 PM.\n\nThere were no other people in the shop for some odd reason.  We expected there to be tons of tourists, but even walking along Beach was fairly empty.  So, we both ordered: the chicken spud for her (buffalo wing sauce, chicken, corn, olives) and the Wharf spud for me (crab, a butter sauce, corn, and peppers).\n\nOh. My. God.  I also can't remember the time I had a bad potato, and this was the epitome of YUM STATUS.  Cold crab meat, warm potato innards mashed with butter and salt, creamy butter sauce, corn kibbles.. I can't think of anything better on a cold night when you're starving.\n\nThe staff was super sweet; they came by and gave us a free piece of their sweet potato brownie, and for someone who dislikes brownies and anything too chocolatey, I sort of devoured the whole thing because it tasted unique.  And it tasted very delicious.\n\nThe best part of the night was when they asked us where we worked in the city, and we were just so excited that they didn't take us as tourists.  AWESOME.\n\nStarch, I heart you.  Always and forever.", "author": "Tori S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-07-27", "description": "4.5 stars!!\n\nI love this place!  For me a good baked potato is something that is comforting to eat and makes me feel right at home.  The big, fully loaded baked potato I had last night at Hot Spud was delicious and filling.  I ordered the Steak Spud (http://www.yelp.com/biz_photos/JcyoZPdWdhlsrIVEMdLQ2A?select=sFjzFIWKmHn2sD9yoMfuag) which consisted of grilled steak, alfredo sauce, sauteed mushrooms, black olives, peas, corn and green onion.  They started with a big baked Russet, scored it and broke up the inside of the potato with a small metal spatula.  The alfredo sauce was actually created within the hot potato by adding a little salt, some butter then a mound of freshly grated cheese that was carefully mixed into the entire potato using just the spatula.  The hot potato meat cooked the raw ingredients into a nice thickened sauce.  The other ingredients, all pre-cooked, were piled on top and spread throughout.  My potato preparer even threw in a little bit of sour cream.\n\nI ordered my potato with a cup of the daily soup.  For Monday the soup was Shrimp Vegetable (http://www.yelp.com/biz_photos/JcyoZPdWdhlsrIVEMdLQ2A?select=fyigjwFwcbsTuvV9wy7-cQ).  They have a refrigerator unit full of cold beverages.  Everything from juice drinks to soda or beer and wine is available.  I opted for a complimentary cup of cold H2O stored in the pitchers at the napkin and utensils station.  They even offer discounts if you work in the Fisherman's Wharf area.  I told the gentleman that I didn't qualify because I was actually working out of a North Beach office for the day, and he told me that was close enough and he still gave me the 10 percent off!  I took my food to the big communal table to enjoy.\n\nThe hot soup was delicious.  The clear broth was slightly peppery in flavor and loaded with an assortment of fresh vegetables and lots of baby shrimp.  My potato was outstanding.  I'm pretty certain the potatoes are scrubbed so if you feel like being hearty you can eat these with the skin and all.  The skins were rubbed with some salt though so I just stuck to eating the potato without the skin.  The very generous portion of grilled steak in my potato was lean and tender and all of the flavors just worked very well together.\n\nWhy the half star deduction?  When I finished my meal and went to discard the paper tray, the potato skin, my napkin and the compostable utensils I was shocked not to find a compost bin anywhere.  They only had an area for trash and an area for recycling.  I can't imagine this place generates much trash considering what they serve and the products they serve their food in.  It just bothered me a little to have to toss compostable stuff into the trash bin.", "author": "Wilhelm Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-05", "description": "Found this place on a whim. We were on vacation and had been eating this and that all day and while walking back to the car from the Wharf I looked into the window and said \"Is this a baked potato place?!\" (what an amazing concept right?!) and then we yelped it, and then we quickly made more room in our bellies. \nSince we had been eating all day we decided to share a shrimp potato, but I could have eaten the whole thing alone! The combo sounds strange but It was delicious! And it looked like they had some tasty desserts, but I didn't get a chance to try.\nAlso, the staff was very friendly, the interior was cute, and they played some good tunes while we were there. \nI need to try more potatoes... bring Hot Spud to LA!!!", "author": "Michele B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-22", "description": "The potato was huge and had a ton of toppings. The staff was so nice and helpful. They let me try different sauces and stayed very polite while I was having trouble making a choice.", "author": "Danielle K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-08", "description": "WHOA! I made a quick day trip down to San Francisco, and was feeling a bit hungry. While heading towards the Wharf, I caught Hot Spud out of the corner of my eye, and and thought that I should try it out some time. I hit a restaurant on the Wharf, and after sitting at my table for 15 minutes without so much as being greeted by my server, I walked out and headed back towards Hot Spud. \n\nLet's talk a little about this brilliant idea. Hot Spud is kind of set up like a Chipotle; however, there medium is a GIANT potato. For around $10, I was served a HUGE Idaho Brown, heaping full of Steak, Cheese, Butter, Peas, Corn, Sauteed Mushrooms, all covered in a delicious Alfredo sauce. I ate damn near ever bit of deliciousness in that little black bowl. A day later, I am sitting at work wishing that there were a Hot Spud location in Sacramento. The ingredients were top notch, the meal was cheap, and fast and most importantly, I was happy, and FULL!!! If you are looking to try something new, and in the Fisherman's Wharf area, I highly recommend Hot Spud.", "author": "Kenny W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-07", "description": "Had the chicken spud - Loved it! Tons of topping selections. Beer and wine very reasonablely priced.  Great service and food quality!", "author": "Jim V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-28", "description": "Hm hot spud, I'm very glad I finally got the chance to give you guys a try\n\nI would never think a baked potato at a fast food style joint would ever exist but here i was getting one with steak and also got a salad\n\nI guess it's a \"healthy\" type atmosphere here and they use fresh ideas and ingredients. \n\nTheir salad was TOO simple and so plain. It is definitely something you can make at home. as for their baked potato, it is a unique product. They help you mix the potato so well that it all blends together for a great meal. I prefer this method rather than stuffing a potato and making it look all nice\n\nLastly, I really enjoyed the skin of the potato, it was well seasoned", "author": "Kenny L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-01", "description": "A kitschy shop at Fisherman's Wharf? No fucking way.\n\nHot Spud is a novelty, albeit a tasty one. Getting a decked out potato and a cheap beer certainly beats out that $8 hamburger over at the nearby McDonald's. Those stuck in the area need not die of starvation in the tourist trap capital of the world with this place around.", "author": "Casey S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-04", "description": "Super tasty jacket potatoes! My new favorite spot in this neighborhood. If this place was in the financial district, there would lines around the block at lunch time. I had the veggie, which was excellent. Quick and great for take out.", "author": "Jammy M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-07", "description": "Yummy. Near pier 39. Sadly no public restroom and potatoes were good but kinda small and the food needed more spices.", "author": "robert a."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-11-30", "description": "Never had  a potato like this... All sorts of combos and it makes paying $5 for a spud worth it! Seriously, have you ever had a spud worth paying $5? Well this place will not disappoint you if you give it a go!", "author": "Brian P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-05-25", "description": "Their manager /owner has very poor customer service and he is super rude. I will never come back here. I hope this  restaurant will close because of him.", "author": "Victor M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-30", "description": "I had intended on dining somewhere else but my GPS took me here instead.  I really lucked out b/c Hot Spud ended up being a hell of a snack.  Welcome to the Subway of baked potatoes - have whatever you want on it and hands down, the best baked potato I've ever had.  I guess I accidentally ordered the Chicken Spud as they stuffed this bad boy w/ chicken, alfredo, bacon, corn, and the default goodies (sour cream, green onions, cheese, butter).  Oh also, apparently everything is gluten-free.  I made some good mistakes this day.", "author": "Derrick C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-08-20", "description": "How sweet it is.\n\nAlmost two years since my first visit. Hot Spud now has 155 reviews and a 4.5 star average. No doubt driven by the delicious spuds.\n\nJust don't forget to include in your order an outstanding sweet potato brownie. Healthy in size, taste and nutrition.\n\nAt least for a brownie.", "author": "Jason B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-03-11", "description": "I usually don't crave for potatoes but when I do this is the place I will pick: good fast food with cheap price.", "author": "Yoshikage K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-01", "description": "My boyfriend and I have been regulars here for years. Back when we first started coming, every once in awhile we would arrive and they would be out of potatoes, which was super disappointing. Now, we usually order our veggie spuds in advance over the phone to ensure no mishaps and eat in. The order is always ready for us when we arrive, and we love finishing up with a sweet potato brownie.  I am a big fan of the various Tabasco sauce options and have noticed that the music is always great.  The manager is also excellent. Bottom line: Delicious, healthy, reasonably priced option in the Wharf.", "author": "Noelle F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-07", "description": "Labor day week end at the bay area.\n\nI had been in the area and had not had the chance to visit Fisherman's district.\nI was there with a few friends and we were looking for something to eat. A small poll showed that few of them were not too crazy about seafood. Really? not crazy about seafood and looking for something to eat at this place.\n\nWalking around found this place, (to which non of us had been to) but looked promising and decided to go in. \n\nCheck the menu and order. I tried the steak spud, shrimp spud, mixed fruit and nut salad and ceaser salad.\n\nEverything was really good but my fav was the shrimp salad. It came with a chipotle dressing that complemented the whole thing. Fruit and nut salad was solid good and would get it again. They ask you for your name and put it on the order. When I got my food I was a little confused because we did not order a Caesar salad.  When they realized what had happened the salad became compliment of the house. It was good, but I appreciated the gesture a little bit more.\n\n\nThe service is super nice and helpful and the place is nice colorful and clean.", "author": "Coy M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-12-29", "description": "Tasty spuds and good with food allergies as this was the reason we went here, but come on guys, clean the freaking place!  There was half eaten food everywhere and we had to sit amongst it after having a bit if a tidy up. Floor filthy!!!!!!  Would have got 5 stars for a quick cheap gluten free feed if there wasn't shit everywhere and staff doing nothing. \nJust got home and coeliac daughter feeling very sick. Maybe not true GF after all!", "author": "Graham P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-06-05", "description": "Gluten free? Yes, indeed!\nTo all you Celiacs this place is amazing! Granted they mainly serve potatoes, soup, and salads... But they have an amazing choice of beverages, but more importantly gluten free sweet potato swirled brownies and cheesecake! Both are absolutely wonderful. \nAnytime I travel to the wharf I head over for at least a brownie. Heads up, the last two times I visited they were out of cheesecake the first time, and I got the last brownie the second. So, evening visits may lend to a disappointing adventure. \nDefinitely worth the trip! \nThey also cater to other allergies as well! Check out the menu!", "author": "Jennifer D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-05-09", "description": "When Boyfriend and I stayed out in San Francisco for our staycation, we headed over to the Fisherman's Wharf area for lunch at \"a surprise place I know you'll love,\" he declared. I was a little skeptical, but his surprises are usually lovely, so I figured it'd be alright no matter where we went.\n\nHe took me to Hot Spud. And he was dead on. Because, you see, I have this strange love affair with baked potatoes.\n\nI was introduced to this phenomenon a little late (being Chinese and all, baked potatoes aren't exactly a common choice on the menu), but after I had my first baked potato in high school, I was hooked. Which made Hot Spud an especially wondrous place in my eyes.\n\nThey're this little diner-esque place near the Wharf, but far enough away from the main area that it's not consistently bombarded by tourists. The people there make your food to order and are super nice and informative if you've never been there before. I ordered myself the Sausage Spud and Boyfriend got himself The Wharf (I think). Yummmmmm :9 The potatoes are huge and they literally stuff it gratuitously with the items that you order. I was in spud heaven. I think I only managed to consume about 3/4 of my potato before I had to call it quits or explode from tater-stuffed goodness.\n\nI would, hands down, go back again if I were in the area. I only wish they would branch out from San Francisco and come to the east bay so I could consume them more often :(", "author": "Anna W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-07", "description": "This place is awesome! I only stopped by here because it was close to my hotel, but I'm so glad I did! I ordered the Shrimp Spud and it was delicious. They are fast and friendly!", "author": "Becky R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-30", "description": "I frequently stay at the Sheraton next to Hot Spud. I was looking for a place to grab a quick dinner and saw the Yelp reviews for this place. The reviews do not lie. This place is awesome and a great find!  I ordered the steak spud and it was one of the best meals I've had. I will be back on a very regular basis. You're made to feel welcome the second you walk in.", "author": "Patrick P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-03-11", "description": "I like baked potato but i also like eo eat the skin.\nWell the potato skin was completely hard and unedible.\nAlso my sour cream on top was bigger than my potato. Again, i like sour cream but it was the whole tub on top of my plate.\nEven if i am trying to avoid turist spots in fisherman whatf i think i will not be back.\nIt is reasonably priced but again, it is a potato topped with canned taste vegetables.", "author": "Emy B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-23", "description": "A gluten-free meal! At a real restaurant! Well, it's counter service, but everyone was friendly, and the whole concept of a baked potato shop just makes me gleeful. Since going gluten-free, potatoes have become a staple, and this whole place is pretty safe for even a super-sensitive special snowflake like me. The only things on the menu that aren't GF are the croutons and wonton pieces (although I have to ask, couldn't they get some GF croutons in there instead?), and possibly the Bleu cheese, but I don't care about croutons and I'm vegan & allergic, so I don't care about cheese either.\n\nThey were really cool about the dairy allergy, using separate utensils for my potato. Potatoes start with base toppings of butter, cheese, and salt, and it was easy to get a dairy-free version. I'd called beforehand to ask about dairy-free alternatives to butter and cheese, and was told they weren't selling well enough so they don't serve them any more. Since Earth Balance (vegan butter) and Daiya cheese can both be frozen, I wish they'd change their mind about this. I actually brought my own tiny containers of both with me and they made my potato infinitely better. (Technically I'd call this a 3-star joint, but since I saved my own potato with my own toppings, the experience was one star better.) \n\nBonus points for the black beans offered, because it's hard to get a vegan protein option at most omnivorous restaurants, and nearly all the vegan faux meats are not gluten-free (and never soy-free). Beans are healthy and awesome. Bonus points for corn as a topping, because my partner's favorite (baked or mashed) potato topping is corn. Minus points because my vegetable toppings weren't actually warm. The peas were super cold, and it made most of my potato room temperature. My potato had broccoli (cooked, but not hot), carrots (cooked, room temp), peas, and black beans-- and I apparently got bonus corn, which was also pretty good, just not hot. I'm not sure if that's normal to put cold toppings on a hot potato, but I wish mine had been hot all the way through. It was a chilly foggy day and a warm tater woulda really been a 5 star meal.\n\nThe place wasn't very busy on a Sunday evening, and we didn't have any trouble seating our group of 6. It was a really nice experience. It also wasn't very loud, and it was very clean. There are so few places I can eat without getting sick from gluten contamination that I rarely venture out any more. I can't thank them enough for my safe and tasty experience.\n\nI'll definitely go back (and I don't even mind braving the tourists to go there-- we even got a local discount!), but for this place to really shine, they should consider offering Daiya vegan cheese (cheddar, please!), and soy-free Earth Balance margarine. The cheese can be used straight out of the freezer, and the margarine keeps a very long time in the fridge. The desserts were gluten-free but not vegan. One of the desserts was hazelnut rice pudding, which I'm certain could be made vegan easily. (If you're reading this, Hot Spud, I'd be happy to offer substitution suggestions!) If I could have had a dessert after my potato, that would have seriously rocked my world.", "author": "Jennifer A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-08-30", "description": "I have been here a few times and have tried something different every time. nothing as let me down. \nThe salad with fruit added some shrimp is off the hook good. \nAll the spuds are super good, all the sauces are matched with the meats and the spud itself. \n\nI enjoy everything here", "author": "Blake R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-15", "description": "Highly recommend this unique spot. Gluten free friendly! We had the chicken spud and sausage spud and both were delectable. Kind of nice to have a perfectly cooked baked potatoes loaded with your favorite toppings. They specialize in potatoes, so they've mastered it! This is not like the potato you get as a side dish at another place. This is the MAIN meal and it's great! The desserts are a must try! Brownie, rice pudding, and cheesecake are all gluten free. The two male servers are super friendly and helpful!", "author": "Mike C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-19", "description": "Enjoyed our spuds. Ingredients were fresh. Very satsfying. My husband had the chicken spud with hot wing sauce, I had the veggie with chipotle sauce on the side. Yums!", "author": "Carole H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-09", "description": "A baked potato restaurant - who would've known! I got one with crab, cheese, corn and onion in a lemon butter sauce and it was pretty freakin amazing. Considering you're right next to the pier the crab was awesome. At first I thought the corn would be really weird in it, but I soon learned the corn MADE this! My friend got the chicken one and it was pretty good, as well! I also got their caesar salad with sausage - yum. But i definitely stand by the crab one - oh my. The only thing I dislike is the atmosphere, from other yelpers I do agree it feels very subway/chipotle like. But really chipotle is more comfortable than this place, I'd almost want to take it to go. But the man that helped me was super nice and very accommodating! If you're nearby or are a fan of baked potatoes - stop by Hot Spud!", "author": "Callan B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-06-04", "description": "I knew this place had great reviews so when I took my folks to Pier 39, I made sure we went in for lunch and see what the great reviews are for. Now I know!\n\n1. Tasty tasty idea - spud! Tried the veggie with chipotle and Alfredo sauce. Yummy!\n2. Great service - everyone was helpful, guided us through the menu and gave us delicious suggestions. \n3. Good location -  3 minute walk from the Pier. \n4. Not expensive. \n\nI will definitely visit again!", "author": "Sannidhi J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-21", "description": "Very good, not GREAT, but well worth stopping. I had the steak spud, overall a winner, except for the steak. It had an odd texture, tasted fine - with that said, I give it a strong 4 and recommend you go!", "author": "David M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-11", "description": "What is there not to love about a potato?  Add some delicious toppings, and it's a bonus.  I already proclaim that potatoes alone are one, if not the ultimate, of my favorites foods.  Hot Spud catered lunch for my office so it was set up as a \"build-your-own\" baked potato bar.  Not sure what the setup is like at the restaurant location, but this was a hit.  They brought a variety of meats, veggies, and sauces to load up on top of the giant baked potatoes.  *Important to note that a giant supply of chopped up bacon was included.*  Anyway, moral of the story is that this was a rather tasty baked potato experience.", "author": "Kristen F."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-08-10", "description": "Good food but service can be much better! Got the Wharf spud and the spud was cold, asked if they could reheat it somehow but would not accommodate us. Had to run next door to 7-eleven to use their microwave. Not cool!", "author": "Nicole C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-04-27", "description": "Staying late after a class i decided to come here for some dinner before i got home to my dorm and continued to work \n-.-'  ever since i heard of this place i was intrigued. This place is AWESOME!!!!!!!!!!!! How does this place survive in this area? *easy* its far enough that the tourists go to some crappy highpriced pub instead, but close enough that everyone else knows about it. I could say that this is the Chipoltle of potatoes, but it POWNS Chipoltle.\n\nI'm the type of girl that asks for her indian food spicy. The guy told me that the sauce that comes with the shrimp spud *what i ordered* was alittle on the spicy side and asked me if it was ok- which made it even more ok in my book. The blueberry Izze soda i got to drink overflowed when the guy opened it for me so he got me another 1 even though i told him it was fine. I was about to get up to get my shrimpy potatoe but the guy said kindly he would bring it to me AND whilst eating he asked me if it was ok and if i wanted anymore sauce or anything free of charge. SO...NICE when does this happen anywhere??\n\nThe atmosphere is nice. The guys are even nicer. It reminds me alot of Chipoltles on the inside except without the business-chain awfulness feel. They played alternative and indie music which made things even that much better and calming. \n\nThe shrimp spud was the best potatoe i have ever had! I did not expect much from a potatoe place, this is not like eating a potatoe, i don't know how else to describe it, but its awesome. I hadn't even realized how full i was until i was walking back. For under $8 i was more stuffed than i have ever been on that little in SF probably ever. Idk how they do it- but its SO GOOD. And glutenfree *gluten sensitivities r common* the sauce did have a kick but a delightful 1. I wouldn't say it was spicy persay, i'd say itz exactly how it should be. This place is so amazing and i am even happier i have class down here on Wednesdays, i will so be back!\n\nI was the last person there and i ate extra fast *i typically eat slow* because i didn't want them to wait for me after closing- even though they never pressured me or closed their doors. They actually seemed to take pride in their work and even seemed to enjoy my company as a consumer- also when does that ever happen??!!\n\nHot Spud- you've officially found a new lover ^.^", "author": "Brittainie B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-12", "description": "This place is good! Just that it's around the corner on Mason. If they were more visible they would be really busy, but Hey. Word of mouth they are good!", "author": "Sammy S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-03", "description": "Good value. The food was good and there was plenty of it. Plenty of ways to customize depending on what kind of mood you're in.", "author": "Brian P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-02-13", "description": "This was such a great way to start our afternoon in the city!  We found a great deal on the \"Groupon Now Deals\" and decided to give it a try.  Definitely worth the $11 for $20!  We were able to get two huge potatoes and two cokes, and only pay an extra $1.52 after using the groupon.  \n\nThis was a great, filling meal for a dreary afternoon.  We chose to get two different kinds, the Chicken and the Steak.  The chicken potato was better than the steak, but if you don't like hot sauce the steak would be a good second choice.  If you like potato skin it is a 50/50 chance of good or bad... the skin on the steak potato was perfect, but the skin on the chicken potato was kind of overdone and tough.  The place was still worth 5 stars... the employees were pretty nice as well... the cashier patiently waited about 5 minutes for me to pull up my groupon since my phone app wasn't working correctly.  \n\nI would suggest this place for a good, cheap lunch when you head to the city.  \n\n- Just a tip, I got horrible directions from my cell phone navigation, so be careful if you try google maps for directions.  It's right off of Embarcadero, you don't need to take the whole tour of the city google maps gives you!", "author": "Lucia R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-12", "description": "Luv it! Had 3 guys with us who were't sure about going, but they ended up loving the brownies. We would return", "author": "Autumn T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-04", "description": "Loved, LOVED, Loved the food and the service!\nWas visiting San Fran and Fisherman's Wharf and had a voucher that I bought 'blindly' and WOW! What a pleasant surprise! The spuds were amazing (lots of food for your $, so come hungry!), the staff was VERY friendly, helpful and wonderful!\nOver all great experience and so close to all the attractions!\nWay to go \"Hot Spuds\"! Great concept, DELISH food & wonderful staff!", "author": "Karen K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-03-28", "description": "I absolutely loved this place!  I didn't realize that all they sold was baked potatoes when I decided to go there, but it's such a unique idea, and they did it well!  I stood there in awe for a few minutes just taking in the whole concept.  They have pre made options for what to put on your baked potato or you can create your own.  I'm gluten free, and I would have just assumed that baked potatoes and whatever you can imagine to put on them would be gluten free, but the staff went out of their way to mention that all the meats and sauces were gluten free and not to worry.  They paid such good attention and care to their customers, and the baked potato i had was awesome (alfredo sauce and chicken and peas and corn i think?).  I will definitely be sure to go back next time i'm in town.", "author": "Kate L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-05-29", "description": "I work a block from this place and did a Yelp search for \"Salad\" near \"Fisherman's Wharf San Francisco\".  Had seen this place in passing before but assume the \"Spud\" in \"Hot Spud\" meant potatoes and not much else.  So when I found the menu on their website included salads, I decided to give it a try, and called in my order for pick-up in a few minutes.  I chose the Thai Crunch Signature Salad with added chicken and it was ready when I walked in.  Told them that I'd liked the fact that it was listed as gluten-free and I love a good salad.  \n\nEmphasis on GOOD salad.  Unfortunately, this one kind of missed the mark a bit.  \n\nWhat missed was flavor in the peanut dressing.  Just wasn't very zippy and seemed tired.  Not enough dressing, either... seems like it was watered down so that the salad ingredients were covered with SOMETHING, but that something seemed very thin and bland.  A dressing should glisten and have real pep.  This wasn't it.  \n\nAlso, the mandarin orange slices were limp and looked like they were old and falling apart.  Too long in the can, perhaps?  I like canned mandarins in my salads at home, but they usually come out of the can firm and plump and flavorful.  These were mushy... not good at all.  \n\nOverall, I give them a 3 (1 for the salad, 1 for the service and 1 for the neighbor discount)... decent service to have it ready in the 5 minutes from the time I called to walk over and pick it up, and overall fresh ingredients in the mix... and plenty of them.  \n\nBut the peanut dressing needs to get REAL and spice it up to a real Thai experience.  If you guys really make your dressings from scratch, try this recipe I use:\n\nhttp://allrecipes.com/recipe/thai-peanut-dressing/\n\nAnd the mandarins should always be checked for firm plumpness when they're taken from the can to the set-up bin.  You'd think those food service supply companies would make sure their #10 cans have fresh product in them.  \n\nOne extra thumbs-up for a 10% \"neighbor discount\" because I work around the corner.  But only a better dressing and fresher mandarins will bring me back for another salad.  Tell me you've done better and I'll definitely be back.  \n\nPotatoes aren't my thing but salads are.", "author": "K.C. F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-13", "description": "HOT SPUD IS AWESOME!!! \nNever knew a baked potato could be a meal. After walking passed Hot Spud a couple of times trying to avoid going in to buy the Sweeth Potato Brownie that is advertised in the window, I finally just broke down. Glad I did! I ended up getting the Veggie Spud and boy was is great! It was loaded with everything. After that night, I was there every night for the next couple of nights while visiting San Fran. One of those nights my boyfriend bought the Thai Crunch Salad and we didn't realize until we arrived back at the hotel that the dressing wasn't put into the bag. He went back to Hot Spud and the young lady there was so apologetic. She gave him the salad dressing, $5.00 back and a spud for the inconvenience. Such great customer service.....The staff is awesome!!", "author": "Sharlena S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-28", "description": "I ordered the shrimp potato without the black olives. It was really good. The sauce that comes with it is called chipotle tarter sauce. It's different but in a good way. Overall my experience was memorable. I recommend getting the Anchor Steam beer with your meal, sitting at a hightop, and watching the tourists trip over their children.", "author": "Daniel M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-12-24", "description": "Hot potato\nFound this place on yelp when we desparately needed quick food before we boarded our boat to Alcatrez island. Very modern, very friendly, quick & clean service. \nAffordable but with a drink it might tip you over 10 bucks. \n\nHow does it taste. \nto be fair I already liked the regular baked potatoes that they sell at most places including wendys but this place does it up a couple of levels. I mean a giant potatoe with the insides filled with sausage in my case. Crab in my brother's case. alot of cheeese and other magic ingrediants. \n\ntheir drink selection is pretty awesome too with soda pops and regular sodas.", "author": "Zan O."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-02-23", "description": "Service is very bad. Staffs are unfriendly and place is dirty. There was no napkin instead a toilet paper towel was placed at the counter in exchange of the napkin. Rude middle eastern guy. Unpolite and uncourteous. Wiping the counter with a dirty cloth.", "author": "Luisa C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-08-13", "description": "It is never okay to place a box that has been on the floor on top of a food preparation surface. It is also never okay to prepare food without gloves on both hands, especially when the ungloved hand touches the food and food surfaces and utensils. It is not okay to move from storage and cleaning or cashier to food prep without washing your hands. \n\nI got the sausage spud, and the pork sausage was not kept at the appropriate hot temperature before serving... it was way too cold. The only warm thing on my potato was the potato. The vegetables were all canned and not fresh. The chipotle sauce contained a dairy product, but it was also suspiciously room temperature. \n\nThe food was high in sodium and low in flavor (probably a result of being canned). I would never come back. If this is 4.5 stars in North Beach, I'd hate to see what the other restaurants in this touristy neighborhood are like. \n\n$9 for a bland baked potato? Never again.\n\nPS - they do not compost. Major San Francisco fail.", "author": "Bootylicious J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-12", "description": "I am not a fan of having a potato on its own but Hot Spud made me go WOW! We had a Veggie one and one chicken spud and i swear we did not speak for the 10-15 odd minutes that we were eating. Totally recommended! Oh and great service too.", "author": "Shruti D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-10", "description": "I love Hot Spud! It's great food, service, and people, at an excellent price. There food is not processed, like so many of the food chains you see at Fisherman's Wharf. They make the food quickly, without losing any of the quality.", "author": "Kenny T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-29", "description": "We had the salad and veggie hot spud, and they were excellent, we're looking forward to coming again soon.", "author": "Swaroop C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-02-11", "description": "nice option to all the fish and chips and richness in the area /// fun & different lunch::: the ingredients seemed fresh, everything tasted good and we were overall happy on our choice to try something new.  we had the vegetarian with crab and lemon beurre blanc, the steak one, the vegetarian with chipotle and a mandarin salad.  the only thing I wish was for a lighter option for a sauce and everything tasted a little bit sweet (although our pallets are prob dif than most).  the service was great and I wish them great success.", "author": "Sarah B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-08-21", "description": "I'm not kidding when I say that this baked potato was the highlight of a 7 day California vacation for my wife. Just about everything in the restaurant is gluten free and my wife went with the chicken spud loaded with everything. She was so happy eating the potato that I honestly started to get a little jealous hearing her moan and exclaim with every bite. She even got up when she was done and gave the guy at the counter an extra tip - I was worried she might start making out with him. \n\nNeedless to say this place is highly recommended if you're looking for a GF lunch option near Fisherman's Wharf or if you're a potato lover.", "author": "Brian W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-03", "description": "I'm trying to workout more lately so my body can match my totes rad personality; and I can hopefully rid myself of the ever dreaded FUPA. However, I have learned if I do not eat something prior to my dreaded death workouts, about 30 minutes in, I want to kill someone, and that someone is usually myself. \n\nEnter Hot Spud. My Wednesday Zumba/Spin savior. For about $7 I can get a delicious potato loaded with vegetables that not only gives me a much needed boost of energy, but also doesn't leave me feeling like a slovenly disgusting pig. The location is incredibly convenient, service is fast (HELLA fast), and the window seat is great for people watching. And by people watching I mean eye fucking Euro tourists. \n\nTheir desserts look good too, but in the interest of my ass I decided to avoid them. Until next week at least.", "author": "Jillian M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-09-03", "description": "We stopped by right as it opened for lunch the other day.  We were welcomed in by the extremely friendly staff.  I ordered the Wharf Spud (crab, onions, corn, etc.) and my girlfriend ordered the Steak Spud (steak, olives, alfredo sauce).  Total came to about $25, after drinks and tax.  \n\nOur potatoes came out after a few minutes of preparation.  They loaded up the potatoes big time with the toppings.  The corn, onions, and cheese gave the potatoes a very colorful look.  And as good as these potatoes looked, the taste was even better.  Both of our potatoes tasted extremely fresh.  My Wharf Spud contained real crab, and it went very well with the hot potato.  It was a very filling and delicious lunch.\n\nAnd just a disclaimer: I am not a huge fan of baked potatoes.  But next time I am in the area, I am definitely going to make another trip to Hot Spud.  That's how good it is!", "author": "King T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-29", "description": "Whoa! This place gives you quite the meal! Glad I gave this a try,  coming back on my next visit for sure!", "author": "Mick M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-25", "description": "The food and the service here is absolutely outstanding. You get top quality food and ingredients for a great price along with wonderful customer service. I work about a block away so we order food here pretty often and the quality is consistent. I would highly recommend eating here!", "author": "Jennifer S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-06", "description": "Pretty impressed, fast service, nice guys. Great quick place to get a bite to eat. We got the number one seller. Chicken potatoe with hot wing sauce, that was delish. And then custom made one with cheese and broccoli for the girls.", "author": "J T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-16", "description": "When friends want to wander the waterfront I no longer let out a painful groan because I know I can take them to Hot Spud for lunch. \n\nI tried the Wharf potato and it was tasty and very filling. The place is only a block up from the tourist trap but that seemed to be enough to keep them at bay.", "author": "Jordan P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-09-03", "description": "Being gluten-free I was glad to find this place. The location is a little hidden and the parking isn't ideal but it's worth the time. It's so relaxing going into a restaurant and not having to worry about which items you can eat off the menu. Everything here is gluten free!! Even the desserts! Definitely try the brownies when you're there, they are delicious and soft!!\nYou don't have to be gluten-free to enjoy this place, I've brought my friends here and they loved it too! Everything is perfectly priced, c'mon you people who complain about the pricing.. This is San Francisco after all!!\nAnd the owners are such a nice couple! Will definitely be coming here more often now that I'm moving closer to the area!! Love you Hot Spud!!", "author": "Olga D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-27", "description": "Very nice folks, good service.  A potato is a pretty humble spud but it's so satisfying on a cold blustery day near Fisherman's wharf.  Add in the myriad ways in which the super friendly staff here dress up perfectly baked potatoes with tasty fixins' and you've got a great lunch time break spot!", "author": "Alan S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-02", "description": "Was in hurry bought an amazing piece of cake and coffee.  Won't forget to visit again !", "author": "J A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-18", "description": "Great food! I've tried a few of the different spuds and I can't decide which one I like the best. I do wish however that the staff was more welcoming and friendly.", "author": "Lisa V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-14", "description": "Friendly service and the Steak Spud was delicious! Yes, you're paying almost $8 for a baked potato, but I guarantee you it is worth it. Almost everything at Fisherman's Wharf is beyond overrated, but Hot Spud is a legit gem in a pool of tourist-bait crap.", "author": "Katie S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-12-05", "description": "I'm a huge spud fan, so what better than a food place dedicated to taters? Giant taters with every type of topping, sweet tater pie? Sadly, I was disappointed. Yes, you can have your ginormous spud but seriously the place is an overgrown airport takeaway joint. No ambience at all for the $7 minimum potatoes. You feel like shoving it down as fast as possible and running out along the scenery-less street.  Portions are okay, but I mean a potato costs like $.50c so to say it is cheap is totally going overboard.  The staff is okay, they don't bring things to you, as mentioned it's a takeaway place.", "author": "Colleen H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-02-20", "description": "Foodie awesomeness. Real food real people really good. The only place besides Pat's cafe and Taqueria San Jose #3 where you can find a quick meal that won't kill you in 20 years. Two thumbs up\nHint: get the steak spud!", "author": "Antoinette C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-04", "description": "My wife and I were just about to take a cab out from Fisherman's Wharf when we stumbled on Hot Spud. We stopped for an after dinner snack, and I'm so glad we did. The place was empty, but the staff was super friendly. We shared a potato with bacon for just like $6, and the portion was quite generous! Wasn't overdone with the butter or cheese either and in fact felt incredibly light for essentially being a loaded potato. Turned out to be one of the better surprise finds of our trip and will definitely stop here again in the future!", "author": "Patrick H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-22", "description": "Had the veggie potato and the GF sweet potato chocolate brownie and they were both amazing. Celiac friendly.", "author": "SillYak 1."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-12", "description": "This place is awesome. Came here before the firework show and I was very impressed. The pre made spuds were what we ordered. We got our order very quickly and employees did not hesitate to offer is sauces to try with our potatoes. Staff was excellent and friendly. We stayed in there for maybe 20 minutes but left blown away. Not bad for just randomly stumbling into this place for a quick bite", "author": "Mark S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-31", "description": "One of the best baked potatoes I've ever had! I was walking from the parking garage to fishermans wharf and good thing I took the route I took because I discovered this gem! I ordered \"the wharf\" and it was perfectly cooked. There was corn cheese butter onions and green onions, with sour cream but what topped it off was the crab in the center ! The crab was not imitation either. It was sooooooo good. I will make sure I stop by everytime I hit the city. I'm so glad I found this place! I'm just a big fan of potatoes maybe that's why I like this place so much lol", "author": "Guen S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-08", "description": "Dear Hot Spud, \nThank you for being the only place in Fisherman's Wharf to get hot, yummy vegan and vegetarian food.\nI know that you have bacon and cheese and steak potatoes too, but for me, I am in love with your simple potato with broccoli and sautéed mushrooms. So cheap, so filling, so vegan.\nI also love your selection of stevia sweetened organic sodas. You clearly rock.\nSincerely, \nLocal that works down here.", "author": "S N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-16", "description": "excellent grub and Gluten-Free brownies and cheesecake, are you kidding me?!?!  One of the best G-F desserts i have ever had.  Staff was very friendly especially considering the fact that we walked in about 2 munutes before they closed for the day.", "author": "Todd B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-09-08", "description": "The idea of Hot Spud is so simple: baked potatoes customized with your choice of toppings, and so so good! I love that they are so accommodating w/ substitutions. The boyfriend and I had the vegetarian baked potato but added sausage.\n\nOnly downside would be that the preparation is a little slow. But the staff is extremely friendly, and it's different from all the other food options in the area. Five stars!", "author": "Catherine C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-03-18", "description": "My boyfriend and I keep seeing this place when were at Pier 39 and wanted to try it. My boyfriend saw a Groupon deal for it, $12 for $20. We both ordered something different so I got the steak spud and he got the chicken spud. And 2 sodas to balance the groupon spent. \n\nThe chicken spud was good, but a bit spicey. I liked mine better. It was a big potato with stuff that i ate like half. If you like/love potatos, I think this is a place for you. :)\n\nWe probably will go here if we are craving potato and havent aten. :)", "author": "Gen M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-16", "description": "Best potatoes I've ever eaten. But then again, when you slather butter, sour cream, onions, cheese, and then top it off with crab meat, how can you ever go wrong?", "author": "Andy C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-02-29", "description": "This place isn't bad. I always wanted to try this place. I saw a Groupon Now deal, $12 for $20 worth of food so I bought it and came here with my girlfriend.\n\nWe each got a different item. I had the chicken spud and she got the steak spud. We also grabbed 2 sodas and paid the difference which was $1.52. Not bad. $13 lunch for 2 people.\n\nThe chicken spud was good. Its a bit spicy but I liked it. I had a couple of bites of my girlfriends steak spud. It wasn't bad at all. She liked it. No complaints.\n\nThis place is on the pricier side. It cost about $7-$9 for one gourmet baked potato. But its not bad since you are in the smack middle of Pier 39, one of the biggest tourist traps in San Francisco.\n\nIf you do choose to come here, get their Groupon Now deal! I will definitely be back! =)", "author": "Daniel S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-06-01", "description": "Read a bunch of very good reviews and thought to give it a shot. Tried a  seafood one and the veg one. Lacked flavor and seasoning.", "author": "Sandeep K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-28", "description": "All I can say is this place rocked. The service was remarkable; both the server and cashier were wonderful and patient. But the food itself was mouthwatering. It was the best baked potato I had, and the multiple flavors merging together in the spud made the price completely worth it--did I mention the potato is huge? I would definitely recommend Hot Spud to anyone visiting San fransisco.", "author": "Ano N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-04", "description": "I've never been a fan of Mr or Mrs Potato Head. I think they're creepy looking, quite frankly. Due to this aversion, I've also been a little skeptical and put off by places that offer \"dressed up\" potatoes. Yes, I'm going to blame THAT on my childhood...because I can....and Yelp therapy is free.\nThat all being said, when you're in cold-ass Fisherman's Wharf with a 3 year old and a fellow Kauaian on a budget; you want something cheap, hot, close to the hotel, close to your parking space, and low-key. This place is AWESOME. I should have also mentioned that all 3 of us are gluten free (okay, so my friend is only SOMETIMES gluten free but still). \nAlana and I each got the chicken spud...it kind of reads like a hot wing...and I LOVE me some hot wings! Cheese, chicken, hot wing sauce, sour cream, olives, corn all atop a generous potato. It was perfect! We also got the sweet potato brownies which Alana dubbed \"the best gluten free ANYTHING I've ever had!\"...they were moist, flavorful, chocolatey....nom nom nom nom. Alana literally asked them what time they opened the next day (she was staying across the street LOL) and when they would have more (we bought the last two). We each had a glass of wine and the staff was so amazing that they let us stay almost 2 HOURS after they closed (we thought they closed at 9 but they closed at 7)...seriously...WHO does that?! It was awesome and I think it's probably the best food and value (certainly for gluten free) in the area. All that goodness and it was less than $30! 24 hours of parking up the street will cost you the same amount...but it'll leave a shitty taste in your mouth.", "author": "Jill D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-08-01", "description": "I am in lesbians this place. I would order with less salt, and maybe less cheese. And always sour cream on the side. Maybe less butter too. \n\nService is AWESOME. The owner is friendly AND funny, and the workers are just great. The wait isn't too long either.\n\nRestaurant is tiny, but it's cute and clean and the potatoes are so easy to eat and very shareable. \n\nOther than that... I dunno. I just love potatoes and I love veggies and it's really awesome.\n\nOh. The only critique I have is that it's in a really strange place. I feel like this would do great downtown Palo Alto, Mountain View, Los Altos, anywhere, just not the wharf area. Kind of like... seems more like a locals place, but it's in a really touristy area? I dunno, I'm just saying because I want it to move closer to me.", "author": "Hayne P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-17", "description": "Wish we had one of these in Ohio! Great for those looking to eat gluten free. Same idea as Chipotle, but mixing it up with Baked Potatoes. They put everything you want and more. \n\nVery reasonably priced. \n\nThe sweet potato cheese cake is sooo good to.", "author": "Caresse s."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-04", "description": "I found this place through Yelp, which was awesome because it seems like there are so few really good restaurants/eateries near the wharf and Pier 39.  This place lived up to its rave reviews.  The potatoes were huge and easily splittable between 2 people. They fluff up the potato to give it a wonderful consistency and the toppings are amazing.  I went here twice with my girlfriend during a very recent visit to SF, and we shared the chicken spud  both times because it was so good.  However, I must say that unlike most Yelpers who reviewed this place, I was not a fan of their sweet potato cheesecake.  The slice was very small for being almost $4 and I didn't really like the flavor.  Personally, I think The Cheesecake Factory's pumpkin cheesecake is much better, so minus one star for that.  \n\nI do hope to see this place still in business on my next visit to SF.  It didn't really ever seem crowded.", "author": "J. S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-03-26", "description": "Baked potatoes! One of my favorite foods of all time.\n\nYou can't go wrong with this place, you get to pick your toppings and they all look so good I am tempted to put them ALL on.", "author": "Kina M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-11", "description": "If you want a nice food at affordable price, this is the place. The salads that we ordered was delicious and fresh.  Close to major area attractions. Friendly staff ! Recommended!", "author": "Fernando N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-10-25", "description": "Good spuds, expensive for what it is. A place to try. \nInteresting place. in that you get a potato and they put stuff in it.  Think of it like a chipotle of potatoes.  \nSo if you really like customizable hot potatos this is your place.  \nI figured I would give it a try cause when else would I go to a place like this?\nI got the chicken one with everyone on it.  It had a very hot wings kind of flavor, which to me is lacking.  I would come back to try the beef version as it looked pretty good.  \nIt was also incredibly slow, as there was just 3 of us and it took quite a while.  I wouldn't think of going here during the dinner or lunch rush.  They were nice though.  \nGluten free because it's all potatoes. \nFor the price the truck thing I went to was better.", "author": "Dr K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-11", "description": "Long story short the food here is great and staff is awesome. Can't recommend enough. I got the steak spud which is great as always and if they have the sweet potato brownies out I would recommend too.", "author": "Richard S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-01", "description": "Pros:\n* It can (in theory) be a healthy meal. Yet it's very filling!\n* The execution, ingredients and flavors are excellent.\n* The main chef (I'm assuming - he was training other staff) is very involved, and really seems to care about what his customers think.\n* Instead of making everybody custom build a spud-meal, they give you a set of configurations. This would probably make orders faster when the place is busy.\n\nCons:\n* This is probably the most expensive spud you will ever buy.  (However, it's cheap for a meal if you think about it that way.)\n\nOverall, I recommend it if you like potatoes, and you've not yet experienced Hot Spud.", "author": "Andrew M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-14", "description": "Guys this is one great place!!  Healthy, tasty, and a great price!  What more could you ask for????", "author": "Riz G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-18", "description": "Wait? An all potato restaurant mere blocks from my house?!! EUREKA!!! \n\nPOTATOES! \n\nGD I love them.\n\nIn fact they are one of my four food groups and I'm pretty sure my body composition is 35% potatoes. My Polish ancestors would approve.  \n\nSo many expectations and I was not disappointed! The people that work there are super fantastic, you can choose from many of the fresh toppings or there are a bunch of combo options to pick out on the menu. They mash it all up in front of you with butter and cheese and then let you go to town. The cherry on top of this wonderful carbohydrate sundae? Wine! Yes. They serve wine and beer. \n\nHappy days!", "author": "Eli B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-03", "description": "I've been going to Hot Spud for about a year and a half now & I am glad to say that it has never let me down.  However, I may be biased since I only order the steak spud, but it's so good every time that I find myself craving HS a few times a month.  If your looking for something DIFFERENT around the Wharf, go to hot spud.  \n\nAlso, their sweet potato brownies are incredible.  Save room!", "author": "Brian M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-07-03", "description": "I was so excited to eat at this place when I came to San Francisco for the first time with my husband...and so disappointed with the result. The food was decent and most of it is safe for gluten-free people (like me). But the staff was SO RUDE that we will not be going back. They made a mistake on our order and then had an attitude when we politely asked them to change it. As we were leaving, one staff member rudely called out, \"Hey! Did you pay?\" We had payed when we ordered....it's fast food style. Wow. Awful, awful service. We will never be going back", "author": "Sarah H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-22", "description": "Great little restaurant for a snack.  Not ideal for a lunch or dinner kind of meal.  Spuds are made quickly.  Only problem is that you need to check if they give me all that they promised.  I mean, we ordered 2 veggie spuds on our first visit and even though the menu said it contains black olives, we did not find any in our spuds.  The second time, we made our own spuds and we could not find any green onions in our spuds even though it comes free :(\n\nBut on the whole, it is a place for a quick snack and the spuds (we have tried only veggie spuds) taste great!  Tried the sweet potato brownie and it was awesome!! \n\nNoise level is a bit annoying.", "author": "Viji K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-11-22", "description": "Staying nearby for business and needed a easy quick bite. This place is great. Friendly service and an easy menu to find what you want. I had the Wharf Spud and it was lovely. Not chinsy on the crab btw!!", "author": "Beth O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-14", "description": "I too came here during the Living Social deal not sure what to expect since loaded baked potatoes is a new restaurant concept for me. I was happily surprised! 4 of us all got different things and we left full. They have tons of fresh toppings, as well as sauces like chipotle tartar or spicy wing! \n\nInstead of a potato I got a salad - the Thai Crunch with chicken. It was made to order and really flavorful. The thai peanut dressing was very good without being too heavy. They also have many sodas AND beer! \n\nOverall a great place for lunch, just wish they were in a different location as I know most locals don't venture here often. Come to the Financial District!! I think this would be really popular for a lunch to go.", "author": "Natalie N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-10-02", "description": "I highly recommend this place.\n\nWe went in here today, after seeing great reviews on Yelp, to get some dinner. I got the steak, and my friend got the chicken. Both were really good, and unique.. not just a change of meat. They definitely put a lot of thought into what goes into each special. They also offer a plain version, with your choice of toppings, which is great for the picky eaters.\n\nThe location is a little hard to find because there is a tree (i think) obstructing the logo, so it is harder to see from the main street. I hope people see this on yelp and go there, because I want one on every corner!\n\nAlso, don't think of it as just a snack, it really fills you up!", "author": "Zach A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-02-20", "description": "I gave this place  5 stars because of the awesome service! I had the stuffed potato with crab meat not knowing what to expect, and I have to say it was really REALLY good. I also had the caesar salad but it wasn't like the traditional caesar salad, its much better and healthier. The salad was lightly dressed with a hint of citrus and mixed with parmesan cheese. For dessert we had a sweet potato brownie which was amazing. Great food, awesome staff and in walking distance to pier 39.", "author": "Jen L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-02", "description": "How awesome! I was in town on business and this is the first place I went to. It's great because it's perfectly set up for single eaters and you don't have to feel awkward when the waiter comes by and takes away the second plate at your table.\n\nIt's quick service. It's potatoes. They also have salads, sides, and beer. You can pick from one of their many pre-designed potatoes or you can make one up. Like Subway, it's made fresh. Unlike Subway, it's way better.\n\nI had a veggie potato with bacon (I know, I'm not really a vegetarian). Including a drink, I'd say the whole thing came out to be less than $10. Most of the utensils are made from that recycled potato stuff and they definitely have separate disposal areas for recycling and trash. Love it.\n\nIf you're in the Wharf area and you don't want some overpriced, \"shi shi\" sort of place that overlooks the bay and touts the \"best [insert seafood name here] in San Francisco\" try out this place. It's beyond well priced and more than enough food for one person.", "author": "Lauren P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-08-18", "description": "I absolutely adore potatoes in every form, so a restaurant devoted entirely to my favorite tuber? i'm sold.  \n\nAfraid of being overwhelmed by tourists at the wharf on a Saturday night, we braved Hot Spud and to our excitement, the restaurant was relatively quiet (though i hope it picks up in the future once word gets out...but not too much that i'll have to wait hours for a potato).  I already knew going in I was going for \"the wharf\" Crab, corn, red/green onions, cheese, butter, deliciousness.  \n\n1st of all, the potatoes themselves are very good.  I frequently make baked potatoes for dinner for myself at home, and none of my potatoes are as big and delicious as these.  I'm not a huge fan of the skins when I have a baked potato, but at Hot Spud, I couldn't stop eating the potato, even the skin!\n\n2nd of all, the toppings are generous, fresh, and oh so good.  I highly recommend anything and everything here even though I've only tried one flavor so far.  I'm that confident that this place serves delicious food.  \n\n3rd of all, get the sweet potato cheesecake.  We tried both that and the brownie, and while both good, the cheesecake definitely stood out above the brownie.  \n\nI hope this place does well and sticks around for awhile because the potato deserves such a restaurant to showcase its glorious taste, and Hot Spud rises to the occasion.", "author": "Anne Marie B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-08-28", "description": "This is a down to earth San Francisco joint that honestly had the best baked potato I've had in my lifetime. A friendly staff and diverse menu make this place a go-to for late nights. If you're a local you get a discount too! They just recently opened shop in SF and they are doin it right! I'll be coming back every week!", "author": "Darren D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-05-18", "description": "My fiancée and I stopped in here while walking down to fisherman's wharf. We were starving and this place received good reviews. I ordered the chicken potato and my fiancée got the steak potato. Both were delicious! Both of them had ingredients that I would never think to put on a potato. The chicken potato had corn, black olives, buffalo sauce, sour cream, and a bunch of other stuff I don't remember but it was delicious! The service was also really great. We waited for maybe one minute when we walked in and the gentleman behind the counter told us he would be right with us and then apologized for the (nonexistent) wait. A woman in a wheel chair ordered after us and he brought her food out to her and helped get her get set up at a table with silverware and condiments. For two potatoes, a root beer, and a bottle of water it was right around $20. Great tasting food, great service, and a great price!", "author": "Moira R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-07", "description": "I know.  It's weird.  Don't let that stop you from trying it.\n\nYou can get out of here for just over $10, which makes it cheap food (hard to find in SF).  It is incredibly filling - and tasty too.  \n\nSo they take a potato, cut it open and throw butter on it.  They top it with small pieces of meat (so you don't have to cut them) and some other veggies.  Sour cream and chives top most dishes.\n\nThe shrimp spud is great.  The chicken is pretty good too.  If for nothing else, go for the experience!", "author": "Ted H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-15", "description": "This is a great idea!  I love this concept, and wish I had a place like this in Atlanta.  If you get the broccoli on your potato though be careful...they don't cut it up and give you huge chunks.  It would be better if they would cut it to use just the florets.  I did like the fact that they had plastic cups with a pitcher of water available for those who did not want to pay $2 for a bottle of water.", "author": "Rebecca W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-21", "description": "Lots of topping choices for their huge baked potatoes.  For $7.45 you can choose four toppings and a sauce.  Salads and toppings are all fresh.  Friendly service.", "author": "Donna D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-06-01", "description": "Cool spot!  In this area, most eating options are either industrially-made fast-food, or overpriced crowded tourist-traps.\n\nDecor was really nice and artsy.\n\nIt's owned and run by a young couple, and that's really inspiring to me.  They are really nice people.\n\nAs for the food... they were a little on the slow side.  As time goes on, I think they'll get \"in the groove\" more and be able to handle more people at once.  If you need something to do while waiting, get a beer - they're only $3.25!  When my food did arrive, however, it was really good. They'll make a potato pretty much any way you want it.\n\nAlso of note - they make salads too.  It's hard to find a quick take-out joint that will make a fresh salad, but this place squarely fits the bill there.", "author": "Mike R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-04-17", "description": "Tasty!  Who knew that potatoes could have so much variety.  I ordered the chicken spud which was pretty tasty -- maybe I'm a baked potato purist, but I think I may have liked the good ol' fashioned bacon/sour cream/chive combo a bit better.  The staff was really friendly and accommodating though - always a plus.", "author": "Mel G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-07-23", "description": "A friend of mine told me about this place. I also never really Yelp about a place unless I feel that I need to either rant or rave about it. It's a new restaurant near pier 39. First, I'm a big fan of potatoes.  When it comes to gourmet potatoes, this place means business. Today, I tried the chicken spud and accompanied it with a fiesta salad. Oh my.. the potato was cooked just right and the ingredients complimented each other very well. The salad was very delicious and you could tell, all the vegetables were fresh and prepared with love. In the end, I had the sweet potato brownie. That was delicious. Very moist and flavorful.\n\nThe staff was very friendly and very helpful in helping you decide what kind of spud you want.\n\nI will definitely go back. I wish this place the best!", "author": "Ed M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-08-21", "description": "Wow, I'm so glad I randomly stopped by this place! I work near by and am so happy to have found a delicious spot to get lunch. \n\nTheir dishes are made with love right in front of you. It's a new restaurant and you can tell they put everything they've got into making great food for each customer. \n\nI got a spud with chicken, and got to add whatever veggies and sauces I wanted. I ate the whole thing... I mean the ENTIRE THING! MMM... Loved it.\n\nThis place has made me actually look forward to the crummy winter weather, just so that I can eat Hot Spud's and be comforted from the cold!", "author": "Meredith S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-05", "description": "i love baked potatoes! I was very excited to try this place tonight. when we got there, there were only two people sitting inside and we were looking over the menu. another couple walked in and the people working there told all 4 of us that there were only two potatoes left and because we got there first, we had to decide if we wanted them or not.  we felt bad for the other couple, but i had been waiting all day for this.  it was nice that they let us decide first, but it was a bit awkward.\n\ni had the wharf, which has crab, corn, and onions. it was pricey but delicious. i could only eat about half of it, the potatoes are so big here!\nmy husband got the chicken and it was delicious!  they mush up the potato and ingredients a bit for you and have lots of tabasco sauce, salt, and pepper for you to use.\n\ni would definitely come back here, hopefully soon, and will be dreaming of potatoes until then!", "author": "Yummy E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-08-20", "description": "After researching where to find gluten free restaurants in San Francisco I decided to give Hot Spud a try. This was definitely a good decision!\n\nFirst of all I love potatoes! So this is the place for me. Hot Spud is a nice and clean fast food type of place. They have a choice of differently filled baked potatoes, salads, soups and desserts. I chose the shrimp filled potato and it was simply delicious. The shrimp were grilled and really really good. I loved the whole arrangement. I added a cesar  salad which had freshly shaved parmesan on top and a very tasty dressing. My husband had the same potato but added crabmeat which tasted very fresh. I ordered the sweet potato cheesecake to go so I could enjoy it later. Everything was wonderful. Including the staff. Very nice and friendly people!\n\nAs someone sensitive to gluten it is a real challenge to find a place to eat out. At Hot Spud one does not have to worry about cross contamination because everything (besides croutons which can be added to your salad) is gluten free!\n\nI will definitely be back!", "author": "Daniela Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-10-01", "description": "Love this place!  I go to school around the corner at Alliant, and there is just no good place to get lunch that isn't full of tourists or ridiculously overpriced.  I ordered a potato with veggies and grilled shrimp and I couldn't have been more pleased!  Shrimp was grilled in front of me, veggies were fresh and the potato was devoured quickly.  A bonus: super friendly staff and reasonably priced!  Also, you can build a salad and the ingredients are super fresh.\n\nI will most definitely be returning!", "author": "Amber H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-10-21", "description": "Good potatoes, even better prices. Nice & clean place. \n\nBut I wish they wouldn't play techno music... it makes people eat faster, which isn't very healthy. I noticed the music and had to make a special effort not to eat along with the music.", "author": "Wendy M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-09-16", "description": "walked in last week with hubby and baby after we saw what looked like a potato place..really? Brought up in New Zealand we definitely miss our baked potatoes. \n\nWe got the chicken spud. The moist potato combined with crunchy Bacon just tasted amazing! Friendly staff and 10% local discount ...woohoo. I feel an addiction coming on...", "author": "isis n."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-24", "description": "If you want to get full quickly and inexpensively, this is the perfect place to go.  \nIf you would like to eat healthy, you can ask them to hold butter and cheese.", "author": "David O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-04-19", "description": "Passed several pizza bars and burger joints and found this gem. Great, flavorful and moist baked potato with many options for toppings.  Mine had sausage, corn, peas and some kind of Alfredo sauce. \nThe server asked us to wait an extra 10 minutes for fresh potatoes but offered us free drinks. Not something you would expect in the Fisherman's Wharf Area.", "author": "Stephen T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-10-23", "description": "The premise is pretty simple: baked potatoes with toppings. This is executed very well, and there are plenty of options to choose from. I ordered The Wharf, which was prepared and served in only a few minutes. The result was a delicious crabby and potatoey treat. I can't wait to return and try the other ones!", "author": "Sean W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-06-29", "description": "The potoatoes are like A slightly smaller version of my head on Steroids!!\n\nThese huge Babies are amazing. From the way they blend the butter and cheese into the potato to the unbelivable amount of toppings and sauces they offer. This place is sure to get to the heart of any potato or salad lover as the salads have fresh greens and any of the topping you can have on your potato, you can also put on your salad! OMG! \n\nI am leaving this one short and sweet and suggest that if you are in the Wharf. 1 block before you hit Jefferson so its not as crowded..stop by and grab yourself one of these monsters. \n\nI usually tell them to surprise me and it has been a good surprise every single time!!", "author": "Damien K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-24", "description": "This restaurant was right around the corner from our hotel and I hesitated to try because I questioned how good you could really make something as simple as a baked potato, but they were terrific! We had the buffalo chicken spud and one of the fruit salads. The potato was excellent, great flavor in the meat and plenty of it! The salad was fresh and had lots of strawberries and just the right amount of dressing. The owner and employees were friendly and helpful and they do have a restroom for customers! Great, simple place!", "author": "Julie B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-08-19", "description": "I have been there 4 times in one month..and whenever I meet my friends in Wharf I suggest them to go to Hot Spud..\nuntil now I tried chicken, wharf and shrimp spuds..and i think my favorite is shrimp spud..I never could imagine that shrimp and baked potato can suit each other..but somehow they managed it..so they gained my appreciation..;) \ni'm sure that i'll go there after this time also..with bringing my friends..", "author": "mert k."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-07", "description": "WOW!  I love this place.  Came in from out of town and was looking for a healthy place to snap up dinner after my work-out.  I looked at the menu online and hit it up when I was done with my run.  The guys who work here are really nice and it was empty, since it was 5 pm so I got lucky and missed the dinner rush.  I ordered a custom potato with black beans, sauteed mushrooms, black olives and feta cheese (on the side).  Just a tip, they mix cheese (cheddar jack) and butter INTO the potato before they put the toppings on so if you would like a healthier option, get that stuff on the side.  I opted for butter, buffalo wings sauce and feta - on side.  The potatoes are on the large side so I wouldn't recommend this for a snack.  I also ordered a Thai Crunch Salad that I'm going to save for lunch.  I'm getting full from the potato.  This will definitely hit my rotation when I come into town.  So glad I found this place.  Thanks Yelpers!", "author": "Sarah W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-06-05", "description": "Wow wow wow. Welcome to my mouth, super loaded potato! We got the sausage potato with generous amounts of sliced sausage, peas, sour cream, kernels of corn (huh?), bits of green onion, and cheese. It was the BEST baked potato I have ever met. And the service here was great. Because they were baking more potatoes we had to wait 15 minutes, but we got a nice little discount on our bill (no sales tax). I will take the bus here to try the whole menu. \n\nI don't like the piece of art on the wall with dots, though.", "author": "Kimmie M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-09-26", "description": "Damn but that was one tasty potato!\n\nI didn't see a vegan option.  Admittedly, I didn't ask about soy cheese...\n\nBut the Veggie Potato was excellent!  First they gut the potato and sew some lovely cheese into it.  And then it's sauteed mushrooms, peas, olives, and onions.\n\nAlso worth mentioning: the folks behind the counter were super-nice.  If only we had that kind of service in Ocean City, MD!", "author": "Evan L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-27", "description": "This is a good place to go if you're looking for a basic, low cost cafe near the Wharf, and has vegetarian/gluten free options. The staff was very courteous and accommodating with substitutions, and the food well-prepared. \n\nThe bathroom could use a good cleaning, however. Otherwise it would have been 5 stars.", "author": "Josie E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-12-31", "description": "My veggie potato was pretty good... happy to have found a gluten free vegetarian friendly spot in SF while we were there visiting :)", "author": "Lizzy P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-04", "description": "I love this spot since my friend showed it to me. We got it delivered to work as well, which was pretty awesome. So far, everyone I have taken there has enjoyed the food.", "author": "Humberto F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-12-28", "description": "It's a hot potato with toppings that you choose.. how can it go wrong?  The people who work here are super nice.  I get the potato without butter since they already load it up with cheese.  The place is clean and well kept.  I work around Pier 39 and its always hard to find a decent place to eat.  This will be my lunch stop staple.\n\nTip: if you work around there, you get 10% off.", "author": "Helen C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-07", "description": "Gotta love a place that serves BAKED POTATOES!!!!\n\n\nI've had the chicken one and The Wharf. Love them both\n\nThe Wharf could use a little more crab and lemon.\n\nWould also love it if they had Tapatio hot sauce in addition to the Tabasco they already have. \n\nA few more drink selections would be nice also. \n\nAll in all, they're AWESOME!", "author": "Leo V."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-01-13", "description": "Discovered this place from the thrillist and then yelped.\n\nThe store: pretty spacious, frozen yogurt shop type of feel to it. You can see them make your potato when you order like at Subway. You eat at tall, shared, bar tables.\n\nLocation: I came on a rainy Sunday afternoon so there were plenty of metered parking but since it's located by pier 39, I would imagine it'd be hard to find parking.\n\nFood: I got The Wharf which has crab, onions, corn, green onions, and sour cream. All potatoes come with butter and cheese mixed into it. It was pretty good until the richness got to me. Only finished about 2/3rds of the potato. The potato itself is pretty big. Pricing is on the higher side. $10 for the whole thing. The sweet potato cheesecake on the other hand is to die for. The sweet potato brownie is good but not amazing.\n\nMention Yelp and you could get a 10% or 15% discount. I forget which one. I'd be down to come back and try more. Next time.. less cheese and more premium toppings please.", "author": "Dorothy W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-09-08", "description": "The potatoes were to die for however, they have to work on being more organized and a little cleaner.", "author": "Ally M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-20", "description": "First time here, very friendly staff. Everything looked great, chicken spud was awesome!", "author": "Eric H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-10-23", "description": "Good food, reasonable prices.  The potatos were GIANT.  The filling tasted really good and seemed fresh.\n\nI was totally surprised that the store was so empty, but I figure it's busier on a weekday lunch thing.  We would have given four stars based on the filling, but both of our potatos were burnt on the outside.\n\nOtherwise, a good deal.", "author": "Suze C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-11-24", "description": "I officially love Hot Spud.\n\n1) Ingredients\nEvery single ingredient is fresh and great quality. From the cheese to the peas!\n\n2) Portions\nOne potato. One meal. Very satisfying.\n\n3) Options\nYou can build it however you want and there's a long list to choose from.\n\n4) Service\nEveryone is super friendly! And it's quick!\n\nOne of the best places to eat at and avoid tourists. \nAlso, it's affordable (sweet!)", "author": "kevin l."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-12", "description": "This was one of the places I told myself i wanted to try while in San Francisco! I ordered the chicken potato and had no complaints! Very tasty and the hot sauce made it especially yummy! My sister ordered the veggie one, and she needed to add a little hot sauce to hers but all in all the food was good. I wouldn't say it was anything spectacular but then came the desserts! Gluten free cheesecake and gluten free brownies! Amazing! The potatoes were good but the desserts here made this a 4 star for me!", "author": "Tiffany A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-10-17", "description": "I really wanted to be excited about this place after seeing the stellar reviews from other Yelpers.  We had an opportunity to eat here after a cruise in the Bay, and walked a bit out of our way to find it.  \n\nStuff in a potato.  High quality ingredients and friendly service at a decent price.  But on the whole, I think it was AOK.  \n\nThe restaurant has a chilly feel to it, despite the name being Hot Spud.  The seating and decor reminds me of a froyo place a la Pinkberry because of the modern minimalist furniture and colored lights.  Maybe that's why I didn't get as much out of the experience as I had expected.  \n\nBut maybe I'm just not enough into potatoes.   \n\nBummed that I forgot to mention Yelp for a discount.  If you're going, make sure you write that down on your hand.", "author": "Elaine S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-11-27", "description": "Shrimp Hot spud is fantastic. It has a nice kick and the flavor works out really well. They're excellent when you're in the mood for spud. That said, I give Hot Spud only 3/5 because it's not a place where I'd go out of my way to go eat. It's more a if I'm around I'll visit.", "author": "Daniel K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-10-22", "description": "3 stars for the tater, plus 1 for a different & decent non-tourist trap in the neighborhood.  Got the chicken & the potato itself was very well-cooked.  The first of the few ingredients going in made it great: butter, salt, cheese.  But the non-native toppings I could probably do without - chicken was kind of tasteless, olives were canned, wing sauce was thin.  It was so tempting to get an entire production of a baked potato.  Think if i'd stuck with the basics, it could have been an ethereal tater. \n\nRegardless, I'm super happy I found it.  Staff was very friendly, guy manning register (presumably the owner) gave me 10% off & we chatted briefly about this potato bar trend in Europe.  Great concept for a quick lunch spot in any city with a downtown workers hub - they should definitely franchise.", "author": "Talia R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-14", "description": "I had a vegetable spud with chipotle tarter sauce.  It was delicious!   The sauce had the perfect amount of spice to bring out the flavor of the potato without overwhelming it.", "author": "Sue L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-14", "description": "I love potatoes! It reminds me of a chain called 'Kumpir' we have in Hamburg/Germany. It's not as good but still I'm happy to find a potato place like that in San Fran. You get a baked potato mixed with butter & cheese and then you can choose toppings like corn, salad, chicken etc. and a sauce. Very simple, very good, pretty healthy:) It's a good snack.", "author": "Katja J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-12-09", "description": "Great grilled shrimp chipotle baked potato tonight.  I had an Izze sparkling Pomegranate soda with it.  A warm comfort dinner on a chilly night in sanfran!", "author": "Powell S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-08-29", "description": "I was hanging out in San Francisco with my best friend, vacationing it up when we decided we needed a filling yet cheap bite to eat. We  wanted something that we couldn't find back home but that would be delicious, so we turned to our handy dandy Yelp app. Oh were we happy, a baked potato bar only a block walk away! We trotted along, and the place was fairly dead. We ordered our potatoes, I got the veggie she got the steak. The staff was great with making sauce recommendation and I was in heaven once my fork reached my mouth! We had just beat the crowd because as we ate the line gathered and we were happy that we didn't let the initial lack of patrons deter us. I really wish we had one in SoCal, I would for sure be a frequent customer!", "author": "Mallorie A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-24", "description": "I go here about once a week.  Since I found out I have celiac disease about a year and a half ago, its one of the few places in SF that has NEVER made me sick.  I love the chicken spud and I always get extra chicken to make it a dinner sized portion.  The sweet potato brownies are awesome!  Very nice owner and friendly staff.  Its fun to get a spud and then go to Musée Mécanique..which is a couple blocks away.  Also nice to call ahead and get them to go for a picnic...", "author": "Banana G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-08", "description": "Hot spud rocks!! Been there a number of times and it has always been delish!! Service is great too!", "author": "AJ S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-08", "description": "Best hot potatoes I've ever eaten! Rich, creamy texture and loaded with cheese and veggies. I'd go here every time I go to Fisherman's Wharf.", "author": "Shyam B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-02-27", "description": "My gluten free go to spot when visiting the wharf", "author": "Rew P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-09", "description": "DELISH! And if you use a Living Social coupon, you basically only have to pay $3.50 for a baked potato. Ordered the Fisherman's Wharf and the Sausage baked potato. Both were huge and chock-full of goodies. The Fisherman's Wharf was FULL of crab but had a pretty subtle flavor. The sausage baked potato was delicious though! Really filling, really flavorful, and surprisingly, not touristy at all like all the places around it (it's right near Fisherman's wharf)", "author": "Diana Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-08-02", "description": "A friend and I chose this place on a whim with some help from Yelp while on our road trip to San Francisco.  Plus it is walking distance from our hotel room.  The interior was clean, organized and welcoming.  I've noticed an enticing stocked shelf of refrigerated refreshments by the side.  Why not?  I helped myself to Steam Anchor beer.  Our potatoes was ready in about 10 minutes.  Hers had shrimp, while I had the Veggie Spud.  Our meal was enjoyable.  We could finish barely our share of sweet potato brownie.  This place is highly recommended for a quick bite or three while not feeling a pinch on the wallet in a tourist trap area.", "author": "Archie L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-03-07", "description": "Such a great concept and completely lives up to the great reviews! The Cajun shrimp potato comes with fresh grilled shrimp, Cajun tartar, corn, onions, green onions and sounds rather strange but was absolutely amazing. In total, probably about $11 with soda/tax.\n\nI really can't go on about how much I enjoyed Hot Spud! \n\nGreat find!!!", "author": "Amy T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-12-10", "description": "A refreshing addition to the neighborhood. Mention that you're local for 10% off. \n\nThe Thai crunch salad is great", "author": "M M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-12-07", "description": "Will definitely be returning, a really good, filling lunch place at a cheap price! Plus they are almost entirely gluten free and use some local ingredients.", "author": "Libby C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-24", "description": "This place is AMAZING.\n\nI randomly discovered it while walking home from work one day and I decided I absolutely had to go in. I've gone twice in the past four days. I am officially addicted. The staff is super friendly and helpful and they have a list of allergens to make sure that no one gets sick from the food. The ingredients are fresh and delicious and they offer student discounts! All in all this is definitely one of my new favorite places in the city!", "author": "nikole s."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-10-17", "description": "LOVE this place!!! It's a gluten free haven- my fav is the chicken spud and the sweet potato cheesecake of course! :-)", "author": "Lindsay A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-12-31", "description": "It's really about a 4.5 stars but going 5 because the gluten free sweet potato brownies are the best ever... EVER.  That's GF or no GF they are the best.  The baked potatoes are good with lots of gluten free options. The brownies, cheesecake and rice pudding make this place THE BOMB!  A real treat to have high quality gluten free foods, with reasonable prices, and super nice people working there. Keep up the good work!", "author": "SacTown G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-15", "description": "Hey there Hot Spud! This place was across the street from my hotel room and I had to try it. I can't believe these places aren't popping up all over the coutry! So simple, yet so amazing. When you enter you are given your potato and asked to choose your toppings. They also have specialty potatoes that you can order. It is like the Chipotle of potatoes. I loved it, I want to go back, but alas....there is not a location in San Diego...hint hint, wink wink. P.S. try there burnt pudding. Wish they were open later.", "author": "Amanda H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-09-15", "description": "Friendly owners who are warm and welcoming. They explained the menu to us and gladly accepted our KGB Deal I purchased without any fuss. These stuffed potatoes are huge and yummy. The skin comes salted and there is a nice amount of topping to fully enjoy it. I'm happy we made the trip over the bridge for these. They are located in a touristy area but hey its fun to be a tourist every once in a while.", "author": "Trish B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-01-24", "description": "let's be honest.  this place gets 3 stars for the name alone.  \n\nthe food wasn't bad either.  i got a tater with broccoli, corn and onions.  the potato itself was really good.  some of the best skin on a potato i've had in a while.  the fillings were fine, but nothing special.  i wish there had been more broccoli.  double broccoli next time?", "author": "Rachel H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-12-22", "description": "What a gem!!!  I do business around there and sometimes I have to work late and don't feel like being hosed by Fisherman's Warf prices.  This place was amazing.  You can get one of their signature potatoes or build your own.  I built my own and got to choose everything I wanted on my spud.  At the end I had a delicious baked potato but under $5!!!  Yeah, they give you a neighborhood discount if you're a local!  Awesome place can't say enough about it!", "author": "Kirsten M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-15", "description": "I was never a fan of baked potatoes up until now.  Steak on a potato? YES PLEASE!  Very filling and delicious.  I ordered steak with extra steak and added crab and EXTRA crab.  but sadly, it came out to be a 20$ baked potato with very scarce Crab meat,  I felt pretty ripped off, but I still enjoyed the potato.  I will definitively come back if I'm the Fisherman's wharf area.  But now I know, stick to the steak never add the crab meat, worse 7 bucks wasted :(  Do try it!", "author": "Ray S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-03", "description": "Great spuds, but I only order from them about half as often as I want to.  Turns out drunk and tired me wants hot spuds... generally around 9:20pm, and they close at 9pm on weekends, and 8 during the week.  So, definitely not a late night place.  But super tasty!!  Really wish they were open until 10/10:30 on Friday/Saturday nights.", "author": "Jaq S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-01-11", "description": "I like the place, and the staff, and the idea, and the food.. but sometimes, it takes 15 minutes to make one potato, and usually, they're out of something I'd like. I'm pretty hesitant to return, but I probably will.", "author": "Michelle S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-21", "description": "Delicious Sausage Spuds. They do ALL the hard work. It's brilliant, simple and improved since last I visited. Never being one to waste food I really like how they dig out and loosen ever last bit of potato. The toppings are simple and fresh. I do have a love affair with the potato so I'm glad this place is a long walk from my house or it would be a lunch time regular. Creative niche on a simple item, friendly staff, well done at the price point.", "author": "Nelson C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-26", "description": "I just ate here for the first time.  I had the veggie spud and added chicken.  I used the lemon butter sauce, and it was really good.  Hit the spot.  The people behind the counter were super friendly and the place is really clean.  The salads look amazing too.  I'll be back in this week to try one of the salads.  Even though it's in tourist haven, I'm a local and I enjoyed it.", "author": "Amber M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-28", "description": "I go to school a couple of blocks from this place and I have regularly eaten lunch here for over a year. The people get to know you by name and pretty much remember every time what you like to order. Their portions are generous, the food is very good and the prices are fair. I love going here and have never heard anyone say that they did not like the food here. Go here and you will for sure love it!", "author": "Matthew P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-08-10", "description": "My BFF and I both have celiac disease and were in the city for the day and didn't pack a lunch. We were wondering where the heck we could eat gluten free. We found Hot Spud and LOVED it! The owner was there and he explained everything to us and was SUPER nice! We will DEFINATELY eat here again!", "author": "Natalie S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-15", "description": "Best spud I ever had, place could have been a little cleaner. Staff were good but could have been friendlier. They let my friends son eat his subway sandwich there as he did not want a spud. Good value, especially for the area.", "author": "Trevor W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-03-20", "description": "A baked potato spot....\n\nTastes Good: Yes\n\nFills you up: Yes\n\nHealthy: Yes\n\nPrice: Cheap\n\nService: Friendly and Quick \n\nWhat more do you want from a place to grab lunch? \n\n5 Stars. Fast.", "author": "Cam K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-15", "description": "Nice idea. Good food. Baked potato stuffed with your choice of veggies and meats and condiments. Location is great too, right next to Fisherman's Wharf.", "author": "VA N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-02-07", "description": "I have no clue how this place has the amount of stars it does. The idea is great. The execution and poor quality ingredients are not. I got the Warf which sounded great crab on a potato I sampled the sauce, it was good. The baked potato was hot. Why then would you pour cold canned corn all over it with cold crab (that may or may not be canned) I will never know. If everything was hot then it might of tasted better. On top of that they used  almost a whole can. BUNK. My boyfriend got the steak potato. Everything hot except the canned corn and canned peas WTF are you kidding me. hot mushrooms hot steak cold peas and corn. I don't get it. The steak was so chewy. This place could be so much better. Ok so the food BLOWS. And I was going to give this maybe 3 stars and I really tried to like it but then all the workers were talking about drugs, loud, rude, in public.....its like cool dude you smoke pot bruh. yeah. Don't really care. Quit swearing. The decor looks like a baked potato without any toppings bland. Im actually pretty mad I wasted $26.00 here and even the brownie sucked and its a brownie. This place was empty so I say some of these reviews were faked....cold canned corn on a hot baked potato with cooked steak....NO just no. You can make a better baked potato in your kitchen for less money!", "author": "Nykky D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-05-31", "description": "I have a baked potato addiction, so when I saw a coupon for this place on KGBDeals, I figured I had nothing to lose. I am so glad I went for it. I visited with three other people, including my mom who is not a fan of baked potatoes. We got The Wharf, the Chicken Spud, the Steak Spud, Clam Chowder, the Burnt Rice Pudding, and the Sweet Potato Cheesecake. I was a little skeptical about some of the toppings and sauces (alfredo sauce on a potato?), but somehow the combination work. Everybody, including my mom, thought everything was AWESOME! If they had a location in the East Bay, I would visit regularly.", "author": "Melinda S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-04-06", "description": "Just a quick \"thumb's up\" for Hot Spud -- it's fast, fresh, and yummy. I don't see enough people in there (because it's off the beaten path), which is a shame. The staff are friendly and the prices are more than reasonable. I only hope they open more locations in the Bay Area!", "author": "carnaby s."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-11-07", "description": "What a great respite from the touristy stuff at Fisherman's wharf! The portions are generous, the ingredients delicious and this sums up to a fantastic jacket potato. My wife, a potato lover, still raves about our meal here and going back.", "author": "Tyler H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-11", "description": "I wouldn't have thought 5 stars either. But it truly is great. I don't know if I am being influenced by the lack of any good food around FW, or because it was a rainy cold sad day. I have walked by many times and have never been convinced of the concept and it also took over the space that had the best breakfast burritos down here, so maybe I was a little bitter. So I trusted yelp on this one and it didn't disappoint. I had the shrimp potato with tasty sauce butter cheese and green onion. Sauce great, shrimp and potato cooked perfect. It was fantastic and satisfying the only way a lump of potato in your stomach could be. The owner and staff are super friendly and were really attentive and helpful to the customers. It's also a nice little place to be in. FW winner. Well done Hot Spud. Nap time.", "author": "William R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-02-28", "description": "Pretty tasty lunch spot and not at all touristy - I had the chicken spud - I'd suggest adding some cilantro to it.  Tasty...", "author": "Erin Q."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-11-24", "description": "Have you ever said to yourself \"Man, someone needs to bring back the baked potato bar\" Well, Hot Spud has done just that as well as offering premium baked potato options like the Wharf Spud, that uses real crab meat. They even build your spuds the right way, buy melting in the butter and cheese while they fluff the spud. \n\nIf you're a tourist visiting Fisherman's Wharf, it's worth getting off the beaten path for some good quality, non-commercial, healthy food. And, if stuffed spuds aren't your thing... then try their Crispy Thai Salad!\n\nA while ago I would have given this place a lower rating because one of the workers prepped my spud until it was cold then he added in the rest of the chilled ingredients, but instead i mentioned my concern to another employee, who turned out to be the owner. \n\nEver since that day, every\n time I go in he makes special efforts to ensure that my baked potato concoction is hot and to my liking.\n\nThey even have a chart on display for people with food allergies. Granted, if you have a food allergy you should educate your self and know what to stay away from... But the people at Hot Spud have made it a priority to list out their ingredients on the chart to guide the customer with their choices. To me that just shows that they care for and know their customers.\n\nNow, my only complaint is they need more locations in the city. :D", "author": "J R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-05-10", "description": "Eat here....nothing beats a hot spud in cold sf......grab it and hit the waterfront for a dining delight.....", "author": "Brian E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-08-11", "description": "My new lunch hour haunt. So Good. I love the Fruit and Nut Salad and the Chicken Spud with Wing Sauce. Today I had the custom spud and added steak and vegetables. All of my co workers went there today and came back stuffed. Its an upscale, hip, better-than Subway. You can pick the items to top your potato and all the guys that work there are attractive.....Studs Serving Spuds. Nice.", "author": "Aimee G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-12-05", "description": "Love the concept and wish Sacramento had one. I created my own potato and it was beyond delicious. Everything was fresh and it was full of flavor. Being that I have to adhere to a gluten free diet it was so nice to not have to worry about cross contamination because everything but two menu item are gluten free. Don't walk, run to hot spud if your in the area. I can't wait to go back the next time I am in SF.", "author": "Julie C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-08-26", "description": "Holy crap, I'm so full!! After being tipped off by a colleague, I decided to check out Hot Spud for lunch. I was not disappointed, as I often am when going out for lunch in the area. \n\nNow, if you have the misfortune of working in the Fisherman's Wharf area, you know how challenging it is to find a decent lunch place. For the past six years (yes, I've worked in the area for six years) I've pretty much relegated myself to three places, only one of which I actually like. So I'm thrilled Hot Spud is around the corner. \n\nI went over with low expectations. However, I was extremely impressed by how spacious, clean and tastefully decorated this place is. I was actually expecting a crappy, cramped fast food-type stand. Also, all of the potato toppings are visible, so you can easily personalize your own potato. Always one to be overwhelmed by too many yummy choices, I opted for one of their specialized potatoes--the grilled shrimp. The workers were extremely friendly and enthusiastic, and politely asked if I was okay with waiting 5 to 7 minutes because they grill the shrimp to order. Hell yes!! \n\nBecause I didn't think a potato would be enough for lunch, I also ordered a sweet potato brownie. Well, it was more than enough for lunch. Two hours later and I'm still stuffed. And not only was it filling, everything was perfectly cooked and delicious. I can't comment on the brownie yet, because I'm still too full to indulge in dessert. \n\nBonus points for discounts for people who work in the area!", "author": "Michelle L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-07-22", "description": "I work near the Wharf and have really been looking forward to the opening of Hot Spud. I guess so have a lot of other people- they ran out of potatoes the first time I tried to eat there. \n\nI probably don't need to tell you that  there isn't much at the Wharf in the way of healthy and affordable food so this fills a huge gap.\n\nThe food: I got a bulid your own potato and added grilled chicken. Everything was fresh and well prepared, the chicken was tender and moist. The potato is not as big as you'd expect for the prices. Mine had a big black spot, not really their fault but a bummer. You can choose up to 4 vegetables to add in BUT they are not listed on the menu board so that would be helpful.  I guess they don't come with sour cream? or maybe I didn't see it, or they didn't ask -- seems like an obvious one to me. They didn't ask if I wanted a sauce. The stuffed potatoes have a lot of hidden fat -- a huge scoop of butter, cheese, the sauces are all mayo based. So calorie wise don't be fooled. I think they need to come up with a skinny potato, and offer reduced fat sour crean, low-fat sauce, maybe some salsas or something else to add flavor but reduce fat content.\n\nMost people who work in the area grab a salad at Trader Joe or a sandwhich at Safeway. Picewise, a potato with fixin's and grilled chicken will run you about $8.50 so Hot Spud is a little north of my daily lunch budget. The owner did mention they will launch a discount program for people in the neighborhood and I was very pleased by that! I think they will do well!", "author": "Des R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-07-30", "description": "I've been known to pose some pretty monumental thought-provoking questions in my time, and one of my favorites to ask is \"if you could only eat one starch, which would it be?\" Obviously, with 5 stars you know my preference. Even if you're not a potato head, there are so many great things about these potatoes that might make you switch. When you order you can watch them mix the butter and cheese with such fervor that the insides convert to a sort of mashed potato mixture. Top that creamy potato filling with grilled meats, vibrant sauces, fresh veggies, and you have one amazing baked potato.\nThe place is clean with a great design. The principals are all on site, ensuring that your experience is good enough for a return visit. If I lived closer I'm afraid I would be there all the time. Also received a sampling of their sweet potato desserts--pie and brownie--and both were amazing. Had the signature chicken with spicy wing sauce and the signature shrimp with buerre blanc. Can't decide which was better.", "author": "sunny m."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-05-31", "description": "excellent food. i ordered steak spud and loved it. staff are very friendly.", "author": "Jo A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-05-16", "description": "I typed \"gluten-free\" and \"San Francisco\" into the yelp search bar and this came up. I was going to a comedy show in the area so I thought why not. the pictures on yelp looked good and the reviews were alright. When our group of 4 got there, we waited 10 minutes for the person behind the counter to finish the 2 potatoes they were working on for the people ahead of us. When we ordered, the food took about 15 minutes to make and the cashier took 10 minutes to slice a piece of cheesecake and ring up our order (for 2). This all appeared to be because they were understaffed or just new to being in business. I'll cut them slack for that. When the food came it was underwhelming. We ordered the wharf stud with crab and there was barely any crab, probably only one of the ounce measuring cups worth. Most of the stud was corn and there was almost no cheese what-so-ever. We ate our food and didn't make a fuss because more people came in and the staff struggled again with more than 1 order AND we needed to go to our show. All in all the food tasted like the baked potatoes we get at Mills College in the cafeteria, not worth $11. But maybe when they have more staff and get their act together they are better. \n\nEven though our potatoes were so-so the sweet potato cheesecake was FABULOUS!", "author": "Brittany W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-07-30", "description": "Who knew a potato could be so good?  I was in the store recently and got the veggie potato.  The potato was very fresh and amazingly well cooked (mom never made them so good).  The veggies were fresh, the peas were actually crisp, I could tell they were straight from the garden and not frozen.  I picked a chipotle sauce, which was just the right amount of flavor and heat (next time, extra chipotle, please).  Surprisingly I was full from one potato, it made a very good lunch.\n\nThe sweet potato pie (which they generously offered to have me try gratis) was absolutely delicious, a 10.  They could build a business around sweet potato pies if they wanted.\n\nThere aren't many reasons for locals to head to Fisherman's Wharf, but Hot Spud is one (or the only) excuse to go.", "author": "Justin M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-08-06", "description": "What a great find near the wharf!  I only had a vague idea what to expect from a specialty hot potato restaurant, and I really wasn't sure that it would be a full meal, but the line seemed to indicate that it would be a good lunch spot.  \nI was definitely wrong about the meal size.  I was barely able to finish my Chicken spud, which had a really nice blend of ingredients and flavors.  These are not simple, plane-jane baked potatoes.  The chef obviously took some time to craft the ingredient list for the signature spuds and my lunch mates all found something appealing on the menu.  \nAll of the vegetables were fresh and crisp.  The chicken was tender and complimented with the perfect amount of buffalo sauce.  I was definitely in heaven.  \nOne of the owners offered us free samples of their desserts (brownie and sweet potato pie), both of which were great homemade treats.  Unfortunately, I was too full to order a whole piece.  \nI really enjoyed the energy that the owners put into making everyone feel welcome and cared for, which is so often missing in the casual lunch scene.  \nI can't wait to go back!  (Crab spud is next on the agenda)", "author": "christopher w."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-02", "description": "Great idea, great food. The salad and potato (bacon, veggies and blue cheese) were filling and delicious. Good drink selection, nice clean facilities.", "author": "Joe G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-07-18", "description": "This place is DELICIOUS!! Great Spuds, great salads, GREAT service! Loved the creamy cilantro dressing and the selection of beverages (especially the Virgil's Root Beer :) can't wait to come back!", "author": "Nickole S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-17", "description": "Wow, this is great. Real friendly. I saw people not eat their potato part (skin). You have to eat the potato part, it is awesome.", "author": "Christopher R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-09-27", "description": "We noticed this place on our way to Subway which is located in the same street. After seeing the menu we thought we will give it a try. We were glad about our decision to eat there. Food was delicious and the idea of having it on top of baked potato was awesome. We tried the veggie spud and it was worthy. I will go again and try the Chicken spud next time.", "author": "Chandru S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-05-02", "description": "Visited SF this weekend and ended up eating at the Spud twice it was so good. Tried both the chicken and the steak spuds and still cant decide which I enjoyed more. The potato was cooked and seasoned to perfection, the meat was tender, and the toppings were fresh and great quality. I wish we had one in SoCal..I think it's going to be the next up and coming hot chain!!", "author": "Marian G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-26", "description": "I love this place. You don't have to get a spud with everything on it to enjoy one, though I always do. The spuds are SO CREATIVE and not to forget, DELICIOUS. Whether you work around the corner or are a tourist, it's a definite stop for a bite to eat. Also have to mention that the service is really good. Spud really cares about their customers.", "author": "David L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-09-22", "description": "When you walk in, everything is set up like a Subway.  All the ingredients are fresh, and displayed nicely along the line.  Everyone is extremely helpful and nice.  The toppings are generous, and overall this was an extremely good meal.", "author": "David S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-04-07", "description": "I needed something \"eating clean\" style while I stayed at the Sheraton. I love Hot Spud. The people are great, the veggie soup is dairy free and contains quinoa! Just like home, only better because they make it, and offer me delicious potatoes. I got a plain baked on with butter (not very much so don't worry) and green peas. My favorite place on FW.", "author": "Never M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-03-17", "description": "They make the best baked potato concoctions! Friendly service and very clean! Gotta check them out.", "author": "Caryn S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-02-18", "description": "This is a great concept on a baked potato.  I like the different sauces and add-ins. There are a variety of combinations to choose from and a choice to build your on as well. It is the same for the salads. Nice choice of drinks too.", "author": "Wanda K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-07-10", "description": "The food was good but the menu selection is small. Better than any other fast food place we saw along fisherman's wharf.", "author": "L S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-12-23", "description": "Worth the drive! We had two loaded baked potatoes, and one salad,at about $25. (i think one drink too) Delicious! Every bite of everything was amazing. We told the manager we had found it on yelp and he gave us a $2 discount. Really good service. I will return on my next trip to SF.", "author": "shona m."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-10-05", "description": "Skip the salads and go for the potato. The Chicken Spud (aka Chicken Bomb) is insane. I'd be scared to see the calorie counts on the potato selections.", "author": "Scott M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-09-04", "description": "I had such a nice and cheap spud. I can imagine eating every day there!", "author": "Seb S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-19", "description": "Love this place and wish there was one near me.  Affordable, fresh, healthy, and so tasty.  The staff is friendly (\"Feel free to customize the toppings...\") and the ambiance is comfortable, casual and modern (and clean!).", "author": "Kyla M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-26", "description": "We are locals and were looking for a place to eat near the wharf and saw Hot Spud.  We walked up and I saw that they do gluten free (on the window) and I have an intolerance so I liked that right away.  We went in and immediately liked the concept of a quick and easy meal that didn't have to be full of fat.  The staff were patient while we went throught the menu and asked questions.  My baked potato had prawns, corn, onions and olives and it was totally yummy.  When we got up to leave, I told the staff how much we liked it and they were all sooooooo friendy.  Cheers to Hot Spud, Prince and Will and the nice young lady whose name I forgot.  IWe will absolutely eat here again.", "author": "Laura A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-14", "description": "We stayed in a hotel across the street, and had heard good things about this place.  Everything we heard was true.  I had a shrimp spud, and my husband had a sausage spud.  They were both excellent.  In fact, we wish we were staying longer, because we would liked to have tried more.  The man at the counter was really helpful, and very friendly.  We noticed that local workers came here to eat, which is always a good sign.  The spuds are huge and sooo good, right down to the skin!  This is easily an entire meal and not a snack.  Everything was fresh and very tasty!  We really enjoyed our meal, here.", "author": "Doug Vi S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-06-19", "description": "A friend and I played tourists yesterday in the city and ended up in the Fisherman's Wharf area. We decided to check out Hot Spud and it was DEEE-licious!  I am a buffalo chicken fanatic so I couldn't resist ordering the Chicken spud and I loved every bite. My friend had the Shrimp spud and loved it too. We topped off lunch with a San Francisco Anchor Steam beer and were completely satisfied. We were full but couldn't resist ordering one of the gluten-free sweet potato brownies so we took it to snack on later as we walked through the city. It was cooked to perfection and so moist and fudgy it melted in our mouths. We are so happy that we stopped at the Hot Spud and will definitely be going back next time we hit the city again!", "author": "Heather B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-30", "description": "Great fresh food.  Excellent service, and a fair price point.  If you want a quick, fresh, alternative to the fried Wharf food, consider Hot Spud.", "author": "Marq T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-03-25", "description": "Okay we were looking for a place that offered baked potatoes and we were not having any luck... a quick Google search later and we found Hot Spud in the City.\n\nIt was awesome!  Nice place, clean, nice vibe and even though it was right around the corner from the Fisherman's Wharf and its myriad of tourist traps, this was a nice comfy place to get some good eats. The folks behind the counter were nice, very friendly and helpful.\n\nI went more traditional with the grilled chicken, bacon, green onions, black olives, corn and cheese... no sour cream for this guy!  I did not go with any of the sauces they offer as I'm just that way.  It was good.  My partner went with the veggie; broccoli, peas, corn, green onions, black olives  and mushrooms... and he went for the full-on sour cream.  \n\nWe were both very satisfied and happy to have found this place.  I know we can make these on our own, but it's nice to know when you're out and about you can stop by and get a spud!\n\nThey also have great salads and a daily soup... and it's gluten-free!\nWe will definitely add it to our places to visit when in the city... now if they would open a store in Oakland!", "author": "Rowdy T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-03", "description": "This place was awesome!! Not only were the potatoes delicious, they have GLUTEN FREE sweet potato cheesecake and brownies. And all the sauces were gluten free too. Very allergy-friendly. Will definitely be coming here again!", "author": "Kimberly d."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-12-10", "description": "Hot Spud is awesome.  I have always loved potatoes and never understood why they are relegated to a side dish.  Well not anymore because at hot spud the tater takes center stage.  All the ingredients are really fresh and they don't skimp on the portions, it is as loaded as a baked potato can get.  There are a variety of different sauces that make the potato delicious, my favorite is the chipotle tarter sauce.  All the employees are very friendly and happy to answer any questions you might have.  It is one of the only places on the wharf that I will eat at.", "author": "Kevin M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-26", "description": "Not expensive, quick,good food and friendly service. The Baked potatoes are great - options for vegetarians too, and kid friendly to boot!", "author": "B D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-09-03", "description": "Great food, friendly service, who could ask for more?  We stumbled across this joint on a walk down to the wharf.  One of our party has a gluten allergy and we stopped in to see if she could be accommodated.  The staff was glad to help and knew exactly what she could and couldn't have.  The potatoes were delicious and I was pleased with how well the potato was mixed up so that you got toppings in every bite.  If I lived in SF, I'd be a regular customer.", "author": "Josh G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-05-20", "description": "I was there in February and I'm still thinking about this place.  Can't wait to go back.  Crab potato and chipotle tomato soup were fantastic. You can walk by every restaurant on Fisherman's Wharf and head straight into Hot Spud. The service was friendly and I enjoyed a great lunch.", "author": "D'jango J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-09-12", "description": "What a great find! The potatoes are excellent, the staff is friendly and helpful! I have an allergy an employee went out of her way to help me out! Great service and food! Try the sweet potato cheesecake and sweet potato brownies!", "author": "Angela A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-09-10", "description": "Best spud I've ever had! The people were super friendly and even honored the yelp 10% discount. Only thing to use the bathroom you need a key.", "author": "Family M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-10-19", "description": "I pretty much never wrote a review yet on yelp, but after coming to this joint I sworn I would write one so here it is.  First off, I LOVE potatoes.. any shape or form if it were Mashed, french fries, or baked!  We were heading to Pier 39 and on the way a friend spotted the place and said I seen this place before and I've always wanted to go! So we all agreed, why don't we just go in now for a snack since we were hungry.  I ordered the Steak Spud...$8.95 grilled steak, alfredo sauce, sautéed mushrooms, black olives, peas, corn, green onion.. So to begin the potato is freshly baked and hot and one by one they start loading in all the sides mixing and stiring it all up together.. at first bite I fell in love and that's all I got to say about that. Just on a side note their cheese cake is delicious!   I won't be able to go there for a while because I'm getting deployed but I know where I'm going to eat as soon as I get back to the Bay.   Hot Spud!!", "author": "Glenn S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-10-18", "description": "I like this place a lot.  The interior is nice, and the owners are very friendly.  The potato tasted fresh, and lots of options for sauces.  I'm happy to have this place in the neighborhood.", "author": "Tim R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-07-22", "description": "I just had what is sure to be the first of many hot spuds. I came seeking a little variety from standard lunch fair but not expecting much else. What I found simply knocked my socks off. Yes it is \"just a stuffed patato\".. but it's a stuffed potatoe the way a chef does a stuffed potatoe. The potatoe was light and fluffy and the toppings were fresh and of the highest quality. The chef has clearly considered what flavors work well together here. \nI got the chicken spud because I'm a sucker for buffalo sauce and was pleasantly surprised that the sauce was just one of many subtle flavors in the dish. The crisp fresh corn stood out nicely against the softer texture of the potatoe and the black olives added just enough bite.  I'm surprised I'm tryng to describe the complexity of a baked potatoe, but I was so pleased by the meal that I want everyone who reads this to get that this is not your wendy's baked potatoe but something so much more.\nGive it a try. And don't miss out on desert. The sweet potatoe pie is as good as you've ever had anywhere.", "author": "Brian M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-11-22", "description": "This place is great!  I live in the neighborhood and happened upon it one day.  The potatoes are great and one is definitely enough for a whole meal.  Even more, this place has the friendliest and most helpful staff I have ever seen at a restaurant.  HIGHLY recommend this place.", "author": "Jennifer C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-07-27", "description": "Wow! Talk about a tasty explosion in your mouth. I love hot spud! First, the service there was awesome. People were ready to help with smiles on their face, to ensure that my experience was a good one. I got the chicken spud... It was delicious. The buffalo sauce on it makes it tangy and pop in your mouth. I also got to try a bite of the shrimp spud... And that one melts in your mouth. I'm definitely getting the shrimp spud next time. Salad was crisp, fresh, and perfect. Lastly, to top it all off... You have to try the sweet potato brownies... A nice sweet end to a great lunch!", "author": "melissa k."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-07-26", "description": "My daughter has to eat gluten free and Hot Spud has many options.  The owners know about wheat issues and have a lot to offer.  My daughter loved her \"spud\", she said it was the best ever!", "author": "Helenmarie S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-09-10", "description": "The baked potato was delicious and the staff was super friendly.  Their menu was also very clear about potential food allergies, which I really appreciated.  Great place to stop on your way around the city!", "author": "Sharon P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-06-10", "description": "Wow I loved the creat your own spud!! It's soo tasty and the staff is very friendly!!!", "author": "Olivia S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-07", "description": "This is an excellent fast food place a half block from the bustle of Pier 39. The concept is you get a baked potato with butter, cheese and salt and then add whatever toppings you want plus a sauce if you so desire. All the toppings are fresh and yummy and they give you plenty of everything. Almost everything is naturally gluten free plus they have gluten free desserts. A great find and a nice break from all the pricier joints in the area.", "author": "Miles U."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-12-18", "description": "i was looking for a gluten free place to go and this was the place! Really good you can customize your huge baked potato with almost anything you could think. The staff was very helpful and the price was right.", "author": "Kim r."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-14", "description": "While it is easy to think that you would have a lot of food options while living a block around the wharf, it is not really so. there is only so much pizza/italian or seafood one can have. The only other cuisine that I find at a walkable distance is a less than ok Thai place and a great Argentinean food truck. Happened to walk past HotSpud a few times. Tried the chicken one it for lunch today...actually took it to go. It was so delicious! Different flavors and textures just burst in my mouth. A little pricey in my opinion but great taste! Also get 10% off for locals. I'm going back for more :-)", "author": "MrsNIFTY G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-16", "description": "I LOVE HOT SPUD! amazing quality amazing service amazing food! whenever i am hungry and want to eat out i always go there.  the owners are super friendly and always smiling.  the dessert is also amazing too! ill never eat a baked potato anywhere else honestly", "author": "Soupy M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-07-25", "description": "I was really forward to eating a baked potato at Hot Spud after seeing the 4.5 stars rating it has.  I don't regret trying the place because if I didn't then I wouldn't be able to yelp it.  My friends and I were all about to eat here, but they said they only had 6 potatoes left, and the next batch would come out in 20 minutes.  Most of my friends decided to eat at Fisherman's Wharf instead.  I ordered the shrimp spud.  My baked potato was loaded with olives, green onions, corn, cheese, chipotle sauce, and 5 pieces of grilled shrimp.  The first bite tasted pretty good with everything layered.  However, the rest of the potato became less enjoyable because the proportion of grilled shrimp didn't balance with the proportion of the potato.  At the end, everything just because a mixture of chipotle mush.  My friend ordered The Wharf Spud, which was loaded with red onions, green onions, and crab meat.  The crab complimented the potato pretty well because all the flavors were very settled.  I think it would have tasted better without the raw onions.", "author": "Cindy H."}
