{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-22", "description": "So far, this place has the best beef noodle soup in SF in my book! The portion was ridiculous. I kept finding more beef and more noodles.\n\nService was weirdly slow for a Sunday night, but that's because one lady was literally working 3 jobs. Worth the wait though  - will be back to try their other stuff, which all looked and smelled amazing (yeah, I looked at and smelled the other people's food).", "author": "Michael K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-10-01", "description": "What I ordered: General Shao's chicken, menu price $12, and rice\n\nWhat I expected: Large portion of flavorful, crispy chicken with complimentary rice and maybe a fortune cookie. \n\nWhat I got: Smaller sized portion of soggy, flavorless chicken with $2 additional charge for rice. Never have I ever had to pay additional for rice at a Chinese restaurant.\n\nNot many options in South Beach area for chinese food, but best to just avoid.", "author": "Alex F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-11", "description": "Standard Chinese spot but added bonus of no MSG in their food. I did takeout on a Friday night. \n\nTakeout time is a little long (45 min) for 3 dishes and 2 sides of rice, but the food was hot, fresh, and delicious when I came home with the takeout containers. \n\nPrices are very fair, will be ordering takeout from here again. The inside of the restaurant is pretty sparse, some tables occupied but mostly empty.", "author": "RachEl L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-12-25", "description": "I have a client a block away that i pet sit for and being that not much is open on Christmas and my husband not wanting to drive due to the potential of drunk drivers and speeders being out, we decided to see what was open within walking distance. We already had noticed they less than average reviews but decided to risk it anyway.\n\nWe walked in about 30min before closing tonight and immediately noticed the less than friendly service. Only one other table was dining and it was pretty small, cold feeling and smelled like dirty dish water. We decided to order the safest thing on the menu, beef and pork chow mein (spicy) and broccoli beef, two steam rice and a ginger ale (i figured i might be needing the latter just in case.)\n\nWe had asked for hot tea originally but they only had tea bags instead of the brewed pots that most authentic Chinese restaurants serve you so we passed on that. \n\nFood came out relatively fast but the meats just tasted odd so I mostly ate the noodles and the steam rice with broccoli. The sauce wasn't bad in the broccoli beef, however, i was weary of the beef. The chow mein was quite bland even though it was spicy and just didn't care for the thick doughy noodles. \n\nOverall, as a local who grew up in SF and eaten authentic Chinese regularly in the city, particularly in the richmond and sunset district, i find downtown SF to cater more to transplants and tourists who don't know what these dishes are supposed to taste like. I wasn't really shocked by the rudeness as its pretty typical of most Chinese or asian restaurants to not be the friendliest, although, there are a few that are, I care more about the food and the quality which this place seriously lacks. I would not recommend as i'm very concerned about the high potential of food poisoning here. Dishes are also priced on the higher end for the quality you're getting. Do yourself a favor, don't be lazy (we have to drive out from the east bay now in heavy traffic to eat the food we grew up \nup with cuz of you transplants who priced everyone out) and just drive, uber or bus it to the Richmond or Sunset district (or even China Town) instead and quite whining about how far it is when you don't have a 3-4 hour daily commute to work everyday like the rest of us who actually are from the city and would give anything to have these conveniences again!", "author": "Petra S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-15", "description": "Happy enough to have them as my neighborhood Chinese takeout place. Not overly salty and was fast on a Tuesday night. Its family run so also a bonus to support a small business. Ordered beef chow fun and stir fry snow peas.", "author": "Sonia W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-23", "description": "I was walking down Embarcadero with my family Friday night. We came across House of Hunan and rumbling tummies. We decided to stop and give them a shot. I ordered the Mongolian bbq, which I recommend. It does have a little spice but nothing too major. Food was good, service wasn't that great. We did happen to come in AT closing as the OPEN sign was glowing through the window catching our attention. We were very thankful they were able to attend us but at the end we were rushed out. Thinking about coming back but I'm not sure if the service will be worth it.", "author": "Breana L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-17", "description": "Gets pretty busy at lunch so plan accordingly.\nFood is decent esp if you're hankering for a quick Chinese meal in SoMa.", "author": "Sunder I."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-09-07", "description": "This is a surprisingly good place to be this low-key. The food is very authentic and well-priced, but they just don't know how to deal with sit-down guests.\n\nThe lady behind the counter is continuously juggling orders on the phone and responding to guests at the restaurant - can be maddening, I understand. However, this multitasking irritation can't be taken out on customers - just a suggestion.\n\nThe other point to fix would be the hygiene. I have come here a few times and found the chefs smoking out in the open. And by virtue of keeping the door open, the place has its fair share of evening mosquitoes.\n\nI agree when they say 'don't peek into the kitchen'. But how do you avoid spotting something so brazen? \n\nLike I said earlier - call here for the food and you won't be disappointed.", "author": "Aditya M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-08-21", "description": "The customer service at this restaurant is horrendous. Wouldn't recommend it as a quick Chinese delivery place.", "author": "Nebiyou S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-06-24", "description": "When it comes to eating American Chinese food, there's a different standard you have to expect. You're not going to expect the complex, authentic flavors you find in China, but rather just simple, savory feels throughout dishes. \n\nHouse of Hunan delivers that, with all the options that you normally expect out of a Chinese place. For the chow mein I ordered, I felt that the noodles were a bit overcooked and soft. There wasn't enough oil that gives a more slippery and compact almost al dente finish that makes chow mein outstanding. The meat portions that went with my chow mein were also average---not bad, but didn't have the juicy, tender texture that good Chinese American places get.\n\nOverall, not a bad experience. The lady that runs the place is super nice and has a nice sense of humor for people that try to speak Chinese to her. The service can get slow sometimes since she's the only one running around serving the entire restaurant and the take-out customers, but the food is reliable.", "author": "Michael Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-25", "description": "Bottom line for House of Hunan: disregard the negative reviews here for them, as their food is amazing, portion sizes are great, health is very apparently a priority for them, and their service is amazing now (they've taken our feedback and addressed all concerns you'll see below). \n\n---\n\nFood: amazing! I've had a couple of their dishes, and most recently their Tomato Scrambled Egg Veggie dish and it was DELICIOUS. The tomato sauce is soooo yummy and the portion was massive. In fact, that's been the case with all their dishes -- portion sizes allows you to eat the meal comfortably in 2 sittings (or be a fatass like me and indulge and finish it in one sitting). \n\nHealth: clean place inside, and the food definitely doesn't have MSG. I typically don't eat Chinese food because it's too greasy and leaves me feeling gross, but I've never experienced this here. Amazing!\n\nService: the majority of non-5 star reviews for them has had to do with timing and service. THEY HAVE ADDRESSED THESE ISSUES, so do not be deterred by the fact that they do not have an overall 5 star review right now. Really friendly younger guy runs the cash register now and takes your order, and food time was quick! I've gotten my food within 5-10 minutes on every occasion, and they are okay with phone-ins.", "author": "Arian M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-25", "description": "House of Hunan is so good! I have come here three of the past five days because their food is really good! All five or so dishes I have had here are great.\n\nI have no complaints about this place, this is my go to spot for lunch!", "author": "Tim K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-27", "description": "Not sure why all the bad reviews...this is consistent Chinese food with no MSG!  Maybe that's why. People are expecting the over flavoring from the usual American Chinese carry outs. \n\nThe portions are huge and the food is always piping hot. I asked them to use whole garlics instead of the minced garlic for my veggies and they did.  The front desk lady is always super nice and makes good recommendations. The filet fish with tender greens are always full of fish. The second time I ordered, I had less greens but still really satisfied with the dish.  To me this taste like home made Chinese that's not overly salted.  I'm also not really ordering the American Chinese dishes that are battered and fried so maybe those are the ones people are complaining about. \n\nIf you want tasty solid not overly greasy stir fry then I'd say you picked the right place.", "author": "Chi Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-11", "description": "I have never been to a Chinese place where they care about the customer so much. I placed an order on phone. Got there an hour late. The lady refused to give me the food that they prepared because it got cold. She prepared fresh hot food for me again and gave me that. What a service. Thank you guys.", "author": "Talwinder S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-22", "description": "Went here for dinner with the fam...there were 9 of us and we practically ordered it all , as we were eating family style. From the wor wonton, the chicken dumplings n sauce, the fried rice, to the tofu eggplant mix, the curry noodles, it was all gooood. Def will be back", "author": "Isis M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-15", "description": "I got the sesame chicken, and my friend got the Mongolian beef. We both were blown away. Simply fantastic. Perfectly cooked, excellent flavor, good sauce balance... just great. I eat Chinese pretty regularly but this place is the best I've ever had.", "author": "Caleb B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-13", "description": "Not sure why the ratings aren't higher. This is a solid Chinese food place. Good for casual dine-in or takeout. There's no MSG and flavors are pretty good. Service is fast and friendly!", "author": "Cindy B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-02", "description": "Best place to grab n go Chinese food in SOMA. The food is consistently fresh and authentic. Really love the new benches that they've installed. Nice, clean place to sit and chat for lunch. They also have Tsingtao beer. Dope.", "author": "McGeezy S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-08-01", "description": "Used to love this place but now seems they have a new chef it management and the food isn't as good. Too bland.    Menu looks the same but it isn't.", "author": "Wallace M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-04-19", "description": "Placed a togo order at 11:50am. Received food at 12:45pm. First and last time coming here. There were people that came after us that got their food and finished it before I got mine. Food was meh.", "author": "Matthew M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-07-22", "description": "This is probably my worst food experience in SF ever since I moved here 4 years ago. Normally I won't write reviews. 1. Lunch Combo is over-priced for the food quality compared to other Chinese restaurants. 2. The black bean sauce fish fillet and sour hot soup caused me stomach pain that ended up with me having a fever for 2 days, throwing up 4 times that afternoon. I was feeling really sick for 2 days. I will definitely not come here again!!! Wish their future customers won't get \"poisoned\" like me. \n\nAlso the lady was impatient and rude, really bad service!", "author": "Qi H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-28", "description": "Honestly when I first walked in a felt I was being rushed to order, the older women taking my order was aggressive and demanded cash unless the order is over $10. It was a little bit of a wait but once I got my order my food was so delicious, I was happy and forgot about the bad customer service. It might be just that one waitress or maybe she was having a bad day, but since the quality of the food was good I'd probably go back again honestly. 4 stars though, because the food was the most important thing. :)", "author": "Hailey L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-07", "description": "Finally open again. This place is a no thrills neighborhood American Chinese place. Orange chicken, chow mein,  etc. the food is fine. I grew up in places like this so it sort of holds a place in my heart. Good to see places like this still exist in the face of hipster pizza and organic microgreen salads.", "author": "David T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-25", "description": "Yummy hole in the wall, I cane around 5 before dinner rush and was the first person there. Got the three flavor chicken bowl, which came with a TON of meat, and whole roasted garlic cloves which I love. Would love to try their assortment of dumplings and steamed items again sometime.", "author": "Zack D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-07", "description": "Hands down the most delish chowmien ever! \n\nWhat we had? \nSoup Dumplings\nSpicy Pork and Beef Chowmein\nSpicy Basil Chicken with a side of rice\n\nwith bottomless green tea and dipping sauces. \n\nThis was a surprise discovery. We were actually walking to the Crossroads cafe, across the street but then we saw Hunan and decided to give it a try because noodles!! \n\nDidn't disappoint. The soup dumplings were less soupy but they totally won us over with the entrees. For me the Chowmein was a winner. My husband loved the Basil Chicken more. I'll go back for my noodle love and discover more on the menu! :D", "author": "Meet G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-17", "description": "Hi yelps in SF~ I'm a foodie and I'm in beautiful new town.\nOne night, me and my co-worker accidentally walked into this place. Since we moved in one \nof the most expensive city, our concerns were\nfocused on pricing and taste. The price was surprisingly inexpensive so we sat and decided to give it a try. We ordered three dishes Sichuan chicken, baby bok-choy with garlic sauce and beef chow fun. The foods my not the best in town but they were excellent!!! Right amount of flavored, clean and the food portion size were pretty generous.  \n\nThere some neighborhood places serving Chinese dished by pound, which is ridiculously high price. Some places in China town were dirty and you may not know what you put it in your mouth but this place is a bit different and way better. If you like a bit spicy food, got to try Sichuan chicken. Staffs were nice and I'm feeling the restaurant will digging my wallet for a while. Chao~~", "author": "Jun K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-21", "description": "Amazing food! Stopped by on my way to the airport and it was just what I needed. I got the Mongolian beef and salt and pepper chicken.  It was a good pairing as the salt and pepper chicken was light and the Mongolian beef was saucy and flavorful.  Their dipping sauce this the salt pepper chicken is so unique... I love it!", "author": "Brice N."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-06-09", "description": "Food is good delicious and fast. The lady that works at the register is not friendly at all every time that I eat there she tells me to order to go, makes me feel unwanted.", "author": "Edgar A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-05-09", "description": "The worst. As a Chinese I refuse to eat here for a second time. I have no idea how they can cook their food this bed. And very rude waitress.", "author": "Tong Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-26", "description": "Always a must-stop for me before Giants games. It's on the Embarcadero a few blocks North of AT&T. The same couple has been running it for decades. \n\nI like the Xiao Long Bao and the tomato with scrambled eggs. Both help generate body heat,  which is needed for a cold night at the game. Good portions and friendly service too. You can watch the parade of orange and black-clad fans go by on their way to the park.", "author": "Orange Z."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-12-31", "description": "Literally the worst Chinese restaurant i ve been to. We ordered orange chicken and general tso's chicken, both tasted like yesterday's fried chicken that was tossed in a little sauce.", "author": "Bikramjeet S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-26", "description": "Nice scenery into the ocean that is a short walk to the Giants game.  Pleasant and nice environment in the Delancey street.  Kung Pao chicken and beef chow mein was delicious! Finally a short walk to the Giants game.", "author": "Edwin S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-05-30", "description": "Average at best..We stay close by and decided to pick up from here one day while walking on Embarcadero. We got the chicken chowmein - tasty but was probably spicy 1/10..Schechuan chicken which was very average ..garlic eggplant -which neither of us ate and the fried rice which was super bland and we didn't want to save it for another meal..", "author": "Anju J."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-06-01", "description": "This is my second time ordering form this place, So I was surprised by the horrible frantic phone call I received from them about a 75 cent difference. According to the two lady's I spoke with, the menu prices on DoorDash.com don't match there price's in the restaurant and so they tried to run my card twice but was declined apparently and so they wanted \"me\" to call DoorDash.com myself to fix the pricing errors for them. I told them it wasn't my job to do that and if they can't fulfill my order then please return my money since it's showing I was charged. She replied \"NO! NO! NO! you already ordered but you owe\" so I asked them if I can pay the difference in cash or card to which she said no. I got no straight answer or solution on what I could do to fix whatever problem they called \"me\" about so at that point I hung up and called DoorDash.com to get a refund. NEVER AGAIN am I using DoorDash or ordering from here. Oh and the food is super greasy and will blow up your bathroom.", "author": "Joe F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-05", "description": "Me and my roommate live pretty close to here and its our go to for when we want something fast. At the beginning, our favorite thing to get was string bean chicken with extra chicken, over rice. Their chicken is so consistently well cooked and tender. They were willing to work with us to make a similar version of the dish but with eggplant, and now its our new favorite dish.", "author": "Steven Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-03", "description": "I've only been here twice now since I'm new to the neighborhood and appreciated the friendly service, modifying the order to meet my non spicy and low grease taste bud needs. Happy to have a clean and nice Chinese restaurant nearby for pick up. \n\nThis isn't a foodie's paradise so not measuring it on SF's overly entitled (so-we-think-we-are-Michelin-raters) standards, but giving it a 5 star for satisfying my quick fix Asian food craving and meeting my #closeby #quickandeasy #modificationw/oannoyance criteria. \n\nThe friendly lady even recalled my last order and predicted my take out and side item. \n\nSadly, this place may serve as a tempting obstacle to my \"cook at home\" goals. ;(", "author": "Jeannie C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-26", "description": "Homemade pot stickers not super thick and if the husband is making egg rolls that day they are the bomb! Chinese broccoli with oyster sauce on side excellent. Bok choy and garlic excellent. Chicken soup and egg flower soups are good. We like the Kung Pao Chicken spicy, Sesame chicken, Chicken and asparagus or green bean in black bean sauce. Onion cake are good but greasy. Shredded pork noodle dish good. Need to know what to order. Husband and wife team. Can get busy and it's small staff. They Deliver!", "author": "Kimberly D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-05-21", "description": "The first time I came here, I actually enjoyed what I ordered. Since that time, I have come back two or three times and the food keeps getting more and more bland! It's coming to the point where I have to put salt all over the food just to have any flavor, and that's never a good idea.\n\nIn addition to the lack of the flavor, the service is generally no good as well. They are rude and usually try to rush us. The only reason I have come here multiple times is because I live close by, but I have had enough. I will be taking my business to South Beach Cafe, thank you very much. I'll be surprised if House of Hunan stays in business for much longer.", "author": "Andrew L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-23", "description": "This is a Mom and Pop operation, and if you are looking for inexpensive, simple but tasty Chinese, it is good. Because most people who eat the food at House of Hunan live near here and because there is otherwise not much foot traffic, it is usually fairly empty--but lots of  take out. Hey, that means it is quiet. \nFor me the service has always been good. It does not hurt to be friendly and say \"Ni hao ma\" (Hi!) and \"xiexie\" (Thanks).", "author": "Chou K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-01-27", "description": "I've ordered a few dishes from here and found them to be okay. Not great, not bad, okay.", "author": "Sameer J."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-11-20", "description": "Honestly, I really wanted to like this place. It's the closest Chinese food in my neighborhood, and I was hoping it would become a staple take-out if and when I get too lazy to cook. Tried it once with mediocore results, and tried again with different dishes but unfortunately the food was still disappointing.\n\nMaybe I'm being too picky about Chinese food having grown up eating it pretty much every day of my life. However I have to say the food is simply not very good. Some of it was dry and bland, while others was just drenched in sauce and tasted very \"Americanized\" to me. I won't be back.", "author": "Wynn C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-10-29", "description": "Lunch Plate-Tomato Beef over Rice\n\nI found the sauce to be overly sweet and felt like I was eating ketchup sauce. The beef was seasoned adequately and tender enough but the portions were lacking. \n\nOverall Thoughts\n\nOverall, I felt the dish was quite lackluster and would not order it again, nor am I compelled enough to go back to House of Hunan for a second try", "author": "Eddie W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-02", "description": "I believe the stars you give should be based in the context of the price and advertised expectations as well as my personal preference /taste. \n\nHere you will get great food for the price. I had the wonton soup and sesame chicken.\n\nThe wonton soup had a nice flavor in the broth, and nice texture to the wontons, but would have liked a bit more space in the meat. \n\nThe sesame  chicken was well cooked, quite spicy, and not too soft or hard. \n\nThe broccoli on the plate was very fresh and tasty. \n\nNice place, pretty quick, and standard Chinese service. Better than my expectations  were.", "author": "Adam C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-12-23", "description": "The dominant flavor here is grease. It's so potent the greasy air coats your eyeballs. I suspect everything touches down in the fryer here: I've never seen deep fried rice cake before. The tofu and eggplant are fried. The vegetarian soup is basically dishwater. And the guy in the kitchen yells nonstop, though I suspect that's just his speaking voice. When the bill came it was enough to convince us to go to Chinatown next time.", "author": "Be F."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-09-27", "description": "Saw the lady drop a pot sticker on the ground, pick it up, dust if off and put it back on the plate to serve to a gentleman sitting by himself. So unsanitary!!!", "author": "Justin M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-09-01", "description": "God this place is garbage, no wonder it's always empty in here. Orange chicken has no orange flavor. I also got the BBQ pork buns and the bun wasn't a bit sweet like it's supposed to be. Flavored are awful. Food takes forever. They should narrow down their menu and try and improve on the recipes. Seriously it's garbage and the place is depressing.", "author": "Holly M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-21", "description": "This place is exactly what I need while I'm craving Chinese. My roommate and I have become regulars here. Definitely a fair price an some good quality food.", "author": "Austin L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-13", "description": "We ordered salted fish fried rice, hot sauce beef with spinach, lemon chicken and beef chow fun with black bean sauce. Decent Chinese food I've had in the neighborhood for the price. \n\nMei confirmed if we knew how the rice tastes and we said yes!\n\nFood was good, fast and cheap. I will be a regular for sure.", "author": "Rori G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-12", "description": "The woman never smiles but she is on top with her service. Food is pretty good and cooked quickly, close to my house so I am a happy camper. Mongolian beef and soups are yummy.", "author": "Magda G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-18", "description": "Perfect location near the Giants game. It was so hot and delicious. Portion sizes are generous. Highly recommend everything we ate. Bbq Pork ribs, bout and sour soup, pork buns and chicken wontons. Well lit and safe location too. Smart To start hear before the game and have a full stomach for less cost.", "author": "Tracy B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-08-09", "description": "It is average for Chinese food. It could have been more authentic Hunan but I guess they are catering for generic Chinese food. There should be a few more prawns with green beans else it felt like eating green beans only.", "author": "Ayaz L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-07-10", "description": "不是到达的。not authentic Hunan at all. It's a Cantonese place pretending to be Hunanese.  Waitress/owner terrible communicator. Dishes I ordered were dry. Am not returning here ever.", "author": "Will L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-10-31", "description": "They should shut this place down for health code violation and simple just not being cool enough for the hood. Every single thing about this restaurant is sub-par, from the mean older lady who is always behind the counter (unfriendly and seemingly bitter/hating life... try a smile?), to the dry flavorless and probably unsafe 2 day old greasy slop that they reheat in the microwave, to the interior which looks like a dark prison cafeteria. The people who have given this resto a 4 or nay I say a 5 star, should have their Yelp account revoked, and they should be forced to eat this food for the rest of their sad lives. Barf", "author": "kelly n."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-03-11", "description": "Disappointing and tasteless. No effort or passion in making food. Very americanized. I wish it was better because it's so close to where I live!", "author": "Rui B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-26", "description": "\"Is the fish fresh?\"\n\"Yes, fresh.\"\n\"It's not frozen?\"\n(Long pause, puzzled look, thinking furiously)\n\"Fish frozen.  Dish cooked fresh.\"\n   *  *  *\n(Returning after checking takeout contents a block away:)\n\"You didn't give us the rice we ordered.\"\n\"I didn't charge you for rice.\"\n   *  *  *\nThat said, our fish filet with greens and prawns with string beans were well cooked and flavored.  And the one waitress, serving the entire small restaurant plus handling takeout, might be forgiven for any problems.  So four stars.", "author": "Walt B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-17", "description": "At first, convenience took precedence over tastebuds. Newbies in the city, moving day chaos... eventually, hunger took over...\n\nWe ordered our staple Chinese takeout food - Garlicky eggplant, Veggie chow foon, veggie potstickers and a side of rice. Now, I have to say, the veggie chow foon was OMG chopstick-licking good. Normally, I wouldn't eat it. But that Sunday, my poor husband ended up eating very little of his order! The garlicky eggplant lacked garlic. It did taste good though, no doubt. The potstickers didn't stand a chance either.\n\nThe second time, I wanted mushrooms. Now I didn't care how they were made, just a random mushroom craving. Turns out they were out/had very little left. So, I ended up getting my alternate staple - String beans sauteed in a garlicky spicy sauce. Yeah, this one didn't stand a chance either :D And what made it awesomer was that it contained mushrooms! Probably whatever they had left!\n\nYeah, the hostess/order taking lady/owner is not the most pleasant to converse with. But seriously, who cares, especially if you are getting food to go? It's not like it's a swanky place to make connections and what not... Get over it. Enjoy the food. And the cheapness of it. And it's multiple-meals lasting quantity.", "author": "Ranjani S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-26", "description": "I'm a fan of this place for a few basic reasons:\n\nThey keep it simple.  The prices are affordable.  The wait staff is kind.\n\nI'm tired of all the over-priced, reclaimed wood, small portion, mixologist type bar-restaurants popping up on every block.\n\nThis place is super minimal, just like your expectations should be.", "author": "Tiger S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-11-22", "description": "I feel tensed whenever I go to this place. The lady seems always upset and snappy. Not a very welcoming atmosphere. Food is so so.", "author": "Ana V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-12", "description": "This place is a life saver on nights when no one wants to cook. Given how close we live to the ballpark traffic can be horrific so ordering any delivery can take over an hour. Fortunately house of hunan can whip up a hot meal in less than 15 minutes. We usually call in our order then pick it up 10 minutes!\n\nStick with the basics - also their fried rice is great!", "author": "Dianna S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-07-28", "description": "I forgot how this place was when I went back recently.  The portions are good but it's kind of expensive.  Dinner combo will set you back $15 for Chinese take out.  The wonton soup was not good.  The sweet and sour pork had too much fat and breading and felt gross to eat.  The small veggie egg roll was all bread.", "author": "Chris L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-09-17", "description": "Terrible food and service. Impatient and Very bad attitude. They gave me receipt before I finished.", "author": "Leylee L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-10-22", "description": "This may be the worst Chinese I've had.  Chicken chow fun was clumpy, and completely flavorless.  I threw it away.  Eggplant with garlic sauce had some flavor, but was drowning in oil.  Then, I found a hair buried in the eggplant dish - DISGUSTING.  I threw that away too. Lastly, the chicken dumplings were actually not bad.  And the sauce had some flavor, but it was 75% oil.  Sadly, I live close and was hoping this could be a go to.  But never again...", "author": "Sharon P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-04-10", "description": "I added a star because of convenience to my place but I had to take the 1 star out for still charging customers a 10c bag fee for her superflimsy non-compliant plastic bags that is thinner than a no-name brand 10yo condom.  The lady owner there is unfriendly and never smiles but I buy food  from her restaurant only because it's the only Chinese restaurant within walking distance to where I live and is on my way walking from the Caltrain station going home. She should always be happy to see me because I'm there to patronize her business.\n\nI probably have bought food to go from  her 5x and she never replaced her pathetic non-recyclable/non-reusable bags that probably costs her a penny per 1000 pieces.  It irked me that she had the gall to point to the ordinance poster that she put up on her counter to tell me that I have to pay 10c for the bags now.  Now I wouldn't eat there if there was any other Chinese restaurant nearby because I don't like the owner and the food is nothing special.\n\nAs for her plastic bags, San Francisco can fine merchants who violate the ordinance--either by not charging the 10 cents or by using bags that don't meet the ordinance's specifications--$100 for a first violation, $200 for a second and $500 for each violation thereafter. To enforce the rules, the city will do some random checks and respond to complaints.\n\nHere's the San Francisco Bag Ordinance Non-Compliance Form if you care to anonymously report violators:\nhttps://docs.google.com/a/sfenvironment.org/spreadsheet/viewform?formkey=dFpqOEhlVkdlaXlzZlFxSHktSG1pbEE6MQ#gid=0", "author": "P J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-14", "description": "This little spot tucked off the main embarcaderi drag has some very good Chinese food at a reasonable price. Fast fresh with lunch specials.\nIt is not the best in SF , my vote is Eliza's for that, but a great cheap place to eat in an area of high priced fancy places", "author": "Matt A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-24", "description": "Came here for a late night dinner outing with friends. First thing I got to say for the BBQ Spear Ribs I ordered \"OMFG\" it falls off the bone! So soft and tender! I never had ribs like this before. \n\nBest part the pricing actually pretty cheap around $7-8 pricing. This is cheap considering the pricing for food around the ATT Ballpark area especially when this place is less than a block away from the park itself.\n\nDefinitely going to come here before going to a game to save money on food. Since prices at the ballpark is a ripoff in the first place.\n\nI'm definitely coming back next time!", "author": "Steven C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-08-21", "description": "Stumbled in on a late lunch, no patrons? Hmmm I'm starved have 20 minutes to make a decision before the work day winds down, and I have to head back to the office cube.  The place is in a potentially good location so I just bit the bullet without fully yelping it.  Food was cheap but it doesn't mean it had to be so depressing.  Got the twice cooked pork, which probably got nuked in a microwave, so better change the name to triple cooked pork.  The woman working was nice, and then the staff emerged from the kitchen and sat down and ate lunch.  Who knows what their topic of conversation was about, probably wondering wtf I chose to eat there with all the other great affordable options on the waterfront.  \n\nWhatever they were eating looked better than my menu choice, would I go back...eh probably not.", "author": "B H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-11-16", "description": "This place is next to my apartment. One day we were in rush and so ordered from this place without checking reviews. We ordered Mongolian beef and orange chicken to go. The taste was OK, but the quality of the beef was so bad we ended up trashing the whole Mongolian beef. The orange chicken was no better, it had so much bread crust and sweet syrup around the chicken pieces that it tasted more like a bad pastry rather than food.\nI will never ever get food from this place again.", "author": "Saeed A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-06-23", "description": "Good food for cheap, came here with coworkers the first time and wasn't that bad. Ordered the Mongolian beef lunch special with noodles, way too much noodles for the beef ratio, it's worth the  price meal was $10 bucks love the neighborhood, think it's the only Chinese food in the Townsend apartment area", "author": "Nessa H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-03-16", "description": "even the steamed rice is bland and needs to be drenched in soy sauce\n\ni live nearby so i wanted this to be good... or decent\ni had very low expectations\nand i was still surpised by how flavorless everything was  - especially because i ordered honey walnut prawn and sweet and sour pork... traditionally those should both be saucey dishes but they were both horrible. \nthe cream cheese and crab puffs were the only thing that was edible. \n\nim sure this business will be closing very soon. \nthey dont even give out fortune cookies. \n\nsucks to suck", "author": "Shanna N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-28", "description": "Another place close to work and the best time to go is durning lunch, well maybe about 1ish cause it can get a little busy during lunch. Food is pretty good and for what you pay the portions are not bad either. If there is not something on the lunch menu ask them and they will generally make it for you. Over all a great place to grab some quick chinese.", "author": "christina a."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-07-29", "description": "Decent neighborhood restaurant in an area that lacks a lot of night time dining establishments. \n\nThe won ton soup was really good but the beef chow fun was just okay. Will definitely come back for the won ton soup. Perfect for a chilly SF night.", "author": "CL S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-29", "description": "Very convenient location for baseball games as it's just off the Embarcadero between Market Street and AT&T Park. I have eaten there many times, usually getting the Chinese Broccoli with Oyster sauce or the Salty Fish and Chicken Fried Rice. I've also had the steamed dumplings - (xiao long bao) which were quite tasty. Can't beat the fast and friendly service either.  One of my favorite stops when I'm in the area.", "author": "P W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-07-16", "description": "Finally tried the chicken and black bean with string beans! I got brown rice which came out a little dry and stale, but the sauce was really good and the string beans excellent. The chicken is plentiful and not too rubbery.\n\nThe lady who serves us always remembers us and our favorite dishes, and remembers our individual requests. She's really nice and enjoys our loyalty.", "author": "Ziyan C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-05-01", "description": "RAT OR CAT TOOTH? Food was good with one notable exception...we found an incisor tooth from either a cat or rat. What do you think it is? Picture included in this link. I called to let them know and they couldn't care less.\n\nhttps://picasaweb.google.com/lh/photo/FcwZkMVsuEBVLSIMs4247dMTjNZETYmyPJy0liipFm0?feat=directlink", "author": "Cacciato O."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-01-18", "description": "The food is pretty bad and no matter how much you order the lady will give you ONE soy sauce and if you ask for more you will either get ONE more or \"too ma so sau bahd\"\n\nI gave them 2 stars only because at least there is one chinese restaurant within walking distance of South Beach of soma district -- it's like for some reason chinese and mexican restaurants (my two fav foods) are not allowed in the area or something!", "author": "Nolan M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-27", "description": "This place is convenient to our new place so we've been here a couple of times now.  I know some people have had an issue with the 10 cent bag fee, we always just tell whoever is working that we don't need the bag because we have our own. The portions are a little less than we are used to but the Mongolian Chicken and Chicken Chow Mein are really good.  The staff has always been cordial to us when we've been there, I won't say friendly because they are focused on the work more than going out of their way to chitchat, which is fine with me.  I will say that they prop the door open sometimes because there's no A/C and that does let flies in, maybe they should try an air curtain?", "author": "Jenna E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-12", "description": "If I want my Chinese fix, I hop over to HOUSE OF HUNAAAN for lunch with my coworker.\n\nWe always orda - Tomato Beef Chow Mein with Curry HONG KONG STYLE. (which means crispy noodles that get soaked in the curry sauce after you mix it... drrroool)\n\nYUM. Don't know how many calories I'm consuming but they provide a huge portion and I'm always feenin' for it.\n\nYes, I come again.", "author": "Erin C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-02", "description": "This place is very nearby our house and has just become a favorite for us. Good food for a great price. Nothing fancy, just good food and a nice service. I love the won ton soup, sesame chicken, general sho chicken, Mongolian beef and tomato chow mein.", "author": "Wouter K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-01-31", "description": "WORST (and completely RACIST) customer experience of my entire life. Delivered and charged me for the wrong meal, so I called and spoke with the woman who took my order. Rather than apologizing and canceling the order, she sent back the delivery man back to pick up and take back the entree. She said if it wasn't touched THEN she'd refund me.  I thought it was ridiculous, but I said \"OK.\" Man comes back and asks whether or not I was Chinese. When I told him \"No\" he said that Chinese would have not made this a problem, but because I was Japanese he has no interest in delivering to my apartment again.\n\nHey Mister - we live in a social world and your business is on Yelp. You want people to eat at your restaurant? Best of luck to you because you'll need it.", "author": "Alex H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-07-19", "description": "We went to this restaurant last night to order Mongolian beef and yanchow fried rice for dinner. The Mongolian beef was really nasty & dark, and the taste was unacceptable too, not at all, the yanchow fried rice we ordered, were made by the old meat, taste eww and you can even smell it. \nDon't go here unless u want get disappointed like us :(", "author": "Erica T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-02-14", "description": "I'd give it no star or negative but yelp won't allow it. This place is not good in food and service. I've lived within minutes of the place for years and the only thing I get there is the wonton soup and shrimp dumpling.. And after many trials and errors! They now even messed the wonton soup up which smelled like cat pee recently /:  I did get the chicken spicy noodle soup which also changed recipe for the worse. I really hope another Chinese place opens nearby. The only reason this place is still open is because it's the only Chinese restaurant in the immediate area.", "author": "John V."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-10-31", "description": "This place is pretty unspectacular. The taste of the food more-or-less matches the somewhat depressing and sterile atmosphere of the restaurant. Specifically, the sesame chicken and shrimp dumplings were okay. The steamed pork buns and Shanghai dumplings were below average. And the lemon chicken was soggy and not good. And to top it off, it isn't that cheap.", "author": "James T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-16", "description": "This place was amazing! The dumplings and fish were outstanding. The service isn't bad and the lady was so amazingly sweet (not the taste the feeling). I know I'm only age nine ,but I had to review this restaurant on Yelp. Also the pork B.B.Q fried rice is so good. The location is not that bad (if you live in the near the ocean). Once again you have too come to the House of Hunan now because I think it's the best CHINESE FOOD! Come here. Bye", "author": "Victoria K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-12", "description": "The food is authentic and fresh. 5 stars from me... The restaurant is small but the service and the food makes to for the size.", "author": "Mel J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-14", "description": "Great, quick food for an afternoon where the light of day may not be the best idea......if you catch my drift.", "author": "Nicholas A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-03-12", "description": "The food here is cheap. They say they don't use MSG which is a plus. I would stick with the basics such as Sesame Chicken lunch plate. My personal favorites are the Mapo Tofu & the Mongolian Tofu. I avoid meat at places like this for obvious reasons.\n\nRemember to bring cash if you are spending less than $15 (you will get less shank-eye) and also call your order in ahead of time for speedier takeout service.", "author": "Tala D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-05-02", "description": "Horrible customer service for mediocre Chinese food. I have never felt discriminated on in my whole life. I'm Filipino and the owner was racist towards me. On numerous times, she has served whites and Chinese  first and had forgotten my order or that's I was in there. I only came back because I live a block away. The final straw was when I had asked for extra chili sauce and she charged me extra for it. That's is fine except when a white lady walked in and asked for 5 extra chili sauce but was never charged.  I brought it up and why I was charged and others are not. She just ignored me. Never coming back to this place again. It's not that good anyway. I'll just order from Eat24 or Grubhub fo4 my next Chinese craving.", "author": "Candy C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-11-26", "description": "Delivery took 90 minutes (quoted 40) on a Saturday night. I'll give them the benefit of the doubt here, since it was the Saturday after Thanksgiving, so maybe they were slammed with people who were tired of turkey.\n\nFood ranged from just ok to barely edible: mongolian beef was very spicy, shrimp egg foo young was drenched in fishy-tasting sauce, and onion pancakes were not crisp and flaky and some pieces didn't contain any scallions at all. Wonton soup was probably the best of all, and it tasted fishy as well.\n\nDon't think I'll be ordering from them again.", "author": "Mark S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-10", "description": "After peeping this place out over and over again during my morning walk, I decided to give it a try today.\n\nMy first impressions - Small and clean. The seating was tight, but the place was still 70% packed. The owner or mgr was semi rude; I needed to take a leak before anything, so I asked to use the bathroom and I was greeted with a firm but not totally rude \"Are you eating here?\". Whatever. Not a big deal. I'm a veteran of chinese restaurants and understand customer service and being pleasant usually are not high on their priority list.\n\nWhat happens after the bathroom episode is hilarious and gross at the same time....\n\nThe same person who was playing bathroom bouncer proceeded to seat me. Upon seating me she looks up at the window right next to me and notices a fly...without thinking or wasting any time, she whips out her order pad and....BAM!! Fly eliminated...haha...She wipes the guts and blood off a few times to make sure it was all gone.\n\nI looked and thought \"Did she just....\". \n\nShe calmly hands me a menu, and I was so hungry I didn't even give it second thought.\n\nMoving along...\n\nThe food: The food was hot & fresh and was just the right amount. The lunch specials are pretty cheap (5.95-7.95).\n\nFrom the lunch specials menu (which includes soup, rice and a fortune cookie),  I ordered the chicken asparagus (yummy!). Before I could even get my FB feed up...BAM!! My food was on the table...2-3 minutes tops. Fastest I've ever had a rice plate served. EVER! Even Panda Express (yes I know it's not REAL chinese food) takes a good 5-10 minutes.\n\n\nService:  They took my order promptly. Served my food in record setting fashion and made sure my glass of water was always filled. What more could I ask for?\n\nGiving it 4 stars for the food and quick delivery. If you're short on time and want good chinese food, this is the spot. I'll defintely be back....sorry I can't say the same for the fly...RIP = (", "author": "Albert G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-02-27", "description": "No credit card for charges below 15.\nThe ma po tofu has no Sichuan peppercorn in it. \nDon't bother.", "author": "Milton S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-01-02", "description": "House of Hunan can be hit or miss. As a general rule, go for the noodle dishes!\n\nMango Chicken - Yuck! The mango was way too tart, the chicken bad.\nSpicy Chow Mein - Yum! (Actually it's Lo Mein but whatever.) Big thick noodles, with just a hint of spicy kick. Very tasty.\nSliced Pork and Preserved Vegetable Noodle Soup -- OK. Again, good noodles, tasty broth, but not enough pork or preserved vegetables.\nWest Lake Beef Soup -- OK. Not bad but the flavors could be more bold.\n\nThis place is basically a take-out joint for the apartments nearby. It can be tasty, you've just got to be a little careful with what you order.", "author": "Alexander J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-28", "description": "Nice cozy spot for great chinese good! Their bbq ribs are super bomb", "author": "Walt F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-07-31", "description": "Food is somewhat authentically Cantonese (they spoke Cantonese to me).  First Chinese restaurant with food that is not at all greasy which deserves a star.  Pretty tasty Chinese food in an unlikely corner of SOMA, very unnoticeable unless you happen to wander in.  My order of garlic pork over brown rice was done in minutes, yum!  Other items coming out of the kitchen look good as well.  Will go back again if I'm in the area and feeling Chinese.", "author": "Stephanie C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-18", "description": "Decent portioned, inexpensive Chinese restaurant that leaves little to imagine. It's a good place to stop if you want to pick up a quick dinner after a long day. I've been there four times, and haven't been disappointed. That being said, the taste/quality can be described as 4/5 at best.", "author": "Suraj P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-08-08", "description": "The waiter and owner kept pouring water into my glass full of 7up.  I kept telling them it was 7up, but always too late.  Then the owner said she would give me another can of 7up, but she never did.  Also, the food took a long time to cook.  Food was about a 6.5 out of 10", "author": "James C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-26", "description": "The only Chinese food restaurant nearby and it's good. All those dishes that are marked as spicy are actually not that spicy at all. Very mild cuisine.", "author": "Charlie S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-09-12", "description": "My work ordered this for our Tuesday luncheon meeting. I love free food. Let me repeat that. I LOVE free food. However, I did not love this. It was just not very enjoyable, which is a letdown since I have been on such a Chinese food kick lately. \nI ordered the Ma Pao Tofu, which is normally delicious. This one was weird, and surprisingly not very flavorful. Generally, this dish is pretty spicy, but this one was definitely way too mild for my taste. Also, they put peas in it, which was weird and didn't really go with the dish. \n\nSince this was free, I obviously ate it, however if I had to pay for it, I wouldn't order it.", "author": "Jillian M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-07-03", "description": "So I only have two issues with this place. The bundles of human hair I found in at least two lunches I bought there. I did take out and thought the first one was just a fluke but then it happened again a week later. The food is not bad and the servings are huge but the fact that I found hair in their twice in two weeks tells me they are a little lackadaisical with their food preparation protocols. I won't be going here again. Sorry guys, I really wanted to go there since you are the only chinese restaurant in walking distance.", "author": "J S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-05-21", "description": "The entire time while eating my uber bland veggie mu shu, I kept thinking of Kramer as he ordered \"extra MSG\" for his Chinese food. I wish I had.\n\nIt was pretty tasteless. Even after adding soy sauce to the mu shu (which I never do), I wanted someone to pass me a salt shaker. I checked, it is Kari-Out Co. soy sauce and frankly it wasn't doing the trick - definitely no Kikkoman.  Ditto with the hoisin sauce... Like the flavor had been watered down.  I am guessing everything was cooked in sub-par sauces and therefore everything lacked flavor.\n\nThose that looked pretty happy were the broccoli beef and the shrimp with snow pea eaters. But they were the odd men out in a group of 13 people. \n\nWhile the House of Hunan was delivered with a smile, on time, and hot, I don't think I will be ordering from them again. Rats! I really wanted to like them.", "author": "Hayley W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-06-23", "description": "The Mongolian Chicken is excellent... very spicy and flavorful. It's great to see places that live up to the little pepper icon they put next to their spiciest dishes.\n\nI got the lunch special for $6, so it was served over steamed rice and came with a small cup of Hot & Sour soup. There's a listing of what comes with the lunch special, but a couple things were crossed out. It was kinda disheartening to see that the lunch special used to come with salad and fruit.  They tried to hide this fact from me, but I could still read through the scribbled ink! (Should've used a Sharpie!). \n\nThe Hot & Sour soup was kinda \"blah\" though, a little too peppery and salty.", "author": "Jeffrey J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-09-03", "description": "I love Chinese food.\nthis place for me is just ok. not very impressive.\n\ni know i can't compare this place with some other big restaurants.\nI take out sometime because it is right next to where I live.\nIf you know how to cook, you know there is some food you can't go wrong with.\n\nSalt and pepper prawn is my favorite\nKung pao vegi with tofu is not bad\n\nI never ask them to deliver bc it's so close.\n\ni may take out again from this place but i don't  want to recommend.", "author": "Ashley S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-05-03", "description": "Went here a few time & had take out because it's the only Chinese food in the area.  The soups are pretty good.  Ate at the place but it was kind of gross with flies & dead bugs around the windows & seating area.  Also was grossed out about using the restroom & there was no hand soap...absolutely dried up...so do the cooks not wash their hands?  Uck.  In all honestly, that was last year.  I do see now that the health score improved into the 80's.  We'll might give it another try just because of location but any restaurant that is empty in this area is never a good sign.", "author": "Donna W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-26", "description": "This is decent Chinese food. They have a good selection of dishes, they deliver hot and quickly. They were happy to accommodate me when I asked for a mixed vegetable dish that was not on their menu. I ordered their egg roll once, and it was a bit greasy. Anything else I have ordered, fried rice, stir fried veggies, was light on the oil, and MSG free.", "author": "Zarina S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-23", "description": "Order the Mango Chicken ... it's delicious. \n\nI work across the street, and have been a customer for more than a year. It's your typical hole-in-the-wall chinese place. \n\nGo in with the right expectations. It's cheap and tasty.", "author": "Bruce A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-12-14", "description": "Really terrible.  Every dish was pretty much disgusting.  I would avoid this place.", "author": "Alden F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-16", "description": "House of Hunan is on my walk home from work, and is all that I could ask for when I want take out Chinese.  My order is usually ready and waiting for me within 10 minutes of my phone call.\n\nNo complaints on the quality food, I am a fan of the Mongolian Beef personally.  If you are into spicy, ask for a container of the hot spices/sauce at the front counter.", "author": "Joshua B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-06", "description": "We've been ordering from here for about 6 years now.  We definitely know which dishes to get (sesame chicken, BBQ pork fried rice) and which to avoid (potstickers - usually burned and too doughy, spinach with garlic - they leave the stems on that can choke you).  They're definitely all business so don't try and make friends with the counter people/owners.  Delivery is pretty quick and 90% of the time has been accurate.  The actual shop is pretty small and I can't say we've ever eaten there.  If you want some quick and easy \"chinese\" food, House of Hunan is pretty decent.", "author": "Plaid B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-30", "description": "Great Chinese food, small restaurant with all-Chinese cooks. It's very much what first-generation immigrants would love to eat, as well as expats from mainland China. I love their prices. Don't come here looking for good service or great presentation.", "author": "Hendrick S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-05-13", "description": "I dunno...maybe you shouldn't really trust me, so blinded by cravings was I.  You see, I used to live in the delivery sphere of Big Lantern, and though there are lots of yummy vegan foodses in Oakland, I have yet to find the same level and variety of fried meatless morsels covered in sweet sauce in my new neck of the woods.  So, I was jonesin' for some sweet and sour meatless chicken.\n\nAnd then, what is this I find?  A Chinese restaurant near my office that has meatless chicken and lots of tofu dishes?  Can this be?  Sure, Yelp tried to tell me to not get my hopes up, but I couldn't help it.  I HAVEN'T HAD SWEET AND SOUR MEATLESS CHICKEN IN LIKE LITERALLY FOREVER OKAY?\n\nAnd yeah.  Alright, Yelp, you were right.  It was nothing special - in fact it was borderline not so good.  The rice was sticky in that this-is-not-supposed-to-be-sticky-rice kind of way, and the meatless chicken was that kind of caramel-y too sweet TVP, and was a little too, um, toothesome.  That being said, for veggies it does have a lot of choice which is hard not to appreciate when you work in this area of SOMA.  There are two meatless chicken dishes, as well as sweet and sour tofu, mango tofu, general's tofu...oh yeah, and some not as fried and bad for you options as well.\n\nOh and the fortune cookie is vegan.  Laden with chemicals and numbered colors...but, uh, VEGAN!\n\nI'll be back just because of what they have, but it's not a destination spot, by any means.", "author": "Ashley B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-06-22", "description": "Wor Wonton Soup- i did not like it.\nChicken Fried Rice- couldnt stop eating\nMongolian Chicken- good.\nSweet and Sour Chicken-bad\n\nyes i may order from them again. Quick delivery. Good prices. Just blah..no fireworks...sigh..im bored... pls. pleaze me w/ ur amazing food restaurants. pls.!...\n=)", "author": "C A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-11-10", "description": "Every other time we order for lunch delivery they mess up our order. The chick that answers the phone seems to be a biotch too. However food is decent enough and the affordable lunch specials keeps us a calling.", "author": "Craig I."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-05-19", "description": "This is the worst interaction I've had in years. Seriously.\n\nI live 4 blocks from their place. It took +50 minutes to deliver the order. When it got here, the order was wrong. I called back and was yelled at. That's right - yelled at. They told me to give them the order they sent back or they would charge me more.\n\nThe food is not that good and the service is AWFUL. Stay away. If I could do 0 stars, I would.", "author": "Donovan B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-10-18", "description": "This is underneath the appartments where my old college room mate lives.\n\nI tried it a year ago and it was really poor, he said that nobody in the building uses themas its so disgusting.\n\nI had flu though, so was desperate for some hot and sour soup. So trudged down stairs and ordered a large portion. For $6.50 I got a pot of what was essentially dish water with vegetable shreds and some tofu, no meat no shrimp, with a heavy dose of curry powder.\n\nIt looked bad, smelt bad, and tasted bad.\n\nJust been running to the toilet all afternoon.\n\nAvoid this place like the plague, it's revolting.", "author": "Dan B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-02-19", "description": "My favorite work neighborhood spot for Chinese. Fresh, clean & tasty. My top choices are the crab wontons, chow mein, egg fu young. They even make a decent Shanghai Dumpling.\n\nI even appreciate the owners stiff sensibility, like any true captain at the helm, she gets it done.", "author": "Shawn S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-05-20", "description": "Worst food delivery experience I have ever had.  \n\nAfter taking forever to get my place, the order was wrong.  When I called and requested the right food be sent, I was accused of not giving the right order in the first place.  When the food finally got to my place (another hour)  I was told they wanted the original order back or I would be charged again for the new food.  Um...?\n\nToo bad Yelp doesn't let me give zero stars.", "author": "Christina S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-12-06", "description": "gaaah!! fooled twice. blah bland bleh. \nSpicy chicken was not spicy..nor did it really even taste like chicken.\ni'm not sure what this was. \nbroccoli chicken and i requested to make it spicy. Again..same as above.\neven egg rolls were not tasty..how is that possible?!\nit's fried..hehe\n you will not get me a third time!!", "author": "Brandyy S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-06-26", "description": "I was about three bites into my meal when I happened upon a cockroach. So grossed out, I had it taken away and lost my appetite. They offered to prepare another dish, which I declined. They were also reluctant to remove it from the check, since I had to argue about it.\n\nI am willing to accept it being a freak thing, but a week later my coworker and I shared stories with chilling similarity. \n\nIt has been 2 years since that happened. I walk past this place every day to and from work, and I have not been back inside.", "author": "Larry O."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-08-26", "description": "I went here with a group of Mainland Chinese students. They seemed to like it so that's saying a lot. The food here is good but there was nothing extraordinary.", "author": "Deus D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-01-01", "description": "House of Hunan's Mission Statement: Individually, you mean nothing to us.  We're gonna get paid anyway, because our location and the demand to eat will bring us business.\n\nHouse of Hunan is one of those businesses who forget it's the 21st century, and that if you choose to treat some customers like they don't matter, it doesn't necessarily end there.\n\nI've come here twice for lunch.  The first time I came, it was later in the afternoon, and not crowded.  The food was okay, but the service was poor.\n\nThe second time, I walked over, and waited in a considerably long line.  The woman actually selected from the people who were waiting in line - not in the order we were waiting.  In fact, the 3 guys behind me were all seated and eating before she 'selected' me.\n\nFinally after waiting about 45 minutes (including the walk over, I had already exhausted an hour), I had no choice but to carry my food back to work, and eat at my desk.  Eventually I was picked, and allowed to place my order.  Once I placed my order, it took maybe 5 to 10 minutes.\n\nWhen I went to pay with a credit card, the woman snapped \"No credit card!\", and pointed to a sign that read that credit cards required a minimum purchase ($20, I think).  So I ended up paying with cash.  I was on the verge of telling her to just eat the food, herself or feed it to one of her employees. \n\nAdvice to employees at House of Hunan:  Treat every single customer like he has access to a computer and will review you on Yelp!\n\nI'll never go back.", "author": "John B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-03-12", "description": "We picked up from here.  The people were lovely and so nice but the food was really not very good.  It was like they were trying to Americanize it and missed the mark.", "author": "Becky T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-01-30", "description": "Last night my neighbor order food to go. She brought home as we were getting ready to watch Top Chef. I had order some spring rolls thinking that I was going to get 2 but I got 4 (YEAH!) and I order walnut prawns and that was all so good. Annie got us two orders of the Won Tong Soup and some shrimp dim sum and Annie got some chickens with some greens. Man we had a feast. I will order from them again because there no MSG and they deliver for free. I really enjoyed the food. \nI will update should go and sit at their table.", "author": "Der Maibaum L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2005-02-20", "description": "Bad bad bad. Hot and sour soup was bland and Kung Pao chicken was tasteless. Service was nice and prices cheap, but no good reason to go back.", "author": "Jeremy S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-01-03", "description": "Super friendly staff, great sweet 'n sour pork.  Their hot & sour soup was great in my opinion and their prices were fare.\n\nOnly fault is the staff can be pretty loud and can disturb your conversations with the horrible acoustics in the place.  But it's worth stopping in if you're in the mood for a tasty Chinese dish.", "author": "Jonathan B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2006-01-16", "description": "To the tune of AC/DC\n\n\"I....threw up       alllllll       niiiiight       long....\"\n\nbut to be fair, i think it was because i was starving when I started eating the takeout from here, and i think i scarfed WAY too fast...im pretty sure i wasnt poisoned. but i thought i would share that with you.\n\nANYHOOOOOO\n\nNot very good chinese food at all, but DAMNED if youre lazy like me...this place is like a block away from me, so of course I will be back again (its cheap at least.) DO NOT GET the garlic prawns...there was no garlic, but LOTS of ketchup, or some ketchup-like sauce.  Ma Po tofu is edible...Mongolian beef is over onioned...hot and sour soup is not awful if you've got some white pepper and soy sauce at home.\n\nSo its bad, but im lazy. Its a tragic combination.", "author": "Cathleya G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-25", "description": "Ordered here again out of desperation for take out and no desire to eat pizza.  Was really pleasantly surprised.  The food was - good!  We ordered the black bean chicken with green beans because so many yelpers seemed to like it.  Tasty this time!  We also ordered Mongolian Beef - two thumbs up!  Tried the potstickers also based on yelper positive reviews.  Liked those too!  In fact we liked everything so much.....we ordered again the next night.  It was a takeout eat in our jammies kind of weekend what can I say?  Only fair to update my review accordingly.  When I need Chinese takeout I know who to call.  Lucky for me they are in my hood.  Yay!", "author": "Kim M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-09-02", "description": "This restaurant is right by where I live.  After a long day at work, too lazy to cook, my girlfriend and I like to order take-out from this place.  Their stir-fry has great \"wok hay\".\nThe following are my favorites:\n1.  Singapore Fried Rice Noodle\n2.  Salted fish & chicken fried rice\n3.  Mu shu chicken\n\nOk, so the lady owner is a bit too cool for some people, but for me, I find her to be ok.  You just need to know her.  Chinese people tend to be more guarded and reserved.  Some of the comments here are quite funny, but... just give her a break, she's only trying to make a living.", "author": "Jaquelina L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2006-01-02", "description": "Update 5/17/06...What's that line from Brokeback? Totally applicable here...\"H of H, I wish I could quit you!!!\"...Good take-out for those days when the last thing you want to do is cook. Super convenient location and really cheap, but as the saying goes: You get what you pay for. Update: 2.4.06 Why has the food become progressively bland and tasteless during the course of a year? Maybe because of an ingredient that has been slowly deadening my taste buds...I need to make my own Chinese food from now on.", "author": "Evelyn B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-05-07", "description": "What can I say, I'm a sucker for Shanghai-style soup dumplings.  This place has them on their weird little dim sum menu (upper left corner), and they're perfectly tasty.  \n\nI don't generally care for Chinese food as whole--I am the first to say that the corn-starchy glop that adorns most dishes is totally not my thing-- but the handful of things I enjoy are done well at this spot.  I pop in a few times a month for some soup and a steamer full of dumplings when the other options around the office seem redundant.\n\nEveryone and their mom complains about the service, which does kind of suck, so simply plan accordingly: don't expect to sit down and be in and out in 30 minutes.  If you're ordering takeout and they tell you 15 minutes, just know it's probably going to be more like 20.  \n\nAs for the attitude, I don't think I've ever been overwhelmingly impressed with the kindness extended to me by a person trying to serve 45 meals simultaneously, so... you know, just don't take it personally.", "author": "Laura F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-02-22", "description": "I'm going to split this review into seperate parts - one for service, one for convenience, and one for the actual food.\n\nService... Guys, this is a chinese restaurant. As long as she doesn't hit you over the head with the wok, I'd consider that great service. Personally, I've never had a really bad experience here. As a bonus, they deliver the food in very nice reusable plastic containers. I reuse those containers when I pack food for lunch at work. FOUR STARS.\n\nConvenience... You call. You place your order. You repeat your order several times because her english isn't the best. You wait for 30 minutes. You get hot food. How freakin' awesome is that! FIVE STARS yo!\n\nFood... Objectively, the food is decent. It's not spectacular, it's not bad. It's OK. I like the yang chow fried rice, honey/walnut shrimp, salt+pepper scallops and beef with asparagus. THREE STARS.\n\nLike I said, I've never had a really bad experience. My worst experience happened just this afternoon. I order some food, and it came 30 minutes later as expected. When I opened the food containers, I noticed that I had gotten calamari (which I don't like) instead of scallops (which I had ordered, and which I LOVE). I called them to tell them they made a mistake. Her response? \"Oh sorry *click*\n\nYeah, that's service for you at a chinese restaurant. At least she didn't call the cops on me.", "author": "Derek L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-09-08", "description": "We ordered take-out - some typical chinese takeouty things. price was fine.  It was delivered quickly.   We ate it.   It was all meh. \n\nThere were plenty of leftovers.  I didnt save them.", "author": "Fallon C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-03-23", "description": "I wanted to get take-out Chinese food because it's close and I like to support local businesses. However, after reading reviews on Yelp, my husband refused to 'waste' a meal on eating sub-par food. But, he doesn't like Chinese that much anyway. So, I went by myself for lunch take out. It was not too expensive $3.50 or so for 3 steamed vegetarian buns. They took 15 minutes while I waited there. (Too long for take out 'fast food'.) The buns were tiny! Like 3 bites each. \nThey were also soggy- on the inside, which to me means they were frozen; and tasteless. So, I added soy sauce, which only added to the sogginess. A terrible lunch! Well, now I've learned my lesson and my husband can say, \"I told you so.\" Next time I'll listen to yelpers more!", "author": "Kat T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-06-12", "description": "There are over 50 posts for this same restaurant  with the address of 654 Delancey, but I believe 2 Townsend to be the proper one...\n\nGreat lunch prices considering the location.  I know the rent here must be sky-high...\n\nNice presentation as well...", "author": "Nathan W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-23", "description": "Definitely recommend their mango dishes and their roast duck.  Both dishes were really well made.  Although supposedly being a szechuan restaurant, there wasn't too much spicy on the dishes, which was a little disappointing.", "author": "Robert Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-05", "description": "They're back! We ordered some dishes delivered recently and the excessively greasy junky food feel had gone: we had clean, lightly seasoned dishes full of crisp fresh  vegetables that were a joy to eat and taste, without excessive use of soy sauce or oils. Good stuff for a quick nosh-up!", "author": "Nick W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-03-27", "description": "I'm just writing a review so I can find the phone number more easily on Yelp.  For some reason, this place seldom comes up on searches no matter what terms I use.\n\nI order the Chicken w/Black Bean sauce over rice for lunch religiously once a week.  Just walk on over and pick it up.  Not top food but solid for the price.  Good sized portions too.", "author": "J. O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-07", "description": "Had a craving for chinese delivery and decided to try this place.\n\n--Con: \nThe food took almost 40 minutes and we live less than 1/2 mile away. \nPork dumplings looked frozen/pre-made.\n\n--Pro: \nThe food portions are HUGE!\nI ordered shrimp egg foo young and have gotten at least 3 meals out of it. \nThe egg flower soup was really good. \nFried Rice was tasty.\nDelivery man was courteous.\nThey try to completely satisfy you. I really wanted chinese broccoli with garlic, but they were out. They did have bok choy, which wasn't overcooked.\n\nConclusion: I will definitely eat here again.", "author": "Erica R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-03-07", "description": "I typically order the General Shao's Chicken, or Orange Chicken. It's the typical americanized chinese food.  Get there or place an order for pickup before 12.", "author": "Ryan D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-03-10", "description": "This place is never really that good. Had a few meals here and have to agree with an earlier review that mall food is a step up! The lady at the front is kinda no-nonsense and not one for conversation. Wait is usually awhile if it is lunchtime. \n\nThey've got it good though, cause there's not much else going on in this area in terms of Chinese food... (nearby sports bar actually has a decent thai chicken dish, but no one would associate the two) if they didn't have a monopoly then House of Hunan would surely be out of business.", "author": "Nick V."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-05-15", "description": "Pretty divey food, but it's got a great location and is convenient to order from. I was visiting a friend who lived at Bayside Village, and this place is literally across the street. We ordered take out and didn't have to wait long at all. In fact, by the time we walked over there (about 10 minutes since we meandered to the petstore nearby) the food was already waiting for us. The lady was really nice too (the cashier).\n\nWe ordered the garlic eggplant (very very oily, swimming in an inch of oil in the take out container, it was tasty but only because it was drenched in oil; couldn't eat more than one piece of this), the broccoli chicken (very delicious, the chicken was tender, and the broccoli and carrots not overly cooked, still crisp, and junky), green onion pancake (this isn't your usual kind with the white, soft dough consistency and green onions; this is the kind with a thin, brown fried shell and a thin layer of scrambled eggs with green onion inside..it wasn't very tasty and a little too bland/dry), and steamed rice.\n\nThis is definitely a place you go for convenience, and it's not half bad as long as you expect junky Chinese food!", "author": "Katherine P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-07-04", "description": "I tried the garlic chicken with asparagus lunch special on July 2nd and it was to die for.", "author": "Marc N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-03-29", "description": "I would have to say that this is the best take out/delivery Chinese restaurant that I've found in the area.  \n\nMost time I order Chinese food delivery, its from some greesy hole in the wall.  When the food arrives, its so saturated in oil that I get the runs for 2 days afterwards.  Me no likey.\n\nThis place was a pleasant surprise.  Its not quite as light as the Wok fired chains that I find in other restaurants (i.e. Pick up stix, Pei Wei, etc), but its not bad at all for a family owned establishment.\n\nWe ordered the Kung Pao Chicken and the Garlic Broccoli, both of which were very good.  Also, the steamed rice was perfect, not too clumpy.  Plus, I noticed they have a lot of vegetarian places for all of you locals who don't eat the meat.  All in all, this is a pretty good place to grab and go or to have delivered to your apartment.", "author": "Aaron M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-03-26", "description": "single server who gets very busy at lunch time but tries.. prices have gone up considerably from listed menus and food is adequate.. Not gourment Chinese, but decent food, served plainly and a bit slowly", "author": "ira l."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-12-23", "description": "I used to eat here every now and then when I worked at a company located at Brannan and 2nd Street.  Now that I'm living nearby, I find this a convenient choice at a good value.  The food is quite average - but it fills the need when I don't want to wait around for delivery from Red Jade or another more tasty choice.\n\nSpicy pork and beef chow mein is my choice dish here.", "author": "Jamie W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-12-17", "description": "The dim sum is acceptable but the rest of the Chinese fare is mediocre.  \n\nThe main woman is generally rude, but at least she actually is from South China, so I can forgive the rudeness.\n\nSince finding Chinese food in SOMA on weekends is so difficult, this place is an acceptable substitute.  If there were more choices,  this place probably would not make the cut.", "author": "Ankur P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-10-05", "description": "Food is marginal even for a chinese food take out. I ordred the orange chicken, sweet sour soup, and mongolian beef. The soup was ok, the chicken had too much dough\\flour or whatever they wrap it in.. The mongolian beef was more like mongolian onions.. Way too many onions.. I guess it was ok for a quick fix..\n\nOh by the way, I ordered by phone so I don't know what it looks like..", "author": "Muhammad S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-01-29", "description": "So the thing with this place is that it's really good at some things at not so good at others, especially the bastardized Asian dishes.  You just have to find their sweet spot.  I give these guys 5 snaps just because they have fed me on late nights where I was just too lazy to drive anywhere.\n\nTheir Salt and pepper fish, scallion pancake, and beef dishes don't get along with me.  However, they make a really good chicken and brocoli (american, not asian brocoli) or string bean over rice.  Their beef chow fun is mediocre at best but if I really want a good Chow Fun, I would go to Canton Dim Sum house.  They use fresh chicken meat do not use any MSG.  How do I know?  Because I would have passed out after eating if there was.\n\nIf you ever sit down and eat, ask the owner to bring out some specials or things that they're really good at.  I did that last time when I went with my fellow Asian brethren and was surprised.  Their fresh fish over veggies was very good.    \n\nAll in all, these guys make me happy and will give them praise for keeping me alive over the years on Brannan.  But if I had to rate the overall quality of food objectively, I would give them 3 stars.", "author": "Caesar C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-05-19", "description": "Fast delivery, great food, and great prices. All around this is one of my favorite Chinese restaurants in SOMA.\n\nStaff is always friendly and helpful, and always happy to see me. I would recommend it to anyone looking for some great Chinese cuisine.", "author": "Carrie W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-11-09", "description": "Tried this place twice already.  Way too Americanized.  I don't ever recall traditional ma po tofu having peas and carrots in it.  Beef chow fun has no flavor and the chow fun isn't fresh.  Flavor is not good and not worth the price.", "author": "Yun W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-06-17", "description": "Terrific classic Chinese food. We ate in and while the atmosphere is very basic, the service was pleasant and quick. Piping hot, fresh food and (get this!) wine @ $2.75/glass (shut up, really? Yes- really.). Nice vegetarian options and my mom loved her sweet & sour pork and chow mein. \nThey do a busy take-out and local delivery service. Good place to fill up before or after a Giants game. \nTwo of us each enjoyed two entrees and two glasses of wine for $45.00.", "author": "Macy M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-01-23", "description": "You have to know what to order here to get something edible. Do NOT order the green onion pancakes. You can get the chow fun and the salt and pepper pork and probably anything else that's fried, but anything else is debatable. Service is only ok. \n\nI usually don't go here because I don't really consider it Chinese food (okay I'm a snob) but it's useful when you're really hungry and you have less than ten bucks in your pocket and you don't want to eat at McDonald's again.", "author": "kimberly l."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-09-30", "description": "I like that there is a Chinese food place near my house. Mmmm Chinese food.\n\nHOWEVS,\n\nThe lady kinda scares me. She's pretty gruff and no-nonsense and sometimes there's a communication issue, which makes me think she might be mad at me. \n\nOther than that somewhat uncomfortable situation, two thumbs up!", "author": "Eli B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-12", "description": "Place is good.  great service and the Mongolian Beef and Mango Chicken is very solid.  Good price point and solid neighborhood food.", "author": "Harry E."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-08-16", "description": "This place was a weird experience. Ok this is the kinda place which is nice for lunch, quick and cheap. The food was actually pretty good, I thought. \n\nThen came the time to pay: the bill is $22.65, we throw $30, and get back $2 ! We tell the owner about it, and she swears we gave her $25, screaming in the whole restaurant that we gave her $25. And what an attitude, we could not believe it !!!!!!!!!! Made us feel like monsters, and she got an $8 tip :) Wooooow !!! So beware, don't give her a $100 bill, or you might never see your change...  :)", "author": "Steph S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-15", "description": "We had the hot & sour soup, chicken fried rice, and beef & broccoli. I didn't particularly care for the soup (although I never really order it normally). The other two dishes were tasty. The service was courteous and fast.", "author": "Joel H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-01-03", "description": "I used to live right above House of Hunan and have been grateful to have this little germ in the neighborhood.\nThe food is decent, especially its Thai Vermicelli reminds me of home - we call it Singapore Vermicelli in Malaysia.\nBut best of all is the friendliness of the owner and her crew!\nI will always remember the many conversations i had with the owner on the quiet afternoons...", "author": "Yee T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-06-14", "description": "I was taken here by two guys in my office today.  Mostly good - the soup, tea, and water were served promptly.  The potstickers were decent (though they needed some more spice, in my opinion).  Only sad part was that three of our four meals came out almost at once, with almost a ten minute wait before the fourth.  When they're all basic rice dishes, shouldn't really be that large of a gap.  Oh well.  It's cheap and close to the office, so can't complain.", "author": "Adam T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-03-16", "description": "Well, I'm so happy we found a nice and clean Chinese restaurant close to us!  I wouldn't say the food was great, but it was good and it didn't feel  heavy or greasy which some times can be an issue in Chinese restaurants. The place looks very clean, which is another unusual trait that made me very happy! There are big windows overlooking a small patch of grass... I wouldn't say it has great ambiance but it's nice and airy, certainly nicer than average. \nThe menu is fantastic! There is a lot of variety of dishes so we probably won't get bored any time soon. We tried the crab cheese puffs, which were ok.. the dim sum sampler and the garlic prawns. All ok.\nThe service was a bit strange - we ordered appetizers and entrees, then another gentleman arrived and ordered his meal. His soup arrived before our appetizers. Then his entree arrived before our appetizers. We had to wait quite a bit. Maybe he was VIP. I should have asked for an autograph. \nThe phone didn't stop ringing. A lot of orders for delivery and carryout pouring in. They must be well liked in the hood. \nMy fortune cookie came with a menacing tone. It said \"enjoy life while you can\".", "author": "Mrs. G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-15", "description": "Average chinese food that happens to be downstairs, with basically 15-minute delivery times. Fantastic meatless sweet & sour chicken!", "author": "Michael H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-12", "description": "The best Chinese take-out in San Francisco. Before I moved away from the area 8 years ago, I ate at House of Hunan at least once a week for 15 years and, when it comes to Sweet and Sour Chicken, I have yet to find better. I felt honored to support this small, local, family owned and operated business.", "author": "N I."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-10", "description": "I don't know what all the negative reviews for this place.  I work a few blocks away and this is the spot for chinese food.  Good prices and good food.  Easy to call in for to-go orders.  The lady at the front may not seem nice initially but she is.  She recommended a few dishes to me that I still enjoy.  \n\nItems to order from lunch menu:\n-Sweet and sour pork\n-Prawns with scrambled egg (sounds weird but its good)\n-Mongolian Beef", "author": "G A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-04-13", "description": "These ratings shouldn't be taken out of context.. you wouldn't rate a Prius on its 0-60 speed, so why rate a hole-in-the-wall Chinese takeout place as if it was a fine dining establishment.  This isn't a \"Shanghai 1930ish, bring a date to listen to live jazz and eat overpriced quasi-asian food\" kind of place.  This is more like a.. \"long day at work, too lazy to get off the couch to cook, only have $8 dollars in my wallet and oooo some greasy chinese food takeout would hit the spot\" kind of place.  They even deliver sometimes (if they're not too busy)... its kind of negotiable, order more food and they'll deliver.   The honey walnut prawns are really good.", "author": "M P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-03-23", "description": "I like this place because the lunch specials are like $5 for a huge amount of food. The Kung Pao chicken is some of the spiciest i've had in SF, and has a great, light crispy edge with lots of peanuts and zucchini, instad of the thick gooey stuff most places serve. Their Tso's and other stuff aren't really my cup of tea but other folks I go here with swear by it. Overall the food is avearge to good, and the service is usually decent although sometimes at lunch you can end up waiting a while if it's really busy.", "author": "andy c."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-14", "description": "This is a great lunch place to eat or take out. Prices are good and food is tasty. The owner is always nice to me when taking my order and she always gives me extra fortune cookies for my daughter. For an easy non expensive chinese lunch I recommend this place.", "author": "Dawn B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-03-11", "description": "My company orders from House of Hunan very regularly simply because it is close to our offices and offers free delivery.  The older gentleman who delivers the food is very sweet and good-natured and the nicest person there.  The woman who seems to run the place and most often answers the phone/takes the orders is rude, manner-less, unkind and incompetent.  \n\nSome of the dishes are quite good, some are disgusting.  My first experience was a bad one: I ordered the breaded prawns, which I now call Cornprawns (instead of corndogs) because they were coated in an extremely thick and bad tasting breading and were completely inedible (stuck so thoroughly to the prawn that I couldn't even pick it off).  However, after that I discovered their Spicy Chicken and Mongolian Beef, two dishes that are tasty and even offer a healthy brown rice alternative!\n\nThe good and bad of the food being said, the woman who works the main desk has such a bad attitude and is so rude that they don't have a dish on the menu delicious enough to make it worth tolerating her.  Today she got my dish wrong and, while it is somewhat of a hassle, it happens and it's not the end of the world.  I simply asked for no vegetables.  I don't like them.  Enough said.  I called to ask her to please have the correct dish sent over (even though I had walked over to pick our $90+ order originally) and she repeated my entire order to me, including my dish as I had ordered it with no vegetables, and claimed that I must be in error since she wrote the order down correctly.  I said I wasn't doubting that she wrote the order down correctly but a disconnect occurred somewhere between her writing it down and it getting to my desk because it was sitting in front of me and was indeed completely wrong, covered in vegetables.  She continued to yell at me that I was wrong but finally, after about 10 minutes of this bullcrap, agreed to send over the correct dish.  \n\nMy new, replacement dish arrives about 20 minutes later -- exactly the same, covered in onions!!  I called her again to let her know and perhaps get some kind of credit for the dish and call it a wash.  She said, \"Look, I am very busy.\"  Too busy to get my order right?  Too busy to be courteous?  Perhaps I should be too busy to pay next time!  She says, \"I didn't even charge you for it!\"   Well of course you didn't - why would I be charged for you to correct your error?!  Then she drops the humdinger, \"It's just onions!\"  I do believe I paid you $7.95 for a dish with NO VEGETABLES and not for you to decide what I should be eating and which vegetables I should like or dislike.  I was dumbfounded.  I just hung up.\n\nI'll tell you what, I am too busy to ever give them my patronage again but I am not too busy to write this review and let everyone know that House of Hunan needs to fire that crazy jerk of a female working their front desk.", "author": "Robyn S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-11-19", "description": "O.K. I agree with Dr. M as far as the older woman being grumpy, but as an alpha-type I ain't letting someone under 100 lb scare me away from what is the best tofu lunch deal in the city. I was there the other day and the stern lady handed me a to-go box of not what I ordered --- I was at a table. Did I cower and accept it?! Not on your life! I got the only thing I want there: Kung Pao Veggies with Tofu & brown rice, $6.49 with tax, and it comes with soup and tea. What a deal.  But most importantly, you can be sure you ain't eating Kitty as Kristine J. insinuates (so many crude things come to mind it gives me writer's log-jam).", "author": "Andy Z."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-09-05", "description": "I read the reviews and was prepared for the lady that works there that gets irritated and can be rude at times.  No problem with that, I called and ordered two entrees and rice, the food came quickly and was hot.  Problem is it was it was the worst Chinese food I've ever had in my life.  Just did not taste good - any of it.", "author": "Phillip K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2006-06-19", "description": "I am tempted to go back to convince myself that the food was really THAT bad... Well, I am not gonna try again, that's for sure, so don't come crying to me and say I recommended this place...", "author": "Dr K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-09-29", "description": "Sure its not gourmet or \"california\" chinese food, but it's reasonably priced and not as greasy as some people seem to think. I got the General's chicken which had a nice sauce and was heavily breaded. The chicken probably wasn't the best, however, you can't expect too much from this small establishment. It's a decent lunch spot and great takeout place for some quick, satisfying food...", "author": "Nicolas H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-06-11", "description": "delivery chinese food in south beach...salt and pepper pork chops were pretty decent...dry braised string beans with prawns was pretty good...i think it's a good idea to stick to the \"chef's recommendations\"....", "author": "Hen A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2005-08-05", "description": "I've only gotten take out from here, and each time I am pleasantly surprised. I believe this one is under new management (the old one was really terrible), but now its family run. The wife is the only one I ever see serving/taking orders. Not much of an eat in restaurant, I think most of their business is from deliveries. Had the chef's special minced seafood w/ lettuce cups and chicken w/ green beans, and I was very happy. Although.... their menu says no MSG... but i swear I got the jitters afterwards. Oh!! and as an added bonus, they now serve brown rice (they did not before)... so you can feel like you're actually eating healthy now ;)", "author": "Marina K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-03-03", "description": "It's a convenient price with regular quality... the place lacks of a good atmosphere too!", "author": "Alberto X."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2006-09-15", "description": "Hmmm, I had my doubts and it was true. This place isn't good. I will likely try again. But the General Shao's chicken was like a spicy donut with a mini gem of a chicken hidden in the middle. The sauce was okay & the broccoli surprisingly steamed to perfection. The price was right at $4.95 - because all they served me was soup, 1 lb of rice, some dough with sauce and a fortune cookie. Do NOT try their tapioca drinks, the nice, smooth & delicious (ahem) tapioca balls that I love so are replaced by something that looks like MeatWad from ATHF. Ick!", "author": "Colleen B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-06-12", "description": "It's not bad for last minute takeout and it's close by and they do deliver for a $15 minimum order.  Boyfriend's complaint was that the sauces (eggplant and dried green beans) were on the sour side but personally I kind of liked it.  The salt and pepper pork chop was not bad and the portion was large.  Also ordered the half duck, probably wouldn't order it again.", "author": "Jen C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-04-11", "description": "The neighborhood Chinese restaurant. To go orders arrive more quickly if you wait for them at the bar. You can have a beer while you wait and read the gazillion magazines they have on the counter. Food delivery orders take FOREVER. Don't do it. The basic dishes are solid but some of their fish dishes are really quite good. They will substitute Gai-lon for American Broccoli if they have it and you ask them. Their noodle soups are good and their mango jelly drink is my favorite.", "author": "Sirima S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-12-10", "description": "Most people are pretty forgiving when it comes to Chinese restaurants. Places I think are completely disgusting as a Chinese person, are considered \"dive wonders\" to people who didn't grow up on Chinese food. Go figure that the reviews of House of Hunan are so poor! I was tired of eating Crossroads and South Beach Cafe every day since my office is right across the street. I finally ventured into this Chinese place after 8 months and was pleasantly surprised. The food was tasty and the service is fast. I tend to stick with the dishes with vegetables and simple preparation, since I know it's harder to get wrong. My staple is the black bean chicken. It comes with lots of veggies and good Cantonese style white rice. I would give this place a chance. It's the one Asian place among a sea of heavy food options in that part of SOMA.", "author": "Joanne W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-02-12", "description": "These people are racist in this restaurant.\n\nI went in to do a take out order, and placed my order.  After I ordered, three other people came in and did a take out order, and another couple came in and sat down.  The lady took all their orders.  Then she called out the order for one of the take outs that ordered after me.  Then another order for someone that ordered after me.  Then she served the seated couple their appetizers.  Then the third person that did the take out order was presented with their food.  Then she served the seated couple their entrees.  Where the hell was my food.  I was the first person that ordered, yet nothing.  I went and complained, the lady yelled something in Chinese, and she said we have a new cook.  WTF does that matter about whose food they prepared first.  She then yelled again into the kitchen (I suspect calling in my order) and then another 15 minutes later I got my food.  The common theme - all the people that were given their food before me were white or asian.  I am a dark skinned, so I was treated like the lowest man in society, and served last.  Amazing.  She never apologized or anything.\n\nAvoid these RACIST people.  \n\nTo all Chinese food proprietors -- open a spot in SOMA by the ballpark, treat everyone equally, apologize if you made a mistake, and get rid of these people at House of Hunan.\n\nAnd the food was lousy - the snow peas with mushrooms was doused in vinegar.", "author": "Dave A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-09-17", "description": "We just ordered chinese food from there tonight.  It was really good.  For quick take out on a night when you are exhausted from work it was great.  We ordered the pork potstickers, orange chicken, mongolian beef, fried pork won tons, and egg fried rice.  The sauces that accompany all the dishes were an A+.  Those kinds of sauces that you would drink cause they are so good.  I would not have ordered the bbq spare ribs again though.  They just didn't have much flavor, but other than that we will try House of Hunan again for sure.", "author": "Janae B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-05-10", "description": "Average Chinese food, with regular prices. Mom and pop style, which is good for the service, but not a lot of traffic, causing them to sometimes be closed without notice.", "author": "Jamieson S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-12-28", "description": "2.5 stars for mediocre Americanized Chinese food.  The food here is not terrible, but I'm never excited when my coworkers want to come here for lunch.  It's not bad for the price, but it's not a great sign when I find myself wishing this place was a Panda Express instead.", "author": "Albert C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-09-28", "description": "I tried this place because I was picking up a lunch order, and it's near my office.\n\nIn her defense, I think she may be an owner, but she's usually rude.  The last time (my co-workers, not me ordered) I was there, I think this woman at the counter was really trying to be kind.\n\nUnfortunately, the service was slow----there weren't many people on the \"off-time\" I went in so that was odd.\n\nHowever, I tried the food once, but was not impressed.  \n\nAlthough, they have no MSG, so that's a good thing.\n\nI hate to admit it, but I've tried better food in a shopping mall food court--and I detest malls and food courts!", "author": "Julie B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-08", "description": "love this place....i can walk their for lunch and for 7 bucks smile in delight as I eat in from of our big screen at work.  YUMMY...i always ger the Mongolian Beef with extra sauce...so grubbin!", "author": "Rachelle I."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-03-15", "description": "Bleh - I only go hear because it's around the corner. Definitely in the market for a replacement.", "author": "Niki N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2007-01-30", "description": "House of Hunan is ridiculously bad.  I've actually never seen the place but have ordered delivery from there a couple times.  Unfortunately, it's one of the few Chinese restaurants in South Beach, and as far as I know the only one that delivers.  I've had the kung pao chicken, broccoli beef and wonton soup from there.  Everything was quite inedible.  Gotta find some other options.", "author": "Saw T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-06-27", "description": "I am a fan of the \"prawns over rice with scrambled egg\"...good dish...good prices for lunch..", "author": "Juliet W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-11-05", "description": "since it is not even a full block away from my residence at Bayside village, I frequent this place fairly often.  The usual order is bbq pork fried rice (very consistent, good amount of pork, not too greasy or salty), house special chow mein (again, very consistent, always get two shrimp, three piece of chicken and about 5 pieces of beef in the container) and either sesame or orange chicken (of the battered and deep fried variety).  It isn't great but definately isn't bad.  The service is prompt, but not very friendly.  I know that they have a high score on their health inspection card, which is always important for me at a chinese place.  I haven't been yet for dim sum, but a couple people have said it is fair.", "author": "Daniel M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-05-10", "description": "the prices are good and the food is decent, but if you're ordering in, you'll probably going to have to wait for about an hour.  i'm not a big fan of fast food chinese, but my buddy always wants to order here when i visit b/c it's about 2 blocks away from her place.  i'd say they are over an hour late for 85% of the time.  the average wait is 40 minutes...so the lady at the restaurants always says.  \n\nunfortunately, their driver is a very sweet, old chinese man and when he finally snails on in and knocks on the door, my hunger and rage quickly fades away when i see his gentle smile.  i give him an extra tip and wish him a good evening.  damn it.  foiled again.", "author": "Immer E."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-04-21", "description": "The food is ok.  The service in this place is horrible.  Don't think about getting a to go order.  I had to wait over 40 minutes at least twice there after I ordered the food 20 minutes before that.  She needs to hire someone.", "author": "B A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2006-12-20", "description": "Hands down the worst Chinese food EVER.  That is honestly all I can say.  When I am craving some greasy, nasty Chinese food, I will pretty much eat anything.  I couldn't even eat this.  It was that bad.  The thought of it makes my skin crawl.  Gross.", "author": "Shelley M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2007-05-26", "description": "a star for good service!\nbut if you dare venture, beware. no, really- it's flavorless...", "author": "katrine n."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-22", "description": "i agree the lady is rude and grumpy when it gets a little busy. I kinda understand it because i came from the same ethnic background. I think people should give the lady a break since shes there 7 days a week. \n\nI recently chatted with her and she complains about how her chefs couldn't get anything right, hence the yelling. She is just trying to sell herself with the food and service, not trying to impress the 21st century generation by being modest, socializing, and oh did i mention GAY! from what i've read on those hate reviews it seems like they want a angel behind the counter instead of someone that is trying to sell good food and maintain a business. Maybe this is the difference between hard labor and typing behind a screen! \n\ndespite the gay reviews, i've talked to the lady and told her about wuts on yelp, and she said she has changed. except her use of english, i believe it could be scary to some people, but bare with her as she is trying really hard. \n\nAlso, I've never heard from any of my co-workers nor other ppl on yelp mention about cockroaches. the person that claimed there were cockroaches probably is talking about his own kitchen, because ever since house of hunan been open they have a pest control inspection twice a month. \n\nplus who can not order delivery from House of Hunan when there is a kind little delivery man that rides a cute red bicycle. I swear this man is so nice and cute riding his bike down berry st, haha i always look out the window to check him out. he makes my day when he speaks with that accent, hehe.\n\nso my favorite is still the salted fish fried rice, mongolian chicken, salt and pepper pork chops, asparagus prawns with black bean sauce, honey walnut prawns. I'm not too into their appetizers, but i heard they are trying to improve their fried prawns. So i will try that when they finalize the recipe, mmmm i cant wait to try new things.", "author": "GwunZi H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-12-16", "description": "I have eaten here multiple times and would say it's a decent place to get some not too greasy Chinese. May not be as \"authentic\" as some people want, but I have liked most things that I have ordered there. I haven't tried takeout, just pick up, and it's ready in less than 15 mins. I would recommend this place to someone living/working nearby that wanted a nice Chinese meal.", "author": "J M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-07-31", "description": "I ate here the other day because it's a block from my new place.  I thought the food was pretty good.  I have yet to find a Chinese restaurant that has blown me away.  We usually order in, but this place is so close that there is no need (although I think we would have gotten our food quicker if we had it delivered).  The service wasn't perfect, but the poor lady running the place was so freakin' busy that I wouldn't have expected it to be.  There was only one other table occupied, but tons of people calling for delivery and no less than 3 people waiting for to-go orders.  It's a busy little place, give the lady a break.\nWe had lemon chicken, chicken chow mien, vegetable egg foo yung, bbq pork buns, fried bananas, and bbq short ribs (we like to order a lot and have tons of left overs).  Everything was decent.  My boyfriend ate there a few days earlier and had a completely different experience.  I think it just depends on what you order.  I didn't think the food was too greasy or over sauced at all.  The egg foo yung was a little funky in texture, but had great flavor.  The pork buns were fluffy and yummy--almost like a biscuit.  The chow mien was perfect--not too oily and great flavor.  Although, after reading the review about the cockroach I am a bit hesitant to go back, which totally sucks because they are so convenient .", "author": "Corina D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-04-25", "description": "Was looking for a takeout chinese restaurant and last night this place fit the bill.  Not too greasy, lots of fresh veg, large servings and affordable... definitely great chinese takeout.", "author": "SHANNON E."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-06-19", "description": "anyone know why when i order asparagus with chicken i just get stalks, not tips? why won't they won't give me any asparagus tips? what do they do with the tips???", "author": "Al B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-03-11", "description": "it's in the hood, it's got easy parking in front, prices are ok. great for take out on nights when i'm too damn lazy to do anything else. but i wouldn't go out of my way if you're not in the area or craving chinese.", "author": "Elena N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-10-09", "description": "I have been to House of Hunan multiple times and each one has been a great experience!   They have great hot and sour soup, sesame chicken, sweet & sour chicken, fried wontons, general tso's chicken!  Everything I have tried has been great!  The service was speedy.  I've read some reviews about the woman who is always there not being the most friendly, I could see how that could be true, I just think she is to the point, she has never been rude or trying to rush me.  She's just all business.  I would recommend this for take out or sit down.  Best chinese in the city!", "author": "Emily T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-06-11", "description": "Average to sub-par standard chinese takeout.  They have brown rice, which is a big plus.  They put celery in the Kung Pao, which is just stupid.  Quick.  Not too expensive, but not particularly cheap either.  I've had some trouble with them not answering their phone during busy times.", "author": "Steven H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-07-09", "description": "i love this place. i guess i only know about it because i live in the same building, but i'm glad it's there. i try to get a lunch special every sunday, to eat while i watch a flick on hulu or an episode of dallas. the people who work there are friendly and the food (non-meat) is better than average. i have no complaints.", "author": "vincent m."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-05-27", "description": "This place is so well hidden I'm surprised people even now about it. First of all, I work in the area and decided to try this place a long time ago. Ever since then it has been true what some of you Yelpers have said about the lady being rude here, but after going so often with my co-worker, she has lightend up a whole lot, LOL. Anyways, this is a good lunch spot if you are craving some decent chinese food for a really good price. ( Only been here during lunch ).", "author": "Sleep E."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-03-17", "description": "I reccomend the honey walnut prawns and the veggie chowmein....sooooo  good. but beware lots of their dishes (mostly the chicken ones) have way too much breading.", "author": "Natasha v."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-06-18", "description": "This was the worst chinese I have had.  It turns out that the only tihng worse than bad flavor is no flavor.  The Hot and Sour soup was literally not spicy, hot, nor sour, it was just cornstarch.  The mu shu pork tasted like it had been boiled to remove flavor.  This place is a block away and I will never go back", "author": "Noah H."}
