{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-17", "description": "Best hip-hop club in San Francisco. \n\nI came here on a Friday night and it was amazing! The DJ was awesome and played nothing but the best jams - the club reminded me of a scene from Vegas or Atlanta. They definitely have a great hip-hop vibe here which is hard to find in SF. As far as the service goes, we had a lady named Rebecca as our bottle girl/waitress. Sometimes in this environment it is hard to come across such great service as I've experienced bad attitudes or non-attentive service from bottle service waiters. They must be doing something right at Hue because Rebecca was on it! Anything I needed she was always checking in on our table. If you want a night dancing to hip-hop music and good vibes, come to Hue Lounge!", "author": "Shen D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-09-18", "description": "My cousins & I came out Saturday to see Jayden Smith and got a table right next to him. During our time here roaches started coming out  never NEVER EVER COMING HERE AGAIN!!!!!! Not worth the the 900$ after seeing all these roaches coming out !  wish I can post the video I had .....", "author": "Paula M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-11", "description": "Had a great birthday celebration at Hue! Thank you Discotech and Bennett for taking care of us. We saw Mya up close and personal  as our table was number 10 , right where she comes out. We felt special and well taken care of by the bouncers and whole team of HUE. Thank you for my birthday celebration.", "author": "Claudine V."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-10-15", "description": "Extremely disappointing. Our group of 13 arrived on Saturday evening for the Diva Show. We had pre purchased VIP dinner and show tickets ($85). The day of the event the Hue called to say they were canceling the dinner portion of our ticket. The offered to compensate us with three free drink and tickets to the second show (Hunkomania). Upon arrival Chris gave us each our drink tickets. \"These are your three drink tickets.\" Nothing else was said.\nWe order our drinks (vodka cran) and present our tickets. Bartender doesn't honor them. \"Tickets don't cover these drinks.\" We have a brief conversation saying we were told we were being compensated due to cancellation of dinner. He refused. We asked for a manager. She gave us an equally bad time too. So we said, \"fine. We'll have a beer instead.\" She still wants to charge us for the vodka drinks, saying \"we can't pour those back!\" We refuse. We say, \"We were told we were being compensated for the cancellation.\"\nShe reluctantly and in a very patronizing tone let's it go for \"this one time, but you better tip the bartender good.\"\nReally??? \nThen the show starts. Advertised as 5 Divas and a King. Well......it was NOTHING as advertised. Apparently the performers didn't show up, so we were sucked into watching understudies. The lip synching was terrible. \nOn to hunkomania. Oh lawd....they pretty much focused on one bride to be, and gave the other bride to be's, and birthday gals a walk by performance. \nSame day cancellation. Not honoring their promise of an \"equal\" compensation. Talking down and patronizing their customers.\nThis place was horrible.", "author": "Monica D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-03-19", "description": "This club either has a regular thief with sticky fingers and/or the employees are not honest. We came here on two separate occasions and both times someone from our group had their cell phone stolen either from their back pocket or their purse. First time there was 4 in our group and this last time one person. \n\nThere's a dress code and from the Yelp pictures it seems to be geared as a \"dress to impress\"  club, so NOT! I noticed many people in Vans, jean shorts and  t-shirts. I wonder if they lowered their standard to fill the club? \n\nOur double table VIP area was narrow but cute. It worked for us. The male runner made sure our drinks were full. \n\nThe ugly and scary: There was a shooting outside the club. Two passing vehicles and I believe someone was shot.  \n\nMy thoughts: they need to get new promoters that bring in a respectable crowd. After doing a google search of the shooting I come to realize this isn't something new. Apparently they have a reputation of fights and violent shootings. \n\nI will not be back. Risking my life and personal belongings is not worth a couple hours of partying. \n\nBroadway has changed so much!", "author": "Cella B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-04", "description": "Long story short, I like this place. It's on the small side, but manages to not feel too crowded on the dance floor. There are two bars, and while drinks are a bit overpriced, bartenders are not stingy with the liquor.\n\nI'm not a regular club-goer but I'd return for the sleek and fun ambience, good hip hop music and free entry before 10:30 via the guest list.", "author": "Yasmin S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-09-18", "description": "Came here on Friday night, that place was literally infested with roaches. Besides that, our bottle service girl, let the guy next to us ( a complete stranger ) know that my cousin's card was being declined because as we all know banks sometimes don't let big transactions go through at the middle of the night. So the intoxicated stranger came to our table to mock us which started into an altercation. The bottle service girl had no right telling our business to another client, so unprofessional and disgusting. DO NOT WASTE YOUR MONEY HERE, THE MUSIC SUCKS. THE DJ PLAYED WOKE UP BY Playboi Carti MORE THAN 6 TIMES  I like that song but wtf.", "author": "Jhosa G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-07", "description": "About half of the complaints I see in other reviews are the things that I love. \n\n1. Lighting. Sorry I don't love pitch black clubs where I can't see, I think the lighting level is perfect.\n2. Talent. I saw Maya perform here and it was an awesome venue to watch her totally kill it. Recently went back and didn't like the headliner, but oh well! They get a variety in and I should have looked him up before deciding to go.\n3. Security. These guys are on it. First time I went some girl decided to punch another girl's boyfriend. Saw the whole thing from start to finish, first girl was being totally out of line and she and her friends rightfully got kicked out. Security was there as soon as the blow was struck so we knew they'd been watching the whole time. The other couple didn't get kicked out, which shows that they were paying attention and knew what was up. Most places would have kicked everyone out, but here they only tossed the aggressor.\n\nMet Adam, who I guess used to be GM when this was another club? He was visiting and stressed how hard everyone who works there had worked to make it a good safe place to go dance. And I definitely feel safe dancing here with my friends. Other clubs the security is less present and I'm not a fan of having my ass grabbed by drunk aggressive men when I'm just looking to dance, here that not a problem. And security would handle it if it did happen I'm sure. Mark is head of security and he's extremely nice and takes a lot of pride in his club and making sure everyone has a good time and gets home safely. As other reviewers have said, I've seen security here take care of people who have had just far too much to drink, including peeling them out of the street after they've blacked out. Totally professional, definitely a group of trustworthy people.\n\nDrinks selection is good. And I didn't find the place empty either time I've been. \n\nWould I go back? Yes. This place is my first pick.", "author": "Hilliary L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-04-07", "description": "When you think of clubs in the city, you think \"flashy and fun.\" Especially since hue is a somewhat newer club. But NOPE, not this one. It was flashy that's for sure but fun.... I didn't have fun.\n\nI came for a friend's birthday and the line was long and moving very sloooooowly. It seemed like forever by the time we got to the door. \n\nPROS:\n-Free entry before 10:30pm. \n\n-Hue backdrop right when you walk in. Great for taking pictures with friends. \n\n-Bouncers are really nice. \n\nCONS:\n-No where to sit. For girls we wanna look good and wear heels, I love clubs with chairs because I need a break every now and then to rest my toes, those poor thing are crammed into the tiny tip of the heel. \n\n-Parking: None. That's always a pain when it comes to the city. \n\n-Music: They played top 40 and I was not enjoying it. Play hip hop, old school hip hop. The DJ should notice if nobody is dancing, it's probably time to whip out a good classic song. \n\nI will say this, my feet were killing me and there was a blocked off VIP room, I asked the bouncer if I could sit down and he was nice enough to let me. There was also a girl that drank a little too much, the bouncer and owners were so kind that they provided her water and a trash can. Usually other clubs kick out people that are throwing up. So shout out to the bouncers for that. \n\nWill I come back? Probably not.", "author": "Kathy T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-08", "description": "Came here to see Jon B perform, he killed it! It was my first time at this club and I loved it. It was a mixed mature crowd, they played some great music and the decor was beautiful. I would definitely recommend.", "author": "Elizabeth G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-27", "description": "Our friend got a VIP booth a few weeks back. The staff was really great with keeping non VIPS out. So that helped with the experience. Music was great played good dancing songs. I like that the women stalls were long enough for no one to crawl under. Made me feel more safe for some reason lol.", "author": "Brittany E."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-01-06", "description": "We were on the guest list to get in free before 11, arrived at 10:40, but they made us wait 25 minutes in the cold to make it look like there was a line outside the club, and I guess also to force us to pay cover. Club wasn't full, so no reason to keep us out. Lady at the front was visibly impatient when I couldn't hear clearly how much I had to pay (sorry, eardrums still frozen). Rest of staff was nice, music was ok, would definitely go elsewhere next time.", "author": "Ann C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-11-26", "description": "Me and my woman went here after a Trevor Noah comedy show. I've not heard anything about this club but it had interesting reviews so we thought to give it a try. The entry was fine no altercations or anything of that nature. We were on the guest list but I believe it's 20 dollars to get in. They have a lot of open space and great lighting effects in the club to display their brand. Drinks are decently priced from 6 -12 dollars a piece. The music is mostly rap and hip hop. \n\nThere was not a lot of people in this club especially when it got to 12am. The DJ was okay and wasn't great he only occasionally played good dance songs. I was also the only white guy in the place. So ladies if you're looking for white guys they are not here. Guys if you're looking for ladies there's not much. It felt like a lot of people just were hanging out on the sides and not dancing.\n\nIt has potential to be a good place but I think it needs better promotion and music.", "author": "Max R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-03-04", "description": "This is a hip hop music club. The music at the beginning of the night was fun, but it got more ratchet as the night went on. \n\nI still had a lot of fun, but the easiest way to explain the atmosphere is-- There was a girl twerking half on the ground in the womens bathroom at one point in the night.", "author": "Elena K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-03-19", "description": "Eh, I'm not going to sugar coat it. This club sucks. I like clubs that play hip hop but the crowd here was pushy and majority of the people here will literally shove you out of way to get by. \n\nThere's a bar downstairs and upstairs. Upstairs was where everything was being held. The bottle service tables took up a lot of space and the venue was small enough already. \n\nThe drinks were weak. Ordered Hennessy and pineapple and it just tasted like straight pineapple juice. \n\nYes it's free before 11 on guest list but after that, the cover charge is $20! This decor and set up is really nice though. The location isn't great.", "author": "Amanda N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-10-05", "description": "Wow! What a waste of time! My girls and I went to Hue for the second time ever last Saturday and from rude employees to being kept in a waiting room this place was just repulsive. The first time I came here with one of my friends it was nice pretty chill place and we only ended up leaving because the music was terrible; they played stuff we used to listen to in middle school which was fine but also a lot of unknown music was mixed in.  \nThis most recent time the music was just as trash but also the being kept away from the dance floor and the rude employees makes all of us never want to come back.  Also we are women in our early 20's while the rest of the crowd was at least 30+. Plenty of better places to visit if you're in SF.", "author": "Tiffany C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-01-24", "description": "Came here for the first time for a friend's birthday! Loved the decor and the feel of this place but other than that this place had the two things that I can't stand when it comes to a night club...\n\n#1 LIGHTS...it was not dark enough and you can look around and clearly see the entire club \n\n#2 MUSIC... they play mostly hip hop which I loved but the night we came there were no old school songs played only the new top 40 (boooo!)\n\nFor my first time here I am not impressed but this club does have a lot of potential for improvement. Also they back up the line too make it look like it crowded when no one was inside til later on in the night. Not fun on a rainy night :(", "author": "Heena W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-12-02", "description": "Hue is one of the newer nightclubs that opened up in SF on Broadway. I like the fact that they play a lot of top 40 & hip hop rather than most clubs that are on the EDM hype and it has a little boutique feel of a Vegas nightclub.\n\nI found this club to be surprisingly very small than most other ones I've been to with this kind of environment. What my friends and I found annoying about this place is that here (and like every other club in SF) have a guestlist until 11pm but have a tendency to hold up the line even though the inside of the club was not that crowded at all. $20 for cover?? no thanks. We were able to talk to the lady in front about how disappointed we were and that the girls in my group traveled from San Jose to SF to celebrate a friend's birthday, so she was able to accommodate our request to discount our cover.\n\nDrinks didn't seem all that special but I wouldn't mind coming back again for another celebration of some sort, otherwise I don't plan to randomly come here on a Friday or weekend evening.", "author": "Kathleen S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-10-15", "description": "I went tonight with some friends. Parking was awful. Bouncers were cool. They should have chairs at bar there was nowhere to sit and my feet were hurting. The DJ sucked. He kept talking through the music tryna hype of crowd, and the clubs sound system was awful so whenever the dj talked it overpowered the music. They played the same songs over and over like\nThe radio. The crowd was strange a lot of larger women and older people. So club wreaked of sweat. Also no Ac no fans no nothing was hot as soon as i entered the building. Overall it was whack! This is the first club i have ever been too where i didn't enjoy myself especially because of a dj that wouldn't shut up", "author": "Aminah H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-02", "description": "This place looks very great and it's very nice for taking pictures but it was very dry in there not lit. I'd say that me and my sister only there for a good 20 minutes because we did pay to get in and got a drink and then we left. So overall if you're looking to have a fun drunk at night I would not recommend going here", "author": "Kimmy A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-07-30", "description": "So I first I heard great things about Hue.\n\nI went to Hue for a friend's birthday. Started off okay in the beginning with a cool back drop to take pictures. After that we headed to the dance floor. The music was current hip hop & rap. Some throwbacks were played. The music was playing then I realized that the DJ wasn't even spinning. He put the playlist from his laptop and then sat aside from the DJ booth and was \"trying\" to hype up the crowd. It worked out for about an hour until people started to realize the truth; the DJ not truly spinning. The club itself was not a bad look. The bar was pretty cool but it is kind of lame that there is a minimum to buy drinks.\n\nOverall, the place deserves one star.\nWill not come back.", "author": "Andrew G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-04-20", "description": "Mark, the head of security helped bandage me up when I was cut by the door locking lever in the restroom. I give him 5 stars for helping me out  and 2 stars for them letting the door go unchecked like that.", "author": "Adrian C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-02-26", "description": "Listen to the negative reviews. They are so true. Got dragged here by a co worker's birthday and what a mess. Gimmicky presence on the outside where they make it seem like a busy place but once you get through the false wait, crickets inside. Service or lack there of for the bottle tables was a joke and my poor co worker was so ready to escape and go somewhere decent. With so many quality options in this city, it's a wonder how this place stays open. Any reviews with more than 3 stars is from their own staff for sure.", "author": "Amy J."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-12-09", "description": "Ghetto! Dress code not enforced, my feet were killing me for wearing boots with a heel to meet their \"fitted fashionable required\" policy. I found an edge to sit on, because again my feet were killing me and there's no place to sit. Unless, you pay for VIP! Only to get told by a bouncer \"we might have to kick you out if you sit again\" seriously? People were dressed in baggy clothes and sneakers. I left before I was able to see Tank perform, such a waste of time!", "author": "Karen B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-09", "description": "I came here last weekend to celebrate my friends birthday. I really enjoyed this club, from the music to the ambiance. Our waitress was Rebecca and we all really enjoyed the way she took care of us. When you're spending a lot of money on bottles, it's important to have someone who is friendly and consistently around to check and see if we need anything. She really went out of her way to make my friends birthday really special. I will definitely be back!", "author": "Mary J."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-12-30", "description": "I probably wouldn't come back here because the front desk girl was so rude \nShe was beyond rude even though we were paying customers. \nShe has an ugly attitude that was definitely uncalled for.", "author": "Mariya G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-26", "description": "The Bartenders and waitresses here are so fire! They was catering to me so good I almost thought they were Destinys Child! Lol \n\nGood vibes all night, beautiful thick women everywhere! No stuck up girls either. Great place to go clubbing, only down side is the floor was sticky af. Every step I took was gross and it was messn with my dance moves. Lol", "author": "Shaun B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-29", "description": "A night out for my friend's birthday and graduation celebration! Hit up the city and went out to the club to get her drunk and get her dancing a whole bunch. \n\nHUE. Set around Little Italy. Near The Sinking Rose and all that jazz. Nice signage outside. Official looking men outside waiting to check IDs and keep things okay.\n\nGot to it a little later than 10:30. Rolling deep in a group of ten we were worried that would have to pay a hella expensive fee. BUT we lucked out. Got in for free.\n\nTalk about bright lights. Loud music. Entered the lower floor with a little lounge area in the corner, a big wall showing Hue for photo shoots, and a bar. \n\nUp the stairs, a big floor for dancing was available plus another bar. The bathrooms were in the back corner. \n\nInterestingly enough there was a nice woman in the bathroom. Just sitting there. She helped turn on the water, give soap, and hand out napkins. It reminded me of the Philippines. \n\nOne of the bathroom stalls had no more door. So if a friend was using it, one of us had to stand guard so no one would go inside and see things.\n\nThe alcohol area was tended to by three young and pretty ladies, and some handsome gentleman. There were other ladies dressed in fish net stockings and body suits, scantily clad, sexy and brought refills on drinks, so forth.\n\nMusic was popping. Like so freaking good. Okay, a few songs were off and others cut off before the good parts were heard. Overall, it was popping and the beat kept making everyone dance.\n\nThe crowd was a bit smaller than expected. There was a bunch of guys standing near the walls or dancing with themselves, and coming upon ladies hella badly. Like no skills whatsoever. \n\nThe atmosphere for the dancing was bright lights, flashing lights, and an occasionally spurt of fog/gas/something.\n\nI had a lot of fun. My friends and I enjoyed ourselves. \n\n4/5", "author": "Alexa T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-01-01", "description": "This is the second year we attended the NYE event, it definitely got a little worse. For the amount of money we paid for tickets, I was not pleased at how the party was managed. We get in, they are making everyone pack up in the front room. Security said that we couldn't go in the main room because it was closed until 10:30, like come on. The bars were severely understaffed and they limited an OPEN BAR to one drink per person. We literally stood in line for drinks for most of the party. There was 1 bartender in the front room, 2 in the main room for a NYE PARTY. Then, security started to shut down the smoking section at 1:15....that's 45 minutes before closing. When you have a large event like a NYE party, HUE should definitely make sure they are prepared. I don't think we got our $80 worth. Won't be returning.", "author": "Montinique I."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-06-03", "description": "I will never go back is so lame and small and it feel like everyone is 18!!! I will never go back it was was like 60 people there and that  Including the workers.. lame", "author": "Christina C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-10", "description": "Great vibe great people are great theres no environment in sf like it! Broke people hate on it. It is what it is. Bottle poppers are always in the building, it gets lit.", "author": "Tony M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-12-30", "description": "Paid for 2 table only let half the party in and the other half was left put aide for longer the 2 hours. There customer service  is horrible. We had 6 per table. Witch is the limit", "author": "Reg R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-05-30", "description": "The people outside the club were not very warm to talk to. The club was very spacious and beautiful but again it played only hip hop.", "author": "Shruti M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-03-21", "description": "I've been here twice and both times it's been SO empty. Granted we got here somewhat early, but even when we left around 1:30ish we were some of the only people there. The funny thing is that there's a front room and a huge back room which actually looked pretty cool, however I don't think they ever really have enough people to open it up. Music was just okay, but the DJ didn't have a lot of songs we requested.\n\nMake sure to add your name to the guest list and you can get in without paying cover. I guess it could be cool if you're not looking for big crowds and want a private/VIP type experience!", "author": "Jaymie S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-04-16", "description": "Music is decent, sometimes a little too ratchet but decent music..probably the only thing going for it.\n\nThe environment here sucks, period. Just dudes mean mugging by the wall, and super drunk girls falling down and twerking lol.\n\nOverpriced drinks and not strong at all. Bottle service is kinda of a joke here.", "author": "Omega B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-08", "description": "Pleasantly surprised at how nice it is- especially impressed by their choice of jams. The wait to get in was quick, the drinks that were ordered were equally as fast. Great environment to bring friends to...something different and inviting! 5 stars!", "author": "Judy L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-29", "description": "I attended Hue last Saturday for a friends birthday. I've been to this place before and thought it was just OK. This time around the girls were all very nice. One of the girls Rebecca constantly made sure we were being assisted. Her service completely changed my mind about ever coming back. The music and vibe was perfect. I definitely recommend a night here. I'll be back!", "author": "Yvette B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-13", "description": "I love the set up of this place. Good music. Great management. Friendly staff. The ladies at coat check were awesome and very helpful, the JM was super attentive, helped me with an intoxicated friend of mine. I always have a good time here! Thanks HUE staff !!", "author": "Mariah J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-02", "description": "I'm always seeking new venues for the mixers that I plan, and I found out about Hue because my friend posted about his DJ gig there. After seeing a few photos, I knew I had to try this place out. I was put in touch with Bennett, who helped me lock down the date for our holiday party, do a walkthrough with Steve, and order catering through Karen. They have a great team here, and they work so hard to make sure that the nightclub is in top shape and that their event hosts are happy.\n\nOur guests thoroughly enjoyed the event, and all the team members kept checking in with me throughout the evening to make sure we had everything we needed. Would highly recommend for private events. This is a gorgeous nightclub that has a bright future in San Francisco!", "author": "Stefanie C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-10-10", "description": "All the chasers were warm or none at all. Bought 5+ bottles. Never seen our waiter. Horrible service. Way way to much smoke couldn't even breath. All the pictures look like we in fog. Won't come back.", "author": "David R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-22", "description": "I've been to Hue several times and I always have SO much fun! The DJs typically stick to open format which keeps the energy high and balanced all night long. The decor is very \"Vegas\" like with a great sound system and cool lights. The cocktail waitresses are super friendly, pretty, and attentive to you and your VIP group. Drinks are made very speedily by the bartenders and they're always on point. Moreover,  there is a sweet, sweet lady in the women's restroom who dispenses your soap and paper towels and keeps the ladies room fresh (this never happens in other night clubs in the city).  \n\nThis nightclub is the perfect destination for any celebration! You can definitely count on having the time of your life, especially on Saturday nights!", "author": "Kelly T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-03-16", "description": "What a huge disappointment! We went to go see our friends daughter's fashion show. Our friend btw is 74 years old and because I was driving she didn't even think about carrying her identification. We got to the door and couldn't get in because our friend didn't have her ID. We were so confused and couldn't believe it but we had to accept it. So... we are suppose to be on the guest list so I decide to go in and tell her daughter we couldn't stay but they couldn't find us on the list and when i asked to be escorted in and out they said no, then I asked to pay but because I was sounding frustrated the 6.2 security guard (I am 5'1) stepped in and told me that I couldn't even buy a ticket now and physically pushed me towards the door and yelled in my face telling me to leave. I told him to f'ing get out of my face and don't touch me again. She pushed me again and i snuck under his arm he threatens to call the police and said that he sould... I yell at him to back off of me and i will walk out. He did and i left. We finally got her daughter to come out for a moment but the whole thing was ridiculous and uncalled for.", "author": "Melanie T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-19", "description": "Nice lil spot literally. I'm glad it wasn't crowded. Took some out of towners here. It was Christmas weekend so this was their only night to go out. I had fun, but it don't take much for me", "author": "Queen B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-07-30", "description": "This place is whack, DJ doesn't even spin nor can he hype the night. If I can 0 star I would. Major disappointment forreal. Plus they make you spend $15 plus 20% gratuity for a credit or debit card. Fucking whack", "author": "Maxx M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-07", "description": "I went to HUE on New Years Eve for my birthday. I have to say it was great! The music was great and there was a great vibe all around. Everyone was very friendly. Security was really nice as well. \n\nI had lost my keys that day and didn't realized until I got home. (I didn't drive,  I ubered there). I immediately emailed HUE and that same week I received a response from Steve the GM at HUE. He was great and told me they had found my keys. I'm so greatful for that and thank you Steve for helping me get my keys back!!! \n\nI will for sure go back to HUE and will tell and bring more friends next time. I do recommend this place!! It was a great way to celebrate my birthday and to start off the new year!!", "author": "Tania C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-17", "description": "Trackademics was cool.   The dj after him liked to yell on the microphone more than spin.   I miss the old djs, straight full of soul djs.\n\nEdit: the dj from 1245am til close brought it back.   Went from 2 to 4 stars.   Not a fan of the dj before him who called  the crowd the b word.", "author": "Reuben A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-25", "description": "Hey honestly best 21sy I love Corey. Thanks again\nHe was super nice and was great to my friends!!!!", "author": "Bobo G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-14", "description": "Came to visit family in San Francisco and had a girls night out while I was there. It was really hard to pick one place to party at.... because there are soooo many choices in the bay area. We ended up deciding on this place and I am so happy we did! There was a group of us, and we ended up getting bottle service. Rebecca was our waitress and she was awesome! We especially liked that she kept checking on us throughout the night to make sure we were okay. I've done bottle service at other clubs and after they bring out your liquor they don't bother with you again. I also REALLY liked the music, it was a mix of TOP 40 and Hip Hop, which had us dancing all night. I also really liked the décor. Recommend for sure!", "author": "Tifffany G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-25", "description": "Maybe it is my fault for coming on a night where a celebrity was there but it was JAM packed and security was rude. Ironically the bartenders were the sweetest and is usually the opposite. Everyone was smoking weed in the blue and no one regulated it. I've been to clubs when once smoke is detected that person is found and extracted. So that was a bit uncomfortable. The decor and atmosphere was cool but the cloud of second hand was not cool. I wasn't trying to catch a contact.", "author": "Hieyam A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-18", "description": "Corey is the best VIP host!!!! I freaking love him!!!! He was so helpful and wonderful  Definitely will be back  \n\nThanks again ;)", "author": "Pon Y."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-05-02", "description": "We arrived early (before 11pm) for free entry. There was hardly anyone there but that's how it is for most clubs and guest lists. Wasn't sure what to expect, but was surprised by the hip/vegas like decor. They have a small bar as soon as you walk in and then there's a pretty spacious dance floor, only most people weren't dancing when we arrived. \n\nThe music was pretty on point for most of the night. DJ mostly played top 40/hip hop. There was a small crowd, smaller than most nightclubs in the city. (The crowd is really mixed and diverse, which was a nice change.) Most people weren't really dancing but rather getting drinks and lounging around I guess. \n\nI wouldn't say this is a great place to club, they have to pull in a larger crowd and I think people would feel more comfortable in getting down on the dance floor. We left at 12am, which is like when the night starts...because we weren't really feeling this place. They have so much potential for improvement.", "author": "Stefany Z."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-03-19", "description": "DO NOT DO BOTTLE SERVICE HERE! They customer service sucks! They pack it and let people get in the your VIP area and say there is nothing they can do!  And then they just sent a manager to me and all he said was sorry as well! Horrible experience! Will not pay for bottle service here again!", "author": "Temica S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-09", "description": "SO MUCH FUNNNNN, love the owner! Corey is the best VIP honest, energy is lit as fuck, can't wait to throw a party here!!! Recommend this to anyone who's having a good time!", "author": "Lanissa B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-05-25", "description": "Been here twice. First time, was when the Warrior's DJ was there & it was nice but there was not a load of people there. We had a booth by the DJ.\n\nThe second time, we paid for a VIP booth, when Kid Ink performed, and they sat us in the downstairs room!!!! The DJ downstairs (by the entrance) was cool, but the main floor DJ was way better. The manager jerked us around all night and was extremely rude. AND then they never announced to us that Kid Ink started performing. Needless to say, we decided we didn't want to keep/buy our 2nd bottle anymore, if they were going to be so ridiculous and make us sit in a different room than 95% of the people. I'll never come here again. Only getting two stars based on my first experience here.", "author": "Tanei G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-02-06", "description": "Okay so everyone was so excited that Ne-yo and TI are going to perform live but turns out that Ne-yo was only singing just half of every songs like (5-7) songs and the rest was just Ne-yo dancing and taking snapchat videos. WORST? T.I. didn't even had an appearance. Okay I get it. Whatever but event organizers please do not make such false marketing or advertising and tell the public that these artists are going to \"perform\" when all they are doing was just more on \"appearance\" and by the way, where the hell is T.I. just as advertised?? Not worth the money! Never.", "author": "Mitch T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-03-09", "description": "Staff were generally rude, place was TOO packed, could not move or dance, good luck bringing those drinks back.. people smoking weed all around the place, smoking section was closed and you couldn't come back in if you went outside...", "author": "Cristopher C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-06", "description": "Hue definitely is the place to be on the weekend!! Was here for my PreBday celebration & though it was raining all weekend, the crowd is still there. People still come out to have a great time! Good mix of music & crowd of people. \n\nMy group had bottle service & everything else was just great!", "author": "Tracy T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-23", "description": "We came here to see Lloyd it was crazy!!!! Love this place !! Corey who was the VIP guy was so helpful and beyond professional... we will be back for sure!!! \n\nThanks hue and Corey for a great night in San Francisco \n\nBless", "author": "Daniel D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-11-15", "description": "Stay away from here if you want to actually have a good night it in SF. They're prissy, overstaffed and have a rude Asian bartender. She consistently looked at me and went to serve others. I was sober when I arrived and gladly sober when I left. I will never ever step foot in this shitty club again. \n\nHow the hell can you be a night club in SF, in North Beach, by the strip clubs, and have a no bootie shorts policy? Y'all must have lost your minds. You definitely tarnished your name in the gay community. Good luck trying to get it back. This is coming from a guy who's running for city supervisor of the Castro and already has a lot of support behind him. \n\nI may be 25, but I know what's up. Realize you're not in LA anymore, and please go back. Bye, Felicia.", "author": "Justin R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-30", "description": "One word...classy! From the decor to the lights and the staff, they were up to par. I haven't seen a club like this in SF before. Temple is ok, Ruby Skye is ehh but Hue is beautiful! All white interior.\n\nI came here for a friend's birthday and we got bottle service. It was $350 for the table I believe and it was worth it! We had 2 bottles of champagne, 2 bottles of Hennessy and 1 bottle of ciroc. \n\nThe music was kinda weird at first but it got better. They were playing 00's music like destiny's child and chingy when we walked in around 11pm. Then they started playing newer stuff like Drake and Fetty Wap so it was good. \n\nI definitely will come back, hopefully they get more people so it's not so dead in there. Need to bring some big name artists or edm djs.", "author": "Natalie W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-10-31", "description": "I really liked this venue, it was big enough and had a really fun clubbing vibe to it. Bouncers weren't ridiculous like the ones in Temple and drinks were as expensive all all the other places. Glad they take credit card! \n\nI came here for Halloween and really liked the venue and decorations. People went all out with their costumes so that was fun to see (shout out to Netflix & chill guy!), buuut the music was only decent. And that really brought down my experience at this club, I don't think we stayed longer than an hour because we got bored by the music. The music selection was kind of random (switching between old Chris Brown songs to Miley Cyrus to 90s), the transitions were super awkward. The age group seemed like people in their 30's so not really my crowd. Hope the place does well though, definitely has lots of potential!", "author": "Aradhana V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-02", "description": "This is probably one of my favorite clubs to go to! I love the decor of the club! Everyone from security to the bartenders and even owner are always super nice and helpful! I was at my friends table who had bottle service and they did such a great presentation and the girls were so sweet! It was def a good night...a lil too good where I forgot my phone haha but Thankfully I called management and they had my phone safe and sound! Phew! This is definitely my go to spot lol they're probably sick of seeing me here!", "author": "Hana B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-09-10", "description": "This is probably one of the worst clubs ever. Me and my four friends Ubered out to the city to have a fun time and dance. We always go to temple so decided to mix it up. What a horrible idea. There were maybe 20 people in this club all night and it was a Saturday night. It was dead, even the bouncers looked bored. The playlist was so old like \"it's getting hot in here\" song old. What a disappointment.  We will not be back and not recommend it ever.", "author": "Mona S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-20", "description": "So my boyfriend and I got a VIP table & bottle service for our birthday a few days ago and everything went pretty well! The security, hue girls and the staff were very friendly to us. The staff was very fast when it comes to checking up on us on refills. I love the \"Vegas\" feel of this place and I'd probably come back here again.", "author": "Symaree S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-02-13", "description": "Would give zero stars if I could!!! Worst bottle service I have ever received. I bought a bottle and was still charged a cover charge to get into the club. The waitress took my card and Id for the transaction and never returned with my card or my id I had to track down two different managers just to get my things back. Couldn't even enjoy the atmosphere or my bottle.", "author": "Chris C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-03", "description": "Awesome party venue! I've worked with Karen and Ben on 3 holiday parties at Hue and all 3 have been successful! Planning was always smooth sailing and they always found ways to accommodate everything we needed. Karen, Ben and all of their staff made sure we all enjoyed ourselves and had nothing to worry about except party. Thank you so much and we hope to be back again!", "author": "J M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-28", "description": "This place rocks! Went here for the grand opening and for the Warriors pre season event. All the decor seems very upscale and new. I've gotten pretty grossed out by some places in San Francisco being too grungy or not up to date. Hue is definitely the most high end club that I've ever seen. For the Warriors event, my girlfriends and I got a table for bottle service (definitely the way to go). You feel pampered and it's way better for the money. The only complaint I have is security being a little strict, but I'd rather have that than them letting in too many losers lol. \n\nThis place is just what Broadway needed!", "author": "Daphne S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-01-15", "description": "Sells more tickets than capacity. Didn't get into the club with prebought tickets. You shouldn't be able to sell more than you can accommodate.", "author": "Ardiney P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-01", "description": "I was here a few weeks ago for a friends birthday party and we pregamed hella hard but this place took me to the next level it was lit af. The drinks we're bomb the Asian lady in the bathroom was hella nice and the music was on point the whole time.  And the bouncers we're hella nice most are irritated having  to deal with tipsy people but none of them seemed to have a chip on there shoulder.  And Ayyy this place is hella cute!  Maybe the alcohol got to me   but I had the time of my life and I'm happy I was here!", "author": "Destiny A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-09", "description": "Corey his service was beyond professional, right from the start he was very welcoming, and he made sure we were taken care of properly, i recommend his services to all my friends, he was was amazing, 10 stars, if i could rate him.", "author": "Rianne C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-09-04", "description": "Do not go there  and order bottle service because if you do they will seat you and when someone else comes and that person order more bottles than you for ex. 1 bottle more than you, guess what you are out of luck and they will move you to where ever they can put you, they would take your money and put you out side if they wanted to. A business should not be run like this. Also one of our bottles got stolen, never again!!!", "author": "Megaen C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-02", "description": "I had been on a friend's bottle service so I could come in whenever I wanted but I still came around 11pm since I had a few friends who had the standard free pre-11pm guestlist. No surprise it's empty, the crowd flowed in around 11:45pm and there was a decent size crowd to fill the dance floor. The bar had some drink specials that made the night slightly more affordable. Somehow my friend ended up getting two bottle service areas at the opposite end of the club which was kinda nice. Overall, I had a good time. My suggestion is to just pay the cover and come in at like 12-something. If you're trying to save money by doing free guestlist, I guarantee you'll end up spending more money at the bar just to get you buzzed enough to pass the time.", "author": "Ryan L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-10", "description": "Had a wonderful experience here! Corey who was doing bottle service was amazing.. he's the man well be back. would totally recommend this club for anyone looking to be treated right. Thank you", "author": "Bianca W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-08", "description": "Corey was an excellent host. Appreciate him helping us and having an awesome time. Worth every penny and time here.", "author": "Anshul J."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-08-20", "description": "The club itself is nice and the drinks aren't too watered down but what is really off putting is the bouncers. Anything and everything triggers them to say something to you, its almost as bad as a high school dance.", "author": "Karla M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-01", "description": "Corey the Vip host was amazing! I was surprised with the level of hospitality an  professionalism.  Thank you so much! \n\nBless", "author": "Tyler S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-10-02", "description": "Security was extremely rude. Went to see Miguel and did the free entry before 10:30 thing. We got there at about 9:30 and waited in line there wasn't many people in line since it was so early so we thought we could get a few drinks so we simply asked when they were going to start letting people in and if we were in the correct line. He rudely told us to show patience. Sorry if we want to make sure we are standing in the right line for a half hour. It wasn't just us either several people went up to ask a question and they seemed inconvenienced and annoyed that someone would talk to them. The 2 stars are for the very nice and friendly bartenders. All 3 of them that I ordered drinks from were great which isn't common in the nightclub scene. However that was the only positive thing. Will not be coming back", "author": "Jac E."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-09-20", "description": "Do not waste your time or the $20 cover. The staff is extremely rude, plus the place is empty (on a Saturday night). I do NOT recommend this club to anyone there are no redeeming qualities for a place that is overpriced, empty and operated with a completely rude staff. Thanks but no thanks!", "author": "Aaron C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-03-16", "description": "My friends and I came here on a Saturday night for her birthday! The venue itself was nice, but the staff was not very friendly!! The night started off amazing, the music was all hip-hop which was awesome and were having an awesome time! But a bouncer came up to me and said I had to leave, I didn't say anything and got kicked out! I honestly don't know why, I wasn't even that drunk and my friends saw that as well! It was just very rude and I didn't appreciate that at all after we spent a lot of money on bottle service!", "author": "Sandiiee D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-10-24", "description": "I give this place 3  because when I visited this venue before it had a different name.. the improvements they have made since I was last there are great! Now I attended last nights concert with JR performing.. I couldn't dance  like I wanted to the floor was either wet or sticky probably ruined my dancing shoes .. the music to me was a little off.. couldn't hear the rhythm..", "author": "Jackie A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-10-09", "description": "First off, the bouncers and staff were super rude. Second, we had a table and we had to wait in line while they let a ton of general admission in. There at least 30 people who bought tables! We couldn't get in which was a waste of time and money. Ridiculous!! If I could have rated zero stars I would have!", "author": "Gabriela H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-25", "description": "One of the best venues in San Francisco- top notch high class with a great team of people! I was surprised at how well I was treated at this venue, keep up the excellent work!", "author": "Flo S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-02-06", "description": "So many awesome super bowl parties in SF this weekend and I chose to go to hue for TI and NEYO. Big mistake. Was $100 ticket, a COMPLETE WASTE OF MONEY. Both \"performers\", as they were advertised, finally showed up at 12:45. Neyo sang 4-5 songs, TI didn't even come onstage. Super disappointing. Won't be returning to this venue.", "author": "Holly C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-01-30", "description": "If you are a racist this club is perfect for you. Paid for table and still couldn't get a wristband #asianproblems. Music good doe.", "author": "Charlie L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-02", "description": "I had a fantastic night out at Hue! \n\nEverything from the courteous staff, the great music and the professional bouncers made our night a success. Worth checking out if you're into the whole club scene. \n\nWe will definitely be back!", "author": "Taylor M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-11-23", "description": "Besides our server/waitress being hott, the night was whack.\n\nThe staff were not all on the same level, we were being told one thing from another by everyone. It was annoying. We were told at booking, that the same music is played in both rooms which was a lie because we wanted our booth in the area of top 40 but didn't get it. Told we'd get wristbands for friends on guest list then at the door told they couldn't get in but some guy was nice enough to help and let them join us at our booth. My cousin wasn't aware of the smoking section, asked if she'd be able to get back in if she went through the front they responded yes, then bouncer said no re-entry, she had to explain herself and they were kind to let her back in. Bottle was warm couldn't get our shots chilled. Our friend who rsvp'd the booth was told her card got declined but the charge was already processing, smh. It's a cute place and has potential (although kind of an odd lay out) but service and everything was just whack, definitely not high end like it claims to be. Didn't even want to rate on the star scale but had too.", "author": "Melissa C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-24", "description": "Amazing customer service, Corey truly goes above and beyond for his clients! #Blessed.", "author": "Aminder S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-12", "description": "I thought what a perfect venue to enjoy watching soulection!! For being on Broadway st, I thought this club was super chill and clean. The bathrooms were clean which is a super plus. It is a very small night club, and the only annoying thing is drunk stupid people who do not come to enjoy music. I would go there again if one of my fav artists plays there.", "author": "Santoki A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-07-30", "description": "This place sucks. No one was really in the club and wasted 20$ cover for a no good club", "author": "Alexia F."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-08-31", "description": "I was super pumped to see \"One More Time\", the Daft Punk Tribute show. Ordered my tickets on Eventbrite, checked the site for any details I might need and ralled a bunch of friends to meet over at Hue, a new club on Broadway. \n\nWalked up and am greeted coldly by the bouncer\n\nBouncer: \"You on the guest list?\"\nMe: \"We ordered tickets online!\"\nBouncer: \"Doesn't matter, you're not getting in\"\n\nTo my surprise, the bouncer doesn't let me and my friend in due to dress code violations. We were in black t shirts and dark jeans, not basketball jerseys and sweatpants. \n\nNeedless to say, I was pretty disappointed as neither Hue's website listing for the event, the \"About us\" section, nor the Eventbrite page mentioned a dress code.\n\nI'm fine with having a dress code, but it should really be outlined on the event page and the club's actual website.", "author": "Michael L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-04-30", "description": "Really fancy place, however the vibe is so boring and music is outdated.  It was pretty empty. Drinks were fine a little pricey after happy hour. Btw this was on a Friday night.", "author": "Ere L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-02", "description": "Came here because my friend's friend was DJing! It's a cute little lounge/club that has two sections. Not sure if the place is big or not that many people showed up but it's a decent size. Lol. Love that there's a bunch of stalls in the women's bathroom. I hate waiting in line when I have to peel hella bad. But it's a cute club that's new so give it a try!", "author": "Kelly S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-01-08", "description": "The venue is amazing!!! We went on a Friday night and even though it was packed I got to say the music they had was not really danceable! The music was wack and inconsistent... For the most part, everyone was standing around hoping the music would get better. We went back down stairs for the hip hop and rap music but the floor was dead! I must say that their bartenders have really great service and are very friendly which made us want to keep getting more drinks lol! Overall it it was not worth a $20 charge but the venue made up for it I guess! Not sure if I would go back unless a good DJ is there and they add more excitement to the down stairs room!!", "author": "Andrea A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-27", "description": "This place is legit! I came here last night and it was so much fun! My friends and I had bottle service and the customer service was great! Our bottle girl was on point and we never had to ask for anything. The people there were beautiful, and the staff was friendly and accommodating. Definitely coming back!", "author": "Benito K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-26", "description": "HUE is what the San Francisco club scene has been MISSING! The venue is sophisticated and chic. The music is an awesome blend of EDM and hip hop, so there is something for everyone. My husband hosted my 32nd birthday at HUE and we were not disappointed! The staff is extremely friendly, helpful, and dedicated to ensure that YOU and your party has the best time ever. Our guests also commented how easy it was to get in the club and that they felt that HUE rolled out the red carpet for THEM. HUE takes a cue from Vegas and brought the club scene back to life in the city.", "author": "Wendy P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-01-02", "description": "This was the most ghetto, poorly serviced nightclub I have EVER been to. After being hassled at the door to even get our [already made days prior] reservation straight. My friends and I had a table and bottle service, paying thousands of dollars for NO service at all. I saw our cocktail server ONCE, she only came and brought us the bottle, NO mixers, and then LEFT. Making sure she grabbed her money before departing though. She also left an unopened champagne bottle for us to again serve ourselves for the money we were paying her. We had to go FIND someone to get mixers in carafes. Our used glasses piled on the table until we personally took them to the bar ourselves. At this point I should have been tipped out too. Our ice was NEVER replenished and was the same ice our bottle sat in. Just terribly GROSS. We had to go chase another girl down to order another bottle since it was NYE and there was no turning back now with our party of people. Again sitting in our melted ice bucket that we had to serve ice from. It was honestly as though they didn't want to make money at all. They completely FORGOT to bring our VIP snack service for a couple hours. When we finally got it all of the food that was supposed to be warm was COLD. The only reason this got a star was solely due to the DJ being great. That was the only thing satisfying from this night. I would NEVER go back to this place.", "author": "Quinn W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-08", "description": "hidden gem in SF. space is gorgeous and the music is the BEST! Hiphop/R&B and not that crappy EDM.  Pleasantly surprised about this place.  Definitely our go-to SF club.", "author": "Ralonyel P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-24", "description": "Beautiful venue! Great bar staff that makes sure your group has a memorable time. This place is great for getting bottle service, pretty affordable and accommodating compared to other SF venues and worth it since it's so swanky in there. You have to check the calendar with what is going on to make sure it fits your music preference.  Renting the venue for private events is also recommended.", "author": "Karen K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-22", "description": "Had a great time seeing JR Castro here! The crowd was my only complaint, everyone was kind of just standing around. It was packed though and the decor is beautiful. I will definitely go here again!!", "author": "Jamie J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-28", "description": "Corey is an amazing promoter, he is extremely good at what he does. Very professional and always pulls through to help everyone get in. Ask for Corey when you come to Hue!", "author": "Dean S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-08", "description": "My boy Corey is the man he takes care of you to the fullest he is the best VIP host there if you contact him", "author": "Simon K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-20", "description": "I would highly recommend this night club. I had my birthday party there over the weekend. My friends and I had a great time and our vip lounge had a great view of the pyramid. Music and the staff was thumbs-up!  If you want to have a Vegas like celebration this is the spot to have it.", "author": "Annabelle R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-18", "description": "My first time there & Loved the place ... music was cracking,bartender was working it & crowd was awesome. To top it off there is a Paris Pizza right opposite the club that closes at 4am . So you know where to go when you get hungry at the club lol. Will definitely reserve for my Birthday Celebration next Saturday  The services is just great #handsdown", "author": "Xtratragorjezz W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-11-01", "description": "I went in the Halloween event.  First of all, they stamp you but you can't leave...according to the security it is due to liability issues. Fine. Then at 10:30pm I ordered mojito  and I was told they ran out of mint! At 10:30...really?  Then I ordered a Margarita and it was not all that fantastic.  Big place but that's about it.", "author": "Hazel B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-09-18", "description": "Extremely rude. The head of security screamed at me while I was trying to explain my situation. This was the worst customer service situation you could imagine. If I'm paying a $20 cover this place place better be popping. It wasn't, first room was almost sad with the amount of people. Second room had a fair amount of people but the atmosphere lacked. Don't go here overpriced and underwhelming.", "author": "K A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-09-18", "description": "This was a terrible experience. Between the over aggressive security and the sensitive hostess, I would never recommend this to anyone, local or visitor.", "author": "Ryan C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-31", "description": "Love the new look and atmosphere great staff ! The Bartenders were really good and drinks were just right.", "author": "Usiku B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-10-29", "description": "Very weak drinks. Worst bartender in the world. When I complained about the drinks she called security to kick me out. ( after me and my friends paid $30 admission each. Don't go there ever!", "author": "Moish L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-01", "description": "Wha?? Is this the same Broadway St.?? This place is straight up gorgeous- from the Miami-style decor, to the lights, to the dope LED walls. Sound system is bangin'. Tables towards the back have sweeeet city views of the Pyramid- those booths looked to be in high demand for the bottle service crowd. Bartenders are fast and friendly, and drinks are actually fairly cheap for an SF nightclub. I like that they serve drinks in mock glassware and not those cheap disposable cups- gives me something to hold on to on the dance floor. Plus they serve coconut water! Everyone was getting down on the dance floor and just seemed to be out to have a good time- no stupid club drama or posing here. Apparently they just opened- I'm interested to see what kind of talent they will be bringing in here, gonna be popping for sure.", "author": "Jonathan M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-03-22", "description": "ran into this spot trying to find a night club and it was pretty nice... People was nice and it felt real relax. The drinks was fairly priced and made right", "author": "Kai T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-01-30", "description": "By far the best looking club in SF but the worst club I have ever been to.     Worst vibe and staff I have ever seen.     Would never go back.  Which is a bummer because I love the look and design of the club.     but the staff is such a turn off!!!    Don't waste your time.", "author": "Michael D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-28", "description": "Where are these bad reviews coming from? Most of these are hate reviews from other clubs I bet! Anyways, I really think this is what broadway needed. Staff is nice, decor is nice, lighting is state of the art!", "author": "Marcela A."}
