{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-12", "description": "Randomly was craving chinese food, not really sure why exactly as I am sure I am not pregnant. Ordered delivery through the yelp app. Was given a 45-hour estimated time of delivery. 40-45 minutes later my doorbell rings and here is the food.\n\nI ordered the sesame chicken, walnut prawns and hot and sour soup. All of the dishes was still hot which is nice because nothing is worse then ordering delivery and the food shows up cold. All in all I can't say this is the best chinese food I have had but I could see myself ordering from them again. \n\nThank you Hunan for satisfying my chinese food craving!", "author": "Dmitriy G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-02", "description": "Great place for a cheap lunch option in Cow Hollow. A cup of soup of the day, an entree, and white rice for $7-9 depending on your protein choice. \n\nThe food isn't going to win any taste awards or be Michelin rated, but for Cow Hollow, this is a decent place for a decent price. \n\nThe decor inside feels old, the location is in this weird mixed use office building, but if you do take out, it shouldn't bother you at all. \n\nGet the menu if you order dinner for takeout. At a certain $ amount, there are some freebies that's listed on the menu (free egg rolls or pot stickers). \n\nLike most Chinese places, don't expect any service beyond here is your food, here is your check, but you weren't planning to take a date here anyways. \n\nIt can get a little hectic for lunch, so order ahead.", "author": "James N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-07-11", "description": "Ordered the lunch special for take out during my lunch break; Garlic String beans over rice with a side of Westlake soup \n\n$8 for the lunch special with tax. \n\nFood tasted decent, the ratio of rice is most def greater than the string beans. \n\nI actually like the westlake beef soup, it's light and hearty. \n\nFirst time eating/ordering from here but to be honest, this is probably one of the only few places you would find around the marina with spending $10 or less on a decent lunch that is actually filling. \n\nI'd come back and try the mapo tofu next!", "author": "Kathy T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-31", "description": "I stop here for lunch every couple weeks and it always hits the spot. Quiet little place tucked in the back of the building between stores. Staff is polite, never had a messed up to-go order, inexpensive, & I've never seen it crowded so the food comes out pretty quickly", "author": "Jill A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-26", "description": "My partner and I LOVE this hidden gem. We moved in right around the corner about a year ago and found this spot and we dine in or takeout at least once a week. Very cheap and delicious food. Never had a problem with orders. Employees are very very nice. The restaurant has lots of seating and is usually very quiet and relaxing. We love their rice - always cooked so well and tastes so good. I recommend the chicken broccoli entree. This is definitely our favorite little spot when we're home :)", "author": "Baylee R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-10", "description": "I've been going to Hunan Empire for over ten years since I work next door and have lived and worked a few blocks from the restaurant for over ten years. \nI feel bad that I haven't left a review till now  and I go pretty often there like family to me I've watched there kids grow up. \nthe food is  great chines food that's always good and fresh \nWhen I'm feeling under the weather I get the Hot and Sour Soup or the Shrimp Wonton Soup! I've had almost everything on there menu when I'm in the mood for chines food there my go 2 . And my must have dish is the (General Tsao's Chichen) I never get tied of it ! It's a everyday or once a week place and the owners are the sweetest people Jim and Michele they make everyone feel at home !", "author": "Catalina D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-03", "description": "I've gotten take out about 3 times form Hunan Empire. The food is delicious and very inexpensive. I highly recommend this place. They are fast and reliable especially when youre having a busy day and step out for lunch for very long. The portions are always very generous and they give you free soup.", "author": "Tati C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-01-22", "description": "I've ordered Delivery two times:\n1. House Special Fried Rice & Chow Mein \n2. Fried Rice & Chow Fun\n\nBoth times delivery was fast and food came hot, so I am happy with that.\n\nThe food was a O.K., but a bit tasteless. The quantity for the price is good! You get a lot of food for your money.\n\nOverall: it's not bad, but not super to my liking. But I might still order from here again.", "author": "Lilian C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-09", "description": "I have legit never did a yelp review in my life and maybe I was starving and exhausted from a long workday but this hidden gem is AMAZING! I just moved from nyc where I thought I was experiencing the best Chinese quinine but Mr. Chows and all the other Chinese restaurants eat dirt compared to this hidden heaven. It's REALLY tasty and cheap! Definitely give it a shot.", "author": "Morgan S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-16", "description": "Great local Chinese spot. You can't go wrong with anything here. \n\nStarted coming here two years ago and I'm a regular now.", "author": "Amreet S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-23", "description": "Love this restaurant have been going here for more than ten years dining in or delivery the food is fresh and great. The owners are darling very sweet.", "author": "Maria J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-01", "description": "The owners here are so nice. Jimmy and Michelle run such a great little restaurant. Hunan Empire is located in a medical building so if you're not careful, you will miss it. Definitely try their pork potstickers or the sliced fish in black bean sauce. This is my weekly go to chinese restaurant. Their lunch specials are only about $7 and comes with the main entree, soup, and rice. I usually upgrade the white rice to either pork fried rice or chow mien. It's only an extra $2!", "author": "Red G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-28", "description": "I love this place so much. They're always insanely nice and there's tons of seating. I go here so often that they know my order and just bring it to me. Great fried rice and good prices. Mostly quiet with just everyone that works on the street eating lunch here or taking it to go. Always awesome :)", "author": "Shawna M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-21", "description": "My friends and I had an awful experience when paying for our food, the waiter totally ripped us off, My card was charged $15.50 and she said it was declined so my friend offered her card, but my bank statement proves the restaurant received the $15.50! Also, after being completely rude to us, she MADE my friend tip her... and wouldn't leave the table until she did. The older man who works there is a sweetheart and was our waiter but the mid 40s lady who brought us our bill is terrible!", "author": "Toni Z."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-01-20", "description": "I made it to the restaurant by 3:30pm, so I was able to order off of the lunch special menu. I couldn't decide which entree I should select, so I ordered two specials: Hunan Chicken and General Tsao Chicken. \n\nHunan Chicken: if you enjoy spicy hot Chinese food that clears your sinuses, then this is the dish for you! The chicken was very tender, the sauce flavorful, and there was a lot of vegetables served with the steamed rice, and a side bowl of soup. \n\nGeneral Tsao Chicken: this dish was a disappointment. The flavor of the sauce was off, and there were only a few slices of carrots that were not completely steamed. This dish came with rice and a small bowl of soup, as well. \n\nOverall, when you come to San Francisco your mouth is already preparing itself to enjoy some completely outrageous tasting Chinese food. This food was at best, fair. The restaurant is within walking distance of hotels, and that's about the only advantage.", "author": "Peggy H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-05", "description": "Four stars for easy ordering, wide range of menu options, fast delivery with a smile, decent food and awesome prices. We ordered General Tso's, which wasn't exactly the flavor we were expecting, but it was still very good, and sweet and sour pork, which we both really liked. The egg rolls were ok (I thought they were great, but fiancé did not like), same with the pot stickers (too doughy but fine for me, fiancé found them inedible), and fried won tons were a disappointment, but you know, they were fine.", "author": "Lauren C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-22", "description": "Friendly service, and great hot and sour soup. Will definitely come back again!", "author": "Briana Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-15", "description": "Cheap quick home-style Chinese food!\n\nOutdated (and gaudy) but cozy interior! Old school family owned place for some authentic food. Came for lunch and enjoyed the dim sum and some hot tea. Made friends with a bunch of regulars while there which was fun and small-town feel. \n\nNot the friendliest service but quick and the food was tasty!", "author": "Sarah G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-09", "description": "The best feature of the restaurant is a home made hot chili paste / oil. I don't like spicy foods or condiments. But I try it my soup to start and never put it down. I used it on every item during lunch. Please visit and comment if the food and chili paste. The hit chili paste has a slow low heat with a bit of sweetness. The month feel is great as well. Enjoy....", "author": "Noble B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-26", "description": "Been ordering takeout from here every now and then. Inexpensive, tastes good, and is ready in 10 minutes or less.", "author": "Harry W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-12", "description": "Just arrived in San Francisco and was looking for a reasonably priced restaurant. We ordered the appetizers combo, general chicken and Hunan prawns. Everything was really good. The Hunan Prawns were too salty. But good Chinese for the price.", "author": "Donna R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-01-04", "description": "Should change the name to Bland Empire. I stopped in for lunch and figured I would go for the garlic chicken and dragon dim sum. I don't know how but both were so bland...how can that be with garlic.\n\nWith that I'm mind my bill came out to $12. No bad but not worth going back.", "author": "Melody R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-08-19", "description": "We ordered through Yelp. When the delivery arrived, we were shocked to learn that the dishes we ordered dis not come with any rice. I personal have not been to a Chinese restaurant where they charges for the rice separately and without any warning on the menu.", "author": "Aaron C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-14", "description": "I love this place! The owner is adorable!! The food is just wonderful, also there is delivery. I feel like some of the reviews are a little harsh. The staff is just so nice, and sweet.\n\nI hope this place stays around for a while!!", "author": "Xuan C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-03", "description": "This place was a such a good find! It's tucked away inside a building by the equinox on Union St. which makes it really easy to miss, but I would definitely recommend it if you're looking for Chinese food!! The owner seemed really friendly and was very attentive, granted there weren't a whole lot of people eating when we were there. The menu was pretty extensive and we got pretty large portions for the price. Like people mentioned below, everything was between $6-10 so if you're looking for good, cheap Chinese food in the area, this is the place to go!!", "author": "Jimmy C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-16", "description": "This place is really good. The food taste pretty well, everything was served quickly. The staff is really nice.\nNice food, nice place, good price. I had the combination plate (an appetizer) and a chow mein with pork, beef, shrimp and chicken.", "author": "Ana T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-18", "description": "This is hands down the best and cheapest chinese food restaurant in the Marina/Pacific Heights area. The owner is very nice and the food is phenomenal. The lunch specials are around $6 and are a steal for how much food you get. The delivery service is free and is very quick. The delivery guy is super nice.", "author": "Paul B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-12-16", "description": "Keep in mind i only had the wonton soup. I thought $8 was high but it was packed with large pieces of beef and chicken. The entrees were about $11. I really just wanted the broth but it was tasty overall.", "author": "Mike M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-27", "description": "Fast service and food is on par with what you would expect from Americanized Chinese food. Satisfied with my experiences and will definitely order take out from here again!", "author": "Nolan S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-03", "description": "Delicious!! Great service and yummy family friendly atmosphere. We spend Xmas eve dinner here", "author": "K Joy R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-04", "description": "Seriously such an amazing deal at lunch! The service was fine and def worth it for the price. You should try if you are looking for a new Chinese place in the neighborhood! Shout out to the wantons also!", "author": "Tina S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-29", "description": "Great place for inexpensive, high quality Chinese food on Union Street!\nTook my Chinese friend there and she was impressed with the quality.\nFamily run. Fast, friendly service.\nTheir lunch specials provide a good meal for under $10 even including tip.\n It's inside the medical building just past the elevators.", "author": "Eric K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-07", "description": "I am reluctant to post a review because I don't want people to find out about this place haha. But this place is great! No frills, very low key and peaceful... I absolutely love hanging out in the marina but this little hidden gem is a wonderful moment to kick back for a meal! Prices are CHEAP, SF or not. Their lunch specials are so affordable! We fed a group of 4 for a little over $40 including tax and tip. Service is fine, too. Definitely keep this place in mind if you're craving Chinese in the area :)", "author": "Dana B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-23", "description": "It's not on the street front, but walk a ways into the building and you'll see it! The restaurant was completely empty when we arrived for a late dinner around 8:30 but we're so glad we stayed. There was great service and excellent food. With medium-large portions.  We ordered steamed white rice, mapu tofu, mixed vegetables, and the chicken-sausage clay pot with green tea. Everything was perfect.", "author": "Meralyn W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-13", "description": "Long story short: this is solid Chinese food at unbeatable prices.\n\nMost are between $6-$10 and the lunch specials are around $6...incredible value (comes with rice and soup). I like the chow mein and eggplant with meat.\n\nA tasty $6 chow mein is a nice break from a street full of $14 salads.\n\nThe people there are nice and they pretend to understand my Mandarin.", "author": "K C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-09-21", "description": "Terrible Chinese food. Go over the hill and go to Eliza's. I've never had dry Chinese food before, but that is what everything was. We had to dump soy sauce over everything to make the meal enjoyable. Dry, flavorless, and poor quality.", "author": "Casey C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-02-06", "description": "I have no idea how my friends and I stumbled into this dump. While strolling the streets of San Fran, we were suddenly hit with a craving for some dim sum. We thought our cravings/prayers were answered when we saw the gleaming sign of Hunan Empire Restaurant.  They even had a sign out stating they had the \"World's Best Dim Sum.\" What a load of crap.\n\nThe moment you walk in, there was a weird vibe to the place. I've had my fair share of hole in the wall places, but this place was just something else. The place was dingy and old, table tops were sticky, and none of the utensils were clean. \n\nService? Totally nonexistent. \n\nFood? Bland and disgusting. \n\nHot tea? Not hot at all. I'm not even sure they boiled the tea kettle properly. I think our server just threw some tea leaves into lukewarm tap water and called it \"hot tea.\"\n\nShui Mai, which is usually my favorite item, turned out to be a disgusting ball of undercooked slimy ground meat. One bite and I almost threw up.\n\nHot & Sour Soup was neither hot nor sour, and it had a starchy taste to it. Definitely not a good thing when your soup feels thick and powdery.\n\nBBQ Pork Buns tasted like coconuts. No further explanation needed.\n\nFor what it's worth, the place hardly looked like it belonged in the restaurant business. It's hidden deep a commerce center on the first floor.  What seemed like an answer to our cravings was actually a curse in disguise, as we left this place with upset stomachs and the need to wash the disgusting tastes out of our mouths.", "author": "Daniel C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-08-25", "description": "Out of the 7 times I've eaten here this is the second time I've found a fly in my food!!!! So gross. And I tell the waiter and he says \"it's just a fly\" how about I'm sure that fly was just outside touching dog poop. Never coming back. If you like flies in your food, this is the place to come. Smh!!!", "author": "Quan B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-14", "description": "We ordered delivery last night: chicken and broccoli (which isn't on the menu, but they have it), kung pow chicken and chicken fried rice. \n\nThe chicken fried rice was my favorite- it was very flavorful (it's been sooo long since I've found a place with flavorful fried rice!), didn't taste like msg (I can usually tell). \n\nThe pieces of chicken in all 3 dishes were good (ie. it WAS in fact chicken, right flavor and texture and not dark meat either), I only had one piece that was cartlidge, and no pieces strung together (yes, I'm picky).\n\nDelivery was fast, food was hot, inexpensive and delicious, I'll def. order from them again!", "author": "Layla L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-25", "description": "They rule.\n\nAwesome shrimp dim sum with chives. Huge portion of steamed chicken and broccoli. Just $13.50 for the pair.\n\nFriendly staff who are happy to customize (thanks for the steaming!). Only miss was a misspelled fortune cookie. Only miss was not under their control.\n\nThis empire deserves to rule over Union Street for years to come.", "author": "Jason B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-02-15", "description": "Maybe I ordered the wrong thing, but I got take out from here once and the meat was just... really bad. You know when you get hard things in meat that immediately activate your gag reflex? I got past one of those, then hit another, and had to stop. It was General Tso's chicken I think. Ew.... hard pieces. Won't go again and can't recommend but it seems like this place has decent other stuff based on other yelper's review.", "author": "Sarah B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-04-09", "description": "Worst ever. I order the won ton soup and pot stickers. I thought how could they mess us wonton soup. But they did! Only 2 won tons. Soup broth was not good and the chicken in it was so bad. Pot stickers were meh. I will never go back. Ever. Stay away! And over priced $14 for shitty food", "author": "Genevieve F."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-01-03", "description": "It's average/ok Chinese food, not spectacular. It was the only Chinese food place along anywhere on Union Street. I got a set of dim sum, including shrimp dumplings, egg rolls, and yummy pork.", "author": "Susan T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-12-14", "description": "Tucked away on the first floor of a strange building in the Marina, Hunan Empire is authentic in an area otherwise devoid of Chinese restaurants. I ordered some Char Siu Bao and General Tso chicken lunch special giving (in my estimation) a fair sampling of the lunchtime offerings. \n\nThe Pork Buns were great other than the centers being cold to the touch. I ate them and didnt die but have nothing to show for my feat either. They were quite cheap ~$2 so I didnt complain.\n\nEgg drop soup was the first course and it was typical of the soup and not noteworthy. The chicken was delicious, the spring roll fine, the rice was typical chinese place rice (not sticky enough for an island boy). \n\nWhile Ill likely eat here again when staying in the Marina, Ill not be going out of my way to eat here. Good food for a good price, Id like to try more of the menu in the future as they have many good reviews.", "author": "Dude A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-01-30", "description": "NASTY NASTY NASTY!\nI got the Hot and Sour soup and it was the nastiest one I have ever tried. It had a weird sweet taste to it and the chicken tasted like a wet dog would. Just nasty! Also a very weird consistency. NEVER AGAIN!", "author": "G O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-28", "description": "I ordered the lunch special and couldn't believe what a deal it was! $6 for a rice place with soup!!! I don't normally like Hunan food and was pleasantly surprised to find they have more Cantonese flavors. It's nice to know there is this hidden gem on Union street that allows you not to spend an arm and a leg on mediocre food.  They also give you the option of dark or light meat and white or brown rice.  bonus points!!", "author": "Susan Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-23", "description": "I get take out from here regularly. \n\nThe food is tasty, the people are very nice and friendly and it is reasonably priced. That just about covers it.", "author": "Mike W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-04-10", "description": "Tucked away inside a financial building is this little Chinese Restaurant that offers Asian fare that is much more affordable than the eateries around Union. \n\nI've come here three times and the dining room is usually empty, but I've noticed that there is a lot of take-out.  I would recommend the potstickers and the hot and sour soup.   \n\nThe food comes out hot, but the service is awfully slow - which is confusing because I've never seen them packed!  Oh well, as long as the food is good, I'm not complaining.", "author": "Kristen D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-11", "description": "Jim and Michelle have been on Union Street for DECADES.  THAT alone, should tell you something.  GREAT food at a even GREATER price!  Thank you guys for feeding me for the last 14 years. Cheers to Hunan!", "author": "Vivian E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-24", "description": "Always walked past their huge menu posted on the building, finally decided to try it for lunch since they have a pretty cheap lunch menu.\n\nWalked in, empty place (guess they do more deliveries than people eating there).  Seated right away.  I ordered the chicken and green beans (my favorite Chinese dish) and a side of egg rolls.\n\nChicken & Green Beans - the taste wasn't what I was used to, didn't really like it but I didn't want to waste my money.  Since it was a lunch special it came with a side of rice and a small, small side soup (which is okay in taste).\n\nEggrolls were average in flavor, came with sweet/sour dipping sauce.\n\nYou pretty much get what you pay for in terms of quality.  I may return to try something else to see if they have anything better.\n\n\nUPDATE: I returned to try the chicken chow fun. It hit the spot. Definitely have to just try the various dishes to find the one you like. Yum!", "author": "Lisa T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-28", "description": "This place looks like a family run restaurant.  We came here on Christmas Eve and the food was excellent.  The service was great too and you can't beat the price.", "author": "John G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-11-20", "description": "Gotta give Hunan Empire the Five stars!  We live a block away and not a week goes by that we don't get a take-out dinner from here.  The black bean chicken is awesome and the walnut prawns are the best I've had in some time.  \n\nDefinitely the best chinese takeout and delivery place in Cow Hollow and the Marina.  Cheap, too.   \n\nI've only dined in on a few occasions, but it is a pleasant and very quiet place to eat since there are rarely dine-in customers.   Definitely casual.  Make that very casual. Super kid friendly for all the above reasons.  Great place for groups because you don't need a reservation and you can feed a ton of people without dropping a lot of coin.  \n\nIt appears to be a family run business run by a very nice, hardworking couple (I think the husband cooks and the wife runs the front).    I like supporting local businesses and Hunan Empire makes it easy with the delicious, affordable fare.", "author": "Super T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-14", "description": "No complaints here, we were craving Chinese and this place had exactly what we expected. I loved their veggie soup and the lunch specials are pretty good too. I'd come back if I'm in the area again :)", "author": "V L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-01", "description": "I wanted to let everyone know about this restaurant .. I've been eating here for several years now. All the the entrees that I have ever ate were very good.. Jimmy and Michelle do a wonderful job.. They also deliver food nice and hot.. It's my most favorite Chinese restaurant in the Marina  area .. Give them a try and you won't be disappointed ..", "author": "Harold O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-31", "description": "I really love this Chinese restaurant. The food is really cheap. The people there are really nice", "author": "Paul B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-10", "description": "I'm rounding up to 4 stars because Hunan Empire gets a big bonus for being an authentic Chinese restaurant in the heart of the Marina / Cow Hollow area. I mean, across the street is Betelnut, which pales in comparison for authenticity. I had always wondered how this random Chinese restaurant could survive here, but now I understand.\n\n+ 1: open late - where can one go for good grub on a weekday night at 9:30p. We had just finished rock climbing and were hungry. While even Osha was closed, Hunan Empire was open, and in fact stayed open just for our table of 5. That's awesome!\n+ 1: authentic - the menu features a wealth of dishes. There are comfort items from Ma Po Tofu to more specialized items like Twice Cooked Pork. Impressive.\n+ 1: food - we all liked what we ordered shared family style of course. Salt & Pepper Fish Fillet ($7.95) was freshly fried, nice light batter. Yum!\nGinger Garlic Eggplant ($6.75) is a classic dish and one of my favorites.\nBeef Chow Mein ($5.55) was solid.\nSteamed Half Chicken ($8.25) was a large portion of chicken.\n+ 1: cheap - seriously, our dinner tab came out to $10 or $11 pp, and that was after tax and tip. That's the kind of prices we should all be paying.", "author": "Cindy W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-03-27", "description": "You can tell a lot about a place typically by the condition of their bathroom facilities. Pealing, moldy wallpaper  with a dirty scrubber sponge (whose whereabouts I don't even want to think about) sitting on the sink, made my appetite wane I must admit. I also dashed in for some quick carry out and was met with an almost 40 min wait for my Chow Fun and Chinese Broccoli Not cool when I am on a limited lunch break and STARVING.\nHmmph. The food is decent enough, they use compost friendly starch containers, and the prices are reasonable, but somehow I just can't get the dirty toilet sponge image out of my head.", "author": "Drea L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-07-24", "description": "This is not Hunan food... Not even in the slightest. Which was very disappointing since that was the reason I went in there. Average/genetic Chinese food with reasonable prices.", "author": "Kay P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-05-19", "description": "I've experienced way better.  Our order was wrong, but that is not why the 2 stars.  We ordered MooShoo pork - there were maybe 3-4 tiny pieces of pork.  Maybe the worst moo shoo I've ever had.  The other dishes had way too much sauce and the egg rolls were overdone.  \n\nI'll try and find another Chinese place.", "author": "Carla M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-11-06", "description": "I won't be coming back here ever. I hate that I can't find a decent Chinese food delivery place in the city. The only thing that is good are the prices but that doesn't make up for the poor food quality.  The veggie chow mein had no taste! Very dry.  It needed spices, heat and just a lot of help! Worst hot and sour soup ever!!!! Very gelatinous, bad flavor, very disappointing.", "author": "Whitney S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-11", "description": "I recently ordered takeout and very much enjoyed it.  I got the shrimp and chive dim sum, sweet and sour shrimp, shrimp chow mein, and brown rice.  The food came piping hot and was very tasty!  I will definitely be ordering here again.", "author": "S P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-01", "description": "Good food for the value; location could use some renovation but I think most of the business they get comes from deliveries. It's at the very last reasonable; the menu could definitely be more focused but in the mean time, I will enjoy the variety.", "author": "Don W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-02", "description": "5 stars for the wor won ton soup- I've had the soup at Chinese restaurants all over the city, but I like this one best!", "author": "Twee L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-29", "description": "Love this place. We(my office) go there at least once per week and order a variety of things. It is refreshing to have something authentic on union street since this area is often void of culture.  Love the eggrolls, hunan chicken, and crispy wontons. House special friend rice is also great.", "author": "Tia L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-06-06", "description": "I really enjoyed eating at Hunan Empire for lunch on a Saturday. It was very quiet when me & my \"crew\" arrived--only two other parties were dining in. \n\nThe wait seemed strangely long even though the restaurant wasn't busy. Luckily we weren't in a particular hurry. We had an order of veggie rolls as an appetizer, and the prawns with mixed vegetables with rice as the main course.\n\nThe service was friendly & attentive. I would definitely eat here again if I happened to be in the area.", "author": "Rox M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-07-22", "description": "Food is cheap yeah good deal... Service is bad... I've eaten here many times and It seems once you are an established customer they treat you in a bad manner... I've stopped going here although very convenient since I work in the same building. Not to mention the hair I have found in my food. I will NEVER eat here again!!! \n\nDo not recommend.", "author": "Ada L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-14", "description": "Only had it for delivery and pick up, but they never fail to satisfy.  Being that I am just down the street, the delivery guy just has to walk the food down.  \n\nThe pot stickers are some of the best I've had, filled with good things like pork, ginger and cabbage.  The egg rolls are great too.  Usually we order for work lunches, birthdays, etc.  Top things we order are pot stickers, fried rice, Broccoli Beef, Mongolian Beef and Chow Mein.\n\nEverything I've had has been very good.  And with the quick delivery, I can't complain.  I just wish they are open on Sunday.", "author": "Michael M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-12-23", "description": "Very weird ambiance.  Food was kinda bland.  Even the tea tasted watered down.  Not sure why I ate here.", "author": "David P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-06-07", "description": "I bought 2 orders from yesterday. My colleagues told me before he got bad ache on his stomach after eating pot stickers. I didnt believed him at that time, now I experience it. I will tell them not to other from them anymore. I guess they re-used same meat if its not sold for the day. And GMO is one of their ingredient to taste it good which is bad for your health. Sorry but health  comes first when it comes to buying food. See for yourself and experience it.", "author": "Arden G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-02", "description": "My business partner and I have created a tradition of going to Hunan Empire every Friday for lunch. The General Tso's chicken is the best I've tasted in SF. Cooked hot and fresh. This place is a total gem.", "author": "Alex L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-12-24", "description": "So pointless. I ordered the calamari, the 'Fresh squid roasted with salt and chili pepper', and the pork buns. Calamari had literally no seasoning and over-battered, and the squid dish was just the same calamari with some jalapeno slices added in. It came with soy sauce and the sweet red sauce on the side. \n\nPork buns were good, but the complete lack of seasoning on the other dishes is baffling.", "author": "Paul H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-04", "description": "Hidden Inside what feels like an office building, my expectations were low, but really hungry and my friend wanted Chinese food.\n\nWe ordered the wor won ton soup, beef and broccoli and chicken chow mein to share.\nThe won ton soup had a good amount of meat in it, not just filler. The beef and broccoli was ok, nothing wrong or special about it. The chow mein was pretty good, not overly salty like others I've had.\n\nServers were nice. Water refill and to-go boxes were brought when asked for. Will probably be back next time I visit the area.", "author": "Eric T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-11-07", "description": "Are you even kidding me right now? I ordered delivery and paid $35 (including tip) for a 2-person meal. When it arrived:\n\n1. There was only one box of white rice, I had ordered two.\n2. The egg rolls were full of a brown-grey powder (flavoring that hadn't been fully cooked into the mix before rolling?) and therefore inedible.\n3. The Chow Mein had no sauce at all. Literally blank white noodles and blank white chicken.\n\nBoth chicken dishes were decent, about normal for a cheap chinese food place.\n\nI called to discuss the situation and the person on the other end of the phone argued with me on every point. \"The rice serves two.\" OK, but I ordered two boxes of rice. If this is a case of different sizes of box then you need to state that on your menu. Then a back and forth at least ten times: \"No, no powder in the egg rolls.\" \"Yes, powder in the egg rolls.\" \"No, no powder.\" Rinse and repeat 8 more times. Then, \"No sauce on the chow mein? The sauce was in the bag.\" \"No it wasn't.\" \"Yes, the sauce was in the bag to mix in.\" OK, I have never heard of it being done that way but I will humor you and check and - oh, surprise - no sauce in the bag.\n\nShe eventually agreed to take the chow mein and the egg rolls off my card after I said I would provide photographic evidence of the powder and lack of sauce. She refused to take off the second rice charge. We'll see if that happens but regardless I will never order from here again.", "author": "Henny B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-27", "description": "I give them 4.5 stars... \n\nFour stars just because they're not capable of making my food extra spicy... I go there about 4 times a week and order a Mongolian beef over rice.. It is convenient and located in the same building as I work in--hurray for convenience! Oh yes, and they deliver it to me ... For just one order of 6 bucks and its on union ! HA ! What more can I ask! \n\nWell... I'm don't have a high tolerance for spicy food but the Mongolian beef over rice is suppose to be a tad bit spicy and it's not the least bit spicy:( \n\nI think their so called hot sauce is sweet sauce !\n\nBut ohwell! \n\nAffordable \nDelivery\nVery nice/genuine staff\nFast/accurate\n\nMinimum is I think $10 for credit/debt card use otherwise a 25 cent charge!!!!\n\nmake your food spicy!! \n\nOh and their shrimp wonton soup is oh-so tasty !!!!", "author": "Paul W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-07-30", "description": "Very Good Chinese food.  Very nice staff. Good prices.\n\nMo Shu Chicken is pretty darn good.  Potstickers are awesome.  Chow fun is very tasty..\n\nThey probably take a hit because of their hidden location.", "author": "Guy K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-28", "description": "Ordered take out from here a good couple of months ago. Totally forgot to write about it. Closet Chinese place I could find in the Marina on Union. I was sure they delivered, but when I asked for it (after lunch rush hour) they said it be best for me to pick it up. Lucky me, I work close by.\nThe place was empty when I arrived. A bit scattered looking, but most Chinese places are. The lady at the front was pleasant enough. So I took my huge portion of chicken chow fun back to work...and it smelled sooooo GOOD. Took 1 bite, and I'm hooked!", "author": "Lola D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-28", "description": "I like Hunan Empire! They have great lunch specials for a cheap price... Especially in the Marina!! The service is great too! Check them out!", "author": "Lisa F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-05-31", "description": "The food overall is ok - but they do have a great salt and pepper cod fish dish.  Yes it's fried, salty and spicy - they do it to perfection! It's my guilty pleasure.\n\nThey're great for home delivery.  Based on prior reviews I've read, reset your expectations when you visit the restaurant - it's not 5 star, of course; however, they are extremely affordable for what they deliver.", "author": "Mic D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-08-30", "description": "Pretty much your average Chinese restaurant.\n\nI had the chicken corn soup, hunan chicken, and fried rice.  Nothing really stuck out to me, to be completely honest.  But if you're craving for some decent chinese food in this area (without the marina pricetag), I wouldn't pass this place up.\n\nIt's tucked away from the street too, so you kind of have to seek it out.\n\nI've also had the lunch special here, which is also a pretty good value.", "author": "Vince S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-07-31", "description": "The good news is ~ this place delivers. The bad news is ~ it took over an hour to arrive. The good news is ~ they have dim sum. The bad news is ~ it tasted like paste and sweat (except for the shrimp dumplings, which were nice). I'm thinking the words dim sum and delivery just don't go together -- what was I thinking? Anyway, the good news is ~ it was very inexpensive. The bad news is ~ they needn't count on me calling again.", "author": "Gregor G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-04-13", "description": "Hot.                                Check.\n\nSpicy.                            Check.\n \nQuick.                            Check.  \n\nFortune Cookie.          No Check!!!!!!!!\n\n\nNo fortune =  : (     How will I ever know if wealth and good times are ahead?  Bummer.", "author": "Jess S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-02-21", "description": "Best Chinese food in cow hollow/PAC heights area. We get delivery from here at least twice a month. Super friendly staff too. Take care of them and they will remember you!", "author": "Nicole H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-04-07", "description": "Wonderful, delicious, tasteful cuisine with the most wonderful nicest couple of owners. Eat in or take out and very reasonably priced.", "author": "Orlando A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-05-11", "description": "I often order delivery from here.  For cheap chinese food it is 4 star take out food with a 2 star delivery time.  I used to like the orange beef here, but the last time I had it they decided it would be best to smother it in three times as much sauce as they used to use.", "author": "Jeff L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-08-04", "description": "This is the closest Chinese take out place on Union St. I  love the guy who cooks and delivers the food...he is totally sweet...but why is it everytime I eat from here and I can't feel my left leg afterwards? Can we say..\"MSG\"?", "author": "Mimi T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-01-18", "description": "two stars b/c clearly they are barely surviving.\n..\na place where the waitress should leave her day job. can she get out of her chair when someone enters? should I really have to ask for a glass of water when she gave no tea???\n..\nbad food. the cabbage was so old that it had black on it. the beef. glad i didn't die.\n..\nthe WORST DUMPLINGS EVER. how how how can you mess up shrimp and chive dumplings?? now i know why it is cheap. i feel sorry, but maybe this place should give up their expensive real estate and let the forces of gentrification finish its job on Union St.\n..\nnot a cheap meal if I couldn't eat it!", "author": "shanestar h."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-08-11", "description": "I had a great experience here on my lunch time. The young boy that seated me was very friendly, and I felt like the decor was very welcoming.\n\nThe lunch specials they have are very affordable. For under $6 I received soup, steamed rice, and my entree of string bean chicken. The portions are enough to take home the next day, and it wasn't very busy so they quick to get my food to me. \n\nFor this area of the city it is surprising (and relieving) to find an affordable lunch spot. It's definitely worth the drive if you're coming from a different part of the city.\n\nTry the string bean chicken!", "author": "Shel Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-07-14", "description": "My food from Hunan Empire has been delicious both times I've ordered from here, but in general the dishes seem hit or miss.  The sweet & sour pork and chicken that my coworkers ordered did not win rave reviews (the sauce was thin and not very flavorful).  But my other coworker has had the Mongolian prawns, chicken, & beef combo both times and it has been excellent on both tries.  My wonton soup and ginger eggplant were also both extremely good.  Good veggie eggrolls too.  \n\nFor dinner you can order through delivery.com, but for whatever reason it doesn't work at lunch.  If you call them you can order by phone for lunch delivery.", "author": "Katie S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-05-01", "description": "Got takeout here today for the first time.\n\nChicken chow mein - good.  On the bland side, but good.\n\nWonton soup - good.  I can taste a little msg in the broth, but thank gosh its only a little.  Pieces of pork in the soup are gross, but the wontons themselves are pretty good.\n\nI will definitely do takeout from this place again since I live close by, but I wouldn't go out of my way to eat here - its just a solid chinese place with cheap prices.  But you can definitely get better chinese food than this.", "author": "Ali G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-11-20", "description": "Every year we go to this restaurant because it has great tasting chinese food at great prices (most items under $10) and very friendly service.  We are a little surprised at how few people there are in the restaurant but that means we get served very quickly.", "author": "Tony F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-10-09", "description": "Where to call for Chinese delivery?  Hmmmmm.........seems to be a common question in the city.  This place is pretty decent, food was fresh, and not too greasy.  I was quoted 45 minutes and the food arrived in an hour.  Okay, it's Saturday night so I'll let that slide.  I read other reviews about Hunan that said the food was piping hot when it was delivered.  Well, that's true so I've gotta give this joint major props for that!  I had to let my food cool after I plated it!  House special chow mein was pretty impressive, sweet and sour pork was good, but the crab meat cheese fried wontons were definitely lacking.  I must say they are pretty stingy with their crab and their cheese.  It was ALL wonton.  I'm not kidding.  So if you want some dim sum, you better DIM SUM somewhere else!", "author": "Nicole W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-08-07", "description": "My co-workers and I regularly order from this place, sometimes dining in, sometimes picking up, and occasionally having good ol' Jim hand-deliver our food.\n\nIt's not the greatest Chinese food out there, but for an hour-lunch on Union St, it definitely ain't bad. Prices are cheap, their lunch specials are Great deals (rice, soup and entree for $5-$6), and Jim is my favorite business owner on the street. \n\nFavorite dishes among us:\n-General Tso's Chicken (sauce on the side, otherwise it gets a little soggy)\n-Mongolian Beef\n-Chicken Chow Mein\n-Shrimp Fried Rice\n-Ma Po Tofu, over rice (saucy, spicy and one of my favorite dishes, in general.)\n\nThey charge you a transaction fee for card payments under $10, but it's only 25 cents. Also, when they [free] deliver your food, Jim walks it himself, so give him a break. We order all the time, and have only had to wait more than 20 minutes ONCE, because we called during lunch rush.", "author": "Sachi T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-03-31", "description": "I am a HUGE fan of Dim Sum but this place is Disgusting. I tried the Dim Sum variety platter and it was soooo greasy and the wraps were ooooh sooo tough with the fillings either over or under- cooked with who knows what. Too late ,I remembered why I hadn't patronized this place for years and way before Yelp was available. Really don't know why it has survived this long.\nGo to Chinatown or Clement St (Lucky's  on Clement and ?8th for take out is terrific and rock bottom prices!) I would hate for visitors and locals alike to think this represents anything near the real deal.", "author": "kathryn h."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-10-08", "description": "I like this place...what can I say... I am a sucker for greasy chinese... Good prices, considering it's in the marina, like their $6 lunch specials... And the portions are big... You can eat for 2 days if you can pry yourself away from the orange chicken...  The owner is nice... And he makes the most AMAZING chili paste... It's the best chili paste I've ever tasted... That paste is the biggest reason for my regular visits when I was working by them... Their fast, and the food is made to order... So it's always fresh... The only thing to look out for is I had an issue with them and my check card... I was charged more then I should've been charged, so just look out for that and don't toss the receipt like I usually do.", "author": "Norma O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-05", "description": "A hidden Chinese gem.  Free delivery and the cutest little man to deliver it everytime.  Hunan has an amazing lunch special and great service.", "author": "Jenny B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-11-01", "description": "Totally NASTY!!  I ordered the Jumbo dim sum plate which included an assortment of dim sum and it was NOT edible. Pork wasn't even cooked all the way. Dim sum was so soggy and it smelled funny like it wasn't fresh. I imagine they don't get a lot of dim sum orders here. It was so DISGUSTING that I had to go across the street to get a slice of pizza to get the nasty taste out of my mouth! AVOID this place at all costs!", "author": "A W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-04-07", "description": "Like an oasis if you have a craving for Chinese food in the north side of the city especially near the Marina/Cow Hollow. Pork fried rice and sweet and sour pork are definitely tasty. The people there are nice and the food is great in value. Funny thing is they charge you extra if you use card payment but it's only 25 cents. Lunch is terrific too because you get free soup with any order. Unfortunately I can definitely taste the MSG in their food sometimes but you can request for them to leave that out with your order. They close daily at 10pm.", "author": "Brandon H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-02-17", "description": "As typical as typical chinese can get. Everything coming out of their kitchen seems to be very oily. on the plus side, their prices are pretty decent considering their location. Go during Lunch time and the wait can be quite long. Say Hi to JIMMY when u're there. He's a character to talk to", "author": "Nghi Thu H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-03-27", "description": "Amazing chow mein.  Great lunch specials at a great price, nice staff... Basically if you're looking for a cheap but quality Chinese place, Hunan Empire is it.", "author": "Nina B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-12-25", "description": "We have been here on several occasions and each time the service was fast, the food was delicious and the price is very affordable. We have ordered the family dinner special each time and have been very satisfied and would recommend this place to anyone who is up for a good meal and a decent price. Happy dining!", "author": "gordon g."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-02-22", "description": "I have never actually visited the place...but ordered it online and really enjoyed it along with everyone else and the best part it was relatively inexpensive so has become #1 go to eatery for take out/delivery.", "author": "Kevin B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-08-12", "description": "I never thought I would ever enter this strangely massive office building/parking structure that is smack dab in the middle of the Marina/Pacific Heights; however one night my bf and I were craving chinese food. We had tried Andy's delivery and were grossed out. (by the polk st location- the geary one is tasty). Anyways, we had the bright, yet seemingly risky, idea to visit Empire Hunan. We had seen this crazy structure many times before and simply laughed at thought of a huge mall in the middle of the Marina.\n\nAnyways, we ventured in. It was around 6:15 and there were a few parties already seated, mostly finishing up their meals. Over the course of our meal quite a number of people came in for takeout orders. I never knew the place was so popular. We ordered the combination appetizer platter, steamed rice, general tsaos chicken and broccoli beef. The beef was nice and tender, and the slices were a nice size and thickness. The vegetables were nice and crisp, and the sauce very flavorful. The general chicken was listed as being spicy, however was not spicy at all. It was actually a little too sweet for my liking, but I didn't complain. The combination appetizer platter was a plate of fried goodness. It fit our mood at the moment, but i dont see us including that in our next trip. \n\nOne complaint, the bbq was pretty dry. I wouldnt order it.  \n\nOverall it was a pretty good place. It's nice that we don't have to go all the way to Chinatown or Downtown for decent chinese food anymore! Also something else to note, this building is very busy. Aside from all of the to go orders, there were tons and tons of people coming in and out on the elevators, i assume parking.", "author": "Sarah I."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-30", "description": "Absolutely LOVE their crispy noodle vegetable chow mein. We order it frequently for take out at the office. Also, the green onion pancakes are great. The egg flower soup that comes with a lunch order is pretty mediocre, actually, but that's ok. Just don't order it! But everything else I've had is wonderful. The staff is so nice.", "author": "Kari G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-02-08", "description": "\"Cheap, pretty tasty and good service. Shirmp fried rice was good for $6 (dinner), Hunan Chicken was pretty tasty and the potstickers were good. $24 with tip + tax for 2 people. A steal in Marina!\"", "author": "Jocelyn L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-03-02", "description": "We got some soup delivered from here Monday night, and it was just eh - nothing memorable or worth writing home about by any means. Cheap and quick though!", "author": "Sarah R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-07-02", "description": "I can't believe I haven't reviewed Hunan Empire yet!  This is a regular delivery choice for us as they are speedy and they have damn good pork shu mai.  Damn good!  I like it because on a good night, they're exactly like the shu mai (pork hash) I grew up on in Hawaii.  I can devour two orders of those little suckers in one sitting.  Also, the food is always piping hot when it arrives and the portions are huge.", "author": "Lisa C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-11-22", "description": "Not bad. Big portions. Decently quick delivery (within 1/2 hr). I don't taste much msg.", "author": "Bruce C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-12-18", "description": "I am never disappointed when I order from Hunan Empire.  The food is made quickly, and it is very tasty.  The staff are very nice people.", "author": "Zaneta C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-09-23", "description": "In the Marina its hard to find a good cheap lunch. Here you can get that.  About 6 bucks for an entree and it fills you up. Its a 1/3 of the price of the restaurant across the street and tastes a lot better.", "author": "Rob B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-09-28", "description": "Pretty darn good.  Only complaint is that after ordering black bean chicken with asparagus 5 times and having them call  every time to say they are out of asparagus ,I have come to the conclusion that they actually never have asparagus and I should quite trying to order it.  Other than that, no complaints.", "author": "Caedmon P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-05-07", "description": "i love this restaurant one of the best deal on union street  the general tsou \nchicken is the best in sf .Great for take out as well.", "author": "isabelle c."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-11-20", "description": "I love Hunan Empire.  It's a pretty standard Chinese restaurant, but it's affordable, tasty, consistent and the staff is outstanding!!  I've never had a bad experience there.", "author": "Dave B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-09-06", "description": "Absolutley the best (and fastest) consistantly in SF.  We use them often and would not consider any other Chinese restaurant.", "author": "Richard W."}
