{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-10", "description": "With so many wonderful green spaces in SF, how do you choose a spot for some quality parklife? Well, really, it probably comes down to proximity. But it doesn't hurt when the park is surrounded by beautiful architecture and breath-taking cityscapes. \n\nQuite obviously, Huntington Park's proximity to Grace Cathedral provides for an excellent place to rest your gaze. Between the cathedral itself, and all the people activity fluttering around it, you'll have plenty of reasons to look that direction. \n\nHowever, don't forget to do a 360 and take in the rest of the scenery. To the east is the Pacific Union Club in a charming old brownstone. To the south, you get beautiful views of the city (and those NEVER get old).  After your park time, you can also walk just a little further east and see the Fairmont (and maybe check out Tonga Room while you're at it.)\n\nFinally, unless you're coming from the most immediate (north) area, you also likely get a nice exercise walking up one of many steep streets. Not every steep street in SF leads to such a reward, so savor it and enjoy the park for all that it's worth.", "author": "Jon T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-24", "description": "Glowing lights and I hear the rippling water effects.  It's quite pleasant to simply just be here - especially at night.  \n\nLooking at the fountain, sitting on the wooden benches and the lit cathedral, is serene. \n\nPlayground is available during the day.  The park is on top of Sam Francisco's remarkable steep hills and isolated in between high rise buildings that is mixed with commercial and residential.  \n\nLovely sight to be in!", "author": "Tiffany D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-25", "description": "Great little \"dog park\" high up on the hill. The Huntington Park is open for all to enjoy. It's a true treasure, but note it's one of the smallest parks in the city! Yet, I adore this park because of how well maintained it is and how it's tucked between The Fairmont and Grace Cathedral. \n\nHuntington Park is a \"family friendly\" park and of course \"dog friendly\" too. There's a small children's playground at one corner and a couple of early art deco fountains to enjoy. The park was formerly the site of the mansion of railroad baron C.P. Huntington (yup him again, he also has a waterfall in Golden Gate Park lol); his mansion was destroyed by the 1906 earthquake, however, and his widow donated the property to the city to establish a park in 1915, hence the park's name. \n\nThis is secretly one of my regular parks that I truly enjoy. Maybe because I used to live just a couple blocks away and enjoyed Grace Cathedral too. I quickly became a regular to just clear my head and watch the dogs and dog owners. Enjoy the little ones playing and actually feeling safe! The park's location being on one of the highest points in the city probably discourages the homeless away. I mean if not riding a cable car who wants to walk up vertical hills just for a park? Sorry just being real. One thing is certain I love how intimate it is, just make sure your pooch is on a leash & you clean up after yourself...", "author": "Eric R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-07-13", "description": "Huntington Park would be a great place to live if there weren't firecrackers, fireworks and M80s going off every night between around Memorial Day weekend and the end of September. This activity is illegal but occurs consistently and is only getting worse year after year - I have lived here since 2007. If you are a veteran, have pets, are a senior, or like a good night's sleep, be wary of the neighborhood you choose.", "author": "Leigh S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-22", "description": "This park is excellent and looks really cool during Christmas with the green & red lights. There's a lot of open space and the surroundings around the park is remarkable. \n\nThe surroundings are nice and it's safe to be in the park at night (past 9pm). Moreover, there are still people inside the park or jogging around the perimeters at night. The fountain in the middle of the park looks really nice too, especially in the evening.\n\nThe downside here is there are no bathrooms to use, but there is a water fountain on the street side of Grace Cathedral.\n\nI'm a bit disappointed that they built a new play-structure a few years back. They got rid of the swings and the monkey bars, but installed a ladder that curves 90 degrees to the ground.", "author": "Victor L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-11", "description": "What a wonderful little gem nestled at the top of Nob Hill in San Francisco. It was nice to find this grassy, quiet space. There's a playground for children and play space for pets. As a business traveler I didn't have either with me (sniff sniff) but sat and enjoyed a little serenity.", "author": "Nancy M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-02", "description": "This place is located right across from Grace Cathedral and there's a really pretty fountain to sit beside.\n\nIf you're looking for a nice spot to relax and take in some stunning architecture then I definitely recommend stopping by. And, if you're a fan of Armistead Maupin's Tales of the City this is kinda neat to visit lol It's a very cute spot and you get a great view of the rose stained glass window from Grace Cathedral.", "author": "Iron Man H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-19", "description": "Nice park to go to chill. Get your dog fix almost anytime of day and see plenty of canines around. Very picturesque views from almost every angle at the top of Nob Hill.", "author": "Peter C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-07", "description": "Great little neighborhood park where all the locals take their kids and dogs! It's clean and peaceful, doesn't feel weird or anything. Although there might be some sketchy characters walking around occasionally. I take my dog here during the day, because it's close to our hotel and there isn't a big crowd of people. Most people are friendly and nice. However, I definitely have never taken my dog out to this park at night past 8 pm.", "author": "Liz E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-29", "description": "Cute and clean little park, similar to ones you would see in movies: in front of a gorgeous cathedral, water fountain in the middle, plenty of benches and small patches of grass to sit on, and small well-kept kids playground on the side. Dogs are allowed on a leash. Street parking only, it was fairly easy to find parking for us. \n\nGood for: reading, relaxing with kids/dogs/tiny groups/alone \n\nNot good for: bbq's & large groups \n\nTips: \n-come during the holidays it's beautiful with Christmas lighting \n-walk down the street to the iconic Fairmont and Mark Hopkins hotels. Visit Fairmont during holidays for their signature gigantic gingerbread house in the lobby (must-see), or to the Mark Hopkins for cocktails with the most gorgeous views of the city at their top-floor bar Top of the Mark.", "author": "Ana Madeleine U."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-27", "description": "Magical park, especially during the Christmas Season.  The annual tree-lighting took place, tonight, a wonderful San Francisco tradition!", "author": "Kevin W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-06", "description": "A picture perfect park in Nob Hill that is kid-, couple-, singleton- and family-friendly.\n\nHuntington Park is situated on the most prestigious hill in San Francisco.\nSince the silver barons built their mansions here and the cable cars were created to ferry goods up & down, Nob Hill has had a refined vibe.\n\nHuntington Park replaced a historic mansion which most likely burned down during the 1906 earthquake. The park itself is an oasis of greenery which has children's swings, climbing structure and sand to entertain youngsters.\n\nThe fountain of the tortoises is a work of art.\n\nWhat a wonderful place to play while growing up! \n\nDog owners cordially greet other dog owners while their pets rub noses and sniff.\n\nOn a good day, bring a picnic blanket and sit on the grassy squares and peer West to Grace Cathedral; to the East is the Pacific Union club and the Fairmont & Mark Hopkins hotels.\n\nAt holiday time (which is now), the park is lit by green and red lights draped throughout the trees. Spectacular at night time.\n\nAn idyllic park. Any day. Any time. I love it.", "author": "Joanna T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-14", "description": "This is Nob Hill's posh park for dog lovers and kids.  I grew up in this park before it's upgrade.  The playground use to have sand and there was no child's gate surrounding the playground.  This park is so nice that I feel like walking into an English garden but without the flowers.  You will also hear the Grace Cathedral's hourly chime.  It's conveniently  located by the popular high class hotels like, Fairmont, Huntington & Mark Hopkins.  You also hear the California St. Cable Cars ringing along.  It's quite a peaceful park.", "author": "Angela W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-29", "description": "As parks go, Huntington is a small one. The best of this park comes from its locations and surroundings. It's a little square of (some) green atop Nob Hill. There's a fountain, a dog park, some grass, and that's pretty much it. But it offers up a nice respite after a hike up the steep streets. The views of Grace Cathedral are great, as well as the Fairmount and other chic hotels atop the hill. And if you angle yourself correctly, you can get some slivers of nice views between the towers off down the hill in a few directions. \n\nWhen it comes to city parks, I like 'em big and green. So this underwhelms on that front. But no matter what time of day you roll through here, there are some interesting folks. In the afternoon/evenings, it's the dog people and maybe some tourists. In the morning, I find folks up from Chinatown using it as a calm spot for Tai Chi or calisthenics. Different vibes at different times. \n\nFor me, a good rest spot on my way between SoMa and Russian Hill/Vallejo Steps.", "author": "Don B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-16", "description": "There's just something about being at the top top top of Nob Hill.  Oh sure, you'll hear the term \"Snob Hill\" thrown around from time to time.  Haters gonna hate.  I would advise that you're far better served to appreciate. \n\nLet's be honest.  The history of San Francisco and California is one of wealth.  You might not want to hear it, but this was a land settled by people who wanted to one day be the millionaires and billionaires.  People of all backgrounds came to take a run at the golden life - and for that matter, they still do today.  Standing at the top of Nob Hill, I think back to the titans of industry that created the San Francisco.  And, candidly, I think of the titans who continue to shape SF today.  Tech money comes and goes, but the fundamentals remain.  One fundamental that linked San Francisco to the modern world were the railroads.  It was a game changer to be able to come by rail instead of an epic ship voyage around South America, or a Donner Party like debacle in a wagon.  This park take its name from one of the Big Four railroad tycoons of the 19th Century:  Collis Huntington.  The park was donated by his widow in 1915, and it serves as a gorgeous spot to enjoy your day.\n\nThis is a relatively small park, basically one block on each side.  There are nice features like a central fountain, sculpture, benches, beautiful flowers and a nice playground.  But, it's the surroundings that make it.  Huntington Park is surrounded by such gems as The Fairmont Hotel, Mark Hopkins Hotel, Scarlett Huntington Hotel (yep, same Huntington), the Masonic Auditorium, Grace Cathedral, the Pacific-Union Club and of course the mighty California Cable Car Line.  This is an elegant little square that has played and plays home to some of the most important people in San Francisco.  Guess what?  You can come up here and be part of it.  I would contend that there are few nicer places to sit on a park bench and read a book, sip on coffee or just watch people playing with their kids or dogs while they pass through.  Take a few laps, look out over the vistas of The City.  Head whichever way downhill you wish, there are great places to venture off to.  Do yourself a favor - get a ride up!  It's steep hills on three of the four sides.\n\nIf you have never been to SF, I would put this on your list of places you should see if it's a sunny day.  Come and be part of history.  But, please, if you're taking the Cable Car up from downtown, don't do it at rush hour after work.", "author": "Adam S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-16", "description": "Not the SoCal city! This Huntington Park is on the to do of San Francisco's Nob Hill.\n\nA very pleasant place to sit in or stroll through. Early most mornings you can sit and watch ( or join in...) elderly Chinese doing Tai Chi. It sits between the Cathedral and the Union-Pacific Club, just west of the Fairmont and Mark Hopkins Hotels.\n\nThere is a small playground for those who have children in need of burning off energy.", "author": "Greg T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-12-27", "description": "Huntington Park is nice little park right in front of a pretty nice looking cathedral. \n\nOne night a few weeks ago my boyfriend and I decided to hit up this place after dinner. We circled a few times & couldn't find parking. We eventually parked in the garage right next to the park. Can't believe that there were so many assigned private spots for the church officials. It was kinda funny and yet kinda annoying.\n\nIt was drizzling that night but we managed to enjoy the view of water fountain and snapped a couple pics. :)", "author": "Amy C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-12-13", "description": "I used to love taking my dog here! Recently, the dog cliques have just become too exclusive, to the point where I feel like they only want their dogs to play with their regular doggy friends. I also feel like the park rules have become stricter. Guess that's what happens when the best kept dog park secret is let out", "author": "Frances P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-01", "description": "Whenever I'm in the area, I always make it a point to stop and spend some time at Huntington Park. \n\nDespite the grand surroundings, this park feels cozy. Especially with the orchard style trees that filter the noise of California street, I can have a relaxing time sitting on the bench, watching the very toned (and tanned) half naked runner stretching in front of the fountain or talk to one of the well dressed rich ladies who walk their Maltese poodle on the grass. \n\nAnd when you get tired staring at the opulent buildings around you, head inside Grace Cathedral to get a pick me up at Peet's Coffee, Snob Hill's best kept secret.", "author": "Janice C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-08-22", "description": "This is a pleasant, neighborhood park to sit and chill in. It gets a good amount of sun but can get a little breezy. Plenty of benches and some green, so seating isn't too much of a problem. But what can be a problem are the \"regular\" dog owners that come here with their out-of-control dogs. \n\nAs noted by others, they will usually let their dogs run around without their leashes, which can be bothersome since most are not properly trained (lazy owners let them run amuck- running into things, people and even jumping over benches just to fetch a ball) and there isn't a designated spot for the dogs to run around in. Another thing that's irksome is that these \"regulars\" actually believe that they own the park, and will actually attempt to get rid of you if they don't like your face. Can you say, mob mentality? Or how about, your shit really smells like your shit? Other than that, it's a fairly friendly park.", "author": "Kali C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-14", "description": "We came here to eat after we got food at a place that didn't allow dogs indoors. Since we found this place on Yelp, we expected it to be a typical park, but instead, we were greeted by many, many dogs. It was quite amusing to pass by a sign that said to keep dogs on leash and see pretty much all dogs off leash, but it was great to sit and see all these friendly little dogs run around. Obviously, eating here wasn't the best idea we've ever had since dogs came to us very frequently (then again, maybe it was a good idea). The park itself is nice with a little playground, and the people there were all super friendly as well.", "author": "Lily L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-23", "description": "Fully deserving of all the fine reviews! Clean, very well maintained, and some beautiful flora throughout.  Neat playground area for the ankle biters, and a nice fountain producing some soothing sounds . . . what a gem!\n\nCheers!\nRS", "author": "Rich S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-21", "description": "visiting from Los Angeles and stayed in the area. brought my lunch and sat here for about half hour. what a delightful park. playground for the kids, grassy area for the doggies and plenty of benches for onlookers. everyone seemed to enjoy their surroundings clean,safe etc... I can also see the Park from my hotel room, looks just as safe at nite. really made me wish my pup was with me !!", "author": "Sandra B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-31", "description": "Such a lovely park! I was in town visiting my sister, who lives one block from this beautiful park, and so I walked past this place quite often. On one of the days I decided to bring my sister's roommate's dog (Gracie) over to the park for a little socializing and fun. Oh man what a great time we had! Soooo many dogs at this park! and so many of them playing nicely off leash! There's a fenced section with children's equipment, swings and stuff, and then some grassy areas around for everyone else, including dogs. It's a beautiful park with a beautiful fountain in the middle and every human and dog we encountered was friendly and nice! Definitely a little slice of heaven! Go chill, bring your dog, your kid, your book, your friend, whatever! Lovely place.", "author": "Ally T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-14", "description": "Lovely park near Union Square\nThe park had a lot of benches for lounging around, watching the many dogs that can be found here (some without leashes) \nThere were also two playgrounds and little patches of grass all around the park. The park also had a couple of fountains for decoration", "author": "Andy H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-19", "description": "As a perpetual dog park creeper, I fully approve of Huntington Park. \n\nAlong with being able to see about 7834654923 million cutie pie pups in this somewhat small topiary enclosed park, it's got benches, fountains and well kept grounds, and the sunlight peeks through the cathedral to hit it just right, so you can feel like your basking in unseasonably warm San Fran sun. \n\nAnd though seeing the dogs is definitely my #1 priority along with being the main contributing factor for why I like Huntington Park so much, there is one thing that really caught my eye as I left the park that made me fall in love. \n\nThe stairs. \n\nThe park is elevated above the sidewalk level so the people with screaming, snot nosed children in double wide strollers that take up the entire sidewalk can't get up there, making it safe for single non-breeders like myself to enjoy a quiet afternoon of puppy peeping in peace.", "author": "Candice G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-26", "description": "Nice quiet park in the middle of SFO hustle and bustle to sit and catch your breath (after the steep climb up the hill) and enjoy people watching.", "author": "S A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-04", "description": "I and my dog coming here at least one time a day. \nThis place is really safe. Sometimes i go to there almost midnight for my dog.\nSome dog's owner are there too for same reason. \n\nReading a book, eat a lunch, take a nap,\nor just sitting.. If you need green and relax come to here. \n\nThis park is an oasis in the busy city.\n\nこの公園には沢山の人が犬の散歩にやってきます。もちろん、ただのんびりと座ってる人もいます。\nそんなに大きな公園ではありませんが、見晴らしも良く安全な地域ですので夜に行っても大丈夫です。", "author": "Ria D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-26", "description": "This is a pretty little park with a lovely view of Grace Cathedral right across the street. I wandered in and sat on one of the many benches, taking in the greenery and birds singing and the sound of the fountain, when an absolutely adorable little black poodle bounded up to me, curly ears flying, and leaned against my legs. An elderly man eventually came after her, and explained that this was Bella and that she did this all the time. I hope that when you visit this park, you meet Bella, too!", "author": "Jordan T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-12", "description": "It's nice here... and you're sitting in front of a giant, beautiful church. It's fun to people watch and see everyone's dogs.\n\nThey did close the playground part for renovations. And one elderly man looked a little disappointed as he held onto the fence staring longingly at the empty swings.. kind of creepy.", "author": "Angela L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-02", "description": "Lovely little park on the top of Nob Hill just steps from the Mark Hopkins, Fairmont, Huntington Hotels as well as Grace Cathedral. \n\nCan hop right on the cable car and take it down to Ferry Terminal Building if you're so inclined.\n\nI've stopped here quite a few times with my kid to enjoy the playground and sit in the benches soaking up the sun. People let their dogs off-leash here despite the signs, but I'm not going to make a big deal of that. Live and let live.", "author": "Joshua B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-02", "description": "Beautiful park in Nob Hill that is located next to Grace Cathedral. \n\nNice place to sit, take in the sun and relax... \n\nOn the California Cable Car line should you decide to take a trip here and not walk the hills surrounding Nob.", "author": "Maria C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-06-11", "description": "Decent park. Nestled right in the middle of this part of the city. The children's area is gated which is really nice but the whole dogs on no leash can be an issue. Considering that the dogs can easily go into the kids area because of the elevation of the ground where they usually are. As far as the playground, it's decent nothing too special. They have swings and slides with a little gym, but that's about it. If you're looking for a quant little park this is your place. If not, might want to look somewhere else. I also liked the little fountain in the center of the park, it was cute and I feel it added character. \nDownside to this park is that there are no public restrooms. You have to walk somewhere else to go.", "author": "Stephanie M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-03", "description": "It's a two-block, straight uphill climb from my apartment, but I love this charming park. Dogs are plentiful and the people watching is amusing. You have Grace Cathedral as a backdrop and views of downtown. On a sunny day, it's a great place to picnic with a book and your favorite friend.", "author": "Kim O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-15", "description": "This is probably the only decent park in the area, right in front of Grace Cathedral.  You can escape the hustle and bustle of Union Square by hiking up Nob Hill a couple blocks.  I had passed by many times before, seeing artists display art.  Tai Chi practicers and other local people from the area that are trying to relax.  I ate my lunch here the other day and enjoyed it thoroughly, even with the birds coming to bother me for food hehe.  \n\nThe benches seemed newly refurbished or built and it is very clean.  One thing that it does not have is a bathroom which I can understand they probably cannot keep because of the relentless homeless population that roams even this part of town.  Lots of overseas travelers coming by here as well because the Fairmont hotel is right next to the park.  I had a out of town-er come by and ask me for the nearest Cafe, and I just direct them to Bush St.  Wish I could have spent more time here, it was just too darn windy cold!", "author": "Kenny P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-09", "description": "Quaint and lovely. This park is tiny yet full of character. I used to live in this neighborhood a block away and I miss spending evenings here. Bring a sandwich and a friend!", "author": "Emily L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-24", "description": "I love this place! And more important Tie, my puppy loves it a lot!!\nAwesome people come there at any hour during the day, you will always meet friendly faces or tails :)\n\nGreat view! Good air! Best peace of green and quite in the middle of the city. Oh, and there is electricity on each tree, if you want to relax with your computer!!! :-)", "author": "Ayelet M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-29", "description": "Beautiful park to visit on a sunny day, with Grace cathedral in the background. There are ample benches, a water fountain, and a small playground for kids. A great place for couples or families to hang out in. If I lived here, I'd visit often. \n\nDespite signs instructing dog owners to keep their pets on leashes, dogs roam free here. I wouldn't sit down in the grass.", "author": "Ashton N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-21", "description": "Excellent playground on nob hill! Great play structures and not seedy at all :) my kids had a great time.", "author": "Meg S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-04-19", "description": "The day was so sunny and bright as we walked through the park.\n\nThe maid was still cleaning our room at the hotel so we needed to kill some time. \n\nWe started on the playground side of the park where some moms and kids were having lunch in the shade.  \n\nThe white blossoms were billowing and bright all around the park.  It was a quintessential spring afternoon.\n\nAs we approached the center fountain we grabbed a seat under one of the blossoming trees and people watched.  Its amazing how people from all walks of life can just sit there in complete serenity.  \n\nThere were kids playing in the fountain, well taking a Halloween pumpkin and dumping water all around the place.  It looked fun at least.\n\nSome local artists had some art up on display and we walked through and checked some out.  \n\nWith all the art up there wasn't as many dogs as I have normally seen here.  I love when all of the dogs are romping around and playing.  \n\nOnce a few years ago we took our dog out at 3am to this park.  One day you should come here in the wee hours of the morning.  Its so quiet.  \n\nYou wouldn't think such a place could exist in a hustling bustling city.  Its just wonderful here.", "author": "Ivy R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-17", "description": "Huntington Park is one of my single favorite places in San Francisco.\n\nActually, one of the best dates I've had was here, in part. \n\nThere are more than 40 benches around the perimeter of the park alone, so you'll always find a spot to sit. The landscaping is very classic and kind of makes me feel like I'm in the UK, especially being across from the gothic wonder that is Grace Cathedral. \n\nYou can eat your dim sum from Chinatown here in the morning and watch tiny old people do tai chi, or you can drink whiskey coffees here on a date in the late afternoon. Coming here is always a good idea.\n\nYou are wonderful, Huntington Park.", "author": "K M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-08-30", "description": "As a long-time resident of Nob Hill, this is my neighborhood park.  Fifteen years ago, I would have rated it five stars.  It was beautiful, well groomed, peaceful, and calm.  Mostly locals and a few tourists.  You could sunbathe on the grass or have a picnic.  You could sit on one of the many benches and read a book or work on your laptop without being bothered.  A few well-behaved, on-leash dogs made regular appearances with their respectful owners.  There was peaceful coexistence and mutual regard.\n\nSomewhere along the line, it became an (unofficial) off-leash dog park.  A lot of days there are more dogs running around than people trying to enjoy the park, which tells me the professional dog walkers have discovered this park and some of the locals have given up trying to enjoy it.\n\nSome months ago, the grassy areas were fenced off so that they could be re-sodded.  Then signs went up asking dog owners/walkers to keep their dogs on leash and off the grass, to not allow them to pee and poo on it, so that the greenery could thrive and the humans could enjoy the park to its fullest.  But none of this has been adhered to by the entitled dog owners/walkers.  Once again, the grass has that matted, burned out look from overuse and too much pee-ing and poo-ing.  The smell is horrific.  Too many of the dogs are off leash and very ill behaved.  They jump in the central fountain, then come out and shake themselves off, never mind if you are sitting nearby, dressed beautifully, trying with all your might to focus on your reading or your work or to just relax.  Forget bringing your laptop to take advantage of the public WiFi and to get some work done while sunning.  If you don't keep an eye on the animals, some of them will eventually run over to you and knock that laptop off your lap.  No one seems to be minding them.  Not their owners.  Not their professional walkers.  No one.\n\nThis is just a small neighborhood park.  There are frail elderly people, disabled people, and children trying to use and enjoy it.  A few weeks ago, I met a physically disabled friend there before heading off for lunch.  As she was waiting for me to arrive, several large, unleashed dogs approached her and jumped up in excitement and put their paws on her upper body.  It threw her off balance, and she had to struggle to remain standing.  We both love dogs, so we don't blame them.  But where were their owners/walkers?  Don't they realize they have a responsibility to the public to ensure their dogs don't hurt anyone and don't prove to be a nuisance to others?\n\nWhere are the enforcers of the leash laws?  Why isn't anyone in authority up there handing out citations at least twice a week and sending the professional dog walkers to larger parks that can handle that kind of dog traffic and off leash antics?\n\nI really don't like what has become of my formerly beautiful, peaceful park.  I feel very let down by my fellow humans and by the authorities who are supposed to be keeping them in check.", "author": "J D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-26", "description": "This park has a playground and a water fountain in the middle of it.  It also has a lot of dogs because many dog walkers bring the dogs here to play.  If you are a dog lover, you won't mind that almost all the dogs here are off their leashes (even though signs say to keep the dogs on leashes).  Surrounding the water fountain are many benches to rest on.  It is located directly across from Grace Cathedral.  A wonderful place to stop and have lunch like we did!  There is also free parking in the area.", "author": "Janet E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-14", "description": "Beautiful place to come and clear your mind and surround yourself with cute pups, both big and small.", "author": "Dallas S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-13", "description": "My first stay in lower Nob hill after many visits to San Francisco.  It's not far but it's a climb up to this park.  \n\nIt has a decent fountain and park to sit and relax with a playground for kids.\n\nIt's next to Grace Cathedral, Huntington Apts? and is really a nice view of the city if you stand by the road.  Friendly residents sunning or tourists on the way up or down the hill are who you would see here.  It's also next to an old club.  Snobby hill is more an apt description of the area because of its former and current residents being on the wealthy side.\n\nIf you need somewhere quiet away from the hustle and bustle of Union Square and a higher view of San Francisco, this is a good spot.  Bring a sandwich and a drink and relax.\n\nThe climb down was much easier on this tired knees.  Next visit, I will bring Apricot and Brian up here for a nice break.\n\nOh and it is on a cable car route so if you can't stand the climb, take the cable car back down.", "author": "Melanio F."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-07-24", "description": "I love this park, especially considering it is 2 blocks from my home, but the dog issue is really out of control.  I have lived in Nob Hill for 6 years and its just getting worse.\n\nThere have been multiple incidents involving off-leash dogs biting, knocking down, and mauling both children and other dogs and neither the city nor the owners seem to care enough to do anything about it.  \n\nThe grass has to be constantly watered because the flood of dog piss is too acidic for it to survive.  The fountains have become a giant dog bath and are littered with fur and funk.  There is crap all over the grass that isn't picked up by dog owners who break the leash law.  It's just gross.  9 out of 10 times I ride the cable car I hear a Local describe Huntington Park as The Dog Park.  Awesome.  I see connections on Facebook who live in the Sunset and the Richmond district BRING their dogs to Huntington Park so they can run off-leash.\n\nQuite a shame, given the history and the location of such a potentially beautiful park.", "author": "Hannah A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-09-22", "description": "Did these people who have reviewed this park previously actual sit here or just wander through? It's cute scenically, but smells strongly of urine. Very difficult to sit and enjoy. And all the views of the city below are blocked by the large hotels and apartment complexes.  Maybe downtown standards are low comparatively, but if you have the time or opportunity you're better off making your way to Crissy Field or the Presidio for a better taste of what SF has to offer.", "author": "Sarah R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-08", "description": "I work out at this park nearly every morning.  There is ample space for dogs to play, a brand-new playground for children will be opening very soon.  The fountain in the middle of the park is pretty cool.  You can often see groups of humming birds flying up to and taking sips from it. \n\nThere is a fairly large group of regulars that I see every time I'm there.  They love to practice thai-chi and such.  Everyone is super friendly here, I've never really encountered any weirdos like some of the other parks in SF. \n\nThe park itself is directly across from Grace Cathedral, which is a pretty stunning looking building that looks gorgeous at night time. \n\nIf you like dog watching, I definitely recommend coming by Huntington Park, you will see ample variety of different kinds.  \n\nMy favorite memory here, a pug meetup with ~30 pugs playing with eachother.  Amazing.", "author": "Ryan V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-16", "description": "Close to my apartment and I get to watch pups run around when Im here! Plenty of benches and grass areas to sit or lay down on. Added bonus for it being near the Cathedral so that you can easily run in to use their restroom. Pet owners here are usually responsible and I have yet to step on any \"cow patties\". Oh and you get great views here too!", "author": "Michelle C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-23", "description": "I love stopping by and parking myself on a bench for a little breather from the City to enjoy the fountain, people and dog-watching, art, children playing, birds and butterflies.  It is an oasis in Nob Hill, forever loved.", "author": "Maile N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-02", "description": "This is one of the best parks in San Francisco I found that is on top of a hill.  This park has really great views. You can see part of the Bay Bridge from this park. This park is really nice.", "author": "Isaac H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-10-29", "description": "This park would be great if the entitled bitches didn't go here. Oh, and if you are entitled that still means you have to clean after your DOG! I used to be a regular and still make it there since my baby girl only likes the plush grass to do her business. So I heed all her demands, and it's nice that she goes on grass and doesn't go near someone's front door or by their window. As a responsible owner, the latter is a very important to me!", "author": "MoMo A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-08-20", "description": "Situated smack in the middle of some magnificent turn of the 20th Century buildings- Grace Cathedral, Fairmont + Mark Hopkins Hotels, and the Crocker Mansion, this one block formal four square garden features a centrally located fountain, children's play area, lots of park benches, and good size grassy areas for sunbathing and dogs.\n\nThis park now sits where the mansion first owned by General David D. Colton, a railroad attorney and then by Central Pacific railroad baron Collis P. Huntington resided until its untimely demise in the Great Earthquake and Fire of 1906.  In 1915, the land was donated to the City of San Francisco to be used forever as a park which has seen numerous renovations but the well loved children's playground still has yet to be updated.\n\nOne of its centerpieces is the Fountain of Tortoises which is surrounded by many benches shaded by cherry trees.  It's a surprisingly quiet and peaceful place to read the paper and eat your lunch and people and dog watch as they strut by. Lots of dog owners come here to congregate, chat and let their dogs roam some.  Maybe because it was a warm day, a couple of cute and big Golden Retrievers jumped into the fountain to cool off and stayed in there forawhile.\n\nA fine patch of green to soak up the sun.", "author": "Jen L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-30", "description": "If it's a nice day in SF you'll find the park packed with people and dogs. Lots of room for dogs to run around and plenty of benches for their owners. Yappy hour on Fridays is a great time.", "author": "Shelby R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-10-18", "description": "You can drive up, MUNI up, or Cable Car up, but I usually walk up to the park. From Mason Street, the hill is ridiculously steep, from Taylor Street, even steeper. So steep, there are steps on the sidewalk! If your legs and lungs can handle it, go for it. I grew up coming to this park, so the walk up is no biggie to me. My out-of-town friends were actually the ones who pointed out how abnormally steep the surrounding hills are. Still, I think the walk up is part of the attraction. When you reach the top, look back at what you've accomplished and you'll notice a pretty darn good view!\n\nAgain, I grew up coming to this park, so, I love it! It's small with a couple of playgrounds and a couple of fountains. I went from the little kids' playground to the bigger kids' playground. I used to climb around the fountains AND my Mommy used to let me!!! I recall staring at the many penises of the fountains and getting a kick out of it. I recall stealing coins from the large fountain, while trying to duck from my Mommy's view.\n\nAs an adult, after many years of not visiting the park, I went one night while drunk (seems like I used to do A LOT at night while drunk) and swung on the swings. It had been awhile since I even sat on a swing so you know I had a ball. We couldn't stop laughing...hard, stomach-crunching laughs! Of course, I've returned many times after that night. I can't recreate the laughter of that first night back, but I still have a great time each time. Ooh, I think San Francisco vampires congregate here! One night we saw a young woman floating by with a hooded black cape and a candle. She stared at us while gliding by...kinda spooky, but totally worth seeing again!\n\nAlthough fun and nostalgic, it loses a star for being located in such a boojie area. Not a lot of selection for food. Sometimes I like going to places and having last minute picnics. Not enough affordable options in the area for that. Boojie doesn't stop there...the No Ma'am Club that's located right by the park, ew! Beautiful building, but after working this many years with the homeless and extremely low-income population, seeing how rich folks spend their time and money kinda piss me off.", "author": "Helen L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-18", "description": "My friend and I always joke that for having so many dogs, SF really isn't dog friendly. In fact, the only places that really allow dogs, I've come to find, are the TL/Lower Nob apartments. Furthermore it's amazing to me how this area can have so many dog friendly apartments, and no actual gated dog parks. Anyway, my puppy and I have just started coming here, and I'm finally okay to let him off leash. \n\nI love the area because it's clean and open. My only concern was that the park goers might be offended that I let my dog off the leash in a \"dogs must be on leash\" park. But it looks like they're all okay with it. Many people just enjoy watching the dogs play too.", "author": "Raquel R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-01", "description": "I love jogging here at around 12 midnight to 1 am on a Saturday night because it is completely empty. The peacefulness is amazing and you're basically the only person around the neighborhood. I also go around the fairmont hotel and go down to the hill and run back up for a more challenging exercise", "author": "Leslie M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-08-05", "description": "Not a bad park if your little manicured pooch needs a quick respite from being cooped up all day in a nearby flat or visiting with their humans at a local hotel.\n\nPretty.  Cute.  And slightly more formal, this offers visitors and locals to saunter by and take a short rest from the concrete mess surrounding us.  I found it especially nice, when I had to escape from a formal event at the Fairmont and took off the heels for a nice walk in the moonlight.", "author": "Miika M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-05-13", "description": "Lovely little park complete with ample benches, a fountain and a playground. Great location right next to Grace Cathedral, often full of people sunbathing and reading on nice days. The best part: cute dogs everywhere!", "author": "Chelsea B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-04-15", "description": "Every now and then I feel guilty about raising the kid in a studio apartment with zero outdoor space. Twice a year we visit Grandma and Grandpa in L.A. and the munchkin gets to experience an enormous backyard with fruit trees, grapevines, a gazebo, flower gardens and a fountain; for months thereafter I have to listen to whining along the lines of \"Mommy, I wanna move to Los Angeles!\" and \"Mommy, I wish we had a backyard!\"\n\nNow that she's getting older and wiser, she's starting to understand when I explain that, while we may not have our very own backyard, we DO have four parks within a 10-minute walk from home. So, in essence, we have FOUR backyards.\n\nThe most scenic of which is Huntington Park.\n\nHuntington Park is a postage-stamp-sized park at the foot of Grace Cathedral and the Huntington Hotel. The kid doesn't remember, but there are pictures of her in the \"baby swings\" at 8 months - all chubby thighs and new teeth and hanging on for dear life - then, 4 months later and just days away from her first steps, propped up against one of the fountains in her birthday dress.\n\nSince then she has grown to brave first the slide and then the jungle gym by herself. Most recently, a few days ago, she surprised me by going back and forth across the monkey bars with no spotter.\n\nRight now the trees are blossoming. In 6 months or so the leaves will turn. A couple of months after that the trees will be decked out with colorful Christmas bulbs...the big, old-fashioned kind. There isn't a day of the year when the park isn't beautiful in some way.\n\nLucky for us, it's practically right in our own backyard.", "author": "Valeria R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-17", "description": "My good friend, considered \"god father\" to my pups if that exists lives 30 seconds away lol. So, when I make the trip we bring our 3 dogs to hang out here. SO CUTE and such a pretty place to sit and unwind or have a secret panic attack (no gates) for your dog.", "author": "Sweets N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-09", "description": "Nice, safe park during the day and even safe at night. It has great views and is relatively quiet. In a beautiful setting of nob hill. Heads up, during the day it is primarily a dog park and people don't clean up after their dogs so it can be challenging to find a good spot in the grass to enjoy a sunny day.", "author": "Brittany S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-19", "description": "About as many dogs as people. Great place to sit and read on a beautiful day. I caught the occasional whiff of urine, but that's not much different than anywhere else in the city...", "author": "Kathleen M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-11", "description": "I used to work in Chinatown, and came by every now and then during lunch time. Walking up the steep hill to get to the park was bad, but it took only a 5mins, and all worth it. The view is nice and relaxing.  The park is dog friendly, lot of them come here to play and they are all cute. This park also has a playground for kids. Very friendly park to relax your mind!", "author": "Ann H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-04-23", "description": "My favorite park in the entire world. Well I haven't been to everywhere in the world but this is my favorite park. I grew up a block away and use to come here and play all the time. I love that it is a clean and also has a water fountain surrounded by benches where you can just sit and dog watch. I love dog watching here. When I was little I was able to Easter egg hunt here. It was one of my fondest memories. \n\nYou can find me here on some afternoons going on a jog. I also love how it is right next to Grace Cathedral with the Fairmont and the Top of the Mark. I like how when it is a nice day you get a nice view of the bay. I love it here! \n\nIt is soo pretty here during the evening time during Christmas. I like how they put lights in the trees.", "author": "Sarah C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-26", "description": "There are some great people and great dogs that frequent this small park.  My dog loves it.  There are benches to sit and relaxing fountains.  It's nice that there is a section of the park for children with slides and things (even though there are very few children in San Francisco).  If you don't like dogs, don't go here. If you love dogs, but let yours run wild you should also stay away.  The park is technically \"on-leash only.\" In reality, that's not the case. Most people take their dogs off leash (it really should be an off leash park), but if you do just try to be respectful.", "author": "Justin H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-29", "description": "Beautiful park at one of the highest points in Nob Hill.  Lots of dog walkers here, also lots of folks doing Tai Chi.  Lovely large fountain in the center.  Right across the street is the Grace Cathedral with its inside and outside labyrinths.  I highly recommend you visit both.", "author": "Pete J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-11", "description": "A nice little hidden gem in the middle of the city.", "author": "Mike R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-02-19", "description": "I need to take advantage of this spot more often.  What a gem.  Particularly on a sunnier day in the city, the sun hits you at the right spot, lovely and warm.  You're surrounded by Grace Cathedral and the Union Pacific club, and there's usually ample bench seating.  Always seems to be full, but not crowded.  Wonderful spot to just relax, read, really whatever you'd like to do.", "author": "Mel G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-18", "description": "This is a fantastic park if you have a dog in the city! The location is beautiful and the park is well maintained. Most dog owners are responsible about cleaning up after their dogs and I've never had an issue with the off leash dogs.", "author": "Tina P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-01", "description": "On our way to the tiki lounge at the Fairmont, we came across this park near Grace Cathedral. I plan to make the long uphill trek to Huntington park to read, relax, and people watch. \n\nThere are many benches to sit, interesting statues, as well as a playground sadly marked as only for children.\n\nLots of people playing with dogs and enjoying sunshine.", "author": "Andrea B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-10", "description": "Really beautiful park, despite the awkward looking turtles on the fountain. This park really comes alive at night. Really great vibes. All in all, a great place to just unwind or have a date.", "author": "Carlos R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-31", "description": "Perfect place to sit in the sun and watch the dogs play. Beautiful fountain too.", "author": "Tim R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-04-24", "description": "I pass Huntington Park frequently but yesterday in the late afternoon I decided to stop in and get a closer look. I had hoped to swing on the swings but they were occupied with children so I simply took in the scenery --- well-groomed folks with their equally maintained dogs, the gorgeous \"Fountain of the Tortoises\" (fully restored to the tune of $400,000), the towering hotels that surround the square. With sixteen benches, there's plenty of room to sit and think.", "author": "Miriam W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-17", "description": "Not a huge park, but its in the middle of lots of interesting places, and the fountains are really great.", "author": "Alf O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-06-03", "description": "I was staying a few blocks from here, and the five star reviews for Huntington Park kept coming up in my searches of things to do in the area. It seemed kind of weird for a park to be reviewed at all, nonetheless to be so highly regarded. I had to stop by.\n\nIt was a great experience. I came by and sat on a bench for an hour after lunch on a Wednesday. The people and dog watching was top notch. The park is beautiful, peaceful and pristine. Some of the nearby buildings are striking and provide an excellent backdrop. \n\nIf I lived anywhere near this place, it would be a daily destination for me.", "author": "Joseph B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-06-19", "description": "when i live on Bush and Powell I would ALWAYS take gus here. It would be my favorite spot to just chill. Buy a burger at Jasmins, come here and let him play with all his friends. \n\nSince we moved we haven't had as much time to climb the hill but we will be back since the weather is getting nice! LOVE IT HERE\n\n\nAnd during christmas it's sooo gorgeous with all the lights :)", "author": "Amanda S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-17", "description": ". My toddler loved the play area.  the people didn't look crazy. Some of the dogs were off their leash but the owners seem to be attentive to them. One thing is that I didn't let my toddler on the grass area because I did notice some doggy poop, that's the only down side.", "author": "Natalie S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-02-05", "description": "A lovely park situated in the heart of Nob Hill, next to Grace Cathedral, Huntington Park shines as an immaculate destination for when you want to soak in some afternoon sunshine to wash away what ails \nyou--or for when you need an evening stroll to contemplate what lies in the stars for you.  It's also a safe place to let your little ones run around--no matter what their persuasion, canine or kid.  And during the holidays, Huntington Park becomes all decked out with red and blue lights that are so sweet, they'd warm the heart of even the coldest Scrooge.", "author": "Shadi G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-07-18", "description": "This is a lovely sunny little park, with manicured lawns and gardens. Grace Cathedral makes a grand border on one side.\n\nThere seems to be no park that you can't bring your dog and let them run wild. I guess that SF dogs are well behaved or you couldn't do this. They're certainly v. cute. I love to watch them, and they always come up to sniff your acquaintance.", "author": "Ed R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-05", "description": "Beautiful park with peaceful fountains and a great place to spend a sunny day! Watch out for a small pug named Sampson though, he'll eat your entire picnic if you're not careful!", "author": "Eric S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-01-25", "description": "This park is really nice. I pass it a lot on the way to/from work. There's always somebody with a dog walking around this place, but they seem to be a thoughtful lot, since there's not a lot of poo lying around for me to step in. 5 stars for that alone.\n\nPopular spot to bring the kids, also a good place to take a stroll with a date. I've come here when I have a dinner appointment at any of the hotels on the hill, just to get some space and fresh air.", "author": "Wes T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-02-08", "description": "You'll love this park if you... have a dog, have kids, like people watching, enjoy peace and quiet, don't mind walking up a big hill. \n\nWe frequent this park at least twice a day. I feel safe at noon or midnight. Clean, quiet and beautiful. One of my favorite places in the city!", "author": "Emily B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-07-22", "description": "Huntington Park is an ideal find when you need the space and time to clear a worried mind. \n\nSandwiched between the Grace Cathedral and the famous Fairmont Hotel, it is the perfect resting spot after a strenuous California Street walk. Cable cars cruise by as the bright bay glistens from behind Nob Hill buildings. Underneath it's grand surroundings, the park appears small, cozy, and welcoming to a winded walker.  A well kept garden and cherry blossom trees border a beautiful flowing fountain. Dogs, artists, and other travelers company you as you enjoy the view. \n\nMake a wish and throw a penny into the fountain's large water dish - send your worries away.... and make it a lucky day!", "author": "Caroline J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-04-06", "description": "This is a nifty little park right in the heart of SF's downtown district. It's small, but quite picturesque with its symmetrical landscaping, bubbling fountain, and charming wooden benches. A beautiful place to sit back, read a book, and experience a lush hilltop breeze. I subtracted two stars only because I need a park that accommodates my dog's excessive energy. It's a good place for a canine meet and greet but there really isn't any open terrain for a good, exhausting romp.", "author": "Bianca F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-02-07", "description": "I stumbled across this park while heading over to the Grace Cathedral. It's a nice, clean, well kept park! I noticed some people sun bathing on the grass too.", "author": "Ron B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-04-17", "description": "Beautiful and gorgeous little park right at the top of Nob Hill; it's the view i get from my apt and I love looking out the window!", "author": "Jocelyn L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-07-16", "description": "Ever since moving down the street from this so-called \"park\" I have slowly but surely become a \"fan\".  Yes, this park is small, and yes, there are lots of dogs, but that's what gives this place its charm!  There's nothing like grabbing a beer, taking a squat on the grass, and watching the dogs and children play in the sun.  This place can get windy and wild.  Don't bring your cats or hamsters for they will get destroyed by the doggies! Sometimes the park holds lame car shows and painting sales, so avoid those days unless you enjoy hanging out with men and women over 80 years old (which I do).  \n\nI was actually attacked by a ferocious pup while enjoying a novel on the bench.  The damn dog nearly bit my fingers straight off! Luckily he just tore my book apart before the damn dog's owner grabbed the damn thing and walked away without the slightest apology.  What a straight jerk!  -1 star for that experience. \n\nOverall, this park is quite beautiful, unique and surprisingly peaceful despite being surrounded by the tall buildings of the city.", "author": "Scott G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-05-18", "description": "I don't know about all of you guys, but the one complaint I have of this city is it's ability to make me the pastiest I've been in years. So on those days when the sun is actually shining AND warm enough to lay out w/ out freezing my patootie off, I'm on the prowl for a place to hunker down and get my melanoma on. Since I no longer live near my beloved Golden Gate Park (or have rooftop access) I have found a new sunbathing haven which even tops my former beloved: Huntington Park!\n\n+ Grab a book--it's quiet enough to read here. There is a playground but there aren't enough kids here (or at least their Nob Hill-ite parents/ nannies wouldn't let their progeny run too wild) to make it irritating.\n+ Grab a blanket/ towel--or sit on one the MANY benches they have. The grass is considerably clean. I haven't encountered any poopies, cigarette butts/ roaches, or broken bottles of Steel Reserve (ahem, Dolores)...yet. This place seems too frou frou for any of that malarkey (I know that's not the correct use of the word but  it just sounds so good!). \n+ NO CREEPERS taking pictures of you while you sleep/ sunbathe (ahem, GG). Gross. I still shudder at the memories I've tried to repress.\n+ Great views (Grace Cathedral, cable cars, etc.)\n+ Dog-watching/ stalking (for all you pup-o-philes who aren't allowed to have their own at home)\n\nBask in peace at Huntington Park. I've found my new haven in the city...swoon...", "author": "Kristine W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-07-22", "description": "Not as much a park as it is a combination of a bunch of cozy common areas - some grassy sections, some benches surrounding a fountain, a playground for the little turd cutters, and view of the Grace Cathedral. Bunch of dogs like to bring their humans there and occasionally some people will try riding their bikes around the fountain. Whatevs.\n\nThey occasionally have art fair(e)s as well as wedding receptions, which I find ill-conceived what with all the dogs running around and the dudes riding their bicycles along footpaths. One time this dog got a handle on the couple's apps or something. It was pretty funny... for us, of course. The wifey was not stoked. \n\nGreat on a clear day. Bring a bottle of wine like all the other folks... maybe an iPad or yer Kindle, son...", "author": "Roy M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-08-12", "description": "I know this isn't intentionally suppose to be for dogs but it's quite popular and filled with dogs running off-leash. It has a nice little fountain in the middle and plenty of different size dogs running around while their parents sit on benches or chit chat with other dog owners. \n\nThis is the ideal city life dog park, only one around the downtown/nob hill area. Lots of green grass for your furry friends.", "author": "Tam T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-02-23", "description": "Word,\n\nWhen I first moved to San Francisco my apartment was two blocks away from Huntington Park. I went to this park religiously as a way to escape my crammed apartment.\n\nI call this park the \"Land of the Mini Dog.\" This is where all the bored housewives take there dogs to and because of strict apartment rules they all have small hairless dogs like Paris Hilton's little scnousher. \n\nMany of these women at this park seem to have baby issues, meaning they want a baby, but for some reason, perhaps due to the predictament of their marriage or uncommital boyfriend can not have one. Thus these women substitute their dogs in place of their baby desires and dress their poor dogs in silly hats, jackets and bows. I believe I even saw shoes on a dog once.\n\nBesides the locals the park is very nice, although small. The park has a front and center view of Grace Cathedral. It also a nice fountain which The Dude, would say, \"Really ties the park together.\" It also have a little playground perfect for kids or adults who still act like kids (myself included) and want to go on the swings.\n\nA cool park to stop by to if your in the area, although not necessary worth a hike across town.\n\nyups.", "author": "david h."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-08-31", "description": "With Grace Cathedral right here, this is a good place to explore one of the 'high' points of San Francisco - cresting the hill and going over to the Chinatown/North Beach/Fisherman's Wharf area are convenient from here as well.", "author": "Denise N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-06-14", "description": "http://www.youtube.com/watch?v=bSX73YsJrqc\n\nmagical.  thank you, arabella.", "author": "Noel J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-11-03", "description": "I generally love urban parks/squares and Huntington is no exception. Probably my favorite park in SF (that I've been to). Great sunshine and has a playground for my 5 year old. Surrounded by beautiful architecture and situated in a place that is close to many of my other favorite locations.", "author": "Ben W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-09-14", "description": "On a sunny day, this park feels like heaven, and even on a crappy day it can't help but give your soul a breath of peace.  That's because it's a perfect little piazza and park combo: great for people watching and meeting as well as contemplative quiet, all overshadowed by Grace Cathedral's majestic spires and windows.  \nStroll around the park to take in the statues, the fountain, and the scary/beautiful trees (depending on the season).  Grab a central bench seat to watch the dogs and their owners in the afternoons or a side one for some quieter reading.  If you need extra meditation, just go across the street to Grace's labyrinth, fountain and gardens, which are perfectly quiet no matter how many dogs arrive in Huntington.", "author": "Alison M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-10-23", "description": "When I told my workgroup about the weight-loss effects of my lunch-hour hill climbing, suddenly everyone wanted to get on board.  The manager made it an appointment, and labeled it \"walking tour.\"  That inspired two consultants from Bangalore to tag along, and today I found myself leading a party of four up Nob Hill.  \r\n\r\nThey did quite well on the 350-foot (100-metre) climb up California Street from the landfill to the hilltop.  I was quite impressed!  I gave them a little background on the Big Four, and we walked into the park itself, in front of Grace Cathedral.  The top was pretty flat, and the green lawn was soothing to the eyes.  I hadn't gone all the way up to the park on my regular circuit, so I found relaxing at the top to be a nice reward for me, too.  \r\n\r\nI let them vote on our return trip, and they decided to go down Powell to Union Square.  Now we are building a standing date to go hill climbing during the lunch hour!  \r\n\r\nP.S. 200 reviews!  Yay!", "author": "David D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-04-18", "description": "How to describe my favorite place to spend a sunny Sunday afternoon with out sounding cheesy? \n\nI live 1 block from here so I spend a lot of sunny weekends laying out and reading or listening to music here. Clean, safe, great place to lounge with your \"beach sheet\", book, IPod and a lunch. You can lay out in the sun or under a tree. Fantastic views of Grace cathedral and the Fairmont Hotel. Hanging out here on the weekends is a great way to \"check out\" for the day. \n\nBeware to those who are not dog friendly. There are dogs running all over the place with their owners. I think its great! If you don't own your own dog the ones running around are usually more then happy to play with you.", "author": "Jessica R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-09-02", "description": "This is my favorite park in San Francisco. It is not because of the playground sandbox, and Cherry Blossom trees. But, because of the rich San Francisco history here. I love diving into history.  So ladies and gentlemen let's pretend this is the history channel for a moment.\n\nThis dog friendly park is on some of the original land owned by the barons who ruled over San Francisco, California, and the entire Western United States for that matter. They controlled the Transcontinental Railroad and as a result they all became very rich. They were called the Big Four and they, along with their attorneys, (yes it was even happening then), controlled the wealth. \n\nC.P. Huntington, Leland Stanford, Mark Hopkins, and Charles Crocker. These men played a big role in making San Francisco the New York City of the west.  Los Angeles was actually a smaller city during these times.\n\nThe land which Huntington Park sits on was owned by Huntington and before that the Colton family.  General Colton was an Railroad attorney who lived in style and splendor in a giant wooden mansion on this site until he died in 1878. After his death, his widow decided to close the house and move to Washington D.C..  \n\nIn 1892, railroad baron and one of the \"Big Four\" himself, Collis P. Huntington purchased the mansion.  Yet he was only able to enjoy this place for eight years, as he died in 1900. The mansion was later completely destroyed and gutted by the 1906 earthquake and fire. In 1915, his widow Arabella, donated this land to the city under the condition that it would remain a city park for perpetuity.\n\nHence, the birth of the Huntington Park.  A beautiful replica of the Roman Fontane delle Tartarughe, (Fountain of the Tortoises), which was donated by the Crocker family children in 1954, resides in the center of the park. The Crocker family once owned the mansion and land which is now occupied by Grace Cathedral.\n\nThe park is surrounded by both Grace Cathedral,  and the bizarre, \"eyes wide shut,\" Pacific Union Club Building, which was formerly the Flood Mansion. This building is now home to a private conservative club . But it is cool to note that the Flood mansion was the only one to survive the 1906 earthquake. When you get up close, you can see why.  It is a huge stone fortress. Creep up the steps and peer in the glass.  You might get a glimpse of Dick Cheney lurking down a dark hallway.\n\nHuntington Park is my favorite city park because when I'm here, I can sense all this city history. You can feel it in the gentle breeze. It also gets an ample amount of sunshine and is in close proximity to San Francisco's most beautiful hotels.\n\nMy routine is to stroll into the park with my morning cappuccino and take a seat by the fountain, while watching my chinese neighbors march and stretch out their morning Tai Chi, as the sun burns through the fog behind the Mark Hopkins.", "author": "Georgio N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-10-07", "description": "It's a great park for dog owners but a nightmare if you have children. My kid was attacked twice by dogs and was hurt the second time around. You might want to look elsewhere if you are a parent.", "author": "Randy S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-05-31", "description": "I pledge allegiance to Nob Hill. Even living on the moon cant beat Nob. Gorgeous views, prestigious zip codes, so urban-'close to everything' - this neighborhood in SF rates even higher UWS or SoHo/Tribeca. In the heart of Nob is Huntington park on California Street - standing proud overseeing the Financial District and the Bay.  Have a drink at the University Club (free parking if you're member) on a fine Saturday afternoon and enjoy the sun in Huntington Park. While you relax, watch the california line cable cars ding-dong or new-in-town drivers hustling to get through the serious hill.\r\n\r\nAlthough it's a bit small and very pet-friendly, this place ranks high in one of the must see SF visits.", "author": "Sav B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-02-26", "description": "A block from my house makes this the closest and most convenient dogpark for Lexie. (minus one star for the annoying tourists and the annoying uphill trek for me)\n\nVery pretty scenery and since its so small it forces the dogs to really interact with each other. Lexie doesn't really do much playing but enjoys chasing other dogs while they play.. \n\nI like the art exhibitions they have on weekends. It really nice to go to on a warm and sunny day.", "author": "Sarah W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-08-05", "description": "LOVE this place. it reminds me of some of the parks i'd go to with my dog in nyc, only it's clean and has a gorgeous view:)\r\n\r\nwonderful fountain, and the bells of grace cathedral ring...", "author": "Jacqui M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-02-01", "description": "HP (not to be confused with the other HP Hunters Point) is probably the best place to go in San Francisco hands down. The view, the church bells, the cable cars, and what must be a motion censor around the park keeping my nemisis - the homeless - out. \n\nIt is the one and only thing I miss about SF (other than the fab friends I have) and without it I probably would have moved out of SF sooner.", "author": "Lauren B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-12-15", "description": "We live a block away from the park and frequent it often.  You will generally find Tai Chi and Chi Gong practiced regularly, with a few home-made wacky exercises going on as well.  \n\nIt's a great place to sit on a bench and enjoy the tourist and local hubbub.  With some restraint, sharing a bottle of wine or such is fine.\n\nThis is a well-used dog park, and is the central dog hub for Nob Hill and Tender Nob residents.  There's usually a collection of big and small dogs, with a good chance of some carrousing and puppy play to be had. \n\nIt's officially an on-leash park, but when the crowds are low, the dogs (who are never really very law-abiding anyway) escape their bonds and run around like, well, like dogs. \n\nOn vacation? Miss your dog?  Stop by for some dog time and relieve the guilt.\n\nRelated note: It's not a great place to have a picnick or frolic barefoot in the grass!", "author": "Pete G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-29", "description": "I was having a rough day, and thought I'd take a stroll in the park...and yelp, I saw dogs!  Apparently this place turns into dog park central after 6.  Dogs make me happy.\n\nThis is a delightful manicured garden smack dab in the middle of Nob Hill.  This is a great place to read, relax, or stroll.  There is lots of great architecture to feast your eyes on including Grace Cathedral.\n\nThis plaza-esk park sits above the street, slightly removing you from the city.  Not in a \"non-smoking section\" kind of way, but in a \"I'm on an awesome houseboat\" kind of way.  I'm so a fan.", "author": "Jenn T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-01-21", "description": "I come here and I:\n-Sit with my husband under the blossoming trees and smoke frenchy cigarettes and drink  the lovely southern oregon merlot in my commuter mug.\n-Sit with my husband under the trees bedecked with christmas lights and admire the fog rolling around the fountain.\n-Sit on a blanket in the sun and read the Sunday NY Times.\n-Play on the swings late at night when the children are gone.\n-Throw pennies in the fountain and make wishes.\n-Admire all the expensive pure bred pups and wonder where in the world their owners keep them in this City.\n-Share champagne with neighbors and tourists on New Year's Eve.\n-Peep into the windows of the surrounding apartments and wonder why I don't know anyone with a fabulous apartment like that.\n\nThis park is clean and never smells like pee.  If you live on the downward slope, then it's a good reward for the hard work you will put in to get up here.  This park is peaceful and manicured and makes me feel like a French princess.", "author": "Robyn C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-04-11", "description": "Two blocks from my house and the perfect place to take my dog to socialize with other wacked out city pooches.  Check it out any evening from 5:30-7pm (weather permitting) to get your puppy fix.", "author": "phil h."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-08-28", "description": "In the heart of the city.  Come here to tap into all that makes San Francisco special.  A great place to relax, read a book and hear the sounds of the city like the clanging of the cable cars, the chiming of the bells of Grace Cathedral, and the squealing of the tires of the cars driven by the tourists as they try to make it up Taylor street.  While the dog owners who frequent this park are responsible, they don't exactly get down and scrub when picking up after their pets so sit on the grass at your own risk.", "author": "Nosniv X."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-02-19", "description": "quaint little park. great for locals and tourists alike. very chill. very clean. well kept. well groomed. green grass. fountain at the center. small kitties area with bars, swings & sand. peaceful.\n\ni like to hang out and watch the dogiez. if your really on the in you can join the chinese ladies for exercises in the early AM. the streets have a little hustle & bustle but the overall vibe of the park itself is relaxing. the architecture of the surrounding neighborhood, church and hotels make you feel like a million bucks even when your pockets are empty.", "author": "BadBanana B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-11-12", "description": "I love this park.  So does my dog.  I remember walking through this park when I first arrived in San Francisco, wishing that I could live in this neighborhood just so that I could swing on the swings whenever I felt like I could.  They are adult sized and do not squeak.  Be prepared to get sand in your shoes.\n\nNow that I am here, I'm pretty darned happy.  Early evenings are definitely social hours for dogs and their owners.  Everyone's pretty friendly -- and if you don't have a dog, that's totally ok.  There appears to be a few people who come here in the evenings regularly to pet other people's pets.\n\nAlthough most of us dog owners have been pretty conscientious about picking up after our little friends, you can still see the occasional random log lying here and there on the grass ---- so I'd say no to lying around the grass.  There are plenty of benches here for people to just soak in the sun or stare at the moon.  \n\nGorgeous fountains, gorgeous views, kids and adults chasing dogs  --- you're happier for being a San Franciscan when you're here.", "author": "Guava C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-10-25", "description": "I spent my week of vacation hanging out in the park. It is a lovely place to relax. And if you are pet free and wish you had a dog of your own a great place to see dogs. \n\nThank you Nob Hill.", "author": "Carolina H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-12-11", "description": "I love this peaceful, quite and dog friendly neighbourhood park. It has been my favorit spot for morning coffee, chilling with friends, reading, sketching and even sun-bathing in summer. \nI'm so happy that I live near-by this park ;)", "author": "Flora H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-07-26", "description": "Being a Hitchcock fan, how can I not give this park 5 stars? It was a moment for me when I first strolled this area, and there it was, looking just like it did in Vertigo. \nThat aside, it really is a lovely (eww I can't believe I just willingly wrote lovely) little park in a beautiful neighborhood.", "author": "Dan C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-04-22", "description": "Love this park.  I laid out here the other day.  Read a book, ate some lunch, watched all the tourists.  Anytime there's a beautiful day in the city and I see tourists I want to go up to them and shake them.  Just to tell them how lucky they are they came to visit SF on a day like today.  \n\nAnyway, the park.  Full of cute dogs.  It's well-maintained and from what I've seen the dog owners are responsible about dog droppings.  Which makes it okay to lay out here :)\n\nWhen I was here the other day, there were a few guys jamming on their guitars and it was perfect.  I love nice days in SF!", "author": "Angela S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-06-26", "description": "What a gorgeous place. I spend a lot of time here... its funny to go sit and watch the German tourists lay out in their boxers when its sunny. Its a popular park among dogs, as well as a small number of bums who can make it up the hill, so its really cute when little dogs go up to the passed out bums to lick their dirty hands.\r\n\r\nLove this park!", "author": "Syd V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-10-27", "description": "It's Sunday afternoon and you're about to settle into a few hours of mindless cable television.  Instead of picking up the remote, grab some snacks, a blanket and a good (or bad) book and head over to Huntington Park.  \n\nSome of the things you are likely to see: young couples sitting close on benches, little kids playing in the sand, yuppies tanning and/or reading Kite Runner, and a crazyinsane number of dogs having the time of their life.  Seriously, if I was a dog, I would learning to spell out \"take me to Huntington Park NOW\" in snausages so my owner would bring me there all the time.  \n\nThis is also a wonderful spot to stroll at night. Grab your sweetie and wander around the fountain, sit on the swings for awhile, and admire Grace Cathedral across the street.  Wonderful.", "author": "Eric S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-05-19", "description": "It has the potential to be snooty with it's naked men fountain, Grace Cathedral proximity, and carefully trimmed dr. seuss trees, but it's not.  It's small but almost always has a few dogs sitting around wagging and playing.  It's a great atmosphere.  Sometimes you'll find people out sunning themselves, sometimes you'll find people doing some form of calisthenics, and often you'll find camera-laden tourists, but it's a great park.\n\nNow, if only I could trust my pooch off leash...", "author": "Lindsay D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-01-06", "description": "Huntington Park is my little Nob Hill paradise, especially on a sunny day.\n\nThis park has practically everything you could want- a gorgeous view of Grace Cathedral, puppy dogs running around at their happiest, a small playground for the kiddies to go wild over, a beautiful fountain centerpiece, grass to sprawl out on, and a cable car that passes by every so often to give you that hint of SF. Occasionally you'll see a couple or 2 taking their wedding pictures here as well- and for good reason! Luckily, this spot isn't overrun w/ people- just a lot of Nob Hill locals since it's a bit tucked away.\n\nGrab an icey cold beverage, blanket to lie on, your pooch (if you have one!) and a good book to read (although you won't really get much reading done since people & puppy dog watching can become quite the distraction) and head over to Huntington. Just writing about it makes me wish I was there now!", "author": "Tiffany M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-02-19", "description": "One sunny day... \nMe- On a swing going crazy like a little kid.\nMy boyfriend - Looking embarrassed, but too nice to stop me...\nRich Nob Hill residents with their dog - probably laughing about me.\n\nI like this park. \nIt's clean.\nCouple blocks from my house.\nI don't mind the dogs and the kids running around. \nYou get to see that beautiful cathedral too.\nAll the other mellow people at the park relaxing just like me. \nGood cafe's around. \nGrab a coffee, grab a book, and come get some sun.", "author": "Mai K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-05-02", "description": "Oh my beloved Huntington Park. How I miss thee since moving back to my hometown where no park can compare! You took away my stressful days, gave me great tans, and gave me love from all the adorable pups that run around. \n\nLuckily the park doesn't get too crowded, and is perched right on top of Nob Hill. A great place to read a book, breathe fresh air, and admire the beautiful landscape. It's a plus if you have someone to cuddle up with on a bench under a cozy blanket at night and watch the stars twinkle.", "author": "Karen V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-01-05", "description": "I had a friend meet me here before going to Nob Hill Cafe. She remarked that this park reminded her of the parks in Paris (she's Parisian). Hmmm. No wonder why I love this park. It reminds me of the place I would rather be than here. (although SF is my favorite city in the entire world)\n\nI love Huntington Park -- for it's fountains, for the manicured lawns, for the kid friendly and dog friendly settings, for the nice people... I usually walk the steep hill (from Pine) to sunworship or sit on one of the many park benches to read a book. Sometimes I just people watch. (in the morning, there's a group of people doing Tai Chi)\n\nThis place is not a secret but it is a great find!", "author": "Vanessa J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-05-23", "description": "I apparently share the love of this park with many others.  For me it is a little peace of urban heaven.  I love the skyline view it has, and like the city feel of the park, while at the same time being relaxing and pleasing to the eye.  I enjoy very much coming here late at night, and swinging on the swing while staring at the city lights and Grace Cathedral.  This is a very unique place, that is definitely unmatched. I will always love it!", "author": "N F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-08-21", "description": "I live a few blocks down and love coming up here at night to hang out.  This place is pretty magical night-time especially if its foggy.  Its like being on a little island surrounded by gleaming spires.  Maybe that's just me.  Its a nice uphill walk for me, and the place empties in the evening so I get to swing on the swings and listen to my ipod without dealing with children and dogs.  I might pass through earlier on my way home, but unless its late-ish little kids always bogart the swingset.  Which I suppose is their prerogative, drat them all!", "author": "RJ M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-07-29", "description": "It's a cute little park in a nice area of town.\n\nIt's perfect for my 2.75 year old daughter.  She played in the sand, and on the toys.  The park is bum free, next to a beautiful church, safe, and full of people.  \n\nThere are a lot of dogs though.\n\nI even came late at night to take some pictures, and felt relatively safe.  It is still smack dab in the middle of the city.", "author": "Noah B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-10-23", "description": "Hands down the most beautiful place in the city. You feel like your on top of the world!\nI love all the dogs and families running around! I absolutely hate Delores Park and this is the anti-thesis. The people are clean, friendly and happy. It's very neighborhoody and everyone talks to everyone else! The regulars aren't sketchy and usually remember you if they see you on the street. The grass is always gorgeous and perfect to sit on! There are also plenty of benches and clean bathrooms! love it!", "author": "Allison N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-08-09", "description": "High atop Nob Hill, this wonderful, small park was once the site of the Huntington family's residence, which rivaled the neighboring Flood manse (now the stodgy Pacific-Union Club) in grandeur, but alas, was made of wood and did not fair well in the post-quake fires of 1906. It encompasses everything a City park should -- well manicured lawns, benches for resting or reading, beautiful statuary, cable car noise, groups doing tai chi, playground hijinx, occasional artisan shows, and a non-stop gathering of dog enthusiasts and their better halves. Oh, and Thursday evenings are wine share nights amongst canine parents, so remind your pooch to bring along a bottle of hooch.", "author": "Gregor G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-07-29", "description": "One block up from my apt.  It's where I go to read a book outdoors or to write a journal entry.  It's the closest park to me and surrounded by historic buildings--Grace Cathedral, The Huntington Hotel, and the famous Mark Hopkins Hotel (as seen in the Hitchcock film, Vertigo).", "author": "Janice Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-01-18", "description": "*** Update ***\nAs mentioned below, I love this park because its close to home.  As of yesterday I wanted to really SCREAM at one individual person for her handling of a certain situation which I've witnessed more than a few times.  I have seen her dog has exude aggressive behavior to the other dogs in the park, but yet no one seems to be alarmed by this.  Perhaps its because the other dogs are smaller and back down.  People... what you need to realize is, one of your dogs will be seriously injured by this young women's dog, seriously ~ its only a matter of time.  Yesterday my dog was the most recent victim; fortunately my dog is much bigger than most of the dogs out there and my dog did not back down.  I'm a little pissed because the girl sat and watched her dog attack my dog and rather than discipline her dog, she just let it run off to possibly hurt the others.  I had to run over and break the dogs up.  And during the whole incident my poor dog looked at me with wonder in her eyes...  It broke my heart to see my 11 yr. old well tempered dog, extremely well behaved and extremely sweet DaWg defend herself from an attack of an aggressive dog.  \n\nAfter, the girl didn't say sorry and rather just pulled my dogs fur out of her dogs mouth.  AUGH!!!  GET YOUR DOG SOME TRAINING AND KEEP IT ON A LEASH IF IT DISPLAYS AGGRESSIVE BEHAVIOR.  \n\nJust so happens in one of my case law classes I've been assigned to a CA case about aggressive dog behavior and it being the OWNER's responsibility for ANY damage the dog causes.  So as I see it, you are liable for and can be sued for your dogs behavior...  See California Code of Civil Procedures 3342(a) - Just google it, you'll find it an eye opening read.\n\n*** Previous Review ***\n5 stars because of its convenience ~ that is, there are nights where I don't feel like taking the trusted friend out but know when I walk through my front door she is there a-waiting-n-wagging her big fluffy tail, happy to see me and especially happy because she knows within minutes we'll be on our way.  \n\nSo in short, our walks together are the highlight of her day and I hate to disappoint, so Hooray for Huntington Park as its a quick walk up the hill.  I'm happy, the DaWg is happy, and when my nieces come to visit, they're happy too.  \n\nYes, this park is more for the kiddies, but allows the doggies to play too.  And on nice warm sunny days you can find most people parked on benches sun worshipping as they read (or snooze) while their precious pooch plays with other pooches.  \n\nI hear that Thursday night there is a happy hour; suppose this is an excuse for me to drop by Le Beau before heading up and bring a bottle of vino on our next trip up the hill.  \n\nFridays are certainly happy hour, and not the kind of happy hour that you and I participate in.  But it is certainly happy hour for the pooches.  I was amazed how many folks, before heading out to dinner, etc., bring the pooches out for play.  It was certainly happy hour for the pooches and all played well together, rolling in the wet grass, and playfully bouncing on and off the benches, chasing one another all over the park.  Too darned cute is all I can say.", "author": "Cris B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2005-09-02", "description": "In 1872, Gen. David D. Colton built one of the most elaborate residences in the city on this site. After his death in 1878, his widow closed the house, then sold it five years later to Central Pacific railroad exec Collis P. Huntington, who resided in it with his wife until he passed away in 1900.  She remained in it until it was destroyed by the quake and fire of 1906. In 1915, Mrs. Huntington donated the land to the city with the stipulation it forever be a park. The classic square forms the heart of Nob Hill, and its many benches provide a place to catch your breath after the grueling hike up the California Street hill. The Fountain of the Tortoises, replicating one in Rome, features cavorting turtles and nymphs and is lit by eight underwater lamps that, during the holidays, are changed from clear to red, amber, and green. Since the late 1970s, the park has been overseen by the Nob Hill Association.", "author": "Gourmet G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-12-17", "description": "Kind of a surprising place to find in the middle of Nob Hill. While small, it is nicely maintained and features an interesting fountain. \n\nI imagine it as a nice urban oasis for Nob Hillinites.", "author": "Matthew C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-12-17", "description": "You should go up to the park while they have the Xmas lights up! This is not my favorite park in San Francisco (that'd be alamo square) but I am happy enough to live a block away from one of the centers of San Francisco and I never take it for granted - every time I set foot in this park it feels like the first time to me. I love my neighborhood and can't imagine living anywhere else.", "author": "Darren M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-07-18", "description": "As a Nob Hill Association member, I am very proud of our neighborhood park. My dog and I enjoy spending time there!  I wish more visitors would respect our leash laws, and pick up the poop...", "author": "Maven G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-04-18", "description": "It's funny the dog person said the tourists are obnoxious, because I think the dog people are kind of so. But not so much that it taints the Huntington Park experience in any way. It's a very clean, unique and intimate urban park with the towering cathedral on one side and the old Flood Mansion on the other. I like this place in the late afternoon and evening, especially toward Summer and Fall when the sides of the buildings downtown reflect the golden sunset. Sit on one of the benches and meditate on the fountain in the center, then stroll over to Grace Cathedral and walk the labyrinth. Then come back and pet some dogs.", "author": "Roxmarie M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-06-06", "description": "It can get awfully windy and cold here, but when the weather is that exceptionally blue, warm and sunny, relax here after going to Grace Cathedral and enjoy the peace and quiet. Hear the cable cars in the distance and experience the simple beauty.", "author": "miriam b."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-02-26", "description": "I absolutely love this place.  Located right on top of Nob Hill, it's the perfect berth to view multiple SF institutions 360 degrees around: the California cable car, Grace Cathedral, the Fairmont and Mark Hopkins hotels, the Masonic Auditorium, and let's not forget the views of the City to the south and east.  I don't know any SF park with as many benches per square foot.  So you're almost guaranteed a place to sit and relax.  It's the best on those warm SF days with the sun glowing and fountain flowing .", "author": "M A N I K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-06-29", "description": "I love playing on the swings at one am when it squeeks and sounds like drowning cats.  It scares everyone.  I like to sit on the grass and watch people as they try to parallel park their oversize cars in spaces too small.  I like walking by early late winter mornings and watch the people practice tai chi as the blossoms shed petals that descend diagonally, floating and rising, floating and rising, cut only by the slow and purposeful movements of people.", "author": "Tangerine L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-01-06", "description": "Not as good as alta plaza, but the doggies are great (if you are into small dogs) and it's a great place for Academy of Art University kids that stay in the local dorms to go and get high at night.", "author": "Moi S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-12-28", "description": "My dogs' morning walk includes a stroll through this park.  It's gorgeous with the Christmas lights up!\n\nOnly one criticism: I wish there was a gated area for the dogs to run around in.  :)", "author": "Leslie R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-01-12", "description": "This is probably one of my favorite places in the city on a sunny Sunday afternoon. Quaint little park that is an oasis in the middle of Nob Hill. \n\nIf you are a dog lover, then come here. There is always a slough of friendly dogs that are running around. This past Sunday, there was an art show with local artists. Well kept and with a nice fountain. I could sit there all day and listen to mix of relaxing water and city drone.", "author": "Matt K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-03-08", "description": "This is my jam! I get my fix for dog dog dog everything here. Sometimes I affix raw bacon to my socks so the cute crazy ones will run after me. That's a lie. I have a job and bacon ankles are officially not allowed.", "author": "Shannon V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-08-21", "description": "Cool. This park has a comfy gray wall around it that is perfect for sitting on for hours. I sat here for 2 hours trying to get a glimpse of Bono, who I heard was staying at the Huntington Hotel. Lo and behold right before I left, I met him. He was so nice too! He signed my CD that I had brought and took a photo with me. The bellhop of the Huntington Hotel took it with my camera. He had no idea who Bono was, nor U2 (lol wow). COOL!!!!!! Nice park to play Gameboy for 2 hours.. Yes.. this was back in my GAMEBOY days in 9th grade.", "author": "O K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-09-17", "description": "Gorgeous park surrounded by some of the oldest and most reknowned hotels in San Francisco and Grace Cathedral.  Beautiful white lights fill the trees at night.  Great romantic spot to swing on the swings at night and great daytime spot to go read a book or have a picnic.  I'm so glad I live so close!", "author": "Vanessa Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-04-30", "description": "Beautiful park in the midst of all the hustle and bustle of town on top of Nob Hill. Every once a year, the California Mille http://www.californiamille.com/ is held in front of the Fairmont Hotel and in/around the Park! Comprehensive array of classic, vintage, collector cars on show. When the weather is warm, there are also art exhibits for sale.", "author": "Yan M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-03-14", "description": "I used to love coming here with my cousins and his friends when we were little . It was our favorite park . I used to come here for school field trips too . I loved the swings . My classmates / cousins and I would push each other on the swings or we would swing ourselves to get higher . We would always race each other to see who got higher first . It's nice because when you get high enough you get a nice view of the Hilton haha . I like this park .. it's very pretty , refreshing , and quiet .", "author": "Eileen L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2005-12-28", "description": "This is one of the neatest parks in the city.  With plenty of comfortable benches, it's like sitting on top of the world.  It's even quiet up here since not so many cars come up the hill unless they have to.  It's a great place to hang out on a warm day talking with a friend, playing frisbee, football, catching up with your cell phone calls or just enjoying the architecture, views and seeing the dogs and kids play on the playground.", "author": "P H I L H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-06-24", "description": "My relaxation area. It's great on sunny days and it's just so beautiful watching all the kids and their parents. I grew up playing at this park. The floral arrangements are adequate, the atmosphere is great! If there is any problem with the play structures, it's fixed within the week. The breezes are wonderful!", "author": "Jenny L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-10-15", "description": "On a sunny day, nothing beats sitting on a bench in Huntington Park, reading a good book or the Sunday newspaper, watching the cute dogs run playfully by, listening to the bells chime at Grace Cathedral, and thanking your lucky stars that you live in such a beautiful city.", "author": "Ava S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-02-13", "description": "One of the cleanest parks in the City.  I have a lot of good memories here.  My best friend lives in Nob Hill and we sometimes head down here with a cup of coffee and chat for hours.  It's a very nice place to spend some quality time with a good friend.", "author": "Kayte M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-18", "description": "Dog-watching on a sunny Saturday afternoon! Climb the killer hill, sit on a bench around the fountain, pretend to read, and drool all over the puppies running around you. A little Snob Hill attitude on certain dogs and dog-owners, but absolutely passable. Very neighborhood-y, very feel-good. You'll forget you're in a city!", "author": "G. J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-12-19", "description": "This is my favorite park in the city, because it is so urban and gorgeous. The marble dolphin fountain is beautiful, and the view is spectacular it makes you realize how worth it it is to pay outrageous rents to live here. It is San Francisco in every respect, with the cable cars clanging down the street, the view of the Bay Bridge, and its position atop Nob Hill with Flood Mansion and Grace Cathedral at both angles. It is so fun to people watch too, and the surrounding architecture is some of the best in the city.", "author": "T W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-05-12", "description": "Lots of dogs, lots of kids, lots of people, lots and lots of activities (churches, hotels, cable cars, fountain, art shows). Me likey! It's not a huge park, but great between lunch hour and sunset. Hard to find a great doggie-friendly place. ;P", "author": "May S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-01-14", "description": "I work near Union Square and hike up the several blocks of STEEP hill regularly to eat lunch at this park. Walking up Taylor Street, you get to use the stairs that are built into the sidewalk, so that's a plus. This is a tiny, one-block park, with a lot of things going for it. First of all, for a lunch-breaker like myself, looking for a nice bench to sit on -- this park has dozens of benches. Which works well for how varied the weather can be. If it's cold, you can find somewhere to sit in the sun, and if it's warm and you're exhausted from hiking up the hill, there are benches in the shade. I don't like sharing a bench, and I've never had to, since there are so many. Then there is a big fountain in the middle of the park and some swing sets in the back. I haven't tried swinging yet... there usually are children back there with their parents. The grassy middle sections of the park are highly kept up, with everything looking perfect and maintained. On sunny days there are often a handful of people laying in the grass working on their tans, and on any day, there are a surprising number of people walking their micro-dogs in that park. I've never seen so many tiny dogs consistently in one location. It's a great people-watching park... most folks seem to be moderately affluent locals who probably live there on Nob Hill. (I've never seen a homeless person there, although I've never seen any police or security there either.) The view includes California Street and the cable cars, Grace Cathedral, the big hotels (Fairmont, Mark Hopkins, etc.), some great other historic architecture, and then also, when you look towards the east you can see the Bay Bridge. The perimeter of the park has some really pretty light-pink rose bushes, and are gorgeous when they're in bloom. It's just a delightful lunch spot, and worth the hike up there!", "author": "Zoe H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-11-25", "description": "also in my top five favorite places in san francisco, i love this park.  i think it is perfect.  ideal for a sunday afternoon sit down with a good book and a cup of coffee, it would also be an ideal setting for a visit with a friend or just a quick stroll.  it's always clean and well kept, the fountain in the center gives the park a balanced and classic feel.  grace cathedral overlooks the park and is indeed a sight to rest the eyes on.  it is also surrounded by a wonderful display of classic hotels and beautiful apartment buildings.  it's a little piece of new york here in the city and it is lovely.", "author": "Steven K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-08-13", "description": "I grew up playing in this park. As a child you don't appreciate all that surrounds this park. Now I look back and smile.", "author": "Kacey K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-05-08", "description": "i simply cannot imagine anyone giving this fewer than 5 stars. top of nob hill. beautiful by nite & day, 365 days/year. even in the pouring january rain!", "author": "O B."}
