{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-12", "description": "EVENT: totally my Wednesday night go to restaurant now!!! I'm loving this place!!\n\nSERVICE: excellent! Everyone here is so wonderful and pleasant! Amazing service! Bought us our food in a timely manner! Came back to check on us! Love it!!!\n\nDRINKS: half price bottle of wines on Wednesday!!! Seriously my go to place on Wednesday's!!! Love it!!\n\nFOOD:\nEverything is excellent here!! Here's what we got...\n(1) Tofu soup: good spicy flavors and tofu is delish!\n(2) Kimchi fried rice: excellent! Nice flavors \n(3) Kalbi: marinate, so delish. Came with a plate of meat in a sizzle plater.\n\n**OVERALL: must try place!", "author": "Mindy Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-09-19", "description": "Yummy Korean food....... but the food served here didn't agree with my boyfriends stomach or mine. Not sure what it was... as I review the health ratings..\n\nWe ordered three dishes, and they are listed below :\n\nGalbi - so so good. Everything on the dish including the bed of onions was delicious. I really loved the light char yet the meat was tender and juicy! the smaller portion feeds 2 easily if you order at least a couple more dishes. \n\nKimchi pancake - the best kimchi pancake I have had!! I loved how they cut the pancake into smaller portions and each bite was consistent. Kimchi, crunchy pancake, yummmmmm!!!\n\nChicken wings- don't order original. It's so basic and unflavored. Garlic was super yummy. We ordered half half and they charge $1 more . Not the best wings I've had - the batter is a little thicker and airy here but the chicken is moist, tender. I think the garlic flavor could be a little more deep, it was pretty shallow and only could be tasted on bites with the inconsistently spread garlic sauce.\n\n\nFYI they have taken the seafood pancake off the menu because the owner is currently sick. It is a labor intensive dish and will not be back until she recovers.\n\nParking is iffy and the area is too- try to park close!\n\nOtherwise, service was amazing and we would come back should we be convinced it wasn't this food that gave us both issues... but probably not :(", "author": "Karen H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-10", "description": "Price is reasonable, service is good.\nThey serve us free desert( fruits and cake).\nWe definitely will go back there.", "author": "Erika E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-23", "description": "Spacious dining area. Super flavorful. We tried the half and half chicken wings (sweet and spicy and the original flavors). And the tofu soup. \n\nBoth dishes were super good. And the rise with the soup was amazing. It was like a purple rice  and paired with the soup it was a nice combo. \n\nThe employees are super nice. They would come by and check on our table to see how everything was and if we needed anything else. \n\nWill definitely come back to try one day.", "author": "Bonnie C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-04", "description": "I thought the food was pretty good. Came her on the 4th of July so there wasnt much of a wait. The server was very attentive and checked in often in how we were doing. Definitely on the pricier side compared to other Korean restaurants in the city and the servings sizes are not huge but just enough to fill you up. \n\nI tried the following: \nKimchi fried rice - pretty tasty, not too spicy and more on the sweet side. The seaweed added gives a nice texture and flavor to the rice. \n\nGrilled asparagus - $6, small serving size, they use baby asparagus and season it with a sweetened soy sauce and season seeds. Good flavor and crunch.  \n\nGarlic Fried Chicken - my favorite dish! They put it on a hot plate with garlic on top and you have flip onto the hot dish. Perfect crunch and flavor and the chicken was super juicy inside. Highly recommend trying! \n\nSweet and Spicy Chicken - I can't handle spicy but my bf enjoyed it. Said it had a nice kick and also sweet flavor to contrast.  \n\nMochi Ice Cream - mango and strawberry $5, they drizzle the mochi with some chocolate and top it with kiwi. Personally prefer the mochi as is without extra sauce. Just tastes like store bought mochi, unfrozen. Probably could skip. \n\nOverall, solid place. Nice ambience for a date night. Would come again for the wings or order takeout. Be sure to check in on yelp and get the extra 10% off your bill!", "author": "Kristy L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-20", "description": "Great wings! Go for the original and ask for the sweet and spicy sauce on the side. They also have insanely spicy hot sauce you can ask for if you're so inclined.", "author": "Benjamin P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-09-30", "description": "Been here plenty of times before but thought we would \"eat in\" tonight by doing Uber eats. It's Sunday night, school night, everyone is hungry and waiting for Korean food. Initial delivery eta was 615, and it gradually got pushed to 7pm. Called to see what's up, turns out they gave the food to the wrong driver. Told me they'd get me a new order but to cancel with Uber and that they'd start making another order and be ready in 25 minutes. I cancel, call back then back in 10 minutes, and they tell me it'll be really in 25 minute. What happened to making another order right away?! Turns out they all of a sudden got really busy and couldn't do it. I tell them I'll come grab the food myself. I arrive 25 minutes from when they last told me, and ended up waiting another 15 minutes. They offered 10% off as a type of apology I guess, why bother I think, either do an actual discount or don't do one at all. Won't be coming back.", "author": "Long C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-09-10", "description": "It was pretty good, a bit pricey for some of the food. Expected a little better given the reviews but not worth it in the end.", "author": "Kuan H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-24", "description": "We all went to sf for the weekend for a birthday and I always wanted to try Korean food with cheese. We stayed at an air bnb down the street from here that's how we ended up finding it. Our servers were so nice and attentive to us the entire time. Even the manager came and talked to us with recommendations for soju. The food was unbelievable! I had the seafood ramen and it was sooooo good I didn't even have time to take a pic of it. The mussel in it was so fresh I can still remember how it tastes. We got the corn cheese and it was so flavorful you have no idea. I recommend this place 15/10!", "author": "Diamond K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-29", "description": "I'm so excited that there is a decent Korean place near me that delivers! In the past month I've ordered from here 3 times already and so far it's been consistently good. \n\nOur favorites are the galbi, hangover soup, and japchae. The prices are not cheap, but the portions are decent. I've ordered using UberEats and so far I've never had a hitch in the process.", "author": "Jean L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-09-01", "description": "Ordered dinner take out for my family and we were super disappointed- galbi was completely burnt!! I wouldn't even feed it to my dogs. We threw out all the takeout boxes.", "author": "H S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-04", "description": "Hwaro is a relax, modern and hip Korean restaurant with delicious food.  Came here with my family and friends and we really enjoyed ourselves. The kids love the sweet potato fries and corn cheese. I mean who doesn't like fries and cheese? The fries were hot and the corn was full of yummy gooey cheese! We also ordered the Garlic Chicken, Kalbi, Miso Pork Belly, chilled squid salad, Vegetable Basket, japchae, Korean style pancake and the \"old\" Kimchi. The house made Kimchi was delicious but the best were the wings. According to everyone, they were seasoned perfectly and were finger licking good. My family and friends said they can drink the refreshing citron soju and eat the garlic chicken wings all day!  Being a vegetarian, I ate most of the mushroom japchae and enjoyed the fresh veggie wraps that I made with the veggie basket. The citron soju was indeed refreshing. We also tried the peach soju and all of us prefer the citron soju. For dessert, we had vanilla and Strawberry mochi ice cream and green tea cheesecake. The service was very attentive and we didn't feel rushed even though the restaurant was full. It was a scrumptious meal and we'll certainly be back! We want to try the hangover soup and the Korean ramen.", "author": "Robert T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-12-06", "description": "We were craving Korean food and the Sunset is just too far away to scavenge for food. We yelped it and came across this random restaurant in the mission - was surprisingly decent.\n\nWe ordered kimchi fried rice, taco trio, and rice cake skewers. We were overly ambitious for ordering the rice cake skewers, but the taco trio and kimchi fried rice were legit. The taco trio is perfect for the indecisive folks since it includes combos of bulgogi, spicy pork belly, and kimchi. Kimchi fried rice is just delicious any time of day. I would not say this place is purely Korean, since the food does taste slightly Americanized (like all Asian restaurants in this area), but it was still tasty and filling. \n\nThe restaurant is super spacious and we did not have to wait to get seated (the best of both worlds especially when hungry). I wish they had a food truck some where so I can get these tacos on-the-go!", "author": "Connie L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-28", "description": "Hwaro is great! The food, I'd give 4 stars because it wasn't out of this world but nonetheless delicious and a Korean place I've added to my list of coming back to. However, it gets an extra star for impeccable service. My cousins and I came 40 minutes before closing and depended over an hour here and were the last ones in the restaurant. If I were the workers, I'd be annoyed but they treated us with so much patience and did not rush us at all. \n\nAs for the food: we got kimchi fried rice, japchae, ramen, & fried chicken and they were all so good! I would recommend all these dishes.", "author": "May O."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-08-09", "description": "The food is pretty delicious with the tofu soup being warm, spicy. They give you some pickled daikon which is pretty damn delicious too.\n\nThe entire meal though was super expensive with $17 for bibimbap with Bulgogi. The soft tofu soup bowl was huge but it didn't come with an egg or anything and you don't get banchan here (or at least a wide assortment of it).\n\nThe stuffed mushroom though was not a great deal. $10 for a single mushroom was not that great.", "author": "Rohan D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-26", "description": "Came here with a party of approximately 10 on a Saturday night. We ordered a whole bunch of dishes, which includes bibimbap, kimchi fried rice, seafood pancake, sweet potato fries, and one of each fried chicken (original, garlic, and sweet & spicy).\n\nMy favour dishes here are the seafood pancake and fried chicken. The seafood package is packed with seafood so you get a mouthful with every bit instead of a few pieces here and there. Fried chicken is crispy and delicious. Make sure to check in on Yelp for 10% off!", "author": "Galen W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-08-03", "description": "Unfortunately, this comes down to UberEats canceling my order after it was already 25 minutes late. I know it's not directly the restaurant's fault, but if you're going to partner with a delivery company then you need to make sure the experience is solid across the board. \nWaited an hour after being given a time of 35 minutes and then the order was cancelled without  any reason or way to contact anyone.", "author": "Jay S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-04-27", "description": "Great local place when you're hankering for korean food. Has quite a few seats, but it was pretty empty on a week day evening. The hostess ended up being the cook (they had one other one), waiter, everything! He did it all, but was still pretty friendly, albeit really busy running back and forth. Looks like most people do take-out, but it's still a nice place to hang out if you want to eat in. \n\nWe got the bibimbap and kimchi fried rice, both which were pretty good. Bibimbap was pretty standard, but the fried rice was yummy! Wish there was a bit more though. There were two sides, kimchi and sprouts. We also got the green thai iced tea, and that was enjoyable (a bit sweet though!).", "author": "Alice K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-03-29", "description": "Got takeout for bibimbap, kimchi soup and spicy fried chicken which came up to $50+\n\nThe kimchi soup was a tad salty but full of kimchi and tofu so it was filling. Bibimbap was delicious and just enough to feed one but the fried chicken was probably my least favourite probably due to such high expectations. It was crispy but felt that the sauce was just dumped on the top of a few chicken pieces rather than marinated in it or that the flavours were on all the pieces.\n\nOther than that, I felt that the quality and quantity served didn't really equate to over $50 for takeout dinner.", "author": "Carmen P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-06-25", "description": "Save your money for somewhere better.\n\nI think its overpriced Korean food, but nice addition to my neighborhood. \n\nI've tried:\nFried chicken - I prefer the sweet spicy over the garlic. I wish th garlic one was more garlicky. The chicken had a nice crunch\nSeafood pancake - it felt tasted heavy but it is loaded with seafood.\nBibimbap - tasted bland, nothing special, will not order it again.\n\nOverall - nothing special, I only went here to try it out, I'm not interested in coming back to try the rest of the menu since it did not expect my expectation.", "author": "Toni Rose M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-09-21", "description": "Ordered pickup via grubhub only to arrive and learn they went \"offline and didn't receive my order.\"  Too busy to call grubhub to refund me and asked that I, the customer, do it. Yet the owner went over to thank and say goodbye to a large Korean party that was leaving. Lame.  This is San Francisco and I will get Korean grub, which is probably better, elsewhere.", "author": "ree g."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-23", "description": "Awesome food and very good service. Love the soju cocktails. Excellent fried chicken. Go there. Now!", "author": "mike f."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-30", "description": "Hipster meets fusion Korean food.\n\nThe decor is your typical SF hipster. Edison bulbs, string lights, and wooden bar. The layout is very \"open.\" There's tables off to the sides, but right in front of the door, there is a random open space.\n\nFried chicken - We got this in both of the sauces, garlic and sweet-spicy. We couldn't tell which of the sauces we liked better. Both were very very sweet. The garlic wings were topped with lots of garlic that we ended up scraping off the wing before eating. The sweet-spicy could use more balancing. Dish came with pickled daikon. The wings also come out piping hot so be careful when taking the first bite.\n\nKimchi Fried Rice - This was my favorite. It's like comfort food. The rice was cooked nicely. It had really good flavor. I could kill a whole bowl by myself.\n\nSeafood pancake - This came out on a hot plate. It was a little burnt but still good. I think the pancake could have used more seafood but overall I would order again.\n\nOnly complaint is the smell of the place. It has an overpowering bathroom cleaner smell that hits you every once in a while. i'm not sure if it's just an old building or if the pipes are bad, but it's a little distracting when you are trying to eat. \n\nWill come back to try the meat dishes and soup. Also, if you check in on yelp there's a 10% off coupon.", "author": "Junella T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-01", "description": "Came here on a Saturday night around 8:30 and there were plenty of tables open.  This place has pretty cool decor and spacious.  We ordered the kimchi cheese, hangover soup, and fried chicken (half garlic half spicy).  Everything was pretty delicious.  I wish the kimchi cheese came with more chips.  The hangover soup came with plenty of beef .  And the fried chicken came on a hot plate so you can flip the the garlic chicken around and cook the garlic more if you want.  Overall a nice place for a causal dinner and night out with friends.  Service was great and parking wasn't too bad.", "author": "Len L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-01-04", "description": "My experience here was okay. Some words to describe this place: modern, cozy, warm, and hip. Good food and welcoming space for a date or to catch up with friends. \n\nCame here on a Tuesday night w/ my bf a couple weeks ago. The staff noticed us right away upon entering, but took a while for us to be seated. Service was slow that night, not sure why since the restaurant wasn't even packed, but it picked up as the night went on. \n\nFood was okay. Everything we ordered was shared/shareable, which was nice. We ordered the Korean ramen, Kimchi Fried Rice w/ pork, and Garlic pork belly. Only downside of the food was the limited banchan and the ramen. The banchan is not like your typical kbbq restaurant where they serve you 5+ banchan options. Here, they only serve kimchi and bean sprouts. Both good, but wish there was more in quantity and more variety in the banchan. The ramen tasted like instant ramen and they tossed in some spicy Korean broth. I was craving noodles that night so it was okay and filling, but I would not recommend ordering this nor would I order this again for $11. \n\nKimchi fried rice had all the right flavors. It was pretty spicy for me and my bf. A simple but filling dish - rice, kimchi, dry seaweed, pork, and a fried egg on top. $13\n\nFavorite of the night was the garlic pork belly. It came out last, BUT tasted so good. Kinda pricy though for $21. If you love garlic like me, then you'll enjoy this dish. Jam-packed with flavor, the garlic pork belly is served on a sizzling plate and is more than enough meat to share with another person.\n\nAll in all, I'd probably come back to try other items if I'm in the area and use that 10% off check in on yelp!", "author": "Debby N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-15", "description": "Hwaro is a hidden gem within Excelsior. This Korean fusion restaurant provides great Koren food, fun vibes with full bar menu, and delightful service. The kimchi pancake was amazing as a starter. Korean ramen, isn't that a no-no? Not here, it's an amazing dish full of flavor. Check it out and enjoy!", "author": "Matthew T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-18", "description": "Late post: quick early dinner: this place isn't traditional Korean bbq. It's more Americanized Korean restaurant. The food is ok nothing wow. My girl enjoyed the flavor soju and spicy squid dish . I enjoyed the fried rice and sweet potato fries. The one negative is the sweet pancake with ice cream. The pancake is pretty hard where you can't use a spoon to cut it but a knife. At lease the green tea ice cream is good. Overall it's a 3.5 star for food but because the service is really awesome , I give 4 star! I definitely wouldn't mind coming here for drinks and food again since it's close by our house.", "author": "Christy V."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-09-03", "description": "My SO's colleague recommended this place and since he is a legit Korean descendent so we gave it a try. However, once I stepped into this place on a Friday night i almost wanted to back-out immediately - it smells a little funny, like a somewhat clean toilet but still smells like a toilet. I decided to sit down and still give it a try. The service is fast as there were only another couple who was dining in there when we arrived. The food is average or below average, as I have been to many good ones in SF before. Price wise, I think this is on the cheaper side for Korean dinner. So overall the experience is mediocre. The smell did ruin their rating in my case. I do hope this is not what they smell like all the time.", "author": "Jessie L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-19", "description": "An excursion to the Excelsior has become increasingly rare for Jamie W. and me these days, probably because I currently work across the bay and don't want to deal with navigational complications once I get back to the city. However, we decided to try this place based on a recommendation from a fellow foodie I met in a yoga class. She led me to some cool places like Mozzeria in the Mission, which we really liked (review: http://bit.ly/2pEQQht). I thought parking would be a bear, but surprisingly there were free meters right around the corner on Santa Rosa. Piece of cake. There was just one group of rambunctious guys at a table next to the window, but otherwise it was pretty empty on a Wednesday evening.\n\nThe menu was smallish but nicely eclectic even if it was really Korean with a hipster attitude. As we were deciding what to have, the young server gave us a free mini-appetizer of the Sweet Potato Fries with Spicy Mayo (photo: http://bit.ly/2pEQzbq). They weren't deep-fried, but they were tasty with a snap, and we never turn down mayo. Jamie and I went with splitting three dishes. The first was the $6 Baby Asparagus with toasted sesame seeds served on a sizzling iron plate (photo: http://bit.ly/2pU6txS). It was delicious, just not enough of it to satisfy beyond a few bites. Our second dish was the $13 Kimchi Fried Rice with Pork, which was covered with a fried egg and sprinkled with strips of dry seaweed (photo: http://bit.ly/2pEQmYH).\n\nThis was good solid comfort food, a bit by-the-numbers but no complaints, especially with the mini-banchan that came with it (photo: http://bit.ly/2pi2EGy). Our main event was the $17 Garlic Fried Chicken, a hearty portion with at least ten drumettes stacked precariously on a hot iron plate and coated in marinated minced garlic (photo: http://bit.ly/2oRqbew). As much as I love garlic, even I thought the minced garlic was excessive and we ended up scraping much of it off to get to the screaming hot poultry. It came with pickled radish cubes which provided some relief from the sticky heat (photo: http://bit.ly/2oNmjg5). They appear to be searching for their bearings a bit, but they're still off to a promising start.\n\nFOOD - 4 stars...edgy, tasty Cal-Korean with a few flaws but a little tweaking will help them\nAMBIANCE - 3.5 stars...blessedly low-key on a weeknight\nSERVICE - 3.5 stars...fairly quiet but mostly responsive\nTOTAL - 4 stars...modern Korean spot looks out of place in the Excelsior but what the hell", "author": "Ed U."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-26", "description": "Not a typical Korean restaurant but good tasting food. It's like elevated Korean food. If not mistaken, the owners and cooks are Koreans. \nYou can certainly taste this in their Kimchi soup which is spicy and heartwarming! It's accompanied by fluffy purple rice - a good portion dish. \n\nThe half and half fried chicken is served on a hot plate accompanied by some radish and wet towelettes. I really like the garlic fried chicken but the pickled garlic seems to take away some of that greatness. I wish it was either raw or briefly sautéed instead of marinated with sugar. The chicken itself was crunchy and juicy! \n\nThe place is nice and trendy. Wish there were more banchan tho. \n\nI would order the kimchi soup again!", "author": "WQ C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-25", "description": "We keep coming back to enjoy the food and the company of the gracious host Ina and her brother chef Ryan.  The 12 of us always enjoy our evenings drinking pitchers of beers and numerous bottles of soju. This time we ordered double orders of fried chicken,sweet and spicy fried chicken,seafood pancake, japchae, kalbi and pork belly sizzling BBQ.  The sweet and spicy chicken was more spicy than sweet. The fried chicken was good but I prefer a thinner batter. But the wings were huge!  The seafood pancake was yummy and I loved the kalbi and it's flavor.  I could have eaten the japchae plate by myself!  Although the pork belly was on a sizzling platter - I want my pork to be crispy!  Ina and her brother Ryan are the perfect hosts. Our table is always set up just the way we like it!  And they don't even mind that we are so loud. \n\nAnd for all the dishes we ordered and alcohol we consumed - when we got the check - it wasn't that much per person. So that's my hot tip -bring a bunch of friends so you can share dishes and try everything!   We will be back to try that cheese corn and hangover soup!", "author": "Donna L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-31", "description": "Our waitress was awesome in walking through the menu and giving us recommendations. She checked on us frequently however towards the end of the meal, it took a while to get the check. \n\nThe menu has many items that sounded great and we settled on the taco trio, seafood pancake, and the garlic pork belly bbq. The food packed a flavorful punch and I would say my favorite dish was the garlic bbq pork belly. It was more garlic intensive than I was expecting which was great since I love garlic. I thought the seafood pancake could have been better. We also had mochi for dessert and they offered six flavors that night. I'd like to come back and try more items including their soups and the dessert korean pancake. \n\nIt's a very modern space. While I was dining, I was trying to recall what was the restaurant previously and I remembered it was a Goldilock's. Hwaro seems like a great addition to the area.", "author": "Maya S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-29", "description": "3.5 Stars\n\nThis place is sooooooooo cute. I immediately took a million photos of the decor and sent it to everyone I knew. It was pretty dead on a Tuesday and this spot is huge so it looked even emptier. Had originally wanted to go to 7 Mile House but there was absolutely zero parking so I looked super quick on Yelp and realized I had this place bookmarked. \n\nThis place is no longer cash only which is good because we did not have enough cash to cover the bill! We got two sojus, sweet potato fries, japchae with meat on the side, and bibimbap stone pot. \n\nMy main issue is the sweet potato fries were COMPLETELY over salted. They were hard to eat but my friend doesn't like to complain so he ate them all anyways but agreed they were way too salty. If I was with anyone else I would've sent them back. It tasted like someone dumped the salt shaker on it. So sad. \n\nI also wish they had more vegetarian/pescetarian options. They very easily accommodated me when I asked for the meat on the side of my japchae though which was nice. I let my friend have all of it instead. I think some tofu/shrimp options would be really good. \n\nStaff here is great. I think I saw the owner there again having a full meal (just like another review said teehee). I love the different kinds of soju and wine they have. Also kind of annoying is they just placed the bottle of soju unopened on our table both times. I rarely see this happen. Its like opening your own bottle of wine or beer. I'm pretty sure its industry standard to open the bottle before serving it. Also I was asking the waiter for flavor suggestions and he hadn't tried any of the flavors so he was blindly suggesting. I think this place def has some kinks but otherwise I will happily come back.", "author": "Tiffany V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-04", "description": "This just might be my new favorite Korean restaurant in San Francisco! I used to frequent 707 Sutter and Cocobang but this place definitely hit the spot.\n\nI've been pretty disappointed by corn cheeses at other Korean places around here but THIS was so good. Previous corn cheeses just left me thinking: \"I could do this better on a random skillet with string cheese at home\". But this one--we wiped it out in a few minutes. The corn wasn't too soggy or mushy, with a generous serving of cheese, and topped with tempura crunch, which was actually an amazing addition. \n\nWe were a table of 4 but ordered SO much even the waiter thought we over-ordered. But with eyes significantly bigger than our bellies, we were prepared for take-out.\n\nWe ordered:\n1. Topokki with cheese (4/5 stars)\n2. Kalbi (5/5)\n3. Seafood pancake (4/5)\n4. Hot stone bowl ramen with spam (4/5)\n5. Half-half wings (4/5)\n6. Kimchi Jiggae (kimchi stew) (5/5)\n7. Corn cheese (5/5)\n8. Taco trio (5/5) (if you're sharing this... GRAB THE BULGOGI PIECE FAST) \n\nThe portions were really generous so much so that we had to drag an extra table over to put all the food (we eventually also filled that table). Kalbi came with super fresh lettuce and all the necessary additive sauces and pastes. I loved everything and went home with my Korean craving cured and a very happy belly. I'll be back!!!!", "author": "Su Lin Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-03", "description": "I had the kimchee fried rice and found it to be a solid entree. The fried egg, kimchee, and seaweed went well together. The seafood pancake was quite generous in portion size. It could have more protein inside the carb, but it was cooked well.", "author": "Byron H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-09", "description": "I came here on a Saturday around 8-9pm and got seated right away, since they close at 10pm. We got really lucky and found parking right in front! From looking through yelp reviews to see what was most popular, we decided to order the taco trio, cheese corn, and Korean ramen with spam and kimchi for two people. We also ended up getting a bottle of peach soju to go with our meal :) Everything turned out to be super yummy and we ended up finishing everything we ordered! (This doesn't happen a lot because I usually get full really easily) \n\nI really enjoyed the Korean ramen, especially on a cold, rainy day. It's a bit different from the tofu soup at other Korean restaurants with ramen added to it, but I really like the flavoring and the ramen texture here. I would definitely order this again. You have the options of adding cheese, spam or kimchi for an additional price - I believe it was $1/$2 for each item. We decided to go with just the spam and kimchi since we're already having a lot of cheese from the cheese corn! \n\nThe cheese corn has a nice presentation and tastes pretty good as well! I like how it has the Panko/fried bread crumbs along the sides and some siracha sauce on top. It is not the best cheese corn that I've ever had, but it is pretty good and unique from the other cheese corn dishes I've had at other places. \n\nThe taco trio was super juicy and flavorful! It has three different kinds of meat I believe and I enjoyed all of them! :) i wouldn't mind if there was a little bit less of that orange sauce though, it was a bit too saucy for me, but that probably varies and I don't mind it too much so I would definitely order this again. Maybe next time there will be less orange sauce on it and not drenched like this time! \n\nI am looking forward to coming back and trying more items on the menu. Maybe the wings next time? And the hangover soup if I do a lot of drinking the night before ;)", "author": "Bailey L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-17", "description": "They have me on a chicken wing search and recipe copy hinge. The spicy sweet wings are the perfect balance of spicy and sweet. The service is quick and friendly (I always order takeout because I live close), and I'm yet to have a batch of under or over cooked wings. I haven't tried much else there, but be it that I love chicken wings, they get 4 stars.", "author": "Brandy W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-17", "description": "Wanted to see what $27 kalbi tasted like so I decided to give this place a try. What I ordered:\n\nKalbi - serving size wasn't what I expected for something so expensive so I guessed maybe their quality of meat was suppose to make up for it. However, their quality was no different from most Korean places. The marinade was a tad bit too sweet for my liking. I ordered the short ribs ssam style to include some lettuce, ssamjang and garlic but they missed out on the garlic and decided 3 pieces of lettuce was good enough. \n\nHaemul Pajeon - $16, about the typical price you find anywhere. Cooked to perfection and arrived somewhat crispy and not to flimsy, just the way I like it. Though this was lacking a lot in flavor and wouldn't recommend it. \n\nOverall, average Korean food and extremely over priced. Well at least the kalbi was.", "author": "Vince L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-06-19", "description": "I don't like this place at all. \n\nCame here for dinner and I'm not surprised it was empty. \n\nGot seated and ordered right away. They stopped by with a sweet potatoes (?) and mayo shortly after. Weird combination and didn't like the taste...\n\nOrdered:\n\nTrio tacos 1/5 did not like the sauce. \nKim chi fried rice 2/5 eh I've had better \nHangover soup 1/5 had more veggies and meat than the soup itself\nWings (sweet and spicy) 2/5 very sweet and nothing spicy. It tasted like lumpia dipping sauce...\nMiso garlic pork belly 2/5 flavors didn't go together and pork belly was cut too thin\n\nOverall, pretty disappointed with the food. The flavors didn't go together and nothing authentic. The banchan was mediocre. OH the water had stuff floating inside it (was hoping it was lemon bits). \n\nWon't be back.", "author": "Elaine C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-06", "description": "Newly opened Korean restaurant in the Excelsior. They take reservations but not sure why they require you to arrive 10 minutes early to confirm your reservation... First I have EVER heard of this.\n\nThis is a pretty pricey Korean restaurant considering their portion sizes.\nBYOB - Bring your own booze. They will provide shot glasses and bottle openers. No charge.\n\nKorean tacos - pretty standard size. Taste was good. I liked how they packed each taco with a good amount of meat and kimchi.\n\nRamen - gooood. Though it was just packaged ramen, with packaged slice cheese, and canned spam. All ingredients you can buy yourself and make. \n\nWings - YUMMMM WINGSSSSS They were good. Flavorful. They put a LOT of garlic on the garlic fried... idk what I was expecting LOL.\n\nDefinitely worth a try. They have potential to be a really good restaurant for the area.", "author": "Benita M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-07", "description": "Came for the first weekend these guys opened up for their brunch hours. Got the \"Hangover Soup\" and pork belly on the side. \n\nI never write yelp reviews but this place is the bomb! Legitimate Korean food made by Korean people (heard 'em in the kitchen) at very reasonable prices. Service was good and simple, and it was an easy and comfortable experience all around.", "author": "Josh K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-16", "description": "When you call in an order for pickup, & you get a really nice employee on the line, that's always a plus.\n\nAnd when the food is fresh, flavorful, & introduces you to a cuisine that you're not already familiar with, that's always a plus.\n\nI don't know anything about Korean food.  So Hwaro was a welcome adventure & experience.  The space (formerly the goldilocks bakery) is all shiny & brand spankin' new.  It looks NOTHING like it did before.  And the staff were really top notch.\n\nMy order was gyoza, the stuffed mushroom, & the pork belly entree.  The stuffed mushroom was a nice surprise.  Filled w their specialty beef & topped w cheese, it was hearty, earthy, & comforting.  A great appetizer.  But the pork belly was fantastic.  Spicy, tender, & full of flavor.  If I had known that Korean food was this good, I would have been eating it already!  The only negative is that my gyoza was forgotten.  There were 3 containers in the bag, so I didn't realize until I opened them at home that one of those boxes was holding lettuce leaves & sauces instead of gyoza.  The staff member that took the order repeated back the gyoza, but evidently didn't write it down, since it wasn't on the receipt.  Mistakes happen, & it wasn't worth going back for.  \n\nMissing dish aside, this meal was completely delicious & an all around winner.\n\nA great addition to mission terrace.\n\n4 stars.", "author": "Veronica M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-19", "description": "What? A Korean restaurant in the outer Mission!   Totally found this place on accident and so glad we did.  It was definitely authentic and with a modern ambiance.  I hope this place will be around for a long time as we're so close to it.  Thank you for being here.  Ordered the Korean Ramen with the spam, the broth was flavorful.  The half half fried chicken was so garlicky and crunchy (must order).  We also got the seafood pancakes to push our appetite to the max.  Also not a disappointment.", "author": "Justin L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-26", "description": "I was surprised at how delicious this was! I'm not a huge fan of fusion menus, but the dishes here tasted great. The interior has a very modern, hipster flair but the food tastes authentic. One downside is that dishes are pricey and you don't get the typical authentic complimentary side dishes. But some main dishes come with a tiny side of kimchee and pickled cucumbers. \n\nBulgogi: really really good! Juicy, flavorful, not too fatty, and fantastic miso dipping sauce. \n\nTaco Trio: love the different varieties of meat in the taco and the kimchee! Flavors worked well with the tortilla. \n\nSeafood Pancake: I would've liked it a bit crunchier, but they do give a very generous portion of seafood. \n\nKimchee Fried Rice: delicious and very flavorful. Highly recommend!", "author": "Carolyn L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-03", "description": "3.5 STARS\n\nThe Excelsior is an under the radar neighborhood in San Francisco. If you're not a native San Franciscan, you've probably only heard of the area because of Joe's Cable Car Restaurant (now defunct) that was featured on The Food Network. Good riddens with your $20 crappy burger served on a plastic plate, $7 sharing fee, and side of stank face. \n\nAside from awesome taquerias, Excelsior's food scene is non-existent until Hwaro soft opened a month ago. The menu is a mix of traditional and fusion Korean dishes (from Kimchi Jjigae to Korean Tacos). Prices are reasonable for SF standards and portions were generous. It's currently BYOB until they get their liquor license so definitely stop by Kukje beforehand and bring in soju and beer. Reservations accepted. \n\n~ * ~ F O O D ~ * ~\nThe banchans: kimchi  and cucumber salad were weak which is usually a bad sign for a Korean restaurant but the food turned out pretty decent. I like that they provide you with lettuce wraps upon request and they have purple rice (yay!) but they charge you $2/bowl bit.ly/2dE0nkp. \n\n*Kalbi: Marinated Beef Short-Ribs (LA cut) w/ banchan, lettuce for wrapping ($25) - 4.5 STARS\nbit.ly/2dC2mjY\nThe table's favorite, the Kalbi was perfectly marinated and grilled. Each savory sweet piece was nicely charred, marbled, and very tender. On par with the Kalbi I've had in the South Bay. \n\n*Taco Trio w/ bulgogi, spicy pork belly, kimchi, lettuce ($8) - 4 STARS\nbit.ly/2dp8cqL\nA really good value since there were generous amount of tender bulgogi and pork belly but the marinades were both sweet. A wedge of lime would have been perfect to cut through all the sweetness. \n\n*Korean Fried Chicken: Half Garlic, Half Sweet-Spicy ($16) - 3.5 STARS\nbit.ly/2cNwLL7\nWe requested half regular and half sweet spicy but received the garlic instead of the regular. The KFC batter is thick and crunchy and the chicken was moist and juicy. It was underseasoned but I prefer that over it being overly salty. The garlic mixture was raw, minced garlic and sugar. It was unappetizingly astringent and cloyingly sweet so we scraped it off. I didn't try the sweet spicy one. Accompanying pickled daikon was great - crunchy and nicely pickled.\n\nKimchi Fried Rice w/ pork, sunny-side up egg, seaweed ($12) - 3.5 STARS\nbit.ly/2d8MMw4\nThe fried rice was on the bland side since the kimchi was mild and not very fermented, but the perfectly cooked egg with an oozy yolk added a nice, creamy \"sauce\".\n\nSamgyupsal Gui: BBQ Pork Belly, spicy sauce ($19) - 3 STARS\nbit.ly/2cXBRIb\nIt was a pretty large portion of pork belly but it was chewy and the \"spicy\" sauce was more sweet than spicy. \n\n*Haemul Pajeon: Seafood Pancake w/ shrimp, squid, chives ($14) - 2 STARS\nbit.ly/2dDYfJb\nThe pajeon wasn't thoroughly browned and there was too much batter so it was doughy. Squid was chewy and there weren't any shrimp as per the menu. Dipping sauce (soy-vinegar) was good though. \n\nKimchi Jjigae: Kimchi Soup w/ tofu, veggies, pork belly ($12)\nbit.ly/2dL7k2x\nI didn't try any but my friends seemed to enjoy it. \n\n~ * ~ S E R V I C E ~ * ~\nAll the servers were green but very upbeat, friendly, and attentive (kept our water glasses full). I brought a birthday cake as a surprise for the birthday girl and the server asked the birthday girl, \"Did you want me to bring out your cake, or did you want to save it for another time?\" \n\nFAIL.  \n\nUnderstandably mistakes happen but going forward, they should pull aside the customer who brought the cake or wait until the customer asks for it. \n\nSince it was a busy Saturday night and there was a constant flow of customers, it would have been nice if the owner was proactive, pitched in with her staff and/or interacted with customers. Instead, she was having a full, sit down meal with her dining companion at the bar for the majority of time we were there (2.5 hours). Obviously, her restaurant, her rules but it came off unprofessional.\n\n~ * ~ A M B I A N C E / D E C O R ~ * ~\nThe space is minimalist and hipster. Good for parties of 2-4 and there's two communal tables that fit 6 people each. When we arrived, the ambiance was very upbeat and lively with the pop music that was playing...just as any fun Korean restaurant should be (like Playground, Tonight, The Spot, and Toyose). \n\nThe music soon turned into odd mix of slow, depressing jazz tracks when the owner started having dinner at the bar. Since the music was dampening the mood, my friend's bf kindly provided feedback to one of the servers. She spoke with the owner who changed it for half a track, then changed it back to the slow, jazz music, and returned to dinner with her dining companion at the bar. Again, her restaurant, her rules but she didn't seem receptive to feedback which is unfortunate. \n\n~ * ~ P A R K I N G ~ * ~ \nDifficult street parking. \n\nHwaro is the first and only Korean restaurant in the area serving pretty solid food. Hopefully, they'll pave the way for more restaurants like this to open in the area!", "author": "Cherylynn N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-18", "description": "Delicious!!! I went with a big group, so I was able to try a good portion of their menu.\n\nFavorites!\n- Taco trio: love fusion tacos! These were filled with variations of lettuce, kimchi, bulgogi, spicy pork, and a creamy mayo-based sauce to tie everything together. \n- Garlic pork belly BBQ plate: We were debating between this and the galbi, and I'm so happy we went with pork belly! Tender and flavorful, and went well with the lettuce wraps (wish they gave only lettuce, the cabbage included was odd). I enjoyed the mini trio of sides that came with it (kimchi, cucumber, sauce) to enjoy the pork belly+lettuce with. Highly recommend! \n- Seafood pancake: Although I wish it was a tad bit crispier, this was delicious and made for a wonderful appetizer. Dipping sauce was yummy--I wish it came with more!\n\nOthers:\n- Kimchi cheese: Okay, I LOVE kimchi, but keep in mind that a lot of their dishes already come with kimchi. This dish was kimchi-overkill, especially noting that the majority of our dishes had or came with kimchi. I would pass on this one, and would try their cheese corn instead for some variety.\n- Kimchi fried rice: It was good, nothing extraordinary. Standard kimchi fried rice that didn't have any wow factor for me.\n- Garlic fried chicken: The garlic is apparently sweetened with combined sugar, but it just tasted (and definitely felt) like raw garlic to me. I would pass on this one.\n- Sweet n' spicy fried chicken: If you like a lot of sauce on your wings, then this might be for you! Personally, I would love to try their regular bare fried chicken instead--the meat itself is indeed crispy and juicy!\n\nI can't wait to come back for more; would love to try their korean ramen and especially the hangover soup that everyone raves about!", "author": "Kris C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-09", "description": "Glad Excelsior/outer Mission is being put on the map finally! Hwaro is a good choice when you want something different, Asian fusion-y, or Korean!\n\nMy friend and I came and ordered 3 things (which was way too much for us hahaha): 1/2 garlic and 1/2 sweet and spicy chicken, the taco trio, and the hangover soup!\n- Fried chicken: loved the KFC here, the batter was thick and crunchy and the wings were huge. The garlic sauce needs a little work (it's pretty much raw garlic and sugar), but I did like the sweet and spicy sauce (it wasn't spicy at all btw).\n- Taco trio: Loved this!! I love Asian fusion tacos so we had to order this. The combo of kimchi, lettuce, and Korean-marinated meat was delish! They came with a pretty generous amount of meat too.\n- Hangover soup: I thought this would be the most underwhelming but it was actually really good! The soup was very rich and flavorful and would probably taste good with some rice. The meat was suuuper tender in this soup!\n\nService was a little weird.. When we asked the waitress about certain menu items, she couldn't even describe them, lol!! Also when we got our receipt to pay with credit card (we split 2 cards), they forgot to include my receipt to sign.. Eh!\n\nI would love to come back and try the pork belly, galbi, or the bugolgi. We saw tables ordering these and they looked great with the lettuce wraps! The lunch bentos also look really good and are nicely priced.", "author": "Tara A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-24", "description": "We had bulgogi, the marinated beef with lettuce wraps and kimchi on the side. The portion is definitely big enough for two people. Loved it! \nCan't imagine how much of my grandpa loves the chicken", "author": "Chris C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-31", "description": "Meh. Taste is not bad, but price and lack of side dish for a Korean establishment was what dropped the stars down. Also, we went at 3:30 pm when there were only three other tables with customers, but service was still soooo slowwwwwwww. Only bean sprouts and kimchi as side dish, cmon..... And add $2 to get the hot stone pot for my already over priced bibimbap?!??! No!! \n\nWon't be back.", "author": "Susanna C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-06-29", "description": "The Glee soundtrack was playing on repeat the entire time we were in the restaurant. My personal hell.\n\nFood was great. Fried chicken was light and crispy. The hangover soup was rich with tender beef pieces.", "author": "Liz K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-05", "description": "This restaurant really impressed me with the food, service, and atmosphere. The kimchi appetizers were fresh, the barley tea was perfect, and everyone loved what they ordered. I had the kimchi soup, and it was absolutely incredible all the way to the bottom of the bowl. The bibimbop was very nice, too. A testament to its excellence was the number of people who kept walking in for take-out while we were served. I would highly recommend", "author": "Richard R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-05", "description": "We wandered into Hwaro at an odd time on a Sunday and it wasn't packed, but definitely had some diners. While I wouldn't go as far as to say that this is the best Korean restaurant I've ever been to, Hwaro had one of the best kimchi soups I've ever had. Seriously, it was revelatory. Extremely spicy with a little bit of sour/citrusy tang. It reminded me of the Tom Yum soup my mom made for me growing up. \nOften kimchi soup can end up tasting like cabbage soup that's slightly spicy, bc I think the kimchi juices slide off and the chef doesn't add more of those flavors back in, but this was not the case at Hwaro. The kimchi soup at Hwaro was totally full bodied in flavor - spicy, sour, and savory. Soup like this is difficult to replicate consistently so I'm curious to see if it will be as amazing next time around. \n\nThe japchae was really good too...but that soup, man. That soup will be in the back of my mind until next time.", "author": "Alison H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-05-06", "description": "Food = okay.\n\nKimchi fried rice with pork = bland. We were all looking forward to this dish, and were so disappointed by it. It was lackluster in flavor and spices.  $13.00.  \n\nHamul pajeon = good. $16.00. \n\nFried wings (1/2 and 1/2) = good. Original & sweet-spicy. This was our favorite item. $17.00.\n\nCorn cheese = surprisingly good. (I was expecting some awful rendition of corned cream.) $7.00\n\nPork belly with lettuce wraps = meh. Not what I expected at all. $21.00.\n\nHot barley tea = $2.00.\n\nCoke = $2.00.\n\nBeer = $4.00.\n\nService = friendly. \n\nSeating = mostly 2-tops and 4-tops, and a few tables with bar stool seating. I got us reservations but it was fairly quiet on a Thursday evening.\n\nPrices = moderate to expensive. $88.97 for dinner for 3, with minimal leftovers. \n\nIt's great to have a Korean fusion joint in this neighborhood but I hope they kick it up a notch, because the flavors were just not there for us.", "author": "Fannie S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-01", "description": "I love this place in the neighborhood. My favorite is the Kimchee fried rice which you can make vegetarian instead. I love the RnB soundtrack they have playing and it's a cozy place to eat with very friendly staff. Ask them and they will give amazing recommendations. We were seated immediately. \nI especially have to commend the young gentleman who served me and my girlfriend. I believe his name was Kaly. He was so on point with the suggestions, and taught us how to pronounce the food. He was a really hard worker.", "author": "Chad M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-03-26", "description": "Spot on for Korean food and slight soju drinking going on in this neighborhood.\n\nSquid was chewy and tasty with their spicy kimchi sauce.  They have pork belly bbq and beef ribs bbq to order sizzling up! \n\nBan Chan was adequate.  Their ramen soup was hot in temperature and good.\n\nI would say nice addition to the neighborhood for Korean food and soju drinking.", "author": "Tiffany D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-27", "description": "Best kalbi in the Bay Area. Also recommend the getting 1/2 original, 1/2 garlic fried chicken and seafood pancake.", "author": "Chad L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-30", "description": "This place is grrrrrrreat as Tony would say \nBUT\nmy only complaint is that they give you SO LITTLE banchan.  I'm used to going to Korean places and getting like 9 little plates of barchan! You only get two tiny dishes of cucumber salad and kimchee. \n\nOther than than I really like everything about this place.  The ambiance is casual-hip, the servers are all quite nice, and I've never had to wait to be seated, it's generally half empty.  \n\nThe food I ate last time I was there was great I shared the stuffed mushroom - which is a giant mushroom STUFFED with melting oozing delicious cheese.  I also ordered the pork belly dish, SO good and low carb!\n\nI will be back.", "author": "Christina L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-02-25", "description": "SERVICE: There were only two male waiters, who seemed new to working in a restaurant, because they didn't serve us any water till they bring our meal. The appetizer was served much after we ate our entree. It was not even busy because we get to pick out table for two.\n\nFOODS: We ordered the tacos trios which were unique and delicious from other places. It's creamy sauce and tender meat hit the spot. The japchae and the bibimbap are good portion, but it doesn't taste like it's out of this world. Good to try once.", "author": "Yingying Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-16", "description": "Food was excellent and service was superb.\nYou also want Josue as your server - personable,  attentive, and the kind of guy you want at any restaurant you go to.\n\nHalf-half fried chicken - classic flavors for KFC but the chicken itself was juicy and tasty.\n\nPork Belly BBQ - can't go wrong with pork belly and very plentiful. Add extra spicy sauce to your lettuce wraps, and don't be afraid of the garlic.\n\nAsparagus - lightly charred with sesame and smoky flavor. Surprisingly good.\n\nBanchan was simple (Kim chee and cucumbers only), but our server was quick to ask if we wanted more. And you want more.", "author": "Russell T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-22", "description": "Best in town.  Been here several times.  Always very good food, people n service.  Great dive bar next door.  Pissed Off Petes", "author": "David B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-09-27", "description": "UberEATS review: Ordered from them twice. First time they missed the Bulgogi, the second time they missed the wraps on all my barbecue items. Unacceptable service if you were to do delivery.  \n\nItems are on the pricier side and tbh not worth it. \n\nHangover soup - expected to have more soup... the veg and meat are overwhelming\n\nKalbi - small portion for $27, otherwise it's tastes good\n\nMiso pork belly - salty. It would be alright if paired with vegi wrap\n\nJapchae - great taste\n\nCorn cheese - They put tempura crumb and tomato sauce... meh\n\nHalf and half Chicken wings - like the sweet sauce. They do put big chunk of garlic. Not impressive. \n\nEnd note: spent too much on a mediocre restaurant. not coming back.", "author": "Ada L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-29", "description": "Food is really good! It usually takes between 15-30 minutes though, so be prepared to wait. The four stars (instead of 5) is for the wait.\n\nI want to emphasize the quality of the food! Really savory and tasty :)", "author": "Austin N."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-07-14", "description": "Perhaps my expectations were too high. I was hoping for very flavorful dishes, but everything was pretty bland. Dishes were covered in sauce, but that didn't help much. Our table ordered cheese corn, spicy squid, kalbi, trio tacos, and tteobokki--nothing stood out, and my friends and I left (after spending $70+) feeling hungry. As I write this review, we're heading to get somewhere else for food. If you want delicious and satisfying Korean food, just go to a traditional Korean restaurant and do not bother with this \"fusion\" place. Oh yeah, this is a small-plate place, and it's true...their portions are super small and not worth the $$$.", "author": "S Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-27", "description": "I came here for a girls weekend out. \n\nfood\n\nThe trio korean tacos appetizer was amazing. The meat is juicy and tender and flavored sooo perfectly! The fried chicken was so much battered and so tasty. kimchi fried rice was done very well, it's amazing how they can make a simple food dish so delicious. In general, very deliciously prepared food! this is a family owned restaurant and I felt the family warmth inside each dish. \n\nambiance and service\n\nexcellent! the owner came to talk to us and make sure we are taken care of.\n\nwine\n\nwhen the owner came over, we asked for wine recommendation. Rather than recommending the most expensive wine on the menu like most owners would have done, she recommended the cheapest wine on the menu. I think it was a sauvignon blanc. She said she thinks that will pair very well with what we were eating. She was absolutely right! That wine was so tasty and paired with the food was amazing! We asked her well and how she picks her wine. She said she went to visit a lot of the wineries in napa etc and personally tasted countless wines (can't say I feel sorry for her :)) and hand picked a very small selection for her restaurant. We were all very impressed\n\nIf I didn't live across the bridge from this lovely gem of a place, I would be dining here every night :)", "author": "Danika Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-01", "description": "Yum! Great service and food. Perfect for a large party. :) :) Josue was super sweet and patient with the birthday boy and friends! Highly recommend.", "author": "Maria F."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-06-22", "description": "There have been many chances where I've been able to eat good ramen. This was not one of them.\n\nThe quality of the noodles is instant ramen quality. I'm actually quite confident it was instant ramen.\n\nI added cheese. They gave me a single slice of American cheese.\n\nIncredibly disappointed by the Korean ramen.\n\n2 stars overall. One earned for service passing. One for the Taco Trio.", "author": "Alvin D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-08-19", "description": "The Garlic Chicken was prepared well and looked appetizing, but let me just say that there was literally about 1/4 cup of minced garlic on the chicken. Even after removing it, the strong garlic taste remained. I absolutely love garlic on my food (I always add twice the amount called for in recipes, but this was way over the top.)\n\nThe staff was pretty subdued in friendliness. I'm sure they were very nice people, but it didn't show.\n\nThe decor was very nice. The walls were painted very hipster.\n\nAll in all, I wouldn't return but the place has a lot of potential for improvement.", "author": "Paul P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-30", "description": "Awesome place in the Excelsior. Great food, reasonably priced, nice atmosphere and friendly staff. \n\nThere is a wide selection of food on the menu and many interesting dishes. Hwaro's fried chicken is the best Korean fried chicken I've ever had.", "author": "Bill M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-06", "description": "delicious! I love their kimchi fried rice, and their fried chicken. Great spot for date night :)", "author": "Kel H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-10-20", "description": "Came here for dinner on a Wednesday night with the boyfriend. We ordered the French Fries (topped with kimchi), Taco Trio, Kimchi Fried Rice, Japchae, and Kimchi Soup. Yes, I know, that's a lot of food for two people! \n\nThe french fries were the first to come. A third way into the fries my boyfriend mentions that these fries remind him of McDonald's fries. He spent the rest of dinner convincing himself (and me) that these fries are old fries (when I say old, I mean fries that have been left out for a few hours) from McDonald's. Everyone knows what leftover McDonald's fries tastes like, and these kimchi fries definitely tasted like that. Don't get me wrong, the fries were pretty delicious (although it would've been better if the fries were waffle fries, so it can hold the kimchi and sauce more)! But the thought that these fries may have been possibly from McDonald's was just so shocking. \n\nAnyway, enough about the fries. The Taco Trio was very flavorful. It's an appetizer, but I think it's enough to be a meal on it's own. Kimchi Fried Rice was pretty good, good amount of spiciness but lacked a bit of salt. I was not a fan of the Japchae. I don't eat Korean food often so I'm not entirely sure what it's supposed to taste like, but the noodle texture was just not that good. I only had a spoon of the Kimchi Soup and I thought it was extremely sour. Not sure if that's what it's supposed to taste like, but my boyfriend enjoyed it.", "author": "Lina C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-11", "description": "Huge restaurant with tons of seating. First time here and probably my last. The sweet potato with mayo that they serve as an appetizer was weird. Such a weird thing to serve, or is it just me who thinks it's odd? My bf and I ordered the kimchi fried rice, japchae, and the half and half spicy chicken wings (garlic fried and sweet spicy). Favorite dish out of the three has to be the kimchi fried rice. Can't go wrong with ordering this usually. However, the japchae was not good at all. I thought it was just me, but shortly after, my bf commented the same. For the fried chicken, the garlic fried chicken just had a slab of minced garlic placed right on top. When I ate it, didn't know it was going to be like that so I bit right into a huge mouthful of garlic. It's weird how they just put the garlic all on top in one huge chunk. As much as I looove garlic, that was mehhhhh. The sweet spicy flavor on the other hand, was actually really delicious. For the price and the food, I'd much rather go to another Korean restaurant. Service wasn't too great either. However, glad I was able to try this place and unbookmark it.", "author": "Annie H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-30", "description": "A new, modern Korean restaurant in the Excelsior playing bossanova? YES!\n\nI was a bit upset when I saw Goldilocks close. I had recently been there and while it was my third favorite Filipino restaurant in Excelsior, they did introduce me to some new stuff.\n\nMy mood changed when I saw the sign on the door saying the new place was Hwaro, a Korean restaurant. Excelsior has Filipino, Japanese, Thai, Laotian, Vietnamese, all types of Chinese. But we don't have Korean. \n\nLet alone one that serves alcohol.\n\nThis week they are going through a soft launch - they don't officially open or have a working credit card until 9/5/16 - but are taking customers. The lunch menu is very different from the dinner, which also explains the large break in between.\n\nWhen I walked in on a Tuesday, there were a few groups eating - and I do recommend coming here in a group or on a date so you can try more. I sat by myself and spent time on the menu. They have a number of small plates that sound great like the Taco Trio, gyoza, and asparagus because something has to be green. \n\nThere are also big plates which are must shares. Three types of KFC (Korean Fried Chicken), kimchee fried rice, seafood pancakes, tonkatsu. They have Korean ramen and a Hangover Soup! \n\nI went with the sizzling BBQ eel. I love eel, heck I've had eel fried rice directly across the street. The great waitress warned me it was only 6 pieces but that was enough for tonight. Along with it came some lettuce to make wraps, some banchan, and I ordered a side of rice. It was delicious and it will be hard not to order it again.\n\nOr live out a dream and special order a BBQ eel taco.\n\nAfter finishing up I got to talk to the two waitresses, the owner Ina jamming out to classic bossanova, and the head chef Ryan. They explained some of the backstory, how they will soon be getting three types of Korean beer (including Hite!), shoju, and wine, and that the neighborhood has welcomed them. \n\nI really like Hwaro and feel it not only adds a culinary option to Excelsior, but adds a more modern option as well. With Rocks Den, Sushi Raw, and now Hwaro, this part of Excelsior is getting some gentrification. Not white people (says the white person), but more gentrifying for Millenials - modern locations with a modern vibe. I don't want the area to be completely changed - I may actually be addicted to Baby's lumpia - but I like that we are getting options to take groups or dates to. Excelsior isn't only for cheap lunch, and Hwaro helps this.\n\nUPDATE: I came over for lunch and got the sweet and spicy fried chicken bento and the pork belly quesadilla. The bento came with side salad, some of the least greasy japchae I've ever had, two dumplings, rice, kimchi and 4 wings covered in sauce. Ask for extra napkins! I definitely got a lot of sauce on my face/beard. The wings were cooked perfectly, and the sauce was both sweet and spicy. Not bad for the amount of food I got.\n\nBut the pork belly quesadilla stole the show! I want one right now. Full of delicious pork belly, kimchi, cheese, sauce, and I want to say butter because it was decadent. Still can't wait to bring people here.\n\nUpdate 9/18: Took two friends here for dinner to finally get a group dinner going. We got:\n-Corn Cheese - basically a skillet filled with sweet corn and mozzarella cheese. Two things I love\n-Gyoza - I'm a sucker for dumplings\n-Rice Cake Skewers - Because it was my birthday, the owner gave these to us on the house, and explained that growing up in Korea, this was one of her favorite street food snacks. We got two skewers with about 5 rice cakes on top, covered in the sweet and spicy sauce from the chicken wings. If you like sweet and spicy, these are really good, a bit chewy. Glad I got to try these!\n-Kimchee Pancake - one of my guests doesn't like seafood, which is why we got this. Turns out he also doesn't like kimchee, SMH. This was delicious.\n-Kimchee Fried Rice - yeah, my friend didn't have the best meal, but his loss. This was delicious, spicy fried rice with some seaweed which gives it a really interesting flavor. But man that pork belly is so good.\n\nOh, and for my return trip I was recommended trying the miso pork belly.\n\nAlso they have the cleanest bathroom in Excelsior.", "author": "Michael C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-17", "description": "My friends and I went to an event and we were seriously super hungry afterwards. We were craving Korean food and had to quickly pick a random place nearby that was open since most Korean restaurants close midday. We eventually found this place that looked really nice from the pictures. \n\nWe arrived to the area and I'm being serious when I say the location was really sketchy and scary. My friend got hit on by an old man, another old man waving at us from above his apartment with a Chucky doll, and there were even boys calling us from across the street. No joke, this all happened just walking 2 blocks down to the restaurant. I know this doesn't have anything to do with the restaurant itself, but I thought I would mention it just for the safety of it.\n\nAnyways, we came in and it was pretty empty except for 3 middle aged and elderly men sitting near the counter(?). We all thought they were employees at first, but they kept staring over at our table. Literally without any shame. They even turned around to watch my friends walk towards the bathroom. Overall, for the location and experience I would have given it a 1 or 2 star(s).\n\nNOW ONTO THE FOOD. My friends ordered bibimbap, taco trio, and kimchi fried rice with pork (?), while I ordered tteokbokki with ramen. I can't speak for my friends' meals, but they all really liked their food. I also really enjoyed my meal as well! Maybe personally for me, the sauce was a bit salty, but I still enjoyed it. \n\nLastly, the service was pretty good. Not amazing, but better than most places. They were very friendly and kind. The only issue was that they were a bit slow and didn't seem to pay attention when we called them at times even though the restaurant was empty once those creepy men left. \n\nI was debating on giving this place three stars, but despite everything, I still liked the food, so four stars it is lmao!", "author": "Sharon T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-08-27", "description": "didn't hear one person laugh the first 15-20 mins* i was in the mzafza. no wonder i'm single - if all those dullazz convos are what dating is, remind me to delete my tinderoni and not even bother getting my own cookie lyon. wait no i do want a cookie lyon.\n\nTL;DR once the chicken's fully cooked this will be one of my #guiltypleasure / #straightfromthegym spots.\n\nNLE;DR only reason i'm not saying 4 stars is too many pieces of pinkish / rawish fried chicken. but i told ms owner #ladiesispimpstoo, and i'm confident their fry game can rectify #soquicksofast.\n\n(-_^) Sweet-Spicy Fried Chicken $8/$16 (http://bit.ly/2btJKEo)\nvery sweet, not spicy. generous crust\n\n(-_^) Garlic Fried Chicken $8/$16 (http://bit.ly/2bTm5OZ)\n\"garlic heaven\". bigbody crust\n\n(-_^) Taco Trio $8 (http://bit.ly/2btKdqf)\nwish other k tacos would learn from these\nalso wish tortillas warm or lightly toasted\n\nMUSIC likeabossanova, jazz\n\nPATRONS families, coughboringcough dates\n\nSILVERWARE some ikea (that's a good thing)\n\nDECOR classyish yet spacious enough to relax\n\nalcohol and more menu items planned. i'll give them time before returning. but you can bet it'll be on my mind till then. #datnunadoe ;p\n\n*yes i timed it beezys. for your educational benefit.", "author": "Dan B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-22", "description": "The restaurant is not fully open yet but they are taking customers while they tie up all the loose ends. \n\nThe hangover soup is amazing, the perfect amount of meats, veggies and spices to cure the worst of headaches. They take a unique spin on traditional Korean plates such as honey glazed fried chicken and mozarella fish cakes while carrying the traditional items like bibimbap and seafood pancakes. \n\nThe decor is warm and inviting so you feel at home here.\n\nThe staff is very sweet and eager to help.\n\nDefinitely worth a visit.", "author": "Y L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-05", "description": "Everything is good! The taste and size of the food, the atmosphere, and the people! They are so friendly, especially the owner Ina and the chef her brother. It's one of the most authentic Korean food in the city. My favorite are kimchi fried rice and fried chicken!! \n\nbtw, they make the kimchi themselves. It's not from a third supply chain. I'm not a kimchi fan, but I really like their kimchi. You can tell it's really fresh and taste good. I would definitely come back!", "author": "Kathleen K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-22", "description": "Really good place with good solid food.\n\nWe tried the KFC, \"Korean Fried Chicken\", we requested 1/2 Garlic & !/2 Sweet and Spicy.\nThe chicken was really moist. The sweet & spicy was a bit messy to eat, but just work your way through it. It's worth it. This portion is huge, appx 10 pieces total, my wife and I took 6 pieces home.\n\nWe also tried the grilled skewered rice, first time having this ever. \n\nIna, I'm assuming the owner, mentioned she wanted to introduce it to San Francisco.\nBeer and Wine not yet available, but you are free to bring your own bottles.\n\nThank you to Team Hwaro for bringing a Korean restaurant nearby,", "author": "Geordie E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-07", "description": "What a great addition to the neighborhood! I'd been meaning to try Hwaro ever since it opened and was glad to find the opportunity to go last weekend. They have two veg main dishes, Bibimbap and Japchae, and multiple sides. My partner and I ordered both and shared them, both were excellent. My only complaint was that the music was too loud. Service was attentive and friendly, and the portions were generous. We also had some of the best sweet potato fries I've had in a long time, and kimchi tacos! I'll definitely be back.", "author": "Gaelen X."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-30", "description": "My favorite Korean restaurant in SF hands down. Staff is always friendly and helpful. Delicious food, great ambiance...perfect for groups or for a cozy dinner...what more can I ask for?", "author": "Rosa A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-07", "description": "Solid place. I had the original recipe fried chicken from the brunch menu and it was great. Not\nKorean fried chicken per se (e.g., no spice or sweet elements in the flavoring), but the batter was very crisp and thin like a delicious Korean fried chicken or Taiwanese popcorn chicken situation. Service was great and the place is very nice. I hope they do well!", "author": "Ray N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-01", "description": "Super!! Great service! Ramen was our FAVORITE :)  Enjoyed the atmosphere too.\nWe had Bulgogi and fried chicken both delicious.", "author": "Jason S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-10", "description": "Good Korean in SF is sometimes hard to find but Hwaro definitely sets the bar high for Korean that is approachable and modern with a nod to traditions. Ina and her brother Ryan run a tight ship and service was excellent. We were able to get a table for two with no wait on a Saturday night--a definite plus in my book! The mushroom with kimchee and cheese was simple but amazingly delicious-- a must try. The fried chicken which comes on a hot plate is crispy and succulent. Get it half and half with garlic and sweet and spicy sauce. You won't be disappointed. We also got the bibimbap with hot stone which gave the rice a nice crispy crust. I can't wait to go back to try the other items!", "author": "Jeff K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-11-28", "description": "The ttukbokki was good but too stingy with the rice cakes. Felt like there were barely any in there and they were cut in half.", "author": "Jessica K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-26", "description": "Came here for my kid's bday. He wanted to try a new Korean place ... we found this place and thought we would try it.\n\nHad the following:\n- Taco trio: quite yummy; although two of the tacos tasted quite similar\n- Bibimbab: very good; my kid loved it\n- Kalbi: they actually use good quality meat!\n- Soup: don't remember the name; it's the one that has pork belly, although I substituted that with vegetables ... it was spicy and delish!\n\nOverall, I loved this place. All four of us walked out happy and stuffed.", "author": "Ankur V."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-12-21", "description": "Food poisoning.\n\nI ordered taco sampler and the kimchee fried rice with pork for take out.\n\n1 hour after eating the kimchee fried rice with pork..I did not feel good. I vomited non-stop from 11pm to 2am. I was contemplating going to the hospital. Still recovering the next day..\n\nBad pork? Or just not a clean chef?  never forget the risk of someone else handling and cooking your food.\n\nThis was my favorite korean spot and it was right by my house. Never eating here again.", "author": "Gabriel S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-10-04", "description": "Only skinny people eat here. The place is empty because the food is pretty bad.  It's not real Korean food.  I was looking forward to the chicken wings but it tasted like fatty chicken skin.  Nom nom", "author": "Fatty A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-02-14", "description": "First time coming here, it's Valentine's day. Thought we give this place a try since we live up the hill from here. (Support the neighborly restaurant)\n\n2 Stars because we waited over 45 minutes for our food. Other half of our food never came where we just cancelled overall and asked for the check. Waited another 5-7minutes, but at this point we just wanted to leave. Husband had to go up to the register to pay, he waited in line for another 3-4minutes (since it was a long line of TO GO DELIVERY ORDERS. Took us a grand total of 1hr and 40 minutes at the restaurant, not intentionally.\n\nBased on the food we DID receive...\n- Japchae topped with Bulgogi was pretty good \n- Seafood pancake was flavorless, not crispy enough and too doughy \n\nWe had originally also ordered Fried Chicken, half original half sweet spicy. And a side of rice.\n\nUnfortunately we won't be back, at least not until they get their system together. Plus everything was kind of on the pricier side. The overall experience didn't feel very comfortable because you can feel how overwhelm everyone was, customers and employees and the owner.\n\nPlus, the tables were places SO closed to each other we can hear our neighbors convos and vice versa.", "author": "Eva H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-11", "description": "Best new find for homey Korean food!! Love the Kimchi  Fried Rice with Pork, Bulgulgi and Hangover Soup.  Finally a new destination in the city without going down to the South Bay.....", "author": "Jen W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-02-04", "description": "I really had high hopes for this place being that it had the chutzpah to open up in a place like the Excelsior, but the food just wasn't that good. :(\n\nOrdered the tteokbokki and the fried chicken. The fried chicken was expensive at $17 and I was hesitant to get it because of that, but my friend said let's just go ahead and try it because you can't go wrong with fried chicken. Well, this fried chicken just wasn't that good. I felt like the batter was too thick and a bit flavorless despite the garlic it came topped with. I can understand using a thick batter to get a good crunch to the chicken, but I really didn't enjoy it. :(\n\nThe tteokbokki was drowning in a sauce that had a strange artificial and syrupy taste that I didn't enjoy either. It came served in a big, wide bowl, but the actual portion of rice cake seemed a bit small for the price.\n\nAnother problem I had was with the seating at the tables to the left hand side of the restaurant. The tables were so uncomfortably close to each other! I felt like I was having dinner and listening to the drama of the diners intimately next to me. There was so much space in the middle of the room being unused. Why? Is it for special events?\n\nThe food wasn't good and it was expensive for the quality. Definitely not coming back and not recommending Hwaro to others. Sorry. Skip this place and go to the Korean restaurants at Westlake in Daly City or the one at the end of Ocean Ave.\n\nAnd I just realized, NO BANCHAN. I'm even more disappointed now.", "author": "Enari L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-22", "description": "Lived in this area for many years and have not noticed this restaurant until recently when I found it on Yelp. Most likely this restaurant was opened recently, since this area was known for their empty storefronts that sat empty for years. This is literally the only Korean restaurant in the Excelsior. I believe that this restaurant took over the former Goldilocks Bakery space. Walked into the restaurant and noticed the divey and hipster look with a bar on the right that serves beer, wine and soju. We ordered their Sweet and Spicy Fried Chicken and Tteok Bokki (Rice Cake) with Ramen. The Fried Chicken had a very nice breading and the sauce was not too spicy. The Tteok Bokki had a similar sauce to the Fried Chicken, but was not as spicy. We also added ramen to the Tteok Bokki, but the portion of ramen was very small. The service here was okay for a Friday night with not too many customers. The service was not very attentive, despite there being two waiters working and three tables occupied in the restaurant. The waiters actually forgot to bring us our beer. Overall a good addition to the Excelsior, but the service and portions of the food can be better.", "author": "Peter C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-17", "description": "Hwaro is a must try Korean spot. This restaurant is unique compared to other traditional Korean restaurants because it has food on the menu that I have never tried before, more closer to a fusion restaurant. Came to the restaurant on a slower day and I would say that I was very impressed with the food and service, definitely a restaurant I would come back to", "author": "Stevenson C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-08", "description": "Food - 4 stars\nAmbience - 3.5 stars\n\nWe ordered the king mushroom and asparagus for appetizers. Both were delicious. For our main course, I can comment that the BBQ is very well done here. I highly recommend the kalbi short ribs and the eel. Both were incredibly delicious. We were very disappointed to learn that they were all out of the Korean fried chicken probably because the table to my right ordered the last bit of fried chicken, did not finish and boxed it up to take home :( , so we ordered the bulgogi beef instead. I do not recommend that dish, it was quite bland. \n\nThe ambience could be further improved by adding more seating, diming the lights in the dining area and more lighting behind the bar area (current lighting arrangement makes the restaurant seem closed). I recommend this restaurant be attentive to the small details on the walls (for example, the screws on the big knife and fork were very large and visible. \n\nAll in all, I will be back again for another try, and hopefully be able to get my hands on those Korean fried chicken.", "author": "Jenelle L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-03", "description": "Love this place. Hangover soup, Jabchae and taco trio were delicious!  Highly recommend if you are new to Korean cuisine. Food tastes very authentic. Cheers!", "author": "EunJoo C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-11", "description": "The closest Korean restaurant I could possibly ask for. This place is a fusion so if you're looking for \"authentic\" Korean food, look elsewhere. They serve one of my favorite Korean soups: the hangover soup which, for some reason, is rarely ever offered in other restaurants. I'd say that you definitely dont need to order a lot to get filled up unless you have a huge appetite or want more variety. I still want more banchan though lol\n\nThe waiters and waitresses are all very nice people and can accommadate you whenever possible. If you sit at the bar/really long table, the waiters dont mind talking to you. It's really a shame that they only open for dinner now. In the beginning, they opened for lunch but I guess there's too little business in this part of town during that time. =(", "author": "Victoria H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-02", "description": "I think this place just opened recently as there aren't that many reviews for it. Stopped by on a Weds night between Christmas and New Years to meet up with a friend for dinner. We order the tacos, fried chicken (half & half), and house salad. I really enjoyed everything. The tacos were for sure my favorite though. They were filled with tastiness! House salad was also very well dressed overall. It was quite large and definitely a good size to share. For the fried chicken, I would recommend just getting the sweet & spicy. The regular fried chicken is just pretty basic. It cost a little more to get half an half, so save your self a little bit and get just the sweet & spicy. Three dishes for us left us even leftovers. The service is good. They are pretty attentive and serve you water all the time. They also have alcohol on tap as well in case you're looking for a night cap.", "author": "Julie L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-27", "description": "The food they have here was very good and moderately priced as well. The garlic fried chicken was quite a hit for me. I loved the flavor and I made it my favorite dish here! The spice level for the other dishes here were definitely something to warn those who have low tolerance to spicy foods. Nevertheless, all them were delicious!", "author": "Natasha R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-04", "description": "I came here around 7pm on a Saturday night and got seated pretty quick. My friend and I ordered the kimchi fried rice, taco trio (this was one of their popular and must try dish) I wasn't disappointed because it was so good! We also got the wings (1/2 garlic and 1/2 spicy). The wings was so tasty. I would definitely be back and try their other dishes!", "author": "Louise C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-01", "description": "The bibimbap is the best! Worth ordering in the hot stone for the full flavor experience. $16 but it is a good sized portion and has a lot of ingredients. I will definitely be back!", "author": "Shannanigans001 .."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-24", "description": "Great food, great people, jazz music. \nSimply beautiful.\n\nTry the hangover and the kimchi soup!", "author": "Katerina S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-25", "description": "I'm Korean and have tried several Korean restaurants in TX and CA. Best Spicy Beef Soup (Yuk-Gae-Jang) and Spicy Squid in SF!! Highly recommend!!! Staff are very kind and nice. Decent Korean food place you should try! :-)", "author": "Sam P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-22", "description": "Very good, we got the kimchi soup and the taco trio and it was very filling. The soup was more than enough for two people and the taco trio was also very tasty. Will return.", "author": "Andrés Q."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-05-28", "description": "2 stars for trying. Korean fusion. Great idea, but IMO wrong location. Pretty expensive for such a simple menu and especially in this part of SF.  portions are medium to small depending on what you order. Parking is very limited and tight.  Food was ok only. To make the effort here it would have to be mind blowing. Employees are nice and service was OK only. during the evenings be aware of your surroundings. There is so many competitors to drive to. Honestly if you goto a traditional Korean restaurant you will get more bang for your buck in comparison to this place.", "author": "Cee B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-11", "description": "Really great food!\n\nHas a nice atmosphere, especially if you want a few drinks with your food.\n\nThe food could be spicier, great flavors though.\nYu ke jang: great portion, not a lot of noodles but more beef than most places in SF give.\n\nDukbokki: could have had more rice noodles, but large helping of cheese and ramen on top. Sweet not spicy\n\nKorean ramen was good too.\n\nWill be going back to try more soon!", "author": "Ellie M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-08", "description": "Really liked this place, good service and food.  I recently moved here from the Richmond district where we had some of the best Asian food in the city within a short walk, so I was worried about our prospects here, but those worries have been soothed.  I've never seen a lot of people in there though...so if you want good Korean food and live around here please go here!  You won't be disappointed!", "author": "Bill H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-17", "description": "The garlic fried chicken was amazing!! The staff was very friendly, and helpful with the menu.", "author": "Cory T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-13", "description": "This was amazing. I was honestly shocked just how good it was. \n\nI got the pork belly grill plate. My wife got the steak. Portions were huge--and so delicious. I first thought it was a little pricey--then I saw what you got. Worth every single penny. My mom ordered she Kimchi fried rice too, by the way. We are all really happy. \n\nThis place is another addition to what the hood needs. Great food, great spot, great service. Thanks so much, I will be back.", "author": "Chad G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-19", "description": "I'm beyond impressed by everything we ordered tonight!! We got sizzling pork belly, asparagus, King oyster mushroom, hangover soup, and garlic fried chicken! Every dish is delicious, garlic fried chicken and sizzling pork belly are my favorite. Service is wonderful, even though they just opened for 1 week(no advertising, not even soft opening yet) it's already crowded and throughout the night till they close.\nI can't wait for the grand opening!!! Will definitely go back and invite my friends there.", "author": "Fanny Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-05", "description": "Good neighborhood spot to eat at. Came in during dinner and there was no wait time. The trio tacos were the bomb dot com. Clean space and nice open set up. Waiters were also pretty nice and friendly", "author": "Luis T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-26", "description": "I use to live right on Sta Rosa Street.  This Korean place finally opened... I am impressed.  Met the owner Ina,  her staff in the kitchen is her Mom and brother.  The restaurant is family business,  she has another place at International restaurant on Kearney.  The food is very authentic and \"good\".  We order the hangover soup, the sizing pork belly,  garlic friend chicken,  asparagus and mushrooms.", "author": "SFoodie P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-25", "description": "Having recently moved to SF from Los Angeles, it was a pleasant surprise to find a Korean restaurant in the vicinity. Customer service was a bit lacking as  I had to keep waiting for the waiter.\n\nThe four stars is reflected only on the quality of food. Ordered the kimchi fried rice, which tasted decent but it's far from the best I've had. It wasn't too spicy for those heat lovers and the flavors were definitely there but the price was a bit much for my liking. \n\nCustomer service would've definitely dropped this place to a 3.5 stars but it's still not a bad Korean restaurant to check out in the end.", "author": "Anson L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-26", "description": "The food was unexpectedly good, we came here and we're surprised by their good service and wonderful food!!!", "author": "Joe C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-03", "description": "Good food and service. They put a good spin on traditional asian dishes and every dish we had was good.  Not the best but pretty good.  Service is the most stand out thing actually of this place.  All the servers are respectful and kind. Highly recommend this place.", "author": "paul k."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-26", "description": "Went there last night and enjoyed the experience/food.\n\nDefinitely love having different types of restaurants in the outer mission area. Not many other restaurants besides mexican or chinese food, so korean was a welcome change.\n\nThe interior and decor was very unexpected in a good way.  Modern and minimal design with large open space. \n\nThings we ordered:\n\n- Rice cake skewer\nfried/grilled korean rice cake with a sweet spicy sauce.  Texture was great, crunchy outside, gooey inside.  Sauce was nice and balanced.  One thing I would suggest to make it even better is to add some green onion slices in between the rice cakes. Also some sesame seeds on top.  I think that would bring out another level of flavor.\n\n- Grilled eel plate\nComes out with dipping sauce, ginger, and lettuce to make wraps.  Awesome flavor and perfectly cooked.  Highly recommend getting this.\n\n- Garlic and sweet spicy fried chicken\nFlavor of the sweet garlic sauce was good.  Sweet and spicy sauce was similar to the one on the rice cake skewers. The chicken is pretty big and filling. The batter is pretty fluffy which makes the chicken look massive.  \nPersonal preference here, I don't prefer fried chicken with this fluffy kind of tempura batter, wish there was less batter or a different kind, my go to standard for asian chicken wings is at SO.  But with that said, I know others like this style, and the batter/breading was done well.\n\n- Cold bibim buckwheat noodle\nFlavor was good and the sauce was nice and balanced.\nOne suggestion is that it did not come with a hard boiled egg, or a slice of meat, which I think would complete the dish.  Also the portion was pretty small for the price, especially considering that an egg or beef slices were not in the dish.\n\n\nOverall, I enjoyed the restaurant especially considering it being in the outer mission area. I would give this place 3 1/2 stars, but bumped it up for location, service, and since it only just opened.\n\nDefinitely going to come back to see how it progresses, and once they get their liquor/beer/wine license. They have a nice bar setup, and hope they have some nice beers on tap (always goes good with fried chicken).", "author": "Baek C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-05", "description": "What a great new neighborhood spot! We tried it out on a Saturday night. It wasn't too busy--we got a table right away, but it filled up as we were there. We ordered the taco trio (it was not really my favorite. I'd skip it next time), sweet and spicy fried chicken (Korean fried chicken is so damn good), and pork belly. There was a mixup in the kitchen and we didn't get our pork belly, but they were very apologetic about it and brought us free seaweed salad (REALLY GOOD), and we'd definitely over-ordered and by that point we were too full for it anyway. The vibe in there is really nice and the service was maybe a little slow, but we weren't really in any hurry. Overall really good experience, even with the mixup over the food. They handled it very professionally. I'm definitely going back to try the rest of the menu.", "author": "Laura S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-13", "description": "Yummmmmm!! It was so delicious. The bbq short ribs were just fantastic. Bulgogi, taco trio, fried chicken and fried rice. Everything was just great and the service was excellent!", "author": "Kris K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-11", "description": "Best Korean food in San Francisco and A new hidden secret! Family business which you can actually enjoy modern home cooked Korean meals made with a generous heart.", "author": "Carlos S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-11-01", "description": "Came here when I was randomly trying to fill my Korean food craving and was surprised to see they opened this spot in the Excelsior/Mission area. My experience was overall good, it just seems they are still working out some kinks with a new opening (just received alcohol license). Service was also very friendly and accommodating!\n\n- Taco Trio was not too bad, would probably order it again. 3.5/5 Stars\n- Kimichi Soup was pretty good. It came with lots of pork belly, but the soup taste was just ok. Serving size is pretty large, so might be advised to share with someone if possible. 3.5/5 Stars\n\nHaven't had a chance to try the pork belly plate or galbi, so i'll most likely update this review once I try all those. \n\nOverall, I think the place has great potential and it is definitely has one of the nicer interiors in the area. Will definitely be returning soon. Please add a TV, that would really make it even better. :)", "author": "Mario P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-11", "description": "As a Korean native, this place cured my homesickness. Hwaro offers authentic modern korean dishes in a humble, clean environment. Unlike other Korean restaurants with a menu book of 10 pages, their menu is simple but various enough to satisfy different tastes. \n\nMy boyfriend and I tried friend chickens (half garlic, half sweet spicy), pork belly bbq, hangover soup, and ddeok go chi  -- The portion was huuuuge and all the dishes were served fast. If you go there in big group, it would really be nice to share different plates. \n\nThey are on the soft open period and are expected to fully open in 2 weeks. I am so looking forward to seeing it growing!", "author": "Juwon K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-27", "description": "I'll be back. We had some Korean tacos, fried chicken, and BiBimBap. Topped off with an OB pilsner, total with tax and tip was just under $60. Tacos were awesome in flavor. One problem was that it was hard to know what kind of meat was in the taco because of the flavoring added to it. Fried chicken wasn't bad - tasted like typical buffalo wings, except they were gigantic. We had the garlic and spicy and sweet. Both weren't bad - better than Buffalo Wild Wings for sure. The BiBimBap was pretty typical of what you would get at almost any Korean restaurant. All in all, quite good tasting food with a nice ambience.", "author": "Alton Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-20", "description": "This place is amazing! Every time I come in I practically inhale all of my food. I would say my favorite things to order are the Pork Belly, Yuk Ge Jang, and all of the fried chicken. \nFOOD:\nPork Belly: Umm yes I'll have another round! I am someone who typically does not enjoy pork at all and I almost always order this dish. The miso one is the best I would say. It has a salty miso flavor and the meat just melts in your mouth. No regrets when I get this.\nYuk Ge Jang: This is perfect for the cold gloomy days of San Francisco. I'm in love with spicy food and this is the perfect amount of spice. It's the perfect balance of spicy and salty. The portion of this soup blows my mind, I'm a big eater and I end up with leftovers.\nFried Chicken: GET IT. I like getting it half garlic and half sweet/spicy. For those who claim to like garlic and complain about the amount of garlic that comes on the chicken.... you're clearly not the garlic lover you thought you were. I love mixing the sweet/spicy sauce and the garlic together to get that all in one burst of yummy flavors.\nKIMCHI: Hands down the best kimchi I've ever had. It's house made by owner's mother so that must be why. Nothing like a mom's touch.\n\nSERVICE:\nThe wait staff is always super friendly and are always ready to answer the millions of questions I have. Some nights when I come in it is pretty hectic with a full house but I can tell they are trying their best and that's all we could ask for really. I've seen the owners floating around the restaurant from time to time and they are always so sweet to their customers.\n\nAll I have to say is try this place out and thank me later.", "author": "Siren L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-12", "description": "Hwaro is a sure hit - their focus on quality of ingredients is a rarity among Korean restaurants in SF (and even greater Bay Area). If you're just looking for your typical Korean BBQ on a grill and copious amounts of mediocre banchan, this is not the place! You're not going to leave with uncomfortably bloated stomachs, mild ulcers and/or numbed tastebuds from overindulgence of spices. Newsflash non-koreans, that's not what makes Korean food great. If you actually care about the experience of authentic, refreshing and innovative cuisine, check it out.\n\nGalbi - I usually don't get ribs at restaurants b/c hey... i can make it too. The meat was just the right amount of juicy and sweet, with the familiar taste of smoky grill. But what makes this one special is the napa cabbage accompanying the meat. It's so sweet and fresh! I'm so sick of the typical lifeless (and pesticide-lain) cabbage at other korean places, and I usually don't touch them. However, with the right amount of doenjang (soybean paste) and a morsel of meat... the refreshing crunch of the cabbage was so good! mmhmmm!\n\nStuffed Mushroom - this was an innovative dish that caught my eye. You get a large portobello mushroom stuffed with bulgogi and cheese on top. Great appetizer and intro to Korean flavors!\n\nYukgejang - this is a semi-spicy soup that reminds me of my grandmother. Again, I don't order this at restaurants because most of them put too much korean pepper flakes in the soup making your stomach pretty uncomfortable later. This place puts just the right amount of pepper - you get that crisp & spicy flavor that soothes your nostrils (this is my best attempt to translate a korean phrase to describe this type of spiciness; it has no equivalent english words) without feeling bad about yourself later on.\n\nThe highlight of my experience was the dessert! We got warm hotteok (korean street food - basically sugar and cinnamon in a pancake that's fried crisp on the outside and gooey and sticky inside) and vanilla ice cream. I can't believe I never thought of this combination! Imagine an asian version of crepe with cinnamon & sugar a la mode. It's sprinkled with matcha to add a little kick to the taste and nuts to round out the flavors.", "author": "S H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-02", "description": "My wife and I were staying with family in the Excelsior over the holidays, and wanted to go out for dinner without going too far. We decided to try Hwaro, and were very pleasantly surprised.\n\nWe didn't sample a large range of dishes. In fact, we each just had a vegetarian bi-bim-bap. She had the regular, and I had the dolsot (hot stone) version. You don't get the large range of side-dishes that some Korean restaurants serve--just a bit of kimchi and pickled cucumber--but it was plenty of food, and the flavors were excellent.\n\nThe staff were all very nice and friendly, and the jazz music gives the place a nice atmosphere. I would definitely go back.", "author": "Michael H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-12-30", "description": "It tastes nothing like korean food. More like a chinese fusion. We had kimchi fried rice, trio taco and japchae..", "author": "Ellie D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-14", "description": "Great hangover food during brunch hours. Hidden gem in the Ecselcior district. Nice decor. Good service. Might be hard to find cuz the sign is tiny.", "author": "Marvin R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-01-02", "description": "Long wait for delivery drivers. No accommodations or apologies offered. Recommend skipping this one", "author": "Don W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-24", "description": "New and only korean restaurant in the neighborhood, so I needed to give this place a try. \nService*****\nAttentive waiters and waitress. Was seated upon arrival. \n\nYuk Ke Jang *****\nSpicy beef noodle soup. Very flavorful. \n\nGarlic Fried Chicken *****\nFried chicken with a little sweet sauce and lots of minced garlic. \n\nKimchi Fried Rice ***\nThe taste was there, but the rice was too moist.", "author": "Sylvia C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-16", "description": "My friend and I decided to try this place out because we were craving Korean Fried Chicken. The sweet-and-spicy fired chicken was our favorite as the garlic chicken was a bit too overpowering. They dab the glaze rather than tossing it more like other places, such as Bonchon. Aside from the glaze, the chicken was crunchy but moist on the inside!\n\nOverall, it wasn't a bad place and I would return again in the future.", "author": "Lester U."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-31", "description": "Glad to see a good Korean spot in the excelsior! Very inviting with a wonderful hospitality. The food is also very good and fresh. I ordered the Korean ramen, it is instant ramen yet has a comforting element. Their kalbi is also very good and they serve you a good portion. If you are in the area you should definitely stop here.", "author": "Kayla L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-11", "description": "Omg this place is AH-MAZING. All the food is so flavorful!! The kimchi is divine. The soup and meat were all fabulous. Highly recommended.", "author": "Nicole W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-23", "description": "Food was delicious and Customer Service was on point, servers went above and beyond! Minor setbacks was our group table lacked lighting and we thought there would be more banchon, typical of korean restaurants.", "author": "Mack S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-02", "description": "Really good Korean food. Even better that it's in the mission because there's not too many of these places around. They have a good special of 50% off bottles of wine on Wednesday which drew me in.", "author": "Benji S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-21", "description": "Came here on a Friday night with some friends! The service was great and the food was spectacular! We had the pork belly, fried chicken, the corn cheese dish and lots of pineapple soju! It was such a great meal! I can't wait to go back! So glad it's in the neighborhood! Too bad it's only open for dinner but hopefully they will open for lunch in the near future! Great vibe! Looking forward to trying other items on the menu!", "author": "raquel t."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-19", "description": "Might just be my new go to when I need something super warm and comforting  Can't wait see what they have to offer for brunch!!", "author": "Kris S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-13", "description": "So glad to have this clean, tasty, Korean restaurant in the hood.  Some interesting snacks, like corn and mozzarella cheese.  Solid Korean hits, BiBimBap, japchae, bulgogi.   I love the Chinese dives as much as the next person, but sweet lord, we need some variety! Hwaro provides a nice departure, in food and the atmosphere.", "author": "Susie M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-24", "description": "Some context:\n\n-3/5 of our party was slightly sick with variations of the flu (on the recovering end though)\n-I don't eat at high end restaurants\n-We went near Christmas\n\n(scroll to bottom for tl;dr if too much)\n\nTHIS PLACE HAS POSSIBLY SOME OF THE BEST CUSTOMER SERVICE EVER. The two waitresses were SUPERB. Brought food quickly, checked on us regularly, and graciously fulfilled all our requests (\"Can we have more napkins?\" \"Could we get a refill of water?\" \"Could we also get some hot water?\" \"Could we get some plates?\" \"Actually, could we get bowls instead?\") It was at the point where we felt bad for asking, but they never once showed annoyance. Freaking fantastic. I'll come back to the customer service in a bit.\n\nFood was yummy, even for our impaired taste buds (remember how some of us were sick?) We ordered 2 seafood ramens, 1 spam ramen, 1 kimchi fried rice, 1 wakame salad, and a half-and-half order of fried chicken composed of sweet-spicy, and garlic. Seafood had LOTS of great seafood in it (mussels, shrimp, squid) and was quite flavorful. Not advertised as spicy, but it is mildly spicy. Spam ramen was also spot-on. Kimchi fried rice was delicious, but portion felt a little small (everyone gobbled it up though). Advertised as spicy, and also felt mildly spicy. Wakame salad was your standard seaweed salad, but it was stacked pretty tall. Felt pretty good for $4. Fried chicken was so delicious, even though some of us had to peel off the fried stuff cause of our sore throats :( :( STILL freaking good.\n\nNote: it IS a fusion spot, so we didn't get the usual Korean appetizers that come with the meal. Not a big deal to us since the meal itself was super yum.\n\nPrice? For the 5 of us, after tips and tax, we were sub $100. Probably because we chose some of the cheaper menu items. Regardless, DEFINITELY worth every penny.\n\nNow for the kicker. We ate around 7:30, and we finished our food round about 8:30 ish. We were taking our time, and it was luckily a quiet night. Waitresses never bugged us, never hurried us. When we finished, we did a White Elephant game, and then played Exploding Kittens (one of the gifts). Still, waitresses did not bug us or rush us. They brought the check over, and told us not to hurry. We played until about 9:30, then we went over to ask for a knife for our cake. We felt kind of bad since we had just paid the check and were now asking for extra service...But the waitress happily cleaned a a really nice cake knife (full tang, nice heft to the handle) and got a bunch of plates and metal forks (I was about to ask for paper plates and plastic forks though...). These ladies were really going above and beyond. We finished our cake, and then left an extra $10 for the trouble.\n\nTl;dr this place is freaking amazing, with absolutely phenomenal customer service to match the delicious food. Do keep in mind the contextual bullet points I started with.", "author": "Filmer Y."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-07-09", "description": "Pretty sure the ramen is just instant ramen with a little bit of egg, onion, and green onions.", "author": "jean m."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-12", "description": "This is a super cute place hat not many would notice, though it's in a weird neighborhood, the restaurant vibe makes it classier and more elegant. The food was pretty good, especially the bulgolgi, but I would skip on the seafood pancake. It was pretty dry, overall it was a great place to chill after work and have a nice hat with friends.", "author": "Martina L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-16", "description": "If you're on the south side of the city, craving Korean food/BBQ, and don't feel like schlepping to the Richmond then come to Hwaro! It's more traditional than Namu but still has some California flair. The Korean bar food is tasty (corn cheese,  and did someone say Korean fried chicken?!?), plus they have more traditional BBQ (not cook at the table bit sizable portions on a sizzzzzzzling plate), dishes and soups. And they have their beer/wine license now so get some soju!!", "author": "Sig N."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-01-08", "description": "Walked in at 7:30 on a Saturday night. Bar was totally empty, and there were probably 4-5 empty tables. One big table of 20+ celebrating something was the bulk of the clientele.\n\nSat at the bar and ordered two dishes:\n\nThe Korean taco trio\n Chopped cooked steak and pork with hot kimchi and other seasonings.\n These were drowning in a pink mayo which was ok, but i could have done with one eigth or less the amount. Kind of gross.\n\nthe Korean fried chicken\n The seasonings were good (fresh garlic topping, and sweet and sour) but when it comes to Korean fired chicken, I prefer a much thinner, crispier batter.\n\nI live nearby and there isn't another Korean option anywhere nearby. So I might come back to sample the bibimbop or bulgolgi, since those are very different dishes.", "author": "C H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-20", "description": "I'm giving this a 4 for now because I only got take out and never ate physically at a table. With that being said, I had ordered the hangover soup, kalbi, sweet and sour chicken wings, spicy squid, and seafood ramen to share between my family and I. We definitely got what we paid for. The food was not cheap but it sure was delicious. The flavor of the food exceeded our standards and expectations of Korean food.", "author": "Rachel L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-10-19", "description": "they literally served me McDonalds fries.  \n\nalso they do not serve alcohol. so, yeah. \n\nthose fries. they were \"Kimchi Fries\" (went with a vegetarian friend and this was one of the menu items we were reduced to, so....heads up vegetarians!), and this was basically a platter of MCDONALDS FRENCH FRIES HOT OFF THE LINE.  with a spooge of steaming, wilty, soggy kimchi plopped on top of them.  lets be real.  we all know a McDonalds fry when we eat it.  these things were hot off the drive-thru line.  like, we almost went out back after our meal to look for fry containers in the dumpster.  alas, we were in too much of a rush to leave this place and never. ever return.\n\noh, and you want an alcoholic beverage after you come to the above realization. trust me.", "author": "Leah P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-09-30", "description": "I always tell it as it is. \n\nMy bf and I decided to try out this place after hearing reviews from friends. We arrived to the spot around 8pm. The place was full but not packed... seats were available so we didn't have to wait. The overall ambiance was nice. The decor was trendy and modern. They were fully staffed.. I spotted about 6+ workers on the floor. Most were gathered behind the cash register. The 1st waiter came over and offered waters...but didn't end up actually bringing it. Another female server approached us after and offered menu and waters but forgot to bring the waters. Then she came back to take our order and later on brought us our drinks. We ordered 3 items in total: stuffed mushrooms, garlic pork belly and kimchi pancake. The mushrooms came out before we got our drinks. The utensils didn't get to us until we bugged the server for the 2nd time. We tried the first 2 items and agreed that the food was amazing! Before we could even finish the 2nd dish, another heavier set female server came over and asked us if we were ready for the check. We looked at her in confusion because it was clear we were still eating and waiting for the remaining dish. She went back to the kitchen to check on it...and realized they forgot our order. The owner came out and apologized while we waited. The 3rd dish finally came and we started to eat. Within a 10 min time frame, the heavier set female server came and rudely interrupted again and asked about the bill. We finally decided to get the check and a box to take our items to go. We didn't understand why she was being so rude when they had 30 min til close and the restaurant was still packed. She placed the bill on top of our to go box, did not say thank you, and rudely stormed off. Clearly, she has no respect for customers and shows zero appreciation for her job. The only reason why I would ever visit again is for the food and food only. The owner should really reevaulate who she hires. It makes all the difference when it comes to customer service and the reputation of the business. My bf and I never tip below 20% but we only tipped 13% today. \n\nPros: \n- owner was friendly, floor present, and eager to assist.\n\n- food was delicious and worth the money (perfect temperature, meat was seasoned very well, and every dish met our expectations)\n\n- nice ambiance (modern light fixtures, cute decor, homely feeling)\n\n- street parking available nearby\n\n- they allow you to bring in your own alcohol since they aren't serving just yet.\n\nCons:\n\n- rude heavy set female server \n- inexperienced servers\n- they forgot our order \n- every server that came to check in only asked about the bill and nothing else.\n\nGo check it out for yourself. Food was worth the money.", "author": "L W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-05", "description": "As much as I would like to claim I'm a foodie, I should write reviews more often! Anyways, We really loved Hwaro. Only problem is that it's on the other side of town. But I can drive a few miles for good food. They have really modernized Korean cuisine and yet remained close to traditional Korean fare. Their asparagus on a sizzler, cheese/kimchi on a sizzler were outstanding! So different from what you would get anywhere else. Their dried chicken was light, not doused in oil, crispy and moist on the inside! Service was really nice as well - not the usual rushed experience you get in the packed traditional Korean restaurants. Give this place a shot. You'll love it!", "author": "Arun M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-08-30", "description": "This is a review for their food only.  (Since it seems that they need to work on their services, if I compare the service to a term paper, this would be a very rough draft)\nThe garlic fried chicken: \nNot your standard korean fried chicken that one would conjure up, this one looks big and crunchy on the outside but juicy on the inside with tons of garlic.  What's wrong with that picture you ask? Chicken is flavorless, the outside coating is like a baggy giant coat hanging on the meat for dear life.  The garlic is plentiful... sounds like a garlic lovers' paradise however this big dollop of mince garlic is as raw as it gets and is somehow mixed with sugar but without any salt. The end result? Plain overpriced flavorless fried chicken that makes you cry tears of garlickyness with a hint of sugar.  (If you really want to order it please bring salt and pepper with you)\nThe redeeming seafood pancake:\nThe only reason why I am giving them 3 stars, the sauce was spot on.  The pancake was light, crunchy and with plenty of ingredients in there.  The calamari legs in there was soft and juicy, the cabbage added a nice texture to the light and fluffy pancake.  Thumps up all the way.\nThe other dishes that my friends order weren't that great either for the price. \nWill I go back? Not likely.", "author": "Suzanne L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-09-29", "description": "The ambiance at Hwaro is great, while the food is okay. For people who enjoy heavier foods like red meat, noodles and fried food, there are plenty of choices. For those who like vegetables and non-fried dishes, there is very little to choose from. The staff is attentive and friendly. My wife liked the gyoza and my daughter liked the fried chicken. The hangover soup is very spicy. I hope they expand their menu of lighter, healthier foods. I live in the neighborhood and look forward to coming back and giving it a second chance.", "author": "Ethan C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-25", "description": "I came with my Korean friend and he really love the food here. We ordered spicy beef soup, spicy squids, and seafood pancake. Everything is tasty.", "author": "Panukarn Y."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-05-27", "description": "Mediocre food. Nothing special. No free side dishes and all. They got so many servers but lacks of customer service. They did not even greet us when we first came in. Only 2stars because of the lady server name Serena because she was nice. That's all but wont come back again.", "author": "Em Q."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-01", "description": "Great new addition to the Excelsior dining scene.  They are still in a soft opening phase and refining their stellar menu.  Staff is all new, but working hard to keep customers happy.  The eel, pork belly and bulgogi are all amazing.  They have both fresh kimchee as a side and some of the best fermented kimchee I've ever had served with certain dishes such as the pork belly.  The Korean fried chicken is also amazing- especially if you love garlic.  The owner could not be nicer or more eager to please.  I've eaten there three times in the last two weeks and can't wait to try everything on the menu, as nothing has disappointed to date.", "author": "C. W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-11-14", "description": "It's ok... no bibimbap, which is crazy talk to me if it's called a Korean restaurant. Good space and ambiance. Bulgogi doesn't come with rice, and Soups do? Strange... but ok. Fried chicken looked and smelled good. Wait staff seems inexperienced, but they try hard. Might visit again, since this is the only Korean place in a 6 block radius.", "author": "gary l."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-20", "description": "As a Korean, I have been to both Authentic Korean and Korean fusion restaurants. When often times some of these other restaurants either cook the same thing again and again or lose their DNA by overdoing the fusion thing, Hwaro is by far one of the best places by combining all the flavors, textures and presentations. I tried various dishes and they were all so delicious! The service is great; all various ingredients were perfectly cooked with the right texture and seasoning; the menu is so diverse and with each bite, you feel the love from a family run kitchen!", "author": "Philippe L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-14", "description": "Updated 5/14/17\nWe had dinner last night with two friends and re-affirm the review wrote about three weeks ago (below).  We might add that the restaurant was full around 6:30 PM on Saturday, and the noise level was not quite as loud as we had feared, in spite of families with children being there.  We were greeted warmly and had our reserved tables waiting for us.  The combination tacos, Portobello mushrooms stuffed with bulgogi were again outstanding.  We had japchae, a Korean clear noodle dish in addition to our usual Kalbi, spicy pork belly, Bibimbap, and the Hangover soup, which were all excellent.  Our friends also loved the food and the restaurant, a discovery for them. Glad we came back!\n\nPrevious Review, April, 2017\nAn outstanding Korean/Fusion restaurant with creative and flavorful food.  We came here from across town based on reviews because we wanted to find a Korean restaurant that was worthy of bringing knowledgeable friends, and the trip was not wasted.  Coming rather early on a Saturday evening, we were greeted warmly and had a choice of tables (They do accept reservations by phone, only when they are open after 5 PM).  We ordered the combination tacos (bulgogi+pork belly, bulgogi+kimchi, and pork belly+kimchi), Portabella mushrooms stuffed with bulgogi, Bibimbop (rice mixed with various ingredients served in a hot stone bowl) , Hangover soup (spicy beef soup), Pork belly and Kalbi (broiled beef short ribs).  They served three little banchan (side dishes), consisting of spinach, kimchi, and a special sauce.  This may sound meager, but all the three items were delicious - the kimchi was fresh and flavorful (best we had among all Korean restaurants in the Bay Area), and the special sauce consisting of miso and hot sauce and garlic was outstanding in flavor!  Much better than many more side dishes which all taste bland as in some other Korean restaurants I reviewed.  The tacos were outstanding as was the portabella mushrooms stuffed with bulgogi - these fusion dishes were so flavorful they would not be out of place in Quince or Benu (see my reviews of these outstanding restaurants).  They serve a bowl of lettuce and Napa cabbage leaves, which can be used to wrap the pork belly, kalbi, or bibimbop with the special sauce, adding a fresh, crunchy contrast to the hot dishes.  The pork belly and kalbi were both seasoned just right and delicious and the bibombop in sizzling hot stone bowl was also delicious.  The spicy beef hangover soup was also very tasty and satisfying.  They have beer and wine and Korean special beverages - Soju (tastes like weak vodka) and Makgeolli (milky Korean rice wine).  We had both Soju and Makgeolli, but wife wound up ordering Sauvignon blanc (a very good one- Joel Gott).  Although located in a somewhat gentrifying neighborhood, the restaurant has a clean,  modern feel with nice murals, though the chairs could be more comfortable.  The service was very friendly and prompt.  We would recommend this restaurant for foodies like us who are willing to travel a bit to find a truly satisfying gastronomic experience.  Definitely will come again.  Their website indicates they also deliver thru Doordash or Uber Eats..", "author": "Hoyle L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-23", "description": "Modern spin on Korean food staples. Simple comfy decor and mixed crowd; a good representation of The E! Wait staff was very attentive and friendly. Had their kalbi, chopchae and hangover soup; tasty across the board. We threw in a bottle of soju for good measure and left happy. They were even so kind as to comp us the soju because it was our wedding anniversary! We dig it!", "author": "Joseph M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-13", "description": "First time here saw the great reviews had to check it out. Great!! Pork belly cheese corn appetizer and orange drink 20$!!! Maybe I won't miss goldilocks, great new spot in the E!!", "author": "Gregory H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-04-07", "description": "Wow! The less said the better but this is more like a PSA so I'll elaborate. This place is Korean to the extent that I, an Indian male, could be Korean simply by changing my name to Kim Park or some other ridiculous stereotype. Do they play Bossanova? Yeah sure, but if I wanted to listen to Bossanova I wouldn't go to a bloody Korean restaurant would I? Can they make Kimchi fried rice? Yes but it turns out I can do it better if I were lost in the jungle with just some rice and kimchi and a rubber band. As in seriously better. And ramen? Sure they can make ramen but so did I when I was in college and used to buy the ready made ramen in the non-Asian grocery store. They literally didn't know what bori cha (roasted barley tea) is. And while they claimed that they added pork belly to the ramen, for which they charged an extra $2, that pig must have been starving because either they didn't give me pork belly or that pig did not have an ounce of fat on it's belly. \nTherefore: starving. As was I, after the whole thing was done because I couldn't stomach the idea that I had just had Korean food. Because I hadn't.\nThe service - well it's not the waitstaff's fault if some rich person decides to set up a restaurant which ostensibly serves Korean but in fact does not. They were trying their best but what level of service can make up for horrendous food? No level of service.\nNow if you want to listen to Bossanova and drink water or soju or beer, by all means go to this place. But if you want Korean food, you are as likely to find it just about anywhere. Maybe even at the Salvadorean place nearby. I mean the probability is the same because apparently anything can pass off as Korean just by giving it a Korean name and attracting gentrifying hipsters with Ikea decor and Bossanova?!", "author": "ch d."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-10-06", "description": "Living in LA I've had some of the best Korean food on the west coast. Hwaro's offerings are very average in comparison and joins SF's long list of disappointing Korean restaurants. I tried the cold noodles, Korean fried rice, Galbi and Kimchi Stew. Everything was average, the cold noodles were very disappointing, it was soggy and the flavor wasn't quite right", "author": "Charles W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-08-28", "description": "Came here for dinner with five other co-workers and friends this week and this is a collective review from all of us lol. They must still be doing a soft opening as service is still somewhat lacking and the waitstaff could learn a few things. Maybe this isn't the best place for a big group-the food came staggered with me and another person's food coming first and then my last two co-worker's food coming a half an hour after we had already finished! The owner came out to explain why my friend's wings took so long (they had to re-do it) but no apologies. It was also hard to stomach seeing another friend's taco trio being delivered to a table of two that had come after us and had already two dishes on their table. So the service is spotty, how about the food?\n\n-Yuk Ge Jang: Bland, broth was watery. I was definitely left hungry after.\n-Pork Belly Platter: Flavor was very good, texture could be more tender. Questionable whether this was actually pork belly as there was hardly any fat and it was quite sturdy.\n-Seafood Pancake: I didn't get to try this, but my two friends really liked it and would recommend it.\n-Garlic Fried Chicken: Sweetened raw garlic slathered on top. Take away the raw garlic paste, the chicken itself was very bland. We think they added too much sugar to the raw garlic as it was almost sickly sweet.\n-Sweet & Spicy Fried Chicken: This was a lot better, more flavorful. \n-Taco Trio: DEFINITELY the thing to get here. Not only is it a good value (they give you a SHIT-TON of meat-for now-for the price), the meats were very tender, piled on and flavorful. I wanted to actually order this after I tried my friend's but was afraid that it would take forever.", "author": "Jenny W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-14", "description": "Good Korean by far in SF/San Jose area. We're NYC Koreans and have been looking for a decent home cooked meal. The seasonings are not spicy for Korean palate but all the flavors were there. Kalbi is truly your LA Kalbi style cut and delicious. Better than any Korean place I've been to in SF or even San Jose.", "author": "GgrR K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-22", "description": "What a wonderful surprise in the Outer Mission. On a recent trip to Korea I fell in love with the food. So when I returned to S.F. I wanted to experience Korean food with the same authenticity as I encountered in Seoul. Hwaro delivered! The staff was so friendly and knowledgeable. The music was perfect and at just the right level. And then the food, wow! Every dish had honest flavors. I especially liked the  Rice cake Skewers as they brought me back to Korea. The Kimchi Soup will be my goto this winter on cold rainy nights. I also tried the Pork Belly  and Spicy Squid, both were delicious! The big Mushroom was stuffed with super tender and tasty Bulgogi And just when I thought I could not eat another bite, the Seafood  Pancake came out. It was better then the ones I had in Insa-dong. If you are craving authentic and honest Korean food , then this is THE place!", "author": "glenn w."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-01-19", "description": "I picked this place to eat based on the high reviews and was pretty disappointed.  I felt hella bad for my friends bc I chose the place.  The place itself is nicely decorated, clean, service was prompt and polite but the food was bleh.  It's more of a white-washed Korean restaurant and my roommate is Korean so maybe I'm spoiled by great tasting Korean food.  We ordered the Korean tacos, cheese corn, seafood pancake and the combo chicken wings (garlic and spicy).  The Korean tacos were good but too much mayo on them (the portions are also very small), the seafood pancake was ok only (not disgusting but not something I would order again), it wasn't crunchy enough, the cheese corn tasted good but the portion was so small, the chicken wings were moist and cooked perfectly but there was barely any flavor on it.  The garlic was basically fried chicken with minced garlic on top, the chili one was fried chicken w/the bottled chili-garlic sauce put on top.  It was the most disappointing thing on the menu.  I can't believe a chef would just put a blob of sauce on top and claim that as dish they found fit to serve at a restaurant.  The best thing was the tacos and the cheese corn but portions are very small.  I wouldn't go back again.", "author": "Honey S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-08", "description": "This place is a great new spot! The service is friendly, the food is delicious. Definitely get the Taco Trio. A great sampling of different types of Korean tacos. At the moment you can even BYOB!", "author": "Luis I."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-03-11", "description": "I tried Hwaro with my girlfriend and we ordered the seaweed salad, fries, kimchi fried rice with pork, and japchae. The seaweed salad was delicious but very small; I could've finished it in one bite. The fries were solid especially with the spicy mayo. They brought out my kimchi and it sat there for over 25 minutes until they finally brought out my girlfriends japchae. The restaurant was not busy at all either. The people sitting next to us had come in 10 min later than we did and got their food before us. The only thing we were offered was a \"sorry about that small mistake\". The staff were very friendly but this was unacceptable in my opinion. I don't understand why they couldn't have offered a little more than a simple apology. If I were the waiter in a situation like this, I would not have charged the customer for the meal that came out 25 minutes late. Overall the food was good but they need to figure out a better system of taking care of customers if they mess up.", "author": "Brandon M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-04-26", "description": "The food here is actually okay, but the service is terrible. Ordered food to go. Waited 45 minutes for it. Watch as the fries I ordered sat in the window for 20 minutes and asked if they were still crispy. The waiter said they were great. I knew the answer. End up getting home and they had forgotten one of the things I ordered. I asked him to take it off my charge as well as the soggy fries. He told me that they can't take things off of checks they have to delete the whole check and rering everything and then run my card again. I spent more time than I needed on the phone and in the restaurant. Long story short, the $70 charge showed up in my credit card. Slow clap for Hwaro and their poorly trained staff.", "author": "Greg H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-20", "description": "Loved the food here! I really enjoyed the authenticity of the food in a more modern setting. I definitely plan on coming back!", "author": "Brandon L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-03-03", "description": "The food are okay but it is a little overpriced. Don't order the asparagus because it is only few little piece but it charge for $6. I give 3 stars basically is because the service is good and I like the kimchi fried rice. I don't think I will go back again.", "author": "angel w."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-02", "description": "New Korean restaurant with great food.  It still need some finishing touches but over all in the right track.  BYOB for now and the menu is limited.  It would be nice to see some more vegetarian dishes.  Their ramen is made with beef stock.  Kimchi pancake and kimchi rice are both good.  Prices are very reasonable. Music and decor still need help. I will definitely go back.", "author": "Ciocio S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-12-04", "description": "I would not recommend getting the ramen, as I've had packaged ramen that tastes better. For $10 it's definitely not worth the price.", "author": "Kyle F."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-03-12", "description": "I wanted to like this place. I thought the food was decent and tasty for the price (although my friends disagree). Service was bad enough to actually warrant a yelp review. Very slow kitchen (45 minutes for a rice dish?). But the worst part was that the server ignored us to the point where I have to try to wave her down. She raises her hand to acknowledge and litetally returns to other tasks for another 10 minutes and never comes to check on us at all. I have to get up and walk to the back to check on my own order while my friends are already half way finished with their entrees. Awkward apology for the slow kitchen ensues from the other server when food finally arrives. To be honest, the slow kitchen wasn't nearly as bad as the lack of service. The owner clearly provides no service training to the staff and expects them to just figure it out (and expects customers to tolerate it).", "author": "J M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-08", "description": "Went there on a busy Saturday night. Although the service was a bit slow, we really enjoyed the food and the atmosphere. Unique dishes and jazz music + some really nice wine = awesome night.", "author": "Kostas S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-13", "description": "Been here three times now.  Good food each time.  They have been expanding the menu a bit and so I will be heading back again soon for some bi bim bap which is one of my favorite breakfast foods.", "author": "John P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-26", "description": "Came by for dinner with a couple of friends.  We had bulgogi, taco trio, and kalbi.  Love the food.  Love the staff, especially Ina.  We were pleasantly surprised to find such a great Korean restaurant in the outside mission.  We would definitely come back again.", "author": "Anthony N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-10", "description": "My friend and I went on Christmas day for dinner. The place was packed and the service was great! I had the hangover soup and my friend had honey garlic chicken wings. The soup was really delicious and the portion was big! My friend loved his chicken wings. Will definitely come back again to try their other items!", "author": "Eddie T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-09-01", "description": "Came here last week had there gyozas  which were alright nothing special. I had the korean ramen which is basically the ramen that comes in a bag that you can cook yourself at home. It was ok. My friend had the korean spicy chicken wings which looked really good but once you took a bite they were just ok i've had better. The service was probably best part out of the whole experience. Everyone is very nice.", "author": "Genelle G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-21", "description": "Delicious Korean food in a hipster atmosphere. We had the taco trio, hangover soup, kimchee fried rice and fried chicken wings (garlic and spicy).  Everything was delicious. I'm Korean and have always complained about the lack of really good Korean food in the city. Finally, Hwaro is helping up the Korean food scene in SF. The dduk on the skewers appetizer is amazing. So perfectly crispy on the outside but soft as you bite in. Heaven!!!", "author": "Annabelle H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-10", "description": "they are one of the hip places in the neighbourhood, and answered questions about my gluten free issues patiently on phone.  however, I am not sure if they can make sure if their side dishes such as Kimchi and pickles are really gluten free (since korean soy sauce usually contains wheat flour). thats something they need to work better on.  also, I suspect they put MSG into their cooking. I heard MSG isnt necessarily a bad thing, but it does make me thirsty.", "author": "Shuting Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-19", "description": "Couldn't be happier that this place has opened near my house. We now go once a week. Sweet and spicy fried chicken is to die for and can't get enough of the glass noodle dish. Staff are super friendly and food is cheap for the quality. Nice atmosphere but service can be a little slow and only due to the fact that the place is always full.", "author": "Relle C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-05", "description": "I'm thrilled that the Excelsior neighborhood got a Korean restaurant. Food was good, environment was modern and clean (this location is relatively new), and although the service could use a little bit of polish, I don't have any major complaints. For dinner we (2 of us) had: rice cake, kimchee fried rice (with an egg), and pork belly. I'd recommend all of it. We left stuffed and will definitely be back. Enjoy!", "author": "Ken C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-04", "description": "Been here for the first time and i was shock with quality of their food. It was amazing!!! Their fried chicken is off the hook! Their galbi is very well seasoned.  Authentic korean place in mission finally!!!", "author": "Tony K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-10-11", "description": "as a korean-american raised on the east coast, i'm constantly surprised at the lack of really good korean food in sf.  after seeing the hwaro menu online, we were looking forward to giving it a try, especially since we live in bernal & it's in the south side of the city.  \nacknowledging it wasn't a traditional korean restaurant, it was still a little disappointing.  at times, it seemed to want to be a traditional korean restaurant.  but then it also tried to be inventive & creative.  it didn't seem to accomplish either all that well.  \ntruthfully, after seeing the online menu before arriving, i was really hoping to have a bowl of bibimnaengmyun (\"spicy buckwheat noodle\"), one of my favorite korean dishes.  i was saddened to find it crossed off the menu.  my husband ordered the yuk ge jang.  i ordered the fried chicken from the \"big plate\" menu for my daughter & me (after asking the waitress if it'd be big enough to share with her, i was assured that it would be as there were ten pieces).\nthe yuk ge jang was hearty (though the portion of the accompanying kimchi/banchan was miniscule!).  the \"big plate\" of fried chicken turned out to be wings--very crispy with a great sauce, but hardly substantial enough for two people, even as an appetizer.  also wished the tea selection was more korean (i.e.  there's no boricha/barley tea, & it felt odd to have peppermint tea offered instead).\nthe service was friendly.  i think we might be wiling to give hwaro another try, now that our expectations have been altered.  but with other more traditional options available in the city & with namu gaji doing the korean fusion thing so well already, we might not.", "author": "jeanie c."}
