{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-14", "description": "Two words...  Leg-It!!!  Great place to grab a beer or a game...  Or, both!\n\nFriendly, corner/hole in the wall -- with local day drinkers and friendly service.", "author": "C R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-10-03", "description": "*3.5 Stars*\n\nCan you say: diiiiiiive?! Gimme some of THAT right quick! The Hyde Out is literally a great place to \"hide out\" and just chill and maybe catch a game or two. It's practically hidden on the corner of Hyde Street and California in the Nob Hill district. \n\nThere's nothing fancy about this spot and that's exactly why I dig it! Low key, not too crowded (except for on big game day nights) with a local crowd and super down to earth bartenders. And did I mention that the drinks  are cheap? Oh yeah... that's ALWAYS a winner in my book! And, they aren't watered down either. You will definitely get a bang for your buck. \n\nThe bar itself is long and narrow with plenty of seats and a few TV's that hang in the corners. There's also an upstairs area, but we haven't yet gone up there. Most of the people who come here are locals and regulars but they are very welcoming and a few of them will really have you cracking up at their jokes! \n\nAlthough I enjoyed myself while I was there, a few things are keeping me from giving them a higher rating. First, they are cash only! BOO HOO! I have to say that I truly despise cash only businesses. I understand the concept but then again... I kind of don't. Secondly, that bathroom... let's just say it ain't the prettiest. I know,  I know...  it's a \"DIVE\". Buuut, that don't mean y'all can't fix up that bathroom one time! I mean damn! I would hate to see what that bathroom looks like on a game night....\n\nAside from those nuisances, I really dig this bar. It's a great a little hidden gem in the area to chill out and have a nice drink. If you're in the area and are looking for something low key, I would recommend it. Just make sure you bring cash and try to use the bathroom BEFORE you get there.", "author": "Shayla B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-25", "description": "Great atmosphere,  amazing bartender stephanie kills it, great juke box. Lots of colorful people", "author": "Will B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-27", "description": "People and the drinks are great! The bar tenders are incredible and super friendly. I have left my brand new IPhone 2 days ago and someone turned it in to the bar tender. Very grateful!", "author": "Valeria R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-28", "description": "I still continue to come here on a regular basis. It's not only due to the staff (both Stephanie and Amir), but also due to the regulars that I engage with during my daytime visits. When I come here, I don't feel like I am entering a bar, but rather someone's home. That is how the staff and patrons treat each other. If you want a place where there are good people to engage with, this is your place..", "author": "Timothy L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-09-28", "description": "The blond girl working there she is fucking asshole i was joking to my friend she has nothing to do with it and she intervenes  and called rude .. I told her excuse me ?? She said don't be rude I told her me and my friend joking what's ur problem ?? \nShe is the worst to be behind the bar ,..", "author": "Majdi S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-24", "description": "Awesome little dive bar! Decent size bar for being in SF! The bartender was so nice and made a killer margarita. They have and upstairs area you can relax in while looking at the cable cars passing by :) \nDefinitely a fun spot to check out!", "author": "Megan D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-04", "description": "Bartenders are always cool. Super humble. The main key in any business is down-to-earth approachable people. That definitely exists at Hyde Out. Decent selection of beers on tap and there's almost always one of them on special for something around $5. It's a cool dive bar that enjoy visiting when I want to enjoy a beer around a casual crowd.", "author": "Peter C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-21", "description": "So fun!  Everyone loves each other here and the bartenders are so nice.  The friendships seem like the bars I've seen in Ireland.  This spot is for locals and I will always visit when I am in town.  \n\nGreat music is always played!", "author": "Claire H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-01", "description": "I would call this the most upscale \"Dive-Bar\" that I've been to.  I suppose this is Nob Hill's Dive-Bar.\n\nI've lived a block away for two years and just around to going about a month ago.  Football Sunday.  They open at 10am on Sundays, have about good TV's, and the crowd was full of folks from all over.  (I won't hold the fact that there were a lot of Eagles fans against the bar...  JK ;) )  I've been coming back for more football, a few evenings, and a little NYE last night.\n\nGreat location - Hyde/California.  As a space, it's a cool lay-out.  Nice little nook upstairs and a fairly long bar.  The bartendresses have all been super-cool along the way.  All compliments in that regards.  Drinks - nothing outrageously different, but solid beers on tap.  Happy hour discounts help.  I believe 4-7pm.  $1 off beers.  Usually I don't do a lot of shots (although anyone from this place would think I do), but it's been perfectly reasonable to buy a few rounds for folks I've met along the way.\n\nWhich brings me to why this place is really 5-star:  The folks.  Cool people.  I have met a lot of people along the way.  Interesting, smart people.  Not all saints.  Not degenerates, either.  Well...  One or two.  Interesting stories.  Plenty of classy 20/30-somethings who are reasonably successful SF future mid-upper-class (well, anywhere else - this neck-o'-the-woods, middlist-class).  But, plenty of the crew that's lived on Nob Hill for years, going back to SF was just a little more down home.  Walking by, I always thought this place must be all yup's (like a certain bar across the street).  Not so.\n\nKuddo's, neighbors.  Happy 2014!", "author": "Adam S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-12", "description": "If you like dive bars, you'll love this place! Cheap drinks, locals, sports on tv, old dated furniture, 80's/90's music, large ladies restroom, amazing!!! This is the only cheap place to drink in the area. Customer service makes you feel like family.\n\nOverall, drink here and be happy!", "author": "Yvette A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-11-19", "description": "Literally just saw a guy get physically attacked by some black guy for nothing we could tell (prior beef et?  no idea?!!). Omg there were fists thrown and the white dude constrained the black guy (whom was clearly the aggressor) in a decent manner and good, no blood  (swear not a racist statement lol!). Then they kicked out the white guy and let the black guy stay!! Wow.   PC I guess? The bartenderess though was awesomeness aside from her bias to the black guy which was extremely disappointing.", "author": "Kyle K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-01", "description": "Great casual atmosphere in here. No loud music or dancing--you'll have to go somewhere else for that. There's an upstairs area that has some more tables and seating along with a big-screen tv. Nice to just chill and get a drink after work or to prepare to do an evening of bar hopping. I tried the pear cider which was really good; not too strong but not overly sweet either.", "author": "Susan G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-24", "description": "Not a bad place to come in and kill some time, which was precisely what I was using it for. They have two decent sized televisions on the wall, and there is a jukebox to keep entertained while you drown out your sorrows with booze. The bartender was really nice, and we were kept entertained by another customer by the name of 'Mouse' who is no doubt a regular at this place for sure.", "author": "Dane T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-27", "description": "This place is a very good choice to watch the games! The friendly bartenders are expert and they know what exactly to do! The guy named Amir is one of the best bartenders! He's so welcoming and tries to make a warm atmosphere for you during the time you're there!", "author": "Sara S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-11-28", "description": "Went in there last Saturday around 6 and unfortunately was turned off from the beginning when the bar tender took a few extra dollars for her tip. I paid cash and was shorted 2 bucks, I don't understand this thinking, it's tacky and ruins the experience for me, I would have tipped a lot more than what you kept if you just gave me the right change. I understand people make mistakes but it was pretty obvious what happened.\n\nThey have one tv downstairs and one above. \n\nI like that there's an upstairs, which is a nice quiet hyde-out from downstairs.", "author": "Collin C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-23", "description": "The Hyde-Out is a cool local dive bar with fantastic daily draft beer specials for $4-5. You can't beat that in SF! Always a good time. Thanks.  :)", "author": "Mike B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-16", "description": "Hiding out.\n\nUpstairs. With two well made cocktails. Ambiance makes it easy to converse. Vibe is relaxed and unpretentious and familiar all at once.\n\nBit surprised for a dive those cocktails were $10 but that seems to be the new city standard. Would hide here again.", "author": "Jason B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-14", "description": "Love this little dive bar. The bartender and regulars are wonderful. We stopped to watch the game and stayed to enjoy the experience. My husband had the best bloody Mary ever", "author": "Melissa B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-09", "description": "Enjoyed this bar, always felt comfortable.  I like the renovated bars with nice furniture and TVs, but sometimes it's more comforting just to be in a relaxed atmosphere.", "author": "Azman H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-08", "description": "Came here yesterday for a drink since I was about an hour early for dinner next door. Got a beer and sat upstairs. Hyde-out has a great view of Hyde and California. It's a nice place to enjoy the view and people watch. If you're not into that, they have a TV upstairs and another downstairs so you can watch whatever game they have on. Last night it was hockey due to the Stanley Cup finals. I also saw some people eating food and enjoying a beer so if you've picked up a pizza or some take out, bring it here and enjoy the view or game.", "author": "Elena N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-13", "description": "ATMOSPHERE\ncozy. upstairs. expensive drinks. good place to possibly watch games? punny name :P Kinda old n dank inside but oh well not too terrible. I don't mind adding it to the off-polk crawl.\n\n\n11.11.13", "author": "Angela L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-01-04", "description": "AMAZING deals every single day (yes, weekends too!) Check other reviews or pictures for details.\n\nI got a super sweet bartender, Alicia, who can make a mean cosmo while still listening to me tell my life's story. Oh, it helps that she's really hot too.\n\nThe inside is well-cared for. Red walls with decorated mirrors and a very stocked, organized bar.\nThere are games, though Scrabble was missing. I played Uno and Bullshit with dice.\n\nI will be back whenever I get the chance! The beeeessssttt.", "author": "Melanie P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-01-03", "description": "***Accidentally posted this review for the Wreck Room on 8/12/13***\n\nThis place is kind of hilarious. Surrounded by super-popular wannabe hipster bars, this palce has somehow managed to survive as a total locals dive. However, because it IS surround by popular bars, it is clean - which I mean, how many dive bars can you say that about, really?\n\nYou can take your drinks and sit upstairs and look out onto the street from the HUGE windows. They have games you can play if you want to just hang out. \n\nI would definitely say this is a great bar to go to if you are looking for a place where you and a group can actually hold a conversation while A) sitting down, and B) being able to hear one another.\n\nThey play some eclectic music, definitely heard some hardcore underground rap at one point. But it is easy for this place to kind of slip into a soft spot in your heart as a chill go-to.", "author": "Courtney S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-19", "description": "Easily my favorite bar in Nob Hill. The drinks are cheap and strong the bartenders are beautiful and strong and the upstairs is... Well it doesn't feel that strong. But it is UP stairs just in case you want to escape the weirdos at the bar. \n\nThe Hyde Out has a lot of regulars. They're interesting people, with lots of stories. They'll tell you, regardless of your non-verbal indications of interest.\n\nThe specials don't change often, but by gods, they are cheap. Enjoy the bar, talk to the bartenders, drink and be merry. \n\nAnd play the jukebox. It's worth it.", "author": "Trace D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-02-20", "description": "This place is a cash-only dump with rude bartenders. It usually smells worse than even the dive-iest of dive bars should. I only go hear about once a year when the other neighborhood bars are all too crowded. BTW, management really needs to consider cleaning the beer lines out more frequently.", "author": "Bobby N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-04", "description": "My favorite dive bar in the city. Can always get a TV for NFL games. Best bloody mary in town too. \n\nDoesn't serve food, but I always order from victors pizza or jakes steaks when I go there.", "author": "Jay G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-30", "description": "Pretty much any halfway decent bar will win my love if you walk in on a Saturday afternoon, seats are available at the bar, football is playing on the television and 'Better Man' is blaring out the speakers... \n\nHyde-Out... You have my heart...\n\nWhat a great little dive bar in the middle of the dive bar wonderland that is the Tender Nob! It's simple, friendly, has a nice range of drinks on offer, a good happy hour deal and a social clientele...\n\nCheck it out... it's so simple, you can't really go wrong!", "author": "Guida B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-04-02", "description": "Interesting. Somehow I was confusing the Hyde-out with an old bar in San Francisco called the Covered Wagon which closed so long ago. Anyone been in SF long enough to recall?\n\nAnyway, not the same place. The Hyde-out seems to have been the Hyde-out for as long as my 3 second search on Google showed. You can correct me if I am wrong.\n\nCute spot, big for a bar in this area I suppose. Beer selection is nice. We were more distracted by the bartender's breasts...that was quite a view. If only she wore a proper bra to make her breasts firm enough. You do get philosophical when you have a glass of beer in your hands.\n\nAlso, for a Friday night, it was full, but not party full, which is nice if you want to be able to have a good time with your friends and save your vocal chords for the next day.", "author": "Alexia R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-26", "description": "Amir is such a nice genuine guy who made me and my friend feel very welcome right away.  I will be coming back again because of him.  Great bartender he is an asset to this business.", "author": "Brian M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-24", "description": "Young and drunk Eastern Bloc blondie, tending bar and manhandling our potato chips, taking breaks from her friends to play late 90's West Coast hip hop, and never telling us to stop feeding her dog chips.\n\nWe absolutely dug it.", "author": "Corey H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-15", "description": "I have many fond memories here. \n\nChill little spot, nice people, other level thing (that I've never explored), and nice big bathrooms to ponder your next move.", "author": "Loli L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-08-30", "description": "this is my rebuttal to Michael R.....   I was there too.  Actually too close to it.  I was at the end of the bar, being screamed past, waiting for my cocktail.  The most uncomfortable situation I have been in, for many many years at any place of business.  You say \"good friendly customer service\"?   How was that yelling, screaming monolog a \"good friendly customer service\" experience?  \n\nAs far as \"professional\", when an individual is being paid to do a job, no matter, bartender or garbage man, you should have respect enough for the company, who is paying you, and who you are representing, to represent with respect.  In my opinion, yelling at customers, while on shift, is NOT appropriate.  PERIOD, DOT, DOT DOT!\n\nps: I had this same conversation with the bartender, this review will be no surprise.", "author": "Rhonda L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-06-11", "description": "The play on words with this Tendernob watering hole couldn't be more accurate. Situated on Hyde and California, it's in fact the perfect place for a discreet pint of beer, mixed alcoholic concoction, or an intimate conversation with a long lost BFF. \n\nIt's a no frills type of spot where the bartenders take great pride in trying to remember your name. I'm by no means a regular, but every time I enter through their doors, they try their darnedest to remember my name. They're usually waaaaay off, but it's a nice gesture to at least give it the ol' college try. Call it a gimmick, but I like to embrace generosity when I see it in day-to-day encounters.\n\nFor the best view in the house, head upstairs where you have an elevated view of the Hyde and California intersection. It's got a very homey feel to it, and it's the perfect place to round out an evening in the city.\n\nBring dolla dolla billz, or use their ATM... because it's cash only, sucka!", "author": "Ruggy J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-01-10", "description": "Went here on a saterday night around 10 pm...    They had a group of people and some nice loud music not bad really.  They have a upstairs balcony also with seating.  A little on the guetto side.   And a little on the hotter side temperature wise. If you get beer,  be warned,  the glasses are not chilled and the beer is not so cold coming out of the tap.  So drink fast when you get a beer.  Beer was 5.50 for a regular glass.   And a sex on the beach was 8 bucks for a small glass.  I probably wouldn't come back.", "author": "B P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-03-25", "description": "Walked in on a Sunday afternoon and found patrons seated the length of the main floor bar.  We were greeted by a beautiful shepherd-like dog.  Since we each needed to use the restroom, and since their sign said \"restroom for patrons only\", we ordered ourselves a drink, and then hauled ourselves and our drinks up the stairs to where there was room to sit down.  It was enjoyable sitting along a large window looking outside and below at the happenings along the busy intersection, and soaking up some more sunshine.", "author": "Jennifer S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-21", "description": "great beer on tap selection, although they were out of 2/3 IPAs around 1:30AM boo. \n\nthis is a nice dive bar (oxymoron ;] ??) still sad about cash only, but i'm over it because it's the best of its kind in the area. i'll be back soon\n\nps- extra points for having muted bourne on TV, and extra points for the person who played the prodigy on the jukebox", "author": "Kailey O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-19", "description": "I like this little bar. The bartender was super sweet. Can't remember her name, but it was definitely a unique kind of name. She was really attentive and great. This little bar has a secluded upstairs and juke box. A mixed crowd. Definitely a neighborhood bar. A good place to just get a drink and relax. It's not anything special, but it just has that cozy and comforting feel.", "author": "Natasha S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-25", "description": "I'm not going to rant and rave about the Hyde-Out, but I'm a fan. \n\nLike most bars it has stools, TV's, a juke box and beer on tap... but what I really have come to like about the place is that it doesn't overwhelm you-  The bartenders are friendly but not trying don't tell you about their 2nd divorce. The regulars can be entertaining but are harmless, and while its not usually a graveyard, there's always a good place for a group to post up. \n\nIt's a flexible place. You can mold any type of night that you want using this watering hold as your foundation: a quiet drink after work, a warmup beer before a long night, or even a last call stumble in.\n\nI like the Hyde-Out, not because of what it offers but because of what it avoids...bells, whistles, a line out the door, and drinks that glow in the dark.", "author": "Andrew K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-24", "description": "Great value, reasonable prices, fun atmosphere. Filipa was a delight. Funny, attentive and generally kick ass. Great, solid, cheap drinks and a friendly neighborhood feel. Can't wait to visit again on next visit to San Fran .  Love love love", "author": "Robin B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-12-09", "description": "$4 dollar well drinks everyday from 11am - 8pm! LOVES IT. I was only in San Francisco for a day, but finding this place on the way to the warf was fabulous!\n\nIt was the bartender (Dixies) first day and she was super nice and attentive. There was an interesting crowd at 12pm on a Saturday here, but they were all cool people. Talkative and friendly older guys for the most part. She let me use some of her credits on the juke box too!\n\nThey have the BEST IPA i've ever had on tap. Prohibition, Speakeasy...YUMMM. I would have probably never discovered this beer if it weren't for the Hyde out! They have some games you can play. (we played dice, but there are some board games too) and 4 TVs and an upstairs with more seating.\n\nI will definitely return on my next visit to San Fran.", "author": "Chelsea V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-08-30", "description": "Hello,\n\nIm writing a review on the Hyde Out because I was reading some of the other reviews and came across one in particular.  The person who recently wrote a review and is an \"undisclosed member\" is totally full of it.  I actually witnessed the incident last Friday night and the bartender seemed to have good cause for her actions. I think the last reviewer might be 86ed from the bar so she is a little unhappy about that.  GEEZ PEOPLE I cant imagine being a bartender and putting up with a bunch of drunk peoples crap.  A bar is the last place I would call \"professional,\" whether it be the patrons or the bartenders.  As long as you have a good friendly customer service there shouldnt be any problemo.  I love this place and all the bartenders that come with it!!!\n \nBOO HOO to you if your not a customer anymore.  A finial thought; the owner always buys me a drinks and recognizes me when I walk in. Im sure he has bought this reviewer a drink or two in the past. Don't accept drinks from people if you don't like them and don't support a local bar for some odd years, if your going to turn around and write a negative review. Nothing has dramatically changed at the HO.\nGrow up and get over it!", "author": "Michael R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-14", "description": "Despite my husband and I having to deal with drama with friends,  we had a great time. Our bartender Elise was so fun. She was interactive with us and attentive. This place was so fun!", "author": "Karen M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-03-18", "description": "Not a hole-in-the-wall bar for young people!! Full of older, creepy men but does have strong drinks and friendly bartenders", "author": "Lilly V."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-02-21", "description": "I suppose this goes without saying in a urban environment one should never be too relaxed and always be aware of the strangers around you.  \n\nTo that end, this is a bitter sweet review - mostly bitter because I'm having a crappy week/crappy year and to boot, its only Mid-February.  \n\nI'm not a regular at the Hyde-Out so this review is not really about the bar itself.  I do however on occasion meet up with a friend who is a regular; so I'm a regular only by association.  I don't want to complain about the bartenders as they've always served me promptly and make a mean spicy bloody Mary.  Yum!\n\nWhat I can say about my observation while at the Hyde-Out (and sadly to my dismay) there are some very unsavory people who hang out here (and I'm a little pissed right now as I had something stolen from me right in front of my face and didn't even see it happen).\n\nDid I mention I'm having a crappy week because I'm going through hell right now as my Senior Dog, Blondie is very sick and likely not going to make it past her 15th birthday which is coming up.  \n\nNot wanting to be home depressed, I met up with my friend (the regular) to blow off a little steam and indulge in a pint of Guinness (this is a cash only bar and I had only $8 and indulged in ONE beer).  We'll being that the state of mind that I'm in (mindless), I didn't even notice the perpetrator, nor did I see them pick-up my favorite one of a kind, very expensive military inspired windbreaker - it freggin got snagged right before my eyes.  Literally, I was sitting and facing my jacket hanging up alongside the bar; so when leaving I just assumed when going to reach for it would be hanging where I left it (right in front of me).\n\nNope - it was gone and nobody seemed to notice its departure, nor when asking the bartenders if someone turned it in, then explaining to them that it was stolen from their establishment, they had attitude and didn't really care, nor show any concern that one of their patron's is STEALING from its other patrons.  Their attitude was as if it is a regular occurrence around there (I talked with another regular who also had his jacket recently stolen), and that it was my fault for not having it on my persons while indulging in my Guinness.  Augh - I came here to relax, not stress and be looking over my shoulder at every moron that accidently stumbles up to the bar.\n\nNeedless to say I left on a very sour (cold) note and now I really hope I see the idiot who stole my one of a kind, very expensive military inspired windbreaker; did I mention its ONE OF A KIND, it will stand out and I will NOTICE you wearing it  ASSWipe!", "author": "Cris B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-09-01", "description": "Fun local bar\nnice bartender\nGender Bender (fun games to get the bar involved with)\nCool local crowd\nBig chance of running into other people you know\nShots happen frequently...so dangerous on work nights\nCentral location\nGood beers on tap\nThe soundtrack = Muse. (Yay)", "author": "Sonya D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-03-31", "description": "What a great little dive bar.  I ducked in here on my walk to my hotel when it started POURING and I'm glad I did.\n\nThe people here are super friendly (I'm noticing a trend here...) and they were real quick to give me hints and ideas on how to move my rear end from desert Phoenix to beautiful San Francisco.\n\nMarie made great beers at $4 a pop (happy hour) and Jeanne was a great person to talk to.  Marc was pretty down to earth as a regular... when I come back here, I'm coming to visit. :)", "author": "Jessica P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-12-10", "description": "The Hydeout a local watering hole that has every aspect of the true defintion of a great dive bar. \n\nIts not the decor that is great, or even the parking (which can be a pain), what i like the most is that its a local bar true to its roots and the drink prices are very well balanced to the area. \n\nGreat place to begin or end your night.", "author": "Jason F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-10-08", "description": "This is a cute little bar, if I was a San Francisco resident and I lived down the street this would be my neighborhood bar also!\nThe drink was a little pricey, but you should expect a expensive drink when you decide to drink at a local bar in the middle of the Nob Hill area, duh! At least it limited me to only one, because that drink was strong. \nFriendly regulars is also a added positive!", "author": "Veronica B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-18", "description": "This was the perfect bar after a long day at work. The regulars are super friendly & the music selection is classic & on point. The bartender was awesome! Alyce was very sweet & made u feel at home. At request she will her Indiana farm dance.", "author": "Ed C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-09-05", "description": "I wish those yuppie/hipster bastard scum who decide it's a good idea to shout at 2AM (when they're all leaving the bar) at the top of their lungs how drunk they are and wake me up in the middle of the night get hit by a rocket bus or a taxi going down hyde. Seriously, I hate Yuppies and hipsters so much, what the hell makes them think they can just walk around and scream like they own the place?\n\nOn the plus side, they DO have an ATM that dispenses $120 at a time...", "author": "Stevie D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-03-13", "description": "The bartenders are super friendly and I really like the setup: the colors, the chairs, and the upstairs/downstairs seating.  Plus the area behind the bar stools is wide enough for foot traffic, which is awesome so that no one is constantly hitting your back with their elbows and purses.  Extra perk, they had purse hooks on the wall too!\nThey don't serve food here, but the bartender was thoughtful enough to tell us that she was going to be ordering food, and would anyone else want to get in on the order, which was much appreciated.\n\nThe only downside is that this is a cash only bar!!!!!!  Please consider taking credit cards, I never have cash on me and I hate hate hate bar atm fees!", "author": "Lisa H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-10", "description": "Solid Nob Hill bar, conveniently on the California cable car line.  2 floors, classic dive bar vibe, can't really go wrong.", "author": "Mel G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-21", "description": "We stopped here for a night cap on my sister's recommendation and ended up staying for hours. This is truly a neighborhood dive; within moments of sitting at the bar we knew everyone by name. Fun, friendly, casual, sweet bartenders and good local beers on tap.", "author": "Maya C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-04-30", "description": "After a lovely time at the Tonga Room, some friends and I headed to the Hyde Out for some drinks to wind the night down. The Hyde-out is...well...interesting. I'm all for dive-bars, but something about the Hyde-out seemed struck me- as dingy and dirty- rather than purely divey. (And yes Yelpers- there is a difference!)\n\nIf my memory serves me correctly, the bouncers were awesome guys. I did enjoy the upstairs tables, and we all had a good time...but something about the place struck me as sad. Maybe it was the person, by themselves hunched in a corner with a dozen newspapers. Or maybe the lack of light. I'm not sure- but it just felt sad.\n\nI'd come back to the Hyde-out, if I was in the hood, but I'm not sure it would be my first choice.\n\nNOTE: The Hyde-out is CASH ONLY.", "author": "Annalise F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-28", "description": "Great prices, friendly bar tender, good variety of choices, including cocktails.  FREE WIFI!  Very easy going crowd.  And NOT rushed, such a good place to hang out and chill.  \n\nThere is a beer menu, but it hasn't been recently updated, which can also be relayed to their cocktail menu.  But, tell the bartender what you want, and she can make some good suggestions - ones that will leave you content.\n\nIf you're out of ideas, there is also a specials board on the right past the door and the ATM (oh yeah, there's an ATM!) - with three or so items.\n\nThey DONT ACCEPT Credit cards - This is a CASH ONLY establishment.", "author": "L H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-16", "description": "Wonderful location for a drink after-hours. Get there early for a seat and a quiet place to chat with friends. Once it gets crowded, there's an upstairs seating area, and the bartenders are friendly and nice!", "author": "Steve F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-13", "description": "Oh Hyde Out, how I love thee.\n\nHaving a San Francisco classic across the corner from my front door is as dangerous as it is convenient and until the Wreck Room moved in across the street I could still get a seat at the bar at midnight on a Saturday.\n\nYou won't find the youngest hottest girls or guys trolling this bar, rather, you'll find something out of Billy Joel's Piano Man (but with less actual piano man). The bartenders are witty and pretty and pour a stiff drink. The bar is cash only and the ATM will bill you $2.50 to pull it out. The bartenders will gladly recommend you grab a pack of gum or smokes at Cala to avoid the convenience fee, which is to say they are an honest group of ladies. No, folks, you will not see a bartender who is male or over 30, they don't hire them in those styles.\n\nHyde Out has no happy hour. The owner doesn't believe in HDTV. Their drinks are actually a little more expensive than what you might find down on Polk and the energy drink tastes a little odd if Red Bull is your thing. That said, this is a fantastic local watering hole full of friendly people that masquerades as a dive bar. No true dive bar has an internet juke box.\n\nPerhaps most importantly, it's one of the only bars in all of Nob Hill & Polk Gulch that isn't a meat factory. I guess whether male, female, or a mixture of both - that's why you'll keep going back.\n\nThis is they place where they know your name and the barstool starts to feel like a comfy old couch by the end of the first week.", "author": "Ian A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-01", "description": "You are still one of my first loves...when I moved into the city I ambled down the street (read: fell down California hill) and into your arms. Your wily Asian seductresses and clever local banter made me feel warm where my bathing suit goes. \n\nI moved away from you but now I am back, I am not sure if we can create the drunken nights of old but I plan on trying.", "author": "Dru P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-10", "description": "My wife got it in her head to go for a long walk in SF. It was one of the magical days that the sun was out and on our walk it got extremely hot. We decided to duck in here for a drink and cool off. This place was clearly a locals bar that had consistent regulars. These guys were extremely friendly and a bit crazy. Most of them were drunk and one was so drunk that the bartender had cut him off before 3pm. The locals bought us a couple of shots as we hung out and chatted them up. It was great experience, just know that it's a cash only bar.", "author": "Don P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-29", "description": "for a dive bar this place is awesome.\nit seems like no matter what day and no matter what time this place always has a spot for me somewhere at the bar. really friendly bartenders and a nice flow of regulars that seem to be in the same spot every time i go in there.", "author": "Cescilia A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-06", "description": "Great no-nonsense dive bar. They have a small upstairs where you can sit and watch TV or lookout over Hyde Street shenanigans. Owner and his wife are super friendly and accommodating so that's why the review by a certain Seahawks fan is surprising and probably slightly dramatic by calling the owners out. Anywho, great bar to start or end your night because you can actually sit and carry a conversation. There do seem to be a lot of regulars but that's a sign of a great bar, right?!", "author": "Jaleh R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-05-01", "description": "Really Dig this Dive\n\n***central location: corner of California and Hyde \n***chill bartenders: Sarah Rocks\n***cheap drinks \n***upstairs seating with good sunlight heating \n***mellow, chill atmosphere.\n\nBring some bills - this bar is cash only. Sit, sip, and get your Nob Hill Drink Fix!", "author": "Caroline J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-11-21", "description": "Neighborhood dive bar with an odd cast of regulars.  Bartenders are usually (but not always) pleasant and helpful.  Kiki is fantastic.  Lots of TVs so you can catch games, but beware the obnoxious hipster crowd that shows up for big events (e.g., NCAA finals, playoffs) or the invariably loud and loaded derelicts ranting during NFL games...", "author": "Mark J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-08", "description": "There was a picture on yelp that showed happy hour all day so I was hoping to catch happy hour but I guess it was just a holiday happy hour. The place wasn't too bad, it's your typical dive bar.There were tv's all around and an upstairs that had tv's too. The bartender was nice and across the street is trader joe's.", "author": "Victoria C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-05", "description": "Pretty cool sports bar. The bottom floor isn't too spacious, but there's more room upstairs. The TVs are great, but they usually show the same game, rather than having multiple games on. I came here on a saturday night and it wasn't too busy. Bartenders were nice and friendly, and definitely cute. It has a pretty relaxed environment and the people who were there seemed pretty nice as I was easily able to strike up a conversation.", "author": "Phan H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-03-24", "description": "If Jell-O is hooked up to an EEG, it registers movements virtually identical to the brain waves of a healthy adult.\n\nI mention this because the information I'm about to reveal about The Hyde-out is so important, you'd have to have the brain capacity of Jell-O to ignore it.\n\nHere's why this place rules:\n\n1. Cheap drinks.\n2. Killer jukebox.\n3. Lisa R was spot-on; the bartenders ARE super friendly. (I'm looking at y'all, Nicole and Sarah.) \n4. The locals are also super friendly.\n5. Lots of space to move around.\n6. They usually have some kind of free snacks.\n\nDon't go changing anytime soon, Hyde-out. I get you. (Wink.)", "author": "Justin S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-07-03", "description": "3.5 stars - this is really a cool place to go for drinks.  The bartenders there are nice.  You can grab a table upstairs by the window and watch the night go by...it does get a bit toasty up there though.  Great jukebox with a fairly expansive selection of genre and artists.  \n\nThis is not a dive bar in any stretch of imagination but a nice neighborhood joint to enjoy a cold one, or two, three...", "author": "Gloria H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-05-10", "description": "Hussein. Fix the damn door to the gents toilet. A customer got stuck in the bathroom. Not cool rescuing my buddy from my fave local bar in the neighborhood.", "author": "Festus W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-01-20", "description": "Well this would be a NO star rating if it could.  By far the worst & most shocking experience I have ever had. I am a Seattle native living in the Bay Area for a few years now & I love it here. After the Seahawks win against the 49ers, my girlfriend & I bar hopped to celebrate our team. Dressed in our team colors we walked into The Hyde-out. We were immediately yelled at & cursed at by a few men in Niners shirts sitting at the end of the bar. Due to their aggression, we turned around & walked out. While outside deciding where to go, 2 of the men followed us out & began harassing us. The 1st man got in our faces, yelled at us about the Seahawks, called us bitches, & threatened us physically. At that point one of the bartenders came outside & asked US to leave & told us she would call the police. She informed us that these men were the bars \"regulars\" & \"it would be best if you just leave.\"  We were speechless. Meanwhile the man is still yelling & cursing at us. We walked away & turned the corner up California St. where the 2nd man was standing, out of sight initially. We walked past him & he began to continue with the threats of violence & physical intimidation by getting in our faces. Both of these men were much bigger than us. At that point a second bartender came out & told us to leave (which is all we were doing since we left the bar on our own accord) She told us the same thing as the first bartender. The men were their regulars & it would be best if we just go. She then offered us free drinks & a hook up on another night if we would just leave. Clearly I will never go to this bar again. Neither will my friends, or anybody else I will be sure to share my experience with. The owners of this bar need to make some serious adjustments to the integrity & ethics of their business. Shame on you.", "author": "Amber S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-11", "description": "Whenever you're feeling down and low on your self-esteem and you need a nice boost, like free counseling, go to the Hyde Out. \n\nI've lived in this neighborhood for nine years, though these days, it's in a rapid decline with all the panhandlers and homeless sleeping on the streets.  I think I stay here because it replicates the excitement I felt while living in New York City (and my great studio is rent controlled!). I am writing this in New York City at the moment, that's how passionate I am about this bar. Here in NYC, I've been asked for money only 3 times in 6 days.  If I walk around my block (which is 2 blocks from the Hyde Out), I often am asked for spare change 3 times in ONE day! It's time to move back, I'm afraid! \n\nBut at the Hyde Out, once I walk in, I feel transported into a cucoon where the bartender gently soothes my nerves with friendliness and the patrons are friendly as well, giving me business advice and other solutions to my problems to make me feel better. \n\nI love this bar so much that I interviewed to be a bartender here.  One strike against me was that I had short hair.  The other final strike was that I forgot to serve the drink to the owner after making it.", "author": "Colette T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-12-01", "description": "How did I fail to write a review of this place for so long?  Oh, right: I have no strong feelings about it whatsoever.\n\nIf you were going to stalk me circa 2006, this would be an EXCELLENT place to start.  Because you can sit in the upstairs portion and almost see the door to my apartment building.  Based on this proximity, one would expect that I would have spent a fair amount of time having leisurely drinks here while escaping from the clausterphobia inspired by a 600-square-foot apartment.  And you'd be wrong.  Because it ain't that great.\n\nI remember quaffing a few beers while watching a World Cup match.  I remember the beers being vaguely cold and the service being somewhat prompt.  That's about the best I can say about the place.  And it ain't much.", "author": "Ben P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-11-02", "description": "They don't make bars like this anymore, at least not in San Francisco. You won't find any bottle service, no ultra lounge atmosphere, not even turntables. What you will find is a motley crew of hipsters and crusty patrons who call this their regular watering hole, mixed in with a few passersby who have a thirst to quench. \n\nSitting at the bar means talking it up with other customers, which is once again a lost art. To clarify: I don't mean hitting on Marina chicks, just good old fashioned shooting the shit and telling tales of the glory days. On game days, they even have free food like hot dogs and chips out; nothing fancy but it's on the house, which flies against all that gourmet gastro pubs and the like stand for. Don't care to watch the game? Me neither, it doesn't matter here. \n\nThe best part of the Hyde-Out, aside from its perfect name, is the upstairs. It's a quieter set of tables, meant for gathering with pals and watching the world outside as you \"hide\" out from whatever is on your back, be it a monkey, an ex, or that next rent payment.", "author": "Nish N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-10-31", "description": "Comcast blows. Fox blows. All I want to do is watch some good football in this town.\n\nHydeout, you let me roll out bed and into your sunny, friendly warmth for the 10am games. Sometimes you feed me. It's ok when you don't. I appreciate that you let me watch my football and don't make me feel like I must order a beer 10am on Sunday.  \n\nGood crowd, friendly fans from everywhere.\n\nJ'adore.", "author": "Kim K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-11-29", "description": "I just popped in for a moment near closing time, but I think I've found my next Sunday afternoon* writing spot!  The energy in here was so warm and homey, the interesting narrow structure of the building reminded me a bit of Vesuvio but filled up with neighborhoodies and with pie and board games in the corner.  See you again soon, Hyde Out.\n\n*Though I suppose in announcing that I won't really be Hyding out.  Wah wah.", "author": "Jennifer B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-11", "description": "Nice bar with good draft beers and cocktails. Nice area upstairs with tables and chairs and view of street. also have large TV screens.\nOne star removed for not accepting credit card and being very noisy", "author": "E B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-01-12", "description": "Cash only bar, although they have an ATM by the door. \nWith time to kill before heading to SFO, myself and company were scanning the streets for a bar to check out. Signage outside advertising happy hour specials caught my eye and broil insisted we check this spot out. First thoughts; not sure what to make of it. Bright red walls, mirrors and a very, mixed bag of people. Sports on the tube and then some lady decides to play a Bee-Gees track(?). Short bar with seats mainly at the bar, a second floor for restrooms and I think a seating area which overlooks whats left of the room. I don't remember seeing waitstaff, but, doesn't mean they don't have them. Earlier in the afternoon they had crock pots setup with appetizers available for free with a drink purchase, that's something you don't find all too often at typical bars. General food like nachos, cheese and chili. What was cool about the setting for me were the people. Not just one sort of customer, old and young, the pension receiving fixed income man and the sex and the city ladies gossiping it up with their gay boyfriends. Watch the games or listen to loud mouthed conversations, drink and be merry.\nBeer of choice was the Prohibition IPA.  Four of those and I wonder how you SFranciscans make it up and down these sharp inclines.", "author": "Jacob J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-12-28", "description": "As an out-of-towner, I felt right at home at this place. Very friendly bartenders treated me as if I were a regular, which I would be if I lived in San Francisco. Definitely make the Hyde-out a stop if you're visiting, or make it your go-to bar if you live in the city.", "author": "Gene W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-01-15", "description": "For once in my life nothing to complain about. \n\nMy five stars are not for super chic interiors, bottle services, five star service or anything like that. My five stars are for the amazing people who run this place and the awesome times I always have here. Be it drinking in the morning after a night of bad decisions and shooting the breeze with other patrons or the fun crazy nights here with friends. I just always have a good time here.\n\n\ncheap drinks, always interesting people. This place always makes me nostalgic for the long hot summer days playing scrabble and sipping on beers and Jameson at 1PM. \n\nCash only. But like Jacob J says - ATM is outside. \n\nThere is always good vibes here. Which I love. Even if you see that one guy at the bar by himself and you can tell he's had a horrible day he still is sitting with a tiny little smile on his face. I love this place.", "author": "Amanda S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-09-29", "description": "Great place to talk to the local crazy. The local hot girl and the local drunk. The bartenders are sexy smart funny and the girls you want to date.", "author": "Michael T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-03-29", "description": "Zero stars if I could. Walked into this place the bartender is smoking outside, she said she would be right in. NO. 5 minutes. I'm a bartender it's are job to serve people. Not smoke. I would fire this girl immediately if the owner knows whats good for his business. 3/29/2014 @ 2:50 pm", "author": "Evette M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-08-25", "description": "Basically this is the bar your parents would go to if they never got married. The scene is friendly and chatty, but the attendees are pushing 50 at best. \n\nThe bar is pretty cool though, the bartenders are lively and quick to serve, and the upstairs is almost always open if you have a big group of friends and you want some private spot to chill.", "author": "Anthony C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-08-22", "description": "This neighborhood bar has been around for years, but I've come here just a few times (but still haven't been upstairs). Hyde-Out has a strong neighborhood following. I went with a friend and we seemed to be the only two folks who didn't know everyone else. Lot's of hugs and back slapping, just none for us. \n\nRecognizing Hyde-Out is a beer and shots place, I order something on tap. But the last time I was there, my companion ordered a melon ball(!?). The bartender asked what that was. So, my companion changed his order to a V&T. But then the bartender got all huffy. \"You don't think I can make that?\" My internal monologue went something like, \"You don't even know what it is.\" Sitting one stool over, a regular with a smoker's raspy voice vouched for the bartender and remarked that the bartender had made a great kamikaze. But her opinion was suspect since she only had three beer bottles in front of her (two of which were empty). In an effort to keep the peace, he ordered the melon ball and the bartender took out a shredded copy of Mr. Boston's. The melon ball was tasty--like candy--but tasty.", "author": "QuodE D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-09", "description": "Great bartenders, always friendly. If you can catch Geoff on the juke box, you are in for a treat.", "author": "Allen E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-10-31", "description": "I loved this little bar, was there October 19th with a friend and We had å blast. The bartenders  is fantastic, very easy going and fun to talk with. The same is the locals, cool people. So if you  are nearby, take time to stop by.", "author": "Rolf L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-06", "description": "Went in for quick one while waiting for my take-out @ Golden Horse Restaurant.  (The restaurant was packed and I didn't pre-phone in my order.  The waitress said 25-minutes).\n\nSmall, cozy bar with 70's orange-colored walls.\n\nFriendly bartender.  Good vibes all around.  \n\nI had two brews.  Best 25-minute wait this week.", "author": "Derek N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-05-03", "description": "ok peoples. DYL is officially bad for my health. after attending my second one, i think it's time for me to retire.\n\nthe first time i ever stepped foot into this bar was in 2001, and didn't think much of the atmosphere. i would have given it 2 stars back then.\n\nhowever, last night, i met one of the coolest bartenders in SF. she was super attentive although busy and had the friendliest attitude toward yelpers and regulars alike. \n\nthey had blue moon on tap which they served in a pint glass with a large slice of orange. very yummy. \n\nafter my third pint, i had to get dinner with adrienne or my evening would have gone to the shitter faster than saying, \"mommy!\"", "author": "May T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-02-22", "description": "Writing this, as I am, sitting at one of the upstairs tables watching the traffic pass by the intersection of Hyde and California, I am able to say that this is one of my Top Ten bars in this glorious city.  But to call it a \"dive bar\"?  I'm not so sure about that.  It's well-spread out, it has great drinks and beautiful bartenders.  It has two levels with little tables that look out open and spacious windows so you can drink and watch life just pass you by.  It has a cool little Internet Jukebox with Depeche!  Def Leppard!  AC/DC!  Madonna!  Dr. Dre!  The Band!  Van the Man!  Et cetera et cetera et cetera.\n\nThis place is also one of the first (if not THE first) bars I visited in the City.  My ex and I were staying at the Ritz-Carlton while we looked for a house and we hooked up with some old friends of mine when I lived in downtown Saint Joe.  You could smoke here back then (late 1999), and the feeling was so warm and cozy and with absolutely ZERO attitude.  I truly enjoy coming in here with my laptop (yep!  They have free Wi-Fi), sitting at a table with a Black Velvet, and tap-tap-tapping away.\n\nBut to label this place a \"dive bar.\"  You know, I just don't see it.  Though the bathroom leaves a little to be desired.  This is not a \"dive bar.\"  A little old lady crosses the street with a cane.  A cable car passes nonchalantly by with its little ding-dang-ding-along-ding-dong.  I sip my Black Velvet and enjoy the view.\n\nGreat fucking bar.", "author": "Thomas B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-10-03", "description": "The Hyde-Out has become sort of a default after-dinner dive bar for me when I have a friend or few in tow and we want to get our drink on without a lot of fuss. It's not a place for a refined evening...mmm...no.  It IS a place to have doubles poured as standard cocktails and taken to the escape level on the second floor. You could also stay on the first floor and be prepared to witness or engage in a slightly happier version of Barfly.\n\nSo...the jukebox will always be going. I heard a really sad Cat Stevens song the last time I was there and my double Maker's Mark and ginger seemed to fit the mood. The second floor is all windows, wooden tables and chairs and a weird fake fireplace. Listen to the sounds rising up from the first floor, count your blessings and stare out into the sky. It's really a great place to to hide. Don't seek though - just hide.", "author": "wendella a."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-11-19", "description": "I derive a great deal of joy from looking out over the intersection of Hyde and California and the Cala Foods parking lot.  For some reason there is always a stream of people walking by and some asshole trying to parallel park in an impossibly small spot. I find it all very entertaining...I'm easily entertained.\n\nI watch these things from my happy perch on the second floor of the Hyde Out in a beat-up old bar chair...the heavy, wooden, comfy kind with arms. Also, I'm usually playing Scrabble. But Scrabble is different at the Hyde Out. First of all, you're probably drunk...then there is the unique challenge created by all of the missing tiles. The letter Z, for example has been written on a blank tile in sharpie. The other blanks are nowhere to be found, as I suspect are many other letters (but I cannot prove this second claim).\n\nThe jukebox is pretty damn extensive and drinks are cheap...bartenders are friendly and everyone in there seems like a regular...and the fact that they provide board games? I can't imagine a better way to spend an evening.", "author": "carrie c."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-01-05", "description": "This is the first bar I went to in San Francisco!  \n\nAppropriately named for it's location on Hyde St., which was a short walk from my new apartment, it was the first place that caught my eye.  With so much turnover in that area, it's nice to know that it's still around.\n\nI'm going to have to go back again soon!", "author": "Lauren C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-09-23", "description": "It's been over 2 years since I keep going back to this dive.  The bartenders have changed at least 3 times.  The good ones left, and the current bartenders are a hit or miss (thus the 3-star).  Low-key Marie hooked me up during my bday last month (not even sure if she's still around).  Unfortunately, met up w/ a totally insane chic who dropped too much acid, and it was then time to leave.\n\nIf you wanna just hang out, this place still rocks.  The locals are mostly friendly.", "author": "Rod '."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-02-16", "description": "Hahaha, this place was great!  I went here for a drink with my friend after we had dinner and it was too awesome.  It has a fun decor about it and a cute little spot upstairs where you can sit too.\n\nI just had beer and it was priced right, but my favorite part was the girl working at the bar and the other people sitting in there!  She was the cutest thing and so welcoming.  All of the sudden a lady at the bar, who looked like a regular, and the bartender had a huge pizza delivered.  They looked as if they were having a family dinner, which I thought was too cute!\n\nThey also had hot dogs for anyone that wanted one over on a side table...how much better can you get?!?!?!", "author": "Tressa C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-09-21", "description": "12:50pm on a Sunday, looking for a place to watch the Niners game after realizing that Zeki's is closed. I pop into the Hyde Out in time for kick off. The game is on (no HD here - we're lucky to get audio) and the bartender very sweet. Unfortunately, my Bloody Mary was pretty weak and a bottle of Bud Light is $4. The crowd? Heavy on local, also heavy on drunk.\n\nMy search for a decent spot to watch NFL games continues...", "author": "phil h."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-01", "description": "This place is laid back, affordable, not a scene, and on the California cable car line.  Back in the day when drinking was my thing I loved the upstairs area that over looks the area and the table by the bitchin jukebox.  It is a good spot to catch up with friends on the cheap.", "author": "D B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-06-27", "description": "Pirate Pub Crawl bar #4\n\nThis was pretty posh for a dive bar (except for the odd cold storage locker across from the bARRRR marked \"not for customer use\").  The bartendress seemed happy to see our crew and humored our pirate sensibilities.  \n\nThe view from upstairs serves as a fine crows nest for the intersection, and if you're lucky, you can harass some limp ninjas in burger king pirate hats while you're there.", "author": "Andi T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-06-09", "description": "This place seems to have taken a dive. My friend and I went here on a random wednesday and we came across the only guy bartender named \nCheek or Chin.\nHe poured us the smallest crown/washington apple. we gave him some shit about too.  My friend and I are great tippers. I just hope next time I come here they will actually have there PBR and Pirone taps filled. There stella tastes a little on the warm less fizzy. \nI think the owner needs to re-vamp his TAPS. Take some out completely and leave in the the best sellers with full kegs and not pony kegs.\n\nUuggghhh!!!!", "author": "Andrew Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-02-19", "description": "I don't know if the Hydeout is \"ill\", but it's definitely a decent spot to grab a drink that's refreshingly free of hipsters or Marina-types. It was nice and quiet on Saturday night, so we were able to take over the upstairs area. I'm not too crazy about internet jukeboxes, so that's hardly a plus, but overall I had a nice time here.\n\n(FYI - it's cash only.)", "author": "Jeremy P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-10-29", "description": "Look here, I'll be honest. There is nothing, at least at first impression, of particular note about Hyde-Out. On any given night, I'd give it 3 stars at best.\n\nBut here's the thing - I had a very fun night here on Sunday night, getting drunk with total strangers. Came here to catch Game 4 of the World Series, and immediately met a Red Sox fan, which was awkward cuz I'm a Yankees fan. Whatever. Fast forward 5 pints, and guess what people, it IS possible for Sox and Yanks fans to have a good time together. Throw in some dude from Kansas City who just wanted to get drunk with us, add in a totally cool bartender who gave us free drinks, and by God that ain't a bad Sunday night in my opinion. All smiles, dude.", "author": "Drew S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-05-09", "description": "If I lived around here, I could totally see myself going all the time. It's laid back, populated with the usual cornucopia of bar regulars and the drinks are cheap.  I especially appreciated the beer special they had going on where you got the glass for free upon a $5 purchase of some beer (I had started with a fairly strong vodka soda for the same price so I have trouble remembering which brand it was) and each subsequent beer was a dollar off.  And yes, I stuffed the glass in my purse and it fit. :D\n\nGreat views upstairs of Nob Hill and it had a fireplace too (though I'm not convinced it worked since it didn't look connected to anything).  I think I got a sort of part-time job offer too (no, not THAT kind, that's a block or 2 over and a few blocks down) - between that and getting to know people on this little website they call \"Yelp\" it's a good spot for practicing one's mad socializing skillz.", "author": "Sus... B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-12-30", "description": "Not so much a dive as someone's red-hued living room that happens to have a fully equipped bar, TVs, and a shelf of games and books. (Two about depression, the 2000 Poetry Market guide, others I forget.) All ages in here made for a more relaxed night. The lady bartender spent a lot of time smoking outside with her patrons, but she was sweet and her drinks were pretty cheap -- $13.50 for three. And then some dude gave us a slice of Round Table...oh happy day.\n\nIn conclusion: free pizza, cheap-ish drinks, and no troubles finding a table to sit and catch up with friends. All the makings of a solid night out.", "author": "Annee T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-04-06", "description": "this is a review for Nesia the bartender. Did you know the guy who owns the Hyde-out also owns the Miraloma Club? I think he's focusing on the \"not quite a dive bar, more like a place for locals\" space. \n\nSo Sunday matinee at the Miraloma and Nesia's covering a shift. She easy on the eyes, quick with a drink and can follow a conversation. Indosian / Australian and yes she has that cute accent. \n\nI can see the allure in the Hyde-Out and now that John Barleycorn's dead and in the cold ground, this may not be a bad place to go.", "author": "jim b."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-10-28", "description": "San Francisco classic! I'm not a big fan of dive bars but this place is chill and the bartenders are friendly. Middle age type of crowed (40-50s) and they are happy to chat with you and volunteer their stories so it is an experience.", "author": "Kajal P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-04-02", "description": "Craig E. makes a very valid point: this place is just too small. I like the bar, like the bartenders, like the atmosphere, but the space is too cramped. As I point out in my Nob Hill Tavern (across the street, much more spacious) this place is akin to drinking in a corset. Not that it's got  a lot of strings and what not, but in that it's very tight fitting.", "author": "Wes T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-03-31", "description": "The Hydeout pretty much has the nicest bartenders your ever likely to meet.  I came here late one Friday night because Zeki's up the street was closed for a private party.  The bartender politely asked for my ID and when she gave it back she introduced herself as Sarah.  She was quick with drinks and they were cheap on top of that!  \n\nA little more space on the downstairs area would render this bar a 5 star perfection!", "author": "Craig E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-07", "description": "Weny here for my birthday. Drinks were good, atmosphere was agreeable, and it never got too crowded. Only downside was a lack of enough chairs in the upstairs.", "author": "Daniel F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-01-29", "description": "This place is ill. The bar owner and staff are all cool. They have an internet jukebox. Prices are fair. And the bathrooms are actually clean, first dive bar I've been to out here to actually have bathrooms where I don't pull my pants up in fear of getting the bottom cuff in pee. \n\nDefinitely plan on coming back to this spot when I get a chance.", "author": "Tommy P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2007-05-17", "description": "One star because this place was great fun for several weeks, and for the most part I agreed with all of the reviewers here, until last night, when I feel the bartender overcharged us a bit and was very rude.  Two of my friends showed up after the first round and remember seeing cash on the bar in front of me and the person who showed up with me, but we were charged for this.  Additionally, we were charged for a set of kamikazes we did not ask for which the bartender wanted to \"share\" with us.  After taking shots with us, the bartender's response to my protest of the bill was:\n\n  \"I have not been drinking.\"\n\nIt's worth noting that you should not be drawn to this place because of the sign which says it has free wireless internet, because you will be lucky to get that working for 3 minutes out of 3 hours.  They have unconfigured retail network equipment whose signal is fighting with one of their residential neighbors, and when I offered to fix it they simply shrugged.\n\nCome if you will, pay for each drink and don't let the bartender be \"friendly\" by keeping a tab open for you in their head, don't accept the free shots, and don't feed quarters into that juke which just asks for a quarter at a time until it is \"satisfied\".", "author": "Justin R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-08-28", "description": "On Saturday night my boyfriend and I were hanging out at his buddy's place on Hyde St.  The three of us eventually got bored watching the Ultimate Fighting Championship and playing \"Guitar Hero\", so we decided to mosey down the block and check out this bar instead.  \r\n\r\nNow, I don't often venture out of my Mission District neighborhood to go drinking, but lemme tell ya: I got *HELLA* drunk and had a great time at this Russian Hill joint.\r\n\r\nIt started out innocently enough with a lemon drop, but then I quickly descended into drunken oblivion by consuming drinks called \"Super Pussies\" and \"Scooby Snacks\" (good gracious, those Scooby Snacks were gooood!).\r\n\r\nBy the end of the night I was swivelin' around on my barstool, singing along with the jukebox to \"Sweet Caroline\", and shouldering my way through the crowd of other American Apparel track-jacket-wearin' patrons.  \r\n\r\nOur bartender was really nice and had beautiful singing voice.  The drinks were cheapish (although I think my BF's buddy paid for most of them - thanks Aaron!).  \r\n\r\nGood times, yo.  I'll be back.  :D", "author": "Karen F."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-08-22", "description": "Request for simple service like help out but owner refuse. So I left without getting anything from them. Provide good service is the most important key to have buy drink.", "author": "Ray K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-03-20", "description": "It would easy to find yourself debating over whether the hydeout is a dirty dive bar or just a down-to-earth neighborhood bar.\n\nOn one hand, it's near the Tender-Nob, bums hang around the area, there's a guy named 'grandpa' that regularly passes out at the bar, I have seen at least one fight go down outside, there is occasionally a hint of vomit-like odor inside, the nicest wine they have couldn't beat two buck chuck in a blind test.\n\nOn the other hand, everybody knows your name (even if its just your second time there), the bartenders are super friendly, there are board games, they'll happily order Chinese food to be delivered for you, it's not unusual for random jukebox sing-a-longs to break out, more than once have I seen free shots poured for the entire bar.\n\n\nWhatever this place is, I can sum it up like this:\nIf you wear Armani Exchange, go to Slide regularly, or must swirl your wine to release the tannins, this place is definitely not for you.  If you like friendly bartenders, very diverse crowds, and drinks more legit than MC Hammer, you won't be disappointed.", "author": "Scott M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-01-18", "description": "You're not going to get picked up here.  You will be the first in line at the bar.  A seat is almost always open.  Their 3 counts are really 5 counts.  You can carry a conversation here instead of struggling with the 5 inch woofer next to your ear in other bars.  And thier single stall bathroom is, whoa!, always available and relatively clean.\n\nYou wanna drink and just that, hide out here.  A serious chill ass bar with a great upper loft area for a semi neat view of Hyde & California.  Watch the cable cars roll by and ... um... oh, CALA supermarket.  That's about it.  But that's cool... you really just want to grab some cheap booze with some buddies and maybe play some Liar's Dice.", "author": "Chris T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-11-20", "description": "Liked the Blue Moon beer. And the view from the second-story loft ... very cool.\n\nBut the Bitch raping her Dude ... what was up with that? Honey, find a room. I'll tip you a dollar for the courtesy. Really, it's probably more than you'd get walking the street.", "author": "Allison L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-01-05", "description": "This place is grrrrrrrrreat!  I am so glad to have an awesome local bar to go to, just a mere few blocks from my house.  That's stumbling distance, people!\n\nBeen here twice before, once just to try it out, and then again for NYE.  Nicole, the bartender, rocks.  The locals here are super friendly.  The drinks are inexpensive.  They have a jukebox where I can play lots and lots of oldies.  It's perfect.  Just remember, CASH ONLY!\n\nThank you to whoever created this place.  It is a gem!", "author": "Ashley S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-08-09", "description": "This is a really good general bar.\n\nThe prices are what you would expect.\n\nThe bartenders are nice, and the girls are hot. They will be friendly with you.\n\nThe drinks are really great.\n\nThey have scrabble and a few other games.\n\nThey have an upstairs area that's fun and secluded. I would go on a date here.\n\nThe jukebox rocks. \n\nThe only negative: this bar could use more personality. Its kind of just a big brown block where people drink.", "author": "Alexander W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-10-08", "description": "One star for going where I haven't been before. \nTwo stars because they had beer there.\nThree stars for being able to easily hear, talk, glance at the game, and have some happy energy around the bar. \n\nMinus one star because getting drinks seemed to take just a bit longer than necessary. \n\nAnd minus the other star to balance it with my other reviews.", "author": "Danielle V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-11-25", "description": "A Bar worth walking 6 blocks for.  \n\nIt also happens to be my favourite Wednesday afternoon beer joint, of course without a recent redundancy at the workplace I wouldn't have found this gem.  Nowadays I would rather call in sick than miss a coveted afternoon drinking event at this Nob Hill gem.\n\nWorthy of mention is Kim, she's definitely one of the better bartenders I've meet in SF, a true professional in every way.\n\n\"Hyde out ... it's the tits mate.\"", "author": "George K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-05-01", "description": "Here's the thing: Every time that I go here I end up spending a lot of money. Now, I know that some of you might say, \"Dude, your going to spend a lot of money when you drink a lot anywhere.\" And I would normally say yes, except for the fact that I haven't ever had a lot to drink here. Oh, and they are cash only; I would understand if it was the Mission, but somehow it always annoys me on Nob Hill....\n\nIn the end, I'll be back. You get exactly the drink that you order. No more, no less. And, I have friends that live around the corner.", "author": "Matt C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-06-27", "description": "I first went to this place a bit ago after work, right after eating next door at the Golden Horse (excellent food by the way!)  So as a way of digesting my Chinese food, I decided that I needed a whiskey and a beer.\n\nHeaded over to the Hyde-Out, which was fairly quiet, but again it was probably like 7 or 8 on a Tuesday, so that was ok with me. We hung out in the upstairs area, which has a great view of, uh California and Hyde, so not that much to look at, but the windows are still pretty nice, and it has a TV upstairs so we could watch the Giants game.  \n\nOverall, a nice place for a local dive bar. Not exactly in my neighborhood, but my buddy lives a block away so I can see myself returning here in the near future for another Newcastle. And a whiskey.", "author": "Matthew S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-08-11", "description": "I just mentioned the Hyde Out as a great alternative a minute ago, when I gave Zeki's up the street 2 stars. It's sort of a dive I guess, but not in as dumpy a way as you'd imagine when you think of what that usually means.\n\nIt's pretty cheap and there's an upstairs and downstairs, with plenty of tables to sit at. You can shoot the shit with your friends while looking out the window, watching all the weirdos shuffling in and out of Cala Foods, which is across the street and open all night. The bartender chick who I've seen there a lot is totally dysfunctional and sort of crazy seeming also, which has provided some great entertainment.\n\nBad things: they have one of those super expensive jukeboxes where you have to download the songs for \"3 credits\" or whatever, instead of a real jukebox, so needless to say, there isn't always a lot of music and it costs a lot to hear what you want to. And it can take FOREVER to get a drink here, if the bartender is having one of her crazy fits.", "author": "Heidi G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2006-02-08", "description": "Sort of a crappy, awkward bar (and set-up). Upstairs you get a good view of Cala and can avoid the rif-raf patrons. If you like hanging out with winners, this is probably not your scene.", "author": "Andrew K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-05-22", "description": "I've been here two or three times.  Clean and completely unthrilling, this is simply a neighborhood joint.  The clientele tends towards the dyed and gray-haireds.  Television screens show sports only.  There's a second level where sunlight bounces around the unstylish tables and chairs.  The bartenders are professional but friendly.  Generous pours and a view of the California Street cable cars.", "author": "Poet D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-10-01", "description": "Ok, read the rest of the reviews for basic info on the place, but I was very impressed by the classy move of the bartender when I went today. \n\nI ordered a bloody mary (hey it was only 10 minutes past noon - too early for beer). She carded me and I promptly showed her my ID. Now, instead of the typical move of whipping the card back and impersonally turning back to the bar, this fine young bartender handed back the card and said in a friendly tone, \"Nice to meet you Josh, my name is Sarah\".\n\nA very small act, but a rare and genuinely kind move.", "author": "Josh B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2005-11-08", "description": "I love this place, mainly due to the random people that pop in who are generally a bit cantakerous.  The take-no-shit, but friendly bartender is awesome and attentive.  I have yet to venture upstairs, but the jukebox and I have made friends.  They recently added a fancy digital & downloading jukebox to up the ante.", "author": "Mac M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-03-07", "description": "Great place to go drink and talk with friends. Friendly Shatangi-lovin staff.  Kinda divey but cheap y'all\n\nShatangi told you", "author": "Njon W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-03-11", "description": "After living less than three blocks away for six months, I finally made it into the Hyde Out. I have run past it numerous times on my way into Cala, but never thought much about going in. \n\nHowever, seeing as Zeki's was bursting at the seams with people on Saturday night (who knew there would be not one but two birthday parties going on there) my friends and I decided to check it out. \n\nNot a bad place. It doesn't have the same carefree demeanor that Zeki's has....Hyde Out has a darker, older vibe. All the same, the selection of tap beers was pretty good and the prices were even better.", "author": "Jenn G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-08-08", "description": "Absolutely love this place.\nFeels like home and it is the place i want to start and end my nights, but then i get there and dont want to leave.\nThe Bar Staff are GOLDEN, really friendly and make the place.  They give it a friendly warm environment and make you feel like a regular after your first visit.  And there is nothing better than getting shit from other aussies... makes me feel like home\nJuke box is one of those new high fangled devices that let you get random crap off the internet and play it so it has the best selection, cause it has everything.\nI have also never heard a better whole bar performance of \"Total Eclipse of the Heart\".\nGold, pure gold", "author": "Nathan H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-01-24", "description": "They serve beer.  They serve cocktails.  They serve wine. They might even serve water although Ive never had the audacity to ask for such a thing. They have a jukebox (you can put money in it and it will play your songs).  They have two bathrooms, one for men and one for women. \n\nBut, the best part about the Hyde Out is the fact that you can go upstairs and feel like a GIANT because of the low ceilings.  Any time I feel down, all I have to do is order me up a drink, march upstairs and I feel 100 feet tall and invincible (OK, maybe just taller). \n\nOh yeah, and its another fine establishment with a fake fireplace.... how can you go wrong with that!?!?\n\nAnyway, its a dive bar, with great people watching from the second floor.", "author": "Chris G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-05-26", "description": "I love this place.\n\nThe bartenders are all friendly and extremely warm ( bonus points they always remember my drink even if I don't come for weeks). \n\nThe up stairs seating area is a glorious little hole to hyde out in do what ever alone. You can sit by the window and sip your beer while reading a book. \n\nThe regulars here are some of the friendliest people I've ever met.\n\nPrices are standard for SF. About 5bux for a beer which isn't too bad. \n\nAnd the juke box has almost anything you could want on it, all the way down to obscure eastern european techno that you laughed at back in high school.\n\nOver all, I just love this place.", "author": "Jude B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-01-01", "description": "I guess since we missed happy hour it isn't a cheap local place to visit. The bartender poured a guinness creating 100% head. No garnish on my dos XX. And be warned CASH ONLY. Maybe we just had a bad bartender. Had only 1 drink and left. Ambiance is cozy. Nice upstairs. Too bad. Had high hopes for this place.", "author": "L. .."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-25", "description": "I wanted to go to Hyde-Out for a long time before I actually made the effort to check it out, now it is one of my favorite bars on this side of The City. I'm deducting a star because I think that the drinks are a little overpriced. \n\nThree things that make this place awesome:\n1) Beer selection, the owners obviously know what they are doing and appreciate good beer.\n2) View, the upstairs is really neat with a nice view of California Street and the cable car.\n3) Bartender, the bartender is really friendly and always says \"Hi\" and \"Bye\" when you go there.", "author": "Ryan S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-08-19", "description": "I love this bar!  Close to my house, good prices, great service and plenty of space.  It's a great place to go grab a table and chill while you enjoy the view of the cable cars on California.", "author": "Corey V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-10-09", "description": "I popped in here a few months back and forgot the name of this place until just recently. I'm so glad I remembered it, because I have been dying to go back. I got a couple of draft beers here after trekking up Hyde street *not for the faint of heart* and it was just the pick-me-up I needed. A good selection of drafts, crazy friendly bartender, adorable decor, and a clean restroom *practically unheard of in the city* made this a great experience. I will for sure be back.", "author": "Colin A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-01-08", "description": "I'm a big fan of dive bars, and the Hyde-Out delivers. Be sure to grab a table upstairs (a warning: it get's really sunny) and enjoy their prime people watching with some friends while listening to some great tunes.\n\noh, and they have a great beer selection", "author": "Sarah S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-02-24", "description": "My friends and I stumbled upon this little neighborhood gem after gorging on yummy Indian food and wow, we're glad we did!\n\nThis place offered exactly what we were looking for:\n1- a chill place to watch sports (well, by sports I mean the winter olympics)\n2- delicious, reasonably priced drinks (gimlet, up)\n3- board games (although no settlers of catan...)\n4- super friendly staff (Alicia)\n5- clean bathrooms (quite a shocker considering this place is referred to as a dive)\n\nSadly, it's not near my neighborhood...sigh...", "author": "Elizabeth C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-11-09", "description": "I love this place.  Great neighborhood bars with gorgeous and friendly bartenders.", "author": "Jasmine J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-12-26", "description": "Hyde-Out looks and feels a lot like Twin Peaks in the Castro, however, if you spend much time at Twin Peaks in the Castro you probably shouldn't be doing a lot of looking or feeling at Hyde-Out.", "author": "P J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-14", "description": "Liked that it was quiet, drink prices were fine. The upstairs section is a really nice place for a conversation. Beer selection wasn't great.", "author": "Nick S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-06-29", "description": "Really comfortable, non-scene fantastic bar.  Really excellent bartender doubles as a chanteuse on occasion, to the delight of everyone in the establishment.  Lofted 2nd floor is cozy and perfect for people watching those on the street.  Superb net-connected jukebox had a very good selection of Erasure and all the music you could ever want.", "author": "Mark T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-04-08", "description": "Love this bar. Longer you sit there the taller the drinks! Plus the bartenders introduce themselves the first time you sit down (even if you've been here before and didn't meet that tender last time). They get to know you and the patrons are just as friendly. Great place for a taste!", "author": "Taylen P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-01-17", "description": "I've been here a few times, but I don't really care for it. It's obviously a neighborhood bar, and being that I live in that neighborhood I guess I should want to be in on it... But I don't. The people aren't very friendly and it's very loud at times, but not in a good way..", "author": "jen w."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2005-09-30", "description": "right next door to our apartment, so its an easy stop home from anywhere. great beers on tap (28) some of which i have never even heard of, oh and good pear cider. \n\nthe upstairs is mellow and gets lots of light. good place to chill and have a conversation. really nice avocado plants, but not too interesting decor. older crowd usually. but good to have in the neighborhood.", "author": "Ligaya T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-03-31", "description": "Look for the little Indonesian bartender.  She's sweet and will tell you a story that'll break your heart.  Or what's left of it after your spill it out all over the bar counter because you drank waaay too many vodka tonics...", "author": "Joyhan S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-07-17", "description": "I'm just gonna say, this is a straight up neighborhood bar. No glitterati, no sexy hipsters. Just good drinks and a good jukebox, where everyone knows your name. for real. they do.", "author": "Ahnui Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-04-13", "description": "Good old fashioned dive bar....mellow & fun..my kind of place...cool upstairs seating..and you can park across the street at Cala Foods...they don't tow you even though the signs say they will...at least not in my experience.", "author": "Michele K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-03-20", "description": "This is a cool little bar with a nice atmosphere.  I like the upper loft with comfy chairs and little tables.  They had plenty of room for a big group of us to pull our tables together and hang out after class.  I also really liked the pear cider on tap!  Nice place to stop if you're ever out in this area.", "author": "Laura W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-12-29", "description": "This is now my new bar after the John Barleycorn bar closed and so far it has been a fine replacement. I like the second floor in case you need some space, and they are usually playing the sporting event that is on at the time. Overall I recommend stopping in!", "author": "Dash H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-06-23", "description": "I like this place.  It's cozy and there are plants and stairs.  The barpeople are efficient just like my imbibing ability.", "author": "ellyk E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-04-09", "description": "Four stars for clean bathrooms and good drinks.  No, it's not a dive bar, definitely a neighborhood bar.  Nuff said.", "author": "Robert G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-02-26", "description": "I'm a fan! A big fan of this place for the following reasons:\n\n- Great beer selection\n- Wonderful and cozy upstairs\n- Internet Jukebox\n- They have board games that you can borrow and play at the bar\n\nCarrie C. just had her birthday party here last Saturday and got to see why this place is one of her favorite neighborhood dive bars. Her party was upstairs where they were playing scrabble. I found out that the board belonged to the bar. That's something so cute! It's not the first time I've heard of something like that - it's just the first time that I've encountered that sort of down home neigborhood hospitality in a while. The bar also has a few good TV sets and would be a great place to go to watch a major TV program or sports game with a crowd. I'm thinking of coming back here to watch the presidential debates - because this is the sort of place that can take care of all of your needs without the expensive price tag you might encounter at a fancier bar trying to be all things to all sorts of people. I like Hyde Out best because it's just trying to do one thing really well such as create the perfect spot for a someone to go and grab a drink. \n\nOne last thing: You do need to remember to bring cash", "author": "Laura G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-08-29", "description": "The Hyde Out has some cool seating, especially upstairs. The upstairs part has floor-to-ceiling windows. Other people on here are saying it has a great view...I guess it's okay. Nothing really to look at except people and CALA's grocery store (which brings the neighborhood down a notch.) Good place to sit if you want to people watch. \n\nOther people on here have said that the bartender is super nice. We had a women bartender and she was just okay. Nothing special. She didn't smile or anything when one of us mentioned how hot it was today. \n\nThe beer selection is, again, just okay. Didn't see any Belgians (not counting Stella) or anything super interesting. But then again, I'm used to going to beer bars and, of course, this isn't a beer bar. \n\nMy girlfriend got a vodka tonic and it was a huge and strong vodka tonic. This may be a good starter place. It was Friday though and there were just a handful of locals.", "author": "Matt S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-02-28", "description": "This place is 4 stars if you get a table on the 2nd floor by the window. Otherwise, it would probably be a 2.75. Good music, good beer -- over 20 on tap, and pitchers available. Definitely a good neighborhood spot for a couple down in ones.", "author": "Defne A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-02-05", "description": "This place is right up my alley as far as dive bars are concerned. They give out free hot dogs, have good beers on tap, friendly bartenders, games to be played, and interesting people (and dogs) going in and out. My friend and I have been on a search for a good dive bar, and while we were sitting there, we knew we had found our second home. Plus, it is conveniently located halfway between our apartments. Whats not to love about the Hydeout?", "author": "Caitlin D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-07-11", "description": "YES - thank god - a laid back place to get a drink on a friday night and maybe watch some TV - people seem like regulars (one was reading a book at the bar) - no screaming drunk girls, good jukebox - it is so nice to sit on the second floor and look out onto california street and the intersection - no idea why this is labeled as a dive bar, i guess it can be considered divey for nob hill?", "author": "Lisa M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-09-05", "description": "This is a great place to relax and have a cocktail or five. I used to frequent it more often when I worked in the city but it is still a nice place to just chill with a Fernet and beer. The seating upstairs is nice for a group but usually I prefer to just sit at the bar. Don't go here expecting to much in the way of a social scene but depending on the mood your in that can be a good thing.", "author": "John M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-10-12", "description": "Pretty awesome smaller, dark and neon, with an older crowd that loves to watch sports on the flat screen TVs(any sport depending on the season).  My favorite place is the upstairs which is a great vantage point to watch folks walk about California, in and out of Cala Foods, and getting off and on the Trolly Cars.  Decently priced beers and cocktails, but the jukebox is kind of a rip off even though the song selection is huge.  Also, it's right next to Golden Horse Chinese food, which, in my opinion, is some of the best Chinese food I've had in a long time.  Good grub after you fill yourself full of booze.", "author": "Veronica S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-06-13", "description": "I kind of feel like it's not a good thing when they know your name at a bar because you frequent it so often. But oh well. I stop by here after I get off work late at night probably way more than is necessary. The bartender is the sweetest, she knows exactly I want every time, sometimes even better than I do. \"Looks like a hard night, girl. A shot for you.\" Who am I to deny a shot, even if it comes on the pretense that I look ridiculously tired/like crap. Anyway, thankfully no one thinks its weird that I like to come and drink by myself....but I never end the night by myself (no, not like that). I've met some really awesome people here, everyone wants to strike up a conversation, and there's a general laid-back and friendly vibe.. Cash only, remember that. Bring your drink upstairs and look out over California street, you won't be disappointed.", "author": "Jenna W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-08-07", "description": "Not much more that I can really add that hasn't been said before but I'll re-emphasize that this place rocks.  Though some might consider it a dive bar, it's definitely on the upper echelon as opposed to dive bars in the Mission.  Perhaps it's cuz it's in Nob Hill . . . Anyhow, the HydeOut is a great place to come in, grab a beer/cocktail, and chill.  On a Friday or Saturday night, it might get a little louder and rowdier but it's still pretty low key.  The new jukebox also lets you find some random tunes to rock out to.  The bartenders are some good-looking ladies and provide great service.  Soon enough, even if you don't come in all that often, they'll know you by name and drink.  Drinks are moderately priced and made stiff.  Only thing to this place is it is CASH ONLY, with of course the conveniently placed ATM inside in case you need more moola.", "author": "George J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-07-18", "description": "This is a non-sceney place to spend a sunny afternoon. Sit in the upstairs area and spend endless entertaining hours watching really bad drivers have near-misses with pedestrians and cable car riders at the intersection of California and Hyde. With the free wi-fi they provide, you can blog about it while enjoying your beer.", "author": "Michelle J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-04-10", "description": "so the bf took me here.. me a native, and him not at all...  said he did a job around the area..  was so sure we've been there before.. i told his ass to get his girls straight.  he said it must've been his 'co-woker' he was with.  sure.  way to make a girl feel special. \n\nanyways...  so he ordered a bloody mary, and i had scotch.  i like the little treats that come w/bloody mary's and was picking off his... this is where i noticed that there were green bumps on his pickled asparagus.  i mean the bumps were textured and shit.  we told the bartender, who you could tell has been here in the US for a while but definitely not a native, and she looked at the jar from where it came from and told us they all looked like that.  then she proceeded to tell the men sitting at the bar that they all looked like that, and that it was a new bottle just opened so it should be fine. trying to get their opinions to back her up.  those drunk ass fools didn't know a damn mold if they saw one...  they were there on a random monday hammered out of their mind and it was mid afternoon.  needless to say, the bf just put the asparagus off to the side.\n\ni like the  bar though.  it's a cool dive.  haven't been there at night.. i'm sure it gets packed.  not too much room in there either.  i like the upstairs.. you can grab a table and look out onto the street.", "author": "Sheri N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-09-04", "description": "The Hyde Out is my favorite bar in my neighborhood. The name is perfectly descriptive: it's a quiet oasis in a relatively crowded and noisy scene *cough* Hemlock Tavern *cough*. Come here to get an inexpensive drink served up by the sweet bartender, pick out a song on the jukebox and head upstairs to chat away an evening while taking in the view -- usually some guy sitting in front of Cala Foods trying to eat his shoe, or something, but it's much better than trying to drink while crammed into some hipster's armpit.", "author": "Kate R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-06-12", "description": "questionable.  i was expecting it to be a lot more fun.  it's smaller then it looks from the outside.  the bartender was friendly.  but i wouldn't put this on my list of bars to frequent.  \n\nCASH ONLY.  negative points.", "author": "jessie h."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-10-27", "description": "Very unpretentious and typical dive bar. Juke box is surprisingly good. Grab a table upstairs and watch the people, cars and trolleys narrowly miss each other. With a beer or drink in one hand, what more could you ask for?", "author": "The Sock S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-06-17", "description": "I love this place. There are always old men at the bar, which is awesome when you just wanna hang with the girls. I've never gone in and not had a great time hanging out with the regulars and the bartenders. There are usually enough young people to at least feel like you can chat with someone born in the same decade, but it's not a huge sleaze fest. My favorite thing is that you can stay downstairs with all the regs and the bartender, or you can head upstairs for a more open space when you're with a group. Both are great.", "author": "Monika M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-06-08", "description": "I always have a good time here, during the day or at night.\n\nThis is a great all around bar. Cozy and chill enough to hang out after work; lively enough to stay out at on a Friday night; and a central location to meet up at early before heading south or west. It's usually a good mix of friendly locals and people from other neighborhoods looking to hang out and chill or maybe get a little crazy.\n\nThe bartenders are good looking, friendly, and make tasty drinks at neighborhood bar prices (try the \"Space Pussy\"). Again, the bartenders here always fun!\n\nThey have an Internet jukebox to play your favorite jams and a huge flat screen TV to watch sports. The building is on a corner, with an upstairs and downstairs filled with windows = great for people watching.\n\nThe Polk, Van Ness, and California buses drop off within blocks. It's easy to catch a cab to and from. \n\n*Don't park in the supermarket lot across the street, they'll tow you.", "author": "Neb N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-06-24", "description": "This is Nob Hill's best kept secret. We used this bar to get off the scene and just have a nice comfortable drink. The jukebox is not bad either, and is readily available, which makes for a great jukebox war session. Hide upstairs, if you've got a group and would like a little space for dominos, or whatever it is you and your crew like to do. Or you can stay downstairs, and talk to it's neighborhood regs who don't mind friendly conversation.", "author": "M S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-02-17", "description": "Good bar.  Fun people.  Nice upstairs.", "author": "The P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2005-04-22", "description": "cool bar. the loft is a sweet place to sit and drink and people watch--on the street and in the bar. good place to chill with friends without screaming your lungs out.", "author": "Dean E."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-02-21", "description": "This is a great place for a beer, or a pitcher (albeit small ones), which they do have and a lot of different kinds of beer.  The bartenders are nice and accomodating but they don't take credit card.  Supposedly, this is currently being rectified.", "author": "Brooks O."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-10-10", "description": "i really wanted to like this bar since its around the block from my house and it kills time while im waiting for my laundry, but the hyde out  has one big problem, and one other problem:\ndid i just pay $4 for a domestic beer? thats pretty unamerican. i dont even get to keep the bottle? thats fine, i guess ill just drink here when i get paid. no big deal . a bar like this is just like any other bar, it has its regulars, and most the time the regulars at any bar seem to be pretty cool, and thats where this place differs. there's a heavy-set slug  that drinks here , and 9 out of 10 times ive been here cant keep her eyes off of me. i stopped by here the other day to grab a quick drink while i was waiting on my food, stepped up to the bar and tried to order a drink, meanwhile,  bertha (thats what i imagine your name to be) comes out of the bathroom, (probably just got done destroying it) comes back and sits down right next to where im standing , and puts her fat hotdog fingered hand on the stool next to her, as if im going to sit there. stop looking at me like a criminal, its not cool, you are this bars \"party foul\".", "author": "Greasy w."}
