{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-31", "description": "The grilled chicken is fantastic! I don't know what they do to the chicken skin! It is perfectly crispy and seasoned. The meat itself is tender and juicy. Finger lickin' good!\n\nI had half the chicken for lunch along with the caprese (which in itself was quite good. It wasn't the best caprese I have ever had, but it was good)\n\nVery reasonably priced too! For a restaurant in North Beach, San Francisco!", "author": "Shailesh P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-12", "description": "I pass by this place a million times but never went inside despite rave reviews because to me chicken is chicken. Boy was I proven wrong, earthlings!\n\nThis chicken is tasty because it's grilled yet still has moisture retention all the while the skin has been grilled to a crunchy perfection. The flavor itself wasn't anything special, literally it just tastes like white meat chicken with maybe some Italian seasoning but the execution of it was perfect.\n\nI haven't tried anything else here except the BBQ sauce which was average. I actually only got take out here so haven't experienced the actually waiting on portion but I can tell you when I arrived the girls working there weren't super friendly. They literally pointed for me to sit down while I wait for my to-go bag and that was it. Not super personable or anything and they were mumbling when I asked when my food would be ready. The customer service could use some improvement and it doesn't matter if it's dine in or take out in my opinion.", "author": "Connie M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-09-11", "description": "This place used to be good before it become mainstream \nThe servers (Adele) from Romania \nChenzia the Italian \nAre way to bad when it comes to ho to handle your customers \nJust very tight leggings showing what they got to get more tips \nAnother think if you're not a blond haired white dude expect the service to be down \nChenzia was on break lol as soon as she saw the money at the table she cane over all the way to the table asking me if I need my change while my bill was 28 $ and there was 40 $ on the table \nShe was like do you need your change !!!!\nLol all they see is the money \nI use to love this place \nBut won't be back till they fix the greed on those girls  and now harassments are started just discovered some private messages from those girls", "author": "Farid F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-18", "description": "I have passed this place for many years and never stopped for a meal.  Based on Michael Bauer's article in the Chronicle earlier this year, we decided to stop in while at the North Beach Festival.  What a great find!  We ordered: \n-  Soup of the day - it was OK but have had better elsewhere\n-  Small salad (which was not small but a good portion to split)  The lettuce was fresh and it had cucumbers and tomatoes.\n-  We split the 1/2 chicken with a side of fries (the special comes with one side).  This was the star of the meal.....the chicken was so flavorful and moist.  Hubby and I typically don't finish 1/2 chicken but this was so great tasting that we licked the bones!  $16.50\n-   We ordered a bottle of white wine which was maybe $22 and went well with our chicken on  a nice Saturday afternoon.\n\nThe place is very small - about 25 or so seats.  Our server was so polite and very efficient.   I saw large plates of chicken piled up at the next table - you can just order a whole chicken without sides too.  If you  in a want delicious chicken in a casual atmosphere and it wont cost you an arm and a leg, try this place that has been around for years in North Beach.", "author": "Ginger O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-26", "description": "Went here based on a recent article in the SF Chronicle or was it the Examiner??? \n\nAnyways...the chicken here is FIRE!!! So so well done if you are fan of Chicken. The chicken was around $12 I believe , call ahead if you're in a rush and pick it up to go.  The article noted that they have to re-paint the interior because of the amount of chicken they grill and you can tell as the  sheet rock above the grill is out of commission shall we say. \n\nGreat spot in North beach..you have to check it out.", "author": "Rod M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-28", "description": "I pass Il Pollaio every day on my commute, and it always had happy people inside, so my boyfriend and I made it a point to stop in. It's not the most spacious inside, but you're not there for ambiance - you're there for the prices and the delicious food.\n\nMy boyfriend got half the roast chicken and a caprese salad, and I got the lamb chops and fries. I would skip the caprese, but the roast chicken...soft, flavorful, crisp skin - if you're into chicken, this chicken was pretty amazing. The lamp chops - holy big portions moly. Delicious, but I couldn't finish the portion. The fries were more potato wedge than fries but they came out piping hot.\n\nTheir chicken is so reasonably priced that it's hard to justify eating anything else, but I can't wait to try everything on their menu.", "author": "Christina S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-24", "description": "I ordered the half grilled chicken combo with salad, which came out to $18 including tax. My choice in salad was the combination which consisted of beans, radish, tomato, cucumber, lettuce, and your choice of dressing. The grilled chicken was delicious! Seasoned well and tender. Wait til you try the little wing...yassss girrrl... soo flavorful!", "author": "Mary R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-11", "description": "Il Pollaio is my neighborhood roti chicken joint. You can't go wrong with their grilled bird over mesquite accompanied by their wedge cut fries. Decent prices for SF and just as importantly the food is solid. Fresh and made to order I've never had any issues after a dozen plus visits and hope they're able to stand the test of time in North Beach which is no easy task these days.", "author": "Mitchell M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-09", "description": "Buon gigs tutti bene? Love this place   The food is excellent especially for the price   The service is fantastic!! Best service I have ever reviewed  !! These people deserve your business! So many restaurants closing   Please go here! We r vacationers", "author": "Jane W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-24", "description": "I'm a new fan of Il Pollaio chicken. After ordering their half grilled chicken over a span of a few months, I'm convinced that this is one of the better prepared chickens in San Francisco. I've had a few others that I love, but this is one that I return to time and time again. \n\nOne of the best features of deliciously cooked chicken is the skin. At Il Pollaio, the skin is perfectly blistered on the grill and slightly crisp. The inner part is still moist. So good. \n\nPrices are fairly cheap. Parking is a pain. Metered only.", "author": "Ann S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-16", "description": "Excellent all around.  Delicious chicken!  Salad combo- order the small salad as it is more than enough.  Get to know Paula and the locals- awesome people!!!!   I'd go again any day.  What a find!!!", "author": "D M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-05", "description": "This place is unbelievable good! The chicken is ridiculously tasty and the ribeye is a second favorite! Staff is always super nice and quick. Such a great and affordable find in North Beach", "author": "Anjoleen S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-12", "description": "This place may just have the best lamb chops for the money!! \n\nWe ended up here for dinner after venturing out in the city with some friends. It's this tiny place  in North Beach area and it's the very definition of hole in the wall. Tiny restaurant with less than 10 tables, counter and kitchen in the back. \n\nWe were seated right away as soon as we walked in. Our server was friendly and entertained some questions from our party. This was my second visit and I remembered their very yummy and affordable lamb chops. So guess what, I opted for it again! And it was just like the first time! (hmm, that sounds like a song?) Anyways, an order comes with 2 lamb chops and couple of boiled potatoes (traditional side). They have a spicy salsa-ish sauce that goes really well with the lamb flavor. I am picky with my lamb. I tend to shy away from strong gamey flavor of lamb if not done properly however, that was not the case here. It was just perfect!\n\nThey also give you a basket of bread with some balsamic, olive oil and parmesan cheese. You can never go wrong with those ingredients!\n\nIl Pollaio holds a special place in my DH's heart. He used to frequent this establishment during his college years and everytime we're in town, we try to always squeeze in a meal from here. \n\nDefinitely recommend this place! Two thumps up for Il Pollaio!!", "author": "Patricia A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-01", "description": "I love this place. It's simple, tasty and is essentially the best Italian comfort food north beach offers. Soup? On point. Sausage? On point! Chicken? Please let's not play. Everything is simple and solid, old school classic but well done and very enjoyable. Viva il pollaio!", "author": "Stefania P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-29", "description": "$25 for a perfectly grilled ribeye! Juicy, flavorful, charred nicely on the outside and very satisfying. Very nice staff! Half rabbit was not gamey, tasted like pork to me. We will come back once in a while!", "author": "DANIEL T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-24", "description": "What an outstanding find. We visited here for an early dinner in early 12/2017. It's unassuming from the outside, and the dining space is on the small side. However, the service was great, and the food outstanding and very reasonably priced. We ordered the half chicken and large combination salad. Bread was included, and what more could one need? The salad was huge and fresh, with Italian dressing on the side. The chicken was moist, perfectly seasoned, and delicious. A simple meal done really well. Would go back if we visit the SF bay area again.", "author": "F S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-17", "description": "Get the half chicken with fries or a salad!! Amazing  The service is great as well. I would defiantly recommend this place. I go there at least once a week and never get tired of it.", "author": "Anas R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-15", "description": "The best Italian chicken in San Francisco. Easy and simple, cheap and good. If you like rabbit they have it too, almost everyday. \nMy favorite is the half chicken, potatoes, and red wine.", "author": "Florentin H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-30", "description": "Delicious food. Simple menu - one of those places that do what they do best: grilled chicken. Hole in the wall, great bang for your buck. Highly recommend!\n\nTheir steamed potatoes are delicious as well.", "author": "Sue C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-24", "description": "Best rostisserie style chicken in sf. The flavors go deep in the meat which does not happen in most of the places. The outer crunch is perfect.", "author": "Ash M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-04", "description": "I've been eating mostly vegetarian lately, but then I was out with my roommate and had the chicken here... Let's just say I left with a mild obsession.\nI just now just had it for the second time. And honestly, I'm not huge on superlatives, this might be some of the best chicken I've ever had.\n\nIt's like the juiciest chicken you can imagine, perfectly charred on the edges, served with slices of lemon to spray on which makes it all fresh. I love it.\n\nOther than that the concept is pretty simple, they do chicken well, the place itself is kinda meh, and their sides aren't too exciting; fries were pretty average, tomato and onion salad was good but for $7.50 I'd expect more than like half a tomato, and coleslaw on the other hand was huge but a bit on the heavy side for my taste.\n\nI haven't even had any other of the dishes because I feel like it doesn't really matter. \nIt's like I've always been saying: \"When in Rome, get the chicken\".", "author": "Mattis E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-30", "description": "Cute place. We got the half chicken, pan seared zucchini, and the half rabbit. Half chicken is bomb. The skin is so crispy and delicious, and the drumstick especially is so tender and juicy. Zucchinis were also ridiculously juicy and pretty yummy. There was a misunderstanding with the waiter and we didn't get our rabbit order in, but when we asked they were very kind and they gave us a complimentary marinated eggplant appetizer as compensation. Which was delicious by the way, nice and garlicky and vinegary. Rabbit was interesting, some parts were really gamey, other parts were almost like normal domesticated meat. I don't think I can say I was a fan of the gamey parts, but I really enjoyed the less gamey parts. The steamed potatoes were also very delicious, soft and mildly flavored which really complements the rabbit. I think this is a nice place, I'd come back if I were back in the area", "author": "Michelle Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-10", "description": "Just get here and order the chicken, you can thank me later. Best grilled chicken I've ever had. It's not fancy, the wine wasn't great, but this is the best $18 you'll spend all week. I ate a half bird ($11) but honestly I could have done a full one it was so good. Follow this up with a house cappuccino from Tosca down the street and you have a winning night right there.", "author": "Smiley S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-24", "description": "This review will be quick \" they know how to cook chicken ( again Latin style) it's El pollo loco on steroids", "author": "Sean K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-23", "description": "What this place does really well is crispy chicken skin. That requires technique. Take it home. After 2 hours it's still crispy. It's not fried just grilled unlike some much fancier places in SF who finish their \"rotisserie\" chicken doing that. Love old school places like this. Unpretentious and delicious. May they be around for another 50 years!", "author": "Joe V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-09", "description": "Aw love this place. My lamb chops were perfect. Decent and cheap house wines! Family place. Quick and no frill no pretension. This place is an endangered species in a sea of pretension and tackiness.", "author": "Xiu L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-04-28", "description": "Maybe we didn't order chicken so we found the food to be average. The staff was friendly and the place is in a good location.", "author": "Yoshikage K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-03-15", "description": "The smell of this spot was intoxicating and it was a full house when we arrived late on a weekday night.  My chicken (namesake of the restaurant) had a nice outside, but it was dry - ick.  The bf got the pork chop and it came with this delicious sauce - he won in the ordering competition that night.  With so many restaurants in the area and a better pork chop not too far at don pisto's, we probably won't be back.", "author": "starrynight c."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-13", "description": "I have been coming here since the early 90s the only thing that has changed is the price..quality is the same excellent and I haven't seen the owner but a great place.", "author": "Cindy S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-09-22", "description": "Great customer service and chicken was juicy and tender with nice crispy skin. However, not much of any special flavor/marinade, taste just like grilled chicken unlike el pollo loco where it has a good lemon marinade flavor. Chicken has black charred parts too which can't be good for health. Maybe they should clean the grill more to avoid the black char. Overall not bad, will come back to try the rib eye and pork chop.", "author": "Judy T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-07", "description": "The char-broiled chicken is absolutely delicious here. Add the roasted peppers and delightful tomato onion salad and you have a perfect meal. I'm traveling in San Francisco and wanted a home style simple meal and this was a great fit. It's like you are dining in someone's home--very gracious server.", "author": "Susie K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-08", "description": "Great hidden gem in north beach if you want something other than Italian. Their chicken is grilled to perfection and reasonably priced. I've had the sausages as well which were also on point. Seating area is on the smaller side but I never have issues when I want to eat in.", "author": "John R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-06", "description": "This place is a little hole in the wall in North beach with some of the best grilled chicken in the city. Very affordable and they have a hand full of other things on the menu that are amazing as well. \nI'm a fan of the combination salad & French fires \nGreat lunch specials", "author": "John M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-31", "description": "So far I have been here twice and it gets better every time. \n\nThe food is great and the price is better. \n\nI always get the full chicken for $16.50 and a side of the boiled potatoes. Come to less than $25 and I get to keep the other half of the chicken to take home and eat for probably 2 more meals. \n\nI like it because all they do is season it with salt and pepper and some olive oil then grill it. \n\nGreat deal for take out too!!", "author": "Michael P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-09", "description": "This place is really awesome if you like that delicious charbroiled taste the chicken is fantastic and they give you an option if you want to order a half of chicken or whole I also had a combination salad which tasted so fresh if you want to eat something healthy in the North Beach This is definitely a great spot", "author": "Robert S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-05", "description": "Fan.freakin.tastic chicken! \n\nWe were so happy with our lunch here. The service was outstanding- attentive and friendly without hovering - and the food really hit the spot. \n\nThe meal comes with bread service that is really yummy, crisp crusted with chewy inside, authentic Italian style and served with cold butter. \n\nWe each had a lunch special: one with a half-chicken and one with 3 sausages.  They both come with your choice of a couple types of salad. We went for the green salad and it was just right - a good sized portion with thick wedges of tomato, cucumber and radish. Ranch dressing was yummy. \n\nThe half chicken was AMAZING - between the char and the seasoning the flavor was outstanding. It may have been the best chicken I've ever had. \n\nThe sausage was good, not spectacular but solidly good. That, and the prices being just a little bit high are the only thing keeping it from being a 5-star review. \n\nWe would definitely go back!", "author": "Angela Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-02", "description": "The chicken at Il Pllaio is pretty absurdly good. And when you're in the mood for good roasted chicken, it seriously hits the sweet spot. It's really a place to get down to the basics. The menu is short and to the point. Half or whole birds, salads (I hear the combo is good), some other meat mains, spicy sausage, and sides that include tasty looking steamed potatoes and other carbolicious things. \n\nI came here expressly for the chicken, and the chicken I got. A whole bird, \"small' salad (which is actually pretty big) and a small San Pellegrino all added up to about $25. For one person, it was a large meal. I was damn hungry though, so it was juuuuust perfect. I can see how a couple could split a whole bird (birds run on the smaller side), a larger salad, and maybe soup, and have a plenty filling meal. They also bring bread with the grub. For this price, in North Beach (or anywhere in the city) you can't get that kind of deal. \n\nI'm totally a fan. This style of food is right up my alley. And you can tell the place is bustling with regulars. Locals. \n\nLegit.", "author": "Don B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-28", "description": "A small hole in the wall restaurant in North Beach specializing in rotisserie chicken. This is honestly one of the best bang for your buck restaurants that you are going to find in the area. I got a huge plate of chicken and a sizable salad for 15 bucks, which is unheard of in the city. Just a heads up to get the salad dressing on the side, otherwise they will really loaf it up and dump it on hard! With that being said, I am definitely coming back!", "author": "Ross S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-05", "description": "Let me just start by saying, DELICIOUS JUICY CHICKEN. This place really hits the spot! I usually come in with a table of 4 and we order a whole chicken, already cut into pieces. Boiled potatoes over parsley and olive oil. Grilled onions, and the combo salad with Spicy/mild sausages. The spicy salsa is really good on top of the chicken. The food is just amazing and delish! Recommend if you are a group.", "author": "Liset O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-19", "description": "If you are in North Beach in San Francisco you owe it to yourself to try Il Pollaio on Columbus. Their specialty is chicken which is marinated for three days and cooked on the grill Argentinian style to perfection. Their menu has just a handful of items but all are excellent. The Italian sausages are also a favorite of mine. Get their mixed salad and/or the hand-cut fresh fries. Everything is fresh including their bread. This place has been around for over 35 years and that in itself is a testament of their success. And everyone that works there is just so nice and welcoming!", "author": "Sergio S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-10", "description": "Love this place. The menu is simple, the food is always delicious and the staff are wonderful.", "author": "Kelsey M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-12-22", "description": "Ah come on man, 4.5 stars? Really? \n\nI have been living in this area for several years now and have been to Il Pollaio multiple times. However, I only go there when I am lazy to cook at home and want to have food for a reasonable price. I never went there by being excited about it. \n\nI wish it was the kind of place where they give you this amazing Peruvian chicken but unfortunately, no. Not sure about tourist opinions, but the food is only mediocre for San Francisco standards.", "author": "Gokhan T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-17", "description": "One of these days you will be in North Beach looking for a solid meal at a solid price.  A meal where you aren't just loading carbs.  That is the time to think of Il Pollaio.  The service is warm and caring.  And the food isn't cheap; it's inexpensive.  There's a huge difference. \n\nThis past Saturday I got a half chicken ($10, can you believe it?).  When you order a main here they give you a break on soup ($5 for a bowl) and salad ($5 for your choice of salad).  Do the math.  I got out for twenty seven dollars including tax and tip.  \n\nHere's the rundown on the food:\n\nA bowl of split pea soup was what you want in a vegetable soup: It was thick and I could taste the peas.  The soup wasn't loaded with salt; just peas.\n\nI got the mixed salad with blue cheese dressing.  It was composed of fresh greens, tasty tomatoes, mixed beans, and cole slaw.  It was large, varied, and good.\n\nThe half chicken came last.  They charcoal grill the bird here and they do it well.  Seasoning is subtle but right on.  This is where you get loaded up on protein.\n\nThe butter is sweet, the bread is fresh, and they bring it without your having to ask.\n\nAs I walked down to City Lights Bookstore I felt like a king with a few extra bucks in his pocket.", "author": "David D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-12", "description": "Great food and great service. The chicken is deliciously moist and tender, and they don't go overboard on the spices. It's simple and amazing. Also, the pork chops they served were very tasty - it's hard to get pork just right without drying it out, but they do a good job here. \n\nOverall, definitely worth a try", "author": "Derrick W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-16", "description": "When I said I wish I could eat this chicken everyday the waitress said they're open everyday except Sunday, but I could get extra to go. I love this city!", "author": "Hope M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-19", "description": "From its outside look it doesn't feel like this is going to be great, but the food really is.  We almost went the day before, but we decided to go for seafood instead. When we passed by the front door, while deciding between chicken and seafood a customer leaving the place told us we should really try it out. So we did the next day. We got a whole chicken with great flavor (if you are used to the size of the rotisserie chicken at Costco this will feel a little on the small side). We also had salad with Caesar dressing and an order of French fries.  All good.  Cannot go wrong with that", "author": "Jc M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-13", "description": "Totally worth it. \nI had half a chicken with fries to go. The chicken was tender and delicious. The fries were also above average. The staff was really friendly and the service was quick.", "author": "Itamar S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-11-27", "description": "This place is kind of overrated...chicken is alright, the sausages were eh, the fries were good, the combo was was ok. It's kind of just mediocre...it didn't wow me like I thought it would...", "author": "Kylie L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-10", "description": "If you're looking for chicken, this is your place. They  make their chicken in South American fashion, full chickens split open and grilled flat with seasoning that makes even their chicken bones soft enough to be eaten! Not much for environment, but that rawness actually adds to its unique charm.", "author": "Naomi A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-18", "description": "WOW!!! This place was amazing!  My wife and I got off the Ferry boat at pier 39 and we just couldn't agree on any reasonably priced food. It was way too expensive. I didn't want to buy into that mediocre food of tourism.  So we decided to walk around and ended up at il Pollaio! They greeted us as we walked in and had a table ready as if we had reservations. Even though the place was packed from the moment we walked in to the moment we left.  The waitress was super courteous and tentative to us. \n\nSo! You must eat here before you leave San Francisco! Trust me you can see all my other posts, and I never give out 5 starts to any one!", "author": "Jose N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-01", "description": "Delicious chicken and fries lunch! My husband enjoyed the Italian sausage and fries lunch. We gotour food to go and had a lovely picnic in the park. The food was fresh, service quick, and the prices were more than fair. We will be back the next time we visit SF.", "author": "Michelle M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-29", "description": "I love this place. I've been going to it for the past couple of years since being in San Francisco and I enjoy it.", "author": "Joe B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-08", "description": "This spot is bomb diggity the chicken and potatoes is bomb diggity and can't wait to come back.", "author": "Haas M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-22", "description": "It's all about the chicken! Skip pretty much everything else, except maybe the combo salad which is a pretty good accompaniment for the chicken. But it's aaaaallllll about that chicken! It's fantastic.", "author": "Erin M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-28", "description": "Il Pollaio serves simple, home style fare the same way they have since the beginning of time. This place is like your favorite pair of old jeans, You wouldn't wear them to the club, but come Sunday you wouldn't dream of anything else. Why change a good thing?\n\nTHE VIBE:\n\nGreasy spoon meets Cheers. Regulars coming in for weekly take out box, people joking with the servers. Not a upset person in the place. The decor on the walls is probably as old as the diners themselves, but it's comforting, not tired. Like hanging in your grandpa's basement.\n\nTHE FOOD:\n\nNo frill comfort food. We split a half chicken, caprese salad, minestrone soup and fries. The soup, fries and chicken were all standouts. These are the things I want to eat when I'm sick, lazy, or bored of everything else. I know they're going to be delicious, consistent, and approachable. Only complaint was the slabs of beefsteak tomato on the salad. Great tomatoes aren't hard to come by, and it would have been a world of difference.", "author": "Patrick T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-05", "description": "The very intoxicating scent of roasted chicken hits you as soon as you walk in.  Drool.  \n\nThe chicken here is the house specialty.  It is absolutely tasty & succulent.  Tender & juicy on the inside.  Appropriately crisp on the outside.  Either a half or whole roasted chicken w salad equals a simple & perfect meal.\n\nI'm a skinny fry girl, but their steak fries rock.\n\nThe burger also rocks.  \n\nThere's rabbit & steak too.  And the prices?  11 bucks gets you a whole chicken, & a half is only 6 bucks & change.  So reasonable!  Refreshing, right?\n\nIt's a small family run business.  It gets crowded.  No reservations.  Patience!  Service is really friendly & efficient.  They've got this whole quick service family restaurant thing down.  And there's always the option of ordering for take-out. \n\nIt's no frills, which is what you want sometimes...am I right?\n\nA north beach mainstay for decades.  Never disappoints.\n\n4 stars.", "author": "Veronica M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-13", "description": "- Atmosphere was clean, not too loud\n- Chicken is pretty good, not the best I've ever had \n- Onions were excellent\n- service was mediocre and rather slow\n\nOverall not a terrible choice but there are a lot of better options in SF... I wouldn't go back.", "author": "Greg S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-15", "description": "Roasted chicken as it should be done! No razzle dazzle, no heavy sauces to cover the imperfections, nothing! You have a few sides to choose from with the half-chicken special. If you are hungry, the steamed potatoes are very good, otherwise go with the salad. The soups are good too. I really like their minestrone and lentil soups, but the others ones I have tried aren't bad either. They sell Peroni if you like Italian beer, but they have a few other brands too. Their wine selection is small, but not bad at all.\n\nThe burgers are good and they make good fries, so it is not only all about chicken.  I have tried their pork and lamb chops too; all good. \n\nThe staff is nice and friendly, and they only get friendlier as they get to know you over time.\n\nFor dessert, flan every time! \n\nOne of the best deals still left in North Beach!", "author": "Afshin A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-08", "description": "This place is pretty awesome.  I had often seen it from the bus, and finally had an opportunity to eat there when my sister came to visit.  Their signature roast chicken is really good and the price sure is right.  The wine wasn't very good, but it was a $20 bottle of wine in a legitimate restaurant.  So, if you look at it that way, maybe it was the best $20 bottle of wine in San Francisco!  \n\nIf the name was easier to pronounce and remember, I would recommend it to more people.", "author": "Jennifer M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-07", "description": "Super crispy chicken skin and juicy chicken inside. Hard to beat although sometimes the white meat is overcooked.", "author": "Abby P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-14", "description": "My favorite grill chicken  ordered a whole chicken for and a bowl of pea soup enough for two and left over for tmr, will be back again!!!", "author": "Xaviere K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-02-22", "description": "Perhaps the food quality goes up and down based on the day but on a Wednesday at 6PM the chicken was dry.  The cook cutting it up to serve it should know and see this but yet served it.  The frozen fries are not bad but they are frozen not fresh.  A friend of mine in the hood raved about this place so after a couple years of resisting I've tried it out.  \n\nThe price $15 isn't bad for SF.  However the fact that they specialize in chicken and the chicken is drier then the Sahara tells me they've forgotten their roots. \n\nPerhaps the higher stars are deserved.  Places have good and bad nights but in the case off my disaster it was a dinner rush hour night serving perhaps lunch leftovers.", "author": "Marc Lee R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-01", "description": "You just can't escape the aromas! We turned around to go back, following our nose! Boiled potatoes A MUST HAVE! Rib eye excellent! Thin but cooked perfectly!", "author": "Julia W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-10-29", "description": "First of all the prices here are just amazing! you get super full for a low bill. \n\nThe chicken is good, not great but good. It's well cooked, but I just wish it was better seasoned. It kinda taste blend. Their boiled potatoes with parsley and olive oil is delicious! Their hot sauce is great! really tasty. \n\nNot the greatest grilled chicken but a good one nonetheless.", "author": "Tamara S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-12", "description": "Our first day in San Francisco and we were invited here by our hosts for lunch. I  noticed they had rabbit on the menu and suggested this to my friends as an an interesting alternative to the usual meat and poultry dishes. The cooked rabbit was delicious, but a little tough to cut.Otherwise, very tasty. \n\nThe restaurant is situated on the border between Little Italy and China Town in San Francisco.", "author": "Neil H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-01", "description": "Il Pollaio is a North Beach institution, and unlike many of the other restaurants in the area, they have tons of regular local customers, like myself. The chicken is obviously the primary attraction. It's always super tasty, with a nice crisp skin, and pairs very well with the combination salad. \n\nUsually, I just get a half chicken with a combo salad, but when I'm really hungry, I'll also get the Italian Sausages and Fries on the side. Delicious!", "author": "Allen T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-20", "description": "No doubt best kept SFO secret for folks who like to dine solo; we've all had one of those days. Roasted 1/2 chicken, salad/vege, side of steak fries. Sleep easy my friend.", "author": "Adam C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-06-19", "description": "I've been having a hankering for roast chicken since I started moving down the path of a plant-based diet. Oh, I still eat chicken in a salad, but it's usually cold and in chunks, not recognizable as a hefty, succulent bird with thighs, legs and a breast. I was starting to feel like Henery Hawk, the tiny, brown chicken hawk with the Hoboken accent, who fantasized about capturing and eating a chicken in those old Bugs Bunny cartoons. Jamie W. and I passed by Il Pollaio when we were strolling through North Beach, and I put it in my memory bank to return when we were feeling slightly more calorific on a Saturday.\n\nSure enough, that feeling came over us this past Saturday just as the North Beach Festival was winding down, and the beer guzzlers wearing their wife-beaters were having trouble staying erect for their top-heavy girlfriends. We managed to work our way through the still-crowded area to find a tiny table for two just waiting for us in the middle of a very compact eatery on Columbus. The menu is straightforward, nothing fancy, just the kind of food you would expect at an \"All You Can Eat\" cafeteria line. I was immediately drawn to the Daily Special section where lo and behold, there is a $12.25 Half Chicken with Salad option.\n\nEven though Jamie almost ordered the fries, he decided to be brave and keep with the salad. Good boy. But first, I thought it would be nice to have the $6 side of Marinated Eggplant as an appetizer, and it was. I was actually surprised they sliced a Chinese eggplant, but it was just plain tasty saturated with extra virgin olive oil (see photo). Then came the salads. We wisely ordered the Combination which was an embarrassment of peasant-style riches - a mixed salad with radishes, cucumbers and tomatoes; a cole slaw made of red cabbage; and a two-bean mix of garbanzos and kidneys.\n\nIt was all lightly doused with an honest-to-God \"Italian\" dressing of oil, vinegar and seasoning (see photo). Loved it. But clearly we were waiting for the crescendo of the meal, the grilled chicken, and it didn't disappoint. Nicely charred with the skin nice and crispy (see photo). The breast meat was unbelievably moist, and I still dipped it into the residue of the dressing in the salad plate. Probably because I hadn't had a chicken leg or wing in over three months, I just kept gnawing it to a nub. Bottom line is that it was everything I wanted the meal to be and just $12.25. C'mon, that's a deal.\n\nFOOD - 5 stars...truly good frickin' chicken better than the other Good Frickin' Chicken\nAMBIANCE - 3.5 stars...just a fairly nondescript dive on Columbus\nSERVICE - 5 stars...she took care of us and never made us feel like she was too busy\nTOTAL - 5 stars...nothing like a flexitarian diet to make you appreciate a succulent piece of grilled chicken", "author": "Ed U."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-23", "description": "Chicken. If you like chicken, go here. Don't think. Just go and try the chicken. Incredible. I went here a few times last week and just when I wanted to try something else, I ended up ordering the half chicken with a salad. You will not be disappointed.  Quick, consistent, and amazingly delicious food. I will be here at least once, if not then twice a month here. You'll enjoy it.", "author": "Zack K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-27", "description": "Great place to eat, reasonably priced . The service is fast and friendly. I will highly recommend it for lunch or dinner while strolling through North Beach.", "author": "Miki H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-19", "description": "One of my favorite places ever!!! Grew up going here and sad that I don't live in the neighborhood anymore.  If I did I would always be there. Love the chicken! So yummy and fresh. Comes with fries. The burger is also great. Love getting the combo salad.  Definitely a great spot to visit if you are in the washington square park area", "author": "Michelle J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-14", "description": "this place is an institution! they do simple food impeccably. the chicken, potatoes, and marinated eggplant are to die for. service is efficient and friendly. this place is no frill, down home, great cooking.", "author": "Jane R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-02", "description": "Noise Level; I heard NOTHING while I was having the chicken, so i am Not Sure\nGood for Kids  Yes   \nPrice Range; Price per person: I think it's Cheap for the Great Grilled Chicken!\nBike Parking; i don't know\nAttire  Casual    \nGood for Groups  Yes    \nGood For  Brunch    Lunch    Dinner   \nAmbience;  Divey? Yes,   Hipster? they are not welcome here,    Casual? yes,   Touristy? of course!    Trendy? not really.    Intimate? may be,    Romantic? yes,   Classy? yes,    Upscale? no.\n\nI was here with my family, for my birthday dinner.\n3 whole chicken for 5 of us.\nWE DIDN'T TALK WHILE WE WERE EATING.\nGreat Grilled Chicken, Great house red wine, Great service.\nI love everything about here, especially such a simple Low-Key atmosphere.\nI can not believe that my last visit here was 7 years ago.\nI should come here more often.", "author": "Nobu K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-04-11", "description": "I had a pleasantly average experience here. The chicken was pretty good, but I guess I was expecting better given the rave reviews.  You can't beat the prices though for San Francisco. Under $25 for a half chicken, large salad (but very vanilla), bread and a glass of wine is definitely not a per diem buster.\n\nThere was definitely a consistent flow of local takeout customers, so maybe I was missing something.\n\nThe service was friendly and quick.\n\nI would consider going back if I was looking for a decent meal and wanted to save my money for drinks.", "author": "Brian P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-09-02", "description": "Thought the chicken was rather dry. In fairness, I came at a random time (2:30pm) so they probably weren't serving their fresh batch. Or maybe I was expecting more juices and flavor that I normally get from a rotisserie chicken instead of a grilled/charbroil chicken. The steam potatoes again lacked much flavor. Overall not bad but definitely a little disappointed after reading all the rave reviews.", "author": "Tinou B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-18", "description": "What more can you ask for? $10 for a half of amazing roasted chicken with lemon and rosemary? Love this place!! Perfect for a quick and healthy take out meal :)", "author": "Brittany G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-07", "description": "The best Chicken on the west coast...my wife and I drive from Stockton just to eat lunch there!!!!!", "author": "Mi S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-27", "description": "The gem of North Beach! Hands down the best chicken in SF. Great salads, steamed potatoes and grilled onions as sides. All the North Beach locals come here and it has a Cheers like atmosphere. Overall a great experience every time I'm here.", "author": "Phillip F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-30", "description": "The positive reviews here are well deserved.\n\nThe humble chicken, perfectly seasoned and char-grilled.  Moist, flavorful with that delicious charred edges.\n\nWasn't too hungry but couldn't resist a take out.  Ordered a whole chicken and couple of hot Italian sausage.  Sausage was good too but nothing to rave about.\n\nWe expected to eat half and save the rest for later but it was so good that there was nothing to save.\n\nAs another review mentioned, the complimentary bread wasn't that great.  Maybe dry it out and repurpose for stuffing or croutons.\n\nFor the size of this restaurant, well staffed, friendly and efficient.", "author": "David P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-08", "description": "Tasty grilled meats (including rabbit) in the neighborhood with fresh salad. Always nice to come here to grab a chill, simple dinner with friends.", "author": "May W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-09", "description": "My favorite neighborhood grilled chicken - FAR SUPERIOR to those grocery and big box chicken deals. And the staff are super nice and efficient.", "author": "Suzanne B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-02", "description": "Excellent place for meet lovers! Service was great, the waitress was very friendly and patient and even offered us a second portion of bread. Enjoyed my experience and the food here!", "author": "Darren C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-14", "description": "In our office, when people ask if we should get chicken, we don't have to say where, because it's automatic we're going to Il Pollaio. Half chicken, throw on some lemons, and a dousing of salsa. Super good. I kind of want it right now.\nNOM NOM NOM.", "author": "Jon C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-30", "description": "Split the whole chicken with lemon and boiled potatoes with my boyfriend, it was amazing!", "author": "Sam J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-08", "description": "What a gem! Straight forward, perfectly seasoned grilled meats and vegetables. Don't expect field greens with a perfect vinaigrette; this is not that kind of place. But house made sausage, grilled lamb cops, moist chicken, all grilled to perfection, accompanied by grilled vegetables such as eggplant.", "author": "Maia S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-12", "description": "Roasted chicken, potatoes & caprese salad. Quite a good deal, very tasty.", "author": "Anna B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-31", "description": "Super casual restaurant on Columbus with freaking delicious chicken. All the sides are solid as well.\n\nThe chicken -- for me that is the reason to come here. It is SO good. You walk into the restaurant and they always have 5+ halved chickens on the grill. They are perfectly seasoned and crispy on the outside and juicy on the inside. They got it down to a science. I love chicken - I am always tempted to order roast chicken any place I see it - and this is some of the best I have had in SF. \n\nThe sides are good too - my favorite are the grilled onions. Maybe a bit overpriced at $5 but they are really good. \n\nRandomly the free bread is pretty terrible here so I would just skip it. Save room for the real stuff!", "author": "Kerry M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-23", "description": "The Chicken...it's worth it. Good honest food in North Beach without the overly touristy feel.", "author": "Jovone W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-29", "description": "They keep it simple, but do it so well! Great, delicious chicken! (definitely add on the lemon!)\nWe did take out two nights in a row with a side of yummy steak fries!", "author": "Minh D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-06", "description": "Best chicken and service. Great family run restaurant. Welcoming fast fresh and a great price. I know people come for the chicken but the lamb is my personal favorite!", "author": "lisa R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-14", "description": "In this area, if you want a dinner for 2 out somewhere, you'll be hard pressed to find anything for $30 or under. It is full of touristy Italian places and expensive food. My boyfriend and I ate at Il Pollaio for under $30 AND we both had leftovers for lunch the next day. \n\nAbout the actual food: Simple, delicious, and homey. It was exactly what I needed for dinner after getting home from work. We ordered the half chicken & combination salad, and the hot sausage & side of potatoes with olive oil and parsley. \n\nThe chicken was tender, full of flavor and had the perfect amount of char/crispiness on the skin. The sausages were just the right level of spicy. The potatoes were uncomplicated and so satisfying. Even the side salad, which is usually lame, was a good portion and was packed full of yumminess. \n\nI also saw quite a few people picking up some orders - so if you're bothered by the casual ambience, you can definitely order for pick up. I'll definitely be dining in and ordering out a lot from now on!\n\nI can not emphasize how perfectly simple and amazingly delicious, comforting and satisfying it was. You are not paying for fancy decor or gimmicks. This is a perfect casual, no frills, REAL neighborhood restaurant.", "author": "Yishian Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-07", "description": "Best take out in North Beach. The half chicken / half salad is well worth $15. If you haven't tried this place you should change that asap. Quick and delicious. Very friendly staff as well!", "author": "Miles S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-07", "description": "This place has amazingly tasty chicken.  My favorite is getting the half chicken and grilled onions.  You cannot go wrong here and healthy options abound here.", "author": "Leland T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-05", "description": "Chicken is amazing, price is right, service is prompt and the servers are fun to joke around with.\n\nCan get a little smokey but vents quickly. For a great casual old time SF spot, go here!\n\nFavs:\nChicken\nSausage\nSteamed potatoes", "author": "E R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-14", "description": "Good food, great prices. Nothing fancy, just simple food well prepared. I had half a roast chicken, a tomato and mozzarella caprese salad and a bottle of San Pellegrino. I don't usually like white meat but this chicken was tender and juicy. The meal came with good bread and butter. I used the bread to soak up the remaining olive oil and balsamic from the caprese salad, yum. I ate it all up and licked my fingers. Oh, and my waitress was really sweet. I'll definitely be back.", "author": "P S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-04-29", "description": "OMG, this is the most amazing chicken ever. The meat is so tender and flavorful. The skin is super crispy and oh so juicy. It's amazing that a restaurant can be so good at one item that they can get away with just serving that and still do super well. Definitely get a whole chicken because you'll want more.\n\nWe also got the roasted peppers (good), the salad with everything (fresh tasting) and the fries (average). Everything else is just fillers for the chicken. It's all about the chicken here and it's definitely the best in the city!!", "author": "Alice W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-23", "description": "Incredible grilled meats and a wide variety of salads. Menu is simple and perfect.  Go hungry and check the daily specials. It's no frills with great service.", "author": "Michael S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-20", "description": "I had the good fortune to be introduced to Il Pollaio recently by a friend who was picking up take out. One look at and a sniff of the chicken she was getting and I did the same. This is beyond 5-star chicken~~~and picky doesn't begin to describe me, It's the level of goodness that you might travel to another country with this as the burning motivation! Great, tender, moist, flavorful and perfectly charred ~ chicken bliss. I can't wait to go back and try the grilled onions I've read great reviews of! And that soup looks delicious!", "author": "Barbara S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-30", "description": "This has got to be one of my favorite restaurants in North Beach. It's easily overshadowed by more well-known places like Mama's and Tony's Pizza, but if you're looking for more of a home-cooked or comfort-food meal, this place is it.\n\nTIPS\n- Order a whole chicken and ASK for their chimichurri sauce.\n- Tuesdays only - must get their split-pea soup. It's the best split-pea I've ever had.\n- Yes it's worth getting that extra order of fries.\n- But their combination salad is a good choice for days where you're feeling healthier :)\n\nFollow these tips and you'll leave with a happy stomach and a happy wallet!", "author": "Celia G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-28", "description": "I think I come here weekly! If I could only eat 7 meals (one for every day of the week) for the rest of my life il Pollaio would be on the list. Fresh, consistent, and healthy. I get the half chicken and mixed salad. Split pea and lentil soup is excellent too. DO IT NOW!", "author": "Alex M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-15", "description": "Plain, straightforward roasted herb chicken. Nice side salads. Great service. Clean. Not touristy. Fairly quiet. Not lots of seating but it's not the type of place you linger for a long time. I hope places like thus get support because your typical tourist may not enjoy this spartan yet charming, relaxing atmosphere. We ordered two half chickens, lentil soup(excellent) , red bean and garbanzo salad, tomato and onion, basil salad. The tomato was hothouse, disappointed about that. Portions were just enough for us. On street parking only so park in a garage for the day and plan on being in town for a while.", "author": "David M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-18", "description": "This is a San Francisco establishment that I hope never goes away.  We have been going here for a long time and their no frills meals are homey and tasty. The chicken or rabbit (to order, so if you don't' have a lot of time order the chicken) are incredibly good.  This last time we shared the chicken and the sausage with combo salads.  Just like I always remembered it.", "author": "Ed J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-04-22", "description": "When I was in 5th grade, El Pollo Loco gave me massive food poisoning, and immediately after that, the mere smell or mention of the name made me puke.  Just ask my aunt, who was forced to keep a barf bag in her car for fear of the times we happened to drive past one for the next month.  I spent the next 8 years (literally) hating on EPL.  Luckily, there were no El Pollo Locos near me after I moved to northern California, so it went off my mind.\n\nI'm sorry to say, El Pollo Loco chicken tastes better than the half chicken I had here at Il Pollaio.  This lacked substantial flavor and really just sort of tasted like g rease.  It wasn't very dry like what others are saying, but it wasn't like, OMG MOIST JUICY CHICKEN either.\n\nExpensive for a lunch spot, since it's JUST a chicken and doesn't come with anything else (fries are bland too, fyi).\n\nSmall place that IMO has just okay food but isn't worth a stop, given all the other delicious options in North Beach (or even Chinatown).\n\nThe good news is that I didn't throw up after eating here.", "author": "Tori S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-23", "description": "By far the best broiled chicken in San Francisco. Super delicious chicken. Good service. Great time", "author": "Laird Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-19", "description": "Best grilled chicken in town. I work and live blocks away from this place, and if I am ever in the mood for a good grilled chicken, I always end up here :) You really can't go wrong with this place.", "author": "Karla D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-01", "description": "If you like rotisserie chicken that is prepared well and tastes delicious, then go here. The venue is very simple, and I admit, made me skeptical as to how good the food could be but it certainly exceeded expectations. We ordered the whole chicken along with a salad. Both had a homemade taste to them and were very appetizing. The hot sauce is good too. And the servers are friendly too!", "author": "Gordon Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-27", "description": "Chicken, chicken, chicken, chicken, chicken.  \n\nThis place has 5 star, home-cooked-meal-style chicken.  Order a whole chicken and you won't be disappointed!\n\nIl Pollaio isn't a fancy shwancy place; it's just a very casual, cheaply-priced, hole-in-the-wall place that cooks their chicken to perfection.  \n\nWhere else can you can an amazing whole chicken for less than $15?  \n\nIn addition to the delectable chicken, their french fries are also really good.  This place only loses a star because I think their salads need some work.  \n\nNonetheless, if you want a fairly quick, casual, delicious place to eat with tender, flavorful chicken, check this place out!  \n\n\nI'd like to say it one more time....\n\n\"Chicken\".", "author": "Juliana K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-08-28", "description": "Nice take-out and (small, oddly-shaped) eat-in restaurant specializing in chicken. Apparently they sometimes have rabbit too, which I missed. Cooked on a flat-top grill and heavily-spiced with oregano n stuff, the half-chicken was juicy and really tasty. The fries were steak-cut and not that crisp by the time I got em home, but still quite edible. And the coleslaw was really crunchy - you apply the dressing your own self right before eating. It was very nice.\n\nThe wait-staff was friendly and you could watch the chef make your chicken. Decor was okay; nothing special. Overall, a fun place for a super-casual chicken dinner. I'ma come back soon and try the rabbit - if it's up to spec I may give this joint another star.", "author": "Paul M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-28", "description": "The french fries alone got me going like a big meal.  I could have left the hamburger in the frig for another day.  I couldn't help but stare at the chicken on the grill like I should have opted for that.  Since some of the raves is about the chicken chicken.", "author": "BanBan B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-03-01", "description": "I was highly unimpressed. We heard some good things and we decided to check it out. The first two times we went they were closed, but the third time surprised us when they were open. The chicken wasnt that good at all. The potatoes were a fail as well. I wouldn't recommend this place to anyone. Oh and they told us no outside drinks. I never like places like that. Like who r they to tell u what u can drink!", "author": "Taryne W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-01", "description": "I know everyone has had rotisserie chicken before but to eat it this fresh and this well made is how it needs to be tasted.  Extremely simple but incredible satisfying, similar to the chicken in simplicity the steamed potatoes were so good.  Their home made salsa tasted great on the chicken and they give you a side of bread.  Split a whole chicken and steamed potatoes with me and my brother for 25 + tax and tip, money well spent for the meal.", "author": "James F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-02-10", "description": "I have been eating at il Pollaio for almost 20 years. \nThe grilled chicken is delicious here, and I also enjoy the Rib Eye steak. \nSoups are excellent as well.  \nFood is also reasonably priced. \nThis is a no frills and no gimmicks place that is under the radar, which is different than all the hyped up places nowadays.  \nThe restaurant is also popular with locals although it is in heavy tourist area.", "author": "Marcus A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-22", "description": "Il Pollaio is mainly known for its grilled chicken, so that's what I ordered. I got the half chicken with fries. It was more than enough food for me and tasty. The fries were thick cut, crunchy on the outside and soft on the inside. The chicken had a flavorful seasoning and was very tender. No complaints, priced right and tasted good. I would consider buying a whole chicken to go in the future and using it in salads or other dishes. \n\nFor the full review with pictures, please visit:\nhttp://consumingcolumbus.blogspot.com/2013/03/il-pollaio-is-more-than-ok-aio.html", "author": "Elizabeth C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-30", "description": "Is it legal to marry chicken in California? I think I'm in love. \n\nI stopped by this place with a couple of buddies while on our way to Bimbo's. \n\nThe place smelled amazing. The scent of fresh lemon was everywhere. \nThere was a little bit of a wait for seating but I didn't mind because they had the Giants vs. D-backs game on and Tim Lincecum was pitching. \n\nBy the time we were seated, we still weren't sure on what to order so our waiter suggested we get a whole chicken, a combination salad and fries to share among the three of us. His proposition sounded good so we took his advice. \n\nWhile we waited for our orders, our server brought out some bread and butter. Next, the salad came out. I really appreciated that the server asked each of us what kind of dressing we would like so we could have the salad our own way. Halfway through our salad, the chicken was delivered. It looked modest but I knew it would be perfect. \n\nI could taste the lemon and pepper and chicken. Moist, tender, juicy, succulent chicken. OOOOOoooooooooooooooooh boy. I want to live forever in that moment when I took my first bite. The skin was crispy enough to not be greasy yet it gave way to accommodate various positions in my mouth. \n\nThe fries were just OK. \n\nThe whole meal, including two soft drinks, came out to $32 for the three of us and we were all fully satisfied. \n\nIl Pollaio chicken, will you be mine?", "author": "Daisy S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-26", "description": "Oh yeah.  I love this little hole in the wall.  Have been going there for years anytime I am in San Francisco.  The menu is small: chicken, rabbit, sausages or steak as well as salad and fries make us the most of it.  But man I have never had a bad meal here and it is cheap to boot.  Tell that inner voice urging you to order the salad to go away and order the fries instead (or as well).  They are always perfectly crispy and soft and hot on the inside.  Can't go wrong with the chicken here either or any anything else on the menu.", "author": "Curtis H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-02", "description": "I went there on Saturday. I've been coming here for 20 years, they have the best Italian bbq! It Continues to be a great place to eat- casual and worth the wait.", "author": "Dan F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-02-26", "description": "Yes the chicken is da bomb!  But my must have dish here is the half roast rabbit.  They make it like no where else.  It's not the wine sauce braised kind like you get everywhere else, it's like their chicken but rabbit.  They don't always have the rabbit so be sure to call ahead.  There was this one time I didn't call, drove all the way out from san jose, and left cause they didn't have the rabbit that day.\n\nI also love their fries.  They don't do anything special, but just thick cut the potato and fry it.  \n\nWhen Jose was still working daily, he use to spot me a special dish here and there.  The most memorable one is a roma tomato dish drizzle with olive oil and spice.  It's not on the menu, but you can request it.\n\nThey also have a egg plant dish (http://www.yelp.com/biz_photos/66khyY7kxNKiW6x7anZj9g?select=2-L5CI-JtvCNi8RDbfFtYQ) which I still haven't figured out how to make yet, but do get this, you won't regret it.\n\nI tried their pork chop and steak at one point when someone else ordered it.  These are really hit or miss as their stable food is the chicken and the rabbit.\n\nToo bad they don't open on sunday cause Jose the owner is catholic and sunday is the sabbath?  Parking can be a pain cause it's in the north beach area.  There are nights where the wait is extremely long due to the small size of the restaurant.  You can call ahead to make a reservation and they will tell you when it's not needed.  Party of 2-4 is perfect, anything more would be difficult to sit.\n\nI have brought people from all over the world to this place when they visit and they all love it!  Though most people would just order the chicken.  \n\nI have come here for my birthday dinner for many years because this is hands down my favorite restaurant in San Francisco.", "author": "Vito L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-18", "description": "Felt nothing but happiness after this! The chicken was grilled to perfection, the potatoes tasted amazing, and the lemon added a great flavor to the whole thing. It was my first time trying Argentinean food and I fell in love with it :)", "author": "Shahad K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-08-11", "description": "I came during lunch time on a Wednesday. This place is an institution and I know it has a lot of regulars. I witnessed that fact that afternoon. The waitress knew people's names and in general, their orders. She was not unfriendly, but businesslike. I ordered the half chicken and green salad combo with bleu cheese dressing on the side. My boyfriend tried the Italian sausage and ordered a side of fries. \n\nMy salad came out right away and the waitress brought out an extra plate so he and I could share, a nice touch. I don't usually eat salad dressing so the bleu cheese was for my boyfriend and he loved it because it was ultra creamy. Also, the lettuce in the salad was very good. Crispy and very nicely done. The half chicken came out several minutes later (various pieces of chicken: some breast, thy, a drumstick), followed by the Italian sausages. The fries took the longest, which I understand because they were freshly fried, but the fries were so good I wish they came out sooner so we could have enjoyed them with the rest of the meal earlier. \n\nMy chicken was okay. It was seasoned well and the skin was crispy, but I'm sorry to say I prefer the rotisserie chicken from Costco. The chicken wasn't dry from Il Pollaio, but it wasn't very moist either. My boyfriend's spicy Italian sausage was very good, but a bit overly salty, so he couldn't eat very much of it, knowing the salt would get him later. Thankfully sausage is something that reheats well so we were able to take it home. Like I mentioned, the fries were delicious!! Very crispy on the outside and uber fluffy on the inside.\n\nOverall, I don't think I would come here again unless I was in the area, but if I was in the area, I'd likely just get a slice of pizza from Tony's or Goldenboy. But that being said, it really is a pretty good option since this area is typically overpriced and touristy if you're in the mood for chicken.", "author": "Victoria J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-02-18", "description": "Oh so good! The chicken was tasty and charcoaled. Even loved the bbq sauce. Also - the split pea soup was super yum - thick and smoky. And the combo salad was fresh and simple. Small locals feel to the place. Loved it.", "author": "Andrew K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-31", "description": "Chicken here is consistently good. I ordered using the Caviar website. If you sign up using this link you'll get a $20 credit in your account https://bnc.lt/W9Qc/yH6pJdI0sv . Who doesn't like a free meal!", "author": "Shivam S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-10-01", "description": "This is a simple and unpretentious restaurant located in North Beach. The owners are from Argentina. The menu includes: grilled half/whole chicken, grilled half rabbit, steak, pork chop, lamb chop, sausages, side dishes: fries, cole slaw, green salad, etc. When I drop by, I usually order the half chicken or the half rabbit.\n\n- Nice service\n- Simple food preparation, nothing fancy\n- Affordable prices, 2 people can dine for ~$20", "author": "Luis C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-05-30", "description": "Basically, Il Pollaio is the El Pollo Loco of North Beach. They offer chicken, chicken, chicken, and oh...did I mention, chicken? ;) Just kidding, they also have different salads and sides too.\n\nMy boyfriend had been here before so he recommended it for our lunchdate. At first I wasn't sure what to order because heck, even a half chicken seemed like a little much, but I finally decided on the chicken breast sandwich. You can order a whole or half chicken so Il Pollaio is great for sharing and going with groups.\n\nAfter about a 10 minute wait, we were off to the park to enjoy our lunch. I opened the box and saw what appeared to be a sandwich. It was HUGE! Two pieces of grilled chicken breast atop a bread roll. The sandwich also comes with tomato, lettuce, onion and a side of their salsa. Overall, the sandwich was good. The chicken was extremely juicy and flavorful and I loved the salsa BUT it was just TOO MUCH chicken. However, at $12.95 I guess I got my money's worth in chicken but overall it was way too much money for a sandwich and a side of fries.\n\nI would definitely come back to Il Pollaio but next time I will just share a whole/half chicken instead of opting for the sandwich. Much cheaper and sensible option!", "author": "Stephanie C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-31", "description": "Delicious chicken.  Like, so good that I'd like to use expletives to emphasize my point, but have to avoid doing so.  The whole concept for this place is so simple and so well done, particularly for those times you're in the mood to switch off the bougie SF foodie persona and go casual with some food like grandma makes (if my grandma were Italian).\n\nTake out and eat a half chicken at home while catching up on your DVR, or dine in with a bottle of wine and some tasty bread w/ oil and vinegar, and people-watch the tourists through the big windows facing Columbus.", "author": "Julia W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-12-09", "description": "I've been coming to Il Pollaio for years. It's a nice little family-owned joint that serves up some pretty tasty food. The chicken is always great off the grill, with a little squeeze of lemon, but I generally go for their burger or their 3 sausages. The burger is good meat and I get it medium rare. It's kind of a longer shape than the typical patty and they usually serve it on a scooped-out piece of baguette or sometimes ciabatta(which I don't like as much). The 3 sausages meal is interesting because I guess you can get it as a sandwich on the baguette, but I've also gotten them uhhh...not as a sandwich. The sandwiches come with hella tomatoes, lettuce and raw onions, but I uusually take out the lettuce and tomatoes and eat that separately as my salad. \n\nThe rabbit I've had a few times and it's great, but a bit too pricey for me to get regularly. Salads are good and filling, but I always get fries on the side of everything. Just a bad habit I guess.\n\nService is pretty friendly here and unlike some places, once they've seen you coming in a few times, they'll start to remember you. Always a plus to me.\n\nI like this place because it's always remained pretty much exactly the same for the past decade I've been coming here. Go by yourself, watch some soccer, drink a Peroni and sometimes you can have some interesting conversations with some cool people around. A great place to just hang out, eat and people watch. As far as atmosphere, I greatly prefer it to the other restaurants on that strip. It's actually probably the only restaurant on that strip I feel comfortable being in. No douchebags, not too many tourists and no hipsters. It's pretty much a locals kind of joint that serves good, unpretentious food.", "author": "Miguel G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-10-15", "description": "Small place with a very limited menu. However, they are known for the grilled chicken, which is very delicious. I generally order the half chicken with fries and I am 100% satisfied each time!", "author": "John D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-05-08", "description": "Everybody, and I mean everybody - from neighbors to a career coach at work, rave about Il Pollaio but it is really just over-rated.\n\nThe only thing I can agree with folks is that it's a cheap meal. But here's where I disagree. Every single time the chicken is dry, dry, dry. Unless that's what you look for in chicken, I think there are many places to get much tastier and moist chickens. The sausage platter didn't impress either. Oh but the salad was good... I guess becuase it didn't meet the grill. \n\nIf you really want chicken on Columbus between Green and Union, then fine... Il Pollaio is an option to consider. Otherwise just recognize that it is an over-hyped eat.", "author": "Jon L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-05", "description": "This restaurant is famous for its chicken and salads. The chicken is pretty nicely done, the combination salad is also a good deal. The service is attentive without being intrusive. They should maybe buy more bottles of oil, we had to share ours with 3 others tables. The price is decent and affordable but I have to admit that I was expecting a price a little bit cheaper.", "author": "Thibaut L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-02-26", "description": "Don't go here.  Leave it for the people who know and love San Francisco.  \n\nI mean, here's the deal.  Good food.  Good people.  Low prices.  \n\nReally, go to one of those places with attractive young people speaking in bad Italian accents inviting you to eat mediocre food.  Skip this place.  Or better yet, go eat over priced garlic down the street.  It is where everyone told you to eat, right?\n\nUnless you want the real deal.", "author": "Polly P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-03-19", "description": "A lot of people say this place does not make chicken as good as their grandma makes. \n\nwell until your grandma opens up a restaurant in san francisco I will eat here. \n\nthis place is good.", "author": "Dico B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-01-13", "description": "WOW!  Just had dinner here.  I'm trying to conquer all of Little Italy this month.  Anyways, I always walk by here and it's always packed.  So for dinner tonight, I just remembered that I haven't been here yet so the lady and I went here for dinner.  \n\nUpon entering the venue, a waiter quickly greeted us and showed us to our seats.  We actually got lucky because we got the last table.  We were then brought bread & butter as well as a couple of waters.  After looking at the menu we then ordered the 3 Italian Sausages with Fries and a half chicken.  Amazing!  The chicken has the white and dark meat and is superbly flame broiled.  Great flavor!  The sausages are amazing as well.  No additional sauces need for this!  Just magnificent on its own.  The fries were crispy on the outside and soft on the inside.  Super piping hot though, watch out!  Anyways, we asked for ketchup and got ketchup, tabasco and salsa.  What?!?!  Salsa?!!??  The salsa was pretty good and accompanied the chicken.  Very tasty dinner for under $20.\n\nCan you dig it?!", "author": "Limzer L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-03-17", "description": "I was trying to soothe a hangover with some comfort food, and had wandered around poking my head into much too full and much too vacant restaurants until I found this restaurant that was juuust right, or so I thought....\n\nI looked at the food on everyone's table and it looked great! I found a seat and was handed a menu, and it was all down hill form there. All the menu says is \"Full Chicken\" this much, \"Half Chicken\" this much, \"Soup\" this much, with no description of what you're really getting. And when I asked the waitress she was polite but very brief and then gone.\n\nSo I settled on a Hamburger and fries, greasy and perfect for my needs, and who can mess up a Hamburger? Well they can. I got a DISGUSTING giant flat patty thing on a sub roll. It was about 6 inches long and 3 inches wide, not a burger, with three giant tomato slices (giant watery tomatoes are the giveaway for stingy ingredients) and half flaccid french fries.\n\nMy waitress also abandoned me right after service to have a 30 minute conversation with some other customers.\n\nThe restaurant obviously hasn't been cleaned in a while, either. There are still some christmas decorations up in the window, and a bag of garlic hung up with a millimeter of dust built up.\n\nEven if my waitress had cared about how my food was, I wouldn't have wanted to change my order because I didn't want a giant plate of just chicken. They need to make plates of meat and side combos for people who like a little variety.\n\nI regret not sending the food back and leaving.", "author": "Brie P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-10-21", "description": "What I Ate\n- half chicken\n- Italian sausage\n- roasted peppers\n\nWould I Go Again?\nNo.  Everyone raves about the chicken, but I thought it was pretty dry.  The Italian sausages were bland, and the roasted peppers were soaked in olive oil.  Maybe the chef was having an off night, but I do not plan on going again and finding out.", "author": "Ben M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-09", "description": "It was the day before my friend's birthday and she wanted chicken for breakfast so the four girls including my self went here per recommendation and Ohh My God, we felt like queeeens! The chicken was the BEST Succulent, tender, crisp, and heavenly thing EVER. The four of us shared a whole piece of chicken and we even had one piece left over.. I wasn't planning to eat but the hand kept on reaching for more of the juicy meat. \n\nAlthough the chicken was amazing, my friend was dissaponted that the bread for appetizers was not warm. We also had the chicken with the fries. It looked good and golden but they were meh..\nThe steamed potato, which was buttered simple and steamed to where it melts in your mouth but served somehow in tact with the parsley was good!! But I think I can make it at home.\n \nThe food was served timely and we can see the whole chickens being grilled behind the register of the mom/pop store. Our waiter was foreign so it made it feel like we were really out in europe too. The restaurant is in the middle of little italy which is near by the fishermans warf so it's a perfect spot after or before a stroll around town. \n\nTHE PLACE DOES NOT DISAPPOINT WITH CHICKEN!", "author": "Iris Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-08-19", "description": "Let's get some chicken and rabbit! \n\nDoesn't look like much from the outside, but OMG delicious and cheap! Half a scrumptious chicken for $8.25, can't wait to go back for more marinated eggplant $5.50, a full carafe of house red wine for $14, and one side salad that could easily be split 3 ways? SOLD!!\n\nGo early, they close at 9pm.", "author": "Jaime H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-11-23", "description": "they served bread first with butter\nwe ordered a whole chicken with Mix salad, Fries and Coke\n\nPros\n\n-Prices \n-the service was good and fast\n-Fries was really hot and crispy\n-So many dressing for the salad to choose from ( I chose 1000 Island)\n\ncons\n\n-Chicken was good not fantastic as I expected It was just ok \n-Toilet wasn't' really that clean\n\nIf I will be back to this place maybe because of the salad and the fries not the chicken", "author": "Fatma I."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-07-11", "description": "Petite deli was closed by the time we got to north beach so we stopped by il pollaio instead. Quaint ambiance, kitschy italian decor - autographed pictures and italian ads. Very friendly service. Large open windows great for people-watching (all the tourists that walk through the main strip). Good amount of seating but mostly four-tops so large groups may not be the best. Watch out for parking, as with most of north beach. \n\nChicken was soooo good! Flavorful, tasty, tender, moist. He got half chicken with salad, I got chicken sandwich with fries. All of the above is recommended for superb tastyness. \n\nWould definitely come back for more tasty chicken. $41 for food, a glass of wine, tax and tip.", "author": "Joyce C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-10", "description": "The chicken at this place is to die for. Juicy on the inside, crispy skin on the outside. Coupled with fries, you just can't beat it.", "author": "Bud H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-15", "description": "This is one of my fav places..  THEY DO CHICKEN PERFECT HERE!!!!\n\nCombination Salad, Half Chicken.                        This Place Does chicken Right!!!!  FIRE!!", "author": "Sonny S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-03", "description": "This place absolutely brought out the pregnant lady in me.  Can't beat the value for this awesome food.  And apparently Nancy Pelosi agrees.  Went there one night in October, waited outside for like 15 minutes, and a couple of black SUVs pull up, a couple of hardcore security guards stand in front of the door, Pelosi runs in and runs back out with a big to-go bag.  Okay, here's my problem with that.  We have no money for SHIT.  If Pelosi wanted her chicken to go, why couldn't she just send one of those security people on their own in a normal car?  Instead, she had to take the reallllllly efficient route of having TWO cars, drivers and security guards, so she could pick up her food, right?\n\nOkay enough about that.  Food.  I just really liked it b/c for $10/person, got this really simple but delicious three-bean salad with olive oil and a huge 1/2 roasted chicken.  Nicely roasted, juicy.  Can't beat that kinda comfort food with a stick.", "author": "Bryan S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-07-05", "description": "Arguably the best chicken you're going to eat in San Francisco. This place is a gem when you're looking for a no nonsense tasty meal in North Beach. \n\nMy usual is:\n - bean salad\n - half chicken\n - enough said.\n\nThis is the perfect place to stock up on protein a few hours before a game if you're an athlete. When I eat here before playing football (soccer) I always have more energy during the game. Love this place.", "author": "Bryan B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-30", "description": "what i ordered... a whole roasted chicken\n\none awesome bird...... well seasoned and perfectly charred.....tasty by itself without any additional sauce(s).  the bread that came with it, was better off to be thrown away or use it to clean up the drippings around your lips.\n\nambiance... ok (small and cramped but the area was great)\nservice... ok\ncost... $$ (expensive, birdy was small and costly)", "author": "Gors P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-09-21", "description": "I'm on a North Beach restaurant tangent - and this place def rocks the feathers off a Foster Farms chicken. For some reason, I hadn't been craving chicken in awhile, so was quite disappointed with myself for waiting so long to check this place out when I've known people living in North Beach for years. \n\nJuicy chicken from a rotisserie with option of salad or french fries is fine by me. Zach and I each got a meal, so we could have both fries and salad and it was WAYYY too much food for 2. But priced so well we were down for leftovers :) I can do some amazing chicken salad sandwiches with leftover, roasted chicken.\n\nBut I'm dithering - waiter offered to split our salad plate into a combo of bean salad and green salad that was what I call top notch service. \n\nDefinitely a great meal, affordable and will have you doing the stereotypical finger licking chicken action!", "author": "Alita M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-04-07", "description": "Seems like the best local places are the last ones we are hitting - don't ask why.  I've read so much about the chicken here and actually tried to come here once on a Friday night only to find a line snaking outside.  We finally made it in on a Thursday night when it wasn't too crowded.  We were seated shortly after we walked in and noticed the place is not as big as we had thought.  There were 2 tables of 2 to the left across the grill and a mix of 12-14 tables of 2-4 that can easily be combined for larger parties.  \n\nWe got a table next to the window and studied the one page menu.  We knew we had to try the chicken and when hubby saw lamb chops on the menu, that was it.  While waiting, bread was served warm w/ cubes of butter.  We ordered a carafe of the chablis ($9) to go with our meal:\n\nsmall combo salad - $5 - a mixture of lettuce, kidney and garbanzo beans, onion, tomato, shredded carrots with vinegar and oil\n\nlamb chop with steamed potatoes w/ olive oil and parsley - $15.95 - you get 4 large pieces of meat cooked to order.  They must cut their own.  Each had a large round bone near the top or center - It's not the best cut but the marinade was very flavorful.  The potatoes were so good - I chowed down every last drop.\n\n1/2 chicken - $7.95 - it was cut into quarter for us in advance.  the crispy skin was delicious but the meat was a bit dry.  we only wished there were more skin on the chicken.\n\nour waiter was very friendly and helpful, he even gave us a free glass of chablis when we finished our carafe.  \n\nIt's a great neighborhood joint for a casual dinner.  We already know what we'll be ordering next time - the rabbit and the large golden crispy french fries.", "author": "Gloria H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-24", "description": "Great casual spot for roast chicken. It's pretty down to earth, a good value, and quick. The eggplant dish is also very good (and recommended to go with the bread).", "author": "Victor W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-01-24", "description": "Good chicken but definitely not the best. The price is more than reasonable and they are quick", "author": "Eve C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-31", "description": "Problem #1: I am surrounded by sandwich places when it's time for lunch. I decided I want chicken, not chicken chunks in a sub, not chicken slices between 2 pieces of bread and not chicken bits grilled inside a panini. I want to pick the bones out myself and tear off the crispy skin with my teeth. \n\nSolution #1 = Il Pollaio. \n\nProblem #2: It is located 15 minutes away from my office. With hills to climb both ways. Steep hills.\n\nSolution #2 = Just enjoy the sandwiches nearby.\n\nIt took 15 minutes and 43 seconds before I was at the counter ordering my half chicken for about $9, drenched in sweat and fighting tired legs. When I was presented with this half a chicken who sacrificed half its life to fulfill my hunger, the smell of it was enough to make me forget my tired legs. Then I realized I have to make the trek back to my office before consumption. $#!%\n\nThe skin was very crispy while the meat was just right and not too old, it was grilled masterfully. I had won the war against sandwiches that day with the only casualties being my sweat soaked dress shirt and funky body odor for the rest of the day. Well worth it if you asked me, but maybe not for my coworkers eating their sandwiches next to me.", "author": "Roy H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-06-21", "description": "El Pollo Loco got nothing on this place. Instead of being another Italian restaurant in this Italian neighborhood, Il Pollaio is alternative option with a delicious menu.\n\nIl Pollaio is discretely located along Columbus street close to Washington Square park in between two restaurants. It's a small place, but you shouldn't let it's size deceive you. I'd say the biggest group you should go here with is 6 and the best time to eat here is around lunch hour. \n\nThe service here is great as the waiter/waitress is quick to seat and take your drink order and kindly assist you of in need of help. \n\nOn to the menu, there many great things to choose from. For starters, their salads are generally delicious and nice apportioned and worth munching on while you wait for your main order. They have your typical beverages from sodas to beers and a small wine menu on the back cover. For the main dishes, the three primary choices I tend to look at are the hamburgers, the smoked sausage, and the chicken. \n\nDo not underestimate the hamburger, it's massive. They fire grill it and serve it on a piece of roll. The patty is huge and will leave you stuffed or wanting to save it for later. The smoked sausage has looked good although personally I have yet to try it. The most popular and best of all, the chicken. You have a choice of a half chicken or whole chicken that is fire grilled to Perfection. A half order of chicken is suitable for two people with a whole meant for 3-4 people. The price varies with what you order, but the cost is worth food you are getting. In addition, I typically always order the French fries that are cut in steak like fashion and are simply fried to perfection. I forgot to mention, they always bring you some bread to munch on with butter, always something I look forward to when eating from this place.\n\nToday i spent $25.00 on a whole chicken, large fries, one coke and it was well worth it. Next time, the hamburger it is with the sausage the following visit. Il Pollaio is undeniably the pound for pound king of the chicken in North Beach.", "author": "Jesus A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-02-18", "description": "No pretense.\n\nReally good charcol grilled chicken.\n\nTry the marinated eggplant, I don't even like eggplant but LOVED this item.\n\nFrench fries are thick cut and really good.", "author": "Mike I."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-03-12", "description": "Meh.\n\nA friend recommended this place, raving about the rotisserie chicken. I found it to be kinda dry and mediocre. Have I been spoiled with my Peruvian rotisserie chicken experiences? Can I no longer enjoy regular rotisserie chicken?\n\nI will say the marinated eggplant was pretty effing tasty. Tangy, garlicky, yum. I was also into the steamed potatoes with olive oil and parsley. In fact, those two dishes eaten together would make me pretty happy. But yeah, the chicken...meh.", "author": "Karena Q."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-24", "description": "If you are in the mood for some amazing chicken off the grill Italian style this is the place! Family owned and operated, I have been going here since I was a little kid. Very friendly staff, good chicken, side salad and half an order of fries! Can't beat it.", "author": "Rachel J."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-09-26", "description": "Ok, first off, this is listed as a Latin American restaurant which it is NOT. WTF, Yelp? (I did not factor this error into my rating)\n\nSecond, don't go here if you're looking for anything other than meat, cause that's all they have. Plain meat. My dad and I got the italian sausages and my stepmom got the chicken sandwich. It was good, but nothing remarkable at all. Stepmom wondered why there was so much bread on the chicken sandwich (\"It was like they stuck a piece of chicken and some lettuce and tomato inside a loaf of bread!\"). Pricey, considering the quality, the atmosphere, and the extremely limited menu. The only thing that really stood out was the marinated eggplant (delicious) and the french fries (piping hot and fried to golden perfection even if obviously from a freezer).\n\nThird, the waitress seemed really crabby. She only had 6 tables but hardly paid any attention to us, seemed really frantic, and when we did request something (like ketchup or a water refill) she seemed hurried and pissed off. We figured she was having a bad day for whatever reason and still tipped her very well (25%), but come on, be more professional and courteous, there's no excuse for such an attitude in a service job in this economy.\n\nIf you want meat and potatoes that are nothing more than the italian sausage, chicken, and frozen fries you can get at Safeway, and to pay 5x more for it, in a shabby atmosphere, and served by a waitress that isn't very nice or attentive THIS IS YOUR PLACE!\n\n(I really, really tried to understand why this place has so many five-star reviews. Is it because the places around it are even worse? Who knows, but your money is better spent at dozens of other places in the city that are a much better value.)", "author": "Ben G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-01-26", "description": "It's too bad there's already a place called Good Frickin' Chicken in SF...Il Pollaio should grab the title of Great Frickin' Chicken! \n\nDon't mess around - order some chicken, squeeze some lemon on top and enjoy. Did I mention you can stuff your face for under $20, including a glass of wine?\n\nCheap and easy, just like Phil H.\n\nps...they close at 9pm so if you want to get your chicken on, do so early in the evening.", "author": "phil h."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-25", "description": "Good grilled chicken, but even better lamb chops!  Carnivore heaven.", "author": "Kristen S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-01-08", "description": "Colombian/Argentinian style bbq.\n\nGrilled onions are salty & delicious. Eggplant is so so.\n\nThe half chicken is a solid bet..the lamb chops weren't bad either. Tempted to try the rabbit next time. Didn't have the courage to pull the trigger last night.\n\nFelt oddly similar to a korean bbq experience when we were finished.  Perhaps because everything was pretty salty. Remember to drink lots of water after.\n\nDef. worth visiting once.  If you find a comfort zone in the menu then you can make it a regular stop.", "author": "Salmaun A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-12-16", "description": "Simply stated: some of the best frickin' chicken I have ever had in my life.\n\nThats really all I have to say. Their sides are average....nothing special. But you don't go here for the sides...you go for the chicken. The chicken is where it is at.\n\nJuicy...seasoned just right....\n\nIts just strait up good chicken!\n\nThe end.", "author": "Sarah G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-05", "description": "Best grilled chicken in the bay area! Great portions, good prices, glass of good red wine for only $6, combination salad is delicious, sausages are yum and very friendly staff! It's just a hidden gem if you haven't come yet and you love chicken, come now! I don't know why but this chicken always reminds me of my summers in portugal! Oh and they do a boiled potato that is just sticky deliciousness with awesome olive oil. The most friendly employees and owners that offer excellent service. I have many fond memories of eating here with my dad. If you can't figure out where to eat and you want good food that won't cost you an arm and a leg, please come here! Bon appetite!", "author": "Bri S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-11-30", "description": "It is really sad to see once a great restaurant turns into something else. I'm sure Jose taught these cooks how to cook chicken and other meat as well as he could, but none of these recent cooks came even close. (Freddy was really the closest one.)\n\nI realized one day, so many disappointing chickens later, that I was coming back here week after week thinking that  I can have Jose's dream chicken but it doesn't exist anymore... It got lost long time ago when he retired. \n\nI am sad.", "author": "Wakaknee J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-07-28", "description": "Doing the southbeach or Atkins diet? Need a $10 meal for 2. \nOrder to go or visit Il Pollaio. I heard about this place on yelp and most weeks it's a weekly tradition--saved for the day we have to work the latest and spend the least amount of time and money. We always get it to go. Get a freshly grilled chicken, deliciously seasoned with some lemons to squeeze on top and a side salad, it's the perfect quick meal!\n\nThe women who run the counter are quite pleasant!", "author": "Nikki M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-12-13", "description": "For those of us who do not have access to a kitchen fit for cooking a big old four course meal (or are lazy like me), Il Pollaio is an excellent choice.  We got a whole chicken, which may actually have been one of the best chickens I've ever eaten, a sampling of their appetizers, and a salad.  Of the sampling of appetizers, the pepper dish and the eggplant were great (and served cold, surprisingly).  Coleslaw and salad aren't so fabulous--stick with the stuff they cook, it's old school food.  More than enough for three hungry people.\n\nNext time I'm craving a home cooked meal, this is where I'll come, instead of pretending I'm capable of making a chicken half this delicious/starting a dinner like this at an hour that would actually permit me to eat it before midnight.", "author": "Sydney H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-02-15", "description": "Chi... chic... chicken... chi... chic... chicken... That is what you must order when you come to Il Pollaio!!! Everything else pales in comparison to, what's the name - oh yeah... The restaurant says chicken in Italian. So it cracks me up when I see people order rib eyes here. A whole roasted chicken, salad and fries, can feed a big family of 4. Fries are fries, salad is just a salad, but you can wash it down w/ some good cheap sangiovesee or chianti for an extra $16. \n\nMama Mia!!! Now that's Italian...", "author": "Minh V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-29", "description": "Ahhhhhh, Il Pollaio. I have been ordering out from this restaurant every week and a half or so for the last couple months, but today was the first time I ate out here. Atmosphere is comfy-cozy, just how I like it, our server was very sweet, kind, and helpful, and the wait for the food was only about five minutes, which was awesome, because I was STARVING and couldn't have the bread, since I was celebrating Passover. \"But what about the food?\", you may ask. The food was AWESOME. The chicken is delicious (three friends and I got a whole chicken, large garden salad, and large fries), I had no garden salad, because that kind of salad is not quite to my liking, but my friends said it was great. The fries were lovely looking, and they were so good I felt less guilty about eating them. The only reason that this didn't get five stars is the fact that we had to wait 10-15 minutes for our food to be taken and our check to be given. I was so full, though, the wait just gave me a couple minutes to relax. \n\nI would highly, highly recommend.", "author": "Margeaux W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-10-16", "description": "Bok, bok! What are you, chicken?!\n\nIf this place were to be taunted by elementary school children, it would respond, yea, I'm chicken! Damn good chicken!\n\nFor someone who is a fry fanatic, given the chance between salad or fries, well, it's a no brainer, but at this place - the combination salad is as good as the fries. *Droool*\n\nThe chicken is consistently good and flavorful. I've frequented quite a few times and their prices have gone up. Boo, but I'm sure this is the trend for every place. \n\nOh yea, one more thing: don't order the burger here. I did it once. Never again. It was dry and more dry. Bleh.  Chicken is the way to go. \n\nBok, bok!", "author": "Dolores L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-27", "description": "Very tasty chicken and salad. Love the food, the place is a little small but charming. I will be back for more and invite my friends too.", "author": "Glenda P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-10-15", "description": "This is a good place to grab a casual meal, especially if you want a lot of food. I have ordered the chicken, combination salad, fries, and split pea soup at this place. While the volume of food is a good deal for the price, I was not impressed by the food. The chicken was juicy and flavorful, but not something I would come back for. The fries were fresh from the fryer, but were really bland. The split pea soup was unpleasantly thick and had a bitter taste.", "author": "Julia W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-03-01", "description": "Many yelpers claim Pollaio to be the best chicken in the city. I was looking forward to having my poultry mind blown. I must have gone to the wrong place.\n\nThings started well with an impressive execution. You go from ordering to a box of chicken in less than five minutes. What's in the box, however, is disappointing. Good? Sure. Didn't have to make it myself? You bet. But for $9 it was expensive and far from the best. Closer to bland. Dry. Underwhelming. Meh.\n\nSafeway chicken is just as good. Grandma's is even better.", "author": "Jason B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-10-27", "description": "Chicken very dry.  I mean very very dry.  Salad fresh and veggie soup was good.  But the chicken, the main reason for Il Pollaio was dry and bland.", "author": "Jerome B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-27", "description": "I have been coming here for at least 8 years and I always have a good experience with the food and service. The food quality always consistent. You may have to wait a little bit on the weekend if you catch their on their rush time due to their limiting seating space, otherwise everything is alright.", "author": "Shadi K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-09", "description": "Half chicken and combination salad are good.", "author": "Yejun Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-07-28", "description": "Chick-uhn good!\n\nI had hard so so much about this place I just had to finally try it! And ill go ahead and say it, it wasnt mind blowing..but it was damn good and thats what counts!\n\nA half chicken with fries was plenty for my boyfriend and I to eat..and with leftovers! And the chicken was delish. Juicy, crisp skin, well seasoned, Mmm. They also load you up on bread and butter which is awesome.  \n\nMy only complaint is the cole slaw. Not quite cole slaw..more like shredded cabbage salad. But hey-this aint KFC.. what was I expecting!", "author": "Britney K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-06-09", "description": "We have been going to Il Pollaio for years as faithful customers, I'm thinking like 20 or so. Well, last Tuesday I am sorry to say is the last time we will frequent this establishment. And the reason is this, we have noticed for the last couple of years that the chicken they serve has become very skimpy in size and the guy they have grilling the chicken seems to think that cooking chicken to a burnt char is what is correct. We have put up with this I guess out of love for a favorite place but Being served a emaciated chicken with the wing portions being so charred that all there was to eat off of those pieces was black burned skin on bones, the breast meat over cooked and super dry and the only edible portions the thighs made paying for a whole chicken just plain crazy. We are really sad to call it quits on this establishment as the people who work here know us as regulars. I guess being served chicken served to a black burnt crisp one too many times and seeing the owner who used to cook the food show up only to close the place for the night and collect the days money made us realize that Il Pollaio is Kaput!", "author": "Steven B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-11-08", "description": "i can't believe this is the first time i've thought of writing about this place.  i've been going here forever - well, about 17 years...\n\nthis is one of those places i don't want to get too famous, since i might have to wait for a table, but they deserve to be famous\n\nfor the chicken.  it's the best grilled chicken in the city.\n\nalso, the salad (i get the \"green and bean\"), the great bread, \n\nand the fries.  the fries are awesome.\n\none time i brought my dad in - visiting from the east coast.\n\nMy Dad: \"that was great.  how do you prepare it?\"\n\nOld guy who owns the place, now retired:  \"a mix of italian spices\", or \"i'm not telling you shit\".  best answer ever\n\nif you like watching soccer, they have a TV.  they were watching soccer during the world series", "author": "tom p."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-10-13", "description": "Could this place get any better?\nNO.\n\nThe answer is no. \nJust go and find out for yourself. I can't even tell you how great it is....", "author": "Francesca F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-07-24", "description": "Amazingly delicious and fresh roasted chicken. Make sure to ask for the salsa with the chicken,  The greens and beans mixed salad is awesome. The pea soup, minestrone soup are also great. Burgers are huge and tasty...on and on.\n\nThe only issue is parking but that's North Beach issue. I am not going to blame them for that. Expect to wait about 20 minutes. Well worth it.\n\nOh...and the customer service is phenomenal as well. Very nice people.", "author": "Edward N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-06-30", "description": "Exactly what I was looking for in a chicken place. Bit pricer than the places back home, but I got a nice sized salad and half chicken for $13 (along with free bread+butter). Wait staff was friendly and fairly attentive even though I was by myself.\n\nThe chicken was a standout; ranks among the top I've ever had. It came hot off the grill, with the skin awesomely crisped and the insides juicy. It was sealed up so well that even upon starting my last piece, it released a delicious steam of chicken juice! Needless to say, I finished every nibble on the bone. Eating with hands encouraged.\n\nOverall, Il Pollaio was the best restaurant I've tried this week, since it's unpretentious, authentic, reasonably priced food.", "author": "Andrew W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-12-02", "description": "This place closes on sunday. You have been warned. \n\nI went back after being dissapointed by a weekend closure and the chicken was impressive. A 4 out of 5 on my scale. The skin was crospy and tasty. \n\nThe bread and butter they gave us were cold and unimpressive.\n\nA whole chicken is about $12 and a half chicken is $8.", "author": "Carlos A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-05-06", "description": "They have very good chicken, period.\n\nI usually don't like chicken skin, but at Il Pollaio I eat every morsel of their delicious chicken, and the crispy seasoned skin is the best part!", "author": "Joel S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-05-18", "description": "Hmm, Argentinian food in Little Italy - great example of why this is a great idea! I've passed this place a million times and never thought to check it out - it just doesn't look like a great place to eat; however, I had the best chicken here and I really can't stop thinking about it. \n\nI mean, it seems like the best well rounded and reasonably priced takeout in my hood. Between two of us, we ordered a whole chicken, two beers, fries and a large salad. I'm telling you, we rolled out of that joint and had leftovers. Juicy chicken, crisp steak fries and an OK salad. All together $34! If you like perfectly seasoned chicken, you will love this place!", "author": "Rayna A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-02-16", "description": "BEST CHICKEN. Seriously probably my favorite meal of all time: half chicken, homemade salsa, combo salad.", "author": "Dominic C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-09-08", "description": "Really great grilled chicken. Discovered this little gem about 5-6 years ago and haven't stopped coming here since. Service is polite and quick, you get your food pretty quickly, and everything I've tried so far (rib eye, chicken, rabbit) is excellent.\n\nThe chicken is tender and moist, with perfectly crisped skin, and perfectly seasoned. I ordered a half chicken with a green salad the other night, and the salad greens are fresh. \n\nIf you want to get the rabbit, you want to get there relatively early, because they were sold out the last two times I went and asked for rabbit.\n\nHighly recommend this place as a cheap eat. Healthy too, if you avoid slathering the bread with pats of butter.", "author": "Evelyn C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-07", "description": "Came here on a cold weeknight and my boyfriend and I were seated immediately. It's a very casual dining experience. Salads are huge and 2 people can definitely share a salad and the yummy fries. My boyfriend ordered the half chicken and devoured it in 5 minutes. So tasty! We had to order another! This is a local place and their food does not disappoint. If you're hungry for some finger lickin' chicken, this is your place!", "author": "Viki P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-15", "description": "Come have dinner here and your palate and wallet won't be disappointed.... The chicken is done perfectly and it is seasoned just right.  It's convenient and fast for take out as well.  Dinner for two or three will not be expensive...", "author": "Laura C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-11-25", "description": "Of course, after completely bashing Columbus Ave. eateries, I would walk into a restaurant on the corner of Columbus and Union, and fall in love.\n\nIt is a calm Saturday, we have just survived 1 skydiving trip and 2hrs of horrid East Bay traffic. Starving for something simple yet heart-warming, we enter Il Pollaio, a restaurant with large windows, red tables, and completely devoid of neon lights.\n\nMenu item:\n\nSide- Roasted Eggplants\nBeautifully roasted eggplants, still retaining the wonderful purple. Sliced and quietly bathed in oil and vinegar, minced garlic, dried herb and red pepper flakes, each bite is tender and flavorful. The taste of vinegar combined with the bite of garlic creates quite a summery note.\n\nSide- Fries\nThick-cut fries in its perfection. Golden crisp on the outside, almost a mash-consistency on the inside.\n\nChar-Broiled Chicken (Whole)\nWhen a piece of chicken is cooked perfectly, it moves one to tears. This is one of the occasions. The outside is grilled charred, yet not overly so, leaving the skin crisp to taste. The meat was so sweet and juicy, you wonder how you could ever eat anything less than this for the rest of your life. And with each bite you can taste the sage and other herbs they've used in the marinate. A drizzle of lemon juice to really brighten up this simple fall harvest feast.\n\nThrowing my hands in the air. North Beach Snootiness: 1. Columbus Ave.: 1.\n\nRecommended for-\nwhen you just want something simple, done perfectly.", "author": "Fiona S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-05-26", "description": "My good friend bought over the chicken, to-go. Well, I wish I could give it an amazing review, like everyone else. In my opinion, the chicken we got was dry-ish, and needs more spices.", "author": "Vera W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-06-23", "description": "Err...  I'm Italian. I don't understand people claiming this is an \"Argentinian\" place. Did I miss something? There are a number of things that indicate that this place is Italian:\n\n- It's called *Il Pollaio*, not \"El...\" That is an Italian name.\n- There are autographed pictures of Juventus players on the wall (arguably Italy's most famous soccer team)\n- There are a number of Italian advertisements hanging by the cashier\n- The food is pretty Italian (roasted chicken, pork, sausages, soups, etc.)\n\nItalians have been roasting chickens for centuries. Is there something unique about this place or the food they serve that makes it Argentinian? Please forgive me if I missed something obvious.\n\nAnyway, they have excellent food, especially for take-out. I had a half-chicken with soup and a salad, and I was quite full and very happy for less than $20. The chicken was great, which didn't surprise me. The lentil soup was also excellent (nice, smooth, and rich, and NOT too salt). I enjoyed my dinner, and suspect I will return if I want something tasty and easy on the ol' stomach.", "author": "Angelo B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-11-25", "description": "For chicken lovers (which my hubbss is), this place is heaven. Amazing chicken and get the grilled eggplant and combination salad. Or get a side of french fries if not so healthy. To top it all, the service here is great. I wish they didn't close so early..", "author": "Kanwal A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-11-05", "description": "Chicken fans beware.  This hungry yelper who will be kitchenless for awhile (just started a reno) remembered some fine poultry offerings here.  A quick phone call for a whole rotisserie chicken to go (I prefer to cut it up myself and get the whole bird), 15 minutes later and ta da!  Lovely and juicy chicken with slightly smokey and crispy lemon peppery skin.  The bird does come with some free yummy french bread and butter but do ask nicely.  All for about $12. Feeds a semi hungry family of three.\n\nFive fine clucks.", "author": "Jen L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-04-16", "description": "The best low cost meal in San Francisco.  Go with grilled chicken and salad combo and you'll be very happy.  I love this place and eat here once a week.  Neighborhood favorite.", "author": "Niland M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-05-28", "description": "We have been going to Il Pollaio for years. Jose and Ana always made us feel welcome, especially when we brought our children.\nNow their son is running the restaurant. Although the prices have risen, the food is still the same spectacular grilled chicken with salad and sides of fries and grilled vegetables. It tastes like the old country. It feels like home.", "author": "Susan C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-19", "description": "I go here around once a week and just love the place. The chicken is perfectly cooked and seasoned. One time, one of the waitresses witnessed my clumsy attempt at trying to use utensils, knocking a piece of chicken on the floor. They replaced that piece of chicken.", "author": "Sean C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-02-22", "description": "Vegetarians beware!! There is little for you here.\n\nI love restaurants that focus on less than 8 dishes on a menu. We don't have a lot of them in San Diego, so I had to come up to San Francisco for it.\nMy friend and I ordered the chicken, salad, fries, and spicy sausage. Everything was well made and tasted perfectly.", "author": "Dave R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-01-03", "description": "hands down the absolutely most perfectly delicious grilled chicken i have ever had in my life. and the grilled onions were the best grilled onions ever, too. i mean grilling in itself is fantastic and the right seasoning on it makes me drool thinking about it. the price for a whole chicken is economically right on for me as well. my bf tried getting the recipe outa the chef with no luck. not only was the skin crispy salty savory, but the chicken itself was JUICY. bf needed some meat so he got a rib eye, cooked exactly right, very flavorful. potatoes that came with it were simple but heavenly.\nserver was sorta lame. but the other server helped us out once in awhile. salad was crunchy and fresh. minestrone was good, but my bf did add about a cup of parmesan on it :) almond torte was pretty delectable. flakey crust, crumbly inside. we were utterly stuffed and will definitely be heading back!", "author": "Abigail W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-09-24", "description": "simple food is the best food. stopped here for dinner after a 12 mile hike and oh my goodness...it was amazing. We had salad, steak, chicken, potatoes and french fries. the steak was tender, the chicken was juicy with crispy skin. one of the best parts of the meal had to have been the bread they serve you...along with olive oil and balsamic vinegar. definitely coming back here whenever i'm in north beach!", "author": "Jen D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-05-29", "description": "My daughter thinks Il Pollaio is 5 stars.  The food is consistently good.  The service is fast and efficient.  The restaurant is small, but clean and in a good location.  The minestrone and lentil soups tastes fresh and home made.  Too often restaurant soups have too much salt, not here.  The chicken is so good, I wonder what the ingredients are in the marinate.  The salads are fresh and simple.  Everything is good here.  The portions are large, sharing is a good idea.  We come here everytime we're in the city.", "author": "t d."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-01", "description": "The steak and fires with salad was delicious and the meal was very reasonable, the place is small so for a steak at $20 is a bargain. Next time I'll try the rabbit it sure looks good, and the service was nice.", "author": "N A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-06-16", "description": "ahhhh the chicken place.....(as my friends and I like to call it!)\n\nSeriously, El Pollo Loco has nothing on Il Pollaio....Not only is their half a chicken with fries or salad a bargain, it just tastes so fresh and delicious!!!  The staff is so nice, and same with the patrons....im thinking i might go there for lunch today!\n\nLuckily a few months ago, my friend and I sat next to Valentino who will be opening up something on the corner of Green and Columbus...stay tuned for my review on that one.", "author": "Colette V."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-01-07", "description": "Nice, simple Italian food (but no pasta, FYI).  Brief menu is basically composed of chicken and beef with a few sides and salads, definitely a good place to take indecisive people because the menu is rather brief.  I split with my friend the grilled peppers (want the eggplant but they were out), the small combination salad, and a half a chicken.  \n\nPeppers were good, if a little over cooked to the point of being a touch soggy.  Combo salad was alright (it is 1/3 each green, cole slaw, and bean salad), green bit was fresh but bland, cole slaw was also fresh but a little slim on dressing, bean salad was very good though.\n\nThe chicken is, of course, the focal point here.  It was tender and juice with a slightly crispy skin.  The meat was really delicious and very good!\n\nService was excellent as well, the waitress was nice, quick, and very honest.  The amount of food we go was more than enough and the total came to only about $10 a person!\n\nThe main detractors here was the somewhat bland salad(s) and the fact that they seemed to be out of a lot of things.  The eggplant appetizer was no longer available and the flan has apparently 'not been made at all recently.'  If those had been available, this would have been a four star review.", "author": "Eric M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-08", "description": "What can I say! Great chicken! Great Value! My husband and I always get the 1/2 chicken and the house salad for $15.00!  Absolutely delicious grilled chicken; super yummy with the fresh lemon juice! Service is friendly and prompt; love the low key atmosphere!", "author": "Mary Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-05-16", "description": "Came here with my boyfriend yesterday and finally writing a review after plenty of times of coming here! Yay.\n\nEnjoyed yesterday - half chicken & salad $12.95. The chicken wasn't overcooked or anything today and the salad was good!", "author": "Vivian L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-26", "description": "One of my favorite places  in North Beach. The chicken is consistently great and the sides are really good too.  Love the french fries.  They have great table wine.  The service is good and they recognize their regular customers.  \n\nI definitely recommend the chicken!", "author": "L. W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-05-06", "description": "On a beautiful Saturday, my college friend and I got some chicken from Il Pollaio and went to the park across the street for a picnic.\n\nI was skeptical that the chicken could be cooked through completely while still being moist and juicy, but alas my chicken was cooked perfectly and I totally did not care that I was gnawing on the bones like an animal in the the middle of the park. \n\nMy friend really enjoyed his chicken sandwich and said the portion was just too much for him to finish.  I saved half my chicken for dinner later on.\n\nThey put the dressing for my salad on the side since we got our food to go, so I can't speak to the over-dressed salads a lot of people have mentioned here.  The people working there were really friendly and I could tell that some people were regulars by their interaction with the waiters.\n\nGreat place for delicious chicken for pretty cheap (~$12 for the chicken + salad combo) for a good portion of well-cooked, moist chicken.", "author": "Naoko M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-03", "description": "I must have walked right by this rather unassuming gem a good three or four times during my first day in SF. Little did I know that a dear friend would bring me here later on that evening for my first dinner in town. I spent some time after college traveling around South America, having tried all different kinds of chicken in several different countries, never had I tried Argentinian chicken. I must say, I was more than surprised by how good not only the chicken was, but how good the food was here. It seems like what sets this chicken apart from other South American ones, is that it's grilled and not done in a rotisserie and it makes a huge difference. The chicken is nice and moist, almost wet and picks up a lot of those great flavors that you can only get from an open fire grill. The grilled onions are a perfect accompaniment to the chicken as are the steamed potatoes which are almost dumpling-like. Adela our server, was as sweet as can be and apparently has quite the following here. I will definitely be stopping by here again on my next trip to SF.", "author": "Luis C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-05-19", "description": "Went here last Monday with my bf and his dad who are regulars...and by regulars, I mean they go every Monday! So you might want to take my review with that in mind...\n\nAtmosphere: nothing special but clean and allows you to focus on the....\n\nFOOD: amazing! I sampled several items: spicy sausage (not too spicy, really tasty!!), burger (woah...so good), chicken (yum!), split pea soup (good for a chilly night) and the bean salad (if you're feeling healthy...). Oh and we had some wine as well - went well the food!\n\nService: terrific, but perhaps because we were special customers....\n\nPrice: just right! Not too $$ and perfect for a weeknight meal out.\n\nAm sure I will be going back!", "author": "Jacqueline Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-05-17", "description": "I'm the kinda gal that gets peeved at a coffee shop with bad coffee.  A specialized shop should be GREAT at what they do.  Il Pollaio is GREAT with chicken.  \n\nMy small family and I ordered a whole order of chicken to go and enjoyed this at home with white rice. Simple, no fuss...just good chicken. This was particularly relaxing after a crazy day out and about in Bay2Breakers.  If you're looking for dinner to calm the night and ease the stomach...this is the way to do it!", "author": "Sarah Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-04-05", "description": "Cheap, delicious chicken.  Salad smothered in sooo much dressing.  Beans, coleslaw, and normal salad mixed together as an option as well!  I wanted to sample the sausage platter as well, but the chicken just looked and smelled too good for anyone to pass it up.  It didn't let us down.  \n\nSuper simple, well done food.  that what I like to see!", "author": "William B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-11-25", "description": "The first rule of Il Pollaio is that you're going to eat chicken.  The second rule of Il Pollaio is that you're GOING to eat chicken.  And if this is your first time at Il Pollaio, you HAVE to eat chicken.", "author": "Michael D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-08-19", "description": "I can only speak for the chicken sandwich that I had here for lunch one day.  Actually, it speaks for itself and it says, \"I am a huge, dry, flavorless chicken breast. Mmmmm.\"\n\nBleh is more like it.  I may have gotten a little heartburn eating the darn thing.  There was no saving grace to this meal other than the fact that I was super hungry and scarfed down more than I normally would have eaten.  So, yay on portion sizes, but boo to everything else.", "author": "Kira K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-10-01", "description": "After a day out watching whales at the Farallon Islands we wanted something good, fast, and filling.  \nWe all had chicken and salad and it was delicious.  The chicken was cooked so that the meat was tender and tasty and the skin was crackly crispy.  The server brought out bread first with Olive oil and balsamic vinegar.  Then came our salads.  Finally the chicken arrived.  For $11.25, you get half a chicken and a huge salad.  Definitely a lot of good food for the money.", "author": "Rosemary B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-29", "description": "We loved our dinner from here. The server was very friendly and welcoming. The menu is smallish, but what they have is good. The burger was absolutely huge, and served on a roll. Reading these reviews, I guess I have to try the chicken next time...", "author": "Anthony P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-08-09", "description": "yes, Yes, and YES!!!!   OMG their chicken is great!  Just returned from 5 days of fabulous San Fran dining, and Il Pollaio is what I miss the most.  Chicken, bean salad, marinated eggplant and a Malbec to wash it all down.  A perfect meal, with wonderful service in a fun neighborhood.  I'm trying to replicate the chicken tonight at home.  If it's only half as good, it will be sensational.", "author": "Kim D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-09-17", "description": "Simple, Cheap and Tasty.  Friendly staff.  Not much more I can say than that.", "author": "John C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-14", "description": "Wow chicken!  Got the 1/2 chicken and salad......GREAT.  was going to order more but the grill closed down for the night while we I was eating (9pm on during the week I believe)", "author": "Organix F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-02-22", "description": "Very impressive. The meat is tasty and moist and the skin is crispy and melts in your mouth. I ordered the half chicken with green salad to-go and enjoyed it thoroughly. The salad was prepared with fresh romaine, cucumbers, tomatoes, and radishes. The salad came with a tasty vinaigrette and really good bread (crusty on the outside, soft on the inside).\n\nBest of all?? $10 for all of it! A great deal for a quick, tasty, and healthy lunch. Friendly staff as well. I was impressed with the to go service... Not until I arrived and announced my order did the cook pull the chicken off the grill and put it in the to go box. Awesome!", "author": "Jill M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-11-19", "description": "They're not open very late at all.  But, if you happen to walk up at 9:05 and press your nose against the glass -- they might just let you in.\n\nThe menu is simple, but there's nothing wrong with that.  There's almost no need for a menu anyway.  Generally speaking, you want the Chicken, some salad, and some fries.  \n\nWhy is the Chicken capitalized?  (As opposed to crossing the road?)  Because it is marinated and then grilled.  And therefore, yummy.\n\nBy the way,  if you show up with more than 4 people you might be in for a wait - the restaurant is in a tiny space and does get full quickly during dinner time.", "author": "Stephan W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-10", "description": "Chicken is salty but good\nThe fries are insanely crispy yum\nBest bean salad of my life", "author": "Christopher L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-05-04", "description": "Stopped here before the DYL pub crawl for a quick bite (literally, we only had 25 minutes) I wanted something to keep in my stomach for the night since I planned on drinking gross amounts of beer. I ordered the hamburger which isn't the \"normal\"- (they are known for their chicken), but it was FABULOUS. They put some secret seasoning (okay, maybe its not a secret, but I didn't ask what it was, plus calling it \"secret\" sounds cooler) that really does MAKE the entire burger. Yum... makes me want one now for lunch. \n\nI also ordered Sierra Nevada and they brought me a glass with it which was nice (even if I prefer the bottle). The bread they give you before hand is tasty and if you finish your basket, they bring you another one. The french fries were fresh and hot and they give you an abundance of them. My friend ordered the chicken sandwich which was HUGE and looked tasty as well. \n\nMy favorite part of the meal was the fact that they don't put any mayo or mustard on your sandwich (or burger) they ask you if you want it and bring it out separate! Too many places put WAY too much on,  and it is gross. You don't even need any condiments, the seasoning is YUM!\n\n2 meals, 2 beers, ice tea and tip was 37 bucks... not bad!", "author": "Jessica R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-05-09", "description": "wow!! the chicken is just amazing! True that the place doesn't look much though the food is too good! I'd recommend this place to everyone! staff was very friendly also.", "author": "Camille A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-12-19", "description": "This place I think is open all day, which is great because my friend and I came in randomly  for a snack. I'd seen a lot about Il Pollaio on Yelp before, so it was nice to finally come in and finally eat there. \n\nWe ordered half a chicken, a cup of lentil soup, and a salad. Very filling for two people, surprisingly. and that chicken was oh so very delicious. i really love chicken, especially  tender chicken. and boy was it tender. \n\ni can't seem to remember how much we ended up paying but for a quick snack it was definitely a fair price. \n\nit's kind of a small place so i anticipate during peak hours it's hard to find a seat. \n\ni definitely plan on coming again.", "author": "stacy c."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-12-12", "description": "Simple, but perfect chicken.  The kind of meal that you sit around trying to figure out exactly what they put on the chicken for seasoning.  Could I make this at home?\n\nMaybe, maybe not.  But I will go back to this place again.", "author": "Steve S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-01-16", "description": "Someone has been giving me a hard time about this \"cold by the door\" minus one star comment I previously made. I only stand by it because the restaurant is small and anywhere you sit is near the door. I think they could turn the heater up a couple degrees to help balance this out. \n\nBut, someone else told me they didn't think it was cold at all, so maybe its just my personal preference. \n\nI liked this place, I just didn't love it.", "author": "Natalie N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-26", "description": "You're hungry. You don't feel like spending a ton of cash but you want something GOOD. You DON'T want Italian food but you really don't want to travel far from the hood. (Just bc you're in Little Italy doesn't mean you're destined to a diet of pasta noodles.) No worries...go to Il Pollaio. \n\nHoly smokes I love their chicken! It is so delicius and yummy and so affordable, considering the neighborhood. \n\nMy friend and I were starving one day. We walked into Mario's Bohemian Cigar Store and the prices for their sandwiches were way more than we wanted to spend. Also, they looked like the same regular sandwiches it you could get any where. A moment later, we were across the street, drinking wine, eating chicken, splitting a salad and having the best conversation ever. \n\nIn fact, that's where I think I'll be for dinner tonight :)\nHope to see you there!", "author": "Dorothea G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-08-28", "description": "I've walked past this place about a million times. I kept looking at the menu and saying to myself, \"I need to go here\" and then I'd keep on walking. I don't know why I never stopped in before now, but after fellow Yelpaholic Mimi G. told me \"You HAVE to go!\" I figured, I'd better go!\n\n  Like someone else said, the place is kind of a dive. The young waiter with bleached, gelled hair and puffy red-rimmed eyes, took my order with a mouthful of food, grunted at other patrons and carried on loud conversations on his cell phone and with his friends in the front of the house. Before I got my food I heard him bark at someone in the back: \"We'll serve that! We don't throw anything out!\" That's the kinda place this is. Just so you know.\n\n  I ordered the half rabbit and fries. I was told the rabbit takes 25 minutes, so I had a cup of the split pea soup while I waited. I'm pretty sure it came straight from a can, but then again, I didn't really come here to eat soup. Bring on Thumper!\n\n  I have to say it was well worth the wait. Marinated in red pepper and herbs, served with lemon wedges, it was juicy and delicious. The fries were superb; thick-cut steak fries, super-crispy on the outside and nice and fluffy on the inside. Skip the ketchup, salt and parmesan cheese are all I need.\n\n Served in true Italian style, everything is in courses, just like every other place on the strip. Everything is ala carte. It kinda sucks from my wallet's standpoint, but it is the authentic way to serve Italian food. So for those who complain that it's just meat on a plate, that's right it is. Exactly the way a real Italian would expect it.\n\n  That wasn't exactly the cheapest thing on the menu, but if you are craving rabbit, theirs will do the trick. Next time I'll have to give the chicken a shot.\n\n  Thanks Mimi G.! I owe ya one!", "author": "Thomas S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-03", "description": "Best grilled chicken in San Francisco. The steak and lamb chop are also delicious, as well as the spicy sausages. Be sure to ask for the hot sauce and chimichurri when you go. A great favorite of ours, we go several times a month. No frills, but the little they have on their menu they do quite well.", "author": "Megan W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2006-10-29", "description": "Go here if you want:\r\n\r\n-heated chicken on a plate(that's it, just plain chcken and a plate)\r\n\r\n-side dish of fries\r\n\r\nNot a big deal.  They will also kill a rabbit and heat him/her up too. \r\nNo sauces. Dry meal.  I ate at a similar place in miami with the only difference being in the sauce.  The miami spot had 6 or 7 sauces to complement the chicken corpses.\r\n\r\nBad choice for vegetarians or vegans, unless you want another meal of some lame salad and fries.", "author": "Jeremy P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-03-22", "description": "Been eating at Il Pollaio for 20 years. Dad, whom ran the place, is now retired, and the son is there to ensure that the quality of food and service lives on.\nThere's only a few items on the menu, chicken, sausage, lamb, pork and beef-all reasonably priced and deliciously cooked on the grill.\nIf there's more than one of you, someone get the \"steak\" fries, while the other order the combo side salad and share. \nIf you have a hankering for amazing chicken, save yourself a trip to Zuni, go to Il Pollaio, and still have money left over for dessert and a flick.", "author": "Mr. S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-07-22", "description": "Some damn good char-broiled chicken. \nThere are many reasons to go to this small, but cozy establishment:\n1) tender, fresh chicken\n2) hot french fries\n3) good, friendly service\n4) the hamburger is damn good as well\n5) its NOT one of the many tourist traps on Columbus\n\nNote: If the thought of pulling the meat off of the ribcage and other bones of the half/whole chicken makes you sick, don't order the chicken...", "author": "Nicolas H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-09-29", "description": "Best Fing chicken I've had in a long time. I ordered a ton of food and proceeded to slam down 1/2 a chicken in about...5 minutes flat. Damn that was TASTY! Will certainly be back for more...this is a little hidden gem of North Beach amongst the crazy Italian places.\n\nOh, and the sides are super-yummy too! Marinated eggplant and roasted peppers...mmm...\n\nDig on the chicken.", "author": "Diane S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-19", "description": "Love it! Good food, good service, great takeout.  SO GOOD! YUM!", "author": "Yaqyaq C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-07-29", "description": "The chicken place.\nThey have rabbit too.\nThere's not a lot wrong with this place either.\nSure, old school place that specializes in chicken and rabbit.", "author": "Kev M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-12-22", "description": "Great change from all the Italian eateries in North Beach. Chicken was good but there wasnt anything special or unique about it. I can probably make better rotisserie chicken at home by adding more spices", "author": "Jeffrey B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-01-10", "description": "This is real North Beach. \n\nLet the tourists go to the fake Italian joint next door. \n\nTry the Rabbit with the 3 bean salad and it will change your life (for the better). \n\nPrices are very reasonable (very important in my rating system)", "author": "forrest l."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-02-04", "description": "I love Italian-Argentinian food and I believe because there is not as much cream/milk that it is WAY healthier than Italian-American food which is normally really heavy.  The chicken is moist, charred, and crispy and before eating here I never knew chicken could be all three! Even the rabbit here is so Yummy! It is also budget friendly in terms of the pricing, but it is NOT fancy - so if you are looking for that move along...\n\nGood Food at Good Prices (especially considering this is in the middle of tourist trap central).\n\nAlso it's near the city owned garage near the cop shop.", "author": "Valerie F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-07-06", "description": "No nonsense kind of place. Basic menu but everything is absolutely incredible. There are not enough words to describe their chicken. Crispy skin, perfectly spiced, tender tender tender.\n\nThree of us had a couple cold beers, chicken, french fries and salads and it was under 50 bucks.\n\nI wish there was one on our side of town, I'd be there weekly!", "author": "Melissa J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-09-21", "description": "Had the rabbit special, Yummy! It did taste like chicken, Really!  Also the steamed potatoes are delicious. Very small place not meant for large parties.", "author": "Cam Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-06-06", "description": "We were wanting a semi-healthy meal after a couple weeks of decadence, so we decided to try out this place after having walked by several times in the past and seeing it busy.  If it couldn't take us, we were going to go to Sotto Mare (totally different genre, but oh-so-yummy ).  But , alas, for good or bad they were able to seat us about 10 minutes later.  \n\nThe service was friendly, but the food wasn't astounding to us.  Two of us ordered and split a  whole chicken, and I was so sad to find only one thigh (since that's my fave piece), and it hadn't been replaced by anything either.  They did bring one over another thigh when I asked about it, but that's just sort of weird to randomly remove pieces when someone has bought a whole something.  Further, the chicken was overcooked and wasn't as juicy and succulent as we'd hoped based on other reviews here.  My litmus test of sorts is that I want something I eat at a restaurant better than what I can make at home, and this didn't pass the test..  \n\nOh, also, we had a salad to start, as well as the grilled eggplant, and thought they were both just OK.  \n\nMeh, next time we'll stick with Sotto Mare!", "author": "Kimberly Q."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-03-09", "description": "Great place for meat lovers!\n\nI'm not a big fan of chicken, but decided to try this place out after my roommate grabbed some take out the other day.\n\nOMG... so good!  The skin (a part which I rarely eat) is so tasty and crispy!  You would think if you're getting that on the outside, there's no way it can still stay juicy and moist on the inside right?  But boy, was I wrong!\n\nOn top of this, the place has great service!  The staff is very friendly, and loves to joke.  Our server left the bottle of wine after he poured my glass, and when he came back to pick it up, I decided to joke around and said that he should definitely top me off again before he goes!  He smirks and actually does it.  How cool is that?\n\nMy party also had the fries, sausage and the rib eye.  The rib eye was good, but why would you pick anything else besides the chicken?!\n\nOh, and did I mention the prices? Half a chicken with fries for close to $10!  You can't beat that!", "author": "Maggie L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-01-24", "description": "Yes, the chicken was excellent.  I'd say that the chicken actually rivals Zuni's chicken for half the price.  But, I'll say the same thing I said about Zuni: it's still just chicken.  I honestly think that a hot, fully cooked chicken from a supermarket like Albertsons is almost as good.\n\nThe fries (fat steak fries) were okay, and the roasted peppers sat in olive oil with some spices and were passable.  \n\nThis is a great place for a decently cheap meal when you want some chicken and comfort in North Beach.\n\nP.S. - as far as chicken goes, I wish the Zankou chain in LA would open a spot up here in SF.  Now, *that* is great chicken plus so much more!", "author": "Brian W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-19", "description": "Glow's\n\n*The chicken was yummy, crispy skin and tender meat\n*Quick service\n*Relaxed setting \n*Simple and to the point menu\n*Two sides, one cup of soup, one whole chicken, bread, two ice teas = $33\n\nGrow's\n* If you are looking for more than chicken this isnt the place for you\n\nNB=two people do not need a whole chicken! Maybe if they are big", "author": "Alexandrea R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-10-13", "description": "Been coming here for years.  Parking is hit and miss depending on what's happening in the neighborhood.  I usually come by weekday nights for better parking and less of a wait.\n\nI always order the chicken, eggplant, and combination salad.  We always eat family style so that we can try different things.  The steak is good.  Their big steak fries are the best and always hot!  The rabbit and hamburger are both good.  Wine and/or bubbly water tops off the meal!\n\nService is always friendly and efficient!  Lots of regulars considering location in a tourist area!  Check it out especially if you are a meat eater!!!  Great for families!", "author": "Ray Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-04-21", "description": "If you love chicken, you'll enjoy Il Pollaio.  If you are adventurous...try the rabbit!  The food here is solid, but a little on the pricey side (for a simple grilled chicken dish).  I had grilled chicken of some variety.  Not mind blowing, but still tasty and filling.  Didn't make a huge impression on me because I went once, and I haven't been back.  I feel like there are lots of places in the city to get yummy chicken dishes.  So Il Pollaio is definitely doing something right here, but they aren't doing anything that I haven't seen at other restaurants throughout San Francisco.  Ambiance is very relaxed, nothing fancy, and the seating area is kinda crammed.  I may go back in the future if I happen to be in the neighborhood - I'd like to give the chicken sandwich a try.", "author": "Jenna C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-01-28", "description": "I'm sorry it took me so long to discover them.  The small seating area has made it crowded every time I had tried in the past, but this time I went  around 2pm on a Saturday (still had to wait a little) and I could tell it would be good just from the smells.  The 1/2 grilled chicken could not be any tastier than they do it.  Excellent seasonings.  Fries were pretty good.  With bottle of Perino, $15.  If you can get a seat, try it out when in a chicken mood, or simply get a whole chicken to take home.", "author": "Marc S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-30", "description": "Best take-out or quick eat-in chicken in San Francisco. You're not going for the ambiance. It's a somewhat higher-end version of the chicken grill places you see in NYC, where there's a giant grill in the window with 30 chickens splayed across it in various stages of browning. Il Pollaio also has a giant grill in the middle of place. Which makes it terrible for dates. But great for low-key nights with long-term girlfriends.", "author": "Matt G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-06-16", "description": "Hmm, unlike the other reviewers, I found the famous chicken to be not just a little dry, but quite dry and not all that flavorful.  The skin was quite crispy and even chewy.  I would have rated the place and the chicken as slightly above average, but I went with a large group and they raved about their food.  It seems like my dish was the worst.  Theirs certainly looked better.  I should have gotten the rabbit but since this place is known for chicken, I figured that was the dish to get.\n\nThe lamb chops looked juicy and they give you a huge plate of them.  Mom said they used the cheaper cut (fattier) but that they were really good, like the ones her mom used to cook.  She also said the accompanying potatoes were great.\n\nThough my chicken was dry, I liked the concept of the place.  Not fancy food, but good, homestyle grilled meat with your choice of salad or fries.  And the portions are generous.  They have a selection of wines to choose from as well.\n\nThe server was great, very accommodating.  Seems like you can have a cup of soup instead of the salad or fries if you ask.  It's nice that you can choose from 4 or 5 different side salads too.  \n\nVery helpful tip: most of the tables are for 2 - 4 people, so try not to come with a large group.  If you have more than 6 people in your party, I don't see how you can sit together.", "author": "Lolia S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-02-10", "description": "Il Pollaio's chicken possesses such a narcotic quality one friend actually speculated as to whether they \"put crack in it.\" On a block of ever changing Italian bistros, pretty foreign girl greeters crooning for your business, small town hipsters, drunk kids and wandering tourists, this place is the real deal. Order the half chicken, combination salad, half liter of house red (and if you're decidedly famished, the thick cut fries) and watch the passing foot traffic on Columbus Avenue. \n\nThe chops and steaks come in ample portions as well, and while not always the most tender cuts they fill the plate and stomach nicely. Il Pollaio is also a great spot for the solo diner, particularly if you procure one of the coveted window seats where you can sit, dine, and imagine a North Beach of days gone past .. completely and happily devoid of the latest overpriced pasta bistro in the old Columbus and Broadway Burger King location. Have an Irish Coffee or an Anchor after at Specs or Vesuvios and return home or to your hotel knowing you did North Beach right.", "author": "R M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-06-26", "description": "Oooookay, when you go, ORDER CHICKEN! The rabbit is dry and lean. The ribeye is decent. The salads are great! We smelled chicken a block away, went to a chicken place, and we should have ordered chicken!", "author": "Stephanie H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-01-31", "description": "You'll need to go with someone. The portions are huge. You can get the best value ribeye steak in town for $16, plus it comes with a very large salad or fries. The only time I finished everything on my plate by myself was at the end of the North Beach Beer and Oyster festival, after I had already walked into a tree.\n\nI sometimes call in a half chicken and pick it up on the way home.\nDon't get me wrong, the salad is nothing special, the fries are good not great, but if it gets cooked with flames, they know what they are doing. Great value and a great alternative to pizza when you need to feed people fast.\n\nNothing special on the inside, never take a vegetarian here, but they way I see it, it's superior canteen food at canteen prices and that's a sorely under exploited market niche in San Francisco. I can't give any place where they mop the floor while you eat 5 stars, but it's great value for money.", "author": "Ali N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-04-09", "description": "This place served probably the best chicken I've ever had. With that in mind...\n\n1. the chicken is grilled with nice seasoning and spices. I don't usually eat the skin, but I made an exception since it contained most of the seasoning. If you must have sauce in your chicken (like buffalo wings), don't bother going there.\n\n2. beware the bell peppers are cold! I'd stick with the potatoes and olive oil, which are very simple and do not steal the taste away from the chicken.\n\nI plan on going back there =).", "author": "Quarup B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-08-27", "description": "Il Pollaio have one of the best roasted chicken around.  El Pollo Loco is no comparison.  I've never had rabbit and tried it for the first time.  Even that was very delicious n cooked just right n not gamy.   It's a small restaurant so get there early.", "author": "May Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-11-04", "description": "Ive eaten here about 50 times! BEST GRILLED CHICKEN HANDS DOWN PERIOD.", "author": "Nader F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-08-21", "description": "Really good chicken. Tender--flavorful--juicy. Good value.\n\nI usually order for take-out, as the atmosphere isn't anything special. A whole chicken lasts me for two or three meals. Looking forward to trying the rabbit and some of the sides.", "author": "Katy D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-04-06", "description": "I had been wanting to go here forever...and a day.  When I finally went, I was impressed by the quality of the chicken - the seasoning and crispy skin had me sold on this place. \nThe fries were delicious too!  \n\nFor being in North Beach and being served cold, hard butter with my cold bread, I was disappointed to have to ask for olive oil but they did have it so that was a plus.  Other than that, it was great!  I'll be back.", "author": "Lauren C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-07-09", "description": "Not the best on Columbus but certainly really, really good and really, really reasonable.  \n\nThe menu is simple and to the point.  I have never come out of this place without being pleasantly full.  The only thing I haven't tried is the rabbit, probably because I just couldn't eat Bugs!\n\nThis is a full meal, with all the sides and while it is basic it is so well prepared that it is unique.  \n\nA real neighborhood place, nothing at all fancy but what they saved on the decor they more than make up on quality.\n\nTry this and you won't be disappointed.  Be aware - this is a cash only place, but so reasonable it isn't a burden.", "author": "Stitch H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-08-16", "description": "IL Pallaio at 555 Columbus Ave is at the heart of North Beach right off Washington Square. This has one of the best dinner deals in the entire neighborhood. \n\nThe roasted chicken is DELICIOUS! And, for two people with the house salad and a glass of house red wine it was about $15.00 per person. \n\nThe roasted whole chicken is enough to share for two people and the flavor is outstanding. Seasoning is simple, just salt, pepper, some olive oil and a bit of rosemary. Yummy! \n\nSalad serving for one is also enough for two to share. Simple greens with tomatoes and radishes. Fresh ground pepper is offered. Salad has a selection of dressings, such as blue cheese, Thousand Island, Italian or just plain oil and vinegar. \n\nHouse red is a good wine, perfect with the dinner. IL Pollaio has a selection of wines, but the house wine is the most economical if on a budget. \n\nI have not been in North Beach for a while so this was really a treat. IL Pollaio is a simple down to earth place. Staff is friendly and service is good. \n\nPlace is small and can get busy. But it has sidewalk views, that allows one to take in the North Beach atmosphere and vibe. \n\nI like to sit next to the windows because it is almost like sitting outside. On a warm evening it can be charming. \n\nThe home fries and sausage is good too. Yet the roasted chicken is the best. This is not a fancy place and there are no fancy upscale amenities. It is really simple and at an affordable price. I think you can get a good meal for an affordable and reasonable price.", "author": "Jonathan F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-05-11", "description": "Pretty good restaurant.  Food was good and service was quick, no complaints.  I'd go again.  \n\nIt probably gets an extra star because its in North Beach (not my favorite area of SF for restaurants).  If im in the area though, and looking for an affordable, delicious dinner, this would be on my short list.", "author": "Avi W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-03-22", "description": "Hands down the best restaurant (pound for pound) in north beach.  The chicken is as people say, crispy, flavorful, and a too good to be true $13... for the entire chicken.\n\nThe fries are good, but over priced at $5.50.  Over all, the chicken, the price and the I-don't-care-about-image-just-good-food attitude earns Il Pollaio a 5 star.", "author": "James B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-17", "description": "Don't expect this place to be fancy just because it's in North Beach. If you crave roasted chicken, it's a must-try. It's a simple, casual, quaint, and friendly place. Usually packed too.", "author": "Chihee K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-03-22", "description": "Eating here took me back to being in Italy! The decor is unpretentious and the food is tasty and affordable. I ordered the half chicken and salad which hit the spot, but I think I would have liked it more if the chicken hadn't been cut up into pieces already. \n\nMy boyfriend ordered steak fries and we could barely get through a small plate of them because the portion was so generous! I am a sucker for good fries and I will certainly order those for myself the next time I'm there.", "author": "lindsay w."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-15", "description": "Dont let the cramped quarters and shall i say \"interesting\" decor fool you, the service here is outstanding and the food is as well. I had the rib-eye and my co-worker had the chicken. both were awesome. I'll definitely be back.", "author": "Blaine B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-09-01", "description": "Their Pea Soup is UNBELIEVABLE! i've never even sat down and order here, but every Monday and Tuesday they make Pea Soup and get it EVERY MON. and Tues. it's awesome. soooo goood. My roommate is totally stoked on the chicken they cook their too.", "author": "Danny S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-04-04", "description": "Best damn breast in SF\n\n Family run  buz.\nsausage sandwich roxoz\nlove the BBQ sauce\ngreat service, You'll see people that have been eating there for like 50 yrs that live in North Beach", "author": "INzane Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-16", "description": "These guys can grill chicken like no one else. Seasoned with just the right amount, not overly done with garlic and rosemary. It is moist, but not underdone, I'm not a fan of pink flesh when it comes to chicken and the skin perfectly crisp. French fries are large cut, crisp on the outside and moist and fluffy on the inside. The mixed green salad with beans are served chilled and the lettuce is crisp and fresh. My husband takes to the lamb and a cold beer. The price is nice. \n\nAtmosphere and attire: friendly, casual and go in your comfys. We don't hesitate to take a drive from the East Bay and find parking for some delicioso Pollaio. We like to take it to go and chow down under the Golden Gate Bridge.", "author": "Chris O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-05-05", "description": "What u see is what you get here. Great grilled chicken & rabbit. Tried the egg plant..very good. Spicy sausage...very good. Prices reasonable, service good, everyone quite nice and the North Beach ambiance can't be beat.  We're becoming regulars here and for good reason. Grab a window seat, enjoy the food and watch the world go by!", "author": "john h."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-12-16", "description": "Talk about some good chicken! What's even better was that I went with my friend who likes dark meat and this works out for me because I love white meat  -- So no conflict of interest here :)", "author": "Helen Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-06-29", "description": "Nice crispy latin flavored chicken in North Beach.", "author": "Jim J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-07-09", "description": "Best chicken sandwich in the entire city. Hands down, no question. \n\nSkip the overpriced, watered down Italian eateries of North Beach and go here instead. You won't regret it.", "author": "Jeska D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-08-14", "description": "I fell in love in San Francisco...with a teeny tiny chicken restaurant.\nSalad was aight, but the chicken was moist and tender and very flavourful. potatoes were soft and sitting in a nice shallow pond of olive oil - perfect for bread dipping. My wine glass was very full. We had a window seat and overall had a great experience. Can't beat a $25 meal as good as that one was. the wait can be a bit long and the place closes at 9, but its worth it.\n\nDamnation I'm \"supposed\" to be a vegetarian now...this is one place I will really really miss.", "author": "Amy K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-10-15", "description": "I love this place! \n\nThis is the kinda place that should be on everyone's \"regular\" list.  Not because this place is regular!  Because you should go here on a regular basis.  Though I'm happy that it isn't for most people.  \n\nAnyway, the menu is super-simple.  Just order the chicken, a salad and some fries.  Maybe a bottle of wine and you're good-to-go.  The food will be delicious, the bill will be low and the stomach will be happy.  \n\nSeriously, what else do you want?\n\nOh yeah, plan to meet some interesting local characters while you eat at one of the closely spaced tables.  Always entertaining!", "author": "Raymond F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-06-06", "description": "A restaurant that boasted home-style argentinian grilled yumminess, Il Pollaio means \"chicken coop\" so guess what their specialty is? We ordered a whole chicken, lampchops, porkchops and grilled onions, AND hot sausages. The portions weren't huge and we wanted to get the full variety of what the restaurant had to offer. \n\nThe chicken tasted very home-y. iono, what could i say? I liked it. I always love chicken. With some pepper and lemon, chicken is always a winner. The sausages were REALLY good too. They were perfect actually. So were the lambchops. Grilled with not a ton of seasoning, it tasted like home. Porkchops were TOUGH AS HELL. BOOOOOO. Don't order them if you ever go. I had to spit out a couple of pieces that just weren't worth to chew through.", "author": "Angela Q."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-04-09", "description": "I woke up this morning craving chicken from Il Pollaio. My coworker and I used to come here all the time for lunch. We would always order super spicy sausage, whole chicken, fries, and aranciata (my second fave soft drink next to Orangina).  Sometimes I order the grill chicken breast burger without the bread though. I know that sounds weird, but trust me it won't sound weird to the waiter if you make that request. They were the ones that suggested it the first time I had it. \n\nI usually never order chicken when I eat out because I'm scared that it might come out dry, but not at Il Pollaio. The chicken always comes out  moist and tender, with just the right amount of crisp in the skin. I don't know what they season they're chicken with, but it's damn good.  \n\nI think the staff is pretty friendly (they do look kinda mean sometimes), but at least they're always nice to me when I eat there. The food comes out pretty quickly too.", "author": "Rennie C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-07-18", "description": "I like chicken\nIts delicious, you can cook it in any number of ways\nHowever\nI seldom find an excuse to order it in a restaurant unless it's a part of a dish (think chicken marsala, general tso's chicken, etc).\nI went here with a friend who lives nearby, and he ordered a chicken for us to share\nA chicken to share? Preposterous! Said I\nNo chicken can satisfy this east coast appetite\nWas a wrong? You betcha!\nWe got the chicken and a plate of mamas steamed potatoes with olive oil.\nThe chicken was stupendous, so fresh it was still clucking, soft, tender, melt in your mouth good, the potatoes were soft and buttery and the ice tea tasted like iced tea.", "author": "Ross G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-04-08", "description": "The best meal I had when I was in Italy was simple roasted chicken and French fries.  The chicken was to die for and the fries were the best I'd ever had in my life.\n\nEnter my friend and I in North Beach looking for dinner.  We walked by this place and on someone's table I saw fantastic-looking chicken and a huge plate of fries.  Bingo.\n\nWe split a whole chicken and a large order of fries.  The chicken was everything I hoped it would be and more, easily some of the best I've ever had.  The white meat was a bit dry, but not very much.  The skin was crispy and delicious.  I only eat chicken skin when it's really good, and this was really good.  The fries, while not bad, weren't the incredible experience I was hoping for.  If chicken is what you want, this is the place.", "author": "Alex F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-04-22", "description": "was looking for a place to eat in this neighborhood and my friends and i decided to check this place out mostly because a few of us wanted to eat some rabbit.  the restaurant itself is small but cozy.  \ni ordered the chicken and combination salad, since chicken seems to be their thing.  the portion for the salad was very generous.  i couldn't even finish it.  and i actually thought it was pretty good.  the chicken, on the other hand, was a disappointment.  the skin of it was good, but once i got past that, it seemed a bit dry for me.  one of my friends ordered the chicken sandwich and let me say this - that thing was HUGE.  she couldn't even fit it in her mouth!  don't know how it tasted though...", "author": "Vanessa C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-11-11", "description": "3.5 Stars.\n\nOK, I've lived in North Beach for about 10 years and go to Il Pollaio about once every 2 years.  The place has good chicken, a good burger served on french bread, and always has good soup.  The food is good.  However, the food is not great.  \n\nAdditionally the service is also good.  Not fast, not slow, not overly attentive... very much like the service in Europe or South America.  For example, I waited my entire meal to get my glass of water refilled.  I wasn't frustrated or angry.  Actually I was more entertained by the waitress who seemed to be easily distracted, and at the same time, very good natured.\n\nBottom line: Good food and good service at a good price.", "author": "Marc H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-07", "description": "my favorite restaurant in the city. no frills, wonderful staff, great people watching from the window tables and the chicken - simple, tasty, lovely. one of these days i'll try the sandwich that everyone raves about.\n\ni'd give them five stars if they'd stay open later for us folks that dine late.and i wish they serve other veggies besides salad.", "author": "winelips o."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-01-16", "description": "Why does it say \"Latin American\" as food-type? Isn't it enough that the name of the restaurant is Italian? \n\nWhatever. Anyway, I HEART THIS PLACE! \n\nI especially heart the bean salad with extra dressing, the fries, and the sausage. Mi piacciano salsiccia italiana.\n\nI have family that lives down the street and we've been going here for years. The wait staff is BENISSIMO!", "author": "Patricia E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-07-30", "description": "GREAT chicken...some of the best chicken I've ever had. It's cheap and great to go. \n\nAlso, try the marinated eggplant, it's pretty yummy!", "author": "Rose K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-08", "description": "Solid, affordable takeout chicken in North Beach.", "author": "Zac A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-01-24", "description": "I lived in the area for over 7 years and ate at Il Pollaio once a week.  The food is fresh, delicious and reasonably priced.  You can get a healthy meal here that feels like home cooking and the staff is very friendly.  I recently moved out of the city and one of the things I miss most is Il Pollaio.", "author": "Gabriella K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-04-16", "description": "Wow. First of all any restaurant that puts the kitchen right out front is making a statement.  We got the pork chops and the rabbit.  This was the first time I have ever had rabbit and it was so delicious.  This is the best place we ate the whole week in San Francisco.  We almost walked right past as there are so many places to eat in the area.  Get the rabbit, don't be afraid. Just do it. The only drawback is the place is pretty small so it will fill up quickly.", "author": "Jerad D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-16", "description": "I eat here every time I go to SF, usually 4 or 5 times over the course of a few months.\n\nAlways consistent, never wavering: perfect grilled chicken with the magical crispy skin.  I dunno how they do it, but it's the same simple perfection every time.\n\nMaybe the best french fries in the City.  Again, always the same, crispy, hot, and screaming for salt and ketchup.\n\nCombo salads are again simple and great.\n\nI see reviewers here complaining about 2 things: food other than the chicken, and the close quarters.  Yes, the place is small.  So what, lose yourself in the food and some conversation.  As for the food other than the chicken, I have no opinion as I've never ordered anything other than the chicken.  My friend once ordered a burger.  Looked amazing and huge.  But why waver when the chicken is so perfect.  Order the chicken, you can't go wrong.\n\nService is friendly and hands off.\n\nTrust me, there's a reason why a line forms in the evening.", "author": "Frank M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-03-26", "description": "This is great, if you like a chicken sandwich, I've never had a better one, anywhere on four continents.  From when I lived in San Francisco years ago to when I fly in for a conference or business, I always go religiously and bring friends.  Great, great, great little place.  No frills, friendly, great chicken, very modest price, this is  a great hole in the wall place.  I've rushed out of conferences at the Moscone center on an hour lunch break just to go and inhale a chicken sandwich here and felt satisfied the whole day for around $10.  Bread, drink, salad, sandwich all for less than $15.\nGreat place, and I've always been treated well.\nThis place is the BOMB.", "author": "Andre G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-01", "description": "Great place, great chicken.  Simple, tasty food, easy location.\n\nLove the service - that one kid who zooms between speaking english, italian, and spanish, and is always really nice but never tooo nice, like he's there to help you but he's there to run the show, too - he is awesome.", "author": "Keane N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-07-04", "description": "I've been eating here for years, so I thought I'd add my voice to the many reviews here. My friends and I refer to this place lovingly, as \"il polio\". Yeah, I know, it's not all that attractive as far as nicknames are concerned.\n\nWhen I first ate here it was run by Mom & Pop from Argentina. I think that may have been around 1986. My memories are a bit cloudy, but I swear the chicken tasted better then. Nonetheless, it has now been handed down to their kids, and the son does a great job of holding down the fort. They have kept to what they do best, namely chicken on the parilla, or grill. \n\nThe chicken is truly delectable. But I also love the soups here. I swear by the minestrone, split-pea and lentil soups. The soups taste like Grandma made them. They are the perfect hangover cure. They also cook up a perfect skirt stake with chimichurri sauce. I usually get the boiled potatoes over fries, since I am a chip connoisseur, and their chips (fries) are of the frozen variety. Order a glass of Argentine wine, and have a flan for desert. You will not be disappointed.", "author": "Geoffrey B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-07-14", "description": "Was heading for a show in north beach and was recommended this place by a friend to meet for dinner. Oh MY! We had\n\nA whole chicken\nLamb Chops\nHalf a rabbit\nHamburger\nFries\nSalad\nMinestrone Soup\n\nSo it was 6 of us and it only came out to $15 per person including tip! Great place to bring meat lovers or those on a no/low carb diet. Don't get me wrong, the chicken is fabulous... but the lamb chops... oh my,, super yummo and don't forget to order a side of fries (or maybe two :) . Comes out piping hot and thickly cut- brits would call them true chips. Rabbit was a little on the game-ier side, perhaps i'm used to the farmer's market variety- but tasty nonetheless. Skip the headache in trying to figure out which restaurant is the least touristy and head over here for your dinner.", "author": "Len K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-07-10", "description": "Good, honest, simple food.  The chicken is tasty and crispy and the boiled potatoes are firm, not mushy.", "author": "David H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-07-11", "description": "You wouldn't think any restaurant on Columbus is very good after eating at many of them myself and as a North Beach neighbor- usually I like the restaurants off the beaten path. \n\nWord-of-mouth said I should try their chicken and OOOOOOOHHHHH! SOOO GOOD! Chicken is moist inside, crispy, delicious skin- you keep wanting more. Also try their mixed salad- greens, beans, carrots, all kinds of good stuff. I'm not a huge salad fan but l LOVE this one!\n\nFair prices, GREAT FOOD, easy location, and staff is always friendly. If there are kids dining there, they always seems to be well-behaved. Also during high tourist season- mostly locals. That's when you know it's good! I get take-out prob once a week!!!\n\nDefinitely GO!", "author": "Elizabeth H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-11-30", "description": "We have been bringing our family here well over 15 years. Everyone has their favorites, chicken, rabbit, combo salad, and they make a great burger and the best fries ever. You may have to wait for a table, but worth it.", "author": "Lucy V."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-02-04", "description": "Their famous chicken was decent. It wasn't as tender or juicy as everyone said it was but the skin was really flavorful and crispy. I expected more from their combination salad but I didn't think it was that special. The fries were huge! The place isn't that big and all tables seem to be for ~4 people so it's not ideal for group parties.", "author": "Tina T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-05-12", "description": "I used to live in North Beach and would eat here all the time.  I highly recommend the chicken sandwich & three-bean salad!  \n\nI believe it's family-owned.  And they are soooooooooo nice & friendly!  They always remembered me.\n\nI'm getting hungry just thinking about the food...", "author": "Jen N."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-11-27", "description": "very disappointing\n\nnice staff and a good local cafe vibe, but the food was very average\n\ndry flavorless chicken, ok big fat chips, bulk standard salad\n\nif you're going to specialise in something like grilled chicken it should burst with flavor, this i wouldn't have served to friends at home\n\na pity", "author": "Dan B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-04-11", "description": "Entrees were tasty, but after sampling other restaurants around town,  the entire Il Pollaio experience paled a bit by comparison. It's not a bad place, by any means. I'll give it three stars. A-OK.  It's just a simple operation where the in-dining option, at least during our off peak visit, bordered on an afterthought. And  maybe my expectations were set too high anyway, after seeing this place on Bourdain's show. \n\nI'm basically on board with the food raves.  The venerable chicken and sausage were both deelish and prices are reasonable for the area.  I guess my issue, if you can call it that, has to do with certain aspects of the sit down experience.\n\nThis is really more of a take out place.  The menu and seating are both quite limited. Soft drinks are served at table in unopened cans. Service was polite but slow, even though the restaurant was almost empty. The condiment for my sausage plate was generic yellow mustard. Very basic sides, like fries and cole slaw, arrive well before your meal, not with it, so entrees seem relatively naked. They dont take American Express.     \n\nMeat's well prepared but this isnt really dining.  We had a flavorful meal, but later in the week had a better experience at Cancun on Mission, with comparable service and atmosphere, and eats just as good, for half the price.", "author": "Matt S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-02-28", "description": "I love this place. It's one of my favorite restaurants in the city and I've been to a lot of restaurants at this point! I love their simplicity, their freshness, and you get a level of consistency here that cannot be matched. Yesterday I tried their half grilled rabbit for the first time which was great, but we also ordered a whole chicken and a salad. Between the two of us we demolished everything, went dancing, and still ate a slice pizza in the Castro. Yes!", "author": "M M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-04-20", "description": "I especially enjoy living and eating at this favorite local HOT Spot!  I always order the boiled potatoes and the combination salad is amazing, I should suggest the soups and half chicken, its the BOMB!! You will never be disappointed goiong here. The long and short of it, North Beach is better than just italian food and this is a perfect example!", "author": "Natalee T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-01-28", "description": "Super tender, juicy, flavorful chicken!! On top of that, they taste fresh and hormone-less, unlike foster farm! We also had the grilled eggplant, it was ok, but that wasn't the focus at II Pollaio. I was told that the Italian sausage is a must try too, next time, next time...", "author": "Kai Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-01-14", "description": "The chicken here is exceptionally good - some of the best I've ever had!  I know they have other things on their menu but being the one-dimensional eater I am, when I find something this good at a restaurant, it's extremely difficult to get me to try anything else.  (And why bother?  Their chicken is that good!)\n\nIf you love chicken, you've got to check out Il Pollaio.", "author": "David B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-03-08", "description": "Best grilled chicken and sausages EVER at surprisingly delightful price! This is a perfect place for carb lovers and carb conscious can dine together happily. Get a whole chicken and share with friends. My low carb husband and I get 1/2 chicken, sausages, and salad. I wish we could eat here more often. As with all other North Beach destinations, free parking requires an insane amount of patience and luck.", "author": "Su K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-04-15", "description": "Greatest place on Earth! The Chicken and combination salad will change your life. They need a better wine selection, but still 5 stars!", "author": "Bryan S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-23", "description": "We ate at Il Pollaio this evening and enjoyed an absolutely scrumptious meal! Visiting San Fransisco for only 4 nights and craving a chicken dinner, found the restaurant on this site & really glad we did. It's got a \"local neighborhood favorite\" feeling about it and the food speaks for itself. Two of us shared a whole char-grilled chicken, hot & fresh off the grill served with lemon wedges and with sides of a garden salad and steamed whole potatoes with fresh parsley and olive oil. My husband doesn't like potatoes that much but he ordered a 2nd serve, they were so good. The chicken was crispy skinned and we polished off the whole meal (plus a beer for him & a Chardonnay for me) with gusto! At $53 for the 2 of us including a 15% tip, was one of our cheapest meals in this city and quite possibly the best! Great night :-)", "author": "Alison H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-08-23", "description": "I have been here quite a few times, and the only thing that I've ordered is the chicken. Nicely prepared chicken with great italian spices (in addition to a wedge of lemon) makes for a great meal. The restaurant itself is pretty small, so it is usually easier to take out and bring it home after work. The chicken is occasionally a tad dry, but you have to expect that at every chicken place once and a while.\n\nPrice is decent too - $13 for a whole chicken and bread. The sides are ok, but the chicken is definitely the highlight of this restaurant.", "author": "A C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-06-30", "description": "We were on vacation in San Fran about a week ago, and i told myself that I have to make time to rate this place...\n\nThe chicken - is not good ---- its FANTASTIC!! Very fresh. The potatoes were actual potatoes not frozen crap. (and we had both the fries and the boiled potatoes). We also had their mixed salad which was a mix of all the salads on the menu.\n\nHonestly, the price was very reasonable for San francisco and you also get alot of food. It's seriously finger-licking good. Even writing this review right now is making me salivate. yum. \n\nIf you're ever in the San Fran area - PLEASE go here!!! It will make your stay!!", "author": "Andreea B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-02-28", "description": "Il pollaio's chicken is excellent as is the food. You get totally stuffed for under $20. However, I would advise anyone to get the food to go. The sit down service royally blows! I went there to sit down and eat on numerous occasions and on every other visit,it took 10 mins just for the server to acknowledge me and it wasn't even busy. The blond Argentinean guy(must be related to the owner)who's the server acts as if there's some place else he'd rather be and begrudgingly serves you when he absolutely has to.  Why don't they just have someone there to wait tables who truly wants to be there and loves what they do?", "author": "Kolohe C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-12-18", "description": "Boring! Boring! Boring!  Great!  No frills restaurant with professional and attentive service.  The chicken was great, and the price is very reasonable.  Grilled chicken their way is so delicious.  The special, half-chicken and house salad, was only $12.50.  They had healthy portions and was very good.  Simple and efficient, timely and delicious.  No gray area here.  It was simply efficient.  I'll be returning to this joint soon.", "author": "Tony L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2005-06-13", "description": "Want a simple meal that is extremely yummy?  Then check out this little hidden gem.  Grilled half a chicken with just the right amount of spices, served with the combo salad that will fill the most veracious eater.  And don't forget to ask for their hot salsa for the chicken.  Their sausages(spicy) and chicken breat are also good picks.  Perfect for a to go meal.", "author": "Steven S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-04-08", "description": "If the chicken was consistent - delicious sometime and dry as a bone others - it would get another star.  Forget about the sides other than the steamed potatoes and French fries when they are freshly made.  I would also add 2 stars if the staff was the least bit welcoming.  It always feels like you are intruding when you open the door to enter - the proprietor without an ounce of goodwill and his tall sidekick doing what she can to top the boss.  Maybe it's all the tourists beating them down.  But as they say get out of the kitchen if you can't stand the heat.", "author": "Larry d."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-05-12", "description": "This place is the bomb! =D\n\nMe and my boyfriend come here every 14th of the month to celebrate our anniversary... They pretty much know what we get. The asian couple that sits at the end next to the window. They probably know that we get into arguments too! ha! \n\nWe always order one whole chicken, eggplants (only when they don't run out), and a Pelligrino Aranciata. \n\nOh yeah, Bread, Butter, and Sugar! It sounds weird so every time I ask for it they think its for my water but then they realize its for my bread.\n \nGood service!", "author": "Real T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-10-04", "description": "Went here last night.  Wasnt sure what to expect but ended up having a \"great\" meal. Chicken was awesome , salad was huge and the soup of the day (split pea) was amazing. Almost got hit by a cab but that is another story.", "author": "Jerry M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2005-12-22", "description": "If you're feeling like chicken tonight, check out Il Polliano. They have the best grilled chicken and their spicy sausages are delicious. A totally casual spot and way healthier than KFC.", "author": "Connie C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-04-07", "description": "Simple and to the point, been coming here my entire life. Purest way of cooking chicken, right off the grill, never dry never dull always perfect. Best place to grab a really healthy dinner for 2 under $30. Salads and sausages along with their steak are bonuses. Service is true North Beach natives, cant go wrong.", "author": "Scott P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-08-26", "description": "This place was alright for me.  The chicken was tasty and I really liked how the sausage was cooked.  I just wasn't impressed by the atmosphere or the service.  If you're looking for no frills and just decent chicken with a clean, crisp flavor, it's worth popping in.", "author": "Christena T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-03-10", "description": "As a local North Beacher, this is one of only 2 or 3 restaurants that I'll go to on Columbus Street.  To put it simply, it's amazing.  I've been coming here for the past 4 years, at least once every two weeks or so, and I've never been disappointed.  Great service too.", "author": "Raja B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-09-16", "description": "For all the hype about Il Pollaio, I found it borrrrring! If it hadn't been so overhyped, I may have liked it. I may have also liked it more if they hadn't made us sit with this weird guy. It's a small place, but you shouldn't have to graze hands with strangers to eat your fries.", "author": "Shannon V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-02-26", "description": "This Argentian joint serves up a small menu showcasing juicy chicken straight from the grill.  Ask for chimi churri (I don't know if I spelled that right) or the red salsa for extra flavor without all the calories.  They're fries are delish.  My favorite side is the large salad--half green, half bean (the cole slaw I can do without) with the red salsa in place of traditional salad dressing.  The waiters are very friendly, so tip well.", "author": "rachel r."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-07-02", "description": "Best Steak in SF. Tender, Juicy, and perfectly seasoned.", "author": "Roland L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-04-10", "description": "Great seasoned chicken and good prices.  The setting is nice too...", "author": "Nat O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2005-08-17", "description": "Some of the best grilled chicken in the city, if not the entire Bay Area. You can get a half or whole chicken to go, or sit down to a no-frills but delicious meal. They're cut down the back and flattened for quick cooking, and the technique crisps the skin without drying out the meat. Spicy house-made sausage and jumbo burgers, along with a trio of basic salads and outstanding fries, make up the rest of the modest menu.", "author": "Gourmet G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-07-27", "description": "Tasty. Tasty. Tasty. Too lazy to cut the chicken off the bone like me? Order the chicken breast sandwich (which comes with fries or a salad) and problem solved. I suggest ordering it without the bread - it is a lot of food with the bread and much more manageable without it. Also - be sure to ask for the spicy salsa. It is made with roasted tomatoes and is a nice addition to the chicken.", "author": "CarOline C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-07-09", "description": "This is the spot for some real good grilled chicken!!! The other meats are also real good too!  If the meat seems dry you can get some fresh made salsa to spice it up!!!!! But U might need to know that in order to get that. The salads are fresh...order the mixed salad. THE SOUPs ARE THE BOMB!!", "author": "Ethan S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-02-08", "description": "This place fills a decided niche: Delicious chicken, good service, generous wine.... yet affordable and casual. It's one of our favorite places to unwind and start an evening out.", "author": "Lise M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-06-03", "description": "Best chicken ever.  Yummy, crispy skin, moist meat--never fails.  I am allergic to eggplant but I power through for the delicious marinated eggplant--it's good enough to put up with an itchy mouth and throat for 2 hours.  I also love the homemade sausage and the salads...especially the three bean-yum!  Good simple food that all can enjoy.", "author": "Jennifer L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-08-01", "description": "This local family owned business is a favorite of mine and everyone I bring to this place. While they are not open late, and have limited seating, if you are one of the lucky few to eat here, you will not be disappointed by the service or the phenomenal food. Its always fresh and delicious. Thank you guys, for being a place that I can always depend on to have a great meal!", "author": "Chris C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-05-08", "description": "OK, I literally joined Yelp so I could rave about this place. Seriously.\n\nMy fiancee and I went to Peru last year and discovered the most amazing chicken we've ever eaten at a smoky little joint called Polleria Toldo. That was last July and we've waxed poetic about it ever since. The chicken was that good.\n\nThen we discovered Il Pollaio, almost by accident when searching for good cheap eats in San Francisco. 4 of us headed down there last night. We ordered two chickens, salad and fries for everyone.\n\nWOW!\n\nThere is little atmosphere to speak of and the presentations are as plain and unpretentious as can be. The salad was a simple affair of perfectly fresh greens. The fries were huge, perfect for holding massive quantities of ketchup and dressing.\n\nBut the chicken... my God, the chicken!\n\nSucculent... juicy... crispy in all the right places... that perfect, mouthwatering blend of saltiness and seasoning that enhanced the meat's natural flavor to what Emeril Lagasse would call \"notches unknown to mankind.\" All cut into convenient chunks for easy devouring. Chunks of grilled perfection on a plate. No sauces, garnishes, etc. to distract from it. Just... quite possibly the world's best chicken.\n\nThe service was prompt and friendly. The owner was charming and engaging, the perfect mix of involvement without being overbearing. Combined with the simple, rustic, delicious food, I can only guess that Gordon Ramsay himself (of \"Kitchen Nightmares\" fame) would wholeheartedly approve. I know I did.\n\nWe received the check before we had a chance to order dessert and the 4 of us split two (huge) slices of almond torte. Having extolled the chicken without the slightest exaggeration, I can say that this almond torte alone makes visiting this restaurant  more than worthwhile. One bite had me reduced to tears of uncontainable bliss.\n\nThen the owner came to pick up the check. We reminded him to add the desserts to the bill and he said \"no problem\". When we received the credit card slip, we discovered that they were on the house. Wow. We would have been ecstatic without this gesture but that just put us over the top.\n\nI cannot recommend Il Pollaio strongly enough and can't wait to back there again... and again... and again.. and--you get the idea!", "author": "Anthony H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-03-09", "description": "BANG! Hitting you with a five star review and I am not doing that for just any spot. This place is fantastic. The chicken is so so tender and moist and crispy, words cannot tell how good this is and for 12.75 for a full chicken or  half chicken and fries for 11. I got the combination salad which is great. The steamed potatoes are pretty good. Olive oil and balsamic with good bread before. Go with someone split a large chicken, large combination salad for under 20$ Great place to start a great night! Enjoy yourself. People were ordering the sausage around me but for first time chicken and then expand the menu.", "author": "peter v."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-07-16", "description": "I took my friend here tonight for his birthday.\n\nWe started with the salads which were good.  The Italian dressing is tasty and the portion size is great.\n\nThe chicken was good tonight but not great.  The leg was moist, but the rest of the thighs were a bit dry.  The seasonings were good.\n\nThe service was a bit slow tonight.  They need to keep a window open because the grill causes your clothes to smell a bit afterwards.\n\nAll of this for $31 with tax and tip.  not bad.", "author": "Brian L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-01-29", "description": "It's true, the chicken was frickin great, but it's called brining and anyone can do it. I enjoyed my experience here, the price was right the food was very good but I have to go three stars because of the super limitted menu. My GF isn't a veggie but close and she couldn't find much to eat here, although she concedes that the roasted pepper side was real tasty.", "author": "M L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-02-11", "description": "the half chicken that my friend and i were sharing was so good, that we simply abandoned the mixed sausage entree and went ahead and ordered another half chicken. the fries were fluffy, crisp and delicious. i cannot wait to go back for more. adkins dieters, rejoice!", "author": "Jenny R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-02-11", "description": "My wife and I stopped in here before going to Cobb's to see Sarah Silverman.  We walked the 4 blocks from our parking spot which took 15 minutes to find, braved the San Francisco monsoon, and I can tell you it was well worth it.  The food isn't anything fancy, it's a big plate of meat (I had the chicken, my wife the lamb) seasoned well, possibly with a side. I would definitely tell people to come here if they are in the neighborhood looking for a good inexpensive meal.  Service was good and the atmosphere homey.", "author": "Jeff R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-07-23", "description": "I have never had chicken so juicy that I didn't need a sauce or whatever to put on it.  This is really something special no wonder it is packed.  I don't know about why the service can be slow though.", "author": "Stevezee C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-05-20", "description": "If I lived near here, I'd eat here once a week. I'd order dark meat ony, if possible. Our waiter was super duper nice and friendly, and service was fast. I ordered the half chicken with fries, and my friend ordered half chicken with salad. The chicken was hot and juicy...dark meat, that is. I'm not a fan of white meat, so the pieces that were white meat were a bit dry and tough. The skin was SO good. Fries were thick slabs of potatoes. Half chicken and fries (or salad) for $10. Great service, great food. I'll be back.", "author": "Carol L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-05-21", "description": "The place is small and extremely hot. Even with the windows open. Possibly due to the fact that the kitchen is in the way fo the restaurant. The tables are close together and the place altogether seems a bit dirty. The service was also pretty down. there is one waitress maning all of the 8 tables there. She frequented the other tables quite often but never came to ours because we were tucked in a hard to reach corner. Then, when we asked her for things, she acted like she didnt want to do them. We had to flag her down after she passed up 3 times and saw our empty plates to ask for our bill. Service is -1. \n\nThe food was alright. The bf got the half chicken which looked really dry and in need of some lemon and hot sauce or something! I went for the chicken sandwich. While my chicken was much better than my bfs, the sandwich was kind of awkward. two huge slices of bread, a big split chicken breast and then lettuce, tomatoes and onions. No sauce and was kind of tasteless. Plus i ate it with only one piece of bread since it was so think. I do give them props though because the vegetables on the sandwich were very fresh which is hard to find at some places. \n\nNeedless to say, we left here vowing to never return.", "author": "Sarah I."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-08-16", "description": "one of the moistest (usually) chickens you will be eating in the bay, or certainly in sf, so for that it gets a solid 5.  for taste, i would say it gets a 3.  don't get me wrong, it's very moist, and very tender, but sort of lacks on the taste aspect, it's just average in that respect.  but the skin being all nice and crispy and tasty, gets it a 5, so let's leave this as a 4.  the fries are crispy and very good.  the eggplan isn't bad, it's just sitting in oil, but has a good taste, but it's hard to compare as a side to the fries.  also, the bread is quite good.\n\nthe service is fast, very fast, and no BS, fast and to the point, exactly what you need.  basically, if you want chicken, come here.  if you don't want chicken, go somewhere else.", "author": "Jason J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-09-11", "description": "Food is simple and cooked well! I have had this recently for a work luncheon that we do often and it is great for large numbers. The chicken and potatoes are awesome!! muyyyyy rico", "author": "Gen O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2005-07-16", "description": "Do you like big hamburgers or chicken?  Then you will love Il Pollaio.  Best french fries in North Beach.  I would recommend getting the Il Pollaio Hamburger and splitting it with someone.  Try to get a window seat so you can people watch.  Best time to go is noon on Saturday or a weekday afternoon.  It's hard to get a seat at night.", "author": "Buddy R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-04-22", "description": "This is our go-to after work spot both for dining in and take out.  It's one of those places you know will always be consistently good and will hit the spot.  The chicken is great, house wine is good and cheap, and the people who work there are friendly.", "author": "Jennifer C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-06-28", "description": "Great place for a simple mid-week dinner.  You must have the chicken. That's what this place is all about.  It's not a fancy place and you smell a bit of bbq but the service is very friendly and the chicken is super tasty.", "author": "Manuela P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-10-20", "description": "Their menu is extremely small, but with that menu they do it well.  What can I say?  It's a small joint in North Beach crammed between a few other restaurants and they serve mostly charbroiled chickens.  The chicken is delicious, they have salads and fries as a side and the price is pretty decent.  I've been there a few times and it's always been a good experience.  The service isn't outstanding, but it's not bad by any means.  It's a must try if you're looking for a good lunch or a simple dinner.", "author": "Anthony T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-01-18", "description": "I've had to downgrade this place.  Last two times, I've had the half chicken and the half rabbit, and they were both too dry.  They still serve the best french fries and minestrone soup of any place - they are amazingly good.  Minestrone is only on Fri and Sat.  Hopefully, they get their meat back on track soon.  Dry chicken is a travesty.", "author": "Justin S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-03-03", "description": "Simple menu: chicken, other meats, soup, salad, and a few sides. Wines, beer, and soda for drinks. Flawless grilled chicken, the seasoned kind that melts off the bone. Great minestrone. A perfect north beach hang out. Pleasent, bright location with window seats. The son of the owner is a waiter, so service is great. If I worked in north beach I'd go for a salad/soup lunch every day. Five stars because it's tasty, easy, healthy, fast, cheap and nice.", "author": "Laura B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-11-20", "description": "Every neighborhood needs a place like this. Good food and honest prices. I only give it 4 stars because, well, its not the top of the pops, but its a good meal. I think the city could use more places like this. We don't need another $20 appetizer that doesn't impress us enough for $20. \n\nThe grilled chicken sprinkled with lemon as if it were fish is delicious. I think its funny that someone else mentioned water service. When eating with gusto here, I need my water re-filled a little more quickly!", "author": "Maria Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-11-02", "description": "To start with, there is a mural of chickens fighting on the wall, which is nice. Take note and order the chicken. The half chicken with combo salad cannot be beat. I eat it at least every other week and have never once, in eight years of eating here, been disappointed.  Great bleepin' chicken!", "author": "John H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-11-13", "description": "Best place for roast chicken in S.F.  All the food is always super fresh and reasonably priced, but the roast chicken is pure perfection.  A really great resturant the locals frequent, the owner and employees are great as well.  The only downside is the small space, you may need to wait for a table at peak times, but it's worth it.", "author": "PaT F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-03-13", "description": "This is the place for Chicken...Crispy slightly blackened skin, melts in your mouth, not tough, not spicy, just goodness. If you feel like being a carnivore, get the spicy sausage on the side. Go for the caraffe of wine..Moderate prices. Mixed green salad and fries are okay. Great bargain in the area...Youll be looking forward to your next visit as soon as you leave the place.  Great weeknight place , get there around 7 pm..\n\nGreat meal for two with adult beverages in under $20.", "author": "S S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-03-31", "description": "\"COCK-A-DOODLE-DOO\" - I gone to chicken heaven! The grilled chicken and steak fries were finger lickin' good! They also serve an excellent seasoned sausage specially made for them across the bay. House salad was nice and crisp, served with garbanzo and red beans. Our waiter was very friendly and attentive even though he and the rest of his co-workers were glued on the tv featuring the futbol game, mexico versus some other team.", "author": "Eunice M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-08-30", "description": "Last night my guy and I went here, as we always do, when we are hungry with no food in the house.\n\nThe food is always good and the chicken really is super, super crispy hot tastyness. Its a locals spot, a no frills kind of place.\n\nLast night though, the guy who usually is grilling the chicken ended up being our server. He had us taste 3 or 4 of their by the glass wines before having us choose our fav and even poured us more on the house to congratulate our marriage. Hes all \"we're not a fancy restaurant but...\" and I got the sense that even though they're not, they really care about the experience of their customers.\n\nIt might be busy and hot in there sometimes, but the people are really nice, attentive and friendly to customers and each other. A Class act with great chicken.", "author": "Lady L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-08-07", "description": "The best. ..just the very best in comfort food. Amazing taste; excellent value. Ocassionally I'll eat in the restaurant, but I love to take it home at least once a week (I like Mondays & Tuesdays for the split pea soup).\n\nThe ONLY negative is that it is closed on Sundays (but this family owned restaurant needs a day of rest).", "author": "Melissa M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-03-13", "description": "This place is completely overrated. Now, the chicken is good, but it's nowhere near to-die-for. I'd gladly eat here again for a simple meal and simple ambiance if I was around that area, but there's so many other choices around there.", "author": "Dat N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2005-11-29", "description": "This is our neighbourhood favorite, hands down - a friendly, not too pricey place that knows what they excel at (roasting yummy animals) and sticks to it.  Oh, that more restraunts in the neighbourhood were like this.... Try the rabbit, it's finger lickin'.", "author": "Taylor S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-10-21", "description": "This is a no-frills type of eatery. The menu is pretty simple, which makes ordering easy ( I hate when you go to a restaurant and they have a ten page menu! And it is a bit frightning when you see burgers one one page and curry on another)  There is a lot to be said for simplicity. Do what you know well and people will always come back for more. The rabbit is unbelievably moist- a rarity because most times that you get it at other places, it tends to be dry. The last time I went, my dining companion and I came right on time to order the last two grilled rabbits. There were some people who got seated right next to us a minute after we ordered and they were so bummed when the waiter told them that they were out, so it kinda sucked when I was like \"oh man, this rabbit is delicious!\" in my mind, but I couldn't really announce it out loud the way I always do when i eat yummy foods.  At one point, my conscious got to me and I felt obligated to share some of my rabbit with them, cuz I enjoy good karma. And it worked because they were eating some delicious lamb and I got to grub on a bite of that too! Then we started talking to them and having a good laugh about this crazy looking old lady who was sitting behind us with a hairdo straight out of a John Waters film. (Crybaby to be exact). It was awesome. Nothing tops making new friends while eating some good food.", "author": "Jade L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-09-24", "description": "not a fancy place, but they know how to cook chicken!  which is why i always call it the chicken place... its their specialty!  they have other sides that are good, but seriously people, its all about the chicken.  i have also gotten takeout from here a few times which is great.", "author": "Carolyn B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-12-30", "description": "the only thing i didnt like about this place is that they dont emphasis on many sides dishes. they concentrate on one thing and one thing only...cooking chicken. and they do that well! the chicken was nicely marinated and perfectly grilled. its funny because they have only two chicken choices from what i remember: half or whole chicken. haha. but its all reasonably priced. if you do get a side dish, go for the potatoes with olive oil and italian seasonings or something. theyre really good!\n\nthe place is small, so if you intend to come here, be prepared for a back up restaurant in case the place is packed.\n\nyum, yum, yum!! cant wait to go back.", "author": "Melanie F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-01-26", "description": "One of the better choices if you are in North Beach -- no barkers and no pretension.  I especially recommend the half rabbit and fries, but the chicken is pretty good, too.  A little too pricey for every day, the take out service is still the hungry bachelor's best friend.", "author": "Jackson W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-03-05", "description": "my favorite place for yummy simple food.  the chicken rules, the service is consistent and pretention free and the location in the heart of north beach makes for great people watching~", "author": "e g."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-22", "description": "My husband looooves this place...I don't eat lamb, well...for many reasons, but anyway he loves the lamb here, and you get a whole plate full of lamb chops for a low price, lamb is generally pretty expensive.  I usually get the chicken breast which is soooo tasty, but today I had the 1/2 chicken sooo yummy too.  Really great fresh cut french fries, but I don't eat them, tryin to be healthy ;) Salad there is sooo yummy too loves the chickpeas and kidney beans in it and great house vinegarette dressing on it, we tried the sausages for my 2 year old here today for the first time, she loved them and so did my husband.  Their seasonings are just so darn tasty!! \nI do have to say though, not totally child friendly...not a good place to take little ones...not because they're not friendly to kids, but more so because they don't have a real kids menu and they only have glass cups & not sure if they have highchairs, but I don't think it.  But overall really great place for lunch/dinner, with healthy delicious food!", "author": "J C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-07-31", "description": "What i like most about il pollaio is that it's low key.  there is no food pimp outside and there is absolutely no pretense inside.  this place is \"italian via argentina.\"  they make an authentic chimichuri that goes on their freshly grilled meats. Food prep is simple and wine (by the bottle or by the carafe) is very reasonably priced for the quality.  my husband ordered the half chicken: small, juicy, and perfectly grilled.  he also got the \"fries\" which were the best fries we've eatten in years.  they were crisp even down til the very last one (it was a huge plate o'fries).  they offer 3 types of salad and if you can't decide which one you want, you may order a plate of all 3.  i ordered the green salad, it was big for a dinner salad and they let me dress it myself with the olive oil and balsamic vinegar cruets.  i ordered the rabbit (i usually love rabbit) which was not a great choice.  i suppose rabbit is too lean to survive a hot grill treatment, it was a bit dry.  the marinated eggplant appetizer was nicely seasoned and simply prepared.  this place is not fancy, it doesn't hide behind frilly presentation or complicated sauces. it is very straight forward, with a relatively small menu, they've got everything on it almost exactly right.  oh, and the parsley potatoes (they came on the side of my rabbit): delicious, belly filling, comfort food!   this is the type of place that neighborhood folks come (often dining alone) to get a good home-cooked type of meal at a reasonable price served by a very efficient and genuinely NICE staff.", "author": "passion f."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-03-25", "description": "I love this place.  Argentinian-family run, friendly and unpretentious in a pretentious area.  The hamburger is the best kept hamburger deal in the City.  I've tried every meat dish except rabbit and sausage and have never been disappointed.  Has been in the same location for twenty years.", "author": "Eddie C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-08-07", "description": "First off, this can't be the best steak in SF.  It was good, don't get me wrong, but it was not spectacular.  That said, I really liked this place.  Good food, very generous portion of steak, reasonably priced wine.  I am pretty sure this place was cash only, so heads up.  Very low key place, which I like.  I would definitely go back.", "author": "John M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-10-12", "description": "Very good grilled chicken, superior grilled rabbit.  Try the combination salad as well.", "author": "Zack H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-04-17", "description": "I went here last night cuz I heard they have good chicken here and boy were they write. I ordered a half chicken with fries ( wish I got their salad instead) the chicken was huge... When I cut into my thigh piece it was still bloody inside..the lady asked if I wanted it cooked more and I said no so she gave me the chicken for free yay!....hopefully next time it's not bloody again", "author": "Crum B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-06-12", "description": "Go have some great chicken but do yourself a favor and go early! On our latest visit here we showed up just as they were about to close and the chicken was slightly burnt, dry, and cold. My attempt at explaining the inverse correlation between Chicken bliss and time: This is just a guess but since they have chickens on the fire at all times I'm assuming they overcook by the end of the night, then come off the grill and cool off while waiting to be thrown out, then I walk in and pay to eat them.", "author": "Hratch P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-26", "description": "This place is rad.....my buddy lives in North Beach and took me here and I was impressed.  Chicken is awesome....", "author": "Richard C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-05-23", "description": "I absolutely love this place, though I haven't been there in ages. Awesome Argentine-Italian family-owned restaurant that has great food, friendly service and great prices. You come here long enough and your server will pretty much know what you want. Maybe at first, the service might be cordial enough while leaving something to be desired, but they are friendly. I typically get the sausage sandwich, fries, and a Peroni, though the chicken is most excellent and never overdone. The rabbit, which I have tried before, is a bit more expensive than the other entrees, but also very good. They have some great hearty salads on the menu as well a great burger. Parking can be a nightmare, but if you're visiting North Beach, I would most certainly recommend a stop. It is also perhaps the best place to people watch and get a view of the North Beach locals, as every customer seems to know each other, and I've talked to many of them over caraffes of red wine. My favorite place in North Beach, and I've eaten at all of them.", "author": "Miguel G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-10-27", "description": "It is not a very fancy place but it is the food that really shines here. I had Half chicken which was awesome. It was moist and tender. Portions are huge and good value for money. It is truly comfort food at it's best. I wonder why are they closed on Sundays?", "author": "Purnima S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-08-01", "description": "now this place serves some great chicken, i know, i know its a chicken spot, but come on... wow.  plus, got a whole chicken for a little over $12 and it served 3 people, wine for less than $20 a bottle and some fries to top it off.  if i am in the mood for chicken i know where i am going in the future", "author": "Tim G."}
