{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-24", "description": "I was looking for a study spot to get some work done and decided to try out illy for the first time. Many people spoke about their almond rose latte and so I gave it a try. \n\nI went around 3pm on a Monday afternoon and it was pretty busy; it took more than 5 minutes for them to make my drink. The coffee itself is very light, with hint of rose and subtle sweetness. \n\nAs I mentioned above, I was there to work. The wifi wasn't great and disconnected every 10 minutes. The seating area is pretty cozy, so this location would make a better social than study spot.", "author": "Alice L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-09-24", "description": "Classy place, great coffee drinks and pastries served here in a  comfortable upscale environment. \nBut my one gripe is how do you mess up a breakfast sandwich that's half the size of most?\nThe panini Mark's are nice but the cold cheese on a warm egg and bacon filling just killed the happy mouth feel for me, when I was looking for some melty goodness.This combined with microfilm bacon just barely quenched the desire of my expectations.\nI will stick with the coffee and a pastry next time.", "author": "Bill H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-08-25", "description": "The largest illy in the FiDi, so it has a very broad beverage and sweets offering.  Lots of indoor seating so you can have a business chat with real glass/ceramic instead of paper cups.  Though I still prefer the Battery Street location a tad more because of the outdoor seating.\n\nMini Éclaires (Chocolate, Vanilla, Caramel, Raspberry): About two bites each, if you want to savor them, though they could be easily dispatched in one bite.  Perfect if you want to taste a bunch of flavors.  A little pricey if you want to replicate the weight of a regular Éclair, which I'm guessing is about 5-6 of these.  The chocolate was the tastiest.  The vanilla felt the most traditional, though I missed having a chocolate ganache on top.  The caramel was odd because it wasn't filled with actual caramel, but more like some quasi-caramel flavored cream.  The raspberry was just ok too, more creamy than jam-y.\n\nBomboloni: Very disappointing.  Only a tiny dab of jam.  And the doughnut part tasted stale.  A simple munchkin would have tasted better (and been a lot cheaper).\n\nTiramisu Mignon: More like a tiny creme cup with a cocoa dusting on top.  Didn't taste much like tiramisu at all.\n\nChocolate Layer Cake MIgnon: Kinda stale tasting.  The big chocolate cake slice looked a lot fresher.\n\nCaramel Tempesta: Like a Starbucks frappuccino, but not as sweet and a lot more coffee tasting.  Only came in one size, which was a medium glass, though that is perfect for a caffeine pick me up without being greedy. \n\nLuce: It was my consolation prize since they were out of the blended tiramisu espresso (though they didn't tell me until after I paid).  The cold foam on top really did have a nutella-like taste.  Helped sweetened the bitter coffee below when you sipped it from the cup.  That concept totally didn't work through a straw though.", "author": "Adam B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-10-26", "description": "Ok WiFi. Nice space. Not too noisy but the flat white coffee was terrible. They burnt it. I expected much better.", "author": "Mick L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-07", "description": "FRESH ILLY BEANS\n\nThe go-to espresso because it's good and convenient.\n\nIt was my last day of my vacation at home and felt compelled to walk Montgomery Street while running errands around the city. When did an Illy Cafe open up on the block? I've only been gone from home a few years and my old work stomping grounds (Montgomery) street got a face lift. I hate store bought Illy beans but I love Illy beans freshly grind at their cafes. \n\nLATTE - I'd say its not my favorite latte but it is one that I could consume daily as I had done when I lived here. Their beans are good, in my opinion they are bold with light acidity. Although I like the light and rounded beans, I can still take in this bold bean without complaint. That's a good thing!\n\nThe ambiance was clean and spacious and comfortable, the kind where you can sit for hours surfing the net, or having conversation, or working, or studying, or people watching. I love cafes like where I can be a cafe dweller. The cafe dweller in me wanted to take a moment from my busy schedule, order a latte, and post up at the window counter and observe the city streets. I got nostalgic, missing my city life. Thinking about what I had and didn't have, the empty heart and fancy life with the high pressure job that made me run away from this beautiful city and turned me into a beach bum. Then as you know it, your taking the last sips from the tiny Illy espresso cup they serve the espresso and you snap back to reality and go about your business.\n\nUntil the next review...", "author": "Jane A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-10-12", "description": "I'd love to drink more of your coffee, but every time I try to go in, there's a crazy long line and one slow barista making all the drinks. Can you get possibly two? More machines? Just have more staff during the morning hours and I'm sure you'll get some more business, mine included.", "author": "Kerri B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-10-09", "description": "Been here a few times to pickup meal pal and food seemed good. I recently received an email about their single origin coffee beans and thought they might have good drip coffee. I was wrong. Not sure about the lattes or espressos but the dark roast drip was watery and just tasted like a 7 eleven coffee. Worst part is a small is $2.70. Starbucks is cheaper and is higher quality for drip.", "author": "Fernando S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-19", "description": "I love good coffee and illy is one of my favorites. So it was cool to see a full illy cafe and not just a feature in a separate coffee shop. \n\nThey have a nice menu of drinks, pastries, and baked goods.\n\nI got the Lavender Mint Latte, I know fancy, and the Breakfast mini croissants turkey and veggie. Both the coffee and food were delicious. \n\nThe interior of the place is sleek, shinny, and clean.\n\nLooking forward to coming by during my next SF visit.", "author": "Tim R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-11", "description": "Illy is my favorite brand and the coffee here doesn't disappoint. Lots of seating, fairly clean and comfortable. One thing to note is that an angry woman came by yelling and screaming, saying that she's worked in the building for 30 years and could never afford a cup of coffee here, so why should we?\n\nA little unsettling but it's San Francisco, things are expensive, what can we expect?", "author": "Mimi N."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-10-01", "description": "So bummed out by this place :(\n\nI'm essentially born-and-raised on Illy and had been dying to come here. Euro fam visiting = perfect time to do it!\n\nUpon walking in, we were all charmed by the interior. There's a chandelier with tiered espresso cups, giant-sized espresso cups throughout the store, cute lighting, art, and decor...\n\nThen we went to order.\n\nThe cashier was incredibly strange and kept rolling his eyes and mumbling under his breath, and the prices were crazy.\n\nTrust me, I understand the concept of a proper espresso, quality beans, and traditional machinery. I appreciate all of that very much. But the prices were obscene for the drink sizes (which were correct by European standards but would be found there at much lower prices).\n\nNo, thank you.", "author": "Nic Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-04", "description": "This Illy is in my office building, but even if it weren't, it would still be on my radar as a great cafe. Good coffee, friendly staff, lots of tables, open until 6pm (which in the FiDi is like midnight), and always an impressive array of beautiful treats in their case. If you need to meet up with someone for a meeting or a chat and want a chill cafe for a nice pick-me-up drink and snack, this is the place.", "author": "Cary R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-06-20", "description": "Meh. It's a nice cafe but the drinks are tiny, and the Wi-Fi is horrible. It kicks you off every five minutes, and I guess I'm just more of a Starbucks or Coffee Bean girl.", "author": "Shawnee N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-20", "description": "My go-to every morning on my way to work! After a month or so of frequenting I was recognized as a \"regular\" and have been treated as such ever since. The manager Jonathan always makes sure I'm taken care of, and Blake, Corrine and the rest of the crew are always friendly! \n\nIf you're a straight espresso drinker like me, illy's a great choice. I tried to go to Starbucks just to change things up, and the espresso tasted terrible in comparison! Had to go back to illy immediately despite having money left on a 'Bucks giftcard haha.", "author": "Michael D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-23", "description": "Great place to get work done! \n- spacious tables\n- outlets at booths & corner tables\n- clean and private restrooms\n- water jug available \n- bright lighting!\n- nice staff\n\nMost of All... coffee is great! They pull their shots amazingly, creamy, and not bitter!! Yum:) \n\nI got the prosciutto and mozzarella panino and it was amazing!!", "author": "Mako U."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-15", "description": "Grabbed a coffee from here, it did not rate as coffee - it was so weak and tasteless. Honestly if coffee is your speciality you should be able to do it well.", "author": "Zeynep D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-09-13", "description": "The coffee is very awesome, but the staff is not polite and either friendly. This is a place to be very comfortable because there are a plenty of seats to work, to chat with friends ! Unfortunately I didn't have a good impression with their workers.", "author": "Danielle F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-01-22", "description": "This is a good place to meet up and/or get work done.  There is an outlet at all the tables along the wall with ample seating.  It's a bit loud if you want peace and quiet without anti-noise cancelling headphones.  The main drawback is the intermittent wi-fi, which makes you log in every two hours assuming it stay connected for more than a few minutes.  \n\nIt's near BART and various places to eat.  I'd come back just to watch and try the coffee made by the baristas.", "author": "Jenny L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-08", "description": "Amazing coffee and coffee art. I ordered the almond rose cappuccino and it was excellent. The medium size with almond milk after tax is $5.72 so it is a bit steep. \n\nHowever, I would love to come back to try other flavors such as chocolate orange!", "author": "Athena C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-01-10", "description": "Getting 2 stars because the previous times when I've gone to other locations I've had great experiences but this location is always awful! \n\nToday in particular it was 2pm kinda late for lunch and a coffee but it was packed I couldn't even hear the barista ask me what I wanted to order. \n\nI waited 25mins for my sandwich which NEVER arrived. I had to get back to work and did not have time to get back in line and ask for my sandwich (yes it was that busy) I got my coffee though and it was really all I needed. It was delicious as usual, plenty milk choices, and the raw brown sugar is a plus! \n\nGo to a different location to save missing out on a sandwich you overpaid for anyway. This one on Montgomery is too noisy and way too busy even in late afternoon. \n\nAlso make sure you ask them to warm your sandwich a little longer. My sandwich always comes a little cold in the middle -.-", "author": "Jazmine S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-09", "description": "Awesome cafe!  Chic interior with (of course) excellent coffee and always friendly staff.  \n\nTheir macaroons are - oh - so  - good!\n\nGood wifi and chatting spot, though Seating is often limited at this place.", "author": "Winnie W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-02", "description": "Very nice coffee place super quality brew and service is very friendly if you are a regular get a stamp card so after the purchase of 10 cups you get a free one\nLocation is great and spacious great for meetings.", "author": "Fabio T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-12", "description": "I don't drink coffee.  Like I don't go out and buy coffee on a regular basis nor does caffeine really do anything for me.\n\nIlly Caffe is across the street from my work and the shop itself looks like a really modern and cool place to hang out and drink a cup of coffee, hang out, or whatever.\n\nI had credit on a new app called ritual, so I ordered a cup for pick up.  It was ready when I got there and the cashier was friendly.  The pickup process was pleasant and I was pleased.  I'm the furthest thing from a coffee connoisseur, but it tasted good and really smooth to me.  If you want to try out ritual.  Hit me up and I can send you a referral along with some free credit.", "author": "Ty C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-27", "description": "First time trying this cafe albeit so close to my office. The pastry case was filled with a bunch of tempting goodies, especially the almond croissant and the blueberry donut, but decided against it. The staff was very friendly and greeted me with a smile. I ordered the vanilla clove latte for here and it came in a very timely manner with great presentation. My coworkers got a small latte and americano which they were both pleased with.\n\nThe flavor of the vanilla clove latte was VERY good and something that I've never tried before. The hint of clove added something different that I can see craving periodically. I'll definitely be returning here and look forward to trying something different!", "author": "Chris B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-10-07", "description": "Wanted to give illy 5 stars, but I can't.  Great coffee, nice ambiance, friendly staff, but the pastries fall way short of expectations.  The croissants have the texture of soft bread.  The orange cranberry muffin is colored with fake food color and has no orange bits or flavor.  It's mainly made up of sugar, flour and fake color. Very disappointing.  This is San Francisco, surely illy can find a better supplier.", "author": "Leila R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-25", "description": "Two cafes within one block? I wish there were more in the East Bay where I live! Not that I'm in The City that often, but I do make it a point to stop at the location. Always nice and clean, the staff are very outgoing and more than helpful. There is a cute little shop in the back where you can buy coffee and the lovely ceramic wear served in the cafe.\n\nI always get a big smile from my friend, Barsha, which makes my day!", "author": "David N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-09", "description": "Great environment. Lots of space for tables and people. The decor is very cute! Overall, great coffee, and even greater ambiance.", "author": "Inci A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-25", "description": "This is the latest addition to the growing illy Caffè chain in downtown SF. I've been passing this location for the past couple of months as it was being fitted so when it finally opened this week, I stopped by to give it a try.\n\nilly Caffè is on a block with two other specialty coffee shops jostling for business - Blue Bottle which is just down the road and Coffee Cultures which is across the road. One block down you have Peet's, Starbucks & Phils so you are literally spoilt for choice around here.\n\nilly Caffè is positioned along the lines of an European Caffe so there is a lot of seating inside unlike other coffee shops which are more grab and go. I feel this will be a big draw for crowds especially during the day. Its lineup is also relatively simple - espresso, lattes, cappuccino, mocha all using the house blend. If you are looking for something more fancy (drip, pour over etc.) you are better off going to Blue Bottle a few steps down. It also has your typical baked goods counter but I'd prefer to get something from Specialty's Café & Bakery down the road which specializes in baked goods. I guess at some point we should also see salads and sandwiches like other illy Caffè locations.\n\nAs they have just opened there was hardly any line when I stopped by on my way to work. I'm sure this will change very soon as word gets out and lines here will be comparable to other coffee shops and that would be the time to see if they can keep turnaround times under 10 minutes. \n\nI got a small Jasmin Vanilla Latte ($4.25 + SF Health Mandate). The latte art could use a little improvement but the barista was very friendly (enjoy this till he gets drowned in orders). I felt that the Jasmine flavor was very mild and the Vanilla overpowered everything. Still it was pretty good. Price wise it was in line with what you would pay for a cup of coffee in the area (around the $5 mark). I can definitely see myself returning regularly to sip on their expresso as I live close by.", "author": "Ahmad J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-23", "description": "First time at their brand new location! It's conveniently located on the corner of Montgomery and Bush and it's surprisingly huge!\n\nThere is a ton of coffee shops around this area but besides Workshop Cafe, Illy Cafe is the only other place that offers seating. The cafe is spacious so there are plenty of tables for groups or individuals. Perfect for quick meetings or hanging out!\n\nAs for the drinks, they're enjoyable but not the best. I do like how their drinks are less on the sweet side so you can taste the coffee more. They also offer food and snacks that you can get to go or enjoy there.", "author": "Jennifer H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-15", "description": "Servce: great, self serve\n\nattire: Casual\n\nPrice: $\n\nDon't we all love caffeine? If not, that is fine we have lots of non caffeine selection and pastries to please you. I've stumble upon this little gem on my way to hiking. They have regular good espressos and coffee. But if you are looking for some variety, they have lavender latte, honey rose latte, almond latte to name a few. The aroma and ambiance is just so soothing with their music on. I can sit there all day with my laptop and sip on my coffee with a bite of pastry.\n\nI think their espresso is super strong and good. It is all over europe. When I lived in London and Norway, Illy was everywhere and I hide out in those shops for hours to get my homework done + calm myself.\n\nI love how their coffee is in tin cans so it would stay fresh and seal the coffee in better than the paper bags. I always take some home with me for my morning coffee run.\n\nyou can see they have a wide selection of pastry and good. Don't be shy on trying some. The servers are really nice here. You can have them toast up or warm something for you if you like it warm. There are many sweet treats and savory bites. So it really do satisfy everyone. You can really be here for the whole day eating a pastry in the morning and having a sandwich for lunch! haha\n\nThey have super clean and nice decor here. I love their little espresso cups and I find these super cute as they have drawing and art pieces from famous people and country. It is literally all over their shop! you can always pick one up. I use to collect these at home. I would buy one from each country I visit where I see illy!", "author": "christina m."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-22", "description": "I love the coffee here. Also love the sandwiches and the pastries. The Ambiance is amazing. However the only reason I talk to Star, was a service is a bit slow and a tad lazy. When customers are waiting you should not be chit-chatting with fellow employees and then once an order is put in you shouldn't lollygag to get it out to the customer", "author": "Eric A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-08", "description": "While it has its ups and downs, this ILLY location has grown to be my go-to coffee shop in the FiDi. The staff is sometimes very friendly, and sometimes not so much. The food and beverages are not cheap, but they sure are great-tasting. I also LOVE that when you order drip coffee for here, you get free refills. That will keep me coming back for sure.", "author": "Zach B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-27", "description": "First of all, the coffee is fantastic. So are all the snacks and treats. But more importantly, Corinne, one of the baristas, is the reason I come back to this Illy location. She's the epitome of amazing customer service - she knows my name, my order and is always friendly and welcoming. She knows I love cinnamon in my latte and, even if she isn't making my latte that morning, she makes sure another barista adds cinnamon to the milk.\n\nLove Corinne. Love Illy.", "author": "Amity G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-14", "description": "Not much of a coffee drinker but sometimes the smells just gets to me. Went in without knowing what to get, Emily recommended the Lavender Mint latte and OMG was that good. Coffee was great, Staff was great, Emily was patient and sweet definitely coming back!", "author": "Diana G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-23", "description": "Came here for $1 coffee day on ritual. Big space to work. Really loud if you're trying to take a conference call. They'll also kick you off of the WiFi after two hours and you won't be able to get back on.", "author": "Mandy P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-20", "description": "Amazing coffee and very personal and professional staff. Kira and Aryana make this location extra special with their excellent customer service and attention to detail!  Great atmosphere for business conversations or mid afternoon break.", "author": "Brad M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-15", "description": "I love this place! I get my coffee here every morning and the lead barista Corrine always greets me with a big smile and makes me the best lattes. Great customer service and coffee!", "author": "April F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-03", "description": "Macaroons: good\nCroissants: a little bit on the drier side\nSpecialty lattes (lavender, vanilla clove, etc.): all fine. Nothing to write home about in grandiloquent terms.\n\nThe interior design here is outstanding. This is Illy's flagship location, and as such has all the fancy & interesting, well-polished decorations that you might wish for. It's worth visiting if you find yourself in the area, if only for the items on exhibit.", "author": "John L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-15", "description": "You've ever been inside a museum? \n\nWalking inside makes you feel like you're in a museum with all the cool artwork and expensive gadgets that they have lying around. But overall, I think it's quite nifty.\n\nAm I supposed to talk about the coffee? Yeah, that was good too.\n\nA lot of seating and cool/chill ambiance.\n\nI love that kind of stuff - the seating. I'm whatever about the chill ambiance, but that's good too I guess. I was literally only there for like 15 minutes, not sure if this would totally count as an appropriate review, but I liked it.", "author": "Jonathan R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-13", "description": "Amazing coffee and food! Corinne was so sweet she greeted me right away and was so kind! 5 star customer service! Favorite new spot!", "author": "Sofia M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-18", "description": "My wife really likes this location. She stops here almost everyday to get her caffeine fix. She always gets the same order a \"small latte - kids temperature\". The crew has begun to remember her order which I guess qualifies her as a \"regular\". On more than one occasion, Kira has brightened up an otherwise negative day by funny and lighthearted.", "author": "Bryan M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-11", "description": "I started coming to Illy's due to convenience but soon discovered that the atmosphere is great for working, reading or just catch up with friends. Aside from the better coffee (better than Peet's and Starbucks in my opinion) they have great customer service. Corinne at the 220 Montgomery Street (San Francisco) location has always been exceptionally helpful and happy. And she always remembers my order. Loving it! Thanks Illy! Open more locations and keep the service level high!", "author": "Justin K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-13", "description": "We're regulars here at illy Caffe where we can always find comfy seating and great tasting coffee. As a matter of fact, Lupe and the rest of the illy team know us so well, as soon as we walk in, they start our order. Best customer service ever!", "author": "Brenda B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-05", "description": "Wow, what an experience.  I've been to many cafe's.  Coming to the US, you see cafe's on every corner.  I first entered and immediately was welcomed by the staff.  I decided to set down and enjoy the atmosphere and was so glad I did.  I ordered a Almond Latte and surprised at the quality and speed of service.", "author": "David E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-12", "description": "I really like unique drinks and the lavender mint latte really caught my eye. I came here on a break to grab a cup and was not disappointed. I got a small one and wish I had gotten a large. It was creamy and had a good flavor of lavender that did not taste soap-y, which is always one of my pet peeves of ordering anything lavender. I wish it had more of a mint flavor, but it was a good amount of sweetness and you can still taste the coffee flavor as well. I'm not a coffee expert, but I can taste the good quality of the coffee.\nIt's also a super nice, modern and clean place if you want to work there and they have a cool teacup chandelier. \n\nOverall, I'm a fan and I would definitely go more often if it didn't cost nearly $5 for a small.", "author": "Sophia Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-04", "description": "Always loved Illy coffee. But Kira at the register makes it special. She makes everyone feel welcome with cheerful, personalized service. I actually tell friends to come here because Kira and the rest of the team do such a great job of making it a great experience every time. Keep it up!", "author": "JK K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-04", "description": "Always love Illy anywhere I go and Blake is amazing!  So knowledgable and passionate about coffee!", "author": "Ben C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-23", "description": "I like this place a lot, but lately they are having some new people that are really dropping the ball. I ordered a flavored latte the other week and they completely forgot the flavor. Ok, it happens, sure. Today I got a Vanilla Clove latte and ended up getting a Mocha. I don't know what's going on, because otherwise their lattes are great, some of their pastries are great and the shop itself is amazing.\n\nTrain the new people better! They shouldn't be making these kinds of mistakes!", "author": "Elena O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-12", "description": "This is my everyday coffee spot - keep coming back. Kira makes the best coffee and cracks the best jokes. Recommend a lavender latte, yerm!", "author": "veronica e."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-06", "description": "Great espresso and great decor! I was shocked at how spacious this cafe was, compared to other places downtown. It's also a great place to admire the interior design - the bright red and black was a nice change from the minimalist/industrial trend that's hitting all the coffee shops nowadays.\n\nThe staff were also really nice, lending me a fork when I forgot to get one with my food truck fare. Will definitely be back!", "author": "Larissa M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-25", "description": "I love the lavender mint latte. Their coffee is strong so I only go when I am pretty tired at work. Their baristas does a great job with passion. Sometimes I get a hot chocolate when I just need a break and no caffeine. Their hot chocolate is milky and thick and not too sweet.", "author": "Gloria T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-23", "description": "illy has beautifully transformed this space which I believe was a clothing store. The counter case has many attractive panini and pastries to choose from, plus there are salads and wraps at the refrigerated grab 'n go case. There are stools at the window tables, plus benches and chairs at tables throughout the space. I noticed many meetings in progress, which caused the loud noise. I felt sorry for the baristas who had to shout to be heard. It was around 11 a.m. Perhaps in the late afternoon it's quieter?\n\nI ordered a hot chocolate. Service was friendly, the hot chocolate was efficiently made and tasted great. I drank the hot chocolate and looked out at Bush Street passersby. Next to me were two Frenchmen who drank their espressos quickly and left. That reminded me of Italy where one doesn't linger over coffee. Perhaps that is the best approach to this cafe. Grab 'n go.", "author": "Carol W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-07", "description": "Loving this new location. Run by a few of the wonderful familiar faces (Joe & friends) from the Castro location!\n\nVery large space, well laid out, bright and cheery with beautiful art pieces throughout. Plenty of communal comfy bench style seating, small tables for chatting with friends and bar style seating either at the counter or facing Bush for great people watching. \n\nThe coffee drinks are superbly made and they have a great selection of paninis, wraps, salads, fruit, yogurt... oh and of course their delicious pastries. I can see this being a great spot for lunch if you work downtown, or a place to read a book or hangout with friends. Most definitely am happy to see new locations popping up and to know it's being run by great people with amazing customer service as their top priority.", "author": "Amanda F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-12", "description": "I think this place gets over looked when it comes to lunch spots (unless you count tea and coffee as lunch). I came here twice and it was pretty good! I've ordered the tuna and white bean salad and albacore tuna panini with a drink and it was fresh. Both times my meal was made to order (pre-prepared salad kinda takes a toll on you after a whole). Plus, portions here are quite generous. I couldn't finish my meals in one sitting. Service is efficient and quick, so if you need to order, grab n' go, Illy Cafe might be worth a try - or you can stick with the pre-made salads (whatever floats your boat)", "author": "Rebecca L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-27", "description": "I come here every morning and the coffee is \"awesome\"! More importantly they have a salmon and cream cheese bagel that is the best I've had anywhere (I travel a lot). Customer service has also been great!!! I've gotten to know a few of the team members and my orders are always completed exactly the way I like them.", "author": "Ernesto C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-04-17", "description": "Do not get their brewed coffee.  They overcharge and for the 3rd time, coffee grounds made their way into the brew.  Overpriced forge quality.", "author": "Debbie C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-09-26", "description": "Large interior with lots of seating options and decorated with unique cups and artwork throughout. Close to Bart.", "author": "Kimberly H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-27", "description": "What started off as a \"Friday treat\" for myself eventually grew to daily addiction. The coffee is great, I look forward to it every morning. So much for saving money right?", "author": "Shayna T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-05", "description": "As much as I love a great single-source dopio pulled by a rockstar barista from a proper machine, I'm an unapologetic tea drinker.  I can't live without a great cuppa strong french-style breakfast tea in the morning.  So I was happily surprised to see Illy offering Dammann teas in sachets by the cup and loose leaf for retail, and both at reasonable prices.  Finally, a decent cup of breakfast tea on the run!", "author": "Ronald C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-10", "description": "This is the first illy location we ever visited. Really nice place, very modern, with lots of tables and great variety of sweets. They've got food as well (like wraps and sandwiches. This time we came just for a cup of tea/coffee and sweets, so we haven't tried the lunch items. But the drinks were good and the treats were DELICIOUS. Will definitely come here again to try out more of their things!", "author": "Max J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-21", "description": "Illy Caffe is my favorite. The coffee drinks are delicious, the place is always spotless and the staff is very friendly. Lupe makes the best Almond milk latte and always greets me with a smile.", "author": "Britta S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-20", "description": "I normally go to Starbucks but I decided to try something new and I'm glad I did!!! My simple vanilla latte that I usually get at other places tastes great, but what separated this latte from the others was that it came with a very well crafted leaf of some sort. Emily made my day with the latte art I almost didn't want to drink it! And for that, I'm more than likely going to dump Starbucks and come to illy! I honestly don't know why I always skipped this place when I work across the street. Thank you Emily! :)", "author": "Jack H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-26", "description": "Best coffee.  Corinne makes the best lattes. I'm loving the raspberry cheesecake. Great morning start", "author": "Denise J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-15", "description": "Came in from out of town and was assisted by Emily, not only were the selections great but the service was outstanding.", "author": "Jacob C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-08-25", "description": "I noticed when I walked by the other day that they do a \"daily soup preparation.\" I tried illy's soup today as a plan C ... forgot my lunch and Chez Julien (where everyone in the fidi should get their soup) was out of everything I liked. \n\nI ordered the \"raviolini and vegetable\" soup. Was mostly stoked about the veggies. It was basically tomato soup with ~6 small raviolis ... kinda reminded me of chef boyardee, with extra sauce. One of the most uninspiring lunches I've had in recent memory. I will not be returning, and wouldn't recommend you order soup there, either. GO TO CHEZ JULIEN instead.", "author": "Marissa G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-07-31", "description": "Mealpal pickup 12:15 and its 12:50 now and still no sandwich.\n\nYelp makes me write a longer review so thereeeeeee you goooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooo", "author": "R A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-02-27", "description": "Nice space, good food, and coffee, but seems short-staffed during rush times and food is pricey! $4 for a muffin is a LOT even for downtown SF...", "author": "Ms X."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-05-10", "description": "This place actually gets 3/12 stars. The Sansome location is 4 stars. This is the newest one that opened in the Fidi and the biggest one. It's really spacious, but I feel the staff isn't that friendly here or as helpful. I got a promo for a free lunch and MEDIUM size drink. I picked prosciutto sandwich and asked them to warm it up. It took awhile and it wasn't that warm. It was still tasty, but wish it was warmer. Also for the drink any MEDIUM size I picked their lavender vanilla latte. That was super yummy, but the girl at the register said I can only have a small since I picked a big sandwich. Um......ok...it didn't state that on the promo, but whatever. \n\nI go to their Sansome location and the place is really small, but the staff is super friendly. They also have more sandwiches. I used the promo again and they gave me a MEDIUM size drink even though I picked a big sandwich. I had their salami and it was really good. \n\nI would love to cater from them, but they don't do delivery yet. Their pastries look really good also. I think this location just needs a little work on their customer service. Since I got a promo, I tipped them and I know the cashier saw me and she didn't even say thank you or smile. She looks like she hated her job and the fact that she gave me a small drink only isn't right.", "author": "Karen H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-27", "description": "I work right across the street from illy and go there almost every day. The coffee is excellent and the space is large and open. The best part, however, are the great workers who make it inviting. I always run into Jonathan, who grabs my order as I walk in and chats with me to catch up. This added friendship is what keeps me coming back!", "author": "Evan M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-03", "description": "Always have enjoyed illy shops around the world so I was excited to see which item this shop featured while I was in the city. \n\nThe lavender mint latte I ordered hot was smooth and creamy, the foam wasn't over steamed or had any excess air resulting in a softness of texture when you have your first sip. \nAmazingly, the lavender wasn't overwhelming at all. The mint lifted the heaviness of the floral aroma and created a cool, crisp sensational on the lips. It was light for a latte and easy to drink through whether it be by itself or with a small pastry. \n\nI also decided to order the lemon tart which was a great contrast of flavors compared to the warmth of the lavender. The lemon tart had a quick impact on the first bite; the zest and lemon juice were easy to locate and the consistency of the filling balanced well with the thickness of crust. It definitely would have tasted more satisfying if the tart was slightly warm at least on the outside of the tart. \n\nOverall, the atmosphere was enjoyable for a midday business meeting or afternoon conversation. The decor was modern and spacious with a large variety of seating whether it'd be bar, stool, or booth seating. Lastly, the service was thorough, professional, and genuine which welcomed a pleasant experience.", "author": "Sammy P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-19", "description": "I've been to one other illy Caffe before, but this one was really good! It's much bigger and more like a traditional café selling sandwiches and small items to eat. On top of that they sell their espresso makers and coffees in one section of the café. I came here for an afternoon snack with my friend. I ordered an affogato and an order of Italia Donuts. The donuts were great. Nice and cold (like they should be) and filled with some very good berry filling. The drinks took a bit of time to get. The place was absolutely busy at 2:00pm and I understood. It took about 10 minutes to get my drink, but boy was it worth the wait! The ice cream inside the espresso was perfect and my pictures don't do it justice. Some small gripes are definitely that the place is a bit pricey. This all came out to about $10 bucks and at first it seems like you're not getting a lot, but man is this stuff quality! It was great and I liked the atmosphere. I would definitely recommend this spot and would gladly go back soon.", "author": "James R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-26", "description": "One of my favourite spots for coffee.  I recently discovered the lavender mint latte featured here which is amazing!  It has upped my coffee taste buds!  I also enjoy the casual but modern environment to get work done.", "author": "Brittany O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-07", "description": "This is the best coffee in the City. The baristas really know what they are doing and are very friendly. The space is really cool with plenty of seating, unlike most coffee bars in San Francisco. \n\nMy dry cappuccino is always perfect. I haven't tried the food, but it looks good. I highly recommend this place.", "author": "Paul S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-22", "description": "The Mint-Lavender latte was AMAZING! I love lattes, and all flavored lattes make my heart smile. I can't seem to walk anywhere without grabbing a coffee, and plus I really needed to use the restroom on the way to the bank so illy Caffe saved my day. Great coffee and the service was quick and friendly! I will happily return to taste the other delicious sounding items on their menu.", "author": "Claudia T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-03-24", "description": "This place for coffee is the spot, but I hated how they were in a rush to close for an event at 3 because I felt like they were rushing people who were still in line. \n\nI ordered the Iced Mocha, it was okay, but not great because I feel like if they were in a rush they would be just dumping the ingredients into the cup rather than taking taking their time and also it was a little watered down for me.", "author": "Brittany L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-20", "description": "Stumbled on this cafe while visiting and went in to grab a coffee. Really loved the environment and decor of the place. When I wasn't sure what I wanted to order, Emily offered suggestions and was patient while I was deciding.  It was very much appreciated and I will definitely be coming back!", "author": "Amanda B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-15", "description": "Right by my office and its become my regular afternoon break tradition.  Only after a few visits, Kira remembered my name and order.  Finally I can walk into a cafe and say, \"The usual please\".", "author": "Benjamin H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-29", "description": "Not a regular coffee drinker but visited this cafe with friends and had such a great experience. The cashier went above and beyond to help me choose my drink and EXCELLENT sweets to compliment.\n\nThe ambience was relaxed and comfortable and a great refuge from the hustle and bustle of the city. Few minutes in here and you feel recharged and ready to go. Super clean & tidy too, felt very European! \n\nIlly may just have converted me into an espresso regular [though I don't think my wallet can handle]...", "author": "P J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-10-03", "description": "The coffee here was very good. There are smaller boutique type places that I prefer. But this place made my wife very happy. Happy wife, happy life!", "author": "Alden K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-02-19", "description": "I have 20 yrs of very pleasant experiences with Illy the espresso brand.  This is about service, and about this new location only.\n\nThe folks behind the counter don't have their act together.  How difficult can it be to take an order, put the right name on it, and deliver it in reasonable time to the right person?\n\nI went there from work with 5 other people, and the store clerk put the (1) same (2) wrong name on all 5 orders because I paid for them, to the confusion of everyone including other waiting guests.  \n\nThe two times I went there before -- same thing.  Macciato without foam, then with milk, another time it took 10 min although there was no one before me.\n\nGet your act together, kids!", "author": "Peter D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-01-19", "description": "I discovered this place near the office a few months ago and really loved the quality and flavor of the almond milk lattes. Recently when I've gone, it seems like the line has gotten longer and the employees less friendly. Hopefully this is just a blip!", "author": "Amy S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-02", "description": "Joe and staff gave amazing service! \n\nCheck them out if your in the area!\n\nI ordered the vanilla clove latte and it was amazing!", "author": "Tyne J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-20", "description": "I drink espresso and this place is a good spot that reminds me exactly of my time in Europe. I have had a few baked goods and they were all tasty, but nothing where I had to go have it again. \n\nI like having the coffee bar and all the seating that is available here, definitely the European feel to sit down and enjoy your coffee for 5-10 minutes and then move on", "author": "Thomas K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-26", "description": "Fantastic setup. Great furniture, lighting and overall ambience . Welcome to the financial district!", "author": "Kevin G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-03", "description": "As always, the coffee is AMAZING and the deserts are really good as well. Nice quiet ambiance and comfortable seating area. The artwork is 100% coffee inspired", "author": "Steve M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-23", "description": "Large airy cafe with great lighting at a great location. There's bar seating and a ton of indoor seating good for groups, client meetings, or personal work space.\n\nThe menu is very complete, starting with your hot beverages (loved the lavender mint latte) and goes to cold specials (curious about the tempesta) and ends with the food menu (soup, salad, sandwiches, dessert, and bakery).\n\nThere's something for everyone here!", "author": "Sally C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-26", "description": "Well-lit, spacious and welcoming coffee house - a great place to stop by if you work in FiDi or SoMa and are looking for a break from Philz or Blue Bottle.\n\nGreat people watching on Montgomery Street. They have a good set of stool seating for when you need to be alone, but also have a bunch of tables and booths when you want to come with a group.\n\nDon't be fooled by the scaffolding on Bush Street which makes the place feel more hidden than it should; they are open for business.", "author": "Jen B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-04", "description": "Great coffee, but literally two people work here at any given moment, making getting coffee quite and ordeal for anyone looking to get in and out", "author": "Stephan K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-04-23", "description": "Beautiful decor, great location, and for the most part good coffee.  However, we've noticed that customer service and consistency of the quality of drinks had unfortunately give downhill lately.  We have noticed this particular barista who is disinterested in providing any sort of service.  On one occasion we asked for a muffin to be warmed (which is an everyday thing for cafes these days).  She rolled her eyes and gave us a dirty look.  On another occasion, we asked the same barista to cut a sandwich in half and she gave us a hard time by telling us essentially they don't do that.  She ended up cutting us, but not after spending another minute getting the knife and talking to her co worker.  We have also noticed that the people who work there are unenthusiastic and unhappy.  Food and drinks are still good- but perhaps more attention needs to be placed on employee management and education.", "author": "Victoria C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-08-01", "description": "I have loved coming to this cafe for months since i started my new job a few blocks away. The staff was always friendly and my cappuccino always dry. Until i came in recently..... The girl at the register and two employees were chatting up a storm behind the counter and she barely said hello to me when i walked up. At first i didn't care because im not much of a hello person anyway. I start to order my usual cappuccino and mid way through my order she turns around and starts talking to the other two employees. Literally before im even done with my sentence. i ordered a small breve cappuccino, extra extra dry. it took almost 15 minutes before i got my capp. Two other gentlemen ahead of me were waiting as well and not once did i see a single barista making their drinks until after i had walked up to the espresso bar counter. When i received my capp it was mostly milk, not dry at all and basically a small latte. I was so upset i almost put it back on the counter and left. When i checked what was written on the cup it said \"small capp\". Not breve, Not dry, nothing but small capp. If you love cappuccinos as much as i do, then you will understand how horrible it was to sip on this monstrosity. After realizing that they used regular milk instead of breve i had to throw it away a block from my work. After asking a friend that goes there frequently, I found out that the girl who took my order was LUPE. she is probably the worst barista/cafe employee ive ever encountered... and ive worked as a barista at two cafes when i was younger. I miss when that guy with the really pretty long hair used to work there. He made the best capps. Unfortunately, i wont be coming back.", "author": "Katie R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-01", "description": "I'm glad I found this place through MealPal. It's larger than I thought, also food and wifi. I will definitely come again.", "author": "Christie K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-12", "description": "- nice, clean, new, and spacious interior\n- very good lattes\n- fantastic service\n- in a decent area\n- better than other illy cafes in the area", "author": "Johnny C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-05-12", "description": "I will not be coming back. This time it took them forever to give me my coffee. and that is because I was late for a class and kept rushing them. I told the barista I wanted it with soy milk and he gave me my coffee with regular milk. At this point I just left.  Plus the prices are very steep. $4 for a mini donut is ridiculous. It is not even that good.", "author": "Candy Girl S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-10-03", "description": "Huang provided a receipt so I know his name. I came to the counter to make a purchase and told him that I only had a few minutes to go to work. He rolled his eyes at me and started cleaning random areas of the work station and then made my drink about 8 minutes later. Then he coughed over my drink before handing it to me.", "author": "Sandra G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-12", "description": "My favorite coffee shop. Excellent quality and taste of espresso. The employees are very friendly and skilled. Small deserts are delicious. Best coffee!", "author": "Angelica L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-08-12", "description": "Got the lavender mint iced latte thinking it'd be like Philz's mint mojito. Not even close. Threw most of it away. I'd go back but will probably stick to a basic coffee or espresso. Great space though. Very comfy and staff is super nice.", "author": "chris k."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-10", "description": "Great coffee and superb customer service.  Barista was super friendly.  I accidentally spilled my coffee after my first sip, and they were so kind to make another cup for me for free.  Totally unexpected of such hospitality", "author": "Jeffrey N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-08-09", "description": "The egg sandwich isn't bad, but the staff is outright incompetent. The first time I went, they gave my food to someone else. They started a new order for me, but they must've forgotten about it because it took them over 20 minutes to reheat an already made sandwich. The second time I went, I ordered the same thing. I asked them to heat it up, but they couldn't quite figure that out, so the sandwich was cold when I got it. I would've asked them to reheat it, but they had closed.", "author": "Alex V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-08", "description": "Stopped here on a day trip from Santa Cruz. Joseph and his team were very accommodating and professional. They poured us 2 lattes to taste and had a very friendly rapport with us. My cappuccino was incredible. Will definitely be coming back.", "author": "Emmanuel D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-08", "description": "Friendly baristas, amazing atmosphere, and GREAT drinks!! I ordered a soy almond rose latte & it was perfect! Oh & they have amazing pastries as well! Started a punch card with them since I'm moving to the area soon, try their drinks you wont regret it!", "author": "Jenna H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-05", "description": "I'm glad they've opened this location! No more insane lines in the next door Blue Bottle :)))) Great customer service, delicious coffee, large variety of baked goods and beautiful interior! Love them!!!", "author": "Julia S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-02-05", "description": "I tried going in to Illy Cafe this morning at 6:45 a.m. before work, and they were closed. The sign at the door says that they open at 6:30 a.m. There were two employees behind the counter, but nobody opened the door. I won't be going back.", "author": "Anna P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-10", "description": "Good location , good coffee, good services , nice interior decoration , very neat , very clean, good place to sit down and have a cup of joe in the morning. Totally recommended !", "author": "Anh N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-30", "description": "While the area is saturated with coffee shops, judging by the lines everywhere, there seems to be enough business for everyone.  Coffee Culture, which is basically across the street, has long been my go-to spot.  But as previously stated in other reviews, the big advantage this place has over their competition is the space...it's really big and well lit.  The coffee is good enough...meaning it's certainly better than the crap you get at SBUX or Peets.  The staff is friendly...and the manager, Josef, is super accommodating.  Definitely is the best place in the area to meet someone and sit for a cup of coffee.", "author": "Jonathan P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-19", "description": "A really great space for coffee near work. Lots of room for everyone. Oh yes, really good coffee too! :)", "author": "Larry J."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-05-23", "description": "Poor service. The guy taking our order could not understand what we were trying to order. We ended up repeating it 4 or 5 times...", "author": "Ioanna G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-01-31", "description": "I really like the coffee but the service is really slow.  If you have a lot of time to waste waiting to give your order then you shouldn't have a problem.  At 7 am in the morning with 4 people working only 1 taking orders 1 making coffee and the other two playing with their hair and gossiping the wait wasn't acceptable so I walked out as waited 5 minutes in a line of 3 people.. (This was not the first time the service was slow.)  Hopefully they will work out their kinks and I will be back.  (Also the first day they opened I bought the Greek yogurt which was spoiled but I let that slide as it was the first day)", "author": "Alice L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-21", "description": "Great coffee, and even better space to lounge. We love doing our small breakout meetings in here. They have a decent snack/sandwiches menus as well. Very centrally located in FiDi. It's one of the most spacious coffee shops in the city, with a great ambiance.", "author": "Anisha Y."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-02-13", "description": "Horrible service! Ordered a croissant and asked them to have it warmed up. The woman puts it in the panini press, walks away to do some other tasks. I ask the other guy about it and he got pissed off about me asking. Then the woman comes back out saying she has a timer and it still needed a couple more seconds... WRONG! The croissant was burnt. \n\nI have been in a couple of times since they opened and each time I feel like I am an inconvenience to them, despite the fact that they are there to serve the customer.", "author": "Stephanie D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-13", "description": "I have found my new home away from home when in SF. Plenty of room to move around. I love the large communal table and retail shop perfect for browsing while sipping. I stopped in 3 times during my trip last week Lots of great options. Breakfast day 1:cappuccino and yogurt parfait with raspberry sauce: Lunch day 2: iced tea and prosciutto panini: Afternoon break day 3: Fiocco (featured drink with cinnamon and honey). \n\nThanks for opening this new location and thanks Joseph for helping me with my tea selection. Dammann citrus rooibos which I am enjoying as I write this. \n\nBack in SF in March. I'll be back.", "author": "Elizabeth F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-17", "description": "This five stars is for Karina ( if I am spelling her name right) it was my first time here and I had ordered an iced mocha. Unfortunately while working on the table, it spilt on white tee, laptop, everywhere. Karina came right to the rescue- she not only helped me clean it up, she advised me to immediately goto the restroom and wash my white tee as she said coffee stains are hard to come out if not washed immediately. She also ordered me another iced mocha. She went out of her way to make me comfortable as I was pretty distraught with the mess. I hope illy coffee definitely applauds such service. You don't come across such kindness everyday. Kudos to karina and thank you so much. I will be coming back only for her", "author": "Nupur S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-04-10", "description": "Weak coffee (both the house blend and the espresso) and over-priced pastries. Friendly staff, though. I do not recommend.", "author": "K. V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-05", "description": "This is a beautiful cafe! I had my first lavender mint latte and now I am sold. Coffee here is an experience. Emploees were knowldgeable and friendly. Drinks served in beautiful cups and glassware. Can't wait for my next visit to the city to get my lavender mint latte!", "author": "Gsm S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-28", "description": "Whenever i am downtown, i always stop by this Illy location. I love the location on the corner with big wondows a modern and fun interior and yummy coffee and pastries and great people watching. It is a perferct place for intimate conversation or just enjoying your strong italian coffee by yourself while you are watching the hustle and bustle outdoors is moving by.", "author": "Wolfgang B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-20", "description": "Love this place but they need to take the cold brew off the menu. They look at me like I'm crazy each time I order it and claim they don't have cold brew. Huge pet peeve of mine!", "author": "Anastasia P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-06", "description": "This European coffee is much better than Starbucks' and Peets' . Basically we are tired of the both.  Food are also good quality here. This location has very spacious room with artistic interior design that gives us rich feeling. It is amazingly  almost full afternoon. I will be a regular customer here.", "author": "Alex A."}
