{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-01", "description": "We really had fun here. We were just walking down to the Pier and decided to stop by this bar. It looked like fun from the outside and the atmosphere was lively. Easy to order drinks and the bartender was fun and friendly. She even gave us some shooters of her own creation and recipe. This is a place I would like to come to every time I go visit SF", "author": "Armando S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-10-26", "description": "Hi: It's 2018 and you don't accept credit cards in San Francisco, time to: WAKE THE F UP. You think you're saving more money by not taking a fee, then you stand to earn by letting someone have a seemingly unlimited bank roll in your bar? YOU FOOL. It won't be my money either way because carrying cash is for dead people. Best of luck.", "author": "Lance E."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-26", "description": "There's literally a piece of glass in my glass of beer. Be careful out there folks. What if I didn't notice and chugged this whole thing???", "author": "Charlie G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-27", "description": "\"WHERE'S THE 1 MY FRIEND???\"\n\nThe International was the first place I ever encountered the dice game 1-4-24.  The game has since migrated from there and can be found played semi-discreetly at numerous pubs around the north eastern portion of the city.   It's a silly little game that is engrossing nonetheless.  \n\nI rarely come to the International these days, but it represents an important part of my extended stay in San Francisco, which began in 2003 and hasn't quite come to an end just yet.  Eric Musselman was the coach of the Warriors back then, and Brian Cardinal was a fan-favorite.  Nobody could conceive of an era like this one at that time.\n\nI wonder if they still have a picture of Kanoa up on the wall behind the bar...", "author": "Gopal R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-06-15", "description": "Pool tables and a great happy hour - $3 beers and spirits!\n\nA few pretty interesting locals, plenty of screens  for sport and good people watching out onto Columbus. Good spot to have a beer or two", "author": "Andrew F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-08", "description": "It's a dive bar, which the world needs! Somehow, someway.. ended up here a few late nights! No complaints! It's a place to end the night", "author": "Hector B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-07-10", "description": "I had an awful experience. The staff treated my friend group terribly. A friend and I met a some friends at the bar. They had been there about an hour or so before we got there. They had drinks already going. We were just chit chatting and catching up. We grabbed a seat in the corner and talked. The bartender (platinum blonde hair, dark eyebrows, red lips) kept staring at us. Then about five minutes later she asked for all our IDs for no apparent reason with a really nasty attitude. We pull our IDs and she proceeds to yell at us and say that if we aren't buying drinks then we need to get up and leave. I thought it was really odd that she'd never once asked if we needed help, needed to purchase a drink, etc. Instead she yelled at us from the bar like we were a group of teenagers loitering. I would never return nor would I recommend this place to anyone ever! \n\nUpdate: I saw the response Brittany left. I am actually over the age of 21 and I do have an ID to prove that. I've visited plenty of bars in the SF area. Try Stock & Trade! Much better service! The picture I posted was of her harassing a group of minorities that were sitting outside not apart of my group.", "author": "Chelsea R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-04", "description": "Cash only! Cheap DIVE BAR with friendly bartender and two pool tables. Not much more to say except it's a watering hole. Giving it a 4 star since it does everything you expect a dive bar to do.", "author": "Eric N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-18", "description": "One of the best Happy Hours in SF.  Certainly the best by The Wharf.  You just can't beat $2.50 Drafts from 4-8pm every, single, day.  And not disgusting Budweiser either.  They have Big Daddy, Sierra, Stella, Anchor Steam and Blue Moon.  You can't beat it.  (You can sorta get close at 901 Columbus, but that's not really a bar.)\n\nInternational Sports Club is one of those friendly, drinker-oriented bars where you can come and chill, talk to locals, tourists and industry-folks alike, and have a good time.  (Pro Tip:  Drink where the industry people drink - they know their drinking.)  Don't go expecting to order the newest and greatest in mixology.  There's no fancy cocktail list here.  They have a full bar and good beer.  The pours are generous, and we've already covered the tremendous Happy Hour.  In my opinion, they have a really terrific core staff of bartenders.  All friendly and cool people, and spot on with their service.  It's worth mentioning, the name is a bit misleading because it's definitely not a pure \"Sports Bar\", where the world revolves around Sports Sports Sports - although if you position yourself correctly, which is tough due to the awkward bar lay-out, you can have a Giants game on one eye and the A's game on the other.\n\nCouple other things...  Two pool tables.  Free pool on Wednesdays.  They have a nice little table outside on the corner of Columbus and Mason.  Very close to The Wharf if you're a tourist, and a nice break to the wallet if you've been tourist-hosed all day on prices... (Poor parents, those Ghirardelli Hot Fudge Sundaes and Chowders at the Crab Stands take a toll. Pray to god your kid (or spouse) lacks the gene that leads them to thinking that buying a random pearl from someone who flags them down in a storefront is a reasonable idea.  ...Did you get talked into a fortune-telling and almost got suckered into the $30 add-on anti-angst cream?  Did a dude pretend to be a bush?)  It's also ideally situated at the beginning of North Beach if you want to pub-crawl your way up the street.  Which, is apropos.", "author": "Adam S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-05", "description": "My friends and I were near Fisherman's Wharf looking for a bar to watch the Packers/Niners game on Sunday and turned to good old yelp for help. \n\nThis was a great find. Hole-in-the-wall spot with good drink specials and a really funky dive bar vibe. There are signed dollar bills hanging on the walls and the ceilings. There was one female bartender working who was super friendly and seemed to know most people who walked in - must be the regulars. This made the bar feel very home-y. \n\nThis bar could have been a little more lively. We were definitely the only Packers fans there so we probably need to find a Packers bar somewhere in the Bay Area with other fellow Wisconsin-ites. Overall, we had a great time!", "author": "Ilana B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-04", "description": "Its great for what it is- a dive bar with pool tables, tvs and cheap drinks.  My bf loved the playlist.  We're in town for a few days and will likely hit the 4 pm to 8 pm happy hour every night.  $2.50 well and draft including good beers like Blue Moon.", "author": "Rhonda L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-14", "description": "$3 happy hour?  Yes please!  This is a little hole in the wall and it is fantastic.  We always stop here while in San Francisco!  It is a mix of locals and tourists and just has a really cool vibe.", "author": "Carrie W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-01-28", "description": "Fun place, cheap beers, foosball and pool tables.  We were able to easily snag the foosball table.  The place is loud.  Really casual.\n\nBring cash, they don't accept cards.", "author": "Jaching H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-23", "description": "Great place for beer and pool. It was empty when I came, around 4 pm on a Thursday afternoon. Relatively clean for a dive bar, and the staff is very friendly. \n\nFree pool on Wednesday!!!!!", "author": "Lawrence H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-12-19", "description": "This is a dive bar with a GREAT happy hour, friendly Bartender (Brittany), and alot of locals and industry folk getting off work to chill. 2 pool tables keep the place lively and did I mention that you can't go wrong with their music selections?", "author": "Googie G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-12", "description": "This place is chill as fuck. Come over ask for Brittney, she is the best bartender. She can handle this whole bar if she had too... nothing but good people with good vibes. Love it. Coming from San Jose!!!! Ask for Brittney!!", "author": "Laura H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-02-11", "description": "Met my friends here to watch the Superbowl. I think they changed locations at the last minute. I had all of $4 on me and could only get PBR belughh awfulawful. They kept saying the PBR's were warm and they just put them in to get cooled in their attempt to get us to order something else. Finally we just said we would take them as is and they were totally cooled and 2 minutes later my friend went to order one and they said they were sold out. How the hell did they sell out when we were pretty much the first ones to order?! \n\nShadyshady. Also makes me think of this bartender at Monarch named Shady. Oh and their bathrooms don't have locks. Good job guys.", "author": "Tiffany V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-26", "description": "This spot was featured in the 23 Essential Dive San Francisco Dive Bars \nhttp://www.thrillist.com/drink/san-francisco/best-dive-bars-in-sf\n\nSince we were in the neighborhood on a Friday afternoon we had to stop in and check it out. The bar was a little crowded but we were able to score the last two seats - it was an odd crowd of locals, tourists, and some wannabe outlaw motorcycle dudes and gals. Decent selection of on tap beers and top and bottom shelf liquors. Every day of the week there is a different drink special (margaritas, long island ice tea, etc) as well as an advertised happy hour featuring $2.50 tap beers and well drinks.", "author": "Bumble B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-04-12", "description": "Worst bar service I've had ever.. She confronted us for forgetting to tip.. We are from the UK so a simple reminder would have surficed.. She pointed her finger at us and was completely ignorant..  Would never go back there and handed her tip to a homeless guy who deserved it.more.than her.call yoursepves international and don't lile international ppl going there.. Slight contradiction... \n\n. P's go to guardinos for a great chowder and great ppl...", "author": "Ismael A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-01-16", "description": "I would do zero stars. Rude bartender didn't even acknowledge my friend. Smells like wet dog thanks to the 3 dogs that were running around along with the dog ON THE COUNTER. I'm sure the health department would fine them with the doggy bed ON THE COUNTER. Patrons were a**holes and badgered us for wearing Seahawks shirts. Everything was filthy behind the bar (alcohol etc). Will never go there again.", "author": "Obie C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-07-16", "description": "Unfortunately, I cannot endorse this tiny establishment because I was not able to actually get a drink. I popped in around 4:30pm and literally nobody was there serving drinks. After 5 minutes I thought about going behind the bar to serve myself but decided it just wasn't worth it.\n\nThe only other patron had money out and was waiting to pay. They were too blotto to answer my simple question - where is the bartender?\n\nI went elsewhere. Life goes on.", "author": "Dave W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-02-11", "description": "Left my Oakley sunglasses here and can't get a hold of ANYONE at this place to see if they were turned it... seriously annoying... answer your phone!", "author": "Kirsten M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-04-02", "description": "Searched for a sports bar to watch basketball and wanted to grab a beer / some grub.  This place came up as highly rated but I would not have ranked it at all.  Warning - no food and cash only. I won't be back!", "author": "S.a. K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-16", "description": "One of my regular stops!GREAT people,great prices ($2.50 well 4-8 everyday),Great bartenders that totally take care of you!!", "author": "Craig T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-11-12", "description": "The bar is good! But the bartender is a rude, and uneducated women that will treat you as if you weren't there if you dont leave a tip that she likes!! She was harassing me and my friends for tips and she closed the happy hour before time! She should be fired!!", "author": "Alberto P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-20", "description": "This place is really a jack of all trades. You want to watch the game? you should go here. You want cheap drinks? you should go here. You want a crowd? oh just go here on a game name and you won't be disappointed. I had passed by this place a couple time while in North Beach. initially I didn't think much of it but then I checked Voo (https://tryvoo.com) and realized they had $2.50 draft beers and well drinks for their happy hour and who can say no to that!? needless to say if you overlooking the Dive aspect of this bar then this is definitely the place to go.", "author": "Peter B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-09", "description": "An excellent bar for:\n\nCheap drinks.\nFoosball.\nPool.\nFat Tire.\nA break on the walk to the Wharf.\nInadvertently offending large Australian men, and running away before they decide they want to beat you bloody.", "author": "Peter D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-03-25", "description": "Little place. Odd crowd. There might have been a concert at Bimbos.\nLooks like alot of regulars go there and also alot of staff from local restaurants go there after work.\nBartenders were cool. \nExtensive bar.\n\nBTW - CASH ONLY!", "author": "Roy K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-10", "description": "Real nice vibe on a warm day with friendly patrons and staff.  Enjoyed my time there and it's cheap too.", "author": "John P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-10-29", "description": "It is a great bar, would give 5 stars if it wasn't for the bartender. She is the worst bartender I have ever seen, harassing the customers for tips, cutting happy hour 10 minutes before. The bar has great cheap beer but the service is one of the worst in SF.", "author": "Hernan L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-04", "description": "It's a great little bar we had a very cool bartender Brittney very friendly with is out of towers...good prices can't say how the cocktails are we stuck to beer... Seems like a fun place to watch sports not a commercial sports bar...they were playing good music on the jukebox...It was a fast walk from our hotel The Hyatt...only one thing the bathroom could have been a bit cleaner...", "author": "Doriann H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-07-08", "description": "I stopped in for a drink while doing some work in San Fran.  \nThe crowd was cool, the drinks were cheap and the bartender was awesome.", "author": "Allison H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-17", "description": "Cash Only spot, but a cheap dive bar.  Looking for a fun little place this is the spot to go too!", "author": "Rozalia V."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-09-22", "description": "Great Happy Hour:\n- gin & tonic AND draft beer = 5\n- awesome atmosphere\n- recipe for a fun time\n- friendly & attentive bartender", "author": "Tom T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-02-13", "description": "Dive. \n\nRelatively cheap beer. Ok prices on liquor.  Weird selection playing on the juke.  \n\nCash only. \n\nBottom line: Yup, it's a bar.", "author": "Kellie T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-04", "description": "Great bartender...fun  to watch the games on TV while enjoying happy hour. Very nice crowd, almost pretentious free.", "author": "Lucas T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-17", "description": "Here's the truth - we needed a bathroom!  Ok... and maybe a beverage.  We stopped into this Cash only bar and endd up staying for three rounds while the Giants game was on!  And, to top it off it was happy hour: $2.50 Stellas - WHAT?  Yeah, amazing.  No frills dive, friendly people, and plenty of screens with games on.", "author": "Maria B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-15", "description": "Wandering around the city, we wanted to sit down and have some drinks.  We walked right into this place and it was great.  Good drinks at a cheap price.  Pool tables and music.  Very relaxed crowd and the bartenders were nice.  Great place is take a break from doing touristy things and enjoy some drinks.", "author": "Kim T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-08-29", "description": "Britney the bartender is very cool and I actually dont hate the place.\n\nBased on a recent experience I wont be going back. I have spent plenty of money in the bar and went in to watch the end of a sports game. Literally place was empty but was told by the self proclaimed 'owners best friend' that I was sitting next to to get the f out unless I ordered a drink. The bartender also asked me a bunch of times and they were both pretty insulting. I love a good beer, but not always trying to drink on a weekday after 10PM\n\nI get it, you are expected to order drinks at a bar. i have spent plenty of money at the place and figured if I wanted to watch the last five minutes of a football game there it wouldn't be an issue. \n\nBasically was insulted and thrown out despite the fact I have given them plenty of business before.\n\nWont be going back thanks to their welcoming attitude.", "author": "Todd L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-19", "description": "Great hole and free pool!\n\nLove this place! Drinks, pool, characters that live here...what else could you want!!", "author": "Talisha M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-06-03", "description": "A few years ago I was making my way to Cobb's Comedy Club and saw a sandwich sign advertising well drinks for $2.50.  I was in awe, who the hell charges that little for a drink? And in San Francisco?  I made a mental note of the bar and promised myself to check it out another day.  I used to work two streets over on Bay Street and Mason and decided to check out the bar for their happy hour special on a Friday afternoon.  \n\nI made my way up to Columbus and there were plenty of patrons taking advantage of the drink specials.  The vibe was pretty laid back with a jukebox in the corner, pool tables, and flat-screen TV's.  In addition to the bar they also have a few tables and bar stools beside the wall for people watching.  Their prices are what seal the deal: $2.50 for draft beer and well drinks.  They also have a specialty drink every day of the week.  Friday is Long Island Iced Tea and Saturday is a Long Beach, both pint-sized for $5.  \n\nThe service is always awesome and the owner is always there in the day (a older Asian woman).  She's very polite, friendly and engaging with all her bar patrons and is a joy to talk to.  There's typically one bartender on duty, which works out just fine for the amount of customers coming in.  I don't get to visit this bar as often as I'd like since I don't work in San Francisco anymore, but they've added free WI-FI and they still have free pool on Wednesday's.  Lastly, the bar was used in a few episodes of NBC's drama, 'Trauma', so keep an eye out for it when on TV.\n\nSide note:  Bring cash, they don't accept credit.", "author": "Alexander E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-10-10", "description": "My first time at this place was a couple years ago when the Giants knocked off the Patriots to win Superbowl XLII.  I'll never forget those great memories.\n\nWe went back tonight as part of our little bar hopping evening.  It's a great spot with daily drink specials and friendly bartenders.  Outside of the specials, the drinks are typically priced.", "author": "Paolo D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-31", "description": "Great bar! Brittany is a stellar bar tender. I saw her deal with a bunch of knuckleheads who paid her in change. In fact these knuckleheads left a negative yelp calling her uneducated. Let me educate you \"boys\", when you go to a bar you tip. You can't afford happy hour at $2.50 +a dollar tip stay home. Fun place to drink, chat, and hang! Party on!", "author": "Cara G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-12-08", "description": "I must say the bartender was super rude to us when we walked in. My friend and I didn't say anything yet and the bar tender said theres no bathroom use allowed. We weren't looking to use the restroom. We just wanted to buy 2 water bottles. So we asked if there were any water bottles for sale. She rudely said no only booze for sale. Ok I get it its a sports bar but she didnt have to be rude to us when we first walked in!! Its not like we were rude or anything.  She just assumed we were in there looking for a restroom to use. Such bad customer service!!", "author": "Jenny S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-04", "description": "Great place in north beach to get a pint or a stiff cocktail. Free pool on Wednesdays, great jukebox, and nice bartenders especially Brittany!!", "author": "Robert F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-08-01", "description": "I only have 3 things to say:\r\nMonday to Friday, 4 pm to 7 pm, $2 drinks.\r\n\r\nyup\r\n\r\ntwo.\r\ndollar.\r\ndrinks.", "author": "Michael G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-07-13", "description": "I don't know how this place continues to uphold a good reputation after the bartender Brittany gave us the most rude and discourteous service yesterday. We came in and asked if there was an iPhone charger we could use, she said with her snobbish \" ya only if you buy something\" I proceeded with a yes that's why I asked, she then continued with a \"you could say please and thank you.\" Ummm, wait what? Are you my mom? I thought it was a joke, I get it you work at a bar in SF you're cool but there is no need for hostility. When I tip you over 50% that is my THANK YOU. Of which I didn't even get the chance to sit down and have a drink due to the animosity that filled the room when we walked in the door. What happened to being nice to people regardless of how they treat you, especially considering the fact that this is not your business? But anyway, me and my friend got extremely offended and things got out of hand to the point where Brittany's possy at the door thought their cussing us out will do anybody justice, can't believe we wasted energy arguing with these nimrods.", "author": "Monica A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-11-18", "description": "Dirty stinky hole.  Nasty.  Bad.  Foul.\n\nHOME.", "author": "Michael H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-02-21", "description": "Over the course of a long and happy life I have developed a few rules and guidelines to help me along the path to righteousness. Now and again it is good for the soul for me to break one of those rules, and it was at this bar that I broke the only drinking rule I have ever had in my life, and what surprised me is I do not regret it at all.\n\nA rule is not a guideline, a rule is typically hard and fast. My drinking guidelines are something like this:\n - never drink vodka, except in a bloody mary, and only then before noon\n - if they have a signature cocktail get it \n - don't ask for Guinness unless you know it's good\n - draft beer before bottles\n - cask before draft\n - always get your round in\n - if you don't feel like a drink have a budweiser or a miller lite instead\n\nand so on. Nothing too tough, and if you miss a guideline once in a while, no big deal. My drinking rule, the one and only drinking rule I have lived by my whole life however, has always been something sacrosanct, invioable, a holy vow:\n\nNEVER DRINK AN IRISH CAR BOMB !\n\nThat drink is wrong on so many levels. Why spoil good whiskey with Bailey's? why spoil a perfectly good Guinness by dropping the whole concoction in there? And why chug it like a man who has been under siege for twenty years?\n\nAnd let's not even get into the name. I'll give you that as a coda for peace the drink is better than the real thing, but when you have seen the real thing and know what it does you don't find it that amusing.\n\nDo you think we'll be drinking IEDs in some bar in 10 or 20 years time? We probably will, and they might even be available somewhere already.\n\nCuriosity, and a line-up of about 12 car bombs, one of which had my name on it, got the better of me, and I had one at this bar whilst enjoying an absolutely magnificent night at this establishment with a bunch of good friends, and which was punctuated only by calls from a very very mad The Honey asking me what the hell I was doing at Michael H's bachelor party in SF when I should be home with her and the children in a Snowmageddoned DC.\n\nThe Honey is very much like the Car Bomb - the real thing as well as the cocktail. Explosive. Dangerous. She can hurt.  Handle with care or you will end up with parts of your body strewn all over the pavement.\n\nAs for the drink - my God it was good. Astoundingly, shockingly, appallingly good. Balanced and complex, sweet and hot, requiring not a little osculatoral dexterity. Worth it in every single way.  I must stop now.", "author": "Paul M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-07-19", "description": "A dive if i ever saw one.\n\nGreat happy hour though! And an odd little fish with a heart drawn on it. Seriously--look in the fish tank.\n\nI dont love the international, I dont hate the international. Im just glad i can get a strong drink for $2.50 a block away from my house.", "author": "Britney K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-02-28", "description": "Coincidence or fate?  Free will versus Predestination?  I was contemplating these issues as I was sitting in International Sports Club yesterday afternoon.\n\nHow did I get here?  Ok, that is a story in itself.  Originally, my plan for Saturday was to hang out with my friend in the afternoon (in San Jose) and get my coat of arms tattoo done at 4 (which I was looking forward to for almost a month now).  At 1130, I got a text from the artist telling me I needed to get rescheduled.  Fine.  \n\nCalled up my friend, \"You wanna go to SF instead?\"\n\"Sure, why not\"\n\nDuring the drive up, we determined our agenda.  Dim sum was first because: \na) we were both Asian\nb) we were both starving\n\nAlso, we are \nc) both more white washed than a pair of designer jeans\n\nbut that's just fun to mention.  Next on the agenda was Ghirardelli Squre, for some awesome sundae of course.\n\nOnce we arrived in SF, we heard on Wild 94.9 there was the New Year's Parade in Chinatown.  Wow, awesome, both Vietnamese peeps (who can't speak Vietnamese, of course) can reconnect with their roots and watch the parade.\n\nAfter having lunch at a random dim sum place in Chinatown, we were headed down Columbus towards Ghirardelli and ran into this dive bar.\n\n\"Hey let's have shot\" (it's 4pm at this time)\n\"Sure!\"\n\nWe walked in and sat at the end of the bar next to this older couple.  We ordered a shot of Grey Goose with a Coke backer (I always called it a chaser, but I guess I better get with the official lingo).  We tapped our glasses, cheered each other , and downed our shot like pros.  The couple next to us had a shot of Cazadores and that's when the fun started.\n\nFirst she said her pet of 15 years passed away yesterday.  I consoled her and said she should celebrate his life in addition to mourning his death.  She mentioned the day before, her whole family and friends were having a party and even looking at pictures of the dog when he was a puppy, as if they were doing the wake while he was living.  Amazing.\n\nThen we found out in a round-about way her and the guy next to her were lovers, not married, but he \"proposed\" to her with the promise to be forever engaged.  She then told me when she was 15, she described in her journal the perfect man and he fit the bill.  She was married a couple times before meeting him, but she believed if she treated everyone well, she would eventually meet her soul-mate.\n\nIt was all surreal.  I was buzzed, getting incredibly deep psychological advice and it was a perfect day in SF.  Everything she was saying was really hitting home to me.  Also, they were an older white couple, we were a younger Asian pair, and we were chatting up a storm so loud the entire bar was staring at us.  We were talking to each other like us four have been best friends for years.\n\nI'd have to say it was the best day I had in a long time, so thanks for dive bars like this one and CHEERS to you Phillip and your soul mate!", "author": "Khanh D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-02", "description": "Really like the bartender here - always makes great drinks. Nice, relaxing atmosphere to hang out and have a couple drinks with friends.", "author": "Mia D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-05-08", "description": "Britney (sp) does a fine job of mixing, made a delicious cider on ice with a dash or two of bitters. Highly recommended!", "author": "Jeff K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-07-19", "description": "Dive bar... it was kewl and all but I couldn't understand the bar tender... not good!", "author": "Chris O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-24", "description": "Four stars for value-to-quality ratio. This might not be the swankiest place in town, but a $2 happy hour? In North Beach, San Francisco?! Automatic high list. A good place to go out before you go out.", "author": "Jay B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-27", "description": "Great location, and the happy hour was phenomenal with $2.50 beers (not just any beer but Hefs and Stella Artois) and well drinks.  We went on two different occasions and both occasions we got female bartenders who were delightful.  Will definitely go back on our next visit to the City.", "author": "Donna C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-10-31", "description": "I love a great happy hour and this place has one! Cheap drinks, comfy seats, pool tables, friendly crowd. What more could you ask for??", "author": "Laila P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-11-10", "description": "The happy hour here is pretty ridiculous. I wouldn't call myself a happy hour aficionado, but I've been to my fair share and have never seen drinks this cheap. Plus the service was great, one of the employees (maybe the owner?) was playing pool right next to us, and made sure we got orders in before happy hour ended. They filled our table with drinks and the average price was no joke, 2 bucks each.\n\nGreat place to go before seeing a show at Bimbo's across the street.", "author": "Matt F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-05-23", "description": "I went here twice on my vacation and both times, my girlfriend and I had a great experience. This place has the cheapest drinks and funniest people. Happy hour 4-8 ,$2.50 drinks! You cant beat that! kinda small but who cares. I still had fun!", "author": "Zeke T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-08-31", "description": "A few randomly placed origami swans, Chinese lanterns and lederhosen do not make a bar \"international\". Okay, they may not ACTUALLY have lederhosen, but even if they did, which would be cool for sure, it would not make this place any more international than a chicken shack in Kentucky. \n\nIn addition to the swans and lanterns and dilapidated country flags hanging from the ceiling they have run down office chairs to sit in, a few pool tables and a horrible juke box that skips occasionally. I would say it would be more appropriate to call this bar irrational than international, but that is just me. \n\nSo why 4 stars, you ask? 2 reasons, one of them not useful at all, and the second quite useful indeed, so listen carefully! \n\nReason 1 - this is where I hosted my very last (Un)employment Tuesday. Not because I had a job yet, but because I was sick of enabling all of the lushes I know. Okay, that is a lie, I love enabling all of the lushes...I was just sick of planning it every week. 2 days after calling this wonderful event quits I actually got a job!! That's right, I am now employed! Look out world.....Drue has a job!!!! (Thank you SFMOMA, you have no idea what you have gotten yourself into!)\n\nReason 2 - PAY ATTENTION!!!! $2 beers from 4-8 everyday. That is 4 hours of $2 beers. 7 days a week. US dollars, in case you were confused. Good beer too, in case you were wondering if they were going to try to pass off the  \"king of beer\" or the \"champagne of beer\" as the deal of the century. \n\nIf that isn't useful I don't know what is.", "author": "Drue C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-10-29", "description": "The International is a nice, kind of grubby little bar in North Beach. I can't say there's anything especially unique about this place but it does have two pool tables with decent cues and a sweet jukebox.\n\nHowever, when we ordered our drinks (three shots and three beers, all the same) it took the Asian dude working the bar literally two minutes to figure out the bill. It got to the point where *I* was even offering figure it out for him. Yeah, it was that bad. For all I know he just came up with an arbitrary number just to save face. An Asian dude who can't do math? Come for the drinks, stay for the freak show!", "author": "Josua P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-09-11", "description": "Neat spot, but hard to rate more than one star when the beer isn't cold. Come on man!", "author": "James B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-08-15", "description": "Given the name, I imagined this would be something like IHOP except with beer instead of pancakes. Boy was I wrong.\n\nI'm not sure why it's international; There were a few asian dudes hanging out near the back, but aside from that it seemed more or less like any other neighborhood bar. That is, a neighborhood bar with $2 PINTS UNTIL 8 PM. \n\nThere is one (1) outdoor table on the intersection of taylor, chestnut, and columbus, which is a decent place to people-watch. Many of their chairs are actually office desk chairs, so you can close your eyes and pretend you're drinking at work. \n\nSports on TV. 2 Pool tables. It'll do.", "author": "matthew r."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-05", "description": "Great bar to get cheap drinks and to be with friends. Went there on a Friday night and it wasn't busy. It's great for groups and it has pool tables and foosball. It's really a simple bar with cheap drinks. I would like to see more beers on tap, but that's the beer snob in me. Check it out if your in the area.", "author": "Zachery H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-08-15", "description": "This place is a hidden gem in regards to the $2 Happy Hour on ALL beers. $2 Anchor Steam! $2 Fat Tire! $2 WHATEVER! This is awesomely dangerous.\n\nI managed to keep my $2 beer consumption to a relative minimum, but noticed a few things about this place...\n\n-Broken Office Chairs\n-Skipping Jukebox\n-Patio area (or lackthereof)\n\nI will be back, but only for the $2 beer.\n\n---\nUPDATE:\n\nThis place charged me $7 for a shot of Fernet! W-T-F???\nAnd then when I asked a different bartender, I was told the shot only cost $5 (still a little pricey)...\n\nColumbus Cafe for my shots k thx", "author": "matt m."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-25", "description": "I started coming here a few weeks ago and this is a pretty cool place. Nice pool tables. I started playing here at least once a week in the pool tournament.", "author": "Joel B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-09-29", "description": "Was forced to come to this spot when a buddy of mine from Reno came to town with his girlfriend and her mom. One of my duties as tour guide on their first night in town was to take them to \"my favorite watering hole.\" Without thinking twice I brought them to Kennedy's but that wasn't workin for the ladies because they didn;t want to drink beer or wine, enter the International Cocktail Lounge aka Kennedy's neighbor.\n\nThe bar wasn't so bad itself (sure the decor was horrible but I'm able to look over shit like that) it was the regulars that spoiled it. The people who were playing pool basically refused to let anyone else who wanted to play get in on EITHER of the tables. When asked why they were just generally not acknowledging our request to use just one of the two available tables a broad resembling Grizzly Adams more than a little bit, made me aware that \"we do this every weekend, sorry.\" Well, be that as it may Grizzly, it still doesn't exempt you from common bar/poolroom courtesy. Eventually we got to play but by then I was already soured on the whole place. If I ever come back to this place I'll bring a Gillette for my female friend and my  'A'  game for her pool table dominating buddies. But it's doubtful I'll ever return.", "author": "Tommy P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-08-15", "description": "I was going to give this place 3 stars, but then I remembered how much of a bad mood I was in when I got there, and almost didn't go because of that, and then when I got there I was immediately in a better mood. Extra star! I missed the Happy Hour but other people there seemed to have taken full advantage of it. It seemed like a good place to get drunk for cheap, but there are some other places in the city that I can do that that I'd rather go to. \n\nDoes this review make sense? I have a massive hangover.", "author": "Laura D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-05-09", "description": "Drinks are wet.. Bartenders dealing cards.. Just gor peanut butter stuffed pretzels as a bar snack... Wtf awesome.... Cool stop on the way to the wharf.  If we make it..", "author": "Robert F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-04-13", "description": "A classic true dive instead of a trendy marina dive.\n\nMost people see it as a place for drinks before or after a Bimbo's show, but if you want to drink hard liquor while shooting pool without being continually hassled or distracted by attractive women this spot has to be on your list.  It's on mine.", "author": "Jay W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-09-20", "description": "I like this place.  This is where I go when I need a stiff drink with friends after hanging out at my favorite beer, wine and indian curry bar next door.  The bartenders are great although you get some serious randoms in here.  This is a straightforward drinking spot with a single pool table and an okay jukebox.", "author": "Theron L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-04", "description": "Was super cheap and quick. Pool was available and overall a good atmosphere. Just a solid dive bar worth the stop.", "author": "Tyler C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-07-06", "description": "Complete hole in the wall bar.  \n\nUtterly totally a dive bar.  \n\nBut that is precisely why I like it.  It's warm, the people range from super casual, weird eclectic types, preppy people, Marina people that are obviously lost, and girls dressed to go clubbing, more than anything else.  So if you're looking for a variety of people, this is your spot.\n\nThe main thing that stood out for us was this:  $2.50 well drinks, cheap beer, and cheaper shots.  \n\nThere is a pool table, a few (and I mean few) cocktail tables, and a table or two outside.  There was no real international theme as far as I could tell, but that's okay, because I don't feel like anyone in there was looking for the theme at all.  I think they are in for the cheap drinks.  That's just a guess.", "author": "Denise B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2006-03-29", "description": "I don't really have too much to say about the International Sports Club. we had decided to check it out since it was next door to Kennedy's. well, they didn't serve curry like Kennedy's did, so that was a strike against them already. They also didn't have a foosball table or air hockey. Basically, I really couldn't see any reason to go to this place if you have Kennedy's right next door. What they did have was a drunken frat guy who decided, instead of waiting in line for the bathroom, to piss on the kegs that were sitting in the hallway. Classy! Also, their bartenders lied to us and said that the place had run out of beer and only had liquor left. Minutes later, we saw them serve beer to someone else. Why would you lie like that to your customers?\n\nSo basically, I cant say I got a good impression of this place. Oh wait, now I remember what this place had that Kennedy's didn't... at Kennedy's they served only beer/wine, but here you could get the hard stuff. In fact, we had come here specifically to get some Irish carbombs, but as I mentioned, we were told that there was no more beer. Lame! So, I guess if you're desperate to drink hard alcohol, you could check this place out, but otherwise, definitely stick with Kennedy's.\n\n(my resolution this year is to visit 50 new bars in SF.  read about it at: http://fiftybars.thisisvlad.com   )", "author": "vlad k."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-04-21", "description": "Every time I'm in town I visit the International to toss back a few drinks.  I usually meet some local friends there. It's just a mellow, laid-back place that's easy to find, with good service and a decent selection of drinks. Great deals during happy hour, and of course there's the jukebox and a couple pool tables.  It's never been too busy when I've been there, but it gets a decent sized (and friendly) crowd on the weekends.\n\nUpdate: Just visited The City again and stopped in for a mandatory vsit to The international. (We make it a point to go there at least one night to hang out with friends during our trips to the Bay Area.) You can't beat the happy hour that's EVERYDAY from 4-8pm. Draft pints and well drinks are just $2.50. I had several tasty Anchor Steams. The service was great, and the other patrons were firendly as always\n\nIf you're visiting and staying in the Union Square area, just hop on the #30 bus, it stops literally at the front door of The International.", "author": "Russ T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-02-24", "description": "Cool bar in general. Only three stars though bc there was no music. There was a terrible touchscreen jutebox that hardly worked, was expensive, and had a poor music selection. So, if you wanted any music in the entire bar, you had to pay for it. That part sucked and is why we ended up leaving.", "author": "Amy S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-07-06", "description": "1 star - for Happy Hour drinks - DO do the happy hour. it's worth it.\n\n1 Star - great location to people watch (sit outside - there's only 1 table there so you'll feel like you have the corner to yourself [not like a hooker...but you get it]) because the cable car stops at the light right there and anyone who tries to get on at the corner gets a pretty good tongue lashing from the cable car operators. heheehhe, very funny especially after you've had a few drinks ;p\n\n1 star - for having a pretty clean restroom (for a dive bar in SF).", "author": "Mel P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-08", "description": "Great place to slam some fast,cheap drinks on your drunkin' merry way!", "author": "Kevin B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-02-21", "description": "The ISC is truly a place where everyone knows your name.  I look forward to future trips to SFO so that I can come back to ISC.  The Happy Hour anchor steams were the best.", "author": "kevin s."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-23", "description": "We stopped by here after a comedy show at Cobb's. For a dive bar, this bar was pretty nice. The drinks are cheap (for San Francisco), seemed like everything was $5 and pretty strong. The bartender was also really friendly! It was spacious unlike other dive bars with two pool tables and a foosball table. The only down part was that it was cash only, however that may be why the drinks are much cheaper than other SF bars.", "author": "Shali N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-05-21", "description": "random bar placed in north beach.  it gets the transients, locals, crackheads, etc.  you name the crowd/type and there is a representative from each at the international cocktail lounge.  \n\nmaybe that's how it got it's name as it lives up to it.\n\nthe bartender on the weekends is a sweet asian girl.  you get veggie chip snacks at the bar for free.  great happy hour as well.\n\ni do love my dives..", "author": "Sheri N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-04-29", "description": "Great happy hour - all well drinks from 4 - 8 pm are $2.50, which is pretty sweet.  They're not the hugest drinks as someone said, but well-mixed and can't beat the price.  There's also a board with different specials for each day of the week, which we didn't take advantage of, but appeared to be great deals as well.  Bartender was super-nice and funny, and the crowd was wacky, as is probably to be expected when everyone's drinking heavily and cheaply. Overall a good stop-in!", "author": "Jaimie M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-13", "description": "$2.50 happy hour wells and drafts 4-8pm. Great place to watch a game and listen to Bob Marley!", "author": "Kassandra M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-05", "description": "northbeach dive bar...$two.fifty draft 'til eight pm....daily cocktail special and sprinkling of free pool nights...dropping in on $five long island friday....weaker form, but worthy of $five bucks....friendly social all-age crowd....fantastic northbeach guantlet stop...pub crawl stop after seven pm $two guinness end at neighboring kennedy's...", "author": "Hen A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-10", "description": "All of the positive reviews of this place are true...great happy hour for very little money!  You can get blind drunk here, be somewhat obnoxious and no one bats an eye.  One of my favorite bars in San Fran.", "author": "Nick T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-02-18", "description": "Where to start?  This bar rocks, it is probably the most genuine bar I have found in my (admittedly short) stay in SF.  The bar staff are amusing, and the female bar staff are pretty hot too.  The drinks are exceptionally cheap ($2 happy hour everyday between 4 and 8, can you get better?), the locals are eclectic, friendly and generally pissed as newts.", "author": "Aaron B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-08-14", "description": "Based in the Happy Hour alone, I would go to this place everyday if I could. Where else can you get $2 beers in the city in a place that doesn't get overly crowded 5 nights a week. The beer selection is pretty good too considering the cheap prices. It really has its own character but its a cool place to hang out. FYI...to all the ladies....the bathroom is usable so don't be intimidated by the weird hallway that leads to it. Their happy hour is way better than Kennedy's, so go here for drinks and have some fun.", "author": "Annie M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-10-16", "description": "well, they have liquor here.  which makes it better than kennedy's next door.  \n\nlets see, its dirty, the pool tables kind of suck, they water down their drinks, and apparently will over charge you if you are drunk.\n\nbut hey, they have liquor.  god does north beach need some better bars.", "author": "Steve S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-12-19", "description": "This isn't a bar to pop into, notice all the flaws, and then hate forever.  It's like your first Fernet shot:  Pretty abhorrent, makes no sense to try again, and visually and nasally unwelcoming.  However, you try that Fernet a few more times, and it starts to grow on you. \nChoose your night carefully, a bad Bimbo's show can fill the bar with douchebags, and there are already enough regular douchebags.  You know what happens when you get too many douchebags in one room?  Yeah, it get's pretty messy.\nFor the other reviewers, the International theme is (sort of obviously) the wall of currency from around the world.  Hard to trust a review from an unobservant author, but the more bad reviews, the fewer people trying to get on the pool tables, so trash away!\nProbably the biggest plus is the hellishly strong drink served here.  Follow that closely by weekly local pool tournament for only $5, nightly dice games, and happy hour cheapness.\nBiggest weakness?  That's easy.  Sausage fest.", "author": "Billy C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-08-17", "description": "Sunday Fundays with adorable bartender Diana :) This bar can be really fun and random on Sundays! The bartender makes tasty bloody marys and they usually have multiple games on at once. There are pool tables and a juke box that actually holds some pretty good albums in it! Better than a lot of other bars in the city! The decor is plain and simple and looks like a typical sports bar. Make sure to take advantage of  the \"every day\" happy hour specials!", "author": "Angela S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-02-25", "description": "I think the term \"Dive Bar\" was coined for this place.  The jukebox is good (all be it a little limited), the beer is cheap ($2 during happy hour daily), the 2 pool tables are slightly crooked (free pool every Tuesday during happy hour), the bar staff are just a little more sober than the patrons and the regulars are generally friendly and nearly always interesting.  If you prefer your drinking hole to have an edge, this place is for you.", "author": "David W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-05-22", "description": "I loved this place.  Although Im a beer geek it's a hard place to not drink liquor.  I know people mention the sports but they have like 3 smaller size tv's witht he games on but it's more a backdrop the back 2 back days I went there. It's small has 2 pool tables and red carpet, foreign currency taped to the wall, korean artwork and these crazy lamps. It just feels like your Grandma's living room.  The bartenders were rad and very nice. The happy hour was 2$ drinks.  It was just a very laid back living room esque style place that just sat right with me.  The locals in this place made me feel as if I was a local and i had no problem chatting up groups of folks for conversation! Great jukebox. Whens the last time you heard Rhinoceros from the pumpkins in a bar?", "author": "Declan M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-12-12", "description": "Harold Ramis' oldest son is the bartender here.. and he's always on point.  what more can you really ask for.  cheep beers as well.", "author": "Nate A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-11-12", "description": "We stuck out like a sore thumbs and didn't feel welcomed.  It's just a standard bar with regulars.... unfriendly ones at that.  I had a really, really gross \"Long Beach\" since it was the special.  The bathroom as disgusting.  I would skip it here.", "author": "J. N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-12-30", "description": "The drink prices are on par with what you would expect from a full bar. I think the owner depends on hiring cute girls to sell drinks, as if they didn't sell themselves.", "author": "Chris S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-10-16", "description": "My favorite dive bar on the edge of North Beach. $2.50 pints every day of the week from 4-8 pm. Lots of regulars. Usually low key.", "author": "Jennifer T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-01-24", "description": "came here for drinks before the raveonettes show at bimbo's 365 club, nothing to write home about, but the three old men at the end of the bar was a sight.  place is really, really bright.", "author": "Pickle R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-12-10", "description": "Bar now has NFL FOOTBALL PACKAGE for all you football fans out there!!!! Plus, as always, daily specials (6 dollar bloodies on sunday), beer and shot combo specials, and everyday 4-8pm happy hour (2.50 all drafts and well).", "author": "Diana D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2007-11-14", "description": "I used to live around the corner from this place, and remember kind of digging it......................now, not so much.  We wandered in before the Stars show at Bimbos' and seriously, the chick \"bartending\" was possibly the biggest retard ever. After making me repeat my order three times (ummmmmmmmmm......Stoli and soda. There are two ingredients, braniac), she brought the rest of TSM the wrong beers. Once they realized this and asked for the correct order, she got all bent and said since they had taken a sip they were stuck with what she gave them. What, exactly, would she have done w/ the beers if they hadn't taken a sip? Re-sold them to the toothless fat guys at the bar she was so taken with? When Ed asked her which bartending school she attended, she replied \"You can't go to school for bartending\". Uh, yes, you can, and yes, YOU should! Right away! We hightailed it to Kennedy's and had a much better time- the girls there ROCK. As for the \"International\": BAD RETARD! NO TIP!", "author": "David M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-09-12", "description": "Dont let the name fool you there is really nothing international about the place.  My guess is the name is a draw for tourists.  What it is is a great bar with a constant flow of locals and tourists alike with a 4 hour happy hour nightly with 2 dolla beers.  Most of the locals like to play pool there, with 2 tables and tourneys on wed night there is always someone ready to play.  Across the street from the Nash is one of the SF's hot spots, Bimbo's 365 Club.  With the overflow from Bimbos before and after the shows on Fri and Sat  it can get busy with a hip well dressed crowd as the club crowd from Bimbos likes to take in an extra drink or two.  If you are hungry, Kennedys is right next store, famous for its India food, many beers on tap and games.  One more important thing to remember about the Nash are the bartenders.  Moona the owner does a good job hiring cute batenders so say hi to Sonia a North Beach local, a hottie, and a batender at the Nash for 10+ years.  Overall, there is always a good time to be had at Internationals", "author": "Brian S."}
