{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-02", "description": "Atmosphere:B\nPresentation:B\nTaste:A+\nCleanliness:A\nwait time:A\nPrice:A\n\nBest place to eat for late night.", "author": "Siavash M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-10-24", "description": "the food is disgusting. trash. the to go pick up area is not organized and it takes forever to order food for pick up. it is such a horrible environment. \n\nthe food is bad. the fried rice is too spicy. the spice is not delicious but a bad kind of spice. it is too strong. \n\nthe grilled pork shoulder had a musky smell. it was not fresh and tasted old and frozen.\n\nthe yellow curry was too scrimpy on chicken. the potatoes were not cooked well. horrible horrible horrible\n\nthey also have a poor rating by health inspectionand have rats and rodents roaming around", "author": "Angelo P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-08-02", "description": "Open late, but doesn't taste great!\n\nThe only good thing about this place is it's open till 2am.\n\nOne night I decided to try their tom yum soup with chicken. The soup was pretty good. But the at the price of $17 (including tax) for one order of soup, the prices definitely do not match what is displayed on their website! \n\nThe next time I ordered pad thai, Penang curry with short rib (per recommendation), papaya salad with crab, and again the same soup. The food was nasty and mostly ended up thrown away! The pad thai was noodles slathered in oil but no actual sauce of any kind. The Penang curry nuts that had rotted! Most disappointing was to pay $70 for such lousy food. \n\nDefinitely will NOT be coming back here.", "author": "Zahra H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-15", "description": "I went on a weekday during their lunch special. For $15 you can select one of their stir fry dishes off the lunch menu along with a curry from the lunch menu, and an egg roll. It was definitely a lot of food for the price which was nice. My only real complaint was the lack of selection from the lunch options. You must dine in for this lunch deal. Overall it was a good meal, with fast service. I also like the shrimp fried rice here. The food here is fairly spicy here as well, which is a major plus.", "author": "Wilton F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-10", "description": "The BEST Thai I have had in 30 years!! Awesome job on food and service. Have to come back because too many great choices on menu!! HIGHLY, HIGHLY RECOMMEND. Pricing is VERY reasonable to add to an already great experience.", "author": "John H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-30", "description": "The husband and I were hungry and cold, and randomly stopped in for a bite at iThai. We got the roti and curry appetizer which was beautifully presented. I wish I had taken a picture, but we scarfed it down as soon as it hit the table.  needless to say, it was good. There were 4 pieces, decorated with pell pepper and basil leaves, presented on a plate with green curry. \nWe also ordered the crab fried rice, which was also good and the crispy pork belly with Chinese broccoli. The pork belly was super crispy and generous, and the broccoli soaked up the delicious sauce and was delicious. \nOverall, we had a good experience. The dishes we had were all good and the staff are very friendly and attentive.", "author": "Sarah K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-16", "description": "Excellent quick Thai food. I had the lunch special and it was a to of food! Been playing with a vegetarian diet and they had some great options that were filling. I'd come back again. Plus right across the street from my hotel. \n\nOh and get the Thai coffee", "author": "Lance P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-08-11", "description": "Avearge food. It's good for a late night snack. The larb was okayish. Pro tip - extra spicy is REALLY spicey.", "author": "Rohan K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-09-04", "description": "iThai has been one of my favorite places to go in the area ever since I checked it out. One dish I really love is their fried rice - it's so good and spicy! I went with a couple of friends this past Saturday and unfortunately the service was not as good as I had anticipated and left my friends and I feeling a little awkward. We ordered a beer tower but they didn't even bring us water until the very end of our meal - which is something I was really confused about. Hopefully next time this is not the case and the service is better. Was definitely a little disappointed", "author": "Alysia T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-25", "description": "Ordered from this place for delivery through Eat24. I was looking for something authentic and that would be true Thai spicy when you order spicy. Boy, it's pretty spicy! I love it but next time will probably order medium so I can enjoy it more without needing to take breaks. \n\nHighly recommend the krapao aka basil chicken! Very flavorful with basil leaves, bell peppers, onions, juicy chicken, and lots of chilies! Delicious though! Also recommend the pad kee mao with beef. Very spicy as well; I could see the chili seeds sprinkled all over and every bit was intense. \n\nWould definitely order to go again. It's pretty quick...even though it estimated delivery would take an hour 15 minutes it came 25 minutes sooner.", "author": "Melissa L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-06-12", "description": "Overpriced Thai food near union square that is tasty and open 24 hours. Honestly, the food is good but the pricing doesn't reflect the portions but whatever. The spicy eggplant is super spicey and that makes me happy.", "author": "Frank L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-09-17", "description": "Ordered from Postmates\nGot egg rolls\nJasmin rice\nRoti\nYellow curry\nIt tasted quite good but was super greasy and totally made me sick- will not be ordering again", "author": "Julia S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-06-16", "description": "This is the review for the delivery. If you ever think about order delivery, better don't order from this restaurant and grubhub. I was waiting more than 2 hours at my hotel for the food and the deliver person said they gave it to my mother. Everytime when you go out to deliver,you need to call the customer on the phone so they can confirm and come out to get the order. By the way, I'm staying alone with no mother or father. Any strangers could pretend to be the mother to get the food while the real one is starving.Now i want my refund. My order number is 205604598085363. Order at 8:34pm on 06/16/18. I don't want to waste my money on the terrible service.", "author": "Joyce V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-02", "description": "This's hidden gem for this area! The most authentic Thai restaurant where becomes my regular place for Thai food\nIf u want the real thai food, u should come here\nThe staffs are very nice and friendly \nMy favorite dishes here are Pad-Kra -pow and Pad see u", "author": "Yokyok N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-27", "description": "Potatoes in the chicken curry weren't cooked entirely...earthy AF.  Some of the meat was rubbery and questionable.  Coconut soup to go was 40 oz of mushroom mess.", "author": "Teyo B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-30", "description": "Great authentic Thai food! Great taste and nice people. Polite delivery man.", "author": "Tanyaporn T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-10", "description": "GET THE Kao Pad Kraprow FRIED RICE. JUST GET IT. Spicy and delicious. So delicious. The duck noodles are also quite tasty, but I can't vouch for them like the Kao Pad Kraprow fried rice. \n\nEverything else is just OK. I've been disappointed by their stale egg roles more than once. \n\nThe restaurant itself is super dark, but that's fine when you're only ever ordering Kao Pad Kraprow fried rice to go. \n\nThey're open late and speedy with to go orders; always ready before original estimated pick up time.", "author": "Christina G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-12-12", "description": "This is still my favorite thai restaurant out of all the places I've been to. Their food always tastes good and portions are always big. Thai food is usually overpriced but I think this place has it at a decent price. The reason why I'm giving it three stars is because of the service I encountered today. My friend and I walked in at an awkward time around 5pm so there was literally no one in there. When we walked in, we weren't greeted or anything, nor did the lady in the front acknowledge us till we said hi. Ummm what the heck??? She then told us to sit wherever we liked so we sat down and she brought the menu over to us right after. I already knew what I wanted and so did my friend, so we waited for her to come back to our table to take our order. I literally had to say three times \"I'm ready to order!\" for her to come to us. I have no idea what she was doing because hello, we were the only ones in the restaurant until later. Besides this rude service, I enjoyed the food like I always do!! I will of course still come back because it's my favorite Thai restaurant. It's just weird because service is usually on point besides today.", "author": "Lisa W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-09", "description": "So i ordered some kao moo dang and some kao pad gai tod. And i found this in my food. Lol im not going to lie it was good until i found this . Im completely disgusted. Im just glad i was the one who found this and not anyone else that wasn't paying attention. Please watch what you get from there because this looked like piece of metal with a point inside that looked a little green around it so did the meat. Im thinking of seeking and taking this in a much farther manner. I need some opinions. AND PLEASE SHARE THIS SO THAT OTHER WOULD BE AWARE. if this didnt happened i would've given you guys 5stars. Please be careful what you serve your costumers.", "author": "Joshua R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-17", "description": "Great place! The food is amazing! The service is fast and very friendly. For sure a 5 Star place. \n\nI will be recommending this place to everyone I know that loves food Thai food.", "author": "Amos M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-13", "description": "Everything was wonderful!  The staff - very pleasant and welcoming.  The decor - understated, which is nice after the continuous bombardment of the senses that is S.F.  The food - so, so good.  I was with 3 others who had little to no experience with Thai food.  We started with Tom Yom Goon soup and it was the best I've ever had!  All 3 were won over immediately.  Pad Thai, Pranum something or other (beef w/peanut sauce over veggies) and a shrimp dish with glass noodles.  All were good.  Add rice and cucumber salad and a bill that was just $60?  Hard to do better than that.", "author": "Marcella E."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-10-05", "description": "The worst Thai delivery experience I've ever had.  \n\nOrdered lunch for 8 people at work today.  NONE of the food came labeled.  We had no idea which food belonged to which person.  \n\nOne of the noodle orders was supposed to be chicken and they made it with beef.  \n\nOn top of that, food quality was poor, noodles were too hard and EVERY SINGLE curry dish came spilled!  EVERY SINGLE ONE...like they didn't close the lid properly or purchased cheap containers. \n\nNever again.", "author": "Vi Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-06-27", "description": "Food was great but service was really slow. The ginger  garlic rice and chicken curry was outstanding. I can eat the rice by itself.", "author": "Jun G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-04-13", "description": "We came here as we were staying very close by with some friends. We were NOT greeted well and found the staff very rude and not friendly at all. I was extremely shocked at the attitude the waiter gave and will NOT be coming back. Food was mediocre and the plates were dirty. We did not enjoy our time. Spend your money somewhere else!", "author": "Jack L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-30", "description": "Love these guys. An excellent deal on Thai with late hours, perfect for post-bar munchies--and even better if you love Thai karaoke! Good for tables of two and for large groups.\n\nI wouldn't mind a few more vegetables but almost everything I've had is on point: Spices sear at the right speed, coconut soups offer layer upon layer of flavor, and I've seen few places Thai or otherwise that offer such a straightforward and well-prepared presentation of grilled calamari. A recent menu update is an improvement and adds an impressive array of choices.\n\nService is friendly and always prompt and efficient, and they're lightning quick on takeout. Far and away the best overall Thai option in the neighborhood, worthy of your attention both early and late, especially when you're hungry and not looking to break the bank.", "author": "James D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-04", "description": "This place will definietly be my most favorite Thai place in SF.  I ordered yum woonsen, grilled pork, yen-ta-fo, hoi-tod, yum-pladook foo. There are all super delicious. If you wanna tried authentic THAI food, I suggest iThai.", "author": "Pinyapon D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-13", "description": "The girls working the front doesn't have the greatest customer service. Overall spring rolls was bland and expensive for a couple pieces.", "author": "T P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-08-26", "description": "Got delivered on a Friday night. The fried rice dishes were yummy but the Giew Tod were burnt and both noodle dishes were over cooked mush.  Only place I've seen have Mussamun lately. Won't try again as delivery.", "author": "Marilyn C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-22", "description": "I ordered delivery from this place after I got off a long transcontinental flight.  It's open until 1230, which is a god send when you're having to burn the midnight oil.  I ordered a chicken pad kee mao and stir fried veggies.  The pad kee mao was delicious--simple but flavorful.  Didn't include a whole mess of stuff that a lot of thai places do that make your pad kee mao end up looking like a brunch stir fry w/the entire kitchen sink thrown into the skillet.  The veggies were good, seasoned w/oyster sauce, and not overly salty.  The prices were reasonable too.  I'd definitely repeat my business here.", "author": "Crystal C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-02-20", "description": "Why can't the SF Bay get Thai right? This place was no exception to my disappointment. Something is missing; maybe it's the Holy Basil. Maybe it's the water. Maybe it's the clientele. Whatever it is, this is Americanized Thai for techie bot-people and hipsters. Even the names for the food on the menu are barely recognizable as authentic Thai. They make a fried rice sauteed in ketchup dish. Gross! I'm going to fall to my knees and worship the ground when I get back to Thai Town in LA. Two stars only because it was a smidgen better than the stuff I threw in the trash last night, and it was delivered in a timely manner.", "author": "Kali K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-24", "description": "The last time I ate at a Thai restaurant was in Miami.  This place was the only restaurant open in the area on a Monday night.  I wasn't expecting much and I had not eaten the entire day since I was flying from the east coast and weather \"ate\" my entire layover.  I literally had to run from one end of O'Hare to the other.\n\nI was looking for something light but not a salad.  I decided on the Pla Rad Kang which didn't look too spicy.  I didn't mention spice level and figured it would be fine however it came.  I should have ordered the salmon underdone as I usually like it, but it was just fine.  The sauce and salmon with vegetables really complimented each other.  I would have had a Sapporo but it was late.  I normally leave most of the sauce but this was so good I signed up for the clean plate (bowl) club.\n\nPlace was quiet and very elegant, service was attentive and friendly, and the prices are very reasonable.\n\nI WILL be back.", "author": "Keith S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-05-21", "description": "We've eaten at iThai before and always loved to the place until we ordered online! ); we were disappointed that one of our entrees were significantly smaller than usual. And it does $11, so it's disappointing to pay that much for so little. We're not sure if that's the new size or something happened in the kitchen, but beware of ordering to go folks!! \n\nBottom line: the food is still good, but if the portion is this size, it's a bit pricey!", "author": "Tandra N."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-10-17", "description": "The food is actually quite palatable, albeit forgettable. But the service, what are these guys thinking? From the first main dish to the last, a good thirty minutes, absolutely no excuse. If you don't want to end your night terribly frustrated, stay away!", "author": "Jaime L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-04", "description": "The flavor was quite different here than other places. The first bite of every dish had a special smell. It was not a taste from the dish but a layer above it. The mango ice cream tastes good.", "author": "Xi L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-02", "description": "Excellent food for a good price. Choose between different types of rice of course, and a lot of curry's! I chose one of the recommended curry's that said \"one of the most popular curry's\" in the menu. Two chilli was the sign in the menu, and the waiter was very good at referring to how strong it was for us \"not-very-used-to-strong-food-people\". Two chillis was perfect, and a lot of flavours in the meals.", "author": "Karin S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-03", "description": "It was late one night and we were craving for some thai food. Somehow we stumbled upon this gem - iThai! \n\nAmazing food and they even have karoke at night. The food was actually really good considering it was a late night snack at midnight. We ordered the pad see ew, pad kee mao, crab fried rice, crispy pork belly,and  tom yum kha, \n\nIf you are ever craving thai food, whether it be a midnight snack or early afternoon lunch, get your thai fix here!", "author": "Linette F."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-06-21", "description": "I ordered a mango sticky rice, the box comes with 2 rice but no mango.......the other orders was fine", "author": "Ryan W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-11-07", "description": "I have just order a Pad Kee Mao Nuer through Doordash and got it mild. But when the food arrived the food was covered with chili seeds and flakes. It definitely didn't taste or look like mild. I wish they had payed more attention to customers requests. That was $11 to waste.", "author": "Judy C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-06", "description": "Delicious food. We ordered egg rolls, crab fried rice & iThai beef. Sooo yummy. Fast service, our server was so sweet! Nice little spot in SF! Thank you!!", "author": "Shelly M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-06-16", "description": "iThai delivered undercooked frozen egg rolls which were completely horrible. I threw out the whole lot. The flake on the egg rolls was completely white and not even cooked. I can't believe this restaurant can't even properly bake and brown frozen egg rolls. I had the Tom Kha soup with shrimp which was a little better but overall would rate this place way below average. I can't believe they serve those frozen egg rolls and a generic sauce which they do not make! Will never go back.", "author": "Anne R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-22", "description": "Very good Thai food. The green papaya salad was very fresh and perfectly sweet, salty, and spicy (a little too spicy for the Bf). We ordered it medium spice and it was pretty spicy, even for me who loveeeeee spicy! The Bf was sweatin' like a hooker at church! The Pad Sew Mao Nuer (sp?) was excellent, we substituted the beef for tofu and added egg for a vegetarian option and it was bommmmb. \n\nI had the fried chicken over fried rice. Rice was very good and flavorful but I deducted one star because the chicken lacked flavor. The chicken tasted like white people fried chicken, probably was only seasoned with salt and pepper, coated in flour and fried. I like my chicken with at least some garlic salt and onion powder thrown in; it was also a bit on the dry side. \n\nThe mangosteen juice . Get it! \n\nWould definitely come back!", "author": "Lina L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-05", "description": "The greatest Thai restaurant in San Francisco!  I was craving Khao Soi Beef this morning and then I found this spot. It's really good Thai restaurant ever!!! #itwasBOMB", "author": "Gningerr T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-09", "description": "I got the Kaprow Gai and it was fairly tasty and not overpowering like many other restaurants. I asked for medium spicy and even that was fairly spicy, so I would say medium spicy on the Asian scale. The Kaprow Gai does not come with rice as is the case with much of their menu because most of their dishes are meant to be shared with other people. For that reason, this place is a nice place to bring your family or friends! \n\nI also ordered their mango and sticky rice desert to try something new. It was warm slightly sweet sticky rice surrounded by fresh mangos. Cool thing to try, but don't expect to be blown away.\n\nThat being said, the prices are on the higher side ($15+ range for most meals), so I don't recommend it for frequent takeout / dine-in.\n\nOverall, great tasting Thai food, but on the pricey side, so I don't see myself coming here often.", "author": "Michael M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-26", "description": "We went very late at night and, frankly, were grateful to have a downtown Thai option available.  Food was quite good, and the entire staff was very solicitous.  The live music -- about which the staff warned us -- was ear-splitting, and the room was too dark to view the menu without a flashlight!  Overall, an interesting experience.  But next time, I think we'll do delivery or take-out.", "author": "George L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-10", "description": "Delivery via Eat24 arrived 20 minutes before schedule, and my Medium-spicy orders were Asian spicy. Yes yes and YES!! Thank you!!\n\nWe ordered chicken yellow curry and beef phad ki mao. The phad ki mao was generous with beef slices, and the yellow curry just enough \"stuff.\" \n\nI'll gladly take this place over Osha any day!", "author": "Hannah Y."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-02-20", "description": "I was not impressed with this at all and I'm used to eating really good Thai food.  The eggrolls were  tad greasy and the inside of them had a thick part of the eggroll wrapper that was kind of mushy on the inside as opposed to the typical spring roll which has dainty  crunchy exterior.  The Pad Thai was a bit greasy and the shrimp were not fresh it had a slightly fishy taste to it.  Very surprised as I was directed this place is an authentic Thai restaurant and I would characterize it as a greasy spoon Thai restaurant.", "author": "Gregg O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-17", "description": "Ordered finger foods through Eat24 for a team shindig. Timely delivery of the curry puffs, chicken skewers, steamed veg, and spring rolls. The appetizers were boxed well to avoid getting soggy, which is much appreciated for a delivery/takeout order. Fair prices for quality food. Would definitely order again.", "author": "Alison A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-08", "description": "Food was superb!! We ordered house fried rice with tofu and green curry with tofu. Both dishes were outstanding - only wish she had brought these two dishes together so we enjoyed them more. I was so hungry that I began with the rice and by the time the curry dish came, it was almost all gone :(.  \n\nService was 3-4 so they don't get my 5 stars but the food is definitely a 5!!", "author": "Xochi R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-07-15", "description": "Dear Mr. Jay C. of IThai,\n\nTo answer your question, I wrote my review right after I left your restaurant, Friday 7/8.  And to be clear, you had at least 3 servers there that night and many empty tables.  When I have dined in previously, you only have your usual 2. The female and male server.  I was told specifically, ''On Friday nights, we close at 10:30 for 'private parties'''.  Right after I was told that, the same male server seated 2 Thai customers and took their order.  Additionally, he was very rude to me and snapped at me saying he didn't have chili or soy sauce when I asked for it.  Thanks for your response after an entire week...yes, maybe you should retrain your staff in customer service and/or make your seating policies more transparent, because as of right now- there are not even restaurant times posted in front of your restauant.  Good day.", "author": "Phan .."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-15", "description": "Very yummy Thai food! We were walking by and decided to try it and it was definitely worth it. We loved their charbroiled pork shoulders. I enjoyed complimentary shrimp chips. Tom yum soup was great as well. Service was good as well. We'll come back!", "author": "Justyna M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-07-04", "description": "My best friend & I ordered for delivery & it came within an hour or less.\n\nWe had gotten the egg rolls (it wasn't that good, hardly any flavor), the pad Thai (spicy), which was super spicy & mediocre & the lemon grass chicken (sweet)\n\nFor 3 things it was $27. My best friend & I didn't eat all the food because it really wasn't that great.", "author": "Phoebe T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-03", "description": "I ordered delivery yesterday, the arrival time was in hour, i got it in 30 minutes, I ordered only vegetarian food, green carry was so good! The soup was super hot, 10 stars for this time !", "author": "Ohad B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-11-12", "description": "Overall, not impressed. I should have been forewarned by the suspicious smell that crept into my nose upon first entering this establishment. Now, don't get me wrong, this place isn't bad. But it's just that Thai food places are a dime a dozen in this city, and I could have gone to any of them and probably had good that was just as good, if not better. Also, this place is super dark on the inside. Feels like I'm at the club (there's also a small stage in the rear of the restaurant). I could barely read the menu. What I could read resulted in me ordering the fish cakes appetizer and shrimp pad Thai. I didn't like the fish cakes. The texture was a bit too soft for me, and a bit, well, FISHY! \n\nThe pad Thai was alright, but they put dried shrimps in as well, and I found those to be a bit chewy. But it wasn't terrible (because I definitely finished the entire thing in one sitting- don't just me, I was hangry). \n\nOverall, this is an okay place however I don't see myself going out of the way to go back. But if you're looking for something different or just. Bit curious, then go for it. Additionally, the name is a bit deceiving to some. I totally thought this place had some relation to Apple. But nope, it appears this is just a second removed cousin to the McIntosh empire. \n\nLikes:\n-centrally located\n-pretty expansive menu\n-friendly customer service \n\nDislikes:\n-dark decor (great if you're going to/from the club and want to get the ambiance started early...or wanna keep it going)\n-food was a bit unremarkable", "author": "Tracy T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-10-25", "description": "I ordered Khao-nah-gai for dinner and it was the worst khao-nah-gai ever. There was no authenticity. The chicken was dried and it was spicy. (khao nah gai should not be spicy)", "author": "Rarin T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-18", "description": "Holy crap this place had the best Thai food I've had in years! Highly recommend. We came here after a few other places were full but got super lucky. It's a little low key, not too packed and easily sat us during peak dinner hours. I'm honestly surprised it isn't more packed with the quality of food. Extremely flavorful with the right amount of spicy. I got the drunken noodles with chicken and those noodles were absolutely devine, perfectly cooked and just too good. The Thai iced tea was pretty standard but an excellent compliment to an otherwise fantastic meal. My friends felt the same way, I'd definitely come back. I wish I lived in SF so I could get this stuff more often. The menu states specific meats but like most Thai places they make it to cater to the customer. Don't be afraid, ask for spicy!", "author": "Rohit S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-06", "description": "As we arrived in town late we were starving and didn't want to get out and drive losing our parking.  We ordered and got it very timely.  Everything was fresh and good.  Had tofu triangles-the sauce was a bit too runny and was just about the same suace we had with our curry- I guess I was expecting more than just bland fried tofu, they should cook it in a seasoning. \n\n The roti (which was really Indian paratha) was very tasty, flaky and chewy!  The green veg curry was great.  I only thing I forgot to request was extra bowl as we were in a hotel and didnt have any dishes.  Totally recommend.  Thank you", "author": "Kimberly C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-11", "description": "My go to place!! I love their food!! Favorite dish is Green Curry Fried Rice. I had strayed and order from the Thai place down the street and was not impressed. IThai is the place!", "author": "Vika K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-03-08", "description": "It's not the best in SF, but iDigress.\n\nIt's convenient that I can get other Asian options along with my Thai favorites. Their pad Thai is decent, their chicken satay nicely grilled (weird tasting peanut sauce though!) and my co worker liked her fish cake. We found the samosas to be too greasy and I didn't like that they charged $7 for 6 tiny rolls of vegetarian spring roll.\n\nWe got delivery through our order on eat24, was quoted 75 minutes, but got our meal in an hour. Horay for that.", "author": "Janice C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-22", "description": "I ordered from iThai five or six times in the last two months. They have a great selection of dishes that are gluten-free, my favorite being the Pad See-Ew! The fried rice is also very good. I live close by and have always had my food within 30 minutes. One of my favorite takeout restaurants in the city!", "author": "Lk P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-07-26", "description": "It was a double whammy. It was both the worst tasting and most expensive Thai delivery I've had in a long damn time.", "author": "Manuel H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-01-03", "description": "I've never actually been to their physical location. My experience is just with delivery. My sleep schedule has been a bit wack lately and I don't eat dinner until after 12am. Good thing ithai is open until 1am and delivers! \n\n-1 star from previous review because they are not consistent with their food. The seafood noodles are what me and my sister usually get--they sometimes put clams in the dish, sometimes they don't. Sometimes they put green beans in the dish, sometimes they don't. I've gotten spiciness level mild, medium, and spicy before and they all taste the same. \n\nOverall, the food is good. Come here if you are not fussy about lots of oil (again, kind of inconsistent). The roti is also good but Sai Jai is cheaper.", "author": "Anna H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-08-19", "description": "Horrible delivery, always late. The last two deliveries I got the wrong food and when I called the asians employees only yell rather then to listen. I got double pineapple rice", "author": "Francisco M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-26", "description": "The entree I got from this place was pretty great.\n\nI ordered the kau pad gai tod for takeout which was fried chicken over fried rice with the special sauce (which by the way is just sweet and sour to my knowledge). The portions were satisfactory. It wasn't too small and it wasn't too overwhelming. The chicken wasn't too crispy like the traditional fried chicken that we know of in America. I would say that the order I got was tasty and would love to try other entrees from this place!", "author": "Aj C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-11-27", "description": "This restaurant must have changed owners within the past year. It use to be my fav Thai restaurant in SF but the food is just ok now as it's lacking flavour. There have been a 20% increase on the entire menu. The restaurant has a fountain located at the front and it is leaking on the floor so it smells like a wet towel. The staff is also incredibly rude.", "author": "Leanna B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-05", "description": "I placed a big order and more than half of the food was uncooked. A lot of the chicken was pink and gave us all food poisoning", "author": "Bhupinder B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-08", "description": "Omg this place is hella good. Im a big fan of thai food and i enjoy exploring sf when it comes to trying out different cuisine. Get the fried chicken for an appetizer. Strong garlic flavor. The pork belly with basil is pretty bomb too! Definitely coming back here.", "author": "Christian M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-18", "description": "These are the most amazing ppl from quality and customer service order here!!!! Plus for all the partiers they are open bella late!!!", "author": "Peter I."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-11", "description": "Great food. From he outside you'd think its a typical place that will be overpriced with bland and flavourless food. It's not! I ordered a pork meatball soup and fried fish over fried rice with garlic. Both dishes were delicious. The only thing I was disappointed about is that I specifically asked the waitress if a soup and a main dish were too much and she said no. I couldn't finish none of them as both were enormous (1-2 persons could eat from each one) But both were delicious and prices are very good.\n\nI absolutely recommend it!", "author": "Ivo G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-27", "description": "Loved this place. The vibe was fun and light. The food was top notch and they accommodated my special diet needs. This is my second time here, my first was yesterday and I'll probably be back tomorrow. Aom helped me and was extremely nice. Don't hesitated to check this place out.", "author": "Camilo B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-27", "description": "Some of the best Pad See Ew I've ever had. I can see why iThai was so busy when I walked in. Took the food to go, but I might sit down and enjoy it more next time.", "author": "Jon N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-04", "description": "Was really surprised by this Thai street food restaurant. Just passed by not knowing the place I thought I would give it a try. Went for the traditional favorite pad Thai. It was actually really good- had a mix of chicken and prawns. My friend had the duck curry. It was also really tasty and great value. \nThe only downside is that it lacks atmosphere. But as cheap and cheerful places go, you can't do a lot better.", "author": "Derek M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-08", "description": "This place is so close to my place but i did have a not-so-good experience with it one time eating with my friends. The rice was cold and the chicken was too chewy.\nHowever, the menu at H.O.T is getting bored to me so I decided to give this place another try. \nWow, iThai seafood noodle is the bomb. Perfectly spicy and great blend with other spices and seafood. I had extra squids i/o shrimps. So goooood.\nThen, an average experience again when I ordered wonton noodle take out, noodle was undercooked and wontons were cold. *long sigh*\nTonight, after feeling fresh, I usually feel hungry. My favorite Korean restaurant closes early 'n I craved for something sweet and spicy and watery. Hence; I come back here. Guessing that pick out the icon dish such as Tomyum soup would never goes wrong. Indeed, it is not. So deliciousss. I tend to leave behind soups and only prefer meat, veggies and noodle, not the soup. But this time, I drank till it crank!!! Wonderful! My International Women's day completes with joy...\nSo I guess, with iThai, it is perhaps better to eat in rather than order or take out ;)", "author": "Bao V."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-02-28", "description": "This place was recommended to me when I was staying nearby, but dare I eat at a restaurant with a near failing health score? I was feeling Adventurous and ordered pad kee mao And pad Thai. Both were very good above average and better than most I've had in San Francisco. My only hesitation is the health score. Thankfully I didn't get sick and enjoyed the food. 4/5. Above average Thai food, and I know my Thai. I would recommend it to anyone nearby. Recommend dining in over taking out tho.", "author": "Nick J."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-07-08", "description": "Worst Thai food ever. Chicken was rotten had to send it back and waiter made us feel bad for it. Had a beer and left. Horrible horrible place. Don't go.", "author": "Jay N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-16", "description": "We liked it so well, we went twice.  Inexpensive for SF and the food is fantastic.  The restaurant wasn't super busy but they seem to do a lot of take out. Huge menu. The Kaprow Gai (chicken chili basil) was super good - very flavorful spice.  They have a space for live music it seemed.", "author": "Jennifer L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-04-16", "description": "I ordered the kao mun gai and the cucumber salad. The rice was over cooked and got some reason it's sweet. The chicken was full of fat and again SWEET.  The cucumber salad was for (surprise surprise) sweet, like it was soaked in simple sugar. None of these dishes are supposed to be sweet. It was a waste of my money I couldn't even eat it after few bites. Tasted more like dessert than entree.", "author": "Jasmine T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-05-31", "description": "Decided to try this place out since the deli next door was closed. To my surprise the food and service was great. The service was awesome, the gentleman was very attentive and nice. Food was great, don't knock it till you try. I ordered 1 app & 1 dish and totaled under $20.00.", "author": "Edie R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-07-26", "description": "Hmmm, what can I say. The place was kinda ok I guess. Food was average, service was poor, tables where kinda dirty. Smelled like sewage.  I attempt to go to the restroom, and turn right around and held it. That bathroom was filthier than a gas station  bathroom in the hood. So I held it in till we left and went elsewhere. 1 try wonder. That's it.", "author": "Julie J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-18", "description": "Delivery was quick, but they forgot the rice so the poor lady had to leave and come back. She was very nice about it. My issue was not with the service but the food. Yellow curry is always good but I also ordered pad Thai and it was greasy and spicy (I ordered not spicy), otherwise a good local delivery Thai place!", "author": "Meg W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-08", "description": "Fresh spring rolls and green chicken curry were great. This place definitely beat out expectations, especially given its name. \n\nSpring rolls come with a light gluten free chili sauce. They also serve brown rice if you're into that.", "author": "Daina L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-16", "description": "This place is pretty bomb. \n\nI ordered takeout from them for the first time, and the delivery was very fast which is always a plus! I ordered the Mussaman Nuer and the iThai Fried Rice. The portions were perfect - not too small but not too big. The Mussaman Nuer is one of the BEST curries I've ever had! The curry had somewhat of a peanut, coconut flavor to it, with braised shortrib and potatoes. The shortrib was so tender and just melts in your mouth! And the iThai Fried Rice had amazing flavors of onion, basil, and lime. I ordered both dishes medium spicy which was pretty spicy! So definitely keep that in mind when you're ordering how hot you want your dish to be. I loved both dishes and the pricing is very reasonable!\n\nI will absolutely order from this place again! They really know how to add spice and Thai flavors to their food. It doesn't taste Americanized at all. Authentic flavors which is what I look for!", "author": "Chisholm T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-06-26", "description": "Bring earplugs. The food and service were alright. Having to suffer through the table behind us signing awful karaoke for 45 mins was not so pleasant.", "author": "Austin W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-17", "description": "I like their Thai street food angle. The place is clean and welcoming. Presentation is important in Thai restaurants and it works here.\n\nMenu: Usually, Thai restaurants feature more vegetarian options or ways to configure things to be vegetarian than IThai seems to. I appreciate it when the menu indicates which things can be made vegetarian. They worked with me nicely to find a dish.\n\nOverall Experience: I came in for lunch, was seated right away, and had a fine time. The service was quick and the place was about 1/3 full. The food came hot and fresh. Feedback on the food- it's very flavorful and tasty. My noodle dish had very little tofu though. Also, overall the dish was so oily I could not eat the last 1/3. I usually say \"low oil\" but forgot. I think chefs just toss like 1/4 cup of oil per serving.\n\nI'd go back, but would specify low oil and would take more time to read the menu to see what can be made vegetarian. Great, strong flavors and the spices are bold - thank you.", "author": "Roxmarie M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-09-02", "description": "Tried it for lunch.The veggie spring rolls were fine. My wife's ground chicken and basil was way over-salted, and my vegetable noodle soup was boring, and largely bereft of vegetables other than napa cabbage. But to be fair, veg noodle soup is a bad bet in Thai restaurants, now that I think about it: it's always blah.\n\nThe waitress was glum and dowdy. The place didn't seem terribly clean--didn't smell great.\n\nUnfair, I guess, to judge a place on three dishes, but we won't be back for further \"research\"; there are too many other good options in walking distance, even if one's focus is solely Thai food.", "author": "John H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-08", "description": "First time reviewing in a loooooong time, but I feel that this little place deserves some love. \n\nI decided to try it out since the timeshare I'm at nearby offers a discount and I'm glad to say I wasn't dissapointed. Sure the wait time was long, but this SF and I know its tough to get around. But it only took 45 min and the food was piping hot and deeeeeelicious~\n\nI will say that the hard boiled egg was a bit over cooked for my tastes and the lemongrass chicken wings a bit too sweet. But the 3 pork street plate was tasty and filling, though it could of used some veg. My bf had the thai fried rice with pork and he wasn't dissapointed. \n\nSo overall if you're staying on the surrounding streets near iThai give it a try. Its not the most mindblowing food but its tasty on a budget.", "author": "Amber D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-10-06", "description": "The service was weak, not busy but had to search out people to be seated, to order, etc\nThe bowls, table and floors were dirty. I mean the table was sticky like you had to work to free up a glass to take a sip. The bathroom floor was sticky-er.\nThe food when it came was lukewarm. The food itself was OK, but with all the other issues do yourself a solid and just go to Osha Thai a couple blocks away.", "author": "Eric T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-02-13", "description": "Delivery was no bueno... or however you say that in Thai.\n\nEach dish is at least $10 and for that ten buckaroos, you get about 6 bites. The containers are ridiculously small! My pad prik as well as panang curry came with the leftover pieces of roasted pork (you know, with the crispy skin.... The kind that people order as a FREAKING APPETIZER). Pad Thai was nothing special either... \n\nSo there you have it. A two star review. Oh, and it took over an hour to get to us when we were within a two mile radius. I'll pass on ordering from here again.", "author": "Vi T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-04-14", "description": "I'm hungry and now upset. I made an order around 11:50pm so I understand it was late. The delivery driver calls me around 12:45am saying he can't find my location which I noted The Westin room 3194.. proceeds to say \"this place doesn't have room 3194\". I ask him if he's at the Westin and he continues to say that my room doesn't exist. I speak to the bell hop and they tell me that he can come through the back entrance if it's easier. The driver then tells me he will call me after his next delivery. It's now 1:00am, I'm starving, and I have a meeting early in the morning. I get a call back from the restaurant around 1:15am telling me that the driver was confused and it may be another 20 minutes..really? Never again iThai. Don't try to rip off of an Apple product name if you can't even deliver.", "author": "Brian K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-04-22", "description": "My coworker and I didn't bring our lunches so we decided to order from the Eat24 app. I recommended iThai to him because I had a really good experience with you guys a few weeks back when I ordered a super late dinner and you guys delivered it within an hour. I was super happy with that.\n\nBut, when I ordered again, I was very disappointed. Yesterday, I ordered an entree and 2 appetizers for my coworker and I to share. Our delivery time was supposed to be 12:05pm. \n\nWhen 12:10pm rolled by I was getting anxious since I was raving about how great your delivery service was. I called iThai and the girl on the phone said that the driver left 30 minutes ago. I agreed to wait another few minutes. 12:25 rolls over and my coworker is questioning my recommendations. I call iThai again to ask what's going on. If my food left 30 minutes ago when I called at 12:10pm, that means my food has been on the road for almost an hour. :(!!\n\nThe girl on the phone said to please wait another few minutes. I was getting super impatient but agreed to wait another 5 minutes. 12:30pm rolls along and I decided to cancel my order. My lunch was 30minutes gone and I barely had time to eat. I called again and the girl on the phone asked me to please wait another 15 minutes?! My lunch would've been done by then and my food would probably be cold by then also. I explained that to her and told her to please cancel my order. After I refused to wait another 15 minutes, she mumbled that she will cancel my order and hung up on me.\n\nI give you the benefit of the doubt that shit happens.. maybe hire more drivers?", "author": "Crystal L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-05-17", "description": "I order iThai for delivery fairly often and have mixed feelings. They deliver late and they deliver far. This place has some awesome appetizers and good variety of street food! However the Pad Thai is mostly sprouts and dry. Not a lot of substance to it. Also, their curries do not come with rice, so be sure to remember to add it to delivery orders! The Thai tea is good and the delivery is fairly fast (foods are well-packaged for the trip).\n\nI've never been to the brick-and-mortar iThai so I can't comment on that.", "author": "Irina P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-05-23", "description": "The prawns were so overlooked all that was left were the shells...I still can't believe they delivered such a mess. Very low end Thai option, Osha is a million times better.", "author": "David M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-09-27", "description": "Food wasn't bad but would have a better idea if the rice was delivered with it.\nWaited 1 hour and the food came without the white rice.\nWow.  Also Yelp - you need to learn from Uber.  After an order, you should have it automatically go to review.  But then I think you don't really want to hear the complaints", "author": "Jim S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-01-13", "description": "Ugh I've been here before and it was ok. Tonight however was just horrible! The food was so disgusting and old and stale, one bite and I lost my appetite instantly. The restrooms were filthy. They don't have their health score posted and didn't really think about it until I checked yelp and discovered they have 59!!! WHAT? How has this place not been shut down? Awful experience, awful food. Never coming back, hope I don't get sick. STAY AWAY!", "author": "paul b."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-05-12", "description": "2.8 Stars-which includes the friendly service! \n\nWe wanted to go back to Brenda- but the line was probably too long so we decided to have some Thai food for Lunch..   We weren't sure if we wanted  iThai (3.5 stars on Yelp- 5/11/13) or ThaiStick (3.0 Stars on Yelp) ? So we went with the one that had the higher ratings.\n\nFIRST!!  The decor and ambiance is completely WRONG!!  =)   I guess I watch too much HELL KITCHEN.. LOL.  Mr. Ramsey would probably wonder what is going on??    We weren't sure if we were really in a Thai Restaurant, the white decor and art was nice but I think the owner should have opened a French restaurant instead. Also, the loud background music sounds French.. Ok, I think the owner tries to make this place more upscale and fancy, yet I don't understand why there was a TV with the Warriors playing?   The owner should remove the TV, add some smoothing Thai music and art! \n\nNOW! Back to the food..  We came here during lunch time, so I thought we would have gotten a small Thai salad with an egg-roll or something.  Next, the food was nicely represented, yet the curry and rice looked rather lonely together. Overall, the curry was good but the favor wasn't strong enough for a WOW!!   Finally, my 3 kinds of pork over rice looked amazing yummy!!  However, the hard boiled egg was overcooked; Still, it tasted way better than the curry, yummy but not yummy enough for me to come back. .  Lastly, the thai tea was a bit sweet for me, but I did like it since it was free when you check in with YELP!!  Thanks YELP!!", "author": "Cindy C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-03", "description": "Getting off a 6hr flight, I was pretty hungry. We ordered 2 plates of different chicken, steak, pork, and garlic/white rice. We could not complain about one thing! Besides it being karaoke night, apparently? We couldn't hear ourselves, so decided just to enjoy the food and make the best of the entertainment.", "author": "Stephanie H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-05", "description": "Being a regular customer at Chaaba, we wanted to try something different in the area. \nWe ordered pad kee maao to gos. One veggie and the other with chicken. Must say, the veggies used in it were to our liking more than Chaaba. Not to forget the spices and the flavors.  We will definitely be a regular here now. Keep it up guys!", "author": "Neil S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-02-12", "description": "Ordered delivery. The jasmine rice I ordered was missing. Larb is pretty plain, but still acceptable. Pad Kaprao fried rice though was very bitter. Somehow some of the minced pork is burned too. I had a hard time finishing it.", "author": "Gott P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-01-11", "description": "Tom kah was very sweet, service was alright, atmosphere was terrible. I would never go back to this place and pay for it.", "author": "Marina M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-10", "description": "Most of the food is really decent, especially for it's price. Great place to sit too!\n\nI've actually eaten here over a hundred times. (Got a points card to back that up) and oh, I'm Thai, Straight out of Bangkok. \n\nAs a Thai, food is a very big thing. We're pretty obsessed.\nAnd this place is where the thais go around here.\n\nI started going through their menu one by one, and I was blown away. I still haven't eaten them all. Because I liked some so much I just kept ordering it.\n\n\nHere's some tips:\n\nTheir Giew Tod was extra crunchy, and goes pretty darn well with the noodles.\nTalking about noodles, the soup of their Guai jub was a very pleasant surprise of rolled noodles with crunchy pork bits, and their Kao Soi is great if you want a taste of curry on your noodles. It's a dish famous in the northern parts of Thailand.\n\nI love their Ka moo, It's juicy pork leg on sauced rice. (you can probably ask them for more or less fat pieces if you prefer) It's also a good indication that their \"Kao na ped\" will taste pretty good.\n\nKao mun gai, It's chicken with flavored rice. It's the thai street food we grew up with. This and the Pad Krapaos are the \"I don't know what to eat\" standard dishes.\n\nHungry and need something fast? Their pad see ew moo gets done, It's practically our fast food dish. it's lightly seared soft noodles flavoured with sauce and pork.\n\nI really like their pork lately, It's not dry like many other places, So I'd recommend their pork fried rice, too\n\nFor less \"usual\" things, Their pla duk fu is crunchy and classier than most of the pla duk fus i had.\nAnd if you want beef, Their Sur rong hai is tasty as heck. It's like steak, but less oily and more aroma. Yes, I should end with their Sur rong hai.", "author": "Sra P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-29", "description": "One of the best Thai food I have ever had the pleasure to eat.\nThe food size portions are massive and the staff were incredibly friendly.", "author": "Mark C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-02-27", "description": "Not sure what to think of this place.\n\nEgg rolls and spring rolls were good, though pretty small portions.Tom Kha Gai soup was flavorful and chock-full of goodies, came in a pretty big sterno-fueled pot too. Kao Pad Kark Moo (pork belly fried rice) was quite good, and a little mountain came on the plate. The Pla-Duk Pad Phed (catfish) was spicy as indicated but not crispy and half the portion of everyone else's dishes. Bummer, because that was mine.\n\nIt's a weird techy apple theme/decor. Pretty drafty, which definitely doesn't help on chilly SF nights. Waitresses were attentive but whenever they asked \"Is everything okay?\" it sounded like there WAS something wrong and they were waiting for us to find it.", "author": "Vivian H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-10-07", "description": "Great curry, but delivery gave me NO rice with my curry. Both my best friend and I ate straight curry...riceless. It was a depressing night.", "author": "Angela Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-18", "description": "I almost passed this by because of the overall rating but I'm glad I didn't! It was very good, affordable and great atmosphere. If you want an authentic Thai experience like in Thailand, I recommend iThai.", "author": "Jay G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-16", "description": "The best late night Thai I've had in downtown. Delivery time is spot on to the estimated and customer service I received was exceptional. Definitely favoriting this spot!", "author": "Brady W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-06-06", "description": "Coming into sf in the late night hungry but tired at the same time having the food delivered was the most ideal. The food was delivered before the expected delivery time which was awesome the food purchased was good as well. Only downfall was no utensils or napkins were given when in the directions we said to leave it at hotel reception for our room number. Maybe it was so late they forgot? Kind of annoying thought when you're ready to eat your food but you can't you have to wait longer to get some silverware from room service", "author": "Evanie W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-07-07", "description": "So, I finally decided to try it.  We sat at 9:15pm and they were really nice but, it took a while for them to take our order ( there was maybe 6 tables and a lot of to go orders lined up for UberEats).  When they did take our order, we got our drinks right away.  The egg roll appetizer came at 9:40.  The problem came when I asked at 10:15pm if the food was coming.  The first girl said she would check but never came back to us to give a reply.  So at 10:20 when we got the wings we ordered, I asked the guy who brought it out about the rest of our food.  He went to the back and didn't return without the food. At 10:30pm, we received the fried rice that we were anxious for.  It was horrible.  The rice was cooked with too much water so it had a oatmeal consistency and there was no seasoning at all.  Not sure what happened tonight but, we paid quickly and left. They didn't charge us for the rice but, we certainly were not happy to have wasted so much time waiting for that!  Wrote this review while waiting on our pizza because we are still starving and it's all that is open at this point.", "author": "J M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-10-26", "description": "Had the soft spring rolls (not the fried version), and it was just weird. They cut it into six small pieces, and the filling would come out when you pick it up. The sauce that came with it was overly sweet. Missed the peanut sauce. The filling was not shrimp or chicken but some mystery meat or perhaps tofu. Hopefully their other dishes are a bit better. Won't be ordering spring rolls from here anytime soon.", "author": "Kimberly H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-13", "description": "Food here is delicious!\n\nFor the appetizer, I recommend their Gai Satay.\nFor the main dish, I recommend their Kao Pad Gai Tod, Kang Karre Gai, Mussaman Nuer, Sur Rong Hai and Tom Yum Seafood Soup.\nFor the drink, I recommend their Thai Iced tea.\n\nIt's a great restaurant with a reasonable price.", "author": "Davis L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-29", "description": "I got some food delivered last night to my hotel and- holy hell- it was FANTASTIC. SO good. \nI haven't had Thai food in a while and I've been craving it and I got the perfect meal. Only $20 for mixed veggies (perfectly cooked), egg rolls and Kao Mun Gai Tod. It was a crusted piece of chicken over some white rice. And it all came with some sweet and spicy chili sauce. I was in heaven. The delivery was quicker than expected (40ish minutes). \n\nThe best part was that they knew what they were doing in delivery. My chicken was breaded and usually when you get delivery on a breaded item, the steam get trapped and makes everything soggy. But their genius idea was to cut a hole in the top of the cover and it was perfect! My chicken was still crispy and delicious. Props\n\nSeriously I'm in love and will probably order from here again maybe tonight, and definitely next time I'm in San Francisco!!", "author": "Jessica S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-12-29", "description": "Filipinos, come eat here. Startup workers and post-hipsters, come eat here. Ghost of Steve Jobs, come eat here. This place certainly has the \"i\" part down, with the brushed aluminum on white themed interior and OS X window buttons on the menu. The music is largely straight-up club, and there's a curtained stage at the back as a hint of the future of this establishment. Bring your air guitar.\n\nThe menu has items you've seen at other Thai places. Two sections that may have surprises for you are \"Something Specials\" and \"I'm Adventurous\". Turns out that being adventurous means being Filipino, with regard to the chicharrón fried rice and the bagook x green mango dishes. At least, those were the images that came to mind when reading over the descriptions for \"Kao Pad Kark Moo\" (\"Ultimate iThai fried rice with crispy pork skin, carrots, onions, and egg\") and \"Kao Klook Gapi\" (\"Shrimp paste rice with side of sour mango, sweet pork, egg strips, sun dried shrimps\").\n\nThe KPKM pork skin was less rind and more skin + fat layer + meat, kind of like bacon's older brother who happens to play varsity football. Cucumber slices garnished the plate, but the carrots, onions, and egg were absent. Since we'd only ordered this dish to try the pork skin, perhaps it's better that no other ingredients got in the way.\n\nThe KKG shrimp paste, nam plik, was a subtler and less salty version of bagook with the tiny shrimps ground up. Rather than a tongue assault like Korean saeujeot (which primarily isn't intended as a condiment anyway), the nam plik was dippable, spreadable, and overall more approachable as a table item. The sour mango was pickled, which was a new concept to me - I thought it would be green (unripe) mango.\n\nWe also had \"Keaw Wan Roti\" for some Indian influence, and its curry unexpectedly included makla (likely incorrect spelling), a small and round Thai eggplant.\n\nRounding out our set was a carafe of \"Cloudy in Bangkok\", similar to Korean yogurt soju. Ordering the carafe instead of a glass seemed like a good move because the contents were somehow just enough for the accompanying cocktail-sized cup. But how big would the glass have been? If the glass would've been similar to the cup, we shouldn't have opted for the carafe at twice the price. You may want to ask to see the vessels before making your choice.\n\nOur meal was interesting and our servers were friendly. Oddly enough though, for being named \"iThai\", there weren't a bunch of outlets for plugging in MacBooks to work while eating. All in all, this is one of those places that I want to rate well because I liked it but want to rate poorly so it won't be popular and overcrowded next time we go. I can picture it filling up with Academy of Art students.", "author": "Dan B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-09-25", "description": "Got here at 12:17 am. Yelp stated it was open until 1am. The told us kitchen was closed at 12:30. We informed them it was not 12:30 yet and that we took a 25.00 cab ride over and yelp stated they were open until 1. They said kitchen closed already. Wasted time and money.", "author": "Sarah L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-12-22", "description": "The food is alright but I will definitely try some other things. I got the pork and eggplant and it was pretty good, but I've had better. \n\nThe staff wasn't very attentive... But a super fun vibe! I have never been to a place that had Thai Karaoke! It was really fun to watch!", "author": "Kathleen T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-13", "description": "We happened upon this place on a Sunday evening. The food came out glistening and piping hot. I have bee to much fancier Thai restaurants  and this food was better and more original.", "author": "Lisa T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-12", "description": "We usually order from eat24 so I don't know much about their customer service and restaurant. What I do know is.. they are one of my fave thai food to go :) \n\nKao Mun Gai Tod: Crispy fried chicken over garlic rice with sweet chili sauce\n- The garlic rice itself has this authentic Hainanese chicken taste. I'd definitely order this when I have cravings for hainanese chicken cause it's the closest taste to the one I had in Singapore. \n-Crispy chicken could be a little more tender but its ok since its always crispy when it arrives.\n\nCrab Curry: Yellow curry with crab.\nMmm because its creamy for sure! Its a little sweet but not bad. I love how they add egg. They add a reasonable amount of crab. A hint of spicy would make it more awesome! \n\nPad See-Ew Moo: Pan fried white noodle with thai black bean sauce. A pretty perfect balance between noodles, chinese broccolli, egg and pork. Its very flavorful but it does get a little salty after awhile but still really good! \n\nKha Soi: Red curry with marinated meat. \nBeef or chicken? I say chicken cause the beef is not as tender and a little too chewy for me. The noodle and crispy noodle is really delish! I'd rather eat this with rice than actually eat it like soup because the curry acts more of a gravy. \n\nLast but not least you can never go wrong with thai ice tea :) \n\nAs long as they're nice when they deliver and they don't take more than an hour for delivery then yes I'll mos def order here again! Plus I want to try their Kao Mun Gai (steamed chicken over garlic+ginger rice) next time...", "author": "Sharmaine M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-06-06", "description": "Ordered on yelp 24.  It worked good. The Tom Yum coconut soup didn't have any coconut milk. The potatoes in the yellow curry weren't cooked. The coconut ice cream I ordered was good. I would order the ice cream again, but nothing else.", "author": "John S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-07-01", "description": "Very disappointed. I ordered here because of the unusual range of appetizers. I was hungover and wanted something fried I could eat with my hands. I'm not sure whether the oil wasn't hot enough or maybe the food had been in the car for too long but everything was greasy to the point of being inedible. I tried to soak the oil off with kitchen paper and it still wasn't really edible. We tried most things but threw away a large portion of the food - it sounds like if you want to go to this place you need to go in person.", "author": "Amaya B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-05-20", "description": "Ok we want to love this place and we would have given it a perfect 5 star if it wasn't for the issue with delivery of food. We order here 3 times and every time the driver doesn't know where the location is or the restaurant have not receive the food order. \n\nWhen we call seamless they say someone from the restaurant confirm the night before and they still manage to not have the order. I don't understand. We just want our Khao Soy to deliver to our office within the time frame requested...which is not too much to ask since we are in Fidi and they are in lower nob.", "author": "Swwtnsour T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-03", "description": "Delicious seafood fried rice, full of flavor. Their mild curry is decent as well as their beef. Service is average. Don't know much about the rest of their dishes", "author": "Sui N."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-10-25", "description": "I ordered a delivery of Pad Thai and Friend Rice. The food too 2 hours to arrive, was pretty cold, and very mediocre. Pretty disappointing.", "author": "Tom A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-02-17", "description": "I THAI took my money and literally failed to deliver! After waiting two hours, I called I Thai and they scurried around only to say they couldn't find my order. Well, they sure did find my bank account. Furious. I better see the refund back in my account as quickly as they took it! Stay away from this shady robber!", "author": "Lisa H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-09", "description": "Just got into town and tried to find a place that was open between lunch and dinner. We were glad we found this place. Quick service. Competent Thai food with nice presentation and attentive service.", "author": "Keith C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-03-03", "description": "Want to wait 2.5 hours for delivery? For mediocre Thai food? By all means, call iThai!!", "author": "Christine M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-16", "description": "i really like thai food，soup is good. But I like the Pakapow(I don't know what to spell it) it's chicken or pork fried with some chill.it my favourite", "author": "Tong K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-26", "description": "Food was fantastic! I had the iThai Seafood Noodles and the egg rolls. The noodles I would order in again in a heart beat, probably not the egg rolls (not because they weren't good, just nothing exceptional).\n\n The servers were incredibly polite and friendly however a tad on the slow side.", "author": "Megan B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-25", "description": "Amazing food and huge portions. Very well priced! I have been here for 3 days and this is the best meal yet! Great service and clean beautiful restaurant. I suggest the yellow chicken curry and the chicken sauté with peanut sauce. + rice ofcourse. \n\nThai tea and Thai coffee as well!!\n\nThanks ithai! We will be back!", "author": "Kass M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-06-16", "description": "We ordered the crispy egg rolls, kang karee, and kao pad kark moo for delivery. We waited 1 hr and 40 mins and the food arrived luke warm and the egg rolls were no longer crunchy. I was very disappointed that the curry didn't come with rice. I guess I had to order that extra? With that said, it was really good food. I may stop in if in the neighborhood but would not get delivery again.", "author": "Laura S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-05", "description": "DO yourself a favor and eat here. NOW!  We order from Grubhub all the time and we have always been happy with anything we have ever gotten from this place but this one item takes the win: Prik Khing Moo Grob (String Beans)\nwhat it is : Sauteed crispy pork belly with string beans in red 'prik khing' curry paste.  Add some Jasmine Rice and your mouth will be thanking you! \n\nWe are obsessed with this dish! Completely 100% obsessed!  Cant get enough. The pork Belly is cripsy in all the right places. Even with the amount of sauce the pork belly keeps its crisp. The string beans have just enough crunch. The sauce has enough kick but it wont over power your taste buds. Ahhhhh..... gimme gimme gimmeeee!", "author": "Krishna M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-06-16", "description": "My husband and I both ordered the Chicken Pad Thai. It was good & different from the pad Thai we are used to. Overall, a nice little spot for dinner. I think I would have just enjoyed better service, I felt like I had to ask for everything. A tea refill, twice, sugar for my tea (& she brought me one packet). Slow service with just us and an another couple in the restaurant. Started getting filled at around 8:30.", "author": "Abigail P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-12-25", "description": "...the fact that their menus are paper ipads -_______-\n\n...the fact that the waiter displayed the dessert menu on an actual ipad  -______-\n\n...the fact that they have fold-out church chairs\n\n...the fact that they forgot my thai iced tea\n\n*sigh*\n\nFound this place on scoutmob and decided to check it out since I was in the neighborhood. I was kind of annoyed that it was like an indoor picnic-style. My friend got the spicy eggplant and I got the chicken. We had the fried banana or fried coconut ice cream for dessert...my experience was so unmemorable, cant even recall which we had for dessert. :/\n\nWon't be back.", "author": "Lydia L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-21", "description": "I decided to try iThai again a couple of weeks ago after not eating here for several months.  When I stopped coming here, renovations to the places had recently started and the quality of many of the dishes had gone down to my disappointment.\n\nI told myself that I would eventually come back to see if the quality improves, especially since there were a few items that either they offered only, or did better than other Thai restaurants.\n\nI've been here about 5 times in the past 2 weeks trying (again) some of the dishes I was found of here.  The verdict?  Quality has much improved.\n\nOne of the first things I ordered was Kao Mok Gai (Herbed chicken with curried rice). The flavor was about as good as I remembered it should be, the only difference is the chicken is boneless now, which I'm a little bummed about since I like gnawing on the grizzle on the bone (must be the Asian in me).  I see few other Thai restaurants serving this dish as well.\n\nSecond visit was Yum Pla Dook Foo (Crispy catfish salad).  Nothing wrong here. Good vegetable to fish ratio, fried fish didn't get soggy quickly, and seasoning was great, though I could have gone spicier.\n\nAlso, ordered was Gui Chai (fried chive dumplings). This dish has always been good. It doesn't taste like it's burnt or been cooked in old oil like some other places.\n\nThird visit was Kao Pad Moo Kark (Fried rice with crispy pork skin). This was one of the dishes I initially liked most because the only other place that I've had it is in Thailand.  It's actually a pretty simple dish; well seasoned fried rice with crispy pork skin... and some pork belly.  Mind you, the emphasis on this dish should be on pork skin, not pork meat.  And really no one should be complaining that they got served only pork skin.\n\nThe dish was almost as good as when I first ordered it here.  My main complaint is the rice was a bit on the greasy side, even for a dish that is basically fried pork skin and fried pork fat.\n\nMy latest visit here, I had Koh Moo Yang (pork shoulder w/ tamarind sauce).  Nothing necessarily wrong with this dish, I just wasn't very impressed with it. Perhaps, I just wasn't in the mood for this dish like I thought.  The pork had good flavor and was tender.  The tamarind sauce was a bit sweeter than I expected and not as spicy as expected either. Maybe that's why I'm indifferent toward this dish. Anyhow, not a bad dish, just not my dish (at least not on that night).\n\nOther thoughts?\nThe makeover is nice.  The chairs are much nicer and more comfortable.  Some items have been removed from the menu, like Bamee Jup Kang (an egg noodle soup with pork), which I'm disappointed about.\n\nOverall, I'll probably continuing coming back here (again).  And they still have late night karaoke, and a live band on Fridays which is another thing I like.", "author": "Dennis Z."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-04-04", "description": "Very bad experience.\n\nI ordered the pork belly in basil and it was very bad. The pork was so TOUGH. It was too spicy.\n\nThe Chicken Wings was too sweet and sticky.\n\nThe service was slow and the atmosphere was loud.", "author": "Leslie M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-08-16", "description": "Great environment. I love that they stay open to so late. The food was good. The pricing is great! And it's so close to my apartment. \nThey took long to take my order. I didn't mind, but still. And they never brought me my water. :) \nI'll be back though.", "author": "OH B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-08-07", "description": "The only good thing i can say is that the delivery showed up earlier than expected. Other than that, the entire order was luke warm and the driver was pretty rude. The pad thai noodles were pretty bad and half the tray was filled with sprouts, so it felt like we got half and order. Why were there tomatoes in the tom yum soup? Never seen that before, plus it was super watery so that wasn't nice. Will not recommend or order again.", "author": "Jason K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-31", "description": "We love this neighborhood find introduced to us by my bf's friend Barry!  We went here for dinner last night and then again for lunch today because we were immediately hooked.  \n\nWhat we tried so far:\n* Jessy's Noodles (fat noodles, ground pork, vegetables - mmm, love, no wonder Jessy loves this so much, wonderful taste, I would order this again and again)\n* Tom Yung Kiang seafood soup with noodles (tasty, comforting, perfect for SF weather, seafood: shrimp, calamari, clams, were all so tender and perfectly cooked)\n* Crab fried rice (lovely crab on top and mixed through, love, filling, yumm)\n* Spicy eggplant (hits the spot, can be made medium or hot hot spicy)\n* Pumpkin curry (nice flavor, love the pumpkin, tender, nicely cooked)\n* Thai iced tea and iced coffee (both classically tasty, creamy, mmmm)\n\nService was friendly and courteous.  We will definitely be back again and again.  iThai rocks!", "author": "Maile N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-26", "description": "Had the Kao Moo Dang \"street food\" dish. It is a mix of three different kinds of pork over rice with a sweet sauce and a boiled egg. Very different from the usual Thai dishes which are starting to get a bit standardized and sanitized in the USA.  My dish was not very spicy, which diverges from the typical Thai hotness. It was still nicely seasoned with a definite Thai taste that I love.", "author": "Michael P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-09", "description": "My favorite Thai in the city, easily.\n\nThings I love: larb salad, Prik Khing (I always order it with pork not pork belly-- it's AMAZING), Moo Dad Deaw (LOVE LOVE LOVE LOVE).. and everything else. Everything I've had is delicious, but several of them are so good that it's almost impossible to not order them.\n\nI'm nowhere near them but now am trying to fight the urge to go all the way to there just to eat some Moo Dad Deaw and Prik Khing.\n\nLOVE! Don't be scared by the overly big menu. Maybe just check it out before you go? \n\nThe owner and staff are all super nice too.", "author": "Lisa N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-01", "description": "Great food in a good price. They also have unique menu that other thai restaurant do not have. Will definitely keep ordering!", "author": "Alvin Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-15", "description": "The atmosphere was very relaxing. The food did not take long and the taste was acceptable. I did not have one of their recommended item but definitely give this place a try. It has a very extended menu, so you'll most likely find something that you like.", "author": "Kumpol H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-05-29", "description": "First time trying iThai ordered delivery since it is open til late. 2 hrs later no food tried to call the restaurant several times for a update but busy tone every time. Will never order here again.", "author": "Jasmeen G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-12-21", "description": "For delivery, the order took longer than predicted (not a huge deal).  The food was mediocre at best although.  I have lower expectations with delivery, so I ordered very common items (pad thai, Kang Keaw Wan Gai, Lemongrass Chicken) that I hoped wouldn't be hard to meet average standards.  I couldn't finish the pad thai and the Kang Keaw Wan Gai was oily and lacking.  Maybe dining in and ordering other items are much better, but I'd much rather go to better Thai restaurants.", "author": "Lanes S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-11-03", "description": "second time I was pick up. I don't like cashier here, she never smile to customer. bad service because I complain first time so I called to her why don't put spoons together. she was mad and said bad sound with me. \n\n....................\n\nfirst time\nI ordered delivery foods with rice but just put only 2 forks!!! no spoon. order white rice but no spoon!!!. use hand ???", "author": "Warin Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-04-04", "description": "Be careful when ordering your level of spice here. We asked for medium with a calamari salad and got HOT, HOT, HOT! Like, indigestion-inducing hot. \n\nI was pretty non-plussed with the food at iThai, especially considering all of the other awesome Thai joints in the area. It's a little expensive and portions aren't very big. \n\nP.S. When is Apple going to sue them for naming rights?", "author": "Abby S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-04-23", "description": "I really really really wanted Thai food that night. Just so happens that Scoutmob had a deal with iThai -- so I went to check it out\n\nMy friend had gotten the pineapple fried rice, and me -- I just needed me some pad thai (and it's the staple food to get when you want to test out the food at a Thai place). I was thoroughly disappointed.\n\nIt was SUPER oily. Like SUPER DUPER oily -- which made me pretty full after a few bites. I was pretty disappointed.", "author": "Joanne W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-01", "description": "One of the better Thai restaurants in the area. Beautiful restaurant with authentic Thai cuisine.  You know this is an authentic Thai cuisine when the majority of the patrons are Asian...eat here. It is a cool place.", "author": "David S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-05-22", "description": "I got the Kang Karee Gai for delivery. It was spicy, had NO flavor and the chicken tasted bad and was full of gristle and the potatoes weren't fully cooked.", "author": "Nicolas W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-05", "description": "Really amazing street Thai food! The fried rice and pad see ew were amazing...and the staff was super friendly and attentive. Def check it out if you're in town!", "author": "Maryah B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-01-03", "description": "Delivery was so terrible. Ordered over the phone and had to call twice for the cashier to get the correct phone. Are you fucking kidding me?!? This is a joke. My two orders were bland. Not ordering nor coming here anymore. Bad experience. Waste of my time and money.", "author": "J Phoenix B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-05-15", "description": "If you want a nice and quiet place to dine in, this is not the place ! They have Thai karaoke and volume is full blast !! No you cannot converse with people in your table due to the noise. \nFood is okay. Everything is spicy let them know how spicy you want your food. \nI'm mainly yelping about the noise!! Loud karaoke !!", "author": "Kai V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-29", "description": "I'm giving it 5 stars because the flavors of my spicy basil chicken and HB Steph's green curry rice were truly outstanding. It was delicious. They have something called garlic rice, and I'm intrigued for next time. \n\nThe place feels like you've walked into a K-Pop cube. An understated K-Pop cube, if that is even possible, because Thai isn't Korean. Weird accent lighting- things are super super white, too. Its just odd.\n\nMin $15 for free delivery between 5-10pm and I will be making some calls for this during finals for sure.", "author": "Emily D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-10-29", "description": "I had the Phad Thai. Not only did they get the order wrong - they kept my credit card. I would avoid this restaurant at all costs.", "author": "Joseph W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-03-21", "description": "(See pics) Review #1139. While the sauce and food seemed to be different (and looked more authentic), the overall taste was just okay.\n\nDuck salad (larb ped) was a bit salty but with a good number of duck bites. The steamed chicken was with good sauce but the chicken itself was bland and dry. It's really not difficult to make a tasty chicken and this one needed some seasoning.\n\nThe decoration is very modern and with very white tables and chairs. The door looked like one of those bar heavy ones.\n\nWith the extensive menu I will have to come back and hope for other better dishes.", "author": "T L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-07-13", "description": "I think not. We ordered delivery: shrimp pad thai, green curry w/ brown rice, and basil chicken.\n\nThe shrimp in the pad thai was seriously over cooked and fishy. The brown rice was over a day old or something. It was hard and  dry like the bottom of a rice pot that had been sitting out overnight.\n\nOne star because they were open on 4th of July when no one else was.", "author": "Becca L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-27", "description": "Love the crispy pork belly texture. It's crunchy, sticky, mushy, and meaty all at once. Try it with the basil and peppers!", "author": "Kyle T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-02-27", "description": "Best taste thai restaurant in sf, but worst service ever too. Waitresses never smile, bad service, gossip costumers all the time, never ask for more water or anything else ok or not. Whatever, If u don't care about service, foods are very good, but how can i give 15% tip for service like this almost everyday. They always blame less tip's costumers, but they forgot to think about themselves...", "author": "Visarnpong C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-01-29", "description": "Came here on a rainy Friday by myself to eat a quick meal before heading out to meet friends at a nearby bar. The waiters are friendly and the restaurant is quiet and pleasant. Prices seem pretty reasonable too. I ordered the Pad See Moo, and the first bite was great, but soon realized it was way too salty. I had to order a side of rice just to finish it. And afterwards my mouth still felt a salty after taste from the dish.", "author": "Jon C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-06-26", "description": "If I could give them no star, I would . Ordered for delivery at 11:30 pm, and was told that food would be delivered within 45 minutes. Although I was hungry, I waited patiently , food didn't come within 45 minutes, and I called back @ 1am, the lady answered the phone told me that the driver was on his way, I waited patiently again, because it was only a 5 minute drive. The deliver guy never showed up, and I didn't get any call neither! this is ridiculous , I will never order from this place again !", "author": "Jon L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-09", "description": "I with my wife really like this place. Food is very tasty. The atmosphere  is relaxed and cozy. Romantic music, good stuff, great food and the prices are average (for example: 12$ for noodle or rice with seafood) - for me it's the best Thai restaurant in SF Downtown :)", "author": "Ilia S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-16", "description": "My friends and I were planning to go to osha Thai but for some reason they were closed so out of desperation we looked for another place close-by.     At first we were hesitant to try iThai because it sounded like an Internet cafe but we were desperate. We were happy that we gave this place a shot because it really impressed us. Everyone was happy with their dishes. The portion sizes seemed fine. The ambiance is a little dark so it feels intimate, for some reason it reminds me  of the rainforest cafe. Overall I like this food and atmosphere.", "author": "Serina J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-23", "description": "I really love this place.  I usually get the spicy basil clams but pretty much anything you get, you can't really go wrong.  The more than stellar staff is super friendly and very attentive, I never have to ask for anything.  But the true star of the show, the winner, is the food.  I'm always happy to be around the area because I know I'll be stoping in here for a delicious meal.  I truly recommend iThai to anyone who wants to fulfill their Thai food craving.", "author": "Christian H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-17", "description": "iThai suffers from being the new kid in a neighborhood, with a confused concept and a dozen or two other Thai restaurants in the neighborhood.\n\nFirst the food, which is the standout. All of the dishes I've had here had decent ingredients and were well prepared, with a complexity and depth of flavor two notches above a basic neighborhood Thai spot: the sauces were not sweet or gloppy, the noodles not overcooked, the seafood tasted fresher, and lots of stuff had a good sear on it and was prepped by somebody who knows how to use a knife. The menu is extensive and varied, not just the usual stuff: a whole large wok-fried squid, pork shoulder salad, beef stew with tamarind broth, interesting stuff.\n\nAlthough priced at or lower the more popular places nearby, with better food, it's not as busy as it should be, I guess they haven't got the message across yet. The name and sleek-ish decor are on obvious homage to Apple, I think they're trying unsuccessfully to appeal to a young urban crowd. But then there's a stage in the back, little used, that seems setup for karaoke or something. A few months ago they wisely took all the English names off the menu, painful attempts to be cute, and replaced them with proper Thai names. Whatever it is, it's not unpleasant but I'm just not feeling it. Oh well, they're friendly, the price is right, and the food is very tasty, that's enough for me.", "author": "Gil S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-03-19", "description": "I was in search of anything that wasn't a burger place for dinner one rainy evening. This restaurant was near the hostel I was staying at, so I walked in after trekking around in the rain for somewhere to eat, preferably something savory. I asked the hostess if there was room for me, one person. From what I saw, it was hopping but not packed like sardines. She said yes and took me to an empty table. I sat down and waited for a server to come over to ask what I wanted to drink. A couple of minutes went by and nothing, so I pulled out my phone to entertain myself until somebody came over. Five to ten minutes later, nobody came over to my area, so I left. This was one of the worst customer service experiences that I had.", "author": "Gloria A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-06-15", "description": "DO NOT ORDER DELIVERY FROM HERE\nThis is the second time that I ordered from iThai for my office. The delivery guy was AWEFUL. He was late 1st off. Then he was rude on top of that. When asked not to set the hot food on our conference room table he proceeded to unpack our food by slamming each dish down as he took it out of the delivery box telling us he \"doesn't have time\". When we asked for our receipt the driver stalked off towards the door not saying a word. \nWhen we called to complain & request our tip back they made excuses saying he was upset having to double park. News flash: ITS THE FINANCIAL DISTRICT. THERE IS NO PARKING! They should know this because they're restaurant is near us. \nThe so called manager kept making excuses when we demanded our tip back. Like the fact that he had to double park was reason enough to be rude to us the customer. We didn't build downtown San Francisco. It's not our fault that parking is scarce. \nNow though out all of this, the food was really good. But I will never order from there again for my office. The good food is NOT worth dealing with the shitty delivery. And this is San Francisco. There are a million other Thai places to order from.", "author": "Leigh M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-08", "description": "Never knew this gem existed in the Tenderloin area. We ordered the Crab Fried Rice, Pad See Ew noodles, Pumpkin Curry with tofu, Pad Thai, and a fried rice dish that had bits of dried fried pork in it. Everything tasted delicious and flavorful. Our host did a great job recommending dishes to us and also explained the cooking process for us. The place is new so it's very clean, comfortable and sleek. Feels a bit like a club atmosphere where the music was quite today's latest. \n\nThe best part was the dessert consisting of deep fried rotti prata w/ coconut ice cream and caramel. Mouthwatering, finger licking good!", "author": "Corie Z."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-06-07", "description": "I waited nearly two hours for delivery. Totally unacceptable, especially when this place is only a few blocks from my apartment, which is why I ordered from them. The driver texted me his location (after I called to complain) and he was strangely all the way on the other side of town. Needless to say, the food was cold. :-(", "author": "Adrian R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-08", "description": "Was here on Saturday night and had the spicy basil chicken, tom ka (mmmmm), larb, beef fried rice, and a couple other dishes . Deliciousness, great flavors. They also have beer towers which came in handy to cool down our mouths because our food was spicy!", "author": "Ms. M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-03", "description": "If an apple store met a Thai restaurant this restaurant would be it.\n\nThe food was excellent and the decor was very modern nouveau.\n\nThe only thing I didn't Like on the menu was the Curry puffs appetizers. It appeared as if they had been previously fried and then fried again for us.  The curry chicken was not flavorful.  \n\nWe also had the yellow curry chicken main course which was excellent and the pad Thai noodles which were adequate. The larb salad was mostly meat and very little salad.  It was spicy and crunchy.  It would easily fit for a main  course.  \n\nOverall, the experience was excellent, the food was excellent, and the ambience was clinically excellent.  I would do it again.", "author": "Steve M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-29", "description": "Absolutely amazing! Probably my forever favorite Thai restaurant for a hearty and quality meal.\n\nCame here with a friend and was blown away by the menu items. They had Thai street food that I don't think you could find anywhere else, made like that! For example, hoi tod, which is almost like a fried mussels pancake that you drench in this sweet, spicy sauce. Just thinking about it makes my mouth drool a little..\n\nWe ordered, I think, a bit too much but food this good can be my leftovers any day!\n\nA definite recommendation to anyone. I'll for sure be back soon.", "author": "Christine N."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-02-13", "description": "I ordered dinner thru eat24hours.com for my boyfriend and had it delivered at his office last night.\n\nOrdering online is very easy and convenient.\n\nWhy 2 stars? \n\nI ordered Kao Mun Gai tod which was described as crispy fried chicken in a bed of GARLIC rice (my bf loves garlic rice thats why i ordered this!)\n\nWhat we got? Was a dried overcooked chicken breast, not all crunchy nor crispy. And it came with steamed rice ??!!! What happened to the garlic rice?\n\nI also ordered Kao Pad Kark Moo which was apparently one of their best sellers and it says you'd be \"hooked up\" once u tried it.... It was okay. Nothing special about it\n\nThe two stars are for the Karprow Nuer Special which was delightfully flavorful and beef was tender! It is definitely something anyone will enjoy!\n\nVery disappointed with the chicken n garlic rice ... Cant get over it!", "author": "Batchie B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-06", "description": "LOVE this place. \n\nI've only ever ordered delivery (many many times) but the location looks nice whenever I drive by. Great food, quick delivery (usually in about 45 min), great prices. Nice, friendly delivery people. I've ordered a good portion of the menu. Some of my favorites are the spicy basil chicken, pumpkin curry, choo chee salmon, kao mun gai, spicy eggplant and pad see ew with chicken. The thai chicken soup is great too for cold days.\n\nNew favorite delivery place!!", "author": "Amy G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-23", "description": "Prompt delivery, tasty, good price.", "author": "Mr And Mrs S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-09", "description": "Love this place!\nHowever expect no parking! \n\nI never reviewed places before, but this one deserves a review. So I live in San Jose, and the first time my cousins and I came here, it was just a place we stumbled upon. At first we were headed towards Farm Table, a small and very expensive (although very good) cafe just a couple doors up Post St., but for being a little too expensive for a small portion, some of us didn't buy anything and some did but were still hungry after. So we decided to go to iThai. That was all it took for us to like this place.....\n\n\nSo yesterday, our whole family decided to go to SF and to see if this place was really a good and consistent place, we decided to go here again. Parking of course was nonexistent and eventually found some 2 blocks up Post. Anyway, this is what we ordered (well what I tried anyway): \n\n-spicy basil chicken: I order this one, I asked for medium spicy & sub minced meat for pieces of meat. This was by far one of the most delicious basil chicken dishes I have had. The chicken was tender, the sauce was delicious, the peppers were cooked very well. The only downside is that it wasn't medium hot in which I had to add more chili.\n\n-tom yum chicken w/o coconut meat: I also ordered this one, which I asked for medium spicy as well. Again it wasn't medium spicy or spicy at all, but it was very delicious. It wasn't too sweet or too tart. I've had better but this came really close. \n\n-papaya salad: First off, I never liked papaya salad, but this one changed me. Very good. \n\n-Pad Thai thai hot: my mom got this one and she said it wasn't at all thai hot, which she then added loads of chili. She said it was too sweet, and that it had too much fish sauce in it, but was good. \n\n-Pad Kee Mao: This one was good. The bell peppers were really soft and tender, the basil made the dish. \n\n-Kao Mun Gai: The rice was very good. \n\nOverall a very excellent thai place. The spicy levels needs work, but I definitely recommend trying this place if you ever go to SF and are tired of the same pier 39 foods. :) \n\nP.S You should come to San Jose! We need a good Thai place! You would have a regular. :D", "author": "Jennifer G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-07-30", "description": "Ordered delivery from here. Food was bland and awful. Not recommended. Ar Roi is MUCH better.", "author": "Michael D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-30", "description": "They have incredibly delicious food for the money.  The fried chicken over garlic rice is delectable, and they mix all their sauces very well.\n\nCould almost have 5 stars, but the delivery guys take getting lost in the building to an art form.  It's like they get off at every floor and hope that's the one.", "author": "Adam S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-07-01", "description": "The food is good, though portions are a little small. However, presentation is good, and flavors are fantastic, unless you don't like coconut. They use coconut cream in a lot of their dishes. I'm not the biggest fan, but I thought it tasted ok. \nThis was a great little find.", "author": "Karen C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-01-05", "description": "The place was empty Saturday afternoon and we stopped here because our first choice was closed, and we thought 3.5 stars was a decent rating.\n\nWe were wrong. \n\nAfter being seated, our party of five was served partially filled, dirty glasses of room-temperature water. You read right, the glasses were dirty. Starving and unfamiliar with the restaurants in the area, and parking meter ticking, we opted to put our disgust aside and hope for good food.\n\nWhile waiting for food I visited the restroom, which was fair on the cleanliness scale. That's also when I discovered, entering the hall to the restoom, sat glasses of water on a tray, ready to be served. They weren't near the restroom, but it's still gross.\n\nThe food took at least 30 minutes, despite there being only two other parties of two seated during the wait. Not only that, but several minutes passed between the first dishes brought out and the last. In fact, my meal was last, and nearly 8 minutes behind the first plate. Since their food was getting cold I insisted the others begin.\n\nThankfully, my dish of chicken on garlic rice was hot and tasty. In all the food was good, with the exception of the beef in the curry dish, which was described as rubbery and unedible. The presentation was also very good.\n\nDespite the food being a mostly good to very good,  the other factors ruined the experience. None of us will return to this place, and therefore I absolutely cannot recommend it.", "author": "Kenny R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-28", "description": "I read an email from Thrillist or UrbanDaddy that featured iThai. My dentist brought it up during my appointment earlier today and ironically, I went to try the restaurant after I just got my teeth cleaned.\n\nFor a minute I thought the restaurant was closed, since it was mid afternoon and no one was inside. There was a menu posted to the right of the door so I browsed for a few minutes to decide what I want to base my review on, tough between my favorite pad kee mao or the enticing lunch specials for dine-in only (11-3pm daily including weekends!).\n\nFinally I walked in to be greeted after 30 seconds by staff inside the kitchen. I was going to get take-out and eat in the mall but I sat down and ordered the lunch specials anyway. My meal was the $9.95 lunch special-\n1) appetizer: chicken satay (2 skewers)\n2) spicy basil chicken with rice\n\nThe order was taken down on an iPad, very fitting. And there is free Wi-fi.\n\nA Yelp check-in entitled me to a free Thai iced tea. I was delighted to drink that in addition to the house soup included with the lunch special! The soup was a bit cold, probably because it was sitting out but it contained a good combination of broccoli and pepper, at least. Because I was the only one there, the food came out in a timely manner, roughly 5 minutes after the soup. The mini appetizer was served on the same plate as the entree.\n\nThe chicken satay skewers were yummy and the peanut sauce was not overpowering like other Thai establishments. I hoped for more meat or one more skewer for an appetizer but oh well. The spicy basil chicken was flavorful with the white rice. The portion size was appropriate but isn't enough to fill my stomach. However, I am on a smaller diet so it's justifiable this time.\n\nThe restroom was pretty average. Another Yelper mentioned usage of LEDs but I didn't see any at first. When you turn on the faucet...wow, pretty entertaining...makes washing hands fun almost.", "author": "Dominic T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-10-04", "description": "Placed an order via Eat24. The order never came. I was kept being told that the order was \"on the way\" or \"5-10 mins away\" and suddenly I find out it got cancelled after waiting for two hours. Ugh I am really hungry and frustrated right now.", "author": "Shay P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-03-10", "description": "Well that was $50 flushed down the toilet...so lets see the imitation Tom yum soup was awful and fell somewhere in between whole mushroom soup and Campbell's..the pad kee was nothing but overly hot noodles, with spice that was meant to shield something. There was no way that we could endure the awfulness of such poor Thai food, so we took the loss, left, and ate at the hotel. If you want burger king or taco bell of Thai this is the place to go", "author": "Noanya S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-14", "description": "After catching the Warriors game at the Tap Room, we headed to iThai for some boozy bites. My brother kept raving about how this spot is one of his favorites, and now I can see why! He ordered a beer tower, which wasn't ideal since I wanted to really enjoy the food without being too bloated. With that said - they have beer towers! And live music on a stage! They really know how to cater to the late night crowd. The servers were very patient with all the buzzed customers coming in, and still gave recommendations on food. We ordered the chicken wings and spring rolls for munchies, and a shrimp pad thai togo. The chicken was so good!!!!! I love wings, and really enjoyed the sauce and spicy level on these. The spring rolls were decent - nothing special, but a pretty good appetizer. Even though we had the pad thai the next day, it was delicious. The portion was huge and could easily feed 3 people. Even though we just happened to stumble across iThai that night, I hope I can return to try more food.", "author": "Hannah P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-10-30", "description": "Ordered delivery today and this was the worst delivery and food experience I've had. Food took 2 hours to arrive (window was 45-90 minutes), and food was completely cold upon arrival, underspiced, and bland. I ordered through Eat24, and when I told them this they tried to get a discount from the restaurant, but the most the restaurant would give was 10% off. Horrible customer service for such a bad experience. Food is so bad it's not getting eaten.", "author": "Caroline R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-09-22", "description": "Learn to speak English for gods sake!!!! They DO NOT understand you when you order over the phone!", "author": "Mojo M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-11", "description": "I delivered food last night. I think that so delicious.I ordered Kaprow moo grob, Kao mun gai, Goong ob woon sen, Calamary, Brownrice, Fried banana with ice cream. Especially fried calamary and Kao mun gai was yummy. \nNext time I will ordered Choo Chee Salmon and ithai friedrice.\nI've been there one time but at that time have friday night like band live music. It's very busy. Maybe I got some food tonight agian!", "author": "Santipap K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-29", "description": "I love this place. Everything I've had is amazing! It's hard not to come everyday. The waitresses are always nice and friendly, and the food comes out quick, hot and not to mention delicious.", "author": "Morgan W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-07-03", "description": "Pretty good thai food with a menu that is as expected.", "author": "Michael M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-08-20", "description": "This place is horrible. I ordered fried banana with coconut ice cream and they did not include ice cream on the delivery. When i found about it, they offered me a refund instead which ruins my dessert now. I called their restaurant after 15mins of waiting for my ice cream and the one who picked up the phone said it will take another 30mins to have my ice cream. We are near their restaurat so it should not take that long. THE LADY ON THE PHONE IS SOOOO RUDE. I am definitely not going to order at this place again!!!", "author": "Mel U."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-08-30", "description": "The Tom yum tastes like puke. Ordered online, and the menu failed to inform customers that the dish has peanuts in it. I'm not allergic to peanuts but if I was I'd make them pay for my medical bills. \nCrab fried rice was fine, tastes just like crab fried rice you can get anywhere else in SF..\nI regret trying something new (tom yum) but I'm glad I ordered the crab fried rice to be safe. I probably won't order here again unless its past midnight and I want Thai.", "author": "Lena E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-18", "description": "Off the beaten track but worth the walk. Service was great, food was incredible. Come hungry. The decor is pretty basic but cool.  There were a group of 9 of us and we got seated immediately and everybody was really impressed. I will be back next time I am \nin SF.", "author": "Daren G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-22", "description": "Good foods : rad na talay and yen ta fo hot pot are delicious", "author": "Tinnie L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-09", "description": "My new favorite Thai place.  The food is:  really good quality, flavors are awesome, not greasy/heavy, pretty typical of what you'd actually find in Bangkok.  I see a lot of people on here complaining about the decor/theme.  However, their tagline is \"Bangkok Street Food\".  I think the decor fits just fine with that.  \n\nReally good food and not expensive.  I come here often.", "author": "Allison M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-09", "description": "My favorite Thai place in San Francisco!\n\nMy wife and I have been trying to find authentic thai food, and this is one of the few places where you can get similar food/flavor as what you can get in Thailand.\n\nIn the last 3 weeks we have ordered delivery from iThai about 10 times. My wife loves the Kao Niao Moo Ping and I love the Pad See-Ew Moo. We've also tried the Thai Sukiyaki, Green Curry Fried Rice, Phad Thai and the American Fried Rice. All of them were great!  \n\nIt might not be the right place for everyone - e.g., it's Pad Thai is not the super sweet westernized version. But it has a great selection of authentic Thai food in the city. Highly recommend!!", "author": "John C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-19", "description": "quick and friendly service is a strongpoint...i love the thai street style dishes that they offer that is not found in any other thai restaurants in the city...fri after 10pm the place becomes a party with a live rock band..cheers!", "author": "Dustin G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-07-30", "description": "Placed a delivery order around 12:30am on a Friday night, was told delivery was confirmed for 1:19am and the food never came.  I called the restaurant, they asked for my address, put me on hold, then hung up.  Extremely frustrating and unprofessional.  If they treat customers like this, I can't imagine what standard they use to prepare the food.  Would give 0 star if I can.", "author": "C H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-09", "description": "Definitely improved a lot since the last time I came here!\nFood quality was pretty good, portion sizes are pretty decent, they replaced those flimsy chairs with nicer ones.\nThis is a great thai restaurant with good vegetarian options, free wifi and a pretty cozy ambience. Definitely going to come here more often now!", "author": "Aditya M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-06", "description": "LOVE SPICY FOOD?\nThen get their Pad Kee Maw and String Bean Tofu, HOT ! (Both of them come with a choice of chicken, beef, and tofu..I'm vegetarian so I always get the tofu). Without a doubt, you should give this place a try!", "author": "Amanda C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-18", "description": "Surprisingly great.  We ordered via Seamless and it got here pretty fast.\nI have allergies and they called to confirm about ingredients.\n\nCrab curry - really tasty, definitely recommend this.  For some reason it has milk in there.  I like my curries with coconut milk only.  Not too sweet :) drank up all the remaining sauce.\nGarlic/pepper beef - Pretty tasty, on the saltier side but I liked it that way.  Tons of fresh garlic in there.\nGrilled pork shoulder - Really awesome.  Great texture and delicate flavor.  Only wish they included slightly more meat--it's served with a lot of salad.  Sauce on the side was a little overpowering for the meat.\n\nWould definitely come back.", "author": "Xue H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-03-18", "description": "The food here is so average. Me and husband each had an entree, shared an app, and each had a drink. We used a scout mob and it was around $40. I wish we had gone somewhere else and paid more for better food. Not awful just not at all memorable. Actually, I do remember that the chicken satay had an odd chewy texture.\n\nThe tables and chairs are super cheap. Not at all comfortable. Poor construction. I actually like the Ikea/Apple design. I wish the food was better.\n\nSkip it, even with the deal.", "author": "Kiristen R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-12-19", "description": "Converted.\n\nNot like these people: http://www.youtube.com/watch?v=rdIWKytq_q4\n\nInstead for this dish: Preaw Wan.\n\nHomemade sweet and sour sauce got me interested and the generous and delicious blend of white meat chicken and stir-fried vegetables made me a customer for life.\n\nService was attentive and friendly. Eight bucks was very reasonable. Only the decor underwhelmed. Cheesy if a bit bland.\n\nAndroid theme might have earned them a fifth star.", "author": "Jason B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-27", "description": "I ordered take out from this place and it was lightening fast. I paid with my debit card online. When the guy came to deliver, there wasn't an option to add a tip. I didn't have any cash to give him (hence me using my debit card) so I felt bad. He was still all smiles though.\n\nThe food was great. I recommend the Plamuk Tod. It's a fried calamari appetizer with this tasty spicy/sweet sauce.", "author": "Vivian A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-08-15", "description": "Came here last night for some take out since it was on the way home. Next time I'm walking a couple of blocks out of my way for some good Thai food.\n\nYellow curry is my absolutely favorite curry dish, mainly because it has potatoes, and I realllly love potatoes. So what did I order here? Yellow curry of course, with a side of brown rice.\n\nFirst the price came out to like $13-14 bucks! For yellow curry and rice! Overpriced compared to other Thai restaurants in the area. Second, it was the most flavorless curry I have ever tasted. I might as well have just eaten coconut milk with raw vegetables, since those weren't cooked all the way either. And the potatoes, completely uncooked, raw, crispy potatoes. I wanted to cry.\n\nNever again, iThai. Even though your lights look cool, your food isn't!", "author": "Sarah H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-01-07", "description": "I was at work I order a delivery and I was starving .when I got the what I order it was horrible first I find hair in the soup and in the shrimp that make me feel like vomiting also the sukyaki was not good not even ok and spring rolls oily and half burned  I felt so so bad. Also it cost me 37$ with tips", "author": "Ussra L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-23", "description": "I'm always down for Thai; their spices are just out of this world.\n\nAnd I'll say that iThai does a fine job with the best cuisine in the world, but it wasn't mindblowing. That's a 4 out of 5 for me.\n\nTry their soups, though. They kick with a bite that's straight out of Bangkok.", "author": "Kevin L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-19", "description": "The best food ever! I love spicy food!!! They definitely nail it! Came home from work around 11:30pm and was really hungry so I had order delivery. Lemongrass chicken, som tum pu salad super hot, mussaman Nuer very spicy, jasmine rice and total was 31.64 after tax.  I like how they can make it really spicy and the food was amazingly tasty! I have no complaints! Defiantly going to be ordering delivery from this place again. Can't wait to try their other dishes that they have :)", "author": "diana l."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-07-31", "description": "My friend and I got the Groupon for this restaurant.  The deal is $24 with two cocktails, one appetizer and two main dishes.  Pretty good!  So we decided to check out this place.  \n\nWe came here on a Tuesday around 5:30pm and we were the first table there.  I thought it was kinda of early but we left at 7pm and the restaurant was still empty.........\n\nThe service was pretty nice.  The girls were very friendly and helpful.  \n\nWe ordered:\n\nGreen papaya - Very standard, nothing special.\n\nPo-Taak (Soup) - Spicy and sour soup with assorted seafood, mushroom, basil, and lime.  We asked for mild and it was not too spicy.  It tasted good.  The seafood was mostly calamari and mushroom.  \n\nPumpkin Curry -  Red curry with prawns, pumpkin, bell peppers, and onions.  This was my favorite dish of the night.  The curry was very creamy and flavorful.  \n\nKao Na Ped - Roasted duck over rice with brown gravy sauce.  The duck was good.  Very tender but the rice was little bit too soft.\n\nWe also ordered two cocktails (forgot the names) and the drinks were not impressive.  \n\nSince we ordered one more dish, so we needed to pay full price for the extra dish.  Our bill ended up $24 more after Groupon (total will be $48 with tip).", "author": "Liza T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-12-18", "description": "Terrible place. It took more than an hour for my order and not only that,they got my order wrong and I specifically asked for extra jalapeños 3 times to make sure I get that but that clearly wasn't enough over the phone...", "author": "rob a."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-06-18", "description": "Decent Food. We had a deal for some $$ off. Would not be my first choice for thai in the city. Best for lunch.", "author": "Janelle G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-08-10", "description": "So, apparently my previous post was removed because I didn't provide enough detail of why I didn't like this place.  The only reason my post was so short, was because the experience was so... for lack of a better word... disgusting, that I didn't care to post more.  Here was my old post \"I really wanted to like you because I live so close... but gross. Sorry.\"\n\nSo you want more details of why I gave you only one star, well here you go:\n\nMy boyfriend and I went into the restaurant because the place had opened down the street from where we live and it looked cool.  The colors/decor were neat and it seemed to be a quite popular with a full crowd.  Alas, like many restaurants who are... as Cher would put it \"a full on monet,\" we waited for the hype to calm and decided to try the food.  Here is what we ordered:\n\n1. Tom Yum Noodle Soup.  It was bland and not at all favorable. The fish balls were tough and honestly uneatable.  The broth was super boring and I felt like the quality overall was a one star on a grade of 1-5. I ate only two bites of it and had had enough. It's VERY RARE that I order a dinner and can't muster myself to eat more than a couple of bites.\n\n2. My boyfriend had the iThai Seafood Noodles.  The mussels were small, dinky and frankly we thought the quality of them might make is ill.  We tried it anyway and confirmed our initial conclusion - they were gross. Secondly, the shrimp - omg where did you get the shrimp?  It was SUPER tough and flavorless. My boyfriend and I both tried a couple of bites and had enough.\n\nThe server was SUPER sweet however, and we kindly asked for containers to-go. We packaged up our food and gave it to a homeless person on our way out.  We then proceeded to another restaurant to order dinner AGAIN!!! What a waste of money.  I honestly even felt a little bad giving that food to the homeless man.\n\nI guess my point here is that I didn't want to spend the time going into why the place was gross - it just was.  Maybe we ordered the wrong dishes?  Look, we walk past your restaurant multiple times a day - there is a reason why it is always empty.    \n\nI'm sorry iThai.  I'm a legitimate customer with a legitimate reason to post what I posted and what I'm posting now.  People deserve to know if they're going to spend $40+ on a dinner that is flavorless and poor quality.  Hey - at least our beer was good = 1 STAR.\n\nIf you want to receive better reviews, then fork out a little more for better quality.  THEN we might return and THEN I might change my review - which I have done for many other restaurants in the past.", "author": "Noneya B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-03-14", "description": "Not really for me.  I was recommended this restaurant partially because of the convenience, but was underwhelmed by the food and restaurant itself.  I had the pumpkin curry and pad see ew, neither of which were impressive, and were both on the oily side.  Also the bowls/plates/utensils seemed to be old and I wasn't comfortable using them without wiping them down myself.", "author": "Josh Q."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-04-28", "description": "Ordered delivery from here twice. First time the Khao Man Gai wasn't freshly steamed, it was old chicken reheated. Second order, I ordered the grilled chicken. Again, it was over marinated, old chicken. I ordered other things both times, but they weren't noteworthy.", "author": "Derrick V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-19", "description": "The food is OK enough for a Thai restaurant that's surrounded by four other Thai restaurants.\n\nWhat iThai needs is pictures on the wall. As it stands now, it feels like I'm eating in a bathroom. And they need a door. There's nothing inviting about a solid wooden door with no windows.", "author": "Cody R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-07-23", "description": "After a long day of playing my part as a tourist, my friends wanted to go bar hopping, but I was too tired to go back out. Alone in my hotel room, I found this spot listed on Delivery . com less than a mile away from where I was staying and decided to place an order on a whim. I ended up placing an order for their iThai Seafood noodles, an order of Kra Tiam Nuer, and a portion of Jasmine rice. I placed my order at 9:56 PM on a Saturday night, and received it a little over an hour later.\n\nWhile I was a bit disappointing in the time for delivery, the order arrived complete, the delivery guy seemed friendly enough, and the food piping hot. Out of the whole order, I enjoyed the seafood noodles the most. I'm a really big fan of garlic and the noodles hit the spot; the clams and shrimp were also cooked well and the basil added an interesting flavor to the garlic noodles. As for the beef dish, it was a bit blander than my liking, but it went down well with the jasmine rice. \n\nOverall, the delivery experience was pretty straightforward. I'd do it again if I'm in town and feeling a bit lazy after a long day.", "author": "Brian C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-08", "description": "Ordered delivery.  Food came in less than 45 minutes,  Katie was well mannered and friendly.  We got Kao Pad Kark Moo-fried rice, was great! Wonderful flavors, my BF ate tge entire container lol. We also had Tom Kha Hai, Pad Tai Goong, Sur Ring Hai and fried bananas w/ice cream.  The food was fucking amazing.  Very flavorful, still warn, crunchy, crispy and everything inbetween. \n\nOnly reason I'm not giving iThai a 5 is b/c the icream was melted (I understand that happpens) but it probably should have been in a seperate and double bag, not in the same bag as the hot, and steamy, food that mist like made the ice cream melt quicker. Also, you all should consider getting a free side dish w/the order of 2+ entries like many other food spots do. We spent $60 bucks and a free dish would have made me feel slightly less guilty about spending so much on takeout lol...\n\nOverall, I can't wait to experience iThai in person, the pics looks like a chill spot to eat at!  I will def. Order again and reccommend to friends. \n\nMy taste buds went craaaaaa ;)", "author": "Patrice S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-06", "description": "Come to iThai if you happen to be in the neighborhood and want a casual environment to grab a quick bite. There are lights on the walls that are constantly changing and the space has a clean, minimalist approach to decorations and furniture.  \n\nI wasn't a big fan of 1) the Creamy Crab Meat (too creamy, felt like an egg salad with crab mixed in), 2) the Massaman Nuer (beef red curry with potatoes was okay - the beef was not tender enough for me to order this again), and 3) the Pad Phed (too lemongrass-y for me and chicken was a little dry).\n\nBut, I loved 1) the Fresh Rolls - tofu and veggies wrapped in rice paper and it comes with a spicy vinaigrette that perfectly complements the roll, and 2)  the Kang Keaw Wan (bamboo shoots, eggplant, basil green curry) was awesome and pretty spicy. \n\niThai delivers! I used GrubHub which was really easy and quick.  Obviously the menu can be hit or miss - but if you get a hit, you won't be disappointed.\n\nAlso, they have Singha beer ($3.5) - which goes really well with the food!", "author": "Kimya P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-05-30", "description": "I'm not really sure how this place got 4 stars. The iOS theme is really poorly done; it's got cheesy atmosphere, not so great ordering software on the iPad, no Square device (I was expecting something high-tech about the experience), and no digital menus on the iPad (that would have been cool!)\n\nIn addition, the food was just mediocre, and it's really hard to justify going here when you've got the original Osha just around the block. \n\nI agree with the other reviewer that the food was not hot enough, and it didn't seem like they were putting much effort into it.", "author": "Mike G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-05-27", "description": "I have gone here twice for take-out. First time the food was okay. This time the food was horrible. I threw it away after a few bites. The kao pad kark moo's pork belly was deep fried beyond all recognition. The pad kee mao was a congealed heap of noodles with sub-par beef, but the flavor was good with a nice spice. The lemon grass chicken tasted neither of lemongrass nor chicken, it tasted of dirty fryer oil.\n\nThere are too any good Thai places in the TL for me to order from iThai.", "author": "Joshua C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-02-22", "description": "iThai, or iRipoffApple, is actually pretty damn good. I contemplated my decision of what to get for about 5 minutes before i saw the dish Massaman Curry. It states that it was the top dish of 2011 according to CNN.\n\nNow I dunno if they mean just thai or all foods, but that is damn high praise and I was willing to try. On top of that, we got a free thai ice tea for checking in (Thanks Yelp!).\n\nThe curry was creamy orgasmic goodness and if you told me it was made from 4 babies and bald eagle, I would not care. CNN was right. It was so good, my friend disregarded his own dish and ordered his own. \n\nIn regards to the ikea furniture, it was fine and comfortable so I didnt mind. Ipad pictures of desserts were tempting but was too full to get any. Decor was fine and they bring you your receipt in a plastic cube. Kinda neat.\n\nGet the CNN Curry you bastards and you wont regret it.", "author": "David C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-17", "description": "I work odd hours and often don't have time or energy to cook a meal.  iThai is one of my favourite restaurants to order delivery from. Service/delivery is friendly and very fast. \n\nI've found the food to be consistently good, and I am now addicted to their seafood noodles. I don't want to eat anything else, lol.  I also like that they don't tone down the spice levels like other restaurants--if it says spicy, they mean it! Overall, a solid spot for thai food cravings.", "author": "Ringo M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-30", "description": "Great food and service! I really like pumpkin curry. Its way better than osha! good quality food", "author": "Terisa R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-29", "description": "Just walked up on this place, without recommendation--tried it, and glad we did!  Food was superb, (Phad Thai, a seafood curry, fried rice, chef's special beef, and spring rolls).  Service was fine.  Would rate 5*'s with a general clean-up and some serious attention to the restroom; as another y", "author": "Dag E. J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-29", "description": "great food ! loved rice and curry puffs ! as a vegetarian these were my first order and i must say both are have  met my satisfaction !", "author": "Bhaskara C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-01", "description": "Got the pad kee Mao and green curry fried rice. The food is really nice and flavorful and came out really quickly. However the place smelled musty and the egg rolls were super oily.", "author": "Payal S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-08-05", "description": "I was horribly disappointed. Yellow curry was watery, potatoes uncooked and no one spoke English. I was asked if I want white or brown rice\n Rice cost me 2.50. Sadly I should have driven home. -live and learn.", "author": "Patric A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-22", "description": "By far the BEST THAI food I've had since moving to the Bay area from L.A. and we have very good Thai Food in Thai Town back home let me say. My favorite are the Pad Kee Mao Nuer (drunken noodles) which I order at least three times a week. I've also tried the Tom Yum Goong, Tom Kha Gai (soups) and are excellent to sooth my mood on those windy cold days here in the bay. The iThai Beef salad and Larb salad with Jasmine rice and the Kang Karee Gai (yellow curry) are also a must for me. I try to switch it up every week, but always resort to what I've mentioned.  A MUST TRY while in town everytime. 5 stars iThai! - Luisa Wyndham Concierge.", "author": "Luisa O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-20", "description": "My first online order at Yelp. Overall, the food is good and it takes only 20 minutes to deliver. Only one thing that makes me feel weird. I was asked: How much do you want for the change....That's not how it works boy!!", "author": "Jeremy S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-11", "description": "Oh my goodness, cutest servers ever! So sweet. I walked in and immediately felt calm, not only from the warm, friendly smiling people working there, but the lighting and decor were stark metallic black and warmly lit. The light above the tables felt like spotlights, but with a switch of the bulb to a warm, more subdued light...But whatever, some people really like to see their food, and I couldn't have cared less!\n\nThe food was phenomenal, and although I love Thai food, I'm creature of habit and almost always go for the chicken or vegetable curry. This time, I really wanted vegetable curry, because the description of mixed veggies sounded far more enticing than the other, but I asked the server if it was possible to get chicken in with it. After a bit of careful questioning and explaining, I ordered the veggie curry with chicken and learned it came with a variety of mushrooms, eggplant (holy moly the combo was good this round!), red peppers and other your normal usuals, like bamboo shoots, green peppers and tofu. The serving of chicken that came with it was bountiful, and I was bit surprised and elated. I ordered hot tea as usual and what a flavor and color, amber orange with a delightful, robust flavor. Even the rice came on a separate plate so nicely shaped: it looked like a tower. All of the flavors felt and tasted fresh and nourishing. My favorite Thai restaurant in SF yet, and I've tried several. \n\nHonestly, such a great place, I am excited to go back. I had been going across the street to Thai Stick unknowingly where I have felt not the best servers work. But here, all of the elements aligned in terms of great food, great service and niche atmosphere for your party of 2 or more. \n\nDefinitely can't wait to go back: I have no idea what music they were playing. Not that it matters, but just saying, y'all might want to know, right?", "author": "Gio M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-14", "description": "Like Kristin P., iLike. \n\niThai was great. We arrived with a big group on a Wednesday night. We made reservations, but that didn't seem necessary. They were able to fit us in no problem. \n\nWe ordered a little bit of everything and shared around the table. The waiter was very attentive, always on hand with a photo of your food (via iPad, of course) to help you decide. Unlike fast food restaurants, the food looked *just like* the photos and tasted as amazing as you'd expect. My favorite was the pumpkin curry - and all the veggie options were delish. The fried tofu was especially good as well - not dried out like you sometimes find in Thai restaurants. \n\nThis place is a gem in the Tenderloin and worth the trek past homeless people and junkies. Just how they get away with calling it iThai is still a mystery to me.", "author": "Gretchen S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-02-02", "description": "iLiked iThai a whole lot.  Eating in a sterile dining area with IKEA-like furniture has never been my favorite (Be My Guest Thai in the Inner Richmond), and I realize they're going for the whole clean Apple theme, but the simple quality in general seems to be the decor of choice for some of the new \"hip\" Asian restaurants cropping up.\n\nThe food easily blows nearby Thai restaurants out of the water.  My marker dish, the pra ram, was very good; the peanut sauce was perfect.  My friend had curry with beef and enjoyed it.  I went back to try the pad kee mao and was thoroughly satisfied.  The portions are generous, prices are standard. \n\nHaving only been open for a month, iThai is still in its early stages; they were especially keen on providing the best service.  They are open till 11 pm, which makes them a decent option for food, pre/post-drinking from the plethora of downtown bars.\n\nThe last thing this area (this city) needs is a Thai restaurant.  There are good ones out there.  Most are average.  But great ones like iThai are hard to come by.", "author": "Marsha Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-02", "description": "As I sat down in iThai, I made the following Facebook post:\n\n\"@iThai and wondering what kind of maniac would open a new Thai restaurant in an area that already has 25 such places in a 4 block radius.\"\n\nWell, I stand corrected--this was some of the tastiest Thai I've ever had, and, as one of my favorite cuisine's, I eat the pad-whatever from various places about once a week.\n\nI had takeout: spicy-eggplant-something-or-other with beef. On the way out, the owner (his name was Poo, I think) said that he'd love to hear any suggestions I had about the food the next time I came in.  Nice touch. \n\nThe verdict: The beef was tender, the sauce was hot but not overbearing, and had just a little hint of sweet that was fantastic.  I can't wait to try their \"adventurous\" column on the menu.  Minor suggestion: charge an extra buck and make the portions a tad bigger.\n\nAs a funny side note, it looks like they misprinted the menu's and instead of Creamy Crab Curry, it said Creamy Crap Curry.\n\nAnd that made me LOL at the Eye Thai!", "author": "Rocco B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-22", "description": "Only 3 weeks old and a new favorite! \n\nIt was refreshing to see a menu that wasn't based on the typical pad thai of so many Thai restaurants. There's a whole section on \"Adventurous\" dishes but the best thing to do is to talk to the waiter and look at the drool-inducing photos of food that he'll show you on his iPad. Tell him what you like and you'll get some really delightful food. \n\nHere's what I ordered:\nFlat noodles with ground pork and mushrooms with black bean sauce\nRice with three types of pork - sausage, bbq, and fried pork belly (holy moly, so so good)\nRoti with curry (fresher and lighter curry than I expected. An absolute favorite)\nMango ice cream and fried bananas (huge portion, you should split it)\n\nPair that with two Thai Iced Teas and two beers and it was a feast to share! \n\nCome here for great, unique flavors, amazing service, and a night to change your conception of Thai food in the city.", "author": "Madeline N."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-09-16", "description": "We went there last night with a big group for my friend's birthday, We ordered a varieties of authentic Thai dishes from them.. Food was so good tasty and we enjoyed it\nSadly that we didn't get a good service from a waitress,she wasn't friendly and we had to ask her filled up a water all the time(the restaurant wasn't busy at all) \nWe won't go back there for sure.. \nSorry iThai \nOh.. And we gave them 18% for a gratuity hehehehe .. (She would feel guilty after saw a gratuity,we wishhhhhhhhhh) \nBye Bye iThai!!!", "author": "Junior M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-06", "description": "I love this place. I order for pick up maybe three times a week here; mainly because it is located down the block from my apartment. The restaurant itself is cute and has a nice modern ambiance inside, although i have yet to dine there. It's relatively calm but more busy on the weekends if you want to dine in; the restaurant staff are always super friendly.\n\nSome dishes i recommend on trying are...\nAppetizers/Salads: gai satay, goong gra bog, larb gai, som tum pu (papaya salad with crab), yum woon sen - my personal fave.\n\nMains: spicy basil chicken, gai yang, tom yum goong, any of their fried rices, pad thai goong, pad see-ew with chicken - one of my other faves, karprow nuer special is delicious!!! I also recommend their kang keaw wan gai (green curry).\n\nYou can't forget a thai iced tea!", "author": "Anna G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-07", "description": "Great foods with great services :) \n\nIt's my first time dining in at iThai :) It's a great chance to see the owner in person and he's friendly and nice :) He recommended me some special dishes which were definitely awesome :) There're a lot of authentic dishes on the menu which you guys should try out. iThai is located on Post street between Jones and Leavenworth. Just give it a shot and you won't regret ;)", "author": "Abbey L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-26", "description": "I have been going to ithai ever since my first visit. I guarantee you will be satisfied.  It is authentic, traditional, and very favorable.  Ever since my first visit I have become a regular and I every time.\n\nI love practically every item on the menu I have tried. They always make me feel at home and provide great conversation and laughs when it's not too hectic and busy. \n\nMust Try Dishes:\nKao moo dang\n3 kinds of pork, crispy, bbq, no sauce.", "author": "Ariel S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-11-01", "description": "I have been in once before where the waitress questioned me if I was \"sure that you want to order this?\" I was very offended. YES thats why I ordered it.\n\nMy friend talked me into going again, so I did. This time they charged me $12 just for one order of yellow curry. I didn't even get rice! Thai Stick, which is two buildings down from iThai serves the same dish for $8.95. The cashier then proceeded to take my money without giving me my change back! Very rude. To top it off, the potatoes weren't even thoroughly cooked.\n\nI will never return to iThai again!", "author": "Kayla G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-03-04", "description": "There are a ton of Thai restaurants near my bf's apt, but we decided to go with iThai to try out first. Not sure what tipped us off to it - but it turned out to be a good decision.\n\nWe ordered pad thai and the Massaman curry (yes, the CNN reviewed one), as well as some chicken satay.\n\nEverything was good...and came to us in a timely manner. There was one waitress - and what looked like a waitress in training - so at times it felt like she kept flying by trying to take care of all the tables, but it wasn't that bad. Busy means the food is good, right?\n\nAnyways, the portion size was good, and we particularly enjoyed the peanut sauce that came with the chicken satay.\n\nSome things to change -- I wish they had advertised the desserts somehow before we ordered our meals. I didn't know if they simply didn't serve dessert or if they only had one option and it was free, or what. So we just didn't plan for dessert and got an appetizer. Then when she came to clean up our table, and showed us the three options on her iPad, we were already too full.\n\n(Just for the record they have a mango with sticky rice, banana fritters, and a Thai crepe like thing.)\n\nThe next time I go, I might forego the appetizer to try one of the desserts. Maybe then I can upgrade them to a 4 star review.", "author": "Alison C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-05-19", "description": "Horrible food. Insanely oily. I actually had to spend over five minutes trying to scoop out the oil with my spoon. In addition, food was not hot. Oh I'm sorry, did you guys cook last night and forgot to reheat it in the microwave? COME ON. It is clear that this place is highly unprofessional. Lets not talk about traditional thai food, because this isn't even a comparison. This is me, telling you that they are practically serving inedible swirl. In perfect honesty, I thought it was just that I had gotten a bad item. But hey, if five of your other friends couldn't scarf down their food either - I think it tells you just how bad this place is.\n\nOh, just a note, their 'spicy' options generally do not exist. Neither do they have any form of food heating device such as a stove or a microwave - it seems they merely pour them out of pre-made packs that you can find at the store. Oh jolly - totally worth the fifteen dollars per person!", "author": "Denise T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-27", "description": "Just what I have wanted,perfect balance between spices and I told them to make it very spicy and they did it.Love it!!!!!!Same authentic food that I have in Bangkok streets.", "author": "Nujhat Nashia R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-02-27", "description": "I wish you could give half  stars because I would give it 2 and a half. The service is really really poor, soup was served  AFTER the entree. Everything extra  I ordered I had to  re-ask for, such as extra peanut sauce, lemon for my water, and it was all served with an attitude. Really, my wife and I are  easy to please, but they were pretty rude. \nIf you are an Apple/Mac fanatic, you'll like the atmosphere, the lighting, and everything is designed to look Apple-ish, even the menus like a Mac computer screen.\nI liked that part of it, even being a PC guy (who does macs too), but my wife made the point that  it's a weird combo, kind of like making a Star Wars Mexican restaurant.\nThe pad thai was so so, I liked it less as I ate it and was less ravished.\nI think you can do better food and service wise, but its cute.", "author": "Craig G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-05", "description": "Small friendly place. Came here first time in my first visit to SF with my brother January 2014 because it was across from where we were staying, USA hostel. Great food and cheap! Second visit with my bf and food was superb, again! Bf was impressed too. Advantage is it opens late, til 1am. Not many good places in SF are open late, they seem to shut at 10.30pm. My favourite Thai place in SF. I love the som tum salad and the shrimp pad Thai!! Free wifi :)", "author": "Tina N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-13", "description": "I'm pretty picky when it comes to Thai, this place has some amazing soup.  I tried some my friend ordered and it was so good.  I also got some spring rolls, I really don't like tofu and I'm used to getting Shrimp fresh rolls but these were just okay they are made so that they fall apart after one bite and it's mostly full of noodles so not much flavor.  If they added more cucumber and less carrots and some shrimp they would be much better.  I also like peanut sauce over tamarind but had to pay $2 extra for it and got more sauce than I had rolls for all I wanted was a tiny side to dip in.  Everything else here seemed really good.  only thing I have yet to try are their curries but I assume they will be good.  Always gone with groups and it's easy because they are not too busy so work out well.", "author": "Nirea S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-11", "description": "Excellent food, lovely staff, the only reason I'm giving 4 stars is because of the seating arrangement! Bolted tables and wooden seats makes it less comfortable, but once you start on the food you forget about your tushi :-)", "author": "Maja P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-02-27", "description": "ordered from eat24 and after 2hours wait the order was canseled, from 12.45 to 2.45am 2/27/16", "author": "Hin H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-06-13", "description": "My delivery was just an extremely disappointing experience. I have been craving sweet sticky rice with mango, and took a chance on this place instead of ordering from After Osha like I should have (best mango sticky rice ever for the same price). They called a bit after I placed my order to let me know they didn't have the garlic noodles I ordered, which was the chance to cancel my whole unfortunate order that I missed. I also ordered gai [chicken] satay and an extra cucumber salad. Those were fine but the chicken itself was a little off. What upset me the most is that the boxes inside the bag arrived completely soggy on the outside to the point where I had to use several paper towels and wash my hands repeatedly to deal with it. The mango on my overly firm rice was overripe and totally mushy; I took a few bites and was done. :( :( Oh also the guava juice I ordered had some very strange never before seen chemicals contained in the can, and I just wish there had been an option for some type of fresh juice, which I would have been happy to pay a bit more for.", "author": "Kate R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-12-12", "description": "Delivery experience thru eat24 was terrible. Food was delayed for an hour and a half. Ended up having to cancel.", "author": "Mai H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-02-21", "description": "The theme of this Thai place is cute. Tables and chairs were very simple (kind of reminded me of Ikea). They use iPad's to take your order and they show you pictures of the desserts on the iPad for you to order, unlike the traditional paper menus. I was able to get a free thai iced tea from checking in on yelp! I really enjoyed my Chicken Red Curry, however, the hit entree of the night was the Massaman curry (top rated by CNN).", "author": "Tina W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-22", "description": "Nice decor! It was empty on a Sunday morning but wanted to try it. The lady at the front was super nice. \n\nStarted off with the Keaw Wan Roti, Indian grilled bread served with green curry for dipping. I will need to order the green curry next time because this tasted so dam good!! I had the American Fried Rice, couldn't resist based on the description. And yes! Very good. Unique dish I think. Partner had the Pad Thai (this is how he tests how good a Thai place is). It was good if a little on the average side, but presentation was good. Nice prices too. I will come back. Esp since I'm just a block away ;)", "author": "Vol T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-09-10", "description": "Casual yet sort of hip, aside from the folding chairs you sit in. Surprisingly good thai food here, although the hostess/servers don't seem that interested in serving. They also seemed a little clueless when I said I walked in saying I had a reservation (via opentable), but I guess that's because the place was almost empty when we arrived. The thai iced tea is particularly sweet here.", "author": "Linus W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-03-21", "description": "iThink iLike iThai\n\niPhone and Apple references aside, iThai serves up some solid eats. Is it the best, most inventive Thai ever? No. But it the service is friendly, the menu fairly diverse and the prices are affordable. And the place is super clean! \n\nA few colleagues and I tried a smattering of dishes, but I used most of my stomach capacity on the following:\n\nCurry Puffs: 4/5: Tasty, fried little buggers with tender, curried chicken. Nicely offset by a sweet sauce with a touch of spice. \n\nFresh Rolls: 2/5: Yeah, it's not like I expected an explosion of flavor from these rolls, but they were pretty snoozeworthy. Fresh? Yes. Something I would order again? No. Maybe more kick in the sauce would help? \n\nPad Thai: 3/5: It's a solid Pad Thai. The noodles were nicely cooked, the portions were generous and it wasn't overly saucy. I asked for medium heat and I didn't really get any heat at all. Maybe next time I would push the service and really ask for some fire. \n\nI can see why iThai gets some love - it's a good meal for a fair price. And in San Francisco, the land of a million cuisines, iThai fits in just fine.", "author": "Nicole W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-02", "description": "Very convienent. Scoutmob saves the day again. The service was fast and friendly. We ordered the fried rice and the pad thai. Both were delicious.", "author": "David M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-04-21", "description": "I just got delivery from this place, and while they were pretty speedy at 12:30am, the food lacked quality in every respect.  \n\nI got a pumpkin curry dish - it was runny, full of mostly green peppers, and the pumpkin was green, not ripe, and undercooked.  \n\nThe woon sen noodle salad dish had only 2 shrimps, 2 rings of squid, and a bunch of noodles that were obviously cooked separately from the rest of the dish because they were congealed and could not be mixed in with any of the other vegetables to save my life.  \n\nAnd finally the noodle sea food dish I got (iThai Seafood Noodles) was also lacking immensely in seafood - I had 3 clam shells: 2 of them were EMPTY.\n\nWhat a shame and a disappointment.  Won't be ordering delivery from this place again.  \n\nBummer.   I really do wish SF would get a late night thai place that was decent.", "author": "Gregory S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-02-12", "description": "My friends and I were hesitant to go here, but we were sick of walking and Thai House Express was still a few blocks away, so we thought we would give it a go based on the good Yelp reviews.  \n\nBad. Idea.\n\nI was willing to forgive the folding IKEA chairs, the outlines of iPhones on the menus that there is no way is legal, the strange wooden celling lattice work where none of the cuts are clean, and the fact that I heard the same Goo Goo Dolls song three times while I was there.\n\nWhat I couldn't forgive is the Tofu Triangle appetizer that tasted like I was biting into my memory foam mattress.  Awful texture.  No flavor.  The sauce didn't help, and it didn't taste like any sort of Thai sauce I've ever had.  Too sweet.  No savory element too it.  Ick.  After everyone has a bite and groaned in disgust, we pushed that plate to the side. \n\nThe fresh spring rolls were SLIGHTLY better, and we finished those, but just barely.\n\nWe each ranked our meals between 2-3 stars.  My Pad Kee Mao with tofu was a 3, but VERY close to backing up over the 2.9 line.  No inspiration.  The tofu was meh.  The spices were a bit off.\n\nThe final straw?  $2 for a can of Diet Coke.  I hate places without soda on tap and free refills.\n\n2 stars because I didn't get food poisoning.  Not 3 stars because I would NEVER go here again.  I don't know who all of these people are giving the place 4 and 5 stars, but I'm guessing they are friends and family.  After this place has been Yelped for a few more months the ratings are going to tank.", "author": "Bliss F."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-05-14", "description": "Maybe it's because I'm from the Olympia/Seattle area, but every thai restaurant I've ever frequented always asked what spice level for my food. But this(iThai) and another thai joint never does so I forget while trying to communicate an order.\n\nThe Pad Thai was basic, I added chicken, but they substituted instead. The sprouts were fresh, but the food was room temp even though it took only 15 minutes to arrive, weird...  I wouldn't eat here again in the future.", "author": "Matthew B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-15", "description": "Yum yum! Great fun menu and interesting selections that aren't typical for a regular old Thai place. The Nuer Nam Tok was an awesome starter.", "author": "Odnit D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-01", "description": "Above Average Thai Food in SF. Awesome Thai Live band for Friday night!! And Saturday Karaoke is good too.", "author": "Voravej S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-02-16", "description": "3.5 stars\n\nWe liked the cleanliness and the service.  There was no wait on a Wednesday night. Using the check-in on yelp, we each got a free thai ice tea.  \n\nPortion size was just right.  Food was good, but I can't say it was a lot better than other Thai restaurants.  Perhaps I was too picky since I just got back from an extended trip from Asia.  \n\nStreet parking, which was expected in the neighborhood.", "author": "Ka P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-10-17", "description": "Since my review 4 months ago, I've noticed that the quality has dropped in greater frequency.\n\nI used to get the brown rice which was great, but after a few orders, I started noticing that it consistently had problems (in 3 separate orders in about a 2-week period).  It was crunchy, hard, crusted (from bottom of the cooker), or not cooked enough.... so I started getting white rice instead.\n\nWhen I got the Yum Kor Moo Yang (pork shoulder) salad 4 months ago, it was amazing.  However, in the past 3 orders recently, I noticed that it tasted 'different' .... more fatty and the meat was tougher and harder to chew... not quite sure what's wrong with it.\n\nRecently, I got the Gui Chai (Chive dumplings) and 3 of the 4 dumplings'' skin were burned to the point where it was 65% black.  The 4th piece was better but over-fried.\n\nI like their food, especially the Kaprow Gai (Spicy Basil), but I'm concerned that food quality is getting lower.", "author": "Max M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-11", "description": "If you are looking for an aythentic Thai cuisine restaurant you should check out this restaurant. I went there last week and I ordered \"Suer Rong Hai\" which is  a terrific mouth-watering roast beef that comes with Thai style sauce. It  was very appetizing. Also Thai ice tea had a superb taste.\n\n       The menu is varied and the price is acceptable. They also have free wi-fi and the waitresses are so cute.", "author": "Senol S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-06-05", "description": "Overall experience was okay. I ordered their pad see ew and it was pretty average. I feel that for thai food in SF, you can probably find a better spot to go to.", "author": "Tiffany S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-12-06", "description": "Worst service, waitress had a attitude we order 8 different type of food and she didn't write down and when we get our food was wrong, after we got our food she brought it one by one they didn't even bother check on us if we need anything or refill our water she only came back when she gave the checks to pay....worst service  & really bad place to eat never coming here after we spent over $100 dollars", "author": "Mary V."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-06-21", "description": "My first thought: a Thai restaurant with a tacky Apple-esque name?\n\nMy second thought: ugh, a printed menu that looks like an iPad drawn in MS Word?\n\nMy final thought: how often is too often to eat here? The flavors were delicious. The papaya salad was spicy but not to the point of tears, the soups weren't oily, and our noodles were well done.\n\nJust remember that everyone working there is probably first-generation. Service is not going to be what you would get at a 4-star restaurant (did you think so because of the 3-foot high backlit sign on the front with the name printed on it?) so don't be afraid to flag down a server and ask for what you want... otherwise you'll sit there frustrated.", "author": "Isaac S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-26", "description": "Last night was the first time I ate at ithai. Heard it was new that just opened just a few months ago. So me and a few friends decided to check it out.\n\nThe food was delicious, my friends and I were all very satisfied. And must I add there were about 6 of us and not one said anything bad about our food. Although we did inhale it all pretty quick.\nAnd the waiter, OMG super nice.!! He was very sweet, making sure everything was ok and if we need anything.. very attentive without be so annoying nor disappearing  which was PERFECT.!!\n\n The restaurant was very clean, nice and trendy esp. with the changing color lights. AWESOME, good job ithai.!! and i cant forget the bathroom faucet, very NICE.!!\n\nAlso I noticed there was a stage in very back, it wasn't being used last night but i thought that was pretty COOL  to see .. wonder what or who they will have to play/sing =)\n\nI highly recommend ithai .. A++", "author": "Ellen N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-21", "description": "Went in today out of a deal on Scoubmob. Well I gotta say ... Not half bad!\n\nI love Thai food and I have my Thai food fix on a regular basis. Most of the Thai places around my area are decent, but the food tastes very similar to each other - not in a bad way, just expected. This one surprised me!\n\nI didn't care about the gimmicky apple theme too much but based on the food I ordered, I can definitely see myself coming back for more. I had the praam peanut cause with short rib - the best I've had ... hands down! I've had that dish many times but it's always done either a little more rich or too sweet, but the place got it just right - at least to my own standards. I also sampled my friend's curry chicken - also very well done. The food is on the light side and comparing to most other Thai places, it's almost a little watered down but that's why I find this place refreshing.\n\nIf you like your Thai food with the \"kick\", some of you might find this place a little too bland. To each of their own preference, I like it a little lighter cause it's different.", "author": "Eric L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-05", "description": "Great place to eat Thai food.they have a lot for you to order. Their food is outstanding.Great place to get a quick bite to eat.", "author": "Richard R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-08-09", "description": "Open late nights, that's the best part. It's also conveniently located in the middle of the city.  Ambience is great and also the service. Food is very average, after all, you cannot ask more at mid-night ;)", "author": "Ram A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-02-07", "description": "Prices could be lower for what you get, but overall food was pretty good and hit the spot, and the delivery was pretty fast. Would consider ordering delivery from here again.", "author": "Jennifer M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-07", "description": "The Pra Ram was fantastic.  It was so good I may have dreamt about it afterwards.  That's the only thing I've tried here though...", "author": "sean s."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-06-06", "description": "After walking by a few times, I decided to give it a try.  It looks interesting from the outside, like the name \"iThai\" suggests an Apple product, I suppose it kind of does, but more - Apple meets Will Wonka.\n\nThe service is fine, the food was good (interesting combinations) and came out quite quickly.  \n\nThe lighting was a bit much and needed to be toned down a bit.  I do agree with an earlier post about the uncomfortable plastic chairs.\n\nOne thing, I am curious to see is if others had a similar issue as I did.  I compared my credit card receipt with my statement (I always do) and I noticed that they added an extra dollar on to the tip/total.  I assume this was an innocent mistake and would never complain; however, has anyone else had the same problem?", "author": "Derwood A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-05-06", "description": "Lunch specials are served everyday from 11am - 3pm for $9.95.  This includes Soup of the day, an appetizer of your choice (egg rolls, fresh rolls, chicken satay or fish cake), entree (various entrees over rice).  I had the chicken satay and basil chicken over rice. The soup of the day was a vegetable soup with broccoli, napa cabbage and carrots in a clear broth.  This was flavorful and delicious. The chicken satay was a little dry and the sauce was different than the usual peanut sauce (overall, it was okay, I would get something else next time), the basil chicken over rice was good.  I ordered medium spicy and it was pretty spicy.  Portions are on the small side, it would be enough for a gal but might not be enough for a guy.  \n\nService was a little slow but it was fine since we weren't in a hurry.  \n\n3.5stars, I would come back if I was in the area and wanted thai food", "author": "Veronica N."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-12-01", "description": "Delivery sucks here and they ask for cash tip even when you pay with your credit card. The food is mediocre at best.", "author": "Monique L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-17", "description": "Good stuff, Deliverying keeps me from starving to death in a Saturday night", "author": "Joseph L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-01", "description": "Delicious! Had the Garlic Noodles and a Crab Curry dish and was pleasantly surprised. Didn't have high expectations because I had yet to find a Thai Restaurant I liked. Ordered through Grubhub, food came quickly, delivery guy was friendly and food had so much flavor. Have never been to the restaurant but I highly recommend for delivery.", "author": "Leslie G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-13", "description": "This place is pretty awesomely themed. They are going for the look of an Apple store...white everything, cool lights on the walls, etc.\n\nI had the appetizer sampler and would definitely recommend it if this is your first time eating here as you get to sample almost all the appetizers. The egg rolls were freaking amazing and the peanut sauce was one of the best I've tasted.\n\nI got the fried chicken over fried rice entree and it was cooked to perfection. A definite must try if you're in the Union Square area.", "author": "J S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-17", "description": "My bf and I were walking around trying to decide what to eat on a busy Saturday night in Union Square...nothing sounded good and our moral was running low after countless attempts of finding restaurants packed to the seams. We saw iThai with just a few couples  cheery in conversation and thought \"shoot,why not?\". We've never had Thai food but how bad could it be (coming from two foodies).\n\nWalked in the door and was immediately greeted by what looked like a mother and daughter team. They were all smiles and quickly took us to a table in the corner. We asked what was popular or what to order and she brought out some pork wontons and  chicken satay with peanut sauce. Omg,probably one of the best wontons I've ever had. It was so crunchy and flakey,meat perfectly cooked, but the sweet/spicy sauce was amazing! (Couldn't help but sop it all up with our leftover rice) The chicken skewers were also perfectly cooked and had (another) tasty sauce,along with some charred bread. For a main course my bf ordered a beef plate which came with rice and veggies, while I ordered the silver noodle soup. Broth was perfect. Everything was so flavorful and looked appealing. We shared some soju which was interesting,in a good way? I'd never had it before,but tasted like a warm beer/wine. Tasty. Lastly we ordered her recommended dessert. Honestly I can't remember what it was called but my goodness, I could have eaten it for my whole meal! It was like a thin dough that was fried with condensed milk and a little sugar. Make sure to order it!! \n\nThey let us sit and talk for over an hour and never rushed us. They were so friendly and helpful that I will DEFINITELY come back if I'm in the area. Oh,and did I mention the dishes are all about $10 or less?! How awesome is that!", "author": "Danielle K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-12-10", "description": "TERRIBLE. I asked for a soda and 20 minutes went by and I still hadn't received my drink. I had to get up and remind the girl that I had even ordered a drink and she just laughed and then gave it to me half filled up.. Then my chicken that I ordered was burnt and literally pitch black. Fuck this place.", "author": "Lea S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-02", "description": "I was drawn to this restaurant because of their cool design/layout and it's pretty clean.\nWhen my husband and I checked-in we had free thai iced tea. Then we ordered fried rice, noodles, and a side dish (i forgot what it's called but it has eggplant in it). Taste-wise, all three dishes were good, I just wish they have bigger serving size though. \nAll in all, definitely, we'll be coming back. :)", "author": "Ella B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-15", "description": "Great atmosphere with nice low ambient lighting. Food was good....nothing special but enjoyable. I'd come back.", "author": "Justin C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-02-01", "description": "This review is for a delivery.\n1. Took an hour and forty minutes.\n2. Food was cold.\n3. Driver was rude.\n4. Egg shells in the Pad-see-ew.\n\nOverall it was over priced and not worth the wait for average food.", "author": "Drew L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-12-13", "description": "I think they dumb down the spicy for wimpy Americans, muahaha.", "author": "Katrina N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-24", "description": "I am not really sure how to describe iThai.... the food is GREAT the atmosphere is... weird? I believe they have gotten some new furniture lately, but the inside of the restaurant looks like they went to ikea and tried to make it look like an apple store, it doesnt really work. \n\nHowever, I highly recommend getting carry out or delivery! The food is delicious, probably my favorite Thai food I have had in the city. My favorites are the Pad Kee Mao Nuer and Masaman Nuer Curry. I am not usually one to get meet with thai, I just prefer tofu, but who wouldn't want short ribs in their curry?! Just be warned... its spicy! \n\nRe-cap... GREAT food, weird atmosphere... get the food to go.", "author": "Jess K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-25", "description": "This review is for the Pu Nim Pad Pong Kari (Soft Shell Crab curry) -- it was absolutely delicious. The green papaya salad was standard. Kanom Pak Kad was a little underwhelming but exactly as described, and the Kao Ka Mu was very good (and somewhat reminiscent of Taiwanese pork dishes). The delivery came in about 45 minutes.", "author": "Jenny L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-18", "description": "Delicious.  I had pad Thai, panang and tom kha Kai.  I order delivery from all over SF all the time and this was delicious and open late!", "author": "Shannon J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-09-23", "description": "Not everyone is a legitimate food critic and whos to say the negative criticism viewed on this restaurant is a product of some malicious mind. But let me tell you, I am one tough person to please when it comes to food. Ithai has provided my friends and I delicious dishes and the best quality service consistently! We used them to cater our party last weekend and was a huge success! Everyone raved about the food! I highly recommend this place to anyone! The way I see it is....if the people writing very damaging food reviews are certified food critics or can at least cook a better meal than these folks can, ill believe them. If not, they should eat at home! Go ahead readers give it a try and tell them Ricci sent you! You wont regret it! Bon Appetit!", "author": "Ricci S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-02-20", "description": "We wanted some Thai food within walking distance of Union Square and found this place on Yelp so decided to give it a try.  I ordered the Kao Pad Kark Moo and it was pretty good, serving size was big enough to share.  My sister got the Thai Sukiyaki and it was too spicy!  The server never asked her what spice level she wanted.  Funnily they asked us how spicy we want the Tom Kha to be, told them mild and there was no spice at all.  Even if it weren't too spicy, I wouldn't recommend getting that noodle dish.  \n\nNow on to the service...definitely bad!  The servers were friendly enough but there were only 2 of them running around trying to help everyone.  We waited almost 10 minutes before the server came back to take our order.  We had to ask for cups when our soup came.  I also had to go up to the counter to ask and pay for our bill.  We went on a Sunday night around 8pm.  Maybe the place isn't normally this busy on a Sunday but we certainly caught it at a bad time.", "author": "Annalee L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-29", "description": "because of the somewhat tacky theme, I had low expectations of this place but I've been searching for thai food that actually tasted like it's from thailand and boy they sure did hit the spot when it came to spiciness. I had the seafood garlic noodles and the pumpkin curry and it was really good, much better then i expected. I'm looking forward to trying their tom yum. =)", "author": "Tiff W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-07-13", "description": "Ordered chicken pad thai to take away but unfortunately got food poisoning the day after. A warning sign should have been the fact they said it would be ready in 15 minutes but came out after 3-4 minutes. Tasted great at the time then the day after was followed by instant regret!!", "author": "Greg R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-04-07", "description": "Ok, so the food is average to good Thai food.  Nothing to complain about per se...We went there on a Saturday afternoon so it wasn't too busy and the service was solid.\n\nMy main issue comes from the Groupon.  I paid $25 for $50 worth of food, which is what is states. However, the girl working there told us that it is really 1 app, 2 drinks, 2 entree and dessert...but that only added up about $42 worth of food and we figured we could have ordered another drink or appetizer...but nope...so that was disappointing, that wasn't in the fine print....so...ehhh.", "author": "Eric S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-02-19", "description": "I did take out at iThai because I wanted to try something else besides Lers Ros and Thai House Express.  The take out food ordered was a bit slow compared to the other places. It took about 20 mins to get my order of 3 dishes. The servers were very friendly and offered to give me a free thai ice tea (even though it was only for dine in). The food though was pretty good. The pad thai had mini dried shrimps which added a twist to the flavor.  We also had the chicken soup noodle also was solid, and duck larb which had generous bites of tender duck mixed with the spices and lettuce.  Prices are better than Lers Ros which to me has gotten overpriced because of their popularity. Overall, good place that I would try again.", "author": "James W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-17", "description": "I came here twice this month.  Both times, the food was really tasty.  The flavors are intense,  reminds me of the street stand in Bangkok.  I tried the ithai spicy noodles, spicy clams and tom yum noodle soup.  The spicy noodle was reaaaaallllly spicy...however, I love spicy dishes so this was up my alley.  Spicy clam dish was excellent, spicy level was mild and was generous in portion.  Tom Yum noodle soup was okay but not great.  It had a bit of coconut milk in the broth so it is a little different.  I prefer the traditional style.  The price range is reasonable for the area.  Overall my experience was good will definitely come back, plus they also do free delivery with minimum of $20, so this is a plus.", "author": "Eva E."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-07-01", "description": "The food was decent. Prices are a bit high for what you get. I can't comment on the service since I ordered take-out, but the place seems nice. Also, they're open late, which is great.", "author": "Ehtesham K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-27", "description": "I've only ordered delivery, but man, this food was fantastic. The food always is packed with flavor and the pad thai is reeediculous. I ordered the fried calamari and they packaged it with an opening in the container so that the steam didn't turn it into a bunch of soggy tentacle slices. Place is great.", "author": "Craig F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-09", "description": "I like this Thai restaurant they have night club and band at night! I would go there again and I will bring all of my friends there!", "author": "Xiyu W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-21", "description": "I got chicken curry as take out and it was great!  I decided to give this place a try because of its fresh look, and I was happy with my choice.", "author": "Maria T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-05-20", "description": "I ordered in from Seamless as I had to work over lunch.. Their Pad Thai was bland and barely edible.. Don't even get me started about their papaya salad. I know it said spicy, but lay off, will ya?! it was so spicy that what's supposed to be green papaya and it was dyed dark pink/red from all the spice. I like spice, but they botched the salad way bad. I had one fork full and threw the rest out. needless to say, I will not be ordering from this place anymore..", "author": "Michelle V."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-05-19", "description": "The restaurant was very casual and somewhat modern looking. The service was good and the food was not too bad. Ordered the seafood noodles ( had clams, shrimp, and calamari) and duck curry. The noodles were well seasoned, a little spicy for me. But who's kidding I suck at eating spicy food. As for the curry, for me, it was a little bit towards the sour side. I think there were too many pineapples. Otherwise, the duck was yummy!", "author": "Nhung T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-05-23", "description": "the concept of the funny is funny and quite nice.\nthe service is not perfect, though. the waitress forgot I had ordered a sparkling water and I had to ask her three times, although there was not a lot of customers in the restaurant so she was not that busy.\nI had pad thai, I liked that it was a really big plate, I couldn't finish it and i had to take a box for my left-over. but the dish was lacking some tastes.\nit's not too pricy, which is nice.", "author": "Andrea C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-12-20", "description": "Delicious! Excellent service, not crowded, and not expensive. Nice low-key atmosphere too if you aren't looking for a fancy night out. The only reason this gets four stars instead of five is because parking around there can be brutal.", "author": "Andrew M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-10-06", "description": "Pretty decent food. Veggies were definitely fresh which is a big plus, but my noodles seemed slightly undercooked. Having said that, i would eat here again.", "author": "Channing J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-30", "description": "I've only ordered for delivery. This restaurant caught my attention due to their menu, they have much more different dishes then the other restaurants.  The 15 times that I've ordered here all of the dishes are good or very good. When requesting spicy or very spicy it actually is.  Most of the time I have to call over the phone to get the Thai spicy since I speak Thai but this place it's not necessary.", "author": "Jossy S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-01-29", "description": "So, i bought a groupon for a dinner for 2 (1 appetizer,soup or salad+2 entrees+2 drinks), i was excited because i've been wanting to go for a while but idk lol \nso, i go there with my boyfriend on Sunday 1/27 at around 7pm, get seated on these super uncomfortable white IKEA folded chairs (seriously?!). The young waitress is super nice (college student i think), i show her the groupon, we order drinks and wait. We ordered 1 Thai iced tea, 1 regular iced tea, fried calamari as an appetizer ( freshly deep fried, delish) my entree choice was a spicy seafood noodle thingy , my boyfriends was seafood Thai fried rice( soooo good). My food was super spicy :( and here comes the decorative clams, they were sour but i didn't really care at the time, i love clams. Went home, slept, 3 to 4 hours later, wake up in sweats, my tummy in pain, DIARRHEA NIGHTMARE !!! So, yeah those effing clams. I won't be going back to iThai.", "author": "Meriem B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-05-09", "description": "I'm very picky when it comes to Thai food.  I thought my husband and I would try this place, since we had a Groupon.  We had the Thai rice soup and Thai salad.  We were pleasantly surprised because they gave pretty hefty portions.  He ordered the cashew nut and I ordered the fried chicken with garlic rice.  Everything was delicious and I think we may have found our favorite restaurant for Thai food.  I will definitely come back here.  We had so much leftovers and so happy I don't have to cook for hubby tomorrow night.", "author": "Terry S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-28", "description": "Stopped here for lunch. Service was friendly and fast. I ordered pad Thai with chicken instead of the shrimp. Very flavorful. Yum!!!", "author": "S C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-12-30", "description": "Dinner last night was A-Ok, walking distance from the craziness of union square and the theater district. We'd been standing outside of Curran trying to win lottery tickets to The Book of Mormon and in defeat we were looking for good/reasonable grub on our way home. Found this place on Scoutmob and got an ok deal ($36 for two--2 apps, 2 entrees, 2 teas). Unfortunately after standing outside an hour this place wasn't very cozy and we continued to freeze throughout the meal--concrete floors, ikea tables/folding chairs, metal + red lights on the walls--although they did keep our hot Thai teas full. It was quiet for a Saturday night and a good option for groups (there was a table of 8 when we came in) as the surrounding Thai joints were packed.\n\nTried curry puffs (like fried potstickers, very savory), Roti (delicious curry dipping sauce), Jessy's Noodles (healthier option as they're steamed not fried, but delish!), and the spicy basil (also very savory and delish). Probably won't be back without another \"deal\" but the food did hit the spot after a long evening. Maybe take-out.", "author": "Darya P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-22", "description": "iThai is gimmicky... but the food is great! They have things on their menu that other Thai places do not offer which definitely sets them apart from the other 5 Thai restaurants on the street.", "author": "Frances L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-03-14", "description": "I was really hungry & my mouth was watering over the idea if a Pad Thai, I stopped in here for take out & the service was awful, grumpy young man & bad food! 3 prawns in my dish & far to sweet!! Tasted of sloppy noodles and sweet jam, this city has so many amazing places to eat that I shan't be going back.", "author": "Verity R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-07", "description": "How amazing here was too crowd last night i've never seen before!! I supposed to dine in here but changed mind to take out after seeing those people.. lol :) I waited my egg rolls, kang karee and creamy crab curry about more than half an hour. Is that too long? I don't think so!! Because their food were always delicious and girls on front very nice. Thanks and I really appreciated. :))", "author": "Kat S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-02-12", "description": "You know it's a bad sign when after only one appetizer your entire table is debating how bad the Yelp review will be. There are so many great Thai places in San Francisco (Basil Canteen! Thai House Express!), but this is not one of them. And note to owner: please play something else besides the same Goo Goo Dolls song on repeat.", "author": "Amy Z."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-06-12", "description": "I don't know where to start. All we wanted was some Thai food. Some awesome, fried, tasty Thai food. We ordered through Grubhub on a Tuesday at 10:30... And waited. And waited. And called Grubhub twice to check the status of the delivery. Mind you, I'm pretty patient with people in the service industry. (Even when I've barely eaten that day, as is the case.) Two hours after we placed our order, it finally showed up. As I'm typing this I'm picking my way through soggy luke-warm appetizers. My fried tofu is actually cold. My belly is sad. It's worth mentioning that iThai is less than a mile from where we had our food delivered. I'd comment on the quality of the food, but I don't know what it was supposed to taste like before everything went room-temp and gross. It's not the worst food in the world, and I'm eating it because I'm hungry as hell, but I'm not ever ordering from here again.", "author": "Heather T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-26", "description": "Accidental find.  Delicious.  Great service for a late Sunday night meal.  Highly recommend curry puffs, kaprow gai, and garlic ginger rice.  If you like spice this is the spot for you.", "author": "Stacey E."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-02-21", "description": "It was good, I'd go back, but it probably wouldn't be my first choice. The one irritating thing: That door never stays closed on its own. It gets cold, and thus your food gets cold. :-/", "author": "Angelic S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-07", "description": "There are many Thai restaurants in the Tenderloin/Downtown/No Hill area, but I came upon this new trendy Thai place on Yelp in hopes that I can entertain my good friends and have a good time for dinner; thankfully we were not disappointed. We ordered 5 dishes for five people. We ordered: Crab Fried Rice, Pad See Ew noodles, Pumpkin Curry with tofu, Pad Thai, and a fried rice dish that had bits of dried fried pork in it. Every dish was very good and the proportions were good for sharing with the exception of the Pad See Ew being a bit smaller than others. But other than that, we had good service and our host/server (who I believe is also the owner) came by to check us, refill our water, and give us recommendations. The food is yummy, the decor is clean, restroom is like a mini disco and clean, reasonably priced (around $8-12 for entree) I'd def come back again to eat and enjoy a good meal.\n\nP/S-I forgot about the dessert, their roti and coconut ice cream is deliciious, definitely worth a try!", "author": "Annie T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-02-04", "description": "Hard to give it five stars as I have only been there twice, but good prices and great quality have a spot in my heart. \n\nCan't remember the name of the dish, but they have a curry dish with rib meat and potatoes that is amazing. Green curry fried rice is a HUGE portion that is equally as tasty as it is big. The unfried veggie rolls were fresh and tasty. The classic eggplant + choose your meat was REALLY tasty, not undercooked or over sauced. \n\nDecor is clean but somewhat sterile. Service is fantastic and the guy who runs it (maybe not owner, but always there with his ipad) is very friendly and helpful.", "author": "Nick B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-02-03", "description": "This place is surprisingly good. I was worried to see _another_ Thai place open up in a neighborhood packed with Thai places, but it manages to stand out in style and substance. Prices aren't bad either. I've mostly ordered off the I'm Adventurous menu, my favorite being the Kao Klook Gapi. And by favorite I mean my favorite dish of any kind in a several-block radius. It's really killer. \n\nTry this place and avoid the overpriced tourist traps down the street. Five stars for being the best in the neighborhood.", "author": "Phil D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-29", "description": "I had dinner here tonight and was quite impressed. The food is very good.  I had the creamy crab curry, my husband had the pad kee mao with pork, and we shared the roti appetizer. All were very good. Since we live so close, and had a good first experience, we will definitely be back to try more. The 'top 40' music could be better; it didn't seem to fit with the image they are going for. They could also work some on the timing of their food, since one entree came only minutes after the appetizer, and my husband had to wait a bit for his entree.", "author": "Rise G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-04-08", "description": "I got delivery here on Saturday at noon, because Lers Ros begins delivery at 5.\nOrdered the pad thai, chicken larb, and som tum.\nThe larb was the best thing, and it was just okay.  It was spicy and salty, but I honeslty don't think there was any mint in the thing, and mint is what makes larb so good.\nThe som tum wasn't really that fresh, I like mine with a crunch and it was just kind over seasoned and wet.\nThe pad thai just wasn't that flavorful.  It didn't seem sauced enough.\n\nOverall dissapointing, nothing seemed that fresh.  I can't imagine ordering from there again.", "author": "YJ P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-08-22", "description": "Tofu soup too salty and spicy, can only taste salt. Waiter was rude.", "author": "Serge U."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-06-22", "description": "nice spot to grab a late night bite.  \n\nprices are reasonably priced and the employees are very friendly.\n\nwanted a quick bite to help me sober up so i ordered the fried calamari and the chicken satay skewers to go.  \n\nchicken was very tender and flavored well.  calamari wasnt heavy although it was deep fried...the sauce they gave for dipping was solid as well.\n\nneed to come by here when im not completely destroyed.", "author": "Kyu L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-12-23", "description": "It's just opened today. Their food taste great and it's not expensive at all.", "author": "Arsid K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-09-27", "description": "the \"i\" theme is a little tacky.  The service was decent.  Enjoyed the go-to pad thai, but wouldn't go for the fried chicken/fried rice or the fresh rolls again.", "author": "Bobby R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-10-04", "description": "Worst delivery service ever. I can wait an hour, but two and a half? And they really do not care how many times you call them. Never ordering from them again. Besides there are far better thai places in the area.", "author": "Emily M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-02", "description": "Very nice little place, we just got in late one night and needed a quick take out and ithai looked great, the service was nice and fast too. Delicious meals, massive menu to choose from and some of the best Thai I have had.", "author": "Erika M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-07-13", "description": "Tried the lychee mimosa.... Wouldn't order it again... But the larb was good n curry puffs decent.... Should have tried to Pad See Eww to really be sure if I liked this place.", "author": "Wing W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-06-26", "description": "The Tom Ka Gai was good and the portion huge, however the beef salad I had was way too salty. Service was friendly, the deco is indeed arguable.", "author": "Benjamin S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-03", "description": "iLike!  (sorry, I couldn't iHelp myself)\n\nSo, my book club came here on a Wednesday night because we had just read Steve Jobs' biography and wanted an Apple-themed restaurant choice.  Wouldn't you know that there's a Thai restaurant in the Tenderloin that looks like an Apple store-- amazing!\n\nI called the day before to have them set up a table for us (we were 10), but they forgot-- wasn't a problem, they just put one together when we started to arrive.  The place never got crowded, they seem to do a bit of take out business.\n\nService was really nice and friendly; our server, outfitted with an iPad, was eager to show us pictures of any and all dishes we were interested in.  It was kinda funny and also helpful.  \n\nEverything we had was good!  Like, just as good as Osha or Thai House Express...probably like, half a degree down from Lers Ros, which is my gold standard for Thai).  I think my favorite dish was the pumpkin curry and the spicy eggplant (we had it with chicken, as recommended by our server).  \n\nPrices are standard, parking is a bitch and walking around by one's self is treacherous, but definitely a place to try if you're hungry and in the hood.", "author": "Kristin P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-09-25", "description": "Awesome food!!! At first sight !! Just randomly because close to my apartment and I finally had a chance to try it ..", "author": "Parn P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-03", "description": "Advertised as Bangkok street food it's very good Thai at a reasonable price. And the atmosphere is nice too. As others have said, minimalist but clean and decent sized so plenty of places to sit. Good service too.", "author": "Laura B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-11", "description": "Lunch combos are wonderful. Appetizer, soup, rice and a small entree for $10. Good food, and plenty of it. Prompt, friendly service. Extremely reasonable price. Not the quietest venue around, but very trendy and a good find.", "author": "Matthew M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-16", "description": "this place is fun. for what seems to be a rip off of some company we all know, they serve pretty good food. \n\nwe tried the Massaman curry (CNN something), American fried rice (fried with ketchup), catfish dish.. and from the yelp check-in, we got a free thai iced tea and they offered really yummy coonout ice cream on the house.\n\nThe curry was pretty good, it did not work with the fried rice for the obvious reason so we went on and got another bowl of jasmine rice. try the american fried rice.. that's definitely something new.\n\nthe waiter was pretty friendly and attentive. I am not sure if i could go back there since it's far from where i live but i'd love to tell my friends to try this place, just for the \"splendid\" experience! hahaha", "author": "Sung C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-12", "description": "I was pleasantly surprised with the quality of the food at iThai.  I'm a big fan of Pad Kee Mao, and thus far this is my second favorite place for noodles in the area.  Decent portions, and the service was fantastic.  I will be going back.", "author": "Chris G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-05-12", "description": "I love you, iThai but why do you keep messing up my order?! We've ordered from iThai 10 times now. The first 8 times went smoothly. I'm vegetarian and my husband isn't so our order isn't always the most straightforward but they always managed to get it right...until recently. We had friends over and ordered a big order from iThai and were raving to our friends about how great this place is. Our order showed up an hour and a half late and our guests were starving. We felt awful. We ordered from grubhub and they spoke to iThai and managed to get us our money back but we were still disappointed. Tonight my husband and I ordered again and they forgot the chicken in the curry (the only meat dish we had) and I feel bad because my husband didn't get any meat for dinner. Argh, iThai...I really want you to be my go to thai delivery spot but you need to stop messing up and be more reliable/consistent!", "author": "Neha R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-04-06", "description": "I go here often possibly too often, but how good you not great food, good staff, good prices. Most of all prompt service and Thai ice tea.", "author": "Roxy H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-17", "description": "Stumbled across this place with my friend when we were actually headed somewhere else for lunch but thought we'd give it a try. I think they had just opened. We were the only ones in there for a good 20 minutes but slowly people started to come in. Waiter was very nice. I loved the modern decor and the fact that Adele was in the music rotation. I ordered some crazy rice, chicken sausage plate and had a fried egg put on top. It was very very good. My friend had a big ole bowl of prawn soup and he loved it. The only complaint.... $3 for a small Cranberry juice???? I guess the fact that their food prices are pretty decent they make it up in juice prices.", "author": "lisa v."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-02-14", "description": "I have been with a friend to Ithai many times.  The food is good, the service from the waitresses is great, they always seem really happy. Being an international student I have so much work that I can't cook for myself and eat at Ithai. I can count on my hand that I have been to Ithai more than 3 times a week, with my friend, and also bringing other people as well. However, I will never be going back to Ithai again after how rude one guy who worked there (we think it's the manager). It started when my friend ordered food and I decided I wanted to eat at Ithai. He picked up his food and we sat down to eat. The guy who was serving us seemed to be in a very bad mood. We ignored it and sat down. I ordered food and we started to eat. The waiter/manager, was upset since my friend sat down with his take out food and not a plate, so he decided to put it in a plate which was ok, but they way he went about it seemed like he was upset. The whole time we were there the guy didn't ask us if the food was ok, if we needed anything, nothing until we were done eating. After we were done eating the check was about $8.70 and I used cash and gave $9 because of the bad service. We walked outside and the next thing you know we see the waiter/manager, coming up behind us holding the change from the check and saying \"No you need this, take it\", \"you need this more than me\". He then put the change in my pocket without me allowing him to. \n\nMy friend and I were so shocked we thought we were dreaming. The actual tip for him would have been 70 more cents, and he could have easily just said I need just a little more change please. I didn't give him a good tip since the service was poor. However the service was one of the worst, and no matter how good the food is and the service from everyone else (the girls), I will not be going back there again. It's not the customer's fault that your having a bad day. If he is the manager than he needs to treat people with more respect and with a better attitude. He was unprofessional, and didn't not act like a manager by coming out of his store to give us the change.  I recommend this place for the ok prices, and the good food. The guy just treated us very badly, and for us we will not be going back again.", "author": "Andreas D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-03-20", "description": "cute place! the inside decor was definitely different than all the other restaurants in union square/nob hill. the place was very modern; the waitress takes your order with a ipad and also shows you the dessert menu on it. definitely a good idea compared to the usual scribble-on-a-pad. their ithai combo appetizer lets you try their best appetizers on the menu. the fried calamari was good; you can actually taste the calamari instead of just of the breaded crumbs and oil like many restaurants' calamari.\n\nthe highlight of the night were the lychee mimosas. they weren't too fruity or strong; just the right mix. absolutely yummy. there are 3 thai restaurants on this block alone and i am glad to have tried out this place.", "author": "The Hangry Chef O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-13", "description": "Great food!  We went there twice while in San Fran because the food was so good. Definitely try the cashew nut chicken!", "author": "Tiffany H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-05", "description": "We had a groupon voucher $28 for 4, which included 4 drinks and 4 entrees. The decor is pretty minimal. They could add some color to the walls or something, but it wasn't terrible. We told the waitress we were in a rush and she said she would try to have the chef hurry with our plates. There was only 2 other people in the place eating at lunch on a Monday. We had the Tom Kai Gai- which was very flavorful and full of chicken and mushrooms. It was really good. Pad Thai was okay. Pad See-Ew was good and smoky, with big pieces of chicken. My daughter loved this and the pad thai. Everyone loved the Kang Karee Gai (yellow curry chicken). The yellow sauce was very smooth and flavorful. With this groupon we couldn't go wrong. 3 thai coffees and a soft drink included as well. The portions were good sized, filling and we had left overs. Our bill was $4 in tax, plus full tip.  Our meal would have been $45 plus tax and tip otherwise. We would go again with or without the Groupon. Good food doesn't always have to have the best decor.", "author": "Marisa M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-14", "description": "A Groupon got me in the door, but the food and service were amazing. Had the Pad Thai and it was excellent.", "author": "Edward I."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-23", "description": "Good size portions and inexpensive. Austere decor but we don't mind. Service was fine. Would recommend.", "author": "Carol A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-02-29", "description": "Decor is \"interesting\" but the food is pretty darn good. I ordered  the Pad Kee Maw which lived up to the spicy notation on the menu. Not blazing hot but spicier than other places that use the \"spicy\" notation on the menu but don't deliver.  Decent portion sizes; not huge but good for the price.", "author": "Joe P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-11", "description": "Pretty gimmicky but this place is pretty good and very reasonable prices.  We had the normal stuff chicken pad thai and beef salad and although the tables, chairs, etc all look a bit cheap the food definitely is quality you would get at Osha Thai and other more expensive places", "author": "Hector A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-02-19", "description": "WORST SERVICE EVER!!!!! So a few weeks back iThai opened up only a few doors down from where I live. With their flashy expensive lights I was drawn in, and my boyfriend and  decided to venture to have a nice casual quick dinner.... Nice... not so much, casual... yes, quick... HECK NO! We left the house at 8:40pm and (it takes 2 minutes to walk there) we got back home after 10! Upon arriving at iThai we were surprised by the number of people inside... of course the logical thought was, \"oh it must be good! It's packed on a Sunday night!\" WRONG! The place, we later discovered, was packed because  half the people were not being served correctly or were waiting for their food. \n\nSo, a two minute wait before getting seated.. No problem. \nWe sit down with our menus, and within 5 minutes both my boyfriend and I know what we want. He wants to order the Pad Thai, hot sake and the Satay appetizer. I want to order brown rice, yellow curry and a Thai iced coffee. The problem, where's our waitress? So we wait... and wait.... and wait... and after 20 minutes I'm fuming at the table. No one approached us, no one said  \" Hey i'm here to take your order!\" I finally had to holler down one of the girls and she comes by. So, I tell her we have been waiting 20 minutes and she writes down the order, repeats it twice and scurries off. Less than five minutes later they bussle out the Satay, the pad thai and my brown rice. Now I don't know about you, but it's kind of weird when one person gets their food before you... let alone with the appetizer! So we eat the appetizer, I stare at my brown rice, he stares at his pad thai because he doesn't want to eat without me and since I don't have my curry what am I supposed to do with the rice!???\n\nSo we wait..... and wait.... and guess what! We WAIT SOME MORE! Behind us I overhear a customer get up, go to the counter with his bill and say, \"Yeah, I'm not ok. You're charging me and I never got my food!\" and stormed out! This guy was sitting before we got seated so how long was he waiting!??\n\nSo finally, I'm super upset. At this point I almost wanted to just walk out, but instead I hollered again and the second waitress stops by. I say, \" We don't have our drinks, I never got my curry, and my rice is cold!\" and she asks, \"Oh did I take your order??\" THERE'S  20 PEOPLE IN THE PLACE! ATLEAST LOOK AT A CUSTOMER! So she apologizes, runs off and brings our drinks. About another 10 minutes later, I get my curry and warm rice... The boyfriend ate his Pad Thai cold. I ate half, and I usually don't waste food, but we wanted out. Risking the \" Can I get a to-go box?\" question probably would have set us back another 45 minutes. So upon receiving the bill we didn't even allow the waitress to run off. It was a \"CHARGE IT AND LETS GO!\" move. So we get charged.... with a \"sorry we screwed up please come back and don't write a mean review on Yelp\" discount and walk out totally disappointed. \\\n\nPlease... If you go, dedicate 2 hours of your life at a minimum. \nAnd if you don't go.... good for you, because I know I won't be going back.", "author": "RP S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-19", "description": "I was so very surprised to find this clean and well run restaurant near ACT.  The crab curry and th Pad Thai were excellent as was the service.  They were friendly, and we will for sure be returning to this nice place.   The prices could have been a bit cheaper, but we enjoyed it all the same.", "author": "george i."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-10", "description": "lychee martinis, pad thai and papaya salad are yuummmy!!  this is my go-to thai restaurant in the tender nob hood.  it's not really fair for me to review thai restaurants as i grew up having authentic home cooked thai food.  i found some of the dishes here, such as the pad thai and papaya salad, to be quite authentic.   if you're in the tender nob area this is your best bet for thai food.", "author": "Mao K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-19", "description": "I've been meaning to review this place for a while since i've been here a few times already. The food here is great its pretty authentic (except for a few dishes) and I'm Thai so I would definitely know. The first time i was here they had me sit on these fold out chairs which i was so confused about. A definite minus on the ambiance. But i was just here yesterday and saw that they bought new wood chairs and decorated just a little more. There's not too much to say the waitresses were nice and served the food promptly. The only downside is the parking which can be kind of tricky. I circled around about 5 times before i found parking. Oh yeah i forgot. They do karaoke here on certain days i think. Which i actually find annoying, I like being able to actually talk to friends while having dinner. So yeah thats a downside too. Luckily there wasnt any when i went in. If you dont like loud karaoke definitely make sure to call and ask if they there is going to be any on the day you come in.", "author": "Sara S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-02-02", "description": "Very good food. For drinks I had the Thai Iced tea which was nice, I also had a glass of wine. This fried rice plate with meat that was very good. Waiters were very quick, glass was always topped off and very reasonably priced. Also, the sink in the bathroom is amazing, you just have to see it.", "author": "Ameer A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-04-20", "description": "Fun menu and efficient service but the food was really nothing to write home about--I've had better thai at many places in the city. The environment is also a bit strange. The cool minimalist aesthetic is fine but the place seems to need a little sprucing up and better attention to detail.", "author": "Geoffrey U."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-04-21", "description": "We had lunch here. Our waitress was very knowledgeable and friendly. She asked us what kind of food we like and then told us about the options. I had the green curry fried rice non spicy. It was very delicious.", "author": "Nicholas S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-21", "description": "I have not had a bad meal here. The curries are good, the noodles are amazing, and the portions are perfect. True, the decore is a little weird but the food is great and the prices are reasonable.", "author": "John W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-02-21", "description": "We ordered the Penang curry which sucked. Crab fried rice wasnt good either and tom yum noodle soup was soso. We asked the waiter if there were peanuts in any of them cus my friend's allergic, she said no. so we started eating, and my friend had an allergic reaction...we asked another waiter if there were any peanuts...the guy said Penang and the soup did lol. so they swapped the penang for red curry.  waitress fail. she could have killed someone! I need to go with someone thai to eat there. I obviosuly dont know what to order.", "author": "Cindy L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-03-27", "description": "good food, good portion sizes, mediocre service, strange/fun setting not exactly relaxing but karaoke should exist here, kind of pricey for thai but they deliver if you cant hang with the peppy dining room crowd", "author": "Alicia G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-03-14", "description": "i love ithai. we all do here at our salon. goody and pooh are the funniest, straight forward guys and the food is always spot on. the lunch special is the best deal in town. delish soup, an app, an entree and rice. super filling, super spicy, super tasty. love you guys. best dessert with coconut and mango ice creams and those sweet little dessert pancakes. yum. ok i officially just made myself hungry writing this review.", "author": "Holly D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-30", "description": "This place has great pad se ew and the service is amazing. Very friendly staff and cool atmosphere, especially for this part of the city.", "author": "Lauren P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-02-19", "description": "food was good and the prices reasonable\nthe staff was friendly\nthe time it took to deliver the meal was awful! we nearly walked uped", "author": "b k."}
