{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-30", "description": "One of the best Chinese restaurants in the city! Seriously! Everything we got was delicious!\n\n- Braised pork belly - Tasted the way it did when I was growing up. Note that this is similar to the Japanese kakuni style and not the crispy skin style. So amazing and flavorful! I loved the quail eggs, which was a unique addition (growing up we cooked this with regular chicken eggs). \n- Shanghai sauteed rice cakes with cabbage and pork - To die for!! I think this dish isn't written about much because it's not as well known in the US, but honestly, Jiangnan's serves one of, if not the best, rice cakes I've ever had! The rice cakes are sauteed perfectly and tossed with a delicious saucy Napa cabbage that's been cooked till it's absorbed just the perfect amount of the light gooey sauce flavor. And the little pieces of pork are perfectly seasoned and cooked. \n- Sweet and Sour Spare Ribs - so authentic, not your orange American sweet and sour sauce with breaded, fried meat! This is braised but with the slight tanginess that can only mean a splash of vinegar at the end of the cooking process. Yum yum YUM!! And of course, fall off the bone meat. \n- Bell peppers and potatoes - a good dish, and interesting and unique for sure, but I probably wouldn't get this again given all the other things I want to try.\n- Dry fried string beans - also good, but not great; next time I'd like to try another vegetable dish, like the napa cabbage!\n\nThe only downside is that we came at 6:30 pm on a weekend and had to wait about 35-40 minutes. I wish they'd use the Yelp waitlist so I could put my name on the list in advance! But other than that, everything was phenomenal. Food was great, service was quick (it's not American service, but it's good service for an authentic Chinese restaurant). \n\nI can't wait to come back and bring my very Chinese mother here. This is probably the highest compliment I can pay. \n\nMy new favorite Chinese restaurant in the city!!", "author": "Jaching H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-25", "description": "Came here for some food not sure what to expect. Got the braised pork belly, lions head meatball, the noodles, maggie shrimp, egg and chives.\n\nThe braised pork and lions head were my two favorite items. There is so much flavor in those two dishes. Loved eating rice with those two dishes.\n\nThe maggie shrimp had a very simple flavor and was also pretty good. The other dishes just tasted very homey and I thoroughly enjoyed them too.", "author": "Victor D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-31", "description": "This is the best authentic Chinese restaurant I have ever been to. It is a small little hole in the wall restaurant right near Ocean Beach, but the food is the best I've ever had. Every time I go I get Ma Po Tofu, Fried Green Beans, and Shredded Potatoes and Peppers. Man, I don't know what they put into those green beans but they are the best green beans I've ever had. \n\nThe staff are also super friendly. They close at 3 so they can prep for dinner, and I've been there past closing multiple times but the staff still treat us very friendly and have conversations with us. We've been there so many times and placed so many carry out orders that they now know our order by heart and recognize us, even our voice! DEFINITELY would recommend this place.", "author": "Julia H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-28", "description": "This was my first time trying wuxi style food (think shanghai dark sweet sauces) and I thought Jiangnan was great. Nothing is oversweet and the vinegar mix tastes remarkably clean and doesn't end up being as heavy feeling as you'd think. We split a lions head meatball (just get one, or you'll over-order), the spare ribs, the duck, and this stewed cabbage and chicken. Everything was quite good, with the spare ribs and cabbage remarkably being the highlights. The cabbage was really just mushy greens with a little chicken and I have no idea why it tasted so good. I can't imagine it was that hard to make and I'd like to learn how to do it.", "author": "Misha T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-27", "description": "We really love this place. Not your run of the mill place and features dishes unique to their regional specialty. The braised pork is one of their signature dishes and not to be missed.", "author": "Patrick M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-17", "description": "Jiangnan Cuisine is a small, local Chinese restaurant that serves authentic Chinese food! \nOne of their best dishes is the Delicious Braised Pork ($12.99)...the meat is super flavorful, yet fatty and delicious. I love the small quail eggs that come with it too. I also tried the Lion's Head meatball or Homemade Meat Ball in Sauce ($4.99 each), which is pretty good too. Both of these dishes are heavy soy sauce based so you probably want to order some rice to eat with it as it can get a little salty by itself. The Shredded Potato with Green Pepper ($7.99) was a nice, light dish to go with the other two. The flavor and texture of the potatoes were just right. Overall, their food is pretty good and authentic. \n\nThe service was not bad. We did have to remind our waitress a couple times for things we asked for, but it was okay as she was good about bringing them. The food portions are not large, which allows you to order more items. They are located in a busy area on Balboa St in the Outer Richmond District, so parking may be a little bit of a challenge. Jiangnan Cuisine is a great neighborhood restaurant serving legitimate, good tasting Chinese food.", "author": "Jean S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-28", "description": "Came on a Sunday for lunch and arrived at noon to get a table for 6 adults and 4 children with no problem. (Note: latecomers may have a short wait as it was full when we left with people hanging about the front door.)\n\nI'm always nervous about showing up with so many small kids because as everyone knows they are really messy. The staff there were more than welcoming. Even after 2 glasses of water were spilled. They even commented (in Chinese) about how cute the kids were and how good they were at drawing (I disagree - they were kid terrible). \n\nBut on to the food! It's great to go try out Chinese restaurants with lots of people so you can order a bunch of food. Even better with adventurous eaters - or at least eaters who let me do all the ordering :-). For Jiangnan food we ordered -\n\n * stewed duck soy sauce - yum yum! I love duck and this was no exception. Definitely order a side of rice to mop up the sauce which was savory and rich.\n\n * cauliflower pork belly - this was one of my favorite dishes, cauliflower chunks with small slices of pork belly just for flavoring, not heavy or fatty at all as the pork belly might suggest\n\n * salt pork veggie fried rice - was not like a crispy fried rice, more like softly steamed with a velvety texture and nice light pork flavor, very comforting and a huge it with the kids\n\n * yang chung noodle soup - very lightly flavored broth with noodles, hits the same spot as a matzo ball soup, may not be for everyone as it's very mild though the noodles were good\n\n * sweet and sour spare ribs - or at least I thought this was what I ordered but they weren't very sour at all, in any case they were still good.\n\nThe group also ordered pan fried dumplings which I didn't try, eggplant (which I liked but I almost always like eggplant), and rice cake.\n\nI would definitely bring my Chinese parents here.", "author": "Jean K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-18", "description": "If your looking for authentic Chinese food in SF, skip Chinatown and come here! This place is delicious, reasonably priced, and serves up authentic Shanghainese food.\n\nI came here with a friend and three dishes was enough to leave me stuffed with a bit of leftovers. We ordered the Vegetable Rice with Salted Meat. Each bite had just the right balance of light flavor from the rice and chopped up bok choy with a kick of saltiness from the meat.\n\nWe got the Delicious Braised Pork which was the star of the show! The fat from the pork belly was juicy and the meat was tender. The sauce was the perfect blend of savory and sweet. The quail eggs added to the dish as well.\n\nWe also ordered the Mapo Tofu with Meat. It had a little too much pepper for my taste and it wasn't the best Mapo Tofu I've ever had, but the tofu was still wonderfully soft and the sauce had a good level of spice.\n\nAwesome authentic Chinese food and I'm definitely coming back with my parents next time (they're Chinese so that's saying something)!", "author": "Michelle L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-08-17", "description": "Please reconsider driving there if there is a concert in the park.  I literally drove around for 1 hour and couldn't find parking.  The friend I was meeting found a parking spot, so I went home she got take out. \n\nI don't know what the fuss is all about.  We had won ton soup, duck, pork belly, green beans, fried rice & white rice.\n\nThe won ton wrappers were probably the best I've ever had.  The soup itself was a bit bland.  The green beans were great.  The pork belly was very good although way too fatty.  Which made it too rich.  The duck was OK.  The chicken fried rice was delicious and the white rice was good.\n\nI don't think I'll be going back.", "author": "Jan F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-10", "description": "Came after reading an article in the chronicle that featured this restaurant as one to try for Shanghainese food.\n\nStarted off our meal with a braised lion's head meatball to share. It's about a half pound pork meatball braised in brown sauce. I thought the meatball was remarkably tender, but I'll be honest, I much prefer lion's head to be stewed in a clear broth with napa cabbage. That being said, Jiangnan's version was still very good.\n\nNext, we ordered the large bowl of noodles. For $6, the value is off the chart for this dish. I love the white peppery chicken broth it's cooked in and it also comes with some baby bok choy which is a nice touch. It's meant to be a sort of substitute for rice and as such, you should be ordering additional entrees to accompany this bowl of noodles.\n\nTo accompany these noodles, we ordered a variety of entrees. My favorite was the shredded potatoes sauteed with green bell peppers and vinegar. A must try if you haven't before. My second favorite were the sweet and sour braised spare ribs. Unlike takeout Chinese food with its red sauce, these spare ribs are braised in a thick, sweet and savory brown sauce. They were also fall off the bone tender!\n\nBringing up the back, we also ordered the oxtail soup, the braised bass, and the preserved vegetable fried rice. All had it's own merits: I loved that the bass was a whole fish and not just filets and I also liked the addition of tofu knots and the fermented/spicy flavors of the oxtail soup, but both left a little to be desired in my opinion. I thought there weren't nearly enough oxtail pieces (only 3 in our order) and as for the fish, I didn't really see the soft tofu as added value to the dish. It almost made picking bones out even more difficult. The rice dish was too soft/wet for a fried rice in my opinion.\n\nAs for the space itself, it's pretty cramped. Definitely no elbow room - a table for 4 is sat at a table for 2 in any other restaurant, to give you an idea. So get cozy and enjoy!\n\nThat being said, this meal was definitely very good and very filling. All our choices also came to under $100 pre-tip.", "author": "Elaine Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-06", "description": "It is awesome seeing how many 4+ Yelp reviews there are in the Richmond District. It felt like going to Disneyland as a kid for your very first time and having a hard time contemplating whether you would like to go on Alice in Wonderland ride or Mad Tea Party. They are both too hard to choose from! When you go on both rides, however, you realize the former involves sitting in a car and riding from the beginning to the end. After reaching the end, you feel like you had an adventurous experience, but there is no use starting from the beginning to the end again; it definitely didn't make you a different person. The latter involves spinning until you finally come to an end and stop. Once the ride stop, you just want to go on this exhilarating experience all over again. This restaurant seemed more like the former.\n\nThis restaurant caught my attention because of the super high Yelp reviews. The Sauted Rice Cake with Chicken and Napa Cabbage ($11.99) was good, but it was not like \"Oh my! This is the best dish I have ever eaten in my life.\" \n\nMy dish tasted very light and I could barely taste oil. It did not feel like the soft cabbage pieces were totally drenched in sauce. On a plus side, this place uses napa cabbages which are one of the best cabbages in the world in my opinion! The chicken was ok. It didn't look like there were too many pieces.\n\nMy friend asked for a customized green onion noodle dish ($6 - I thought I was mad when I saw how cheap this dish was!). It did not meet his expectations in that it lacked flavor and there were not too many green onions in his dish. He also ordered Braised Pork with Quail Eggs ($12.99) and thought the meat was a little overcooked. \n\nThe service was great! The waitress welcomed us and said goodbye as we walked out the door. She didn't hesitate when we asked for extra take out containers.\n\nThis place was good, although it was a little expensive. This place isn't exactly my cup of tea but it made me curiouser and curiouser for trying other Shanghainese places.", "author": "Kristina M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-27", "description": "I was in town for a work conference and we were randomly paired up into lunch groups, I was very pleased that Yelp Queens Elite Jando S was heading up my group. Jando is well versed in many different cuisines... but particularly has extensive knowledge of Chinese food. So when I started pressing him weeks in advance about where we could go to get some authentic Chinese food. Since we were located in the financial district for work, he was not very optimistic. But when crunch time came, we made Jiangnan Cuisine our destination.\n\nAs we walked in, we were told that Yelp doesn't even have a category for what this food is. They have Shanghainese as a category. But that doesn't fully encompass the Jiangnan umbrella. I love knowing things like this when going into a restaurant. The inside was small, smelled amazing, and I had no idea about anything on the menu... just what I was looking for! We ordered for the entire table. And I started typing captions for my pictures in the beginning. But apparently the further into the food coma I slipped, the less I was motivated to do so.\n\nWe started with the shredded potatoes. I have had this before and it is very authentic, but very simple. These were some of the better I have had. Then the Lions head meatballs... the star of the show in my opinion. Absolutely incredible. I could have eaten these basketballs of meaty saucy goodness for the rest of the meal and been satisfied. I should have kept this sauce around until the rice showed up to soak it all up. The green beans were perfectly cooked and perfectly spicy. As for the tofu (not sure which one it was), I was pleasantly surprised. I don't like anything with huge chunks of tofu. But the sauce that drenched this dish could have gone on anything and been fantastic. The dumpling soup was also fantastic. I mainly had the dumplings because of slowing down. But those were enough to make this dish a five star. I was also slowing down because the pork belly showed up soon after. Did I already give the star of the show award away? Ehhh, short term memory. THIS was the star of the show. Everything was absolutely fantastic. But if I did this over, I would have gotten two orders of meatballs and two of the pork belly and not shared with anyone.\n\nThanks Jiangnan Cusine for a great meal, and Jando S for leading me there and guiding me through culinary bliss. The only complaint I had was lack of time for a nap after!!", "author": "Will B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-29", "description": "Jiangnan Cuisine serves authentic Shanghainese food at a super reasonable price! I love Shanghainese food so I've had this place bookmarked for the longest time. Since I'm not in the Richmond District too often, I finally made a point to come here when I was in the area. The food and service are great. I came on a Sunday for lunch and there wasn't a line. We were served quickly and the food came out quickly. The restaurant is on Balboa Ave so you are at the mercy of street parking, but we were able to find parking easily. \n\nMy boyfriend and I had the \n- Sautéed Rice Cake with Meat and Pickled Cabbage\n- Vegetable Rice with Salted Meat\n\nBoth dishes were super flavorful. The portions were adequate and everything was just so delicious. The rice cakes were deliciously chewy. The rice was not too salty from the meat. I wish I had the stomach to try more. I'm sad that it's also too far from my house or else I would be here more often. I'll sadly have to wait until the next time I'm in the Richmond District. \n\nI know there's so many good food options in the Richmond District but come here if you're craving some awesome Shanghainese (Chinese) food!", "author": "Kelly N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-10", "description": "I love that Jiangnan has the desserts and the appetizers together! Definitely get the fried bread. It comes fresh and warm with some condensed milk for dipping. You really can't go wrong with the entrees, but we chose the spicy braised beef noodles and the braised beef and potatoes and both were incredibly tasty and satisfying. I don't even like cilantro usually, but the cilantro garnish was delicious in these dishes. The service was good too, and we didn't wait too long for the food. I definitely recommend this place", "author": "Claire C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-09", "description": "Very delicious dinner, but the place is small and does not take reservations, we had to wait almost an hour even getting there at 5:30!", "author": "SJ L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-14", "description": "Very authentic Shanghainese food! We had a great time at there and enjoyed every dish we ordered!", "author": "Mengsu L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-09-15", "description": "7/29/17\n\nTypical San Francisco Chinese restaurant--popular and packed as hell, and all kinds of messed up.\n\nSo, there's a huge virtual line.  They got our name and promised to call when we were up.  So, we walked around the street checking out various shops, including a cool traditional Chinese medicine dispensary.  They told us the wait would be more than an hour, so we figured coming back in a 1/2hr would guarantee they wouldn't miss us.  And plus they had our cell #.\n\nWe stood outside their door for another 1/2hr, probably much longer.  Stood there like idiots until we realized everyone who came after us got in already.  So, finally, we asked what's up?... they claimed they came out and called our name and actually called our cell too.  What a f'ing LIE.  We stood there the whole time.  Not a single person came out in the entire last 1/2hr.  No one called our cell.  DO NOT LIE TO US.\n\nAnd of course, it doesn't end there... they forgot to bring me water despite my asking several times.  Also, out of the first 3 dishes we ordered, they didn't have 2 of them.  I HATE that.  So annoying to have your heart set on something and get denied... and 2/3rds of what we ordered?  Seriously?  Anyway... we eventually settled on...\n\n1. Stewed Duck in Soy Sauce (Half) Wuxi Style $19.95:  I would say this is their main specialty.  And honestly, it looked gorgeous.  I hate to say it, but it tasted pretty good too, though my gf notes the meat is a bit on the tough side.  Authentic Wuxi flavor though.  7/10\n\n2. Delicious Braised Pork $11.95:  Very similar flavor to the duck, and probably used the same sauce for both.  But again, that would be pretty authentic flavor-wise for the region.  The pork itself was tender and delicious.  Very nice.  7/10\n\n3. Shrimps with Maggie Sauce $16.95:  This my gf didn't appreciate too much.  She was perplexed with what \"Maggie Sauce\" was meant to be.  I explained to her that it's found on many American-Chinese menus and they use that Maggie soy sauce based seasoning, but she insists she has never seen such a name used to describe a dish in China.  She calls this dish \"home-cook made shrimp\" meaning something a casual mom would make.  At least the shrimp was perfectly done, juicy both in body and brains.  7/10\n\n4. Vegetable Rice with Salted Meat $9.95:  I think she found this most offensive and least authentic.  She said that this dish, as is indicated in Chinese, is traditionally cooked in a pot with the meat, like a paella.  What they gave us was just standard Cantonese fried rice with dried meat.  So, pretty much nothing like what it is supposed to be.  But I guess if you didn't know all that, it would taste alright.  3/10\n\nTimes like this really demonstrate how lame Yelp's single score system is.  Their service is beyond bad, clearly at most 1/5 stars.  But their food is actually pretty good.  I mean, if they weren't LIARS and so bad at manning our tables, I would have given 4/5, but I guess I'll still let them pass...\n\n3/5\n\n#sanfrancisco #chinese #wuxi", "author": "Dean C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-31", "description": "Welcome to this somewhat new \"hold in the wall\" Chinese restaurant in the other Richmond district.  It's tucked away amongst the many store fronts and hides a little northern Chinese cuisine that is quite good.  We only knew about it because a friend recommended it to us and we were in the area.  Now I'm not sure it's worth a long drive from outside of SF but if you happen to live in The City, it's probably worth your Uber / Lyft ride over.  If you come at usual dinner time, there will be a short wait.\n\nWe had a lot braised pork, eggplant (yuxiang qiezi), string beans.  It was all great.  I enjoyed the experience very much especially since the décor was nice.  Not your typical Chinese restaurant...for now that is still new.  I will say that the trip to the restroom is a completely different experience.  You have squeeze pass the dishwasher in front of the cooks' line to the back of the store... trust me, this part feels like weird \"I'm in a tiny Asian store (somewhere in Asia).\"  But not that it was dirty...just a TIGHT squeeze!!\n\nI will definitely come back to try some of their other dishes as we really liked the flavors.  You'll have to go and try yourself.  It's just too bad that the place is so small that you have to wait.  May be better at lunch time when they have a lunch special menu!", "author": "Cary L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-22", "description": "I've had my eye on Jiangnan Cuisine for a while. The Yelp reviews looked promising but the location is rather far from me. I could get to Millbrae in the same amount of time. This type of cuisine is sweeter and more oily than I'm usually used to. Be ready for a whole table of brown colored dishes.\n\nWe ordered: Lion's head meatball, Stewed duck wuxi style (half), homemade eggplant with meat, and napa cabbage. The meatball had a great texture and the price was right at $3.95. The eggplant was super tasty but also completely drenched in oil. We added the cabbage at the end because we felt that our meal was unbalanced and it was one of the few greenish veggie dishes on the menu.\n\nNow the stewed duck was the main course of the meal and it was ok. I love duck (Peking Duck anyone?) but this was a bit underwhelming.\n\n4 dishes would've been enough for ~3 people; I ate some of the leftovers for lunch the next day.\n\nTip - the only preorder items are salmon and crab. They explained that since they do not have a fish tank, they need to buy those items from the supermarket.", "author": "Yi Z."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-08-04", "description": "We had the braised pork (super fatty with creepy quail eggs), chow mein, string beans with meat, and more. The flavor was new (to me) but flat. I am glad I can now say I have had this style of Chinese food, but I wouldn't run back. On the flip side, this part of Balboa St in the Richmond is surprisingly cute and there is an adorable record store across the street.", "author": "Morris R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-03-31", "description": "We ordered the fatty pork, plain noodle soup, and the fish fried rice. The flavors were decent and had the promise of a delicious meal, but the balance was off. The pork was too fatty to feel good about finishing the whole dish, and the plain noodle soup needed more salt to really be complete. Rice was also too fatty, so we ended up eating only half our meal and moved on to our \"second\" dinner at a dumpling place instead. \n\nGreat to try, but I don't need to go back again.", "author": "Sheewon B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-08-06", "description": "This place is really small. The podium was at risk of being hit every time someone opened the door. No one there to even man the stand so why bother having it. There was no semblance of a line or anything when you go in. It really irks me when establishments don't have an orderly process in place. A notepad was on the stand for you to scribble your name down. Just hang that notepad somewhere and get rid of the stand. \n\nThere was no one there to greet or acknowledge you while you're waiting. Very understaffed. I would have gone elsewhere if I weren't starving. Even the people who were seated seemed to have been waiting for ages. One group actually got up and left because the wait for the food was too long. When I finally got seated at the bar table, it was time to see how long the wait was to order and when the food will come out. \n\nThe waiter is actually quite nice making me feel bad about the above criticisms (but they still should be noted nevertheless). It gets pretty hot in this little space by the way. But then the bar table area also needs more lighting. It was kind of a farce seeing chairs being moved around from table to table for bigger groups. People didn't seem to mind at least. It took ~15min for both dishes to come. So now finally on to the food. \n\nEGGPLANTS \nI have this huge, undying love for eggplant and it originates from this dish (and a Sichuan variant). The eggplant is so tender and easy to chew. Beware this dish is served HOT. Don't attempt to stuff an entire piece in your mouth at first like I did. I burned my tongue and the roof of my mouth because I was so hasty. The sauce is spicy but not too spicy. From what I saw, it has ginger, garlic, black bean paste, scallions, and dried hot chilies. There's a vegetarian option with no minced pork. The eggplant glistens which is typical because you have to throw a lot of oil at it to force the water out.  \n\nBRAISED PORK\nI love the fatty portion of the pork. It just melts in your mouth and your taste buds soak in all that rich flavor. This dish is substantially sweet if you're wary of sugar. The lean meat is much more rough. I dipped those parts in the sauce to make chewing easier and to pick up the flavors. The quail tea eggs were a nice surprise! They are very dainty and cute. Like the eggplant (although for a different reason), I would take small bites of the fatty parts because I haphazardly put a whole piece into my mouth and it did not go down comfortably. Too rich! The portion size is decent. Pricey at $13.   \n\nI had to wait for a prolonged period of time to get containers and to pay as well which was not new at this point. I noticed that they increased the price of the Braised Pork by a dollar since a month ago. If you are planning on coming here, I would do it soon before they decide to raise prices again. \n\nThe reason I was really excited about this place is they serve a lot of my favorites dishes that my mom makes at home. The food met my expectations but the overall experience could have been better. The operational kinks need to be smoothed out before I can bump up my rating of this place.", "author": "Lauren H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-03", "description": "When people ask me what my favorite Chinese restaurant in the city is, I say Jiangnan Cuisine. Despite the fact that this place only opened up recently, I've already been back here 3-4 times, sampling more and more of their menu each time!\n\nHonestly, you can't go wrong with any of the dishes here (they're all perfectly prepared), but if this is your first time here, and you're having trouble deciding what to order, I would recommend: \n\n- Either the Delicious Braised Pork or the Sweet and Sour Spare Rib (probably not both at the same time)\n- Mapo Tofu\n- Homemade Eggplant with Meat\n- Homemade Meat Ball\n- Small Rice Balls in Rice Soup (for dessert!)\n\nI already can't wait for my next visit here!", "author": "Yuan J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-08-26", "description": "Overrated and overpriced. Northern Chinese cuisine seems to be on the up trend these days and it basically means they can overcharge for smaller portions. The fact that they use smaller plates here should've been a dead giveaway for smaller portions. Place was small and super cramped. Don't even think about going to the bathroom, especially not before you eat, or you'll probably lose your appetite. \n\nLion head meatballs seem like a bargain for $5 but then the meatball arrives and you realize it's smaller than you thought. Then you taste it and confirm that you've definitely been ripped off.", "author": "Cathrin P C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-04", "description": "Came in on a chilly windy day for a late lunch after a beautiful walk on nearby trails of the cliff house.  \n\nOrdered \n1. wonton soup \n2. hot and sour soup\n3. Spicy eggplant\n\nIt is a clean, cozy, warm, quiet and small family run restaurant with absolutely delicious food and very kind service.  \n\nThe portions come in large deep bowls.  You will get your moneys worth here.\n\nEnjoy", "author": "Root Canal C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-09", "description": "WOW WOW WOW! Finally found a winner!!! \n\nAuthentic Chinese is so hard to come by, even in SF! The 626 in SoCal is my go-to place for legit Chinese. I've tried a few in the city and east bay and was never quite happy with what I found. \n\nSF is mostly Cantonese or Americanized Chinese that I don't care about. So when I heard there was a jiangnan style Chinese restaurant opening, I was eager to try. It's a region in south central China near Shanghai. I've been to Shanghai once and really liked the food there. \n\nCame with a friend on a Saturday after a daytrip. So it was after dinner time but the restaurant was still packed. We put our names down. Luckily the wait wasn't too bad. \n\nThe restaurant is a bit small but very clean with jiangnan themed decors. Our server was very friendly. We spoke mandarin with him.  \n\nWe ordered Suzhou stewed duck 苏州酱鸭, braised pork with quail eggs, homestyle eggplant, and veggie rice with salted meat. We got our food after just a bit wait. Everything we tried were so authentic and delish. I probably wouldn't order the rice again b/c it was good although not outstanding. But man, the rest of the dishes were phenomenal! My favorite was deff the Suzhou stewed duck. Omg it was seasoned and cooked to perfection with soy sauce. Finger licking good! My friend couldn't stop raving about the braised pork. I must say it was pretty awesome with those quail eggs! And I'd totally get that homestyle eggplant again, too! \n\nNow this is my favorite Chinese restaurant in the city. I've already made plans to come back with another friend of mine. I have been thinking about that lion head meatball all this time. Can't wait to try more things on the menu!!!", "author": "Angela F. W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-22", "description": "I've only been here once and already a big fan of this new restaurant. The vegetable fried rice is uniquely delicious. It's made with fresh steam rice so it's more moist than typical fried rice made with cooled rice. \n\nThe Xianghai Yang Chun Noodle Soup at 5.95 is a fantastic value as is the Braised chicken legs at $4.95.\n\nIt's a well kept secret. I hope they succeed. They definitely deserve the high Yelp rating. Authentic food at reasonable prices in a nice restaurant. What more can you ask for? It's a great neighborhood joint.", "author": "Pat Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-04", "description": "I've been here for years, this is the best and the most original Chinese restaurant in Bay Area! I ordered 9 dishes by myself ( which is normal), and I finished most of them!\nThe pork is stunning, the 咸肉饭was perfect to go with the pork.\nI'll be back, and this place deserve a Michelin recommendation", "author": "Chaos A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-15", "description": "Loved this place. Everything we ordered was excellent. I've been in person and for delivery and both were well prepared. I just wish I lived closer! \n\nDefinitely try the braised duck and fried rice when you go. They're both so good.", "author": "Alli J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-28", "description": "This is my new favorite Shanghainese restaurant.\nThe delicious braised pork is my favorite dish from this place. I highly recommend it.  The oxtail soup is also not to be missed. I plan to come back to this place everytime I'm back in San Francisco.", "author": "Neil S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-09", "description": "I think this place is awfully similar to Taste of Jiangnan on Clement street in Inner Richmond. Possibly run by the old manager of that restaurant? \n\nIt's nice and cozy inside. The service wasn't all too bad, even though we came late in the afternoon close to their closing time, and most of their tables were taken. I'm a big fan of their food, most of it tasted very home cooked and authentic. \n\n- their shredded potatoes with green peppers might be my favorite version in San Francisco. Not overdone, just great garlic/vinegar taste\n\n- Half duck: Half is more than enough for 2 people. The taste was pretty good, just smothered in a thick, sweet, soy based sauce of some sort. It isn't your traditional Peking roast duck, but I thought it tasted pretty good. Though I'm usually wary of the fat, and this duck contained ALOT of fat, it was like, a rich, delicious fat, enhanced with the sauce!\n\n- wonton soup: No complaints. You get alot of wontons, and they're pretty good. Tbh, not a big fan of \"wuxi style\" soups, because it usually comes with dried seaweed that gives the soup a different... older taste. Guess that's just a Jiangnan cuisine thing. \n\n- braised beef with potato: Yummy, comforting, carb-y soft potatoes and tender beef. It's delicious. Just not a big fan of the type of beef they use, which is the type alot of Cantonese clay pot beef dishes have, the kind with a layer of thick white tendon that curls up? That kind of beef just have a certain distinct, game-y flavor that I don't really like.", "author": "Ke C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-06", "description": "Yaaaas! I've been looking for a place like this for too long. Delicious, authentic Chinese food that leaves you feeling light and fresh. Tasteful, thoughtful decor that's both modern and traditional. And fast, attentive service with a touch of neighbourbood warmth. And clean! So lovely, so rare. \n\nWe didn't have to queue on a Sunday lunch even though the space is very cozy and quaint (fits maybe 8-12 small tables). Highlights:\n\n- spicy beef noodle soup: broth is so savoury, just the right amount of spice without being heavy or oily. generous chunks of beer and serving of noodles and veggies\n- eggplant: family style, fresh, filling and flavourful- just the right amount of bite and tenderness\n\nDefinitely excited to come back and try the other signature dishes!", "author": "Anna H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-21", "description": "This place is a notch above the immediate competition in terms of venue cleanliness and service, minus the typical credit card minimum inconvenience. This is reflected in the prices, as expected, but I'm ultimately not sure the food warrants the difference. I typically get take-out Chinese/Shanghainese. \n\nTo compare prices, I paid over $11 before tax for the veggie w/ salted meat fried rice, whereas I get heartier fried rice for $7-$9 normally.", "author": "Paulina F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-08", "description": "Came in and ordered a bowl of noodles (egg and tomato) which was actually pretty good. The soup was rich, not overpowered by tomatoes, and had a cooked egg on top of a large bowl of noodles.  This was the favorite dish we had.\n\nWe also ordered the chicken with potatoes. Pretty good flavors but at $13.99, not really sure it was worth the price. I was able to make a similar dish at home, so wasn't too impressed that I could almost make the same dish.\n\nOrdered the house tofu which had some good flavor, but was cooked with soft tofu instead of the larger brown tofu.  Think it would have absorbed more flavor with the larger tofu instead of the soft/silken tofu they used.\n\nI would come back for the noodles for sure", "author": "Allen M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-07", "description": "My family and I made reservations to eat here after seeing the restaurant being featured on a popular platform saying it was known for delicious Mafu Tofu which is a popular Chinese dish. We ordered mafu tofu, ox tail, duck, eggplant, cabbage and the eggs. Everything was super delicious especially the ox tail soup, eggplants, mafu tofu, and the cabbage. The duck was okay, it was pretty much just covered with sauce instead of having the flavor soaked in like the other dishes. They also have many options of mafu tofu and another section that's just vegetarian/ vegan. The prices are decent and not overly expensive which is nice", "author": "Katy W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-30", "description": "First time I've had such authentic hometown cuisine since I moved to the states.\n\nThe wuxi style braised pork, wanton and tofu soup were all authentic. The fried rice with veggie and meat was good too.\n\nThe lady even offered to carry our fussy baby so we could eat in peace!\n\nOverall a great dining experience and now I know where to get my craving for home food :)", "author": "Yangyang G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-11", "description": "Worth checking out if you are in the area. Be prepared to circle a bit to look for parking and wait 15-20 minutes for a table during peak times. Given how tiny the restaurant is, they are understandably strict about not seating you until your entire party is there. \n\nBe prepared to be very, very cozy. Their tables are very small and don't leave much elbow room. Bathroom is also tiny and you have to walk through the kitchen to get to it. \n\nFood comes with a lot of delicious sauce so definitely order a fried rice or at least a few bowls of white rice. We liked everything we got, especially the home grown eggplant and the giant meatballs.\n\nWe found service to be efficient and pretty friendly for a Chinese restaurant.", "author": "Sarina Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-11-08", "description": "Nice traditional flavor in San Francisco, if you want to try south Chinese food, this is the place to go.", "author": "Faye L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-07", "description": "I love this place! It's so delicious and the flavors are so clean and authentic. I traveled from MIssion Bay to Outer Richmond to try this place and it was definitely worth it. It is popular and I've heard that lines form. There are very few tables so I would get here when it opens. \n\nRecommend:\n1) Duck (5/5) - So flavorful and for $20 you get an entire order. The sauce was savory and decadent. Made great leftovers :)\n\n2) Hong Shao Pork (5/5) - One of the best I've ever had! It's not too fatty but just fatty enough... the sauce was unbelievable. Would come again and order\n\n3) Lion's Head (5/5) - Again, one of the best I've had. If you don't know what I'm talking about... it's essentially like a giant Chinese meatball. \n\nSkip the fried rice though. Bland and overpriced.\n\nAlso, unlike most Chinese restaurants, the service was so nice. The lady who took our orders was so gracious and cheerful the entire time. Best service in a Chinese restaurant that I've gotten for a long time.", "author": "Cindy W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-31", "description": "I love traditional Chinese food, and am always on the hunt for authentic home-y cuisine. We woke up one weekend craving for Chinese food, so made the trip to Jiangnan Cuisine. While some other review cautioned for the wait, when we arrived for lunch on Sunday around noon, there were still a couple of open table. We ordered eggplant with minced pork, a lion head meatball, tomato/egg noodle soup, along with fried buns with sweet & condense milk. We originally was thinking getting two lion head meatball since we were super hungry, but was warned about the size (1/2 lb!!) so we went down to 1 meatball. Good choice since the portion size was HUGE. The eggplant was soft and sauce-y. The only dish we didn't finish was the tomato/egg noodle soup, which was huge in portion size. It grew even larger as it soaked in more broth as time went on. I thought out of all the dishes, the noodle soup was the weakest as the noodle was just soaking up way too much broth. But the dish was still decent, and the rest of the dishes are excellent. The fried buns were excellent, which I think should be called Chinese donut as it's more similar to American donuts. The dish is pretty basic in concept but brings up so much childhood nostalgic. Overall, we had a great time, and we're already planning to come back to try some of the other dishes.", "author": "Sharon L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-03-21", "description": "Food is 4 stars, a little on the expensive side for the small portions but it's SF so...meh. Minus 1 star strictly for the service. Rule of thumb, if a customer spills something, GENERALLY, the first reaction is to give your customer some napkins. Generally. The server saw everything happen and proceeded to ignore us/avoid eye contact for like 10 minutes. It's more like 5 minutes but being soaking wet and having everyone look at you, it felt like forever. Granted, the place is small and it was a full house, and she was the only one managing the front... Anyways, the door to the restaurant also doesn't close all the way so you get blasted with a face full of wind every. single. time. someone opens the door. While you're eating. I paid to eat air that night. So... pick your seat away from the door and go on an off day -- you'll have a way better experience.", "author": "Nadeen H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-20", "description": "After spending the afternoon in Golden Gate Park, my friends and I decided to check out this cozy Shanghainese restaurant in the Outer Richmond. What a fun dining experience! \n\nI came here on a Saturday evening, so my party of 3 had to wait about 20 minutes for a table. I'm not well-versed in Shanghainese food, so I found the pictures of menu items posted outside to be quite helpful. Once seated, we were served complimentary green tea -- a nice touch since it was quite chilly outside. We started by ordering an item off the \"Dessert & Appetizing\" menu. We chose Chinese fried bread, which to our surprise was more of a dessert than an appetizer (it's hard to know with a title like \"Dessert & Appetizing\"!). The fried bread resembled donuts and came with a deliciously sweet dipping sauce. But hey, I'm not afraid to eat dessert first! \n\nNext, we ordered 3 main dishes -- kung pao chicken, shrimp chow mein, and braised pork. The chicken dish was flavorful and slightly spicy and I really enjoyed the chow mein. However, I LOVED the braised pork. The meat was super flavorful, the sauce was incredible, and the quail eggs added a delightful touch. This dish is a bit fatty, but that contributes to the great flavor. \n\nSo glad I stumbled upon this restaurant! I can't wait to come back and order more adventurous dishes!", "author": "Elyse W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-18", "description": "Well worth the trip. Everything we ate was very fresh and tasted fantastic. The shrimp fried was awesome!", "author": "Russell L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-03", "description": "Came here for lunch on a Sunday and loved the food and casual vibe. We ordered spare ribs, homemade eggplant, vegetarian braised tofu, fried spicy chicken, tomato and egg noodles, and small rice ball soup. All were delicious; we especially enjoyed the spare ribs and savory noodle soup. Highly recommend!", "author": "Sherrie W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-24", "description": "We came by on a weekend and wanted to try out this small shanghainese shop on a Sunday night. We came at 6:30 and there was already a line since there are very few tables inside. The service is lackluster as the staff are not trained well enough.\n\nHowever, this review is solely for food. The food is A1 and i was surprised by how good it was. We ordered the vegetable fried rice, housemade eggplant, and the braised pork. Braised pork is a must order and is the highlight of the meal! Vegetable fried rice is actually really good as well and offset the fatty nature of braised pork during the meal. I could not keep eating.\n\nI will return", "author": "Nick H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-12", "description": "Amazing!\n\nFood - A plus\nService - A plus\n\nService first - staff was able to influence the customers' vibe. An amazing feat, considering only two people working, on fairly busy weekend evening\n\nFood - review coming soon!", "author": "Zhou S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-22", "description": "Small restaurant but the food here absolutely rocks. This is probably the most authentic Shanghainese cuisine in SF. There is a few good places in Fremont but this place is less oily. We were a party of 6 and it took them some time to figure out our seating but we got to order a lot of dishes (eggplant, curry beef ox tail, chicken soup, braised pork, sweet sour pork ribs, clay pot rice, glutinous rice ball dessert 鱼香茄子，咖喱牛尾煲，鸡汤，红烧肉，糖醋排骨, 上海菜饭, 酒酿圆子) and not one was bad!!!! No pictures to attach because we were all hungry and the food was so good, no time for pictures :)", "author": "Sharon H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-08-05", "description": "Pros:\n- Must try the braised pork dish!  However, I was disappointed that it is made with quail versus regular duck eggs- much smaller in size and traditionally it is made with duck eggs \n- Pretty legit for Shanghainese cuisine \n- Parking CAN be difficult, but there were plenty of metered spaces (in front) and free ones (perpendicular to the restaurant)\n- Service is choppy as there were basically 2 waiters, and looked to be family owned. Be ready to REALLY flag them down \n\nCons:\n- LONG wait and be ready for it\n- Go out your way for the drive and wait?  Probably not- go there if you are around the neighborhood \n- Estimated about 8 tables, TOPS\n- Definitely not suited for parties more than 4 \n- Reservations not accepted \n- Prices are moderately priced, however smaller portions", "author": "Jennifer K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-03", "description": "Through a search for Shanghainese food on yelp, we found this place.   The place is owned and run by folks from eastern China, from the city of Wuxi.  It's quite close to Shanghai so the food is similar, but different nonetheless.  Overall, the food was quite authentic:  lion's head, rice cakes with cabbage, fresh fish with tofu, ox tail, sweet sour ribs, vegetable rice, etc.  and tasted quite good.  It's really a refreshing place compared with the hundreds of standard Cantonese food here in the city.  Definitely worth more visits.", "author": "Dennis K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-23", "description": "Delicious. First time here and I enjoyed it. Friday night dinner and no wait to get a table. Had mapo tofus and pork short ribs. Absolutely delicious. Probably the best mapo tofu I have ever had. It's a lot lighter than others and has more peppercorn spice than chili spice. As I write this I am craving it more and more.", "author": "Andrew K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-09", "description": "It's probably more of a 3.5 but the service is wishy washy. The place needs to get service sorted out. Friendly service but not the best. Food was tasty but nothing that is going to bring me back right away. \nBraised pork belly - really tough and hard. The pieces with fat on it were softer at least. Kind of a let down. Cabbage with shredded chicken - really good. Flavorful but plain enough that it complimented all the darker dishes. \nWon Ton soup was really good. Interesting broth with mushrooms and seaweed. \nMeatball - just one giant meatball. Moist and seasoned. \nStewed duck - meaty and flavorful. \nFried rice - tasty but it was like 20 minutes later after we got our other dishes so it was kinda too late in the meal to really enjoy. \nPlace is really small - 7 small tables - so not great for big groups. \n*Note: Not good for vegetarians. I was looking at the vegetable section and 90% of the vegetable dishes had meat in it.", "author": "Veronica L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-02", "description": "Loved the food, menu is not long but super authentic.  I am from shanghai and last lived there recently - the meat ball and rice with salted pork and greens is just like the way my late grandmother would make.  The food has great flavor but not overpowering.  This would be a solid restaurant in shanghai today, not greasy and not cheap strong flavoring.  Can't wait to come back to try more dishes.  This is for Jiangnan style of Chinese food, generally near Shanghai, where most food is not spicy.  Ask wait staff to recommend special dishes.", "author": "Jennifer Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-17", "description": "So happy to have Shanghainese food nearby! \n\nFood = excellent. \n\nMeatball = Moist, well-seasoned and ginormous. Reminds me of the homemade ones. $4.95.\n\nSauteed rice cakes = one of my favorite dishes. Clean and delicious. Tender rice cakes. $9.95.\n\nFried rice with fried chicken = my least favorite. It was just okay.  (I'd probably try the vegetable fried rice with salted meat next time.) $9.95.\n \nBraised pork = totally hit-the-spot. Tender, flavorful pork, with stewed boiled egg. (Can't wait to get the pork bones next time.) $11.95.\n\nSteamed rice = $1.25.\n\nService = friendly. The food comes out pretty fast, and well paced. Although, she did tell me to stop ordering after 4 dishes. (This is quickly becoming a theme.) There is only one server, and definitely a family-run business (with maybe 3 or 4 people working), so be patient--it's worth the wait. Write your name on the list if there's a wait. \n\nPrices = reasonable. Dinner for two with leftovers came out to $41.38.  \n\nDefinitely plan to come back!", "author": "Fannie S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-20", "description": "One of the  best hole in the wall Chinese restaurant hidden in the outer Richmond District.   The lion head meatball, spicy cabbage, and Chicken cabbage are all MUST orders.   Awesomely delicious!!!!!!!!!!", "author": "Lawrence L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-13", "description": "Here on our way back to the city from Napa on a Sunday evening for a casual dinner. Got here around 6:30pm and were ecstatic that there was no line (we were warned by our friends about wait time). When we finished dinner around 7:30pm, a short queue formed outside.\n\nCozy little restaurant, family ran, only complaint from me was that you have to go through the kitchen to get to a cramped bathroom. Service was good for an authentic Chinese restaurant but portions on the smaller side. \n\nBraised pork with quail eggs (5 stars) was outstanding - extremely tender, juicy and flavorful and melts in your mouth. Homemade eggplant with meat (5 stars) was our other favorite. Wuxi wonton (5 stars) and spicy chicken with soy bean (4 stars) are more on the lighter side if you prefer less saucy food and both are excellent as well.\n\nTLDR: authentic Chinese food (blows restaurants in Chinatown out of water), limited seating in a cozy restaurant, avg prices.", "author": "Nancy Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-11", "description": "I read about this restaurant on Hoodline and decided to come here tonight with my husband and daughter who are both really picky eaters.  Got here around 7:45pm and the place was packed.  Place is pretty small but feels cozy.  We got seated after a 10-min wait. The food was surprisingly delicious and authentic even though they ran out of a few popular items on the menu, like the braised chicken legs and duck.  We ordered:\n\nSweet and sour pork ribs - super delicious!!!  I thought my mom made the best sweet and sour pork ribs but theirs is better!!!\n\nLion's head meatball - yummy, must order.\n\nFried chicken cutlet - so tender and not overwhelmingly greasy at all\n\nFried wonton - as perfect as my mom's\n\nSpicy beef noodle soup - Superb!\n\nService was excellent. The owners were very fun to talk with and it was a very enjoyable dinner. The food we ordered was reminiscent of my childhood days in Shanghai.  We will definitely come back soon!  Overall, this place is a MUST try!!!  Wish them great success!", "author": "Jade C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-04", "description": "Authentic Homestyle Chinese food.  The restaurant is very small, so I'm sure that there will likely be a wait during busy hours (we came at 9 PM on a Saturday and there was no wait).  It appears to be a family-owned business and the woman who greeted us and served us was super nice.  She did sometimes have some confusion understanding English, but overall it was fine and I got a chance to practice my broken Mandarin.\n\nWe ordered the salty meat & vegetable rice, sweet & sour pork ribs, and spicy (ma la) beef noodle soup.  Each of the dishes were delicious.  We originally wanted to order the braised pork, but she said they had sold out that day (they weren't anticipating it to be so popular!)  The beef noodle soup had a delicious ma la flavor.  If you aren't familiar with Szechuan peppercorn, it causes a numbing sensation in your mouth.  It wasn't too overwhelming, but it had a nice unique kick to it.  The salty meat & vegetable rice was like classic Chinese comfort food and the sweet & sour pork ribs were delicious!\n\nI will definitely return and maybe consider take out too if they run out of seating!  Great addition!", "author": "Jess Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-21", "description": "SIMPLY DELICIOUS!\n\nWas luckily in the area when searching for a place to eat and was so glad I picked Jiangnan Cuisine! The restaurant is tiny, cute, and clean. I came on a Thursday afternoon and there was no wait, phew! Also, when using the bathroom you would have to walk through the kitchen which I personally liked because HEY I get to see whats going on inside the kitchen!\n\nMy friend and I ordered the meatball which was recommended by the waitress and man oh man was that yuuummy! We also ordered the braised chicken and potatoes which was good too! The taste of it reminded me of Mexican chili, so if you're into that :)\n\nOverall the service was great and the food was amazing. Definitely will want to come back!", "author": "Judy L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-08-05", "description": "Went to this place due to good reviews. Was very disappointed with both service and food. Made 7:30 dinner reservation but was not seated til 8:05. Ordered the meatballs, duck, and 4 other dishes (we had a party of 6). Food was too salty and just average. Service was sloppy and not very friendly. Will not be going back there.", "author": "James F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-22", "description": "The shredded pork with soybeans dish was honestly one of the best things I've ever eaten, and I've done a lot of eating in my short life. Thinly sliced braised pork belly, with fresh edamame, sliced ginger and garlic, thin sliced red onion, thick cut celery and green pepper, all in the most delicious saucy broth. I also got the fried spring rolls and they were piping hot, crispy, and intensely flavorful. The waitresses were so warm and attentive, and my tea was never empty.\n\nI don't know what I was expecting when I wandered into this tiny restaurant last night in my post-finals exhaustion haze, but what I got blew away anything I could have hoped for. This was comfort food at its highest caliber and I will absolutely be back before I leave SF.", "author": "Liz B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-07-14", "description": "It is ok for a neighborhood restaurant, nothing impressive. The food was kind of blend. Once is enough for me.", "author": "Lydia L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-08", "description": "The restaurant food is really delicious, I often go to the restaurant. Service enthusiasm", "author": "Tang Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-16", "description": "Absolutely loved everything we ordered here! We went there for the Chinese New Year eve dinner. This is a cute little restaurant with more of a Suzhou style decor. The place is small, and they don't take reservation for small parties. We went there pretty late at night, but still waited for 15 minutes, not too bad based on SF standard.\n\nI ordered mostly the traditional dishes you would eat for Chinese New Year only if I could eat more (only 2 of us):\n\nLion's Head - 5 star. Hands-down the best one I've had in bay area. Very good flavor, and you can tell it's fresh, and it's all meat (quite few restaurants mix too much flour in there).\n\nBraised Bass with Tofu - 5 star. The fish is very fresh and tender, tofu absorbs in the flavor and adds in a good balance.\n\nCauliflower (Gan Guo Hua Cai) - 4 star. It's cooked to just the right texture. The one star taken off is because it's a bit salty to my taste.\n\nVeggie and salted pork rice (Xian Rou Cai Fan) - 5 star. Even though it's not completely the way that Cai Fan is cooked (missing the crunchy rice part), it is so good that we devoured it. Considering I am trying to control my carb intake... I failed miserably.\n\nGlutinous Rice Balls and Osmanthus in Fermented Rice Wine （Gui Hua Jiu Niang Yuan Zi) - 5-star. It's simply just tasty! And it's made in the authentic way that reminds me of mom's cooking.\n\nSesame balls - 5-star. You can't go wrong with this.\n\nIf there is anything I would complain about, it would be the sequence they served the dishes. We got dessert as 3rd course, and waited forever for the 2nd dish to come out. But it must have been a busy night for them, so they just served based on what got ordered by other customers too. It's easier to batch cook. And at least they are considerate enough to serve us one course really fast so that we don't sit there without anything to eat.\n\nWill definitely go back to try out other dishes.", "author": "Jenny N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-09-29", "description": "Very unfair inefficient service. Wait is long and then they favor people who speaks mandarin. If you speak the language you will get seats and food faster. Food is good but not that much better than other good Chinese place. Meatball is ok. On the saltier side and the meat quality wasn't good and salty that you should eat with rice. The salted vegetable fried rice is actually good. They did a good job frying and browning the rice. Salt well balanced. Green beans nothing special. Eggplant was soso. It's a greasy dish but the eggplants we're sitting in pool of oil.", "author": "H L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-07-07", "description": "Very good, but nothing too exciting. Mapu tofu, shrimp fried rice, dry green beans, fried won tons. Very noisy.", "author": "P S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-23", "description": "Their food is very authentic. It's like eating back home (joyful tears)~ Soy sauce and sugar are used very often in Jiangnan (south of Changjiang/Yangzi river in Jiangsu Province, China) dishes. \nI love their chicken legs, pork, and duck. The cabbage with shredded chicken are fresh and delicious! The spicy chicken with green soy beans are surprisingly good although it's not a traditional dish from jiangnan area. \nTheir lunch boxes are as good as any dinner dishes, and it's only $4! \nThe restaurant is nice decorated with Jiangnan themes and the waitresses are super nice and sweet. I want to eat here every day!", "author": "Yuan Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-06", "description": "Every bit deserving of the high praise they are receiving here on Yelp! This lovely, homey family-run joint is an extremely welcome addition to the neighborhood.\n\nRather than elaborate on all the standard points one expects to see in a 5-star review, I invite you to simply head here yourself and enjoy the convivial atmosphere and delicious food.\n\nI do wish a few things were better, though: I wish the tea were stronger tasting. I wish the kung-pao chicken had more sauce and was spicier. I wish the broth of the wonton soup was a bit richer. \n\nBut those are minor quips and quite frankly I'm very, very happy with this relatively new restaurant and look forward to coming here at least semi-regularly. Possibly regularly.", "author": "Grizzle J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-15", "description": "I am a few weeks late, but better late than never.  We came here after an appointment at UCSF, my who is Chinese & another doctor & visiting doctor from Bejing recommending this.  We never had Jiangnan cuisine or even heard of it, so this was quite a treat.  It is a small neighborhood homey place with friendly service in a bare bones atmosphere.  The braised meat balls are a must; you order them individually & they are like the Shanghai style lyon's head meat balls with a slightly sweet & salty sauce; this region is just west of Shanghai.  The ppotatos with bell peppers are comforting with fresh potatos & green peppers & cumin in a spicy sauce.  The ox tail was highly recommended with tender ox tail, little egg dumplings, mushrooms, greens, & other vegetables in a savery broth; the ox tail is easier eaten at home as it is on the bone, well, at least for me.  The Jiangnan noodles are also superb with thin rice noodles, minced pork, & greens in a peppery broth.  So, for some wonderful Jiangnan cuisine & something that is not your everyday Chinese food even by bay area standards with friendly service in a bare bones atmosphere at reasonable prices, Jiangnancannot be beat.  Keep up the good work guys.", "author": "Brian S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-03", "description": "tried this place for the first time last week, and it was so good! i went with a big group so we were able to order everything !! also came in with 7 or 8 people on a saturday night near closing and were seated immediately even though it was fully packed\n\nbraised pork belly: 10/10 ooomggggg sooooooo good definitely get this. melts in your mouth! comes with quail eggs. this dish was gone from our table within minutes i only got a few pieces )':\n\nstewed duck: 8.5/10 good flavor, a little on the dry side. also the half size is huge\n\nbraised chicken leg: 10/10 WOW sooo yummy!! only $5 for two huge pieces!????? everyone get this lol\n\nspicy braised beef noodle soup: 6/10 i didn't like this one much. had some numbing spice which i'm not a fan of but i think my friends enjoyed it\n\nbok choy: 6.5/10 just ok but good to have some fiber with all the meat lol\n\nstir fry cake with napa cabbage: 8/10 pretty standard. good starch choice to go with meal\n\neggplant: 10/10 AMAZING i love eggplant this was probably my one of 2 favorite dishes \n\noxtail soup with clear noodle: 7.5/10 pretty good. meat good but also had a lot of numbing spice so i didn't eat much of it. the rest of my group loved this dish\n\nfried chinese bread w/ condensed milk: 5/10 just OK wouldn't order again. really dense bread", "author": "Christine G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-23", "description": "Small restaurant; the door barely opens into the maître d stand! Once we got in, the tables were filled w/ delicious smelling cuisine. We ordered copious amounts of food-\nWon ton soup Wuxi style. So luscious; the oily, buttery broth was hot & soothing. The wontons top-notch, baby bok choi (baby Groot?)soft w/ a crisp snap. Mushroom slices helped broaden the flavors . Followed by the Braised Pork; fat chunks of y meatiness; on point. Next, shrimp corn egg fried rice. Such homemade goodness! Finally, the Braised Beef w/ Potato- like grandmas brisket stew! So authentic. You should go here...", "author": "Maury K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-23", "description": "Good taste. Hospitable and considerable host. Recommend dishes are good. Worth to try", "author": "Erik W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-17", "description": "Delicious, authenticate Shanghainese food with super friendly owners.\n\nI highly recommend the Braised Pork ($13), Vegetable Rice with Salted Meat ($11), and Shredded Potatoes with Green Pepper ($13).\n\nIf only they had delivery... (hint, hint)", "author": "Hao H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-02", "description": "Everything we ordered was delicious! Friendly and helpful service! We will definetly be back! We ordered the lion head meatball, which was light and fluffy, not the hard rock of meat that you get at most places. The vegetable fried rice was flavorful and delicious, it had \"wok hay\" and we devoured it! The stir fried cabbage was great, it had a few little red peppers that gave it the perfect amount of spice. Finally the stewed pork was amazing, meat was flavorful and tender with the perfect sauce that was not too salty or sweet. Highly recommend this place!", "author": "Chacktin L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-12", "description": "Delicious! If you come to this restaurant, you must try the duck($19.99). The owner told me that the soy duck only Jiangnan Cuisine have it! So I tried, and it's very delicious! Also I tried meet ball($4.99), it's good. The meet very soft! After I ate the meat ball, I mixed some white rice with the meat ball sauce, that's amazing! And the homemade eggplant ($11.99), it's a little bit oily. But it's good! \n\nThe service is very nice! The waitress are friendly!", "author": "Mengyun L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-24", "description": "Wow this place is amazing. Fried chicken no and chow mien a bit salty but I'm wowing about is this braise pork belly with qual eggs. The meatball and bok choy is also good. Eggplant is ok. Anyway let's get back to braise pork. It's the most amazing braise pork belly ever. I can just go swimming in their sauce they use. I also see everyone order their veggie salty pork fried rice with the braise pork belly. I will definitely have to come back for these two awesome dishes! 4 star!", "author": "Christy V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-07", "description": "time: we are a group of 5 people got there at around 12pm. \nparking: it is always hard to find parking in Richmond area especially on Saturday.\n\ncrowdiness: When we got there, the restaurant is not full so I was actually kind of scared that this restaurant might not be good. We originally planed to go to dragon beaux but the line was already so long when we got there so we switched to come to place instead. \n\nservice: the service is pretty good. They provide free tea and it tastes really good compared to other places. 5 star\nFood: food is ok.. it's not that authentic. It's pretty strong-flavored and greasy. 3 star\n\nWe ordered the stewed duck, veggie rice, sweet and sour pork rib, chicken with bean, salmon and tofu.\n\nThe veggie rice is REALLY good(MUST ORDER). \nOthers are just average. (nothing too special). \nSalmon and tofu( I forgot the dish name) is suggested by the waitress. This one is really below average. I won't recommend it at all. \n\nProbably won't come back again since it's too far away from my home +  so hard to find parking + there are still so many other chinese restaurants in richmond area i haven't tried before...", "author": "Tina H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-18", "description": "My Shanghainese friends and I all agree this is the best Chinese comfort food in town. Our favorite Chinese place, perhaps on par only with Wonderful or Chili House. In particular, their Hong Shao Rou (Braised Pork with Quail Egg), Egg and Tomatoes, Griddle Cauliflower/Cabbage, Eggplant, and Duck are my favorites.\n\nThe staff is exceptionally warm and friendly and the atmosphere cozy.", "author": "Marc V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-25", "description": "Best and the most authentic Chinese restaurant in SF!! Very friendly staff and caring service, made me feel like home every single time I step in this restaurant! Highly recommend to everyone!", "author": "Keting S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-04", "description": "The best Shanghainese food in San Fran!  All I can say. Make sure to order the eggplant.", "author": "Anthony T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-05", "description": "Best non Cantonese food on the west coast.\nThe meat ball is hand cut not ground.\nThe pork belly is the best, better than anywhere I've been to in the Bay.\nWill post some when I have time.", "author": "Jake N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-24", "description": "Great little neighborhood spot with a friendly and attentive staff. Food is tasty (had the shrimp chow mein, shredded potato and peppers, and beef and peppers). My favorite by far was the shredded potatoes! It had perfect flavor and a complex spice to it that built as you ate more. I will absolutely be back and can't wait to try more items.", "author": "Cat B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-11", "description": "This restaurant feels very similar to Taste of Jiangnan on Clement, from the name to the menu to the food.  What I liked about the restaurant on Clement is the homemade feel of the dishes, which Jiangnan Cuisine also portrays.  Eating the Braised Pork tasted just like how my mom makes it.  Tender meat with a layer of not too thick fat and skin, simply delicious.", "author": "Karen L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-26", "description": "Super yummy food and decently priced! The braised pork was incredible. Super recommend and would come back.", "author": "Natashia S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-03", "description": "We went for dinner on a recent Friday night.  A very small restaurant with seating for approximately 8 tables of four people, but worth the wait -- or if you can get there early or late because the crowds seem to die down quickly as the neighborhood is far out in outer Richmond.  \n\nDishes and flavors are great, and relatively reasonably priced.   The $5 pork meatball is flavorful and fluffy.  A must is the Delicious Pork roast in sweet dark sauce -- a Shanghai specialty.  Ma Po Tofu is nicely done without the overwhelming red oil of the more Szechuan-style restaurants.  \n\nCourteous and nice service as well (only 2-3 people working the front of house), and you leave with a good family style feeling.", "author": "eric s."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-09-04", "description": "There are no stars because we checked Yelp multiple today.  Please update ur hours.time and said it was opened.  We pulled up at 12:10 - it was clearly not open nor going to be opens", "author": "Carl A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-12", "description": "Spent morning at Legion of Honor and had craving for Chinese food. Yelped nearby restaurant and ended up at Jiangnan. Amazing!  Fried spring tolls were crispy and had great gingery taste. Sweet & Sour Spare Ribs in dark  delicious sauce was perfect with vegetable fried rice. Ribs were tender . Asked for spicy sauce and they brought us chili paste that had just the right kick.   Beef chow-main had light soy sauce . Just my daughter & I so plenty of left overs.   \n\nSmall restaurant and very small bathroom. Great food!", "author": "Ana M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-03", "description": "I came back to this restaurant this evening because the food was so good last time. Just keep in mind that when they tell you they close at 9 PM, they actually close at 8:30 PM. It was very strange to the two of us that the restaurant was closed at 8:25pm for us, but they accepted the two people standing there waiting for a table when we arrived at 8:25 PM. We couldn't figure out why the restaurant was open for them at 8:25 PM but not open for us at 8:25 PM. We don't want to think that it's because they are Asian and we are white. Maybe they are friends of the owners. I prefer to think that.", "author": "John H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-07", "description": "The Chinese food here was extremely delicious and authentic! This place greatly exceeded my expectations, better than a lot of Chinese restaurants I've had in SF. I would recommend this place to anyone craving really good Chinese comfort food", "author": "Courtney A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-04", "description": "Some really interesting dishes. Tofu was great and ribs were also really good. Nice environment inside. Will be coming back.", "author": "Alex R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-10-30", "description": "Decent food, on the saltier side. \n\nHorrible waiter service for such a small restaurant. The dude was on his phone more than he cared about the people eating. You want your tea refilled? HA!!!!!! Good luck flagging them down across the restaurant. Quick to bring the check, but fails to do bring a pen. Waiter must be sleepwalking.", "author": "Kelvin Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-27", "description": "This place is a gem, if you are looking for authentic Chinese food. \nMy and my wife ordered the wonton soup, sweet and sour baby pork ribs, along with some simple vegetables fried rice.\nThe sweet and sour pork is really flavorful, the vegetables fried rice is made of fresh ingredients, texture of the rice is silky soft and it's honestly the best fried rice I had in years!\nThis is a family owned restaurant and there is only one server, so be patient but I think it's definitely worth the wait, we will definitely be back to explore more dishes!\nThanks again!!!", "author": "Kevin W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-27", "description": "The sweet and sour spare ribs are about the best I have ever had in my life...and that includes fancy restaurants in China.  The meat was flavorful, tangy, crispy and the sauce was just the BOMB.  If you think Chinese food is sweet and sour chicken, this dish will blow your mind.", "author": "Jane M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-10", "description": "I was born in Changzhou, a city in Jiangnan area. And I won't even hesitate to say that this is the BEST Chinese restaurant that I ever tried in the whole States. The chef here is from Wuxi, who cooks a lot of authentic Jiangnan cuisines. My parents from my hometown visited me at SF and I took them here. They couldn't find a difference between food here and at home. Highly recommend for anyone who misses or likes to try Jiangnan cuisines!", "author": "Sean W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-20", "description": "With Dad in tow, you gotta give him his dose of Asian, specially Chinese. We hunted down Jiangnan through trusty Yelp and wondered deep into the avenues where my dad's mom / my grandmother once lived. I think we could have ordered more but five dishes amongst four seem plenty... the eggplant with garlic was at its best, the veggie rice with salted meat appeared to be a house specialty so that was an easy pick, and the shrimp with heads is the only way my dad likes it served. Mapo tofu was tasty, yet the wonton broth could have used a bit more body. I think I would have ordered another soup, if I had a say (I was parking the car!)\n\nService was attentive, no wait on a Thursday night. I'd give the restaurant another try.", "author": "LY T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-19", "description": "Really good food. Small place so fills up fast. I highly recommend this place in Outer Richmond! Best Chicken Kung Pao I've had in San Francisco!", "author": "Kim B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-07", "description": "Found this restaurant on Yelp, well what can I say? It is simply AMAZING!!! Never had any Chinese food in the whole bay area that can be as authentic as this one, brought back a lot of childhood memories. \n\nI now live in San Jose, but since this restaurant was discovered 2 days ago, I've been here twice already. You know what, distance just cannot keep me away from good tasting food.", "author": "Daniel M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-12", "description": "Went here with my boyfriend since he's been wanting to find a Shanghainese restaurant. He fell in love with the food here because it was authentic and told me he would take his mom to this restaurant sometime soon. Very very very big portions for a very fair price. Food packed with good flavor (not just a ton of MSG like a ton of other restaurants do). We got the pork with the eggs (some soysauce dish), wonton soup, and fried rice.Staff was extremely kind and helpful. Additional stars for cleanliness.", "author": "Monica L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-02", "description": "New place to eat .... new style food  .. nice costumer service . Try their \"Stewed duck in soy sauce \" very good", "author": "Yuzi Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-04-29", "description": "We went here for the 4.5 stars but we were pretty disappointed. Food was nothing special. Pork was very fatty and the green beans were greasy.", "author": "Kristen A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-01", "description": "Marvelous restaurant. Very small with only 8 tables, but what a find!  Completely atypical from most Chinese restaurants. Unique dishes from just south of Shanghai. The photo shows the pork rib and duck dish we had. Huge portions, so lunch tomorrow is taken care of!  Highly recommend.", "author": "Patricia L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-01", "description": "Pretty good food and service.   Food very tasty must try !!!!prices is very affordable, they also have lunch special at lunch time $6.00 ONLY!!!!", "author": "Sincere H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-08", "description": "The braised pork is really good! Highly recommend! All dishes we ordered in Jiangnan taste so good! That's the truly Chinese food!", "author": "Yanchun W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-30", "description": "Great Jiangnan cuisine!! We ordered the stewed duck in soy sauce(per-order),shredded chicken with green soy bean , and vegetable& salted meat rice. Love everything we tried!! I will be back to try other dishes next time!!", "author": "小静"}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-12", "description": "Solid Shanghainese standards in the blustery Richmond. The mapo tofu made, unusually, with ground chicken instead of pork, was excellent, much better than the stuff I make at home with the off the shelf sauce pouches. What, fellow white people, you don't make mapo tofu at home? Never had a Chinese girlfriend, I see. \n\nBut where was I? The Shrimp Maggie was a little bland for our tastes, one of those \"let the natural flavor of the meat shine through\" numbers my coarse pallett can't appreciate. The tea was cold, but the service was enthusiastic. I'd come back.", "author": "Nick C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-01", "description": "One of the best Chinese restaurants in this neighborhood! The price is cheap and owner is very nice. Braised pork and Ma Po tofu are my favorite dishes. The fried eggplant is sweet with a little spice.I will definitely try their stewed duck next time", "author": "Kevin Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-11", "description": "My goodness, very unexpected!   The food here is delicious and the staff very friendly.\nHad the griddle cauliflower w/ pork, sweet and sour short rib, and the mapo tofu and ALL were excellent.   Will def go back very soon.", "author": "Marlow M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-27", "description": "Me and my friends wanted to try a new place. We normally eat out in the sunset, but wanted to find something in the Richmond district. \n\nWe tried this place based on the ratings. \n\nWe were the first ones there, but by 11:45am, the lunch crowd started to arrive. \n\nWe had the braised pork, braised beef, eggplant and chicken chow mein. All of the dishes were great, and our server was very attentive. \n\nThis spot definitely makes our list of places to frequent.", "author": "P M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-25", "description": "Went here based on the reviews, and the reviews weren't lying. There was 4 of us and we ordered the chicken with green beans, spare ribs, fried rice with beef, stir fried vegetables, veg rolls. And it was the perfect amount of food. Not heavy with oil, felt amazing afterwards (no belly issues like with some Chinese food), and was satisfied. Great Christmas dinner AND the service was warm and nice.  Definitely suggest. Go early! Tables get picked up fast and no one is in a rush to leave.", "author": "Carlee M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-29", "description": "went here with a group of 6. Service was very nice and the food was\noutstanding. We all agreed we have never had better-fried rice. The spare ribs are so tender and sweet. Veggies were fresh and crisp. Rice balls desert were freshly made. Shredded pork, as well as the Lion's head meatball, are top in taste. Spicy braised beef noodle soup was\nso so good. We are already planning on what we want to order the next time we come here.", "author": "Peter F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-24", "description": "If you come from Zhejiang or Shanghai in China, this is probably not the right place for you. \nThis is not Jiangnan flavor. They put too much soy sauce and everything we ordered has very strong flavor.\nBut I still give them 5 stars. Not for the food in the restaurant but for the memory I had in my hometown, Jiangnan.", "author": "Zhaoze C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-04", "description": "Was curious to find what the craze was about with this new shanghinese food joint. Had the brazed pork, \"lions head\" meatball, the shredded pork with mustard, and the fried rice. Was pleasantly surprised with the great authentic taste. Everything was savory and mouthwatering to the mouth. Literally my taste buds tingled with every bite. The brazed pork was a little too sweet but that's expected. Overall it was a great experience.", "author": "Richard K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-18", "description": "I have been curious about this place, which just occupied the space where Sapoten used to be.\n\nYesterday for lunch, my friend whose mother is from Jiangnan, and I tried it.  We both agreed it was excellent.\n\nLion's head meatball ($3.95) --tender, delicious, HUGE. Comes in its own bowl with a delicious sauce.  They also seem to sell this as a to-go lunch priced for George Washington high schoolers at $4.00 for meatball + rice.  A great deal.\n\nDelicious Braised Pork ($11.95)--the famous Hong Shao Ro (red-braised pork). EXCELLENT. Meltingly tender meat, with an unctuous layer of fat and thin chewy skin and the most delicious sauce.  Comes with 2 hardboiled eggs coated in the sauce too.\n\nFried Chinese Bread ($5.95)--6 small perfectly uniformly shaped steamed piping hot buns, flash-deep-fried so that the outside is crispy and the inside is soft and pillowy. Served with a small bowl of condensed milk to drizzle over as you please (or not).  We almost didn't order this one and we are so glad we did!\n\nStir fried spicy chicken with soybeans--on the other menu (not the lunch menu).  Very tasty. A bit less memorable than the other dishes we tried, but still great.\n\nThe woman who served us spoke primarily Mandarin, and she is very sweet.  I saw her give a free lunch to a young woman who had ordered some takeout, but then didn't realize that they didn't accept credit cards. \n\nThe decor is nice and tasteful and the dining area is very clean.  Two other pairs of diners were eating while we were and it did get a bit loud with everyone conversing.\n\nHIGHLY RECOMMEND.  I hope I don't regret writing this review and then find long lines the next time I go, which I plan to do soon.", "author": "Karen C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-10", "description": "Fresh food and good services, but the soya duck sold out again. Will back try the soya duck ...", "author": "Jeanette W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-04", "description": "The dishes are absolutely authentic. Ingredients are carefully selected and prepared, at least being able to represent the Zhe style of Chinese cuisine. The boss there originally came from WuXi, which is part of Jiangnan region of China. The restaurant is family style. My friend who was from that part of china love it too. Highly recommend, the chicken with edamame is solid.", "author": "Rng L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-29", "description": "Looks like the main chef from Taste of Jiangnan opened this new restaurant. No wonder the food in Taste of Jiangnan tasted differently now. \n\nThis is now my favorite Chinese restaurant outside China. Awesome Jiangsu food! I'm much more satisfied with the food here than many Michelin restaurants I've tried in SF.", "author": "Chen P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-12-30", "description": "Food wasn't bad, just very little meat for the $ cost. Had to order more steak on the side and it was still tiny.", "author": "Ramz A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-10", "description": "I really like the Mapo Tofu, one of the best I ever had. It was the right level of spiciness and the flavor was super good. \n\nThe place was not very crowded, had a good clean and new ambience, and service was very good.", "author": "Gui K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-25", "description": "Really delicious new place on the Balboa Strip. Ordered the Napa cabbage and chicken and was a little nervous about my choice by the look of it - delightfully surprised when I took the first bite. Everything we ate was fantastic. Friendly atmosphere and employees. Definitely a new favourite in the neighbourhood. Will be back!", "author": "Madeline M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-24", "description": "OMG. So good. We had the braised tofu, which was SO GOOD and flavorful. Then we had the braised pork and the short ribs (maybe only get one of them because it was a big rich). Also had the cabbage, which was delicious even though it's \"just\" cabbage, after all. \n\nService was a tad slow and the place is small, but it was very yummy. Came out to $15/person, including tip.", "author": "B. Y."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-03-18", "description": "Food was mediocre, service was indifferent and in a rush. It felt like they were doing me a favor serving me food. It was crowded and unwelcoming place that I am not planning to come back to.", "author": "Chelse D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-25", "description": "Stumbled upon this while hanging out in the city and decided to give this a try. We ended up ordering the lion head, braised pork, house special eggplant, and 1/2 soysauce duck. We thought it's cute the lady kept telling us we might be ordering too much instead of trying to hit make money from us. The food was really good, I think the only thing I felt was more standard was the lion head, which tasted good but similar to most restaurants. Other 3 were all really good, duck is super yummy but keep in mind the way it's prepared here doesn't have crispy skin so if thats what u like then this one might not be for u. The pork is very tender and comes with quail eggs (adorable and tasty). Will try to come back next time I come to the city again. Only minus is the typical Asian restaurant flaws: mediocre service and ambience but those things dont bother me much if the food is legit.", "author": "Cathleen L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-21", "description": "After our many attempts to find an open restaurant today we wound up in this little gem. It is quite a small restaurant but the food is great!! Coming from New York, we always have a variety of food and usually proclaimed some of the best in the nation. This food was the best because of the authenticity. Everything was fresh and made to order. Enjoyed each of my dishes and each was pleasantly tasty! I reccommend this place for anyone around the area!", "author": "Heather J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-01", "description": "The restaurant we wanted to go was closed so we went into the closest restaurant nearby, which happened to be Jiangnan. We ordered braised pork, pea shoot tips, mapo tofu, beef noodle soup, and fried rice with vegetable and shredded meat. Everything was excellent. It was a serendipitous surprise.", "author": "Yun W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-20", "description": "Very delicious! Food paradise! If you are currently scrolling down to read the reviews for this wonderful restaurant, don't hesitate, just go! You'll thank yourself! We literally LOVE everything we ordered! Will definitely be coming back next time we come to visit SF! :))", "author": "Kathrine R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-03", "description": "There is only one server, but the wait is definitely worth it. I got the braised pork, pork meatball, braised beef and potato, and fried rice with chicken. Braised pork = to die for. It's sooo good. The braised beef and potato is also extremely tasty.", "author": "Jackie L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-22", "description": "5 star for the jiangnan food, it is exactly the same taste as in my hometown Wuxi. Minus 1 star for the annoying fact that there are many spicy foods in the menu that are not jiangnan cuisine at all, and they do not taste good.", "author": "Jack Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-11", "description": "Really authentic southern Chinese food. Definitely try the tofu soup, braised pork, Napa cabbage, and eggplants. Definitely a go-to for Chinese food in the city.", "author": "Colleen Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-16", "description": "Really good! Loved the spicy chicken and spicy beans. A winner for sure. Give it a try.", "author": "Kai L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-03", "description": "Only had one thing one time, but it was perfect: egg and tomato noodles, Wuxi style. kind of a soup. utterly yum.", "author": "Jane M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-09", "description": "This is authentic Chinese food. The flavors were not familiar to me but good. If you are looking for different flavors then this is a good place to try. The Lo Mein noodles were completely different than anything I have ever tasted. Try it.....you might like it too.", "author": "J O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-04", "description": "I am glad to see this restaurant is doing well with people lining up outside. \n\nFINALLY there is a non Cantonese Chinese restaurant opened in SF besides those spicy sichuan and northern China food.  I say \"finally\" because I am not big into spicy food, and those northern China food usually just good on noodles, dumplings...I like them but need some more variation - a good Chinese dish.\n\nI have been living in SF for 17 years now and am really tired about the very plain taste of Cantonese food which often tastes cheap.  Please do not get me wrong.  I love quality made dim sum and the steam fish done by the Cantonese seafood restaurant.  They do a great job.  However, if you are the immigrant who come from the region other than Canton Province, you know what I am talking about by the plain taste of Cantonese food.  Besides corn starch, black bean sauce and small garlic chunks are added into their dishes, there is no much flavor at all.\n\nSo, you see how happy I am that there is a good Chinese restaurant with Jiangnan flavor opened up in my neighborhood.  My friend and I have visited there three times now and most of the dishes we tried were pleasant.  The portion is a little bit small compared to the Cantonese restaurants, but it is Ok.  \n\nThe \"lion's head\" ($4.95 per piece) is a must try.  It tastes even better with plain rice (true for other meat dishes they have).  For this dish, they do a better job than many Chinese restaurants do in the greater China region.\n\nThe restaurant title in English \"Jiangnan\" means south of the Yang zi Jiang (river), and in general it indicates to the area in the broad southern region.  The title in Chinese is \"Su Wei Guan\".  Su is the ancient title of the province \"Jiang Su\".  \"Wei\" means the taste/flavor.  \"Guan\" here is another word for restaurant.  I like it.  They picked up a nice name.\n\nEverything else is good.  Servers are sincerely friendly, and the kitchen staffs do a good job.  Restroom is very tiny.  So if you are not a petite size, visit a restroom first before you come.\n\nA few suggestions to the restaurant:\n1. Lower the volume of the music - it makes the background too noisy.\n2. Remove the valet use table/desk at the entrance - It makes the entry and exist unpleasant.\n3. Put some cushions on the wooden bench along the wall - too hard to sit on.\n4. Menu - adds a brief intro to your food and its region.\n\n\n* In my opinion, you can find very few nice Chinese food (non Cantonese) in SF.  You need to drive to the south bay to find them.  I called it \"the belt\" region from Mountain View down to Cupertino, San Jose, Milpitas, and up to Union City and Fremont.", "author": "TG B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-09", "description": "It's been a while since I've been inspired to write a review. This place is great. I'm not going down the route of best ever or most authentic place in San Francisco because that's just unnecessary. With all of the Chinese restaurants we have in the Richmond district it's nice to find one that stands out and offers unique flavors for a fair price. At least in my experience,  it's very rare that you find a Chinese restaurant that specializes in braised meats. You can tell a lot of care is taken in the food prep and it appears to be a small family run place, but I could be wrong. I intend to go back to try much of the menu but today I can speak to the braised pork, Mapo Tofu, lions head meatball and the spicy pork. All were spot on.", "author": "John D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-30", "description": "We came here for dinner,the food was so amazing! I recommend ordering the stewed duck in soy sauce（pre-order),  so yummy! The service was good and the atmosphere was clean!", "author": "Chuan Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-18", "description": "Had my first meal there today, a lunch of mapo tofu, which Jiangnan has on the menu as made with chicken. It was super tasty: firm tofu, ground chicken, nice presence of pepper, good heat, all over a healthy serving of rice. It came to ... $4. I left a $2 out of sheer guilt. Can't wait to go back. Maybe as soon as tomorrow!", "author": "OuterLands X."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-08", "description": "Wanted to check out this new place. Great affordable and tasty food! I went for dinner and the portions are generous. I saw their lunch special and can't wait to try it!", "author": "Tina C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-06", "description": "Officially surpassing taste of jiangnan and becoming my favorite place in the Bay Area. I'm requesting more branches/expansion of the restaurant so that I don't need to wait for 1-2 hours every single time.", "author": "Kaiyan Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-05", "description": "Wow, wow, wow.  7 of us ate here last Saturday for lunch--had a wide variety of dishes.  The eggplant was amazing, cabbage with chicken, half duck--the chicken with potatoes was complex with flavor and much more delicious than you might think from the simple name.  The ma po with chicken was great.  Warm welcome and service.  Will definitely come back for more.  Good stuff.", "author": "David J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-29", "description": "Went here during this Memorial Day weekend, food was delicious and very authentic. The entire restaurant staff were extremely welcoming and friendly, which made me and my friends feel very comfortable. I highly recommend this place to anyone looking for authentic Jiangnan/Chinese food or just something tasty in general!", "author": "Bonnie C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-19", "description": "This is Suzhou-nese food to be clear, if there's such a category on yelp. I'm from Suzhou China. And to be honest, the food here is pretty close to what I had back in my hometown. The duck dish and the shrimp with special sauce are a must-try.", "author": "Daniel Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-14", "description": "We live in the neighborhood and noticed this recently opened restaurant shares the style of interior design of our other favorite Jiangnan cuisine place on Clement. Today, my mother and I, both native Shanghainese, went there for lunch. We ordered sweet sour ribs, salty pork and green fried rice, and sautéed string beans. All of them are very good! I recognized the manager of the place, whom I saw months ago working at Taste of Jiangnan on Clement. And she told me her team used to train the chef and staff at ToJ but the owner wanted to add other cuisines to the menu, so she and her team left. I am so glad that her team ended up opening this one in our neighborhood! Service is quick and staff very friendly. What I also appreciate about this place is its limited menu. They cook authentic Jiangnan dishes, and cook them well.", "author": "Fang X."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-01", "description": "Had a pleasant experience here! Friendly service, along with tasty food! Their \"homemade meat ball in sauce\", \"maps tofu\", and the \"braised pork\" are a must have here. Overall, would definitely come back to try out other stuff on the menu!", "author": "Annie W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-20", "description": "Wanted to try something local and took a chance on this little place. Very pleasantly surprised!  Very friendly staff.  Good food -- not heavy on sauces or anything greasy. Very flavorful.  Will definitely go back again. It's small and gets busy so be prepared to wait a little or get takeout (saw a number of those.)", "author": "James S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-11", "description": "Wow!! Super delicious! We had the Lion's meatball and could hardly resist licking the bowl. So we didn't ! Then we had the sumptuous duck (half portion without bones plenty for two). Yummy! Finger-licking yummy! Lovely and friendly service. Cannot wait to return. And we shall.", "author": "Tina C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-09", "description": "Great food. Nice atmosphere. Good friendly service. The cousine is south of Shanghai,  rather rich in flavor.", "author": "Ilya K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-22", "description": "This place is very authentic Jiangsu food. Highly recommend for braised pork, boiled cabbage and small rice balls in rice soup.", "author": "Peter L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-11", "description": "Food was great. The wait is little long but the restaurant is small so that is expected. We ordered three dishes and it was all good. Would come again. It can get stuffy since there isn't much air circulation.", "author": "Chung Fai S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-26", "description": "Just came back from visiting this particular region in China. The food at this restaurant is the closest I've had to what's over there. The service was warm and friendly. The mapo tofu and home made meatballs are excellent. Overall price was reasonable too. This is definitely a new gem in the outer richmond.", "author": "M B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-07", "description": "The restaurant is small. The menu is simple but the taste is exceptional. We like the tofu soup with very silky layered tofu, tender lions head, great duck with soy sauce, rice soup with shrimp and chicken meat, etc. We'll certainly goo back. \nThe parking is very difficult. You could be waiting for you table for a long while.", "author": "Steve W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-18", "description": "A small restaurant, just big enough to feel the mom n' pop shop's warmth.  Food is authentic and well done.  We ordered too much for the four of us, which is a happy accident.  I love having enough leftovers to not have to cook the next night.  Lion's head was tender and juicy, a winner with the kids.  The portion of the braised shrimp was generous to say the least---this would have made sense in the real Jiangnan, where river shrimp are small, so when you spoon them up and dip them in vinegar, you can easily fit 5-6 in one bite.  We have bigger shrimps here, so the dish seems, massive, when it's pretty much nothing but shrimps, all 30-40 of them.  Wuxi wonton was perfect, in both the subtle umami taste of the broth and the silky wonton skins.  One of my favorite was the spareribs.  Something so pedestrian, something that you seem to able to master easily at home, but actually rarely done so well, with the perfect blend of sweet and tang, fat and acid.  Strings beans and rice cakes with mustard green were good too. But I think any decent Chinese restaurants would have made them quite well.", "author": "Candice B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-21", "description": "Loved this place! We had shrimp in Maggie's sauce, the meatball, vegetable rice with salted meat and mapo tofu. Everything was excellent. The meatball was a lovely surprise - very juicy, rich and perfectly sauced. The mapo tofu was as good as I've ever had it. The tofu itself was wonderfully fresh and just perfectly textured. The other two dishes were excellent as well. The giant shrimp were perfectly cooked and the rice was a nice alternative to the standard friend rice. Definitely plan on going back!", "author": "Maggie L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-08-19", "description": "Poor service, average food for the price.  We arrived on a Thu (8/17) just at opening and were seated in the front.  We ordered the beef chow mein, eggplant dish, and won ton soup.  We wanted to order green beans, but the server said the quality was poor.  All were $11.99.  Since we expected the food to be spicy, we also ordered a couple of small bowls of rice ($1.25/ea) .  The waitress had some difficulties explaining the dishes to us.  Her helper brought out the chow mein and the eggplant dish first and not the soup.  Finally the soup arrived.  Generally the soup is served first.  There are no condiments on the table such as salt, pepper, soy sauce, hot sauce which are typical of Asian restaurants.  They never brought out the rice.  The food was good to average and is about 20-50% higher than a typical Chinese restaurant.  Of course, people pay the higher price for quality and ambience, but this place didn't have it.  The music was way too loud and we had to ask them to turn it down.  After finishing our meal, we had to wave down the servers to get take out boxes and the check.  People were waiting to be seated and it was crowded at the entrance that one woman leaned against my chair and finally moved away when I looked in her direction.  Unlikely that we would return.  Probably a 2-1/2 star.", "author": "Robert J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-09", "description": "Visited after a large festival in Golden Gate Park - along with many other music lovers and some local regulars.  Kudos to the kitchen for managing the large influx.  Walking through the kitchen to get to the restrooms, I was impressed at the chefs' efficiency in a relatively small space - particularly given the menu's variety.  Only hiccup was that I only intended to order one soup, depending on which of two options could be made vegetarian, and instead both were brought to the table (along with the two entrees and order of  vegetarian spring rolls); too much for two, but I like leftovers.  Best dish was the Wuxi Style Tofu Soup with irregular tender platelets of tofu (instead of the usual cubes), lots of mushrooms, and some nori (and probably not a vegetarian stock); next best was the cabbage dish heading up the Vegetables section of the menu.  The Eggplant without meat was fine though a bit sweet, the vegetarian spring rolls were as expected, and the Xianghai Yang Chun Noodle Soup was good but a little boring.  All of the dishes were served piping hot.", "author": "Peni Soo G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-04", "description": "If you are Shanghinese and miss hometown cooking, you won't regret coming here.  Call to ask about the preorder dishes too.  We ordered 8 dishes.  You could tell the cook had carefully crafted the flavor of each dish.", "author": "Herman Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-31", "description": "One of the best places to eat in SF. I love the duck. All the dishes I have tried are delicious.", "author": "Angela C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-31", "description": "So delicious! Very great restaurant! I come to dinner tonight, I try sweet and sour pork, lion head meatball, braised pork. The food very authentic,  find my childhood memories! Will come more often.", "author": "Cabby S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-06", "description": "This is by far one of the best Jiangnan restaurants in San Francisco. Every dish I've had on the menu has been phenomenal. My favorites are the braised pork with quail eggs, salted meat and vegetable fried rice, and stir-fried tomatoes and eggs. The owners are extremely friendly and knowledgeable about what goes into every dish. One time, we sat way past closing time, but the chef even accommodated us when we decided to add on a last dish half an hour past closing. Make sure to join their WeChat group for discounts during October 2017.", "author": "Andrew W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-16", "description": "OMG. I can't believe I found a place like this. Absolutely love EVERYTHING here. Authentic and simply yummy. The duck needs to be ordered before noon or else it's gone. The ones that appreciate the Jiangnan flavor will understand why it's gone so quick. Because it's soooo good!!! The sauce was not made with loads of starch (to thicken). Instead it's completely made just sauce and sugar. Let me say this again. OMG, I'm so glad I found this place.", "author": "Ji R."}
