{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-28", "description": "Another amazing omakase experience for the books. \n\nFood: fresh. Every single presentation/dish was light and refreshing: seasoning was not overpowering. \n\nService: chef Patrick was interactive and accommodating which made for a relaxing and joyful meal. Jason never let my water glass run empty. \n\nOverall: a must try and a retry: truly yummy.", "author": "Tuuyen N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-25", "description": "My new favorite sushi omakase restaurant in the US! (Definitely top 3 on my list globally). I can't wait to go back again soon. It's difficult to make a reservation to, but totally worth it to book 6 weeks in advance and worth the $. \n\nFirst off, the food was high quality, beautifully made and tasted amazing. The progression of the sushi was also perfectly compiled only making me want more bite after bite. If you prefer traditional edomae sushi, this is one step towards the more westernized/fusion influenced type of sushi restaurant. But not as far as Robin. I personally prefer this type of sushi that is not fully traditional edomae but still doesn't cover the quality and natural taste of the fish with other overpowering sauces & ingredients.\n\nSecondly, service was impeccable. Very attentive. Each chef only serves 4 people so you're not waiting too long and can still chat with the chef. We had chef Jason and he is super knowledgable and easygoing. Highly recommend requesting for him when making a reservation. :) \n\nLastly, the atmosphere is bright, simple, and comfortable. You won't feel crowded or too far from the chef. I like the decor and all the pottery that they display and use for teacups/plates. \n\nThinking about it just makes me want to go back now. Highly recommend!", "author": "Rohenne L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-26", "description": "The best sushi experience SF has to offer.\n\nThe ambiance and aesthetic of ju-ni is calm, quiet, clean. Light wood brightens and opens up the rather small space, which only seats 12 per session.\n\nThere are 3 chefs who tend to 4 patrons each. So you really get a personalized, interactive experience with the chefs. They tell you the type of fish, where it's from, how it's been prepared, and what you can expect from each perfect bite. They truly care about and take pride in their craft and want you to experience sushi in the highest form. \n\nAll of the fish are extremely fresh, so you can taste all of the nuances of each piece. Each piece is prepared right in front of you and preparation varies by the fish's natural flavor and texture. You're not only paying for the best sushi in SF, but for a show, too.\n\n100% will be back.", "author": "Jessica C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-22", "description": "Hands down, the best sushi I've had outside of Tokyo. The omakase was a fantastic, memorable experience - Chef Patrick was very friendly and made the entire experience very easy-going, the food was incredibly fresh and unique from each other (and of course delicious), and the service was great. Yes, the price point is steep but I think it's 100% worth it. I'll definitely be back soon!", "author": "Allan L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-23", "description": "Came here for our anniversary, we were lucky enough to snag a reservation well in advance. The parking can be tough in this area, but I guess we lucked out. \n\nWe did the omakase (obviously) and added the wagyu, uni, barracuda, and requested another otoro with the caviar on top. The sommelier recommended a sake (not sure what it was, but was definitely delicious) that went well with the food.\n\nThis place is not cheap by any standard, but I feel the quality of the food and the service was worth it. Everything (at least most of it) was shipped overnighted from japan, the service was first class, and the ambiance was simple yet elegant. Definitely gonna be back.", "author": "Long C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-27", "description": "Straight up, this place is bomb. Perfect splurge for you and your date if you want a nice quality intimate dining experience. \n\nJason was the man, had a blast. I'll finish this when i find the envelope that lists all the fish I had.", "author": "Aaron C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-18", "description": "Fantastic restaurant. Excellent service and very spacious!\n\nOmakase was wonderful. Food just kept coming and coming! I thought our sushi chef was great as well. Good pacing of the food. Relaxed atmosphere. Felt like Japan. Creative dishes. If you like your fish cooked a bit more, you can also request it and they're happy to do it.\n\nThe fish was incredibly creative and delicious. They come from very notable places like Hokkaido, New Zealand, and Miyakazi.\n\nFavorites (although they were all stellar):\n-Signature salmon roe and monkfish pate truffle: mind-blowing.\n-Crispy eel: never had eel in this way before. I loved it.\n\nI'd recommend you book them asap because they're usually booked at least a month in advance. There are only 12 seats overall and they section people in 3-4 depending on the party.", "author": "Jenny H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-28", "description": "I only leave ratings for restaurants that I would definitely come back to. You can read the gazillion other reviews already on Yelp.", "author": "Meems N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-18", "description": "Every time I think of jū-ni, I feel like crying out of happiness. This is probably the best sushi I've ever had (especially when it comes to omakase) and my mouth waters just from typing this review. My neighbor told me about jū-ni, and it happened to be on Nina Y.'s list of bookmarks too, so we made reservations.\n\nBecause our reservation was so late in the evening, we had a few drinks nearby beforehand. This supplemented our 2 bottles of sake when we arrived at jū-ni. Our chef was Patrick, and I can't remember the name of our waiter, but they were both so sweet and hospitable. Phenomenal customer service experience.\n\nYou can see my Yelp photos for a full list of what we ate, but everything was delicious. The chef tells a story about each of the omakase items, and we were drawn into a 2 hour culinary adventure that I would love to repeat again. We did a few add-on items to our omakase, and it was worth it, but we were so full by the end.\n\nDefinitely a pricey treat, but it's a great restaurant for an anniversary or birthday celebration. Parties of 1 or 2 are preferred since everyone is sitting around the chefs in the middle of the room. Just make sure to reserve spots months in advance. jū-ni isn't for the spontaneous! It's truly for the dedicated, Michelin-star appreciating foodies.", "author": "Stefanie C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-23", "description": "There are only 12 seats here, so the name of the restaurant is Japanese jū-ni, the taste of red vinegar sushi rice is delicious, the size of sushi rice is well combined with the fish fillet, and the details on the fish fillet are good.", "author": "会懿"}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-28", "description": "I've recently been experiencing more omakase in the past couple of years and ju-ni is currently number one on my list. Each nigiri is made to perfection and they just melted into my mouth. I never had so many combinations of flavors from one nigiri and it was pretty mind blowing. I had to chew slowly to savor each bite and experience each individual oralgasm. There wasn't one piece that I didn't thoroughly enjoyed. \n\nThe pacing of the meal was consistent throughout the whole meal. By the time I had finished a nigiri, the chef was already finishing up the next. Each chef has four seating so everyone gets a front row seat to witness the blessing in the making. Our chef Jeff, was very detailed. From making sure each nigiri was consistent for each individual, to making sure our plates were wiped dry for the presentation. Even the other staff were attentive in making sure our glass was refilled and any droppings on the tables were wiped clean.  \n\nThe base price of the omakase is $155 and at the end they provide an a la carte menu. I got the extended omakase for an additional $35 which included the uni and tuna handroll. My only complaint was the tuna was a bit cold. My teeth are generally sensitive when it comes to cold food so I had endure a bit of discomfort, but it was worth it. Overall, I will definitely come here again! Well deserved Michelin Star!", "author": "Renee Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-28", "description": "Okay, this has officially become my favorite sushi restaurant in the Bay Area - I will DEFINITELY come back [once I save up enough money to afford this place again]. \n\nIt is definitely on the pricey side. We got the omakase + extended omakase, and it came to about $240 a person including tip/tax. \n\nRegarding the fish selection, some of the nigiri pieces were AMAZING, I was completely blown away! I'm normally not a huge fan of uni, but their Hokkaido uni was so delicious. However, at the same time, some selections were just so-so. For example, their tuna hand-roll with pickled takuan was somewhat disappointing. I felt like the tuna was a little too cold and would've tasted a lot better at room temperature. Same with a couple of other pieces...", "author": "Angelina H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-18", "description": "I absolutely adore Ju-Ni! The fish quality was out of this world and perfectly seasoned. Many of the dishes had a semi modern twist which really highlighted the fish rather than over power the fish. In other words, it did not feel like it was so dependent on marinades or gimmicks (truffle everything) for flavor but sought to merely complement the natural flavor of the superbly fresh fish. In fact everything from the texture to the flavor profile was so well balanced, I was dreaming about it for days after.\n\nI have been to quite a few omakase restaurants and would put this more along the lines of the best of the best (to me that is wako and ijji.) Ju-Ni was initially known to be one of the more affordable omakase places but its prices have recently increased. I will have to say that you do not get a lot of food for what you pay for... even know every bite was a little bit of heaven. Still, I think we ended up ordering extra pieces and feeling just right after.", "author": "Jocelyn K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-06", "description": "If you're looking for the best fish in town, then look no further. jū-ni still continues to be my favorite dining experience in San Francisco for multiple reasons: it's unreal omakase, the service, and the people behind it. \n\nI went for my fourth time a couple weeks ago and it was as good as the first. It's no wonder that this place has a michelin star because they are able to replicate a wonderful experience every visit. Unique fish, perfectly dressed up and at a perfect pace...bravo! \n\nIf you're willing to pay a hefty price tag for the best fish on the western seaboard, this is your stop.", "author": "Benjamin F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-25", "description": "So I get that I may be a little biased since I am and forever will be a new American fan, and I know that Jū-ni is not \"traditional\" (and I am sure the owner being a cal poly grad didn't hurt:)) but I loved everything about this dining experience. \n\nWent here with my boyfriend for his 30th birthday and from the personalized menus to the intimate dining experience everything was perfect. So much care was put into each piece of sushi, but what we also really appreciated was how fun/ casual it was. Definitely high end experience but not stuffy and uncomfortable. \n\nThe couple next to us was also celebrating a birthday, and of course by the end of the night it was discussions over where the best sushi in sf is/ beers with our chef. Can't recommend enough for a high end omakase experience, especially if looking for something a little more modern/ less traditional!", "author": "Adele T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-05", "description": "We dine back in May 21, 2016.\n\nThe four of us came here to try because all three of them know the owner. I'm just the tagged along that gets all the perks! Buahahaha\n\n- $90 per person\n- Appetizer\n- 12 course Nigiri\n- Owan (soup)\n- Dessert\n\nSupplements: $34 for special nigiri or $17 toro hand roll. They gave it to us as a complimentary since they know the owner. Yay! \n\nThe nigiri, the service, and the ambiance were beyond expectation. We had a grand time and can't wait to come back and visit. Congrats on your Michelin Star!\n\nThank you Jeff and the staffs! I hope you give this place a try. Cheers!\n\nThe simple things in life.", "author": "Owie N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-06", "description": "Finally got a reservation to come here.\n\nSetup: It's chef counter only which is great. Here are 3 chefs each serving 4 people. We didn't get any of the main chefs and the pacing of our omakase was a bit strange because the other couple arrived 15 minutes late so we ended up getting far ahead the other tables but then having to wait for the other couple to catch up. \n\nFood: the fish was incredible. So many oohs and aahs. It was the first time we ended an omakase with eel! Is usually always wagyu. Every piece though was so excellent and the fish really shone through. The only thing I was sad about was that they only serve nigiris unlike some other omakase restaurants where they intersperse some cold and hot dishes. \n\nAmbiance: definitely a little more relaxed with music in the background\n\nOut of the pricier omakases this has to be my top so far", "author": "Laura D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-22", "description": "Ju-Ni provides an outstanding sushi omakase - really fresh fish well prepared by great chefs and really well paced.  There was a certain harmony to the order and type of nigiri provided and the build-up to the last pieces as well as the end of the meal.  Michelin star really well deserved and the meal includes several really outstanding pieces including their signature ikura with shaved ankimo, O-toro with caviar and the shiroyaki. The extended omakase (Hokkaido uni and A5 wagyu) was a nice treat as well.  The fish consommé was surprisingly good and was the perfect dish after the great nigiri line-up. \n\nThe ambiance deserves special mention here - they accommodate 12 guests each seating (2 seatings per night). The restaurant is really spacious, which I appreciate as a big guy.  Service was also exceptional.  It took me two months to get a reservation for 2 (they don't really take reservations for 1). At the end of the meal, they gave you a card which listed all of the fish that was served that night. I thought this was a really nice touch for a memorable meal. Highly recommended and I'm looking forward to my next visit.", "author": "Andrew S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-08", "description": "This review is a year late but I still remember the experience and thought this places deserves the review! This was my first omakase and michelin star experience and it didn't disappoint! It's usually hard to make a reservation here due to the lack of capacity. They only have 12 seats for 2 time slots a night. Luckily, we found a spot only 3 days in advance! The chef did a great job explaining to us first timers about what's in each sushi. The fish are so fresh, and melt in your mouth. This place is also reasonably priced. It's less than $200 per person including tip and beer. I would highly recommend this place!", "author": "Krizia F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-29", "description": "I really really wanted to love ju-ni, but the more I think about it, it's hard for me to call it a 5-star experience.\n\nThe chef was extremely friendly and knowledgeable. And since all 12 seats are counter seats, you can impress your date or your family and friends with an intimate, sushi counter experience. \n\nHowever, my problem was how about half of the pieces were torched. I'd be fine with a few aburi style, but when every single piece was drenched in soy sauce/lemon zest or torched, I just couldn't enjoy the fish. When the total comes to more than $200 pp with drinks/tip/tax, I was expecting more. Also, I was not full by the end of the meal (which rarely ever happens to me at omakase restaurants). \n\nI'm new to the Bay Area and it seems like many people (at least on Yelp) think ju-ni is the best sushi in the area. Maybe I wasn't fully satisfied because I was expecting an edomae experience, but I'm willing to give ju-ni another try.\n\nIf you want omakase with a modern twist and a fun experience (gold flakes on your eel), this is the place for you.", "author": "Crystal K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-21", "description": "Our omakase experience here is one for the books. \n\nOur time at ju-ni's was quite memorable because of our chef, the hospitality, and of course, the food. \n\nIt looked like everyone got to interact with the chef, no matter where he or she sat. The proportion looked like 4 people to a chef. Our chef not only gave us a show preparing the fish, but was also very personable and taught us lots about fish. Pleasure meeting you Chef Jason! \n\nI liked how ju-ni took care of their customers. We were seated on time. Servers were attentive and had plenty of suggestions for sake and wine. It was very kind of the staff to wish us an anniversary on our menus and to send us off with a hand out of the meal course. Small gestures, but great mementos. \n\nThe omakase was just delicious. My favorites were the torched sushi items, so very rich in flavor with a buttery melt-in -your- mouth texture. There was also just the perfect pinch of wasabi on each sushi piece, not too much to burn the tongue and not too little to be underwhelming. The a la carte menu items, like the o toro, is worth getting if you have room left. Dessert consisted of warm tamago and house made genmaicha ice cream with chocolate crumbs. \n\nHighly recommended, Thank you ju-ni!", "author": "Brenda B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-04", "description": "Came here to get the omakase and we added the wagyu.\n\nGoing to pre-fix this by saying this has been the best sushi place I've been to in San Francisco. \n\nAll the fishes are oily and if you're someone that loves the oily/fatty taste of o-toro and chu-toro this is the place for you. Not only do they serve you those, they teach you things like why where you get the fish matters. For instance, fish is best when the water is highly nutrient + water is cold + tough currents. This makes the fish have to work more and that results in a great taste.\n\nFirst place I've had mackerel that was fatty, and I was blown away.\n\nIf you like fatty pieces + curious about what you're eating and why it's so tasty, this is the place for you", "author": "Victor D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-12", "description": "Boyfie surprised me with reservations here and I was SOOOO excited. I was dying to try this place for months and months and finally the stars aligned! Unfortunately, I didn't think it was as AMAZING as people mentioned. Everything was great, but nothing was mind-blowing. I seem to have this issue with omakase... or maybe it's that Japan ruined sushi for me...\n\nThe salad appetizer was so unique and tasty and all the pieces of fish minus the scallop was good. For a 1 star restaurant, I except everything to be top notch, but the scallop had a slight fishiness to it. It really put me off. Something I really enjoyed was the ankimo. I've never had frozen shaved ankimo so it was a pleasant experience. Really enjoyed this piece.\n\nAs for the service, it was A+. We were actually running 30 minutes late because of the parking nightmare, but the chef was really cool about it. We actually ended up finishing before the other diners even though they started 30 mins before us (haha). \n\nThis place is worth a try, but I don't think it's worth $150/pp. I respect the traditional omakase experience of this place, but it just didn't move me :P\n\nTIP: arrive early because parking is horrendous! It took us 45 minutes to find parking.", "author": "Anna M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-16", "description": "Ju-ni actually blew me away. It surprised me how delicious the fish selection was. I love how intricate the flavors were, yet the ingredients were very simple. \n\nMy favorite nigiri piece here was the unagi with gold 24k gold. Most places serve unagi that are frozen then baked, which is pretty good, but ju-ni serves fresh eel. What a difference in the overall texture of this fish. The meat of the unagi was tender but the skin was nicely crisped. I felt kind of bougie eating it with the gold flakes. \n\nMy second favorite would be the O-toro with caviar. It's hard to get the right balance of lemon acidity so that the O-toro doesn't have a strange taste while being charred, but this place definitely aced it! \n\nAll the fishes were super fatty(guess it is the right season of fishes for me) and just really delicious. Ju-Ni has just made my list of top 3 Omakase spots in San Francisco. \n\nThe service was great and I was surprised that even though our chef was young, he was pretty good at the way he made the nigiri pieces. I didn't have a single speck of rice come loose on me.", "author": "Ada H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-20", "description": "I'm a little behind with this review, but it was an amazing experience from start to finish. I love the intimacy of this place. Worth every dollar!\n\nI'll let the pictures do the talking. (Not quite sure why my pictures aren't linking to this review)", "author": "Kaje Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-20", "description": "Best sushi in SF!  Came here for the 2nd time in the past 12 months last week and both times were amazing.  \n\nEach piece of sushi was unique, well balanced, and extremely fresh.  There's 1 sushi chef for every 4 guests so you get your food quickly and it's nice to be able to converse with the sushi chef as every seat is at the sushi bar.\n\nDefinitely coming back!", "author": "Tony C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-28", "description": "I'm in desperate need of a sushi fund. A fund that is specifically used for dining experiences like this. I'm talking Omakase, the whole shabang, the placing buttery, succulent and shiny fish in front of me, THAT kind of experience. I just had jū-ni last night and I could hardly wait to share my experience! Can Jason, the sushi chef, adopt me? I'll clean dishes if that meant I could dine here everyday. I don't think I can ever get tired of this.\n\nI haven't had many omakase experiences, maybe one or two. My favorite spot was a small little place in Alameda called Yume that recently closed for good. The style there was more traditional omakase, meaning mostly fish and very little toppings. It wasn't as fancy as jū-ni was, although Yume's style really allowed the fish to shine on its own. Since coming back from Japan, I was looking forward to the next omakase dining experience and the opportunity to eat delicious fish once again. My friend is known in our group for trying new omakase restaurants every month, so I asked her to bring me to one of her favorite spots. She recommended jū-ni and said that it was the best omakase in the city and she was right, I was not disappointed at all. The experience was impeccable, the servers were friendly and the atmosphere was perfect. It's great to be able to witness the chef prepare each slice of fish, slicing it gently, and adding the toppings ever so delicately, it's really a craft. My friends and I were excited to see Jason, our chef, work and because we were so hungry, it made it more difficult to watch him prepare slices of fish, only to put it away for later. \n\njū-ni is not known for their traditional style of preparing omakase. If anything, this place is one step further away from traditional omakase. They have garnishes and sauces that are added to complement the fish.  Everything I had was delicious, there wasn't any piece of fish where I was like, \"Hmm, I didn't like that.\" Everything was absolutely delicious. Of course all the great things are served at the end of your meal because they're usually more flavorful or fatty, like Uni or Toro. Each piece was better than the one before. Now, let's talk about the best pieces of the night, shall we?\n\nHotate - Hokkaido Scallop, it's sweet and buttery. Hokkaido probably has the best scallops anyways.\n\nHotaru Ika - Baby Firefly Squid, this was the most interesting piece of the night because I've never had anything like it. Squid or Ika usually is white and shiny, quite rubbery, you would never expect it to be this succulent.\n\nHirame - Olive Flounder, I love this fish. The entire bite was perfection and so soft, I really wanted to eat more. \n\nIkura with Ankimo - Salmon Roe with Monkfish Pate. I've never seen it prepared this way. Ikura is one of my favorite things because it's naturally salty so no extra seasoning is required. The way they froze the ankimo and shaved it on top was impeccable. I was expecting it to be crunchy like panko crumbs, but instead, if was fluffy and airy, and so, so creamy. \n\nChu Toro - Medium Fatty Tuna, how can you not enjoy this piece? It's melt in your mouth delicioussssssness. \n\nZuke Toro with Caviar - Soy Cured Toro, probably the best piece of the night. The caviar wasn't overpowering and complemented the buttery torched fish very well. \n\nShirayaki - Fresh Unagi with Gold Flakes, fancy fancy and super flavorful. The unagi was crispy and smothered in sweet unagi sauce. And guuuurl, Jason painted that gold on y'all!! PAINTED. \n\nExtended omakase for $32\nHokkaido Uni, Sea Urchin. I'm telling you, Hokkaido knows what they're doing. Their scallops, their sea urchin, they can GIT IT. If you're not fond of Sea Urchin, it's because you haven't been eating it at the right place. This will surely make you fall in loveeee. All you need is loooove. \n\nTuna Handroll with Pickled Takuan - I love that the chef doesn't chop up the tuna even more, which usually makes it very mushy. It's cut into small cubes initially and he adds the pickled radish and sauce, then carefully folds it repeatedly until everything is mixed in. It's then rolled into a beautiful hand roll. Do not attempt to eat this one in one bite!\n\nReservations are made online at Resy and they provide reminders prior to your meal. They hold your reservation for 15 minutes after, but do try and come on time. There are a total of 12 seats in the house and 3 sushi chefs. Showing up early means you get to chat with the chef and he explains to your group of 4 where the fish comes from. Also, don't be afraid to eat with your hands. Nigiri is prepared as finger food and you should always eat it in one full bite. Flip the nigiri over so the fish touches your tongue first if you can!\n\njū-ni has a Michelin star and it is well deserved. The price is around $155, without the extended omakase, tax or tip. Come prepared to pay the hefty price, but I think if you're looking for an incredible dining experience, then the price is worth! Can't wait to come back!", "author": "Nancy L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-09", "description": "So Ju-ni has been high on my list for \"must try\" in SF for a while now and it had actually been on my constant reservation search list for a few weeks. Was able to book a few months in advance and patiently waited to make my appearance at this new Michelin star awarded restaurant. I have had the opportunity to eat at Kusakabe and Kenzo in the bay area so this would be my third joint and I was walking in with high hopes. The joint itself houses 12 seats which is why the name of the joint is the way it is. I will lay out the warning that this place is REALLY pricey. It is very much in line with Kenzo and it seems to be the trend in SF lately for sushi meals to cost north of $150 per person which personally seems a bit high. Kusakabe is priced a bit more reasonably I think with options to range you under $300 but at Ju-ni or Kenzo it is essentially a requirement to be north of $350 especially if you have any adult beverages. With this said, I will say that this restaurant kills the essentials and is beautiful presentation and delivery of high quality fresh fish. I will say this is probably the best sushi joint in the bay area without a doubt and I loved how it was purely focused on nigiri (perfect for nigiri lovers) rather than doing some mixed dishes like Kenzo or Kusakabe.\n\nLet me focus back on the experience. The restaurant itself has minimal interior décor but it is beautifully done with elegant color schemes and table spots in front of each sushi chef. Each sushi chef has 4 seats in front of you and there are 3 sushi chefs. They have some good sake options again ranging to pretty pricey but I figured yolo at this point and went all in for the experience. The menu itself is straightforward where you get an omakase for $155 per person and then they had the option to add in a two extra nigiri for an extra surcharge of roughly $35. This joint's recipe for success is that they have 90% of their fish come from the famous Tsukiji fish market in Tokyo and the quality is on point. They started the omakase with a cauliflower salad dish that was made perfectly and really unique flavor combinations. After this opening, it was all nigiri and like I said earlier, these guys just crush it. The fish proportion is fantastic to rice, the rice made really well and tasting great with the fresh fish, and great pace to their serving. Each nigiri was made perfectly with an awesome use of garnishes on top such as salt or foie shavings, etc. The start of the show for me was honestly the ikura with monkfish liver shavings on top which was just phenomenal. These chefs clearly know what they are doing and every nigiri piece seemed like a perfect piece made in synched execution. The fishes which required light searing such as the unagi was still perfect and with added touches of gold shavings. The uni was on point and absolutely delicious (although I might give a slight edge to kusakabe's packed Uni). \n\nAll in all, this is THE spot for nigiri if you are a nigiri lover. This place just purely focuses on the nigiri execution and they do it so well. If you can afford the price point, this is definitely the spot to check out but hopefully they lower prices in the future  I know I know.. me just dreaming. Like I said, a great spot that is worth checking out and certainly deserves its michelin star in the SF foodie scene", "author": "Dan M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-11", "description": "If you're looking for a fancy omakase place to eat, this is the restaurant for you! I made reservations through their website about 1.5 months in advance! They're often booked on the weekends, so plan accordingly! We found street parking pretty easily and this restaurant was a little difficult to find because there was no sign on the outside; just look for #101 above the door. \n\nWe ordered the omakase ($125) and added the extended omakase ($46) at the end. This restaurant stands out because of the freshness and uniquess of their food. They don't have typical nigiris here- if you like to try a large variety, this is perfect for you. They also prepare it in ways that are different than other restaurants - like the nigiri with the shaved monkfish liver. It was pretty messy to eat and not exactly my favorite, but it's definitely an experience to try everything here!\n\nThey are super professional here, to the point where I felt a little awkward at times. They always have someone watching in the back incase you need something, and I felt like they were just watching me eat... They will also change your plate if you get something on it, every single time. Even a one little grain of rice. It's nice, but not really necessary to me. \n\nI thorougly enjoyed this experience, but for the price, I thought I would enjoy the food more. There are many omakase restaurants in San Francisco, and in my opinion, this was good, but not the best. For example, their A5 wagyu was not as buttery and soft as I've had it at other places. I recommend this restaurant if you want a large variety of nigiris - not just the classic ones, but the ones you've never tried before!", "author": "Letty H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-08", "description": "A fun birthday dinner - definitely a solid 4 stars.  I'm allergic to gluten and dairy and they were able to accommodate my dietary restrictions. Just a heads up if you have these too, many of their sauces and cured meats have gluten so they will be substituted for the uncured equivalent. Unfortunately they didn't seem to compensate for the flavor well, which is my main critique.  Hot tip: Don't miss the a-la-carte unit at the end :)", "author": "Anastasia V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-11", "description": "What an unforgettable experience. Thank you Ju-ni for serving theeee best Omakase in the city. Chef Patrick, I can't thank you enough for making us feel like we are in Japan again. I'm so picky with sushi and how they prepare and present it, but he mastered that. Every god damn bite is like an explosion in your mouth. I seriously can't wait to go back again. \n\nFew of my favorites were: Kisu Whiting, Ikura with Ankimo, Japanese sweet fish, Uni, A5 Wagyu and the homemade Matcha dessert", "author": "Gwen M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-01-06", "description": "The dishes were good and I liked all of them. My complaint are more of the overall experience specifically the bill. The restaurant sent me a text DAY OF to order the extended menu for an additional $25 for 3 extra pieces. My sis and I decided to go for it, only to be given 2 additional pieces. The owner said the text \"was old.\" OK but why not honor it?   Second the bill came, and we were overcharged $8 more than the quoted $25 price. We were even charged more, than if we would have ordered the 2 pieces separate! A straight overcharge! It was weird. We had to tell the waitress, which she adjusted.  Overall the bill was almost $500 because we had drinks so it seems irresponsible on the restaurants part to not have current pricing and attempt to overcharge, even if it was $8. If you are paying a minimum of $150 per person I expect it all!\n\nAlso at one point the owner corrected our cooks position of the fish as he was cutting it. Shouldn't these sushi chefs all be experts?", "author": "Veronica R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-09", "description": "Seating for 14.   14 nigiri in the chefs menu.  Not sure why it's called 12.  \n\nIt's A small intimate restaurant with pretty phenomenal sushi.  They do have 14 seats and do two seatings a night for a Chefs sushi tasting (omakase).  This included a small salad, 14 nigiri, and a sipping broth, and deserts.  Three chefs prepare the meals and each has their style and personality. \n\nOur tasting included Horsetail Crab w melted butter, Amberjack, scallop, flounder, baby Red Snapper, farm raised Blue Fin Tuna, Plum Snapper, a cucumber, King Mackerel, Japanese Katso, Wild Horse Mackerel, King Salmon, Monkfish liver over salmon eggs marinated in soy and honey, toro with Sacramento Sturgeon caviar.  Also tried some fresh unagi, unprocessed sea urchin, and A5 BMS 12 Miyazaki Wagyu.  Finished with a bowl of Owan (broth).   Also a piece of Tamago (egg custard). \nand an ice cream ball. \n\nBottom line, food is fantastic.  Amazing sushi experience.   Perfect for a romantic or fun date night.", "author": "Marcus K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-06-26", "description": "Not to sound like a snob, but I've tried many different omakases prior to ju-ni's and this just wasn't as mindblowing.... Ju-ni has a very modern take on omakase, so don't expect something traditional. I thought it was okay, for the price which they recently rose to $145 from $125. I expected more with the higher price point and for the fact they have a Michelin Star.. \n\nThe star of the show, which is also their signature dish, was definitely the shaved frozen ankimo/monkfish on top of fish roe. A very pleasant surprise! \n\nSide note: reservations seem impossible to get, but just sign up for notifications on Resy and you'll be fine.", "author": "Annie L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-12", "description": "Great experience & of course, the fish is amazingly fresh and delectable. A bunch of the fishes were flown in the morning of from Japan or Australia. I was impressed with the garnishes of quite a few of the dishes. Things you wouldn't think of to add to  raw fish such as lime or large pieces of salt. Then there were the pieces which were served with gold flecks. WAGYU IS A MUST. You can order a la cart at the end of your meal or have it be part of your extended menu. It was ridiculously delicious and melted like pure butter. So worth (think it costs ~$17). I kinda wish that they were a bit more \"purist\" when it came to serving the o-toro instead of searing it a little. I also applaud the attention to detail and the evident amount of thought put into carefully crafting the menu. \n\nThree chefs serve 12 people per seating. They're all young but don't let that deceive you. Their skill and technique is pro. Love that our chef was more than happy to share his knowledge, answer our questions about food, technique and his career. Service of course was great as expected from a Michelin restaurant", "author": "Mimi T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-02", "description": "I love everything about this place...and I am constantly dreaming about every. single. bite. I came here for my boyfriend's birthday in October and yes, I am still thinking about it. Realized I never wrote a review and I knew I had to share.\n\nEvery single dish was IMPECCABLE. This is seriously my favorite sushi place in SF - and my boyfriend agrees. I will say that this probably isn't what you would call a super traditional omakase place...meaning that the rice and dishes have a bit of a modern take to this. SO if you're looking for a traditional, no frills omakase place - this probably isn't it. BUT I can't recommend this place enough. \n\nThe fish was amazingly fresh and the ratio of fish to rice was perfect. Now, let's talk about that rice. As you'll read from other reviews - it's different but it was superb. The rice isn't actually brown rice, but you'll notice the color is brown. This is because of what they mix the sushi rice with - I believe a soy sauce/vinegar/brown sugar mix. And it is delicious. Again, this isn't traditional but that doesn't mean it isn't fantastic.\n\nThey do have the option for an extended omakase as well as certain dishes offered a la carte. One thing to note here is that not every fish is available a la carte unlike other omakase places/experiences. So keep that in mind!\n\nIt's a small restaurant, quiet and intimate. And yes, it's a bit hard to get reservations. But if you're on the hunt for a fantastic omakase experience, try ju-ni.", "author": "Steph S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-04", "description": "Part of our annual birthday celebration my friend and I decided to go to Ju-Ni to celebrate the big 3-0\n\nWith four people per chef, it is a great personalized dining experience as there is no one else in the restaurant outside of those at the sushi bar. Also, the ambiance is really open and peaceful which helps to heighten the experience \n\nTrue stand outs were \n\nShaved ankimo\nUnagi \nWagyu beef \nScallop Handroll \nFew nigiri's I can't recall but each one was unique, had great texture/flavors \n\nService was top notch both with the chef and the staff...I look forward to seeing him at Robin's \n\nOverall Thoughts\n\nFor $250 after tax, tip, omakase extension and two beers I felt it was good but your dollar can stretch further at other spots", "author": "Eddie W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-31", "description": "This is by far the best omakase experience I've had in SF and I've been to a ton (Wako, Sasaki, Yume, Omakase, Kusakabe, Akikos, etc). \n\nEvery bite was ridiculously good, but my favorites were: Toro with Caviar, Shaved Monkfish Liver with Ikura, and the A5 Wagyu. Jason was an amazing chef and the service was on point.\n\nI just wish it was a bit easier to get reservations...", "author": "Roy C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-26", "description": "Had the opportunity to dine at Ju-ni after speaking to chef Tan Truong over the phone and after a few long attempts on getting a reservation. The meal was no doubt excellent. Watching Geoffrey work and create edible art in front of our eyes was brilliant and remarkable. I enjoyed and had a pleasant conversation with our chef on various topics loosely related to culinary.", "author": "Blueberry P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-08", "description": "I went with my boy friend to celebrate his late 25th birthday and it was a great experience. We used to go to Akkiko's on Bush street a lot but ever since the main chef (I think his name is Jeffery) left and opened his own restaurant Ju-ni, we haven't been to Akkiko's and have been wanting to check ju-ni out. \n\nWe visited Ju-Ni on Tuesday and glad to hear that they got all fresh fish on Tuesday morning. We both did omakase with extended menu (uni nigiri & blue fun tuna hand roll). Everything was fresh and great. I love when the sushi chef dropped those edible gold flakes onto the unagi nigiri. I personally really love torched fish and glad to get multiple pieces of torched fish nigiri. \n\nI will definitely visit again in the future!", "author": "Clare L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-15", "description": "This place destroys my racist-ass stereotype about how non-japanese owned/operated sushi places taste like straight up impostors.\n\nFresh fish, great cuts, clean prep (and clean bathroom when you get home), perfect seasoning, friendly chefs, awesome everything (including soup and dessert).\n\nWhile preparing my second extra order of their signature ikura topped with frozen ankimo shavings, chef: \"I've never had anybody order 4 of these before...\"", "author": "Tian Q."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-18", "description": "Dayammmmmm...if you think you've eaten good food, ju-ni is probably going raise that bar. The restaurant is really small, a chef serves a group of 4, so it's very intimate and they encourage a lot of interaction between the guests and the chef. We skipped on any alcohol in order to do the extended menu - worth it. My favorites of the night were the wagyu and the toro with caviar. Everything is beautiful and delicious. They get most of their fish directly from tsujiki Tokyo fish market. Additionally, there will most likely be a crab staring back at you...they have them fight everyday during prep and the staff then names the winner and loser and make small bets on them. I love spots where the staff seems to have so much camaraderie and uphold little fun traditions.\n\nWith the extended menu, I was stuffed afterward, but I could see many people with a larger appetite feeling like there wasn't enough, so plan accordingly!", "author": "Annie S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-27", "description": "Perfect omakase menu with a fusion of modern techniques and traditional methods of preparation. Can't make it to Japan for sushi? You can get pretty close by coming to jū-ni. They pride themselves with importing 90% of their fish from the world famous Tsukiji Fish Market in Toyko.\n\njū-ni means the number 12 in Japanese. They have two seatings of 12 at 6:00pm and 8:30pm. We came on a Wednesday at 8:30pm and Daniel was our sushi chef and boy he was amazing! Everything he prepared was meticulously shaped and he explained everything very well. My husband thought the entire experience was very personalized. Daniel was especially personable as we got to know his background and enjoyed learning about his love for sushi. Thanks, Daniel! We had a great time!\n\nThe $125 Omakase menu changes regularly, I cannot remember all the fish I had but I got lucky and had some firefly squid which Daniel explained was only available for 5 weeks out of the year! I enjoyed every single piece of the 14 course nigiri. Every piece made my eyes roll back and weak in the knees. It also comes with appetizer, tamago, owan and dessert. You also have the option of getting an extended omakase for $46 with 3 premium items or a-la-carte if you want extra items.  \n\nCome and try for yourself. We had an amazing experience and can't wait to come back again!", "author": "Janny S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-05", "description": "I've never had a more exquisite dining experience in my entire life. The preparations and unique personality infused for each of the 14 pieces of nigiri was divine. I came here with my girlfriend for our second year anniversary and it was arguably the best decision we've made in advance. \n\nThe fourteen pieces of nigiri as part of the March 2018 omakase menu were the following:\n\nKanburi - Wild Winter Yellowtail\nHotate - Hokkaido Scallop\nUme Madai - Plum Snapper \nHirame - Olive Flounder\nSakura Masu - Wild Cherry Trout\nKinmedai - Golden Eye Snapper\nTsuri Aji - Wild Horse Mackerel \nIkura w/ Ankimo - Salmon Roe / Monkfish Paté\nHon Maguro - Sustainable Bluefin Tuna\nShima Aji - Striped Jack\nSawara - Spanish Mackerel\nUmi Masu - Ocean Trout\nZuke Toro & Caviar - Soy Cured Toro\nShirayaki - Fresh Unagi  \n\nThe highlights were definitely the Kinmedai (which was lightly torched on the skin side in order to extract the fatty flavor), the Ikura with Ankimo (literally the best combo I've ever had), Shirayaki (left me speechless) and the Zuke Toro & Caviar. That isn't to say the others were just \"fillers\" -- they were equally amazing and deserving of every second of appreciation, but these four were just what stuck with me after the night. \n\nVery pricey place, but worth every single penny.", "author": "David Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-28", "description": "I didn't have any high expectations about Ju-Ni, but I guess Ju-ni has proven to be better than expected. Once you step inside, you enter into a very modern sushi bar. My girlfriend and I were promptly seated once we checked in. We were then greeted by our sushi chef. Even though our chef was young, he was knowledgable and swift with his technique.\n\nThe best piece of the night for me was the unagi. The unagi was baked perfectly. It had a charred crisp top layer, but tender inside. That was probably the best unagi I've had so far. The 24k gold on top was just a little too much for me. I get it is for aesthetics, but I couldve done without it.\n\nThe Chutoro (medium fatty tuna) with caviar was the right balance of fatty and meaty. The caviar gave it a nice subtle saltiness which wasnt overbearing because of the butteriness of the chutoro. My girlfriend had the Otoro (fattiest part of the tuna belly) and even though that is usually her favorite piece, she liked the chutoro a bit more.\n\nDuring our whole dining experience, the wait staff was quick in refilling our water. The overall experience of ju-ni was great.", "author": "Timothy C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-04", "description": "Wonderful experience at Ju-Ni. The name Ju-Ni means 12. There are no tables in this restaurant, but just twelve chairs that are positioned around a bar-like arrangement. There are total of 3 chefs, thus only 4 customers per chef, which provides more attentive and intimate experience.\n\nFood: Excellent. Most of the fish is sourced from japan. Every piece was delicious and unique in its own way.\n\nAlcohol: mostly sake ( all cold ), some wine and beer. Alcohol is expensive here. Sake ranges from $18 and up per 3oz.\n\nService: excellent. You mostly interact with the chef, but there are also a waiter and a sommelier. Service routines are very well orchestrated here.\n\nAmbiance: pretty good. Minimalistic decor, clean and airy. However it was pretty loud towards the back of the restaurant, mostly from the noise coming out of the kitchen. Not a deal breaker but was distracting at first.\n\nPrice: Expensive. Definitely a $$$$.\n\nExperience: Overall, great and memorable experience, but very expensive. This is definitely a special occasion place. \n\nMoney: Two people with 3 drinks and two extra nigiri came out to be $434 + tip, so you are looking at over $500 for a 18 course meal ( 14 out of 18 are a single nigiri ). The base price is $155 per person.", "author": "Alex P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-21", "description": "It was such a personable dinner experience here! My husband was so excited that he could get a reservation here when someone cancelled because it seems a bit complicated to get a reservation with them.\nI was impressed at how passionate and knowledgeable of the server lady that greeted us and started us off with our sake & wine. They have different flavor sakes here. The restaurant only serves 12 people a day (as so I've heard?). Our chef, Jason, informed us that most or all of their fishes were shipped overnight from Japan and King Salmon was specifically from New Zealand. They serve as a set menu here. The quality of all the fishes were outstanding. I could say that by far, I've never had sashimi that delicious before. My favorite were the Uni (very fresh) and the roll with Monkfish Pate (now this would probably be the most bomb sushi roll I've had in my life). My husband chose an extended menu for us and we tried Wagyu (literally melted in my mouth). Excellent service, I dropped my towel/napkin and the server was like a ninja, came to scoop it real fast before I could even reach it from the floor and replaced with a new one. Each chef is assigned to prepare sushi for 4 people at a time, which allow him a great amount of time to be very detailed with his presentation. It seems as if the chefs were massaging the sashimi lol. It felt personable to eat here because of the amount of customers they serve at a time. It's a great place to come with your significant other / family and group of friends. If you love sushi, definitely give this place a try!", "author": "Lynn T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-25", "description": "Words cannot begin to describe the experience I had at jū-ni. This was my first omakase and I've been spoiled from here on out.\n\nJason provided an amazing experience with his delicate, precision cuts, and his life story. It made me appreciate the omakase experience that much more.\n\nIf not I could afford the price, I would be going at least once a month! Highly recommend for anyone who loves sushi.\n\nThe A5 wagyu BMS 12 was to die for!", "author": "Patrick L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-15", "description": "What a wonderful dinner experience this was! \n\nMy wife and I were able to snag last minute reservations Mother's Day weekend, probably due to a last minute cancellation, and boy did we luck out! Ju-Ni lived up to very high expectations. \n\nThe menu is simple, and the focus is on unbelievably fresh (usually raw) ingredients, and artful preparation. Each course was beautifully prepared, and tasted great. There wasn't a single bite that we didn't like. \n\nWe also loved our banter with the sushi chef. He started at an all-you-can-eat sushi bar in Florida, and made his way all the way up to becoming a Michelin-starred chef. Wow, what an amazing story!\n\nEach chef is assigned 4 dinner guests, and so all night long, you've got a really great, intimate culinary experience with your chef. \n\nWe opted for the extended omakase ($125, plus an additional $49), and our menu was as follows:\n1) Faro salad\n2) Horsehair crab, miso butter, kelp\n3) Striped jack with grated lime\n4) Hokkaido scallop\n5) Bluefin tuna\n6) Golden eye snapper\n7) Horse mackerel with grated ginger\n8) Ocean trout belly marinated in white soy\n9) Sunomono pickled cucumber\n11) Baby firefly squid\n12) Knife jaw fish with miso\n13) Cured salmon roe with shaved monkfish liver. House specialty\n14) Spanish mackerel with cured kelp\n15) Bonito with grated daikon\n16) Baby red snapper with finger lime\n17) Braised unagi with gold flakes\n18) Hokkaido uni\n19) A5 Waygu. Melt in your mouth amazingness\n20) Tomago\n21) Fish consume with enoki mushroom\n22) Matcha ice cream with cookie crumble", "author": "Erick T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-12", "description": "Going to ju-ni was my best encounter with a true omakase experience.  I was lucky that my BFF got reservations for a group of us and that Chef Geoffrey was our chef for the night.  You definitely feel both classy and casually comfortable here.  It's a very sharp and clean layout and I love how the chef's different stations are spread out.  You definitely enjoy watching your chef expertly prepare your food in front of you, but they are all close enough so you can see some lighthearted fun between the chefs.  \n\nWhile the restaurant is originally set for 12 people, they can easily accomodate parties of 6 at a couple of the chef stations.  I was overly excited and entertained by the food preparation in front of us, with each piece being described in detail on where the fish originated, which were mostly Tsukiji Market, and how we should eat it. Chef Geoffrey's knowledge really shows when it comes to his description of the taste and textures, which makes dining that much more pleasurable. His Michelin star is well earned. \n\nI do hope to go back again. It is expensive, but well worth the price. Make sure to order extras from the a la carte menu too. You will hate yourself later if you pass them up!", "author": "Maria S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-19", "description": "This place is great! It's educational (if you ask questions) and the experience is intimate. The food was creative and delicious! The best omakase I've had. A little pricey but worth it if you have an appreciation for sushi.", "author": "Sharlyn L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-04-19", "description": "Came here with friends. Enjoyed every piece of sushi. Very fresh fish. Chef has great technique and innovative. The fish liver on top of sushi is amazing. \n\nHowever, there is a hair in the wagyu sushi I had. The chef apologized and made a new one.. This is a Michelin star restaurant... I am very disappointed from that aspect.", "author": "Xi L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-02", "description": "I came here for an early birthday dinner with a friend in September. Since it opened, Ju-ni had been first in line on my omakase list of places to try. The menu is reasonable priced at $145 (now $155 starting 2018) for 18 courses, a price that is still well worth it! The sushi chefs are all extremely friendly and personable, making the dinner a very enjoyable experience. Super excited that Ju-ni got its well deserved Star so fast!\n\n[Reservations]\nStart looking a month in advance. I was lucky to find something the week of because a party had canceled, but this is rare. \n\n[Omakase]\nThe Ikura with frozen ankimo shavings is the star of the Omakase. There's no other piece served at any other omakase I've had. It is really unique and was one of the highlights of the omakase journey. The toro is out of this world. I also ordered an extra uni and wagyu piece at the end; however, I wished I had also added on the handroll too. The 18 courses do fill you up pretty well. What I really liked about this Omakase compared to others that I've had is definitely the simplicity behind each piece of nigiri, but the skill behind letting the flavors of the fish resonate without too much wasabi or soy sauce overkill. The technique definitely highlights the skills of the sushi chefs here. Honestly, if they sold tubs of the genmaicha ice cream they give you at the end, my fridge would be full and I would be unable to pay rent.\n\n[Sake] \nJu-ni has an extensive sake menu. They had my favorite sake, the Dassai brand. \n\nOverall, probably my favorite Omakase in the city. Compared to Wako, which is a close second, the experience here is a bit more relaxed and welcoming, as the chefs will engage you in conversation to learn more about you. Makes you feel like you're dining with old friends.", "author": "Alice Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-17", "description": "Came here for dinner one night.  Reservation was made last minute and luckily there was still room.  They only have room for 12 people so spacing is limited.  The pace of the dinner service is nice and the presentation is great.  The host and staff were all very friendly making it a very good experience. \n\nOne thing to be mindful of... parking may not be easy and you may need to walk pretty far... unless you are luck with parking.  I would've uber'd there had I known prior...  But still good experience overall", "author": "Alvin The Chipmun K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-30", "description": "love love love this place. If you have been to Kusakabi, note that this is an entirely different omakase experience. The courses are mostly sushi, with an appetizer, soup and dessert. \n\nI have never had such mind blowing sushi in my life. The last 3 grilled sushi were amazing and highlights of the meal. Also, the a la carte options that come after the omakase is unforgettable.", "author": "Julia C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-28", "description": "As described by Chef Jason, \"It's never a bad day at Jū-ni.\" I suppose there's little to worry about when you're preparing dishes with the world's best available ingredients. I truly am spoiled as this was my first Omakase experience. Watching every piece of fish being delicately handled and sliced with supreme precision. The intimate chef experience was special. \n\nI'm going to abstain from writing about every single course. The big takeaway is everything was amazing! I was most surprised by the mackerel and Unagi. I usually stay away from these dishes at sushi restaurants (freshness is always questionable). The mackerel did not have the traditional oily and overly fishy taste (The thought of it makes me crave seconds). Never frozen Unagi is a rare delicacy I've come to find out. Chef Jason shared 95% of unagi served in restaurants is previously frozen. I anted up for the A5 Waygu. It certainly was a treat but I prefer leaner American cuts of beef. \n\nWould I visit again? HELL to the YES! Chef Jason was amazing and professionally walks you through each course with a descriptive bio for each fish. I will happily cut back on regularly eating out and enjoy this experience again. Dollar for dollar I was not disappointed. Now go ahead and get your fish on!", "author": "Ralph A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-22", "description": "A well deserved Michelin Star.\n\nAs someone who just got back from Japan and has a certain standard for the love of fish, nothing will be comparable but my experience at ju-ni definitely set the bar high for all omakase's in the bay area. Every piece was delicious, fresh and tasty. Each bite was amazing. My favorite pieces were the Toros and Wagyu. Totally recommend adding on the supplement. It won't disappoint. \n\nThe presentation of each piece was exceptional. The gold flakes, pretty awesome! The ingredients paired with each piece was top quality. \n\nOverall experience was just speculator, from the servers to our chef. The experience would be totally different and honestly won't be as amazing if we didn't have CHEF DANIEL. Daniel is personable, has attention to detail and extremely knowledgeable. \n\nNot sure when I will be coming back because reservations are 2 months out. Good luck. Highly recommended. $125 for Omakase and $42 for the supplement.", "author": "Sandy B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-18", "description": "FYI,  omasake is $125 (no longer under $100). Service is superb, food is amazing. \n\nJu Ni uses brown rice (not white) which gives the sushi more texture. \n\nThis $125 includes a unagi nigiri with GOLD FLAKES.", "author": "Dana Z."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-03-14", "description": "3.5 stars\n\nFirst visit here when the menu was less than $100. Second time here and it's at $155 - probably because they got a Michelin star. Fish is still the same, fresh quality. But I told our chef from the beginning that I can't eat wasabi. This has never been a problem before with any other sushi restaurant, regardless if it's casual or higher end. \n\nThree pieces into the dinner, my piece of fish was switched with my friend's so mine had wasabi. The fish went to waste (I spat it out in a napkin and it was left on the table for the entire dinner) and I wasn't offered another one. For my a la carte order, again, uni had wasabi. Our chef was only serving four people, so how did he keep forgetting?...\n\nI wanted to bring my boyfriend here but I can't justify going to a Michelin star restaurant, who charges $155 before supplements if they can't remember something so simple. What if I had a serious food allergy to wasabi?", "author": "N C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-20", "description": "SO BOMB!!! Came here with a group of girls for a birthday and got glasses of champagne on the house to celebrate.  We had a personal chef for our group of four who happily chatted with us and indulged in some crazy while one of my friends dressed up a crab shell throughout our meal.  We had a great experience at this restaurant with melt in your mouth pieces of sushi and excellent execution.  We were the last ones out of the restaurant and each of us left with our bellies full, and thoughts of our return one day.  \n\nPersonal plus: Ayu.  I don't see this at many Japanese places, but having lived in Hon-Atsugi, which holds the annual Ayu Festival, it was a nice addition to an already amazing meal!", "author": "Rachelle T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-23", "description": "There is no sign(?) at front, just the address. The ambiance is simple, sleek, and clean. \n\n2 seatings, 3 chefs, 4 people per chef \n\nThe 14 piece omasake, small salad, dessert, and one cleanser bite went by so quickly given it was over 90 minutes! I was content, I wasn't overly full, I was satisfied BUT still ordered 2 more pieces of nigiri (wagyu beef and toro) at the end. \n\nOmasake $125 pp\na la carte options at the end\nparking - give yourself more time than expected. parking is tricky or just save yourself headache and take a car service. \n\nI was slightly taken back at how the chefs look so young! The temperature of the facility fluctuates and I noticed it often, maybe because I was sitting near the vent but a couple times during dinner I had goosebumps on my arms! Yes I was wearing short sleeves, no I don't run cold, and yes I usually wear short sleeves. Others around me also noticed the change in temperature. It's rather irritating considering you're dining at an expensive restaurant and putting on your jacket in the middle of dinner can appear rude. \n\nIf I really, really needed to critique...please clean glassware away from guest. It is SO distracting.", "author": "Jess W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-28", "description": "1 michelin star \n\nFOOD \nfood was great! I love every nigiri served. I think that their wasabi is really good because it wasnt as strong and killing! It was a perfect balance with the nigiri and i didnt have to ask for less wasabi when i always have to ask in other restaurants! Juni's nigiris were pretty similar to how Robin made their nigiri, but Robin is still more flavorful as they use a lot of other ingredients in the sushi such as fruits, mayonnaise, etc. i love how Juni prepare the fish really well and clean infront of us! \n\nPLACE \nLovelovelove the interior design!!! It felt so fancy amd \"japanish\" \n\nPRICE \nprice is kind of high. Base price is $155 and u can ask for an extended omakase which i opted for. Bill came out to be $300 per person. \n\nLeft 4 starts instead of 5 because there was a hair in my friend's soup!", "author": "Kimberly S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-09", "description": "Great, somewhat contemporary-style sushi worth its price, lovely atmosphere, Michelin star-worthy!\n\nVenue: very sleek and clean look interior that is Japanese-inspired.  Certainly wouldn't have doubts that the place is hygenic and the fish is well preserved.  Grey-white walls with wood counters, this place only has 14 counter seats.  Was a nice touch to add some SF sports team caps as decor in one small area of the space.\n\nService: waitstaff are pretty attentive when it comes to drinks and clearing plates, most likely due to the limited number of customers in the restaurant at a time.  They fill waters quickly and I only had to wave down a waiter one time (they were giving me time to choose a drink and I guess I made my choice quicker than expected).  There are three sushi chefs- 2 of them handled 4 customers, one was working with 6.  They encourage you to ask questions about the sushi, explain each piece as they are serving, and ask that you eat your piece quickly (instead of waiting for others to get their piece).  They also encourage you to take photos.\n\nFood: I must say that I was very impressed with the sushi, and I've been to a lot of places in Japan and NYC that were pretty good!  I enjoyed how the nigiri were clean-tasting in general with few sauces and condiments and letting the fish shine.  One of few places where they encourage you to use your fingers to eat too (they give you a finger towel just for this)!  They only serve omakaze, so those who are picky with their sushi / want to choose their pieces might not enjoy the experience as much.  After the traditional omakaze, they do offer a few more pieces a la carte for an additional cost, though my date and I were pretty satisfied after 18 courses (a salad, 14 nigiri, consume, and dessert).  Surprisingly didn't feel too stuffed afterwards- thought I would have food coma after 18 courses but overall the meal was lighter than expected.  18 courses comes out to $145 per person and they give you a card with a short description of the nigiri eaten at the end of the meal.  We had the following during our meal:\n\n- Cucumber salad\n- Umi Masu (ocean trout)\n- Ikura with Ankimo (Salmon Roe / Monkfish Liver Pate) - most interesting one of the night with the frozen pate shaved over the Ikura\n- Buri (Japanese Wild Yellowtail)\n- Hotate (Hokkaido Scallop)\n- Chu Toro\n- Isaki (Line Grunt)\n- Sawara (King Spanish Mackerel)\n- Zuke Sake (white soy cured King Salmon)\n- Ishidai (Knife Jaw Fish) - one of my favorites\n- Kasugodai (Japanese Baby Snapper)\n- Kindai Tuna (sustainable Blue Fin Tuna)\n- Hirame (Olive Flounder) - another favorite\n- Tsuri Aji (Wild Horse Mackerel)\n- Zuke Toro with Caviar (soy cured Toro with Caviar)\n- Tamago\n- Fish bone and mushroom consume- hands down favorite for my date and me; very clean tasting yet with strong flavors\n- Genmaicha Ice Cream- surprisingly strong tea flavor but delicious!\n\nFor the price, my date and I were very happy with our meal- we both felt the quality matched the price.  It is a bit on the expensive side, but that's the price to pay for great sushi, I guess.  Put it this way- my dad is super picky and traditional when it comes to sushi and I'd be happy to bring him here.", "author": "Audrey H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-25", "description": "Now that's what I call a good meal. It's been a while since I've tried an omakase set that really impressed me, but Ju-Ni definitely managed to do just that.\n\nAll the pieces used high-quality ingredients that provided their own unique, well-complemented flavor. A lot of the less traditional places tend to add items just for the \"fancy\" factor or as mostly pointless garnishes, but Ju-Ni really makes sure each ingredient contributes positively to the flavor and the texture.\n\nAnother plus is the vibe here. I find that a lot of omakase-style places tend to be a bit stifling, but Ju-Ni feels like a much more open environment where it's easier to make conversation with each other and the chef.\n\nFor the price point (relatively low for this level of quality in San Francisco, imo), it's hard to beat.", "author": "Jess L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-30", "description": "Remember how I said KUSAKABE took my love for sushi to the next level? Well, jū-ni took that and multiplied it 500x.\n\nI was lucky enough to able to snag last minute reservations for 6pm on a Tuesday night. (You normally have to book 2 months out!) Both Mike C. and I were running late, but the staff was understanding and allotted an extra 30 minutes for us to get to our seats, which are super spacious by the way.\n\nWhat I loved about jū-ni is that each bite is composed of several different flavors that compliment one other. So, toppings and/or garnishes on every course. I'd say it was even fusion-like, but these accompaniments never took away from the star of the show: the fish. Service was spectacular, too; not only was our sushi chef, Patrick, entertaining, but he was also informative and encouraged us to engage in the experience. (For example, we learned that there are such things as finger limes.) He is seriously da man.\n\nAnyway, ugh. I hate writing positive reviews for places I love, because I know I'm only contributing to the likelihood that even MORE people will be trying to make reservations at said restaurants. Guess all I can do is cross my fingers and hope that I get just as lucky next time!", "author": "Jennifer K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-10", "description": "It's not surprising that Ju-Ni received a Michelin star.  The service and food were top notch.  Parking can be difficult, but nothing arriving early can't fix.\n\nThe cost of the omakase is $118 - appetizer, 14 pieces of nigiri, owan (Japanese soup), and dessert.  Our chef was Patrick who exerted a very calm demeanor.  He described every course and gave us insights on the ingredients he used.  We also chose the \"Ichiro\" sake to compliment our meal, which had an amazing fruit aroma.  After the omakase, we opted for the Wagyu with truffle and the toro from the ala carte menu.  Both items were melt in your mouth good.\n\nThe presentation of some of the nigiri was simple, but the ingredients used to accompany the fish allowed us to enjoy the flavor of the fish.  There's not a lot to be said that hasn't been already.  Their service was on point, food was delicious, and the decor was spot on.  We'd definitely go back.", "author": "Candice H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-06", "description": "We revisited Ju-ni recently since last year visit blown us away. The 2nd time does not disappoint. We went to some notable ones in SF like Kusakabe, Omakase, Wako, Ijji but we like Ju-ni the best. The food/dining experience is really well-done, consistent taste, atmosphere of the restaurant is also modern clean and nice. Most of their fishes are flown straight from Japan. Also, chefs might share  more interesting story like how some fishes are caught by line only, no net, etc. This is modern style sushi omakase (vs edomae) meaning they will use different kinds of secret sauces to enhance the flavors!\n\nYou will get essential fishes like Tuna (different parts), Trout, Scallops, Horse Mackerel, to more unusual ones like Anago/Unagi depending on the season, and Shaved Ankimo (their signature). You can also Opt for the special supplements(after Omakase) like Uni, and melt-in-your-mouth Wagyu sushi, that will send you to sushi heaven momentarily... unless you can afford to order more and more...\n\nFood: 5/5 \nDrinks: there seems to be a good selection of wines and sakes but I'd rather drink hot tea and not mess around with the taste of fishes.\n---\nParking: Street parking no valet, so prepare to drive around looking for spots during busy nights.\n---\nNow, Reservation is absohorritably(absolutely horrible) tough, since this is one-starred michelin and seatings are not a lot, we just happen to get a cancelation notification from Resy, and you have to jump right that second at this very rare chance to have one of the most amazing sushi experience in your life!!", "author": "Reno V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-07", "description": "This place is really delicious.  I have been to two of the one Michelin star omakase restaurants in the Bay Area (ju-ni being a recent recipient) - ju-ni and Omakase.  The two restaurants are a little different but both do a really great omakase.  I would have a hard time telling you which one to pick, but I can provide a brief comparison between the two: \n\nJu-ni currently offers a $118 omakase, which includes an appetizer, a 14 course nigiri, owan, and dessert.  This is different than their previous offering: a $90, 12 course nigiri.  Additional supplements are recommended to this meal on their menu, currently including a trio of nigiri favorites for $37 (zuke chu toro with caviar, shirayaki, and the santa barbara uni), as well as a toro handroll for $16.  Omakase offers a $200 omakase, which includes two appetizers, two sashimi, one yakimono, a 12 course nigiri, and one owan.  Beverages are not included in either of these prices.  \n\nPersonally, I enjoyed my experience at Omakase slightly more, and also felt fuller from the food there but both places are amazing.  Ju-ni ran us about $240 per person (including tax, tip, supplemental sushi and one glass of alcohol each), whereas Omakase ran us about $260 per person - so there is a price difference. I think I liked Omakase more because it felt more traditional, the sushi chefs were all older Japanese men on the night we went who were trained in Japan.  Also, we went for a birthday (a special occasion) and they made it very special for us.\n\nHowever, the difference between the food to me at both places is negligible - both places do a super delicious omakase and will ruin you for other sushi places forever.  Every piece of the 14 course nigiri here is delicious and you see the chef making each piece right in front of you. Our chef also explained what each piece was, and what types of processes went into making each different type of fish - so that made the experience even more enjoyable.  A sample of what's included in the 14 course nigiri: red snapper topped with finger lime, scottish ocean trout with japanese mint, albacore white tuna, house aged halibut with miso, japanese barracuda, baby red snapper with truffle essence, monkfish pate (this was insanely good), bluefin tuna, spanish mackerel.  \n\nWith respect to the supplemental nigiri, I was full when we finished the 14 course, but my boyfriend wasn't.  To me, the sushi was so good that even on a full stomach, I'd gladly pay for more.  I went with the recommended three nigiri supplement, and he got the wagyu sushi and the top-shelf uni (the supplement trio includes the locally sourced uni from Santa Barbara - if you're really into uni).  Out of the supplement and what he got, the two standouts were the shirayaki (which is a type of eel), which was topped with gold flakes - delicious and beautiful!  Also, the wagyu was the most decadent sushi I've ever had - topped with a very generous amount of shaved black truffle. \n\nDefinitely come check ju-ni out. The food is outstanding!", "author": "Lin Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-05", "description": "our first omakase.. so my review may not mean anything to you veterans. BUT! the lovely couple sitting next to us said it was their 2nd time at ju-ni because it's their favorite! & this couple has been to all omakases in the city! with that.. my review is more valid.\n\nour chef was Patrick & he was friendly, chill, & educational. we loved that he was personal. he gave us background info on all the fish he prepared, & he answered all our questions! awesome job Patrick! (: you gave us a great experience. \n\nthe fish was amazing! the rice they use is one of a kind & it compliments all the servings. everything was flavorful & all fish were fresh, buttery, & had that melt in your mouth goodness! \n\nside note: try the wagyu because where else can you try an amazing wagyu nigiri?", "author": "Fatima B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-01", "description": "Wagyu beef is the absolute highlight of the night. I was full already after the standard omakase, but one bite into the wagyu beef--oh boy I felt like in heaven! Perfectly torched beef with a sprinkle of sea salt and drops of freshly squished lemon juice on top-- I could eat at least 3 more pieces of the wagyu nigiri!\nEverything tastes good here. Highly recommend getting the a la carte items!", "author": "Claire K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-06", "description": "fresh food, great service, great sommelier. definitely pricey, but if you have reservations here i think you know what you're getting into. \n\none chef per each group of four, with a maximum of 12 patrons seated at once.\n\nsubtle flavor combinations and such care is put into each bite. i wish i could eat a whole extra round! other than that, not much to say. you'll have to try it.", "author": "Vanessa S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-17", "description": "I've been waiting to try this place. Reservations were hard to get since they only have two time seatings. We booked a month in advance so I can enjoy my birthday dinner here. Ju-ni had a great selection of fresh fish for their omakase. Every piece was prepared nicely. I usually don't like salmon roe, but their salmon roe with shaved monkfish was amazing. I can loudly say that it was my favorite!", "author": "Tiffany C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-04", "description": "So my friends tell me that now that I've been to jū-ni, I'm screwed and I kind of agree lol. I should've gone to more lower rated sushi spots to reallllllllllly appreciate how amazing jū-ni is. \n\nIt's omakase style with four people to a sushi chef. They have two seatings, one at 6:30, and another at 8:30. Dinner is about 2 hours for a 14 course meal. \n\nGeoff, was our fabulous sushi chef and part owner so we definitely felt we got the best of the best experience. Everything was so laid back, casual and friendly, it was like an old friend cooking for us.\n\nThe food. OMG. The flavors and textures, everything complemented each other so well and was so thought out. Their Michelin star is well deserved. \n\nTLDR: Go here now. Sushi omg so good.", "author": "Mandi W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-02-01", "description": "This restaurant serves pretty good food. There was one dish with salmon eggs and monk fish liver on top. Very very good.\n\nBut the attitude of the chef was not very nice. The chef was very arrogant and talked to us as if it was our first time to eat high-end sushi. It was quite uncomfortable. \n\nBy the way, there was no trash can in the toilet. A bit strange set up. \n\nThe art on the wall are not very appealing.\n\nNo place to put/hang my bag nicely at the sushi bar.\n\nSeats too close to the door.\n\nI have to say I liked the food but I'm not coming back because of the uncomfortable eating environment.", "author": "Grace Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-15", "description": "What separates all these omakase places from another when all their fish is sourced from the same tsukiji market? THE CHEF THAT PREPARES THEM. Oh man, our omakase chef was so chill and dope. He was ready with magic as soon as we sat down. The fish itself was excellent, but the seasoning and flavors that accommodated the fish really stood out to me-- especially the yuzu and black truffle. \n\nQuite frankly, the food was excellent, but if it wasn't for our chef, I would have only ranked ju-ni with 4 stars. I think a lot of people forget that the whole point of omakase is to build that relationship with your chef so that he can provide you the best experience possible. Daniel certainly delivered a great dinner (and show.) He talked about his background, what he considers to be good sushi; he even salt-bae'd our wagyu for us! (I'm sorry if more people come in requesting that because of this review.) \n\nEven if you don't, don't be afraid to talk to the chefs, and have fun! They want you to have a great time as much as you do. Just don't be obnoxious or rude, obviously.\n\nEdit: Our Chef left and is now at Robin so I'm demoting a star.", "author": "Chanel C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-03", "description": "Their sushi is delicious, but we couldn't interact with the chef. One chef serve 4 people, he mainly talked to the other couple. It was for my birthday, but nothing special happen over the dinner, no birthday greeting, cake or candle.\nIt's a little disappointed.", "author": "Che K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-06-26", "description": "Whoever gave Ju Ni 1 Michelin Star is clueless! Our  reservation was at 8:30 but was seated at 8:45 p.m. Hostess was dressed very casual, mediocre decor, and all chefs are young and not one of them Japanese. Fish was pre-cut in front my eyes and set aside. Sushi rice was mixed with brown sugar? Are you kidding me? Sushi rice formed into tiny balls, plotted down on a wooden plank waiting for fish to rest on.  Half of our fish was torched leaving a burnt aftertaste in my mouth. Very lemon happy here. Sushi was dressed with a squeezed of lemon on almost all of the fish. Service was friendly but not attentive. No attention to details. Gave everyone a moist towel dish to wipe fingers except us. Gave us desserts and no spoons. \n\nThey make it seem like their restaurant is booked out for 2 months but we were able to get reservation because someone had  \"canceled\" hmmm How can it be booked out when first seating at 6:30 had 4 empty seats and 8:30 reservation had 4 empty seats as well? The couple next to us said the same thing. \n\nNothing spectacular about this place. \n\nOverall sushi: 3 stars\nService: 3 stars\nMichelin: 0", "author": "Tea V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-11", "description": "Great sushi and service. Good selection of fish and range of preparation. Interesting flavors. \n\nProbably second favorite Bay Area sushi place after Sushi Hashiri. Enjoyed more than sushi yoshizumi, omakase, Ijji, Maruya, kusakabe and Hinjata.", "author": "Lu C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-09", "description": "Super simple clean flavors for sushi purists. \n\nSolid 4 after two visits.  \n\nReasons?\n*quality of fish, almost every piece was at the ideal temperature, taste and texture\n*shoyu was so mild, but still had a depth of umami unlike others due to marinating in kelp\n*generous shavings of ankimo over the salmon roe gunkan\n*you can actually TASTE individual ingredients because they harmonize and don't compete\n*white fish consommé was so delicate and lovely\n*pike mackerel, ocean trout and blackthroat were my favorites of the evening\n*genmaicha ice cream with chocolate crumble was a fantastic way to end \n*intimate experience, 1 chef per 4 diners\n*excellent daiginjo by the glass selections, including Dassai 23, I recommend Ichiro\n*focus is on the FISH, a lot of the omakases out there are spending so much time on the menu as a whole, they tend to overshadow the star\n\nImprovements:\n*no oshibori\n*rice was really wet\n*tomatoes in the salad had no flavor \n*A5 had connective tissue, at $16/pc, should be like butter \n\nLooking forward to returning again, but with the way reservations are going now, it's about 2 months out.  I always avoided Chinese-run sushi, the executive chef is Chinese, chefs are Filipino, Korean and Vietnamese, their passion bleeds into the food here.  Future Michelin recipient.", "author": "Cynthia C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-08", "description": "i've been to a couple of ~fancy~ sushi places in the bay now, and i think ju-ni is pretty up there in my rankings.\nshaved monkfish liver was pretty interesting. was also the first time i've had finger limes!! what a weird fruit, but i dig it.\nalso i'm incredibly awkward and my least favorite part of omakase experiences is feeling like i have to be super engaged with the chef or the people seated near us, but the guy we had was really chill so i didn't mind talking back lol. forgot his name though :(", "author": "Christine D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-04", "description": "First of all, great service. Usually, I do not like to consider service but the set-up made it really important. I had a reservation for 2 and we sat with another couple. The 4 of us were cared for by a chef who ensured that we all left as friends. Each course and nigiri was described with history and trivia which was really entertaining.\n\nOverall, the food was fresh and the perfect amount. We did indulge and had 2 extra pieces of nigiri. Sparkling wine selection and beer were small but well curated.", "author": "Elaine L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-25", "description": "Base on my experience at Ju-Ni last 3 times were amazing and such a great experience. Love Chef Jason and Co owner Than, they are so friendly and lovely. The fish is fresh and delectable. A chef serve a group of 4, so its intimate and lot of interaction btw chef and guests with the extended menu, I was so stuffed afterward. Would I visit again??? Yes Yes and Yes !", "author": "Katie E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-20", "description": "Came here to celebrate two of my best friends' birthdays. I'm normally not a big fan of nigiri or sushi omakase, but i loved this experience! \n\nAll the fish were super fresh, the chef added fun ingredients to the nigiri that enhanced the flavors a lot. We 3 had to eat 4 shares of food since our reservation was for 4, so the chef made the rice portion smaller, which was very considerate. \n\nDishes I loved most: unagi nigiri, scallop nigiri, snow crab appetizer. \n\nRemember to make reservations well in advance since this place is super hard to get a booking for!", "author": "Amy Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-03", "description": "I went there with my friend right after I finished my last exam. It was amazing how the chef cut all those fish. the soiled your eyes and tongue. Tuna is not my favorite, but I cannot I imagine I will love tuna there. it's like melting in your mouth. All the Chef and waitress also very friendly. You better make a reservation at least 1 month before you go. \n\nI it so private and like it's named \"Ju-ni\", which means \"12\" in Japanese, they only have 12 seats. Me and my friend almost lost the change, since we were very busy. I hope I can bring my brother here with me!!", "author": "Merry H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-22", "description": "Food: \nIt's not just an phenomenal Omakase dinner, I'd say, it's more like an eye-opening experience of culinary art show, for all of your senses! Each and every course was extremely delicious with well-balanced taste, fresh fish were accentuated by thoughtful touches like cherrywood smoked sea salt, fine lime zest, or a kick of a slice of paper thin garlic. Especially enjoyed the subtle touch from ginger flower, the intense but refreshing scent from the finger lime, and the earthy aroma from the ground black truffle! The ankimo \"shaved ice\" topping was so creative and delicious, as it melt in your mouth, layers of texture and tastes of the monkfish liver and roe blossom like a flower! The Wagyu beef is to die for! Amazing evening! Well-deserved Michelin star! Would love to return for special occasions! \n\nService:\nOur sushi chef, Daniel, is not only an exceptional sushi artist, but also like our buddy, who has an very up-beat personality to make the experience so much more fun and personable! He is also a great sushi educator, who explained different ingredients used in the courses for us with great detail and patience. \n\nAmbience:\nLight hearted modern simplistic decor, private chef for every four guests. Total 12 seats (Ju-ni means 12 in Japanese), pleasant, relaxing, intimate. \n\nRecommendation: \nMake reservation in advance.\nOrder the Omakase with the extended menu~You don't wanna miss the Wagyu! Trust the chefs here, u will not regret. $125 Omakase,  additional $46 for extended menu. The entire experience is worth every penny! \nMeter parking, not too crowded on a Sunday evening.", "author": "Lillian L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-09-18", "description": "Regard to all the sushi, I totally agree with you. That Sushi chef are orginally from Japan is my basic requirement for each FINE dinning restaurant. I doubt how those sushi chefs are able to comprehend the essence of sushi if they were not born in Japan and never immersed in Japanese cuisine since they were young. Furthermore, those chefs excessively rely on torch-grilling and lemon seasoning. They probably try creating a kind of \"Californian Sushi\", but the slightly burnt flavor only damaged the sushi. The worst favourite piece of sushi is added seared eel sushi，which perfectly explained how a torch destroyed a sushi. The mouse was full of burnt flavor and it was hard to chow due to so hot. \nOverall, I am so disappointed with Ju-ni. It was supposed to be perfect if sushi is made in Edomae way.", "author": "Haixing L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-17", "description": "I booked a reservation nearly two months ago for my girlfriend's birthday and the wait was definitely worth it!\n\nFor those looking for a traditional omakase experience, jū-ni is not it. However, if you are looking for a modern spin on nigiri and can appreciate the creativity these chefs display, you will have a great time. We particularly enjoyed the layers upon layers of flavors and grating and freezing certain components of a dish that are typically served whole. \n\nOmakase is required at this establishment. A menu with the Supplement (add-ons) awaits you when you are seated. Towards the end of the 12-course nigiri, your chef will hand you the A la Carte menu. Chef Dan assured us there was no pressure to order the Supplements or the a la carte items, which was appreciated. However, we decided the offerings were too good to pass up even though we were starting to get full; my girlfriend opted for the Supplement (Chu Toro, Shirayaki (unagi), and uni) and I decided to get the O-Toro (the fattiest part of the underbelly of the tuna - absolutely delicious and melts in your mouth instantaneously) and the wagyu, which is the highest grade of wagyu offered. \n\nI won't go into detail about what we ate since the omakase menu varies depending on what is available that day; our chef told us most of their fish is flown in directly from Japan (from the famous Tsukiji Market in Tokyo!) and they receive new shipments twice a week. Chef Dan was the perfect combination of informative and funny, as he somehow managed to crack jokes in between telling us about each fish and the cooking techniques used. He also prepared for us a complimentary dish of tamago and lit a candle on it since he knew it was my girlfriend's birthday - a nice touch!\n\nThe service was also excellent - I don't think my tea cup ever dipped below the halfway point. I also noticed that when a fellow diner left her seat to use the restroom, the hostess immediately walked over to her seat and refolded her cloth napkin. \n\nThe only blemish in our meal for me was that I wish the dessert was something other than the pear served three ways. It tasted good and I did not dislike it, but I would have preferred something like a house made ice cream infused with a savory Japanese flavor, or mochi. \n\nTips:\n-To avoid being late for your reservation, get to the area early so you have ample time to find parking!\n- Order the Supplement and a la carte items! I can't quite lay a finger on it, but there is a little something extra offered in those items.", "author": "Olivia V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-08", "description": "I just keep going back, cuz this is the best omakasa I've had in bay area.", "author": "Ruby H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-13", "description": "I have to say of all the omakase experiences I have got to say this has got to be my favorite places!\n\nIt was a bit hard to get reservations but I looked about a month in a half in advance. And got the 2nd seating at 830. Parking is a bit difficult but it might be a good idea to uber or lyft it there. \n\nWe started off with a asparagus & beet salad, that was delicious! The next part was the 12 piece nigiri. Each one was better than the next but my absolute favorites were the hairy snow crab, the cherry salmon, the house cured medai and mackerel. Quite honestly, I loved all the pieces and there isn't one that I would replace.\n\nAt the end we did add supplements to our dinner which were the waygu with truffle shavings, the chu toro, o-toro, uni, shirayaki and wild halibut! Each one was amazing, I know that they can add up at the end but each one was amazing. Add these on if you are not full!\n\nOverall, we had a great experience with our chef Steve, he was fun to talk to and knowledgable about all the fishes! We will definitely be back in the future for another omakase experience!\n\nTotal for 2: $460", "author": "Stella J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-24", "description": "Nice intimate omakase-style restaurant. Parking is not bad, you should be able to find some street parking. Only 12 people per seating and 2 seatings a day. Reservation is hard, but still do-able. Once they get more popular, I think reservation will be harder. This is the full list of what we get(sushi only):\n- Amberjack\n- Scallops (so good! Sweet and fresh! They overnight it from Japan!)\n- Flying fish\n- Halibut\n- Marinated tuna\n- Blue caledonia prawn\n- Mackerel/aji\n- Blue snapper\n- Bluefin tuna/lean\n- Golden eye snapper\n- Salmon roe with shaved frozen ankimo(never had frozen ankimo before and it works really well with the salmon roe!) \n- King salmon\n------- a la carte -------\nShirayaki /fresh unagi gold flake(very good! Crispy and very tasty!)\nUni(this is our least favorite, doesn't taste as fresh as the other fish we had)\nOtoro(good!!!)\nA5 wagyu(so so so good!!)\nTamago\n\nThey also served us with 2 small appetizer bowls, soup and dessert. I am guessing this place will get a 1 michelin star if they keep up their foods like this. Much better than Wako definitely. Slightly more unique than Omakase and sushi Yoshizumi. Kusakabe is just a note better. We left feeling full and happy!", "author": "Prisilia P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-10", "description": "I wouldn't say I was still hungry after the $90 Omakase with $34 supplement, but I definitely could have eaten more. That said, each piece of sushi was meticulously prepared, albeit on the smaller side, and the ingredients were top-notch. I never wanted the blissful experience to end, and when it inevitably did, we found ourselves hankering for pizza. I guess we could have ordered more sushi, but didn't feel like dropping a grand for our meal. A few additional pieces of nigiri would have been nice.\n\nI'm usually hesitant to recommend sushi restaurants since a lot of people are into shit like Philly Rolls. However, if you are a true sushi enthusiast who enjoys fancy omakase, then this is worth a try. Make your reservation now as the restaurant only seats up to 12 people at a time and is completely booked on weekends for the next couple of months.", "author": "Suany W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-25", "description": "Awesome service and awesome food!! You really get what you pay for! I really don't like raw fish or sushi in general but this place made me want to finish every dish the came out.", "author": "Wendy T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-05", "description": "What can I say that hasn't already been said? I was very excited to try this place as I am a huge fan of Sushi Ran and am generally an all around uppity sushi snob. Ju-ni has a very sleek ambiance and chic space, although parking can be tricky in this neighborhood. Omakase now costs $90 for 9 pieces + appetizer and dessert, but this does not account for the $30 supplement which includes uni, wagyu and toro. IMO, you can't do the omakase without the supplement, but $120 is not bad at all considering the pricing of other omakases in SF. \n\nEvery piece was unusual, delicate and surprising. Generally I feel an omakase will consist of a few amazing pieces, mostly good pieces, and sometimes unfortunately a few average or even bad pieces. But every piece here was wonderful and thoughtfully crafted. Take, for example, the cherry smoked mackerel. Or ikura topped with frozen ankimo shavings. I thought Sushi Ran served an outstanding omakase but this was even better! They do serve a smaller shari proportion but I appreciated the giant slabs of fish I was given and left quite full. Our chef, Steve, was kind and hilarious and very indulgent of my social media addiction. \"When you're ready, I'm ready\" -Steve\n\nI believe reservations are booked solid for weekends three months out but there are still a few weekday spots left. Run, don't walk! Grateful to have gotten to eat here, can't wait to come back. My new favorite omakase!", "author": "Lana T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-10", "description": "Geoff appears to have a hit! This is more than a meal. It's an experience! The knowledge you get about where the fish comes from, type of fish, and the little details about the food is something to be appreciated. The food is as fresh as can be, many (or all) shipped directly from Japan on the daily! \n\nYou know when you've taken a bite and got goosebumps because you just ate one of the best things you've ever had? You'll get at least a couple of these bites here. I got the supplement because the wagyu with black truffle just sounded too good to pass up. Let me tell you, just get it. You have to try this. The fat content is crazy with the strategic use of black truffle. \n\nI've learned that japanese sea salt is amazing on many types of fish. Also, ponzu is a miracle sauce that enhances the flavors of each bite. The care that goes into each bite is amazing and you basically eat here to eat pieces of art. They've got a great beer and sake selection. The beer on the menu will all be from Japan, not the Canada-made Japanese beers you may be used to. \n\nYou can order ala-carte after your omakase meal or just add the supplement. Or do both! I added the shirayaki (fresh unagi) will forever ruin other unagi for me! I also added the O-toro (fatty Kindai tuna) which is the king of all kings. It's like butter! I'm blessed to be able to eat here within the first couple weeks of opening and I'm sure it'll get more and more difficult to get a reservation! There are 12 seats at the bar, so you'd better get on that reservation NOW!", "author": "Aaron Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-10", "description": "They have a michelin star for a reason.\n\nQuick breakdown of this place:\n- Hipster dining at its finest. 12 seats, 3 sushi chefs\n- Excellent and attentive waitstaff\n- 17 total courses including tamago (egg) and dessert (hojicha ice cream omg)\n\nSushi chefs were charismatic and passionate about making the sushi, making sure to create each piece with careful attention to detail. As others have said, they wipe down your sushi block (sorry) after each piece eaten. I won't pretend to know each and every fish that I consumed that night, but I can say that the ikura (salmon egg) with monk fish liver shavings stood out, along with a korean olive flounder, sweet mini shrimp, salmon belly, toro, hotate, mackerel...were amazing. Super hard to secure reservations, so get them early!\n\nPrice after michelin star: $125 base per person", "author": "Andrew C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-14", "description": "It's a little pricey but worth every penny! 10/10 would recommend for any sushi/seafood lover.", "author": "Devin C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-10", "description": "If you're reading this review and just now looking for reservations, it's too late. This place is booked until June! But make a reservation for then because it is ABSOLUTELY WORTH IT! \n\nAfter hearing about Ju-Ni's opening, I quickly went to make reservations but the earliest availability for a weekend was a month and a half later which I grabbed. \n\nEvery 4 people get their own sushi chef, which makes for an intimate dinner. The omakase set includes an appetizer, 12 pieces of nigiri, a soup and dessert. You can add a toro hand roll for $12 (which is mind blowing) and supplements of 3 nigiri favorites for an additional $35 (which you must do) and an a la carte menu is presented at the end of the meal. \n\nThe appetizer consisted of vegetables and a light sauce. Delicate and refreshing, just getting the taste buds warmed up for the meal ahead. \n\nThe first piece of sushi we got was horsehair crab with melted miso butter on top. OH MY LORD. This was a punch straight in the tastebuds. A wonderful start! \n\nA favorite of the night was the house cured ikura with frozen ankimo shaved on top. SO INSANELY AMAZING I wanted to stop chewing so the piece would last longer =(\n\nI won't go into detail with each piece of sushi, but holy moly. Every single bite was skillfully crafted to enhance the flavors in the best way possible and made the perfect bite. As other yelpers have stated, the pieces are on the smaller side, but still delicious. \n\nAfter the omakase, we ordered both the supplement and hand roll. Since I don't eat red meat, I ordered the fresh unagi in place of the wagyu. \n\nWOWWWWWWWWWWWWWWW. The toro hand roll had great textures and flavors throughout it. The kaisui uni tasted like I was eating a piece of the ocean. The toro just melted in your mouth. AND THE UNAGI. Best unagi I've ever had!!! \n\nThe fish consommé at the end was a nice broth. The dessert was house made mochi with a soy sauce glaze. \n\nService was extremely attentive.", "author": "Noelle H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-19", "description": "Reservations are backed up til June and for good reason. This place only seats 12 people (hence the name) and they have 2 seatings a night. It's intimate and the food's amazing. Everyone sits at the sushi bar so you're up close and personal with all the action. To top things off, Geoff, the owner, was our sushi chef! He was super friendly and welcoming. You can tell he takes great pride in his work and that enjoys what he does.\n\nThe omakase ($90) comes with an appetizer, 12 pieces of nigiri, and a delightful mochi dessert. I highly recommend getting the supplemental unagi afterwards. Even if you're full, do it. Trust.\n\nJu-Ni is a serious contender for one of the top sushi spots in the city. Book a table now and start counting down the days!", "author": "Lucy N."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-07-15", "description": "Strictly in terms of sushi taste and quality, it was average high-end sushiya. However, this place is very westernized (serving style, waiters' manner, chefs, interior design, etc), so if you expect to dine a traditional Japanese sushi with authentic Japanese atmosphere, this is not the restaurant to go. As we went in, we asked the waiter to get us hot tea (as you would in Japan), but the waiter insisted that we choose between sparkling and regular cold water. And when the tea finally arrived, it was too hot to grab the cup. Clearly, this restaurant does not know much about tea. And the waiter keep pouring tea to our cup (I guess that's a good manner in a French restaurant) keeping the tea hot and undrinkable. You can't serve like a French in a Japanese restaurant! Well, at least that was our expectation. Anyway, it wasn't a very pleasant experience for me having expected to dine in a traditional Japanese sushiya.", "author": "Mung Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-19", "description": "One of the best omakase experiences I've had so far. This restaurant had been on my 'to eat' list since it opened up last year. I didn't have a chance to try it until my birthday this past January when my BF booked us a reservation. \n\nIf you come in a bit before your reservation time there is a small window area to sit by the check-in desk. The host will take your name and offer you a drink list consisting of wines, beers, champagne, and sake. We came in a little early while the first seating was still there, however we didn't wait long and were seated promptly at our seating time. Everyone on staff is extremely friendly and helpful. We were also luck enough to have the head chef for the night!\n\nThe meal starts off with a salad as an appetizer, a 14 piece omakase, ice cream dessert, and then finally tomagoyaki! If theres still room in your belly for more at the end, they off an a la carte menu before dessert. Each course is planned out by the team ahead of time and they prep each cut right before your meal begins. As each piece is served, the Chef describes the fish, its origin, how its prepared, and so many other details. Their menu ranges from very simple to complex flavors, each one as amazing as the last. My favorite piece of the night is hard to pick, but I must say the ikura nigiri with house made frozen ankimo shavings is hard to deny. The sweet and salty flavors all explode at the same time. There are so many flavors and textures going on you can't focus on one - it's sooo good. Everything was good and I had no complaints. \n\nI also really love the decor and set up on the restaurant. A 12 party seater for intimate dining and conversation. In this day and age social media drives everything and I couldn't help be 'that girl' who is taking a picture of her food. Luckily, the Chefs encourage it! He was describing how their design is meant for that specific purpose. They also wipe down the stone plate between each serving, so everything is aesthetic AF. \n\nThe meal was definitely on the pricey side, but worth every penny. jū-ni offers a real dining experience and I would recommend it to everyone looking.", "author": "Jen V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-17", "description": "I've been here three times and I can't do Omakaze anywhere else!! They've ruined me! In the best possible way.", "author": "Jeremy F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-13", "description": "It was my first time at Ju-ni and everything was just great from the moment we got seated to the time we had to leave. The staff were very attentive and our sushi chef was awesome. Everything that came out was just soooooo good and the fish was sooo fresh, literally just melted in your mouth. My favorite was the soy cured toro & caviar but the salmon roe w monkfish pate was pretty impressive as well. Everything tasted so delicious and I will definitely be going back.", "author": "Esther H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-20", "description": "A nearly perfect nigiri focussed omakase. I've been to 99% of omakase restaurants in San Francisco, and ju-ni is something special. The service is exceptional, the chefs are amazingly skilled but also friendly and down to earth, and the fish is sensational. It is rare for me to find any type of fish I haven't tried elsewhere whether it's here in Japan, but there were definitely a few new items here and each one was expertly prepared. I can't wait to find an excuse to go back. This is my new favorite next to Kusakabe which is slightly different since they focus on kaiseki style omakase.", "author": "Justin G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-25", "description": "This was my first omakase and I must say the bar has been set high for any future restaurants I may experience.  The food and presentation was amazing.  The staff was very polite and was there for any needs we had. I was pleasantly surprised to find \"Happy Birthday\" printed on my menu as well! A big shout out to Head Chef Jeff, Chef Patrick and Sommelier Justin who made the night unforgettable.", "author": "Greg E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-24", "description": "After my amazing experience at n/naka in Los Angeles, I was itching to go for another fancy pants Japanese dinner and when I heard that San Francisco was getting a brand new one in Ju-ni, I had to make a reservation. As it's only been open for a short amount of time, reservations weren't ridiculously difficult, but I still had to wait a couple weeks.\n\nI was slightly disappointed there wasn't a complimentary pour of something sparkling to kickstart the meal. I've kind of come to expect it after dining at some other similar venues like Omakase. Instead, the first course was a salad of rainbow carrots, beets and asparagus. It was tasty... but this is a $100+ meal, it could've had a little something extra in my opinion.\n\nFor the actual omakase portion of the meal, here's what was served:\n\n1. Miso Butter Kegani (Horsehair Crab) - YUM. You get to watch the chef make it right in front of you and with every second that passes, it looks tastier and tastier. This spoonful of tastiness is what should've kick started the meal.\n\n2. Red Snapper\n\n3. Hokkaido Scallop - Pretty generous in size.\n\n4. Bluefin Tuna\n\n5. Ocean Trout\n\n6. Skipjack Tuna\n\n7. Albacore\n\n8. Knifejaw - Interesting texture as it was a bit firmer.\n\n9. Baby Firefly Squid - I didn't expect to like this one as much as I did.\n\n10. Salmon Roe with Frozen Ankimo (Monkfish Liver) - So savory and so delicious. In my opinion, this piece should've been the capstone to the regular omakase menu.\n\n11. Baby Red Snapper\n\n12. Cherry Trout - It was good but kind of an odd one to end on if you don't get the supplement.\n\nSpeaking of which, I highly recommend getting the supplements for an additional $34 as they're obviously the best pieces. Also, the portions here are traditionally small, so you're going to be hungry for more. \n\n13. Seared Toro with Santa Barbara Uni - Very good but doesn't compare to the next two.\n\n14. Kaisui Uni - This made a believer out of me. I've always been pretty OK about uni. I had it at Tsukiji fish market in Japan and liked it and have never been that impressed with it anywhere else. This spoonful of uni brought me back. \n\n15. Wagyu (with optional Black Truffle for $6) - Perfect delicate and savory piece to end the meal.\n\nAll in all, it was a great dining experience though a bit pricey once you add in the supplements. I wouldn't have thought the basic omakase sans supplements was worth $90 plus tax and tip. Adding in the extra pieces, although for more $$$, made it a bit more value-worthy in price.", "author": "Charles L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-02", "description": "I'm ruined for life. Ju-ni is quite possibly the best sushi and service I've ever experienced, and now any sushi just isn't the same. Geoffrey and Daniel are incredibly talented and knowledgeable about fish and the perfect flavors to pair with them. My favorite bite of the night was the ikura with shaved ankimo, the baby barracuda, and the cold smoked bonito. Every fish we had was prepared so beautifully, and sprinkled or brushed with the perfect sauce and flavor enhancements of grated lime, finger lime pulp, truffle, caviar, salt, etc. Omakase was perfectly presented, and every piece of nigiri just got better and better throughout the evening. Daniel took care of me and my buddy, and it was such a pleasure to dine with him. I learned so much about the careful thought that went into the preparation of every piece of fish. Seared, cold smoked, naked, dressed, citrus, alkaline, fatty, clean, sweet, perfect.\n\nThe restaurant seats 14, with two seatings per night. A perfect setting for an intimate Japanese experience with your chef and friends. Tea and water cups are never empty, beverages are filled before they're empty. The living wall and beautiful wood counters brings a bit of nature into the clean contemporary chic restaurant. I can't wait to come back again! \n\nThank you so much, Geoff and Daniel!", "author": "Judy L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-05", "description": "Can I say Ju-ni is one of my favorite sushi places if I've only been once? Honestly, I would go back again and again if getting a reservation wasn't so darn hard. This place only seats 12 people at a time, hence the name \"ju-ni\" (twelve in Japanese). I haven't tried to make a reservation lately but last time I checked, I had to stalk their website for quite a while before a random spot opened up on a Friday night. Omakase used to be $98 per person but since they got their Michelin star, they've raised prices to $125 and now as of 9/5/17, it is $145 per person. WHY, WHY, WHY? Why must they continue to raise prices and make even larger dents in our wallets? Not sure if that $20 spike makes much of a difference given how much I enjoyed my omakase experience when I went. Their menu includes 18 courses which consists of appetizers, nigiris (I think 15 pcs) and dessert. I would try and rate what my favorites were but honestly everything tasted good and the fish just melts in your mouth. As some have commented, ju-ni actually does not use brown rice. I've asked the chef myself and he confirmed that it is white rice mixed with some soy sauce/vinegar mixture which gives the rice its brown color. They also use fish exclusively from Japan which is probably why they charge a premium. Highly recommend and would go back :)", "author": "June Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-05", "description": "When Geoff was at Akiko's, it was my first omakase experience -- haven't been able to turn back ever since! We rented out the restaurant for a friend's bday about two years ago (this review is long over due) and it was fantastic! A couple of the standout dishes: ikura w/ankimo, suke? toro, wagyu nigiri....... Then we came back a year later and it was still delicious! Love you, Ju-ni!", "author": "Kim I."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-13", "description": "So very well deserving of a Michelin star! The omakase here was delicious and very reasonable cost - $118 for 14 pieces, small plates, and dessert. It's the add ons that really hurt the wallet since toro is always a must try at high end sushi spots! We opted for the $37 extra which came with medium fatty toro, unagi, and uni. \n\nMy favorite pieces were the ocean trout, red snapper, scallop, salmon, and mackerel. The unagi was also very unique - the skin is extra crispy which I liked a lot. My sisters favorite was the Hokkaido uni, which she claims is the best she's ever had. To end the meal, we got delicious tea flavored ice cream. I loved how fragrant it was and not too sweet.\n\nOverall I thoroughly enjoyed the experience. It was about $400 total with no alcohol so be prepared to spend. That said I'd rank ju-ni second on my list of best sushi places and favorite in the city so far. Sushi Nakazawa in NYC still reigns supreme. :)", "author": "Sophia H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-19", "description": "Had a wonderful night at Ju-Ni. Chef Jason is very skilled and knowledgeable about sushi. He explained everything in detail and answered all our questions patiently. We will be back on our next trip :)", "author": "Yolanda H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-31", "description": "It's the next day and my mouth is still dancing. Every bite was delicious with ideal accents that hit many different notes. Sweet, salty, buttery, umami. Cool, warm, dense, flakey. Hint of lemon; hint of ginger perfectly paired.\n\nOne of my favorites was their signature salmon roe topped with frozen shaved monkfish liver. Another was the oyster with caviar. And of course the A5 Wagyu beef and the Toro. \n\nDaniel was our sushi chef for the night and he was so affable it really made for an all around wonderful experience.", "author": "Lisa M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-08", "description": "Ju-ni, meaning 12, seats that many people (+ or - 1) and has 3 chefs that serve you 12 course omakase plus any supplements you order.  There are only two seatings a day, and they are booked every Saturday for the rest of the year.  But worry not, they just opened up Sundays!\n\nJu-ni opened when I was pregnant, and I've been dying to dine there since.  For my husband's birthday, we found a babysitter and trekked to the city for dinner, and we were not disappointed!\n\nWe had the 12 course omakase, and we ordered 6 additional pieces.  There was also a salad and crab dish to start, broth to cleanse, and dessert of genmaicha ice cream.  The meal was divine.  We are both sushi fanatics, and quite picky when it comes to omakase, but we were blown away!  Can't wait to be back.\n\nTLDR: highly recommended omakase high-end sushi", "author": "Carol L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-10", "description": "Service: 4.5\nFood: 3-3.5 stars\n\nI respect what they have been trying to achieve here, and it has been working well looking at the good reviews.  My review on sushi here is probably too demanding given that I was born and raised in Japan, and have sushi in TOKYO frequently on my business trips. \n\nRice:  rice here is not cooked to match with fish they serve.  I found rice and fish were fighting each other in my mouth.  My regular place in Tokyo prepares rice based on what the chef serves on that day.  He frequently prepares two kinds or rice and chooses it accordingly.  Perhaps asking to the level of precision would be too much to ask.\n\nFish:  overuse of salt and citrus, which overwhelmed the flavor of fish.  Also I'd like to see fish is sliced right before it is served.  Seeing all the fish pre-sliced and sitting on the board during the course of the meal was somewhat underwhelming.\n\nFish broth:  tasted too fishy and I could not finish it.\n\nPlacement of chopsticks:  there is a certain rule of how to place chopsticks in front of the customer.  Unless your customer is left handed, the chopstick's holding side should be facing right. They were placed in the opposite way when I opened the chopsticks box.\n\nAgain, I found their quality of sushi was comparable to top-tier sushi places in SF.  The above points are raised by benchmarking with sushi in Tokyo/Japan.", "author": "Kahori M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-25", "description": "It's unfortunate for the reviews less than 5 stars. I personally had a wonderful time here for my anniversary. Not only was my chef Steve really fun to be with, but he just made the experience that much more fun. 500 for 2 isn't that bad, yes definitely on the pricier side, but it's not just for the amazing sushi, but for the service and hospitality provided.\n\nI am so happy that they got their first star! Well deserved!", "author": "Mimi T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-26", "description": "I came here for my birthday. It's a very good experience. It's not that traditional but maintains a simply clean environment, so all kinds of people could enjoy it. The part I love is their Omakase focuses on sushi rather than som hot dishes. The service is well good, too. You can still keep some privacy at the sushi bar. It's a good place for date and business.", "author": "Momo W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-25", "description": "Ju-Ni is one of the very best Japanese places you must go in Bay Area. Dining in Ju-ni is a journey where you could connect your soul and your body through every piece of nigiri, where you could gain Japanese culinary knowledge through the mouth and the skill of the chef. As you go through the journey, you could sense how the texture and the mixing of every ingredient create a kick on your tongue, and your body literally shakes and float as a respond to them. What makes this place even more trendy is that the price is affordable as a one-starred Michelin restaurant. Make sure you keep an eye on their website because spots are taken very very quickly!!", "author": "Annabelle L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-17", "description": "Delightful setting with a split of the dining area in 3 parts to ensure each 4 patrons get one chef to prepare a meal. \n\nHard to get reservations, but I was solo, so that got me in on the same night.\n\nDebating between 4 and 5 stars. Because few courses just did not stand out that much. The shaved ankimo over ikura was memorable.", "author": "Anelya S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-07-04", "description": "Ju-Ni is a modern open-kitchen concept personal sushi experience. The interior is clean and simple, resembling a model Ikea kitchen. The chefs meticulously keep their workstations spotless and carefully arranged. Conversation is encouraged between both chef and other patrons as dishes are made at a slower pace. We had a young chef who was very friendly and passionate about his craft. Each section feels like you're at the chef's personal table.\n\nThe food usually had some twist to it, like shaved monk fish liver over ikura, aged yellowtail with lime zest, or miso buttered crab were all interesting. Although, I don't prefer room temperature rice and fish or heavily blow-torched fish. The butane taste overpowers the entire piece of sushi for me.\n\nI thought the non-sushi dishes were just ok. The hummus with salad had a good flavor but seemed out of place. Both the finishing soup and pear dessert dishes did not have as much flavor as I  was expecting. Portions were small and we left just barely not hungry. I was disappointed there wasn't any beer on draft but they had some imported Japanese bottled beer.\n\nWe were really impressed with Kusakabe from a couple weeks before, which made for a tough comparison for Ju-Ni. Although, I'm sure it will still do well and gain a following of foodies.", "author": "Kevin B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-28", "description": "jū-ni popped several of my cherries last night:\n- first time waiting over two months to eat somewhere \n- first time spending that much $ on a meal (please don't tell my mom lol) \n\nWas it well worth it? Heck yeah. \n\njū-ni is an intimate place with three chefs per night and seating for 12. There are two seatings a night at 6:00 and 8:30, so it's understandable that I had to make a reservation two months in advance for a Friday night. Lightweight annoyed (okay, really annoyed) at the people who were before us because we were seated close to 9pm. Hey, I forgive you guys though, cause I'd probably want to stay as long as I can at jū-ni too. \n\nOmakase consists of an appetizer, 12 course nigiri, owan and dessert for $90. Then you have your a la carte menu or supplements (three nigiri favorites) to add-on at the end. \n\nWe opted for the supplements so that's 15 beautiful nigiris total. Highlights/stand-outs/mouth-gasms of the night include:\n\n- Ikura with frozen shaved ankimo: SIMPLY AMAZING. The frozen ankimo melted (literally) in your mouth and was definitely a unique one. My #1 of the night. \n\n- Hotate: flown in from Japan the night before, need I say more?\n\n- Hotaru Ika: First time having squid, so it was 1000x better than I expected. Super soft and tender.\n\n- Kindai Bluefin Tuna: Sustainable bluefin farmed in Japan! Melt in yo mouth delicious\n\n- Kaisui Uni (supplement): I have a confession to make, I really don't like uni. BUT the one here was DELICIOUS. Really light on the usual \"uni\" flavor, but that's probably why I like it so much. \n\n- Shirayaki (supplement): Damn you, jū-ni for ruining unagi for me forever. Deliciously soft, yet crisp and topped with GOLD FLAKES.\n\nOf course, everything else was amazing as well. (With the exception of the dessert, I needed a real sweet fix afterwards lol)\n\nWe sat with Chef Gavin and really enjoyed watching him prepare our nigiri and learning more about all of the fish. I hope we didn't ask too many questions!\n\nI'm giving jū-ni 5 stars because the experience was great overall. However..\n- yeah, like other Yelpers mention, the nigiri is on the smaller side\n- priciest omakase I've ever had.. ~$350 for two with supplements, a beer and tip \n\nBeing my third $$$$ omakase experience, I certainly am no expert when it comes to what to look for. What I can say, though, is that my stomach was happy and my wallet had no regrets. I won't be back anytime soon, because I'd be living in a cardboard box if I did LOL but I'd love to come back again one day. :)", "author": "Laverne N."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-05-11", "description": "You know, I had a great dinner experience there with a lot of great laughs but I wouldn't recommend this place when people ask me about juni. The environment is nice, well renovated by the candy bar owners. The head chef is well seasoned, having have held tenures at akikos and worked with chef kusakabe, which makes me really want to like the place since both are on my favorite SF places for sushi list. However, I just think my friends and I weren't impressed by the omakase with add ons and I can't put my finger on it why. \nWe didn't think our meal was worth the hefty price tag of ~$180 each (1 beer each). You could spend the same amount at Akikos and have the most amazing 15-20 piece omakase there.\n\nThe nigiri pieces are very photogenic at ju-ni and our chef was great, but how do you differentiate good sushi from the best sushi? I think it's the preparation - the sauce, the rice, the fish, and the overall taste experience. We were underwhelmed.", "author": "Joanna S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-07", "description": "I LOVED THIS PLACE. By far, my fave modern omakase place in SF. \n\nReservations were relatively easy if you book in advance. Street parking (we took Bart/Lyft). I loved the concept, environment and setting inside. There are 3 chefs for a group of 4 ppl so it's a little more intimate and personal. The staff was very attentive. \n\nThe food was amazing. It was so diff since they do diff things in terms of prep and combo of ingredients that bring out various flavors without being too overpowering. Delish. I had the regular omakase + extended menu + a la carte. That's how much I enjoyed it. Plus I got to have unprocessed uni for the first time. If you haven't tried it, you should.. it was so yummy. Definitely would come here again. Oh and the prices weren't too bad for this kind of service and food quality.", "author": "L. C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-06", "description": "I first found out about ju-ni in February 2016 when I was taking my dog to the vet, which happens to be 2-3 buildings down. They were still in the renovation stage, but it looked nice, modern and bright, so I was curious as to what was going to take over Candybar's old spot. Fast forward a month, my friend sends me an article talking about ju-ni's anticipated opening and how reservations were already booked 2 months out! For weeks I tried to get reservations, but none were ever available. Fast forward to about 3 weeks ago, I was randomly looking up reservations and BAM one for 8:30 Saturday night! NOTE: They only do 2 services a night, one at 6 p.m. and one at 8:30 p.m.\n\nWe walked into the restaurant, and I immediately felt under-dressed in my denim jacket, crochet tank and leggings...But our chef, Patrick, said there is no dress code (though Yelp says dressy, and most people dressed well. Guys in jeans or nicer pants and button-ups, ladies in a dress or black pants and a nice top). The interior is VERY nice and appeals to a clean, modern aesthetic. All the chefs are dressed in chambray/light blue button-ups, which I thought was cute. \n\nAs I mentioned earlier, our chef was Patrick and he was really great the entire night with answering our questions and just general chit chat. They really encourage an interactive, engaged dining experience vs. the more traditional omakase where the chef is a bit more stern/stiff and you don't really talk. I think this makes ju-ni a great spot for newcomers to the omakase world since the chefs are very informative. The rest of the staff was also very nice and attentive when it came to clearing dishes and filling up our glasses with water. \n\nNow, for the star(s) of the show: the omakase! A majority of their fish is sourced from Tsukiji, which is amazing! If it's not from Tsukiji, then it's locally sourced. As I mentioned earlier, Patrick explained every piece that he made for us and the servers who brought other courses explained those as well. \n\n- Heirloom tomato salad with edamame hummus and corn: Very interesting, but I didn't get much edamame flavor from the hummus. \n- Namahotate - Very smooth, has a nice bite and isn't too mushy.\n- Horsehair crab with miso butter - MELT-IN-YOUR-MOUTH deliciousness. The crab is super creamy and the butter pairs perfectly with how rich it is. \n- Kanpachi\n- Umimasu: Also very delicious~ I'm also very partial to the shiso leaf :P\n- Bincho Zuke: This was one of my favorites, I think this was also the one where they dipped the rice in sesame seeds. Added a nice texture + flavor.\n- Kisu: Another favorite! I liked the more chewy texture of the fish, and the sesame oil was a really nice touch.\n- Cucumber sunomono: Very interesting, I don't normally like bonito flakes but I thought it went well with this dish\n- Shima (?) aji: Not fishy for those who are concerned about mackerel being fishy\n- Halibut (I think, I forget) with it's own intestines as a garnish: Very rich due to the intestines~\n- Ikura with shaved ankimono: OH SUSHI GODS, THANK YOU FOR THIS. This is not traditional nigiri by any means, according to the chef, but SO DARN DELICIOUS. I'm not a fan of ikura as it tends to be too salty and fishy for my tastes, but ju-ni cures their own ikura with soy sauce, I think miso, and then honey. When you put this in your mouth, the frozen ankimono shavings start to melt and it's an amazing sensation of cold to warm.\n- Akami\n- New Zealand salmon (I may be wrong since I don't remember exactly, but it was definitely from New Zealand) topped with finger lime pulp: This was a very \"fun\" piece since the pulp would pop as you chew (well, duh).\n- Katsuo: I always love me some bonito! The texture was firm, but not too firm\n- Fish consumme: I thought this was very light in flavor\n- Genmaicha ice cream + cocoa and matcha crumble: MANY DELICIOUS. It was the dessert's debut, and all I can is YES.\n- Zuke chu toro (supplement): This was seared, though I think it would've been nice to have left it alone\n- Shirayaki (supplement): Freshwater eel with gold flakes (bling bling!). I don't normally like eel, but this was SO good! The top of the eel is broiled, so it's nice and crispy -- something I doubt you see in any type of unagi nigiri. The only bad thing was I bit into a bone, but not a huge deal. \n- A5 wagyu (supplement): We passed on the truffle since we're not huge fans of it (GASP??). The wagyu was rich and buttery in texture, but my piece was a bit chewy.\n- Toro handroll (supplement): I don't really care for toro nigiri (ANOTHER GASP??), but this was good. The pickled radish gave it a nice sour kick.\n\nMy only \"complaint\" is that I felt the fish:rice ratio was a bit off, i.e. not enough rice. \n\nThe bf and I thoroughly enjoyed the food and experience offered by ju-ni. As of now, it is our favorite omakase spot until we can venture out to more. But we aren't opposed to coming back ;D", "author": "Doris K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-25", "description": "Amazing Michelin experience where each nigiri piece was a composition in itself. \n\nI'll let the fish speak for itself, but I do warn sake fans that there is no sake pairing and while the pours are large, the sake is very expensive.  I think by the end of it, our alcohol was almost half the bill.\n\nRecommend getting the extended menu as well! And A la carte if your stomach is as large as mine.", "author": "Zoe H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-12", "description": "Incredible fish and overall experience!\n\nMy friend and I had Roger as our chef and we had an excellent time with him. We learned a lot about the various types of fish and he kept us (and the couple at our station) engaged and entertained all night. It's as if we were all hanging out with good friends!\n\nNow let's talk about the food. We did the tasting and I have to say every single piece of fish we had was fresh and melted in our mouths. Every single one! I have done the omakase at both Kusakabe and Omakase, and of all three, this was the one place where I loved every single thing that I ate. \n\nMy favorites from the tasting were:\n1) Akami (bluefin tuna loin) - Very very simple but still such a standout! This was supposed to be from the lean part of the fish but you would think you were eating the fattiest part - it absolutely melts in your mouth and the flavor is rich!\n2) Roe with frozen shaved Ankimo - never had anything like this and the (generously shaved) frozen Ankimo melted like ice cream - delicious!\n3) Hotate - large piece and melts in your mouth\n4) Bonito - very flavorful fish topped with thinly sliced garlic\n\nI'll admit the tasting alone is not enough so we got 4 additional items, and our favorites were:\n1) A5 Wagyu BMS 12 (highest marbling score) - unlike any other wagyu nigiri I've had, this literally was like pure butter. \n2) Akamutsu (black throat fish) - like a white rock fish topped with its very creamy liver\n\nIn the end this (including a la carte order) was still significantly cheaper than Omakase (almost $100 cheaper per person without alcohol). In terms of the overall experience with our chef, this was by far my favorite over Kusakabe and Omakase. I would say the one thing Omakase had over Ju-Ni was the more fine-dining service and complimentary champagne. However, as far as food, Ju-Ni absolutely blew me away.\n\nDefinitely going back!", "author": "Tanya P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-03", "description": "Wow. Such an incredible experience.\n\nEvery bite was incredible. I want to buy a lottery ticket so I can have a chance of eating here every day.\n\nIt's pricey but 100% worth it.", "author": "Kelly W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-14", "description": "Best omakase I've ever had, very intimate seating with 1 sushi chef per 4 guests. Cannot wait to go back!", "author": "Mark M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-20", "description": "Solid 4 stars. There are plenty of omakase restaurants in the Bay Area and ju-ni is undoubtedly among the top. That being said, I do think there is room for improvement. \n\nThe 12 piece omakase cost $90 but in reality, you will have to spend an additional $35 for the supplements (uni, wagyu, and toro). This concept of \"supplementing\" with arguably the three most delicious nigiri is a smart way of denying you the three most expensive nigiri in the base set. While I found each piece to be fresh and well-seasoned, the portion sizes are VERY small. I was hungry even with the supplements. \n\nMany of the other reviews rave about the house cured ikura with frozen ankimo but it was actually one of my least favorite pieces. The frozen ankimo is relatively flavorless and just leaves a lot to be desired. It's texturally interesting since it feels like snow melting in your mouth but I prefer normal ankimo any day. It's a bit gimmicky. \n\nOverall, I recommend trying this place but maybe pre (or post) game with a burrito.", "author": "Xinxin W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-06", "description": "A well deserved Michelin one star new comer.  Very intimate setting with only 2 seating times and I believe 18 max each time.  My friends and I got the 8:30pm seating and all I can say the fishes were yummy and innovative flavors.  All fresh fish and a good percentage fromJapan.  It was such a good experience watching the chef prepare each fish while just chatting with friends in an intimate setting.  If you like raw fish and looking for an experience, it is worth every dollar.", "author": "James L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-24", "description": "This was my first omakase experience and it was excellent. The restaurant's seating is meant for small groups to have an intimate experience with your chef. Our chef was very helpful going in to detail about what we were eating and how to enjoy it. I couldn't believe how much of the fish they serve is from the famous fish market in Tokyo. The sommelier was not pushy suggesting a pairing option. I wish I could eat like this every night. I will mos def be coming back.", "author": "Rob M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-19", "description": "One of the best new spots for a proper omakase.  Check out my pics.  There is a perfect mixture here of modern innovation and traditional preparation.  For example, you won't find shaved frozen ankimo over ikura at any of the traditional places, but it was a pleasant surprise.  The preparation of the rice and things like saba were very traditional.  It was an interesting mixture of old world and new.  Ju-ni means twelve in Japanese, and that is a recurring theme.  12 seats, 12 pieces.  I would opt for the three piece premium supplement as there is impeccable attention to detail.", "author": "David C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-15", "description": "Women drive men crazy...with their indecisiveness, nagging, and insecurities. I don't want to generalize so I'll say, \"some\" women but I'm sure as hell guilty of all three (and more). \n\nWell, [some] men drive women batsh*t crazy with their selective hearing, inattention to details, and lack of communication. You pour your heart out over text and the dude's response: \"K\" or worse *crickets* - sound familiar? \n\nAttention to detail is everything! My manfriend wanted to get his gf a set of fancy lipsticks and asked me for advice. \"Her favorite color is pink\", he said. \"What kind of pink - baby pink, rose, peachy pink, coral pink, bubblegum, fuchsia, or hot pink?\", I asked. \"IDK, pink IS pink\", he said. \"No, it's not...you need to find out\", I said. He didn't and ended up getting a collection of HOT pink lipstick and glosses. \"Did she like it?\", I asked. She says, she looks like a hooker...she wanted a light pink but \"the hooker look is phuckin' hot\", he exclaimed! \n\nAyeee, men. *SMH*\n\nGeoff and his business partner, Tan left no details unturned at jū-ni, an omakase only restaurant that opened in late February 2016. Everything was custom designed. The sushi bar was designed with a hole for the hangiri (wooden rice bucket) to rest in, the chopsticks and its cover have jū-ni engraved on it, and they even had specially designed spoon holders so you can easily take your food porn with two hands.  \n\nThere's only 12 seats (3 sushi chefs per 4 diners) and two seatings: 6 pm and 8:30 pm. It's reservations only and weekend reservations are booked solid for the next 2 months. Street parking is ridiculous in the area so allot an extra 15-30 minutes to find parking. \n\nThe omakase menu is $90 pp for an app, 12 nigiri, owan, and dessert. There's a supplement and a la carte menu available. Beer, sake, and shochu only. Omakase, supplements + a la carte items, one glass of sake, and one shared bottle of beer was about $220 pp (including tip). \n\nO  M  A  K  A  S  E \n(Sorry for the blurry pics, I had iPhone issues.)\n**App - Beets: http://bit.ly/1SPSWCQ\n(1) Kegani w/ white miso butter: http://bit.ly/1prxuIT\n(2) Shimaaji w/ lime zest: http://bit.ly/1M52isU\n(3) Hokkaido Hotate: http://bit.ly/1V9xmd5\n(4) Sustainable Kindai Tuna: http://bit.ly/1pJ6epi\n(5) Kisu, kombu cured, Japanese sea salt, sesame oil, lemon: http://bit.ly/1Rki2nN\n(6) Katsuo, cherrywood smoked: http://bit.ly/21tqU06\n** Intermezzo - Cucumber, sesame seeds, bonito flakes: http://bit.ly/1YW0zIg\n(7) Albacore Tuna, cured in soy and sake: http://bit.ly/1M52V5G\n(8) Ishidai, miso from whole wheat, shiso, green onion: http://bit.ly/1U4yu2u\n(9) Hotaru Ika, mustard miso, green onion: http://bit.ly/1QUO4d4\n(10) Ikura, soy, sake, honey cured, frozen ankimo shavings: http://bit.ly/1V9ygGj\n(11) Kinmedai, smoked in-house, kombu salt, lemon: http://bit.ly/1RjbbRY\n(12) Sakura-Masu, sakura leaf: http://bit.ly/1RLQ0lK\n**Owan - Fish Bone Consommé: http://bit.ly/1U4z5RL\n**Dessert - Mochi & Azuki: http://bit.ly/1Uwm0Pq\n\nGeoff, the owner was our sushi chef. He was very engaging, informative, and a wealth of knowledge. I was amazed at how he explained each course with such detail; how certain fish were smoked, why the ankimo was freezed at 85 degrees below 0, how the hotaru ika is caught, and etc. \n\nThe menu changes daily, depending on what's available so I won't get into the nitty gritty details but I will say that from start to finish, the fish was incredibly fresh and the progression was on point. Geoff started with lighter fish and moved on to fatter ones. No soy or wasabi is provided, instead each nigiri is artfully adorned with unique accoutrements that best highlight the fish that's flown in from Tsukiji Market. I eat sushi regularly, and it was my first time having miso made from whole wheat, sakura leaf (cherry blossom flavor), and honey in nigiri but it worked beautifully because it was subtle.\n\nThe highlight was the Ikura nigiri topped with frozen ankimo shavings. The honey tempered the pungent saltiness of the ikura and the shavings were like heavenly snowflakes that effortlessly melt in your mouth. My only gripe was the shari. While it was properly sticky and seasoned, it was small so the bill can easily rack up.\n\nS U P P L E M E N T S (\"Nigiri Favorites\": $34 + $6 truffles)\n*Kaisui Uni: http://bit.ly/1R0sK3H\n*Suke Toro: http://bit.ly/1WnJyFh\n*A5 Wagyu, shaved black truffles (similar to Akiko's where Geoff previously worked): http://bit.ly/1MkyLGj\n\nA   L A   C A R T E\n*Akamatsu Blackthroat, its own liver ($8.50): http://bit.ly/21ts2kq\n*O-Toro ($12.50): http://bit.ly/1WnJZPT\n*Shirayaki, 24k gold flakes ($9): http://bit.ly/1UwmV2A\n\nThe supplements and a la carte items were worth the splurge. You can never go wrong with luxurious ingredients like toro, fresh unagi (deliciously crispy around the edges), a5 wagyu, and truffles!\n\nIt was one pricey meal at jū-ni but the entire experience was worth it. I would gladly go back again, and again but first...let me forgo my first born!", "author": "Cherylynn N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-02", "description": "Ju-ni is another solid sushi spot to join the ranks in San Francisco. Ever since Wako, Kusakabe & Yoshizumi earned a Michelin star, I feel like high-quality sushi restaurants have been popping up nonstop in San Francisco within the past 12 months!\n\n\nJu-ni is fantastic for a special occasion experience. Personally, it's too expensive to make this a frequent Go-To sushi spot for me. The prices have already increased again. It is now $90 for the Omakase, but you pretty much feel obligated to get the $34 supplement, otherwise you don't get Uni at all in the normal Omakase.So with that, you're already looking at $130 per person pre-tip, alcohol, tax. We bought a bottle of delicious, crisp and light sake and our meal for two was around $360 out the door.\n\nEach diner gets personalized attention as many have already noted- 1 chef per 4 individuals. I was happy that we came here and they accommodated seating us next to my friend Suany - was fun having the Chef to our group of 4! The fish was of course excellent. Each piece of nigiri was carefully crafted into a bite of amazing-ness.The shari was also delicious but in my opinion, I felt the rice to sushi proportions weren't great. There wasn't enough rice and I felt that each nigiri ended up being super tiny! Ju-ni does offer a slightly more \"fusion\" presentation than An or Yoshizumi. It reminds me a lot of Akiko's- They like to fancy up their nigiri -edible gold flakes and black truffle shavings are part of the $34 supplement. My favorite nigiri was the Ikura with frozen Ankimo shavings - very unique and delicious. The frozen ankimo shavings made for a refreshing bite!\n\nUnfortunately even with the supplement I was pretty hungry later and ordered pizza two hours after. If only the shari proportion was better in each nigiri...\n\nOverall, this is an amazing place for a special occasion - delicious sushi in an elegant sushi bar environment. They are currently booked solid thru June on weekends, but you can still snag a week night reservation!", "author": "Veronica S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-01", "description": "We came here on a Thursday night to celebrate our anniversary. Maybe it has been a while since we dined out without the baby, but it was really a treat for us. The service was, of course attentive and excellent - from the \"Happy Anniversary\" on the menu to my hot water cup never being empty. There was a loud, larger party seated to the left of us in front of the owner, but I tried to tune them out.\n\nOur sushi chef was from Korea and watching him prep the sushi was like a mini show. Everything was really good and fresh. We did end up ordering the supplements. The kama toro in particular was super memorable. We had never had that piece of the tuna kama in nigiri before and it was better, more buttery, with better texture than toro.", "author": "claudia y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-08-15", "description": "I visited ju-ni on Saturday.\n\nWhile I liked some of the dishes and enjoyed the dinner.  It's just not top spot in SF for sushi as Kukasabe and Wako are much better and more reasonably priced.\n\nIssues-\n1.  The rice was slightly over cooked.  But the biggest problem is the rice was too wet.  It also could use a little more vinegar.  Keeping the rice inside rice cooker is probably the dumbest thing you can do.  \n\n2.  Over use of lime on some of the dishes.\n\nI will provide in-depth review on each dish.\n\n1.  Hairy Crab- The hairy crab starter was burnt from being over torched.  Not much flavor except burnt.\n\n2.  Kampanchi- The fish itself was quiet good and flavorful.  But it was over dressed with lime.  \n\n3.  Hotate (scallop)-  The hokkaido scallop was very sweet.  Its a good dish except, there is no flavor from rice.  Would be good sashimi.\n\n4.  Red Snapper- the fish was perfectly torched to bring out the fat sweet flavor, addition of finger lime on top further improved the overall flavor.  This would have been exceptional if the rice flavor can come through at the end.  It just left me want to have a finish and not getting it.  \n\n5.  Aji- too much ginger but passable.\n\n6. Marinade Albacore with sesame- excellent marinade, quiet flavorful with a hint of sesame.  But with rice being soft and soggy, i really wished it has more structure.\n\n7. Salmon with sea salt-  this was disaster.  The fish wasn't cut in right direction and was starting to fall apart.  Its just way too salty.\n\n8. Barracuda with ginger and scallion- the fish itself was not as good as those of Yoshizumi hence after searing, it was not as flavorful.  It would have been saved if the rice is more sour and more flavorful.\n\n9. Ikura with super frozen monk liver shaving- this was excellent dish.  Ikura was not overly salty, addition of monk liver shaving added necessary sweet and bitterness to the dish.  Wonderful.\n\n10.  Madai (sea bream) with peppercorn miso-  the miso was too spicy and strong- ruined perfectly fine sea bream.\n\n11.  Bonito- very disappointed- complete lack for flavor.  \n\n12. Marinade Toro- marinade was excellent (not too salty), searing was good.  But again the rice did not round up the dish.\n\n13.  Uni- decent but not special\n\n14.  Unagi-  the style is same as kusakabe.  But the sauce is too watery and overly sweet.  Killed the Unagi.\n\n15.  Negi-Toro hand roll-  this was another disaster.  Yoshizumi would pre-mix the wasabi, ginger, and scallion before serving.  That way the flavor will be consistent from beginning to the end.  Ju-ni did not do that.  So 3 out of the 4 bite, it was just overwhelming toro fat.  The last bite were the Wasabi was finally present, it was excellent.  Really pissed me off.\n\nOverall- I give this place a 3.5 star (since Yelp don't allow 3.5- it was round down to 3).  This place is very creative with its seasoning.  But couple dishes was over seasoned.  Rice is a big problem here.   There are better places in SF (Kusakabe, Wako).  For what I get, its over priced.\n\nRanking so far- Yoshizumi, Kusakabe, Wako remain top three in the bay area.  Ju-ni is okay, more creative than Ijji.  I will rank Ju-Ni just slightly better than Ijji.", "author": "Jerry W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-09-06", "description": "Not worth the price in terms of food, service, quality, everything. You can find better places elsewhere easily. I would never recommend this place to a friend. Overrated for mediocre food.", "author": "Eunice C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-22", "description": "I don't think there's anything I have to offer about ju-ni that hasn't been said in other reviews, so I'm leaving you with a Spark Notes version of things. \n\n1. Dining at ju-ni is more than a meal-- definitely an experience. Perhaps one of the best of my life!\n2. Chef Geoff is talented, knowledgeable and has a great attention to detail. He's also a unicorn, like myself (native San Franciscan), so already he's awesome in my books. \n3. From the artwork on the walls from a local street artist down to the Japanese imported beer list-- everything is intentional. \n4. The 12-course omakase is plenty of food, but adding the supplement is well worth it. Trust.\n5. Omakase Faves: Ikura marinated in soy, sake and honey topped with frozen ankimo shavings (me- HEAVENLY) and Kisu Nigiri (Mr. Dubs)\n6. Supplement Faves: A5 Wagyu topped with black truffle shavings\n7. Off the Menu: Shirayaki - basically your fancy unagi but soft like buttaaaah.\n8. The fish bone consumme puts a perfect warm happy ending to the savory portion of the meal.\n9. Get your phones ready for lots of live shaving and torching. \n10. This experience will leave your wallet slightly empty, but your bellies extremely satisfied. \n\nThere are only 2 seatings per night and 12 seats in each seating. As Drake so eloquently put it- If you're reading this, it's too late. Make your reservations NOW!", "author": "Tiffany U."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-03", "description": "Ju-ni, located in the NOPA neighborhood, is one of the newest edomae sushi offerings in San Francisco. It recently took over Candybar and is absolutely gorgeous in its decor - white minimalist walls, Heath ceramics, and beautiful wood counters. \n\nThey're still in their \"soft opening\" phase so there are only 2 seatings: 6 PM & 8:30 PM for 12 seats. There's a chef per every 4 people at the sushi counter so the experience is very personalized. Only one of the chefs actually cut the fish, while the other 2 chefs craft the actual nigiri.\n\nThe omakase menu is $82 for 12 pieces of nigiri, appetizer, owan, and a small dessert with the option to add on a la carte or additions such as chu-toro and wagyu after your meal. The price point is not bad, especially if you compare it to Kusakabe, Omakase, or other high-end sushi restaurants in SF.\n\nThe fish are flown in twice weekly from Japan, so expect the omakase to change on a regular basis. The other interesting thing is that they don't showcase the fish in cases like most sushi places in the States. The counter is immaculately clean as the chefs prepare the sushi in different exacting ways. \n\nI thought the meal at ju-ni, while good, innovative, and fresh, didn't quite hit home for me as much as Wako or Kusakabe. While our sushi chef was fun, interesting, and clearly trained, I thought the seasonings for some of the nigiri were a tad off, and the fish could have been sliced better. I'm giving them some leeway as I was there during their first week and there is always room for improvement as they perfect their service.", "author": "Kate M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-22", "description": "So san francisco became an omakase hot spot. In the last year, I've been to four of them: Kusakabe, Sushi Yoshizumi, Maruya, now Ju-ni. One by one they've earned their michelin stars (well... maruya lost its star last year), and I think Ju-ni is on track for one pretty soon. They all set a new standard of omakase restaurant. Frankly, $100+ for a sushi dinner sounds expensive, but it will cost roughly the same for similar type of restaurant in Japan!\nI heard about this restaurant at first from EaterSF, I was excited another omakase restaurant shows up in the SF food scene. I wanted my colleague to try it so I made a reservation for 6 people before the restaurant was open. I doubt you can make a reservation for such a large party anymore. I saw a lot of great reviews about this place after the restaurant was opened, so i believed I made a good bet.\nMy reservation was for 830pm. Upon arrival, the previous seating was wrapping up. We were quickly seated after they bused the tables. With great luck we were seated with Chef Jeff, who was the main chef for the restaurant. He's extremely friendly and answered of our questions. One of the thing I appreciate is the chef's knives collection, Jeff was kind enough to show them to me and share his thoughts. The setting of this restaurant is between contemporary, modern, with a hint of traditional. Lots of custom wood work that represent a traditional japanese restaurant, yet the modern touch with cambria counter top. I really like it, i think my kitchen will look like that one day haha.\nWe did the regular menu, plus the toro handroll, and a few other off the a-la-carte menu. I like the run-down of sushi that Jeff orchestrated. Sushi, especially nigiri, is an art, and it was enjoyable to observe and listen to Jeff when he made them. His take on nigiri is a twist of the traditional edomae sushi, not fusion, just a twist. He adds his ideas into what sushi can be, with more modern techniques and combination of traditional ingredients.\nMost of the yelpers uploaded fantastic pictures of the nigiri, I uploaded a lot too. People exclaimed about the shaved ankimo over salmon roe, it really was fascinating, and I will forever remember it. Overall I do enjoy the dinner, especially they mainly stick with nigiri. I do urge people to try this place before it becomes impossible to make reservations.", "author": "Gary C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-09", "description": "The upscale sushi scene in SF has been blowing up very recently and I was really excited to come here as I had heard great things and been wanting to try it since it first opened.  Boy did it not disappoint!  Here's a quick breakdown of all the parts that helped make it a great meal from start to finish:\n\nDrinks:\nOscar was very friendly and knowledgeable about the sake list and even offered unlimited samples of anything we wanted to try (we tried about 3-4 different ones before settling on one we liked).\n\nAmbiance/Service:\nThe service is very on point as they are quick (some might say too quick?) to swap out dishes and silverware and also refill your water (and adult beverages if you so chose).  Daniel, our sushi chef for the night, was the real highlight here though as he is very friendly and was constantly engaged with us throughout the meal.  He also knew everything about each plate inside and out and seemed to take a great deal of pride in it.  \n\nFood:\nOn to the good stuff - I won't get into a list of every single plate that came out as your only options are either the omakase or omakase + extended menu (so the dishes will vary depending on what they've gotten in) but I will say that you should absolutely get the extended add-on 10/10 times =D (this particular night the extended included A5 Wagyu, Zuke Toro topped with caviar and Hokkaido Uni).   There is a small a la carte menu that they give you after the standard omakase with about 8 items (that include the 3 items that are in the extended menu) and of the items not in the extended it seemed like the Toro handroll was a really popular choice (and looked amazing as the person next to me got it and it had huge hunks of Toro topped off with a nice dollop of uni).\n\nAll in all a great meal encompassed within a great experience led by an awesome guide!  I just may have found my new favorite SF sushi joint.", "author": "Aaron K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-11", "description": "Very friendly staff. Best food. Lots of different flavours perfectly balanced and combined. Great quality ingredients! Over all a beautiful experience.", "author": "Elliana F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-28", "description": "Sushi geeks beware, there's a new way to feed your addiction in NoPa. And it's up there with the best of the city. \n\nChef Geoffrey Lee believes in quality and simplicity, and his tasting menu shows it. He takes you on a thoughtful journey up and down the coast of Japan, and each stop flows easily into the next. Chef Lee has some fun gadgets in his kitchen, and he uses them to create surprises of dimension and texture to his sushi dishes (for example: shaved frozen ankimo over roe, the ankimo literally melts in your mouth!). Every component is carefully considered to delight your taste buds but is balanced with the fish it accompanies. \n\nI don't want to give the entire menu away, you really have to come and experience it. The service was great, the sake menu goes wonderfully with the tasting menu. If \"Jiro Dreams of Sushi\" is your jam, and you appreciate the art of sushi and the obsessive qualities of a dedicated chef, then you will not be disappointed when you eat at jū-ni.", "author": "Patricia Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-08", "description": "Ju-ni stands for 12 seats and 12 course Omakase.  They only have 2 serving sessions per night, so reserve seats while you can.  Don't be discouraged if the reservation system tells you there is a 1-2 month wait.  Call in and see if they have available spots.  I was able to get reservations the next day.\n\nThis place brought back memories of Japan's finest sushi spots and did omakase right.  Fish flown straight from tsukiji market, i could easily categorize Ju-ni equivalent to a 1.5 star Michelin level restaurant.  \n\nWe were served by Chef Steve whom had amazing service!  At one point, the customers next to us went to the restroom.  Chef Steve waited til he came back before he seared his sushi.  We ordered the wagyu a5 which was the last cut left and the customers next to us ordered it a few minutes after us.  Our chef discarded the our last batch of wagyu, opened up a brand new package, and served us all from the same batch!  Talk about sparing no expenses for top notch service.  His attention to detail was on another level. And they wipe your serving plate after each serving.  They also tell you exactly what you're eating and where its from.  \n\nWe had started with the 12 course omakase and finished it off with a la carte.  You need to finish the omakase first, before you unlock the a la carte menu.  I highly encourage you to try the best of what they have on the a la carte menu, because thats where the prime nigiri is at.\n\nJu Ni's Executive chef is from Kusakabe and Akkiko, and sommeliers from Gary Danko, their sake was amazing too! The chefs look young, but they definitely know what they are doing.\n\nIf you want to be traditional, they encourage you to eat the nigiri with your fingers and have a small cleaning tray to wipe them between each session.  The one tiny little feedback id give them, is I wish they gave out hand towels to wipe your hands before you start.  (Just something they do often in Japan).  But its no biggie to just go to the restroom.  \n\nAs for the food, well the pictures don't do justice, you have to try it for yourself.  \n\nThe wagyu a5 is a bms 12.  The highest grade wagyu beef with the highest fat content.  Basically its the best of the best at a reasonable price.  It was seared on one side, and slightly flamed on the other.  I added the spring truffle, which doesn't taste like a normal black truffle that everyone is accustomed to.  I probably wont order the truffle next time.  \n\nThe wagyu, otoro, and uni was like BUTTER and melts in your mouth.  The sushi rice was amazing!  Oysters with caviar was amazing! Im sad because every sushi restaurant i go to now will taste like crap.  Ive been spoiled...\n\nSpoil yourself and see what a real omakase experience is supposed to be like.", "author": "Brian J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-03", "description": "The reviews on here so far are pretty on point and I'm here to add to that 5 stars streak! First off, the restaurant decor is superb! It gives you a homey feel and with the bar seatings, it feels like you're sitting at your home kitchen counter. You'll feel exclusive here with it being reservations only and they do not take walk-ins. Restaurant only seat 12 with two seatings each night at 6pm or 8:30pm. You get a chef per 4-6 people and they are very knowledgeable on the fish (ie. Kind of fish, where it's from, how long has the fish been aged, etc.)\n\nThis restaurant is omakase only where it's a set menu and you have the choice to add supplement items as well as some ala carte if you're still hungry. They have a selective list of beer, wine and sake. Staff and chef are friendly and talkative which made the experience above and beyond. Big shout out to Trevor for an amazing dinner with state of the art sushi presentation. Very amazed and very satisfied. Looking forward to be back when the next season starts rolling in with different fish. \n\nWhat are you waiting for? Go make that reservation now!! Oh, and eat with your hands! ;) it's the way to go.", "author": "Nancy N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-12-10", "description": "The 1-star rating is for the fact that this restaurant ran out of the chu-toro in their first seating at 6pm. \n\nAfter the 14-piece omakase, we ordered additional nigiri including the Zuke Chu Toro w/ Caviar and requested for it to be the last piece that we were served to properly finish the meal. The sushi chef said it wasn't a problem. After the other pieces we were served the chef tells us that they ran out of the chu toro. When we look to the left, the other couple were being served the only two pieces they had. That was a slap to the face. We even hear the other sushi chef say that its his favorite piece. F#@%ing great, just want we wanted to hear when we can't have it!\n\nWith this being the first seating at 6pm and with only 12 people total in the restaurant, it was a huge disappointment that there were only two pieces of it left. That's bad preparation. On the menu, it even called out that its a Nigiri favorite, so why wouldn't this restaurant prepare more?!? \n\nAdding insult to injury, this restaurant texts us an hour before our reservation with a \"pro tip\".\n\n\"Take advantage of the supplemental menu, its a perfect ending to your experience. Enjoy!\"\n\nThis actually made us more excited only to be let down in the end. \n\nThe cost of the dinner was to be expected. High end sushi joints like this for two people always range from $400 to $500. But for that price, you better not run out of one of the so-called \"nigiri favorites\".  \n\nWith all the high end sushi restaurants I've been to, I've never been to one that ran out of chu toro or o-toro. I've considered it the best and richest piece and so have many others. At Maruya, I ordered 2 pieces of it after the omakase because Chef Hide prepared it so well. At Sushi Ran, its always my last piece ordered. In Tokyo, I make it clear to every sushi chef that that's the last piece I want to end the meal with. \n\nShout out to our chef, Steve. He was kind and comped us a different piece since they did not have the chu toro. None of the fault was his even though he apologized many times for it. The fault lies with the restaurant's preparation for the night. \n\nI would have considered coming back here but not anymore. I don't want to risk coming back and not getting what I want. I would rather spend $400-$500 at sushi restaurants that I know and trust. \n\nRant over.", "author": "Josemaria G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-08", "description": "The owners executed well. They have a great team of people. It isn't just about food but the presentation and the little details. \n\nFood was delicious. Hands down just have to come in try it. Words can't explain it. \n\nSome a la carte items I recommend \n\nToro tuna handroll\nKaisui Uni\n\nWill try the others next time around and update my review. \n\nThanks chef Steve and rest of the team for a wonder dinner experience", "author": "Lyman C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-20", "description": "My friends took me to Juni for my birthday and we all loved it. The food was amazing and staff was really great. The chef Trevor was extremely knowledgeable about the sushi (where it came from and how the fish was prepped to acquire a specific taste) and was just a great person to talk to. I highly recommend anyone to come here. It's a great new spot, reasonably priced for \"omakase\" and great service. The chef advised us that the menu changes all the time so we definitely want to come back soon (June) since they are booked until then... Lol. He did advise that there are some last minute cancellations so you can get lucky and get a reservation if you check.\n\nI have to admit, everything was amazing but if I have to choose one favorite, it would be the ikura with the shaved monk fish liver. All the fish was amazing but I can't remember the names unfortunate. Just take my word and come by before this place gets a Michelin Star because it will be even harder to get a reservation. \n\nLastly, definitely get the additional dishes. It was soooo worth it. The wagyu with shaved truffle was amaaaazeballs....", "author": "Karen L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-06-17", "description": "From the very beginning, the chef (i think is the owner) was very rude and didnt properly greet and welcome us. This was the same throughout dinner in which he did not show any care and did not bother to ask us how the food was. He, on the opposite, was totally into and cared so deeply about the couple seated beside us. This was the first time i observed double standard. \n\nThe second instance of double standard and the most SHOCKING was at the end when we had the option to order additional a la carte menu. My girlfriend and i both ordered the Kamasu, while my sister didnt. When the chef served both of us, he also did to the couple beside us. However, the couple responded and said they \"didnt order it\". Guess what, the chef said \"its on the house\". WTF? How about my sister? Shouldnt she get one too? I was totally disgusted by his behavior. A restaurant at this calibre should not display preferential treatment. \n\nI dont understand why the chef was rude to us while displaying the opposite to the couple beside us.", "author": "Tim B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-02", "description": "I've been to many omakase spots around the city and I can honestly say that Ju-Ni is one of my favorites. The types of fish, preparation techniques, and presentation are so creative! \n\nThe price tag is very reasonable at $85 per person, but let's be real - you'll want to get the supplements. We ordered all of the supplements and a few additional pieces and never looked back.\n\nThe fatty tuna hand roll, masaba, frozen shaved ankimo over roe, uni, and black truffle shaved over wagyu were some of my favorites. Every piece of nigiri we were served was exceptionally flavorful.\n\nTrevor is such an awesome chef, too! He was happy to talk to us about each piece of fish we were eating and how it differed from common types that were usually served. Fun fact: Ju-Ni is one of the few restaurants in the Bay Area (including French Laundry and Benu) that serves sustainable bluefin tuna.\n\nI know this place is going to get crazy popular really soon, so I'll definitely be back!", "author": "Kelly L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-19", "description": "I've had ju-ni on my list of restaurants to check out. Luckily, my gf was able to snag reservations the day before we went to celebrate the new year - 2017 and rooster to boot. We had a bottle of sake, which had fruity tones and a hint of apple, with our omakase set, priced at $125. We also got the supplement. The bill was expensive but our chef and food made for such a wonderful experience so it was well worth it. Compared to Wako, Kusakube, Akiko's, Pabu, and Omakase, ju-ni is definitely worthy of a fancy night out.", "author": "Chi N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-31", "description": "Omakase in SF, pretty much everywhere nowadays. But Ju-ni is definitely a must-try spot!\n\nThe experience is just fantastic. 12 (ju-ni) courses, all sushi, all fresh, with a personal chef who only serves 4 customers at a time. Our chef was fantastic and he was very aware of our needs and timing of serving. \n\nEvery piece was on point and I would definitely recommend you pony up for the supplement. \n\nAsk for the Tuna Roll...", "author": "Alex K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-14", "description": "I haven't been back in about 6 months.  Again, I really appreciate how they do only sushi counter seating because sitting at a table at a sushi place for omakase really takes away from the experience.  This time around, I had Geoffrey as my chef.  As the owner, he's the most experienced, and he's also very personable.\n\nThey have sake, beer, and wine. We were able to have small tastes of some of the sakes before choosing, and we went with a bottle of the Black Dragon, which I liked - not too dry, not too sweet, no melon flavor.\n\nThe price has gone up slightly since I was last there - now $118 for the omakase. \n\nAPPETIZER:\nRomanesco, beets, dressed in yuzu dressing, served over a dashi cauliflower puree. The dashi cauliflower puree was definitely the highlight - it's flavorful and rich without being super heavy \n\nNIGIRI: (* = favorites)\n1. Kushi oyster sushi: topped with yuzu tabasco, shiso, and caviar \n2. Kampachi: amberjack aged for 3 days, topped with lemon juice and lime zest\n3. Hotate: fresh scallop flown in overnight \n4. Olive flounder: with shiso leaf, green onions, grated daikon, and chili paste - a good mix of flavors, very fresh \n*5. Albacore tuna: marinated in soy and sake, topped with sesame seeds. I loved this and ordered another one at the end of the meal. It may have universally been the favorite in our group\n6. Umi masu: ocean trout from Scotland. It was poached in hot water to bring out oils, and it's definitely very rich and buttery; the shiso leaf underneath helps balance it \n*7. Kinmedai: torched golden eye snapper, cold smoked cherry wood, kombu salt, lemon juice; I like anything torched\n8. Intermezzo: Japanese cucumber with a special cut technique to increase surface area, topped with a soy sesame dressing and bonito flakes \n9. Suri aji: horse mackerel topped with fresh ginger, green onion, and lemon juice\n10. Shiro ebi: baby white shrimp. I really really dislike ama ebi, but this one was actually very sweet, creamy, and not slimy at all - it was surprisingly good\n*11. Ikura: house cured, served with nori and rice, topped with shaved frozen ankimo for lots of textures and flavors \n12. Kindai: farm raised sustainable (guilt free) blue fine tuna \n13. King salmon: from New Zealand with salt cure and a cherry leaf \n*14. Kisu: Japanese white fish cured in kombu, topped with dried tuna flakes, sesame oil, Japanese sea salt, and lemon juice. The sesame oil was not overpowering, and it was a very well balanced piece. \n15. Spanish mackerel: cured with salt and aged vinegar, topped with green onion, ponzu, and grated radish with chili paste\n\nADD ONS:\n1. Kinmedai: torched, topped with crystalized soy sauce, great flavor \n2. Albacore: round 2 - we all had to get another piece \n3. Shiryaki: fresh unagi baked, topped with gold flakes, served warm \n4. Tamago: made with chicken stock instead of dashi, which makes it more creamy \n\nFriends got the uni, zuke toro, and wagyu and were all happy with these. \n\nOWAN:\nFish consommé with enoki: sweet from the seafood, light but flavorful\n\nDESSERT:\nHouse made genmaicha tea ice cream: I love tea based things lately (tea infused liquor for cocktails, tea flavored ice creams). The ice cream texture and flavor were both impressive. I would totally pay for this outside\n\nService has really ramped up - the beverage director (from Gary Danko) was especially great, and all of the other sushi chefs were friendly, too.  Also, they take into account not only food allergies but also preferences when creating your meal.  I think it's the personal touch that made the difference this time around.", "author": "Marilyn T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-06", "description": "Probably one of my favorite new sushi spots in SF right now. Everything was delicious and the hype was real. \n\nJu-Ni means 12 in Japanese, they have 12 seatings and 12 pieces Omakase.\n\nI highly recommend getting the supplement because 12 pieces are just not enough when they taste this good. We ordered a bottle of sake and strangely they don't have sake glasses and we used wine glasses for it, which was a bit odd. I also recommend getting the 8:30 reservations because you'll have all the time in the world to enjoy this experience. \n\nI'm very happy about all the new sushi places opening up in SF, although it wasn't cheap but it was worth it. I'll definitely be back again soon!", "author": "Sandy L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-31", "description": "Overall a great experience of sushi. We were happily greeted and seated quickly. Overall service was great, quick to refill drinks and to order more if necessary. Our chef was entertaining and informative. The quality of food definitely showed in flavor, I love when sushi isn't fishy. Just about everything was imported which was great and the plating was phenomenal. You can't come in with a faint heart for your wallet, but that's to be expected way before you even make the reservation in advance. I definitely recommend coming at least once in your life if you really enjoy sushi and/or want to impress someone. They definitely take you through a journey of many small dishes. The supplements are also worth doing.\n\nMy only small gripe was when our neighboring couple had a glass of wine spilled on them by the chef, of course on accident. The mood quickly changed and we definitely felt it. The couple was basically finishing at that point and this sounds a little selfish but we still had extra orders of food coming. The chef quickly became uber apologetic to the couple and although he sort of tried to entertain us we were left in the dust so to speak. They couldn't stop apologizing to them and talking to them and offering them things, which yes they should do, but we were just kind of there and it felt a bit awkward. I hate to say it but it kind of ruined how I felt about the place when we were getting ready to leave. From start to almost finish the experience was wonderful but that tail end of the night was definitely weird and we felt rushed to leave. Probably an unusual thing to happen for them and I can't knock them too much on it but as you can see it really left an impression on me.", "author": "Guisela L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-24", "description": "We visited ju-ni with a few friends again last week. This time we had a different chef and the experience was entirely different. Much better than during our first visit. Phenomenal sushi. Great fish quality.", "author": "Kolja S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-25", "description": "Ju-Ni, as many expected, has just received a Michelin Star in their 2017 guide. Pretty impressive on its first year.", "author": "Wanugee N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-03", "description": "Street parking there is \nSome real serious b***shit!! \nUber it, kids!! Or \n\nTake a MUNI train. \nOr a cable car. Or a \nYellow taxicab. \n\nOr a Megacycle\nHog-Thing, freshly ripped from the \nDeepest bosoms of\n \nHell's most fractally \nCrenellated headlines.\n\nValet pking? Jus sayin!!", "author": "D D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-20", "description": "Nice service, atmostphere, chefs, intimate experience. With only two seatings per night with 12 guests at each seating. A very inconspicuous setting. Pricey for sure but a good experience nevertheless.", "author": "Linda H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-22", "description": "Came here the day after Valentines day. When walking in, I was like, wasn't this place Candy Bar a few years ago? Turns out the place closed and metamorphosized into a wonderful 1-michelin star sushi restaurant!\n\nFood:\nWow, sushi was amazing. I think this is one of the first really good sushi restaurants in SF. 90% of their fish is imported from Tsukiji fish market in Japan, and others were either domestic or from other places internationally. My favorites were the Scottish ocean trout (so soft and fatty), chu-toro (tasty and fatty but not too much fat), shiro ebi from Hokkaido (so smooth!), the Ankimo monkfish liver with ikura (I usually hate monkfish liver, but it mellowed out the saltiness of the ikura). All were well executed! For the 17-piece omakase menu, it was $125 which wasn't bad for the quality IMO. We did add on a few extra pieces, like a chu-toro temaki (so good - great crispiness to the seaweed) which I thought was worth it. Can't remember the corkage. Our total bill with two omakase's, maybe 2-3 extra pieces of sushi, wine, and gratuity came out to ~$500. I honestly thought it was well spent!\n\nAmbiance:\nBeautiful, modern, sleek and simple decor. I liked the way the had us sit down. Most people come in with a party of 2-4, and so we were seated with another random couple. We both shared the same sushi chef and had all of our servings together. \n\nService:\nFantastic. My bf and I felt that we could make a connection with our sushi chef and also the sommelier. It was funny that they were all millennials...just kinda strange but cool at the same time. They have profiles for each of the sushi chefs on the website, and we had Roger, who used to work at Sushi Ran! We had a great time joking with him the whole night. I forget the Somm's name, but he recognized our wine, and we had a really cool conversation. Can't really remember much from the conversation since I was drunk AF, but I remember having a great time.\n\nI'd definitely return. Loved the experience overall. I think it'd be fun to come here with a reservation for 4 people and just go crazy with the sushi! You'll be in good hands and good company (with your friends and also the employees here).", "author": "Jocelyn L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-10-09", "description": "There is a hole in my wallet...\n\nI knew what I was getting into going here. I get what this style of food is all about. I'm a foodie and love new and interesting flavors. I only eat out at restaurants that will give me a great food experience that I can't recreate at home.\n\nFor the price, I expected better flavors. Not only was the food totally bland, but after my main tasting, I was still quite hungry. The tasting menu was $90 per person and the add-ons varied from $17-$34. We ordered quite a few additional items due to being hungry. With drinks and tip, the bill for 4 people came in at almost $1000. \n\nThere are quite a few other reviews here that list out the dishes, so I am not going to go into that. Our tasting was pretty close to those shown here.\n\nThe service was decent; the waitstaff was attentive, tho it's hard not to be attentive when you only have 12 people to serve. \n\nThis is 2.5hrs of my life and 500 of my hard-earned dollars I will never get back. I don't recommend this place.", "author": "Fred Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-19", "description": "Was scared that ju-ni would be overhyped, but it's now one of my favorite sushi spots in the city.  Our chef was great at explaining the different types of fish, and took such effort in preparing all the nigiri pieces.  Fish was fresh, and the rice was DELICIOUS.  Five stars all around.", "author": "Christine A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-08-17", "description": "Yes, parking is hard. \n\nI am going to be very tough when rating Ju-Ni as I have been to Kusakabe, Omakase, Maruya, and many more in this tier of Omakase Style dinning.\n\nKusakabe is by far my favorite. He handles every piece of fish so delicately, the fish and him are one. \n\nJu-Ni is a newer restaurant that has popped up. It took 2-months to get RSVP so plan way ahead. There is very limited seating. The restaurant itself is beautiful and well designed. I would actually say in terms of design and aesthetic appeal, Ju-Ni wins the race; food, not so much. \n\nThere is 1 tasting menu. $90 per person. Very reasonable. But when you add in all the extra supplements, it brings the tasting to $146 per person pre tax and tip. Don't forget about the champagne and beer either. It can easily come out to $500 for 2 (which is how much our bill was.)\n\nAt that price, I expect experienced chefs with precise handing to each fish. Unfortunately that is not what I experienced.\n\nThe fishes were thrown into the box and handled in a \"whatever\" way. I would expect it to be handled delicately. \n\nI agree with some of the other reviewers when they said lemon was over used. It was on many slices of fish (squeezed, not brushed).\n\nI would have also preferred my rice to have more of a vinegar taste. And lastly, the pick up was not always clean on each piece of fish. Sometimes there was rice left over on the counter or the rice would crumble in my hand. \n\nOverall, the taste just wasn't there. It was not creative enough, nor special. \n\nI will say the highlights of the meal were:\n\n-A5 waygu with truffles- incredible! You have to get this.\n- Some seared white fish- a really good mixture of chewy and soft texture.\n\nSadly, I was over charged for 6 glasses of champagne. Now I know I was drinking but I was't that drunk to the point where I couldn't count. Lol. I had 3 glasses. I brought this to the attention of the waitress, she changed it. I was then charged $27/$26 a glass when the menu said $22. Once again I had to bring this to her attention. \n\nThe owner was nice enough to apologize and offered a small gift card amount as a \"sorry for the mix up\". \n\nSo there you have it, Ju-Ni in a summary from my 1st experience.", "author": "Carrie Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-02", "description": "At most high-end sushi restaurants, I feel like I have to be quiet as to not inconvenience the chef and other customers (Totally a Japanese mindset). Ju-ni is a bit different - chef Geoffrey is extremely friendly, and we enjoyed conversing with him about our meal and with random other topics. The sushi is also a bit different - it's not just a well-prepared piece of fish with the perfect rice with a little bit of vinegar or soy sauce. Some come topped with caviar, others with gold flakes, and some others with shavings of liquid nitrogen-frozen ankimo. I'm usually a fan of the \"traditional\" Edo-style sushi, but I definitely enjoyed the various flavors and textures of this meal. Definitely in the top 3 of sushi restaurants I've had in the Bay.", "author": "Kazu O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-09", "description": "The sushi here is excellent, the sushi chefs are great at explaining everything and it's fun to watch them make everything, and the service is impeccable. Only problem is that it comes with a huge price tag and it's really difficult to make a reservation, but I like that they are on Resy so you can set notifications for when something opens up. For other points of reference, I've eaten sushi at many places in San Francisco (Kusakabe, Sushi Hon, Tsubasa Sushi, Saru Sushi), in Japan, NYC, etc. This place was really delicious, but for 2 people (including one drink each), set us back about $350 after tip and tax. It is not easy on the pocketbook. I think if you're coming for a special occasion to celebrate a birthday or anniversary, or if you have money burning a hole in your pocket, it's fine. I still think Tsubasa Sushi in Hayes Valley is my top pick for great sushi & nigiri at reasonable prices.\n\nIf you're coming to this place, a party of just 2 (maybe 3) is best because everyone is seated around the sushi bar. There are very limited seats in here, and reservations are only at 6 pm and 8:30 pm. Don't try driving and parking in NoPa because it's difficult and frustrating - just take Uber/Lyft. The decor is very minimalistic and modern, wood counters, and ceramic plates. \n\nThe food was all fantastic and all the fish was really fresh. The nigiri was all delicious and each piece of fish was prepared differently, some with lime zested on top, finger lime on top, and some of the fish was seared with a blow torch. It was fun to see the sushi chef make everything and explain it all. They had one with roe and shaved frozen monkfish liver on top which was really unique. They also had an appetizer and a dessert (ice cream)\n\nOverall, an excellent meal -- more nigiri than at Kusakabe, but if I'm paying ~$150 per person, I wanted a little more more variety. Kusakabe was just a notch above for me (at very similar price points) because the plating and variety of dishes were a little more interesting. I really loved the fish at Ju-ni, but I felt like I could get similar nigiri with less of an experience & less service, but at cheaper price points at Tsubasa Sushi.\n\nWorth a try for a special occasion if you love nigiri.", "author": "Christina L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-08-21", "description": "Let me make it short....Worst experiences from our chef stationed in the center......Amateur.\nI was at least expecting the chef from preparing to deliver each piece of our nigiri with passion since Omakse 12pc set is $90. He tells you fish from Japan but preparing it like fast food. if i could upload a video here, it would be self explained. My whole dinner was ruined. Each nigiri was made quick and poorly with no respect of the pricey dining experience.", "author": "Wan Y."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-06-21", "description": "1/5 star for quality, taste & culinary technique of price. (China clone)\n\n            ~~**long story short**~~ \nPaying Mercedes SL retail price tag for a ES Lexus value for its material grades of used, culinary technique. It's for newbie, young ppl who has no expectations will be satisfied! you can fool young ppl but can't fool adults. \n\n-Like, Joanna S. review 5/11/16 said, \"how do you differentiate good-$$ sushi from the best-$$$$ sushi? \"  \n\n\nObviously, your head sushi chef, he's age range 25ish, but for $$$$ restaurants head are usually age 30s-45ish experienced since it's usually for adult's finest expectations. \n\n\nProblems: Sushi Rice/Vinegar/Fish  \n 1. your preparation - my personal head sushi chef, said, the angel & how you mix sushi rice and vinegar already determines the result of how your sushi rice's taste of vinegar reflects your top of fish. \n2. Your vinegar's taste didn't blend well balanced, I did not taste salty, sweet or vinegary to the fish.  it was all weird taste, like the head chef didn't know which direction he's leading?  \n3. Fish - overly thick like house roof bricks but really overly powered the sushi rice, fish does not go well balanced with the bottom. \n           reflects: top ingredients -----konbu salt, ponzu dash, scallions, daikon momiji aroshi has no effect to your thick pieces of fish in the taste. \nTorch issue: \n-Angel \n\nUr Bigger Issue: \n 1. Most of your fish's grades are at $$ moderate price sushi restaurants. \n\nMy 1st hired Japan head sushi chef who had 30yrs of experience 50yrs of age, who I had trouble of communication, real smart people find the solution to solve the problem so we used dictionary & drawing to understand each other. He said, \"The high price you charge correlates to your values of how much it is worth in which reflects your real ingredients of the handcrafted finest taste of topnotch is & culinary techniques!\" Not sub imitation ingredients for $$$$ \n\n\nSince, $$$$ are targeting towards elites, but real rich ppl are rich for a reason, they are successful cuz they know their customer's expectations! The shallow customers are not going to complain cuz they are not owners, they have no expectations. the real good customers that returns are going to look for your values of market's price since they are out dining all the time. The fake customers are not usually dine out to get a  comparison are the ones that looks for price to define how high-end.  \n\n$90 add-on supplement for $34  \n$124 - Omakase:  deepness (3/10) \nStrong Items: \n 1. appetizer - cauliflower puree w/ assorted veges topped yuzu citrus was excellent! paired very well-balanced w/freshness. \n2. Horse hair crab topped with miso paste, very good, but ur sushi rice sucks! \n3. kumamoto oysters - are suppose to be salty, and shigaku are suppose to be buttery and sweet..what I taste was sweet and buttery \n\n\n\nWeakest Nigiri Items: (per pc) \n1. Albacore - topping didn't made any effect of the taste.  \n2. ocean trout - topping didn't made any effect of the taste. \n3. Zuke Chu Toro - torched thick, like eating pork steak without any taste to it.  \n4.cured ikura with soyu mirin topped w/monk fish liver shaving - looks good but didn't pair both ingredients in to one solid taste. \n5. cucumber seseme oil dressing with bonito shavings; taste was blunt, taste like light Chinese sesame oil dressing. \n6. Fresh unagi w/24k gold flakes - too much bones on top, the top skin was overly burned from the oven. it's just not $$$$ restaurant's expectation. \n7. Soup: taste like fake dashi broth...nothing related to Real taste where it's fine & freshly made. \n8. dessert: some mochi dough w/red bean..just doesn't define $$$$ restaurant's value for the price. \n\nand the rest of nigiri fishes are from $$ signs Japanese restaurant", "author": "Le Chef"}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-27", "description": "Hands down the best sushi in San Francisco.  I had the pleasure of eating there a few months ago and was surprised at how well the sushi was prepared and made.  Only downside to this place is the fact that reservations are close to impossible to make.", "author": "Joe P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-24", "description": "I have been waiting to try this place, but it was always booked! Finally, my boyfriend returned from school and we were able to try during his spring break! We arrived early and was seated near the hostess to wait for the next seating to be set-up. Immediately a server came up to us and offered their drinks menu, so +1 for attentiveness & customer service. There are 3 chefs per 4 customers, which allows them to focus on perfecting everything they make for each person. We had chef Patrick, who was friendly and even joked with us. The couple next to us were gluten-free, and Patrick was very accommodating and had sauce and fish prepared for them separately from ours (+1 for being so accommodating and friendly). Our menu was even personalized with \"Happy Anniversary\" since we told them it was what we were celebrating for dinner - super nice of them. My boyfriend and I had an alcoholic drink (Riesling & Hitachino Nest beer [very yummy, would order again]) along with genmaicha tea ($4 each) to pair with our meals. We started off the Chef's Choice Omakase with a small salad with red beets - yum! We started off with a spoonful of charred horsehair crab meat from Hokkaido topped with scallions. With our omakase we had: Shimaji, scallops, bluefin tuna, flying fish, golden eye snapper, soy-cured albacore, bioluminescent firefly squid, flounder, salmon roe & frozen grated ankimo (signature dish), cherry salmon, red snapper with truffle dust on top, Spanish mackerel, and cooked fresh water eel with gold flakes on top. My favorite of those would have to be their signature dish - it was a melt-in-your-mouth experience that I wish I could have ordered again in their ala carte menu. We opted in for the extended menu because an omakase isn't one without the uni, toro and wagyu! The wagyu was charred to its perfection  and also a melt-in-your-mouth experience. They had the A5 Wagyu with a BMS of 12 - oh man was it yum, especially when he threw on some truffle dust for me! Uni was also fresh because it wasn't fishy (since I'm normally not an uni fan due to the fishy taste), and the toro was so fatty - it was like liquid once it hit my mouth. I would have totally ordered all three of those again if I weren't so full at the end of it. In bewteen the meal we had a palette cleanser of cucumber in this amazing sauce with sesame seed - the crunch to the cucumber was super satisfying. The meal ended with a tasty tamago, enoki soup, and their genmaicha ice cream with green tea crunchy bits on top! I'm a huge green tea ice cream fan and this one was so good.. it kept me wanting more too! Overall, I'm very satisfied with this spot - it has definitely made it to my top list of omakase spots in San Francisco next to Kusakabe. The meal ended up being $409 pre-tip, which was pretty pricey - but the experience cannot be driven by the price. Would love to return one day :)", "author": "Amanda C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-08", "description": "Pretty much what you would expect from a Michelin star sushi restaurant. The chef will personally prepare you a variety of different sushi and nigiri that are unique and delicious .   Great experience", "author": "Garth B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-26", "description": "Awesome sushi and saki. Service was top notch. This moved to the top of my favorite sushi places in San Francisco", "author": "Tim D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-19", "description": "Modern take on traditional omakase. We were pleasantly surprised and in awe of the combinations the chef prepared. Very well done.", "author": "Amy C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-18", "description": "Sublime!! That's pretty much the way to describe what Tan and Geoff have put together at Ju-ni. The attention to detail, quality of seafood, and the creativity put in to every dish makes this an amazing night out. \n\nThey made our first date-night post new baby (at just 2 weeks) just the best experience we could have hoped for especially given how badly my wife was craving sushi following a 10 month hiatus.\n\nDetail of each dish was discussed and described and there was a real level of interactivity with the good and the chef that I've never had before that really put this experience over the top of us.\n\nAs for others comments about lack of parking in the neighbourhood, it's a known issue, and it's not like they can magically create parking - who the heck drives any more anyway.....catch an uber. As for the long time to get a reservation, it's one of the best restaurants in the city - period - and they only seat 12 people per sitting, so good things come to those who wait....show some patience. As for the extras options above the set menu, it's your choice to add them or not and the prices are on there....you should have mastered this level of math by the time you were 10 years/old.", "author": "Paul W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-05", "description": "Steve, who was our sushi chef for our dinner, has six years of experience as a sushi chef and previously worked at Roka Amir for three years. He was very polite and served four patrons during this seating. To his left was Geoffrey, which we recognized from his Akiko days. Why am I mentioning this? Well, I could hardly hear Steve if he spoke the same time as Geoffrey and when we were at different courses, this became a distraction for the customers, particularly when Steve was ahead of Geoffrey or vice versa.\n\nNow to the food. The omakase has a few palate cleansers, veggies, 12 pieces of nigiri and dessert. At the end, you can order a la carte nigiri - all of which was not previously served in the omakase. There were a few standout items - the kampachi (amber jack), hotate from Hokkaido (scallop) and ikura with shaved ankimo (roe with monkfish liver). From the a la carte menu, we ordered a5 wagyu and kaisui uni. I took photos of everything except for the hotate since I didn't know we would have to pick up the nigiri from Steve's hand. It was a bit awkward but delicious. \n\nI'm a bit torn between 3.5 stars to 4 stars for this review. While we enjoyed our experience and the fish was fresh, what we were served was not something I would say was amazing or creative and would warrant an immediate return. The one thing that really stood out was the rice the fish was served on - it kept crumbling and breaking apart. It was almost as if the rice was over cooked. They also liked to serve quite a few pieces of nigiri with a squeeze of lemon, which I thought was odd. For the price point, I would expect more from Ju-ni. Maybe if they served sashimi rather than nigiri, I'd rate them higher.", "author": "Remus L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-01", "description": "I haven't had an omakase experience in about a year and ju-ni definitely lived up to my expectations.  I loved the space - bright, open, felt more inclusive/intimate then sitting a long sushi bar.  Our chef was super nice, friendly & knowledgeable.  The fish was super fresh, I can definitely say I tried something that I haven't had which is always a bonus - they house cure their tuna!  The pricing was what you expect and we opted for the extended menu which was really worth it!", "author": "Meredith K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-09-27", "description": "its not authentic omakase. its more like Californian fusion omakase. They use alot of lemon and lime with torched on the fish but you ruin the freshness of fish and taste. Only thing I could taste was burnt flavor with citrus on it. ew~~~~~ not a big fan of burnt flavor and dark burnt fish meat. I think this place is over rated and over priced. wont be back no more and I wouldn't recommended to anyone", "author": "Micheal D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-05", "description": "Oh how I love you Ju-ni, especially your frozen ankimo with ikara. That was the highlight of the night and my favorite one I had to order another one. Never had anything like it. \n\nHard to get reservations, Only 6PM and 8:30PM. 12 seats, but the place is spacious and you aren't all confined in one space. 3 sushi chefs and 4 seats each. My sushi chef was Daniel. He was so nice and super funny. Really interacted with you and pays attention to what you like. He noticed that I was left handed and the guy next me too, so he placed my sushi differently. This is the 2nd place that has done that. He also knew I loved green onions so he would give me extra or put some on the side and let me decide if I wanted to add it. \n\nComes with a small appetizer, 12 pieces of nigiri, a soup, then a light dessert. You can add supplements after (3 pieces of their special). I didn't because I don't like uni or eel. I just ordered my own. I did wish I ordered the wagu with truffle. They really put a ton on their and it looked so good. \n\nEvery bite was so good and fresh. I will be back!", "author": "Karen H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-04-10", "description": "Worst use of $250+.\n\nCame here with high expectations and the expectations got even higher when the chef started talking about how they primarily focus on good sushi unlike the other places which don't focus on the perfect morsels of food. They said it's exactly Tokyo style. Having fallen in love with sushi in Tokyo and Nagoya, I was super excited by this talk. The chat was good, everything went downhill from there. Sushi not crafted anywhere to the level of Kusakabe or Sushi Ran or even Saru. Prices are unnecessarily elevated though. I'm all for paying big bucks for sushi, Kusakabe is worth more than they charge and we even had alacarte after the Omakaese there, but we just wanted to get out after the 8th course at Ju-Ni. We wanted to be impressed but left incredibly disappointed. Made reservations at Sushi Ran to hopefully reverse this poor experience.", "author": "Andy J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-05-24", "description": "Let's make this easier to understand why the 3 stars\n\nAtmosphere - 5 - The type of setting that I'd want if this is my dining room/kitchen\nPrice - 3 - Slightly higher than acceptable for SF price\nPresentation - 3 - Very fusion-ish, in a way 'trying too hard' but I understand, it's the SF competition after all...but personally I prefer the traditional nigiri\nTaste/Freshness - 2 - a bit overly seasoned (salty), maybe the chef that we got was less experienced than others, this one can be subjective\n\nTo be fair, we'll go back again and hopefully a different chef to see what went wrong.", "author": "SK Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-24", "description": "Discovered jū-ni just 4 months after its opening and am writing this review several months after -- I'm dying to come back. Omakase menu under $100 and the option to order single pieces afterwards. \n\nWe sat down in the first round of dining. The interior was gorgeous and so carefully crafted from floor to ceiling, all the plants and dried flora in-between. They definitely took the care to construct a beautiful work station for each chef, I think that itself was one of the most beautiful things about this dinner.\n\nSteve was our chef (follow him on Instagram -- numbsteve!) and took great love handling every single fish and care crafting every piece of nigiri. You sit much closer to the work station when compared to Akiko's or Kusakabe, so you can notice so much more about the ingredients and how they are cut.\n\nI don't go into much detail about each piece anymore, especially since there are so many photos. You must try it and be surprised...though I can say that I had one of the most memorable bites into scallop and uni here, which I ordered a second of. O:)", "author": "Kathy Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-20", "description": "My experience here was top notch. It's still in that new restaurant phase where they're probably trying really hard, but I really hope the quality stays consistent in the future. I intend to check it out again and report back.\n\nYou pay $90 for a 12-nigiri meal, and it includes one appetizer, one intermission course, and a dessert. Every piece I had was nothing short of amazing. Most omakase places I've been to has at least one piece where I'm not the biggest fan. Typically, it's due to things such as imbalance of taste (e.g. shiso flavor overpowers fish or torching left piece too burnt) or the fish just tastes a little off. But during my meal here, none of that was applicable. It wasn't the most beautiful presentation I've ever seen, but it was one of the few times I felt every single piece was perfectly balanced and delicious. Our chef was also really approachable and friendly. He didn't try to be overly descriptive but hit the important details of what you were eating.\n\nAll in all, it's one of the more reasonable priced omakase sushi places in this city, and the quality was probably the best I've had in SF. I loved every second of it.", "author": "Charlotte H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-03-15", "description": "Everyone was very nice and some of the fish was stellar. Overall not worth the almost $500 for two people that was spent.\n\nSushi chef - Gavin. Nice person. Couldn't understand half of what he said. Compared to Kusakabe chefs, so green and unprofessional. Kept manhandling the fish. I don't know, maybe it's what you do and I just never noticed. \n\nEnvironment - So, probably noticed what chef was doing this time because there's no cold case between seats and counter. And the counter was the same height as our dining counter. Because there's no cold case, each of the sushi chefs had to travel back and forth to the other to get stuff. Didn't help the experience at all. Which wasn't as disconcerting as the overhead lights that casts a shadow over the sushi chef as he's bent over the fish. So he's cutting in the shadow - not an ideal work station. Music way too loud. Space doesn't inspire anything - it's nice, too loud, open, boring.\n\nFood - Cauliflower puree beet appetizer was very bland and disappointing. Some of the fish we got were great and some were eh. Some could've been great but Gavin sprayed too much lemon juice and other junk on it and all we could taste was not the fish. \n\nWe honestly did love some of the fish and wanted to love the experience and the restaurant as well. Tried to make the most of it by drinking this great sake (4.5 stars for that).\n\nFor the same money, we would just go to Kusakabe. Every time. Won't be returning. Sorry.", "author": "JT H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-09", "description": "Oh my dozen seats.\nAny fin is possible.\nWagyu from heaven.", "author": "Nish N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-26", "description": "This is restaurant is amazing. Well deserved its Michelin star. The whole experience is memorable, and the sushi chefs are great. Totally recommend it.", "author": "Javier S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-15", "description": "It's a rare occasion that you get to eat fabulous sushi and walk away from dinner feeling like you were served omakase by a friend.  In coming here with my husband for their second seating at 8:30pm, I wasn't really sure what to expect.  Having checked off a number of sushi spots in and around SF, I am inherently skeptical of anything that pops up that represents high-end sushi.  That being said, it would be a lie if I didn't say I was interested when I read about jū-ni on Eater, so when we got a reservation, I was excited.  In being seated, we were put with Geoff with two other people and proceeded to go through our 12 course omakase.  I would expand on what we had, but truthfully, the menu will likely change since the fish is flown in from Tokyo on a regular basis and is subject to availability.  So, what can I say? jū-ni may just be my favorite sushi place in SF.  Yeah, I just said that.  It trumps our experience at Omakase, ICHI, and even Kusakabe.  I know it's a bold statement, but everything we had here was absolutely outstanding. My favorite was the Kisu nigiri; the experience took me back to sushi at Jiro in Tokyo.  My husband's favorite was the shark skin flounder nigiri.  Both of us agreed that almost all the pieces we had were fish that we had limited experience with, and enjoyed trying something new rather than the \"traditional\" edomae experience.  If there was any critique that we'd give, it would be that our dinner took a little longer than what a typical sushi dinner runs.  The amount of work that Geoff-san puts into some of his pieces is supremely laborious, and while everything comes out incredible, it does mean that your meal will run a little long.  In any case, I've already booked another reservation for here in May and am really looking forward to being back!", "author": "Lisa I."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-24", "description": "My husband and I went here for our anniversary and we were not disappointed. We snagged at Sunday reservation (likely due to a cancellation) about 2 weeks out for the 6pm seating. The restaurant is incredibly mellow and zen when you arrive. With only 12 seats, you're front row for your own show with your dedicated chef for the night. Our chef was really great- answered questions, shared interesting facts about the origins of the fish and was just generally really nice. The tasting was outstanding! The fish was all so expertly prepared and \"melt in your mouth\" delicious. We also opted for the tuna hand roll supplement after our tasting menu. It's definitely a pricey experience but well worth it if you're looking for an amazing omakase style tasting.", "author": "Nikki S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-06-19", "description": "The restaurant takes its name from the Japanese word for \"twelve,\" being that there are twelve seats. That and so much more information about the fish, design and other aspects of the restaurant are freely shared by the chef as he prepares your food. This place is omakase ONLY. In other words, patrons have the option to add on select pieces of fish but only after you've had their standard omakase as the base. It's not just a young restaurant in the sense that it opened merely three months ago. It's also young in the approach to the fish, the decor style and the chefs themselves. Does not seem the chefs are classically trained (although they each have experience working in kitchens of competitors) and there is an element of fusion that some may appreciate more than others, such as their starter dish salad of corn and tomatoes. They also seem to be adventurous, incorporating less traditional techniques such as brown sugar rather than white sugar in their rice. Not sure how they got four $s as the standard omakase is less than $100. Perhaps it's because their sake selection is a bit pricey, and there are few less expensive options. As for their beer, you get more than the standard Sapporo. The white ale they have is quite good. If you can't enjoy any of the pre-chosen omakase selection because of allergies or other, they don't seem to give you a replacement/alternative dish. Rather, you just misses out on that particular dish altogether. Hope their creativity and ambition helps them improve with age. For now, it's decent and absolutely worth the price they charge but probably not the high end quality sushi available (but again, probably in part because it's also less expensive) at Akiko's or Kusakabe.", "author": "Kimberly H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-14", "description": "Sooooo good. Chef Geoffrey Lee is a Sushi Ran and Akiko's alum, and he's opened up his own joint now. All the sushi he served was amazing, but my favorite was the frozen monkfish shaved over monkfish. And you must get the supplements!! You won't regret it. Additionally, if you're a design geek, a lot of thought and attention was put into all the details of the restaurant design, from carving out a space in the wooden bar for the rice cooker to fit, to chopstick holders custom designed for the restaurant. A lot of love went into the space and a lot of love is going into the sushi. Go check it out before it gets a Michelin star and becomes even more impossible to get in!!", "author": "Jessica W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-03", "description": "This review is long over due! I came here the first month that place opened and I had a wonderful experience!! Our sushi chef was great and very informative. It was entertaining watching him prep the sushi right infront of us, one at a time. I also like that each nigri already had wasabi and they brush a little bit of soy sauce on them already, so no need for any dipping. I can't remember what my favorite was that night, but I do remember that each piece of fish was very fresh. Great experience and definitely pricey, but totally worth it!!!'\n\nDon't forget to add the supplements!!!!", "author": "Brittany L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-16", "description": "Ju-Ni is a new modern sushi place in SF. While the sushi is of high quality I don't think its deserving of a michelin star, but I would recommend it for those looking for more modern tasting sushi. \n\nUnline Kusakabe and Wako which hosts 2-3 sushi chefs behind the counters, Ju-ni is intimate in that there is one chef per 4 customers. This is great for more inquisitive types who want to learn more about fish, seasonings, technique, etc. However, there appears to be deviance in the character, skill, and pedigree of each chef. This results in varying experiences for each customer. \n\nSushi wise the fish was of great quality, however the rice is noticeably different; they use brown sugar in their rice and its noticeably more clumpy and firm than others and the temperature is slightly colder. Another gripe is some fish were overly and repetitively seasoned with the same dressings; soy sauce, sea salt, and lemon.  Their signature of shaved ankimo is definitely delicious, but overall the whole place is very modern in their approach and untraditional.\n\nIn the end, I'd come back and I'd recommend it, but I'm nowhere dying to see its nuance in seasonality as I would other places.", "author": "Chad S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-12", "description": "What to expect:\n- super bouge-y conversations about where you've had sushi (and how this compares): Kusakabe, Sushi Ran, Jiro, Tokyo, Hokkaido blah blah\n- getting drunk off of fancy sake and jumping in on the conversations of other couples\n- taking time-lapses of ahi/kani searing(s)\n- chomping on succulent scallop or baby squid tentacles / slurping up the sweetest (and $$$) Hokkaido uni\n- eating dat ikura/frozen ankimo combo and watching your neighbors encountering come-to-jesus moments (and knowing that you, too, wear the same dumbstruck look on your face)\n- feeling that high where you never want the litany of happiness to end\n\nI don't often say sh*t like \"this was an experience,\" but: This was an experience.", "author": "Melissa W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-01", "description": "Truly an amazing experience! We came here for the first night of our honeymoon and it was such a wonderful way to start our trip. The food is unbelievable! Our chef explained each piece to us and was so helpful and friendly! We loved every second of it! A wonderful place for a special occasion!!", "author": "Tara C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-22", "description": "I don't necessarily want to call myself a sushi snob but...I could possibly qualify. I'm drawn to sushi places that can offer me a taste experience that is hard to get or that you can't get anywhere else. For me, that's choice cuts of chef-seasoned, premium, rare and seasonal fish. Not to say I'm going to turn my nose up at a rainbow or spicy salmon roll (I will however turn my nose up at any \"sushi\" with cream cheese in it), but I do prefer to spend my sushi allowance on omakase-based sushi restaurants. \n\nSo when I read an article about ju-ni, I had to take my boo-thang of the moment over for a little splurge. When I went, the omakase was $85 plus a $35 supplement. Maybe they've raised their prices to $90 since then (based on other reviews) but I would gladly go back and pay that extra $5 - which in the world of omakase isn't bad at all. Word hadn't gotten out quite yet and there were only 6 other people in the restaurant for the first seating so we actually got our sushi chef all to ourselves for a pretty intimate dining experience. \n\nWhile all of the fish was spectacular, the standout to me was the uni. It's fresh-packed from Hokkaido in some juicy junk - not in the box like you see elsewhere - and it was by far the most delicious uni I have ever had in my mouf! Another standout was a white fish that had shaved frozen monkfish liver on top. I despise monkfish liver but I loooooooved this preparation! \n\nThe sake that was recommended was on point - Black Dragon if I'm not mistaken - and the service was exceptional. If you're looking to level-set your sushi experience, get yourself a seat at this place before it goes off the chain like State Bird did - you won't regret it!", "author": "Alex A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-08", "description": "Daniel, our chef, was informative and engaged. The sushi is great (highly recommend the unagi add on) and cadence is just right.\n\nThe ambiance here is different from other omakase-style sushi places - more casual and social (but on the loud side).\n\nGreat place though. Definitely one of the better quality sushi restaurants in SF.", "author": "Kevin L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-25", "description": "First time eating at Ju-ni (heard it means 12 in Japanese) I was really impressed with the quality of the fish and the knowledge of the chef/owner Geoff about them, we loved every single bite. Salmon eggs with frozen shaved monkfish liver was my absolute favorite. Our server/owner Tan was really attentive on refilling waters and wine, two thumbs up on that. They just open and are only serving 12 people each night in two separate service one at 6pm and one at 8:30pm. I think it's reservations only so I highly recommend to make one.", "author": "Mattin N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-26", "description": "The best sushi I've ever had.   Service was amazing.  I want to go back ASAP!", "author": "Lily N."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-11-17", "description": "2/5 rating is based on the general standard (not on higher standard - michelin guide or price).\n(1) They pour the torch flame over the sushi (~50%), all of which tasted pretty bad to me.  Is torching a trend in sushi in japan?  (I haven't visited japan for 5-6 years.) \n(2) The sushi conventionally prepared (without torch heat) just tasted mediocre.  The local sushi places like Daigo tasted better.\n(3) Interior setting was pretty good but not warm.  Service was good.\n(4) Michelin guide used to be reliable but in recent years, no longer happens to be: especially, for sushi.  It seems that there needs to be some higher guidelines that tell deserving stars from stars.\n(5) Even at one third of their current price, I would still not eat there.", "author": "hun y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-09", "description": "Juni is a new omakase sushi restaurant in SF. Although only a week old, it felt like they have been running this business for a while. Organized, attentive to customer and great sushi. \n\nGeoff was our chef tonight. He took the time to tell us about each fish, where it was from and how it was prepared. Every piece of seafood served is very thoughtful. Each course progressed to be more complex in flavors, showcased the flavors and texture of the seafood and the technique used in curing the fish. Over 90% of the seafood is imported from Japan, flown in straight from the Tsukiji Fish Market in Tokyo. What impressed me most is Geoff work very closely with his wholesales and brokers in Tokyo to get the best available catch. He built this relationship with them from the years working at acclaimed Sushi restaurants in the Bay Area. \n\nEvery piece of sushi was delectable. Tonight I felt like I was eating in Tsukiji Fish Market. It was a great night!", "author": "Joanne L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-10", "description": "Best sushi in the city, very knowledgeable and personable experiences. This place does not disappoint!", "author": "Ashley T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-10", "description": "Worldclass sushi in a gorgeous setting.   Geoff, our chef last night, is incredibly talented and the fish is presented in a manner second to none.  They have been incredibly thoughtful in the design of every detail of the restaurant and customer experience.  It shows!\n\nAlamo Square / NoPa is lucky to have another top notch restaurant in its ranks.", "author": "Alex F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-29", "description": "*~MY 1,000TH REVIEW!!~*\n\nJu-ni means 12 in Japanese and is also the number of seats in this small restaurant. It is reservation only with 2 seating times: 6:00PM or 8:30PM. As to the fish, 90% is sourced from Tsukiji Market in Tokyo. Only street parking available which is fairly hard to find, so be sure to give yourself ample time as they have a strict reservation policy. There isn't a noticeable sign so do look at photos to find the place.\n\nI had been anxiously waiting for this place to open and only just been able to dine here on 6/23/2016. I was saving this restaurant (and my milestone review) for our anniversary dinner. Reservations are booked very quickly (they are currently booked 2 months out). I was in contact with one of the partners, Tan Truong, in booking my reservation. Unfortunately, there were a few snafus as my reservation got lost, and we ended up having to come in another day after Tan \"moved some things around\" in order to accommodate my only other day available that week since we had travel plans.\n\nChef Stephen was our sushi chef for the evening. He's fairly young (early 20s) and came to the US from KR to become a sushi chef. Chef Stephen is more on the quiet side compared to Chef Geoff (chef owner) who was adjacent to us (we could hear Chef Geoff's more in-depth details about each dish which was very informative). Absolutely loved watching the chefs put each dish together. Two things of note that weren't my favorite about the meal was the rice and the seasoning of the nigiri. Chef Stephen explained that the short grain rice (from Sacramento) is seasoned with red wine vinegar for more flavor. This is not the typical way of seasoning of sushi rice but Chef Geoff's twist which is a bit too much for the delicate fish for me (same with all the sauces to season the nigiri). Maybe the chef was a little heavy-handed (or my taste buds too sensitive) but the sauces were too overpowering and didn't allow me to appreciate the freshness of all the variety of fish. My favorites were probably the supplements so I highly recommend.\n\nService was on point. Napkins folded when someone went to the restroom. Plates quickly cleared when dishes were finished. Great date night place but not a must-return place for me. I'd prefer a more traditional style.", "author": "Kitty K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-10", "description": "There is a reason you can't get a reservation at ju-ni, it is just to darn good!", "author": "Kell M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-27", "description": "Low key and high quality omakase-only sushi restaurant in SF. Reminds me of early days Momofuku Ko between the eclectic prep, number of dishes, and awesome music. Easily rivals Kusakabe in terms of quality. 99% perfect meal. Only things I can possibly say are: please stop serving super frozen fish (at least bring it down to room temp), get a sake pairing menu in the works, and stop wasting black truffles on perfect A5 wagyu. Congrats to all the chefs who work hard to make this place such a success.", "author": "Amy C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-20", "description": "Best sushi I have had outside of Tokyo... extremely personal experience with the chefs", "author": "Kevin B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-29", "description": "Dining at Ju-Ni was a curious experience.  To begin with, making a reservation for a weekend evening was no mean feat- usually none is available, and you have to be on a waiting list through Resy, and then you get an email stating there may be slots available on certain other days. Eventually we were able to make a reservation for a night we could make, guaranteed with a credit card.  So wife and I arrive at 6 PM as they open, and are seated promptly at one corner of an L-shaped sushi counter that had 14 seats- curious because Ju-Ni in Japanese means 12.  The menu has one choice - a 14 course omakase at $145, with optional \"extension\" of wagyu beef or Uni for $35.  There is a two-page beverage list, sake occupying one page and a rather limited selection of beer (only 3 choices) and wine on the other.  Behind the sushi counter were three sushi chefs.  We were on the short arm of the L with four seats.  Behind the long arm of the L were 2 Asian chefs, behind our short arm was a younger Caucasian chef, who was rather chatty and giggly.  We were first served a small salad of some greens and couscous, which was tasty but not particularly notable.  This was followed, at a very leisurely pace, with some 14 servings of sushi.  The sushi was almost all with fish topping, and while some were excellent (e.g., the Unagi freshly cooked), most were merely good and tended to lack the kind of creativity and surprise that one might expect in truly great omakase restaurants such as Kusakabe.  Our chef was busy cutting various fish while we were being served the first course salad, and all the sushi he made was with the pre-cut fish, which he made into the sushi morsels rather painstakingly, but lacking the kind of expertise of hand movement expected of great sushi chefs.  He also made all four sushi morsels and served them to each guest in front of him, rather than making two at a time and serving them fresh, as one would have expected in other outstanding omakase counters.  This may sound rather trivial, but attention to such detail distinguishes truly great establishments from the ordinary.  At the end, there were a couple of desserts including a sweet omelet and an ice cream, which were good.  The service was attentive, though the two waitresses often seemed to be engrossed in conversation with each other.   With only 14 seats, the ambiance was quite noisy, perhaps because of the lack of any noise-absorbing surface.  Overall, the food was good but rather boring. I wished, at about half way, that the course would be over- which almost never happened before. There are quite a few omakase restaurants in San Francisco, regardless of price, that are much more creative and exciting than Ju-Ni.", "author": "Hoyle L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-07-24", "description": "Meh.\nI found Ju-Ni's Omakase to be entirely underwhelming and unremarkable. I think that there is much better Omakase to be had in SF.\n\nThe space/restaurant itself is lovely, very modern and clean, and set up so that there are only 2-6 diners per sushi chef. This set up should encourage a personalized experience between diners and sushi chef. Unfortunately that was not the case for myself, or the couple sitting near us. I mean, our sushi chef was fine, he was polite. But he was not personable or friendly, he wasn't able to answer questions about the food and ingredients that diners had, and did not describe each of the nigiri dishes at all. I learned what we were eating from overhearing one of the other sushi chefs, who was extremely friendly and knowledgeable.\n\nThe Omakase was a salad + 12 pieces of nigiri + a palate cleanser + soup + granita. I thought that for the price, the quantity and preparation of dishes, an experience overall was not enough. I wouldn't go back, and would recommend a few other places in the bay area before telling people to go here. There just wasn't anything interesting or memorable about this place or it's food.", "author": "Anna S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-13", "description": "As a big nigiri connouseur I take pride in finding the best real japanese authentic sushi spots in town to try. With every corner filled with jive ass roles and nasty sushi rice made by random 'sushi chefs' it is hard to find a place that does nigiri justice.\n\nA friend of mine is friends with the owner and had a last minute cancellation so my hubby and I jumped at the opportunity of not having to wait months to eat here. We also needed a date night and left my 2 month old with gma to chow down!\n\nWe had the omakase and 3 piece supplement. Bill came to be about $350 for the two of us with 1 beer.\n\n\nsome of the highlights were the house cured ikura with frozen shaved ankimo--- melt in your mouth buttery deliciousness. All of the fish was top notch quality and freshness, combined with the well seasoned sushi rice, =bliss!\n\nDont need to get into detail about every single piece, but every bite we had was fantastic and very interesting in pairings of the toppings and fish. Sushi rice was made well. I'd say on total par with my favorite, kusakabe, but kusakabe beats them hands down in the hot foods items-- you can tell why they have a michelin star. Ju ni's highlights were cuts of fish paired by more contemporary toppings whether it be ginger, lime, miso or what have you on certain cuts of fish. The $90 omakase is good enough although I was worried at first we were going to be hungry based on the reviews- the nigiri is medium to smaller size. We got the supplement which gave us the chu toro, shiryaki unagi with gold flakes, and hokkaido uni. The chef was engaging, although quite young, in speaking to him and listening to the others over the course of the 2.5 hour dinner, they all trained at sushi ran and came over here. I'd say they are all about in their early 30s.\n\nOverall I think kusakabe's $90 omakase still gives the best value in terms of presentation, artistry, flavors, hot foods, --we didnt need to supplement there, but Ju-ni is more contemporary and noveau. Was it worth the $175+ pp price tag? maybe once, but I don't think I'd go back for quite sometime.\n\n \n\nI am very glad we went though!", "author": "Petri Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-22", "description": "We've tried the top sushi joints in SF (kusakabe, akikos, maruya, etc.) and ju-ni definitely ranks in top two. What I like best is that their focus is purely on sushi, period. 12 piece omakase, all exquisitely prepared with the finest attention to detail. Jeff, our chef, even wiped our sushi block after every tasting. One chef serves four, making it a very intimate/private dining experience. The supplement tasting included uni, toro, and fresh eel, which were freaking amazing. Would definitely come back!", "author": "Jason T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-29", "description": "Amazing experience. 85% of their fish comes from Japan. Very fresh! The fish with Akimo was delicious. We enjoyed  their A5 wagyu BMS #12, which is hard to come by. It was served with a hefty portion of shaved truffle. The service was great and our chef was very friendly, knowledgable and informative.", "author": "raquel b."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-29", "description": "85% of their fish come Japan. There are only a handful of restaurants that serve A5 wagyu BMS #12 and ju ni is one of them. The service was great. The decor was modern and clean. The owners, chefs and servers are all very friendly.  I can't wait to dinebhere again.", "author": "Slb S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-28", "description": "my friend and i came here last night, and i loved it.  the decor is minimalist and clean.  there are only about 12 seats at the bar, and there are only 2 sittings per evening.  we had the first seating yesterday, and the chefs were doing a lot of prep work when we first arrived.\n\nthey have suntory beer on tap, which was delicious.  the omakase was great, and each bite was so different from the other.  there is no need for soy sauce or wasabi here, b/c all the sushi was already flavored.  we didn't get the special supplements, but i did get a pc of tamago to finish.  \n\nour sushi chef steve was really nice.  i would totally come again!", "author": "Helen T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-04", "description": "What an experience I had at Ju-Ni.  I loved the minimalist vibe the restaurant has and its very relaxing but at the time same you know they are serious about what they are about to serve you.  The sushi chefs are very friendly and you can have a real conversation with them about anything while they prep your meal.  I like the fact that you can actually see the entire counter and all the tools and ingredients they use, I found it very relaxing to watch these sushi chefs create our meal. It was very zen like. Now for the sushi, probably the best I've had in SF.  Fish gets flown in from Japan on the regular and the rice is perfect.  Definitely get some of the supplement add on, obviously the wagyu with truffleand the toro is a must for any foodie.  Surprisingly, one of my favorite pieces was the salmon roe with frozen monkfish liver shavings.  That frozen monkfish liver was something I've never experienced and the way it just melted in my mouth instantly was unforgettable. It was seriously hard to pick a favorite though, every piece was just as good as the one before but they were all so different.  Hopefully I can go back and experience it again. If i was filthy rich, I'd probably go here at least once a week.", "author": "Darren W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-20", "description": "We can't wait to come back! The ingredients are superb! The service was awesome! We loved every single bite.", "author": "Danielle W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-14", "description": "Definitely the best sushi I've ever had.  Everything was excellent.  Still, the crab with wasabi butter, scallop and Kobe beef stood out as my favorites.", "author": "Andrew F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-27", "description": "Incredible meal - took me right back to Tokyo. Each dish was interesting and delicious. Great service and had fun interacting with our chef. Even the rice stood out, not to mention every piece of perfect fish flown overnight from Japan. Two thumbs up!", "author": "Whitney S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-15", "description": "If I could give 4.5 stars, I would. Hesitant to give out 5 stars for any restaurant but this is pretty much as good as it gets for sushi in SF. \n\nThe quality of the fish is incredible- melts and breaks apart in your mouth the way it should! We sat at Steve's side of the bar and couldn't have been happier; he clearly is well trained with roots in Japan and knows what he is doing. Personally I don't think I'll sit in anyone elses section when going back to this place.\n\nThe price is a bit high at $90 for the tasting menu but quality is there. Personally I think they could either slightly lower the price point or offer a bit more with the tasting menu as $90 is a bit steep for 12 pieces of nigiri, but knowing the cost of keeping doors open in this city I can't blame them. Regardless you pay for an experience not just the food.\n\nWill definitely go back and recommend sitting in Steve's section!", "author": "Faiz H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-22", "description": "Wow-  I have a new favorite place for quality sushi.  Our meal last night was hands down the best sushi meal we've had to date in San Francisco.  It was on par with a wonderful omakase place my partner and I went to in Yokohama.  Each nigiri course was just an absolute delight.  I definitely recommend getting the supplement to treat yourself to the fresh uni course--  so much fresher than your typical uni.\n\nThere are two nightly seatings with 3 chefs caring for 3 small pods of diners.  Our chef Steve was excellent.  I really appreciated the care he took in preparing each course and explaining the fish and ingredients.  The restaurant atmosphere was both calming and energetic.   You could hear the enthusiasm of the diners around the bar, but the place is small enough that it's never so loud you can't easily carry on a conversation with your table.  \n\nThe menu changes over time and seasons and we are really looking forward to our next visit.  So glad to have this gem in our neighborhood!\n\nFinally, since others brought it up, i should mention that my hunger was totally satisfied after this 12 (+3 supplement) course meal.  Those that left wanting more food --  i just don't get it.  Maybe they are used to all you can eat buffets and like leaving totally stuffed and bloated?  I had nothing else to eat the rest of the night.", "author": "Troy B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-07", "description": "Modern ambiance. Loved their fresh water eel. Just out of this world. And their Hokkaido uni is some of the most refreshing uni I have had.", "author": "Eve C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-08", "description": "Ohh god! Some pieces were orgasmic and the others were so good! I did the supplement and my favorites were part of the main and not the supplement! I think it's a bit overpriced though( just a bit!)", "author": "Tina Z."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-03-31", "description": "I had no idea what our chef was saying. I'm asian, have asian parents, but I was still unable to understand. I stopped trying to talk with him early on because I didn't want to spend the entire meal saying \"excuse me, could you repeat that? maybe a little slower?\"\n\nFood was great though, which I guess is the important part.", "author": "eric c."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-23", "description": "Juni has a good claim for best sushi in San Francisco. The omakase is delicious, although definitely not a full meal - be prepared to order extensively from the a la carte menu. Out of that menu, a surprise highlight was the unagi. It turns out Juni is one of the only places where you'll find fresh, never-frozen unagi. It's a major difference and if you like unagi you have to try it!", "author": "David C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-12-29", "description": "Expensive AF. Professional service from wait staff. But our sushi chef had never even been to Japan. Lots of fish, warning: appetizer and dessert were sad little things so don't expect much. Everything was \"good\" but not \"great,\" nothing transcendent. Only really remembered the frozen shaved monkfish liver topping. Nice to try once if you're rich and never had an omakase sushi-only experience.", "author": "Ina H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-13", "description": "I love this place. I've been twice and can't wait to go back. The first time I was getting over a cold and my tastebuds hadn't come back all the way (so annoying!) but I knew it was good enough to go back. So glad I did because with the tastebuds intact the place was amazing. So much so that I made several more reservations for future visits and when I couldn't make one they were super flexible in cancelling despite it was within their cancellation policy which i really appreciated and which will keep me coming back. Can't wait til the next visit!", "author": "Kay R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-12", "description": "This is the best sushi shop in SF Bay Area for me now. I went to this place twice. First time, I felt this place is good, but a bit expensive because the fish was cut very thin, I still felt a bit hungry after 12 pieces and had to order 4-5 orders more (one of them is a handroll). I left the restaurant with some room in my stomach. Second time, I went there and had Geoffrey as my chef. Things got better. Fish was cut in good amount. He explained the technique applied to each fish. This time I felt almost full at the end of 12 pieces, but I ordered more to try more special fishes (no roll this time). Everything was perfect. I left the restaurant with two reservations in next two months :)", "author": "Aniwat A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-06-29", "description": "I was SO looking forward to eating here, and after snagging a reservation with only 3 weeks wait amongst 3 months wait times I was even more stoked. The first few courses started off in a good direction and then it all went down hill. Half of the courses were just brushed with ponzu and/or soy and lemon, leaving a one note taste in my mouth for the majority of the meal. The salmon roe with ankimo and the oyster were both really tasty, but not enough to make up for the other 10 courses. We even added the supplement (in which the chef said was a better deal then getting a la carte) which in reality is only a 50 cent difference. I did not feel like it was an open forum with the chef to ask questions and discuss the dishes, he didn't really speak much to us and was rather chatting with the industry people he know who were also sitting at our table. He had also mentioned that with a lot of their dishes, they're trying to make things palatable to the average american...IMHO, the average american isn't going to come here and I'm coming with an open palate and expecting to have an experience unlike anything else. Sure, I usually despise salmon roe and yes, by curing it you make it more palatable for my tastebuds...but rather than saying you're making it approachable to white people, it should be more about enhancing the flavor and celebrating the ingredient to it's fullest. It's a shame because being a chef as well I had a lot of feedback but didn't feel welcome to give it. Aside from the food and our overall experience, the decor really had me bugging. If I'm paying a $300 tab, I expect the bathrooms to be pristine and cohesive with the rest of the space, rather than having a thrift store dresser with framed warriors hats and an homage to ikea with the mirror situation. The framed art on the walls does not go with the rest of the interior, as well as the pinterest project air plants that literally look hot glued to the walls. Am I being nit picky? Yes. But under the circumstances my standards were/are pretty high. Overall, ju-ni is not worth the wait, the hype, or the price tag. We expected to drop a couple hundred bucks, yes, but hoping it would be worth it. In this case, it was not. Shout out the hostess though who literally has the more boring job there. Also, a granita for dessert is a total cop out.", "author": "Shane M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-11", "description": "Daniel was exceptional! Very attentive and engaging. He was very observant and noticed my aversion to green onions and thoughtfully left them off my next piece. He really made our sushi experience a delightful one!  Thank you Itamae", "author": "Steph L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-24", "description": "Roger served us.  IMHO the best out of all the popular omakase places in the Bay Area.  Made reservations again already.", "author": "Bill Z."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-06-15", "description": "Overpriced. Tiny small pieces. Brushed with ponzu sauce on every piece which causes nearly half the pieces to taste the same, erasing the flavor and character of the fish.  One would imagine at the end of a 12 course tasting meal you would receive a piece of Uni.  Of course not here. Instead a la carte menu is given and 1 tiny piece of Uni is priced at $12 additional dollars. That's after a $90 tasting menu which is the only option!  Two people, $250 for maybe 4 ounces of fish per person.", "author": "Jamie K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-01-06", "description": "Food absolutely fresh, creative and delicious. Some of the best I've had in San Francisco. BUT, for an $800 bill (4 people), I expect the chef to pay attention as we leave the restaurant, to thank us heartily, to welcome us back, to treat us with dignity and respect.... Instead, he was busy looking at the schedule for the next day, checking his invoices, whatever else he was doing I don't know, but he barely looked up as we departed. Not OK, and I will not go back. Food was great, but for the prices paid, I'll definitely go elsewhere where I can also get great food and better, more appreciative customer service. Really too bad.", "author": "Ginger K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-26", "description": "Absolutely LOVED this place.  This is one of those places that you save for special occasions, it requires far in advance reservations and is definitely pricey.  But the sushi was incredible.  This restaurant is strictly for sushi lovers, not people who just like Japanese food aka rolls, ramen, etc.  This is just nigiri.  The omakase menu varies by the day but we had amazing salmon, salmon roe with shaved monkfish liver (I loved this surprisingly), lovely mackerel, crab, etc.  The chef explains each piece of sushi and guides you on how to eat it.  The service was impeccable, very attentive and friendly.  Even before we were served any food the sushi chef noticed I was left handed, so when he placed the crab dish in a spoon, he placed it for me so it was facing left, not right.  A nice touch!  I would definitely go back here with one of my sushi loving friends for impeccably fresh fish.  I found that I was fairly full by the end of the 12 course, so we only ordered 1 other item from the supplement.  But you can easily go crazy here and order extras after you finish the omakase.  I agree with another Yelper that the pear dessert was lacking, I'd rather have something chocolate based or more substantial.  But that is my only complaint.  Parking here does suck, so plan ahead or take public transportation if you can.", "author": "Julie P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-19", "description": "I'm not really the review guy on Yelp, but when I run across an amazing meal I feel like I have to give these guys the credit they deserve. Ok so I'll start out with our chef, Steve San, who was unbelievably awesome. He was friendly and literally explained the sushi every time we asked him a question about it. His delicate touch on the fish shows how much he cares about his craft. The two lady's sitting next to us were chatting so he kinda let them do their thing and then focused more on us (but those ladies still left with an amazing experience). The concept is also really well thought out. JU-ni means 12 in Japanese, so it was a 12 course menu with 3 chefs handling 4 people at a time. It made it more intimate to have a dedicated chef, the relationship with the sushi was powerful yet amazing. I don't wanna go on for too long but it was an amazing experience, EVERYONE should have a taste of their amazing selection. OH ALSO, the fish is brought over night from Japan, and the UNI IS AMAZING. Thank you chef Steve for one the best meals ever!!", "author": "Billy H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-19", "description": "I took my girlfriend here for Valentine's Day and had the most incredible, memorable dining experience. Our sushi chef, Patrick, was friendly, knowledgeable, and expertly skilled; his attention to detail on every piece of nigiri was exceptional. As someone who has tried nearly every sushi restaurant in the Bay Area--and been disappointed by the quality of fish (and service) at many, including some of the most highly rated establishments--we were very pleasantly surprised by the quality of fish, service, and dining at Ju-Ni. Every piece on our omakase menu was carefully prepared, curated, and presented; and the taste unique, fresh, and bursting with flavor. The restaurant certainly deserved its Michelin Star and, in my opinion, was well worth the relatively hefty price. Highly, highly recommended if you're a true sushi aficionado (who seeks the highest quality, Japanese-imported fish) like myself.", "author": "Justin L."}
