{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-30", "description": "My sister and I came here on a Monday for lunch--the place is pretty tasty! You just tell the counter what udon you want (there are 5 choices), and from then, you can choose different types of tempura if you'd like. There was plenty of open seating for us also, and staff was super nice. \n\nWhat we got:\n1) cold udon --this was really refreshing and good, even on a colder day. I don't think I have one bad thing to say about this bowl.\n2) creamy kabocha chicken udon--creamy, thick broth that gets you full quick. I enjoyed this bowl a lot too!\n3) tempura broccoli and pumpkin: the broccoli comes on a kebab, with about 3-4 pieces on it. I enjoyed it but which it was a little crispier/airy. Same goes for the pumpkin.\n\nOverall, I think this is a solid place to go to if you're craving udon--The noodles were nice and chewy, and the portion definitely got my sister and I full. I'd come back again!", "author": "Shannon N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-21", "description": "Big and spacious, with big tables to share with your group or others, nice lights, and overall good feel.\n\nThis is an udon (thick noodle) restaurant where you go to the counter, choose what you want to eat, and put it on a tray, and pay for it. Theres a yelp coupon that gets you a free tempura! \n\nWe ordered curry udon for $13.50+tax and the beef bowl for $14.50 (i think). We also got free shrimp tempura and potato croquette. The udon was delicious, and the curry was good; loved the pickled daikon too. The rice bowl was also great, although the beef was a bit too thick for Japanese gyudon.\n\nAll in all, we liked everything we ate but it wasnt mind blowing (its supposed to be comfort food, after all). The main con is that the price seems a bit high, but to be fair the amount and the quality are good. Would come back, but not right away.", "author": "Mimi Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-03", "description": "Great quality of food, very efficient, clean and wanna make you go back again. \n\nKagawa-Ya is not another chain restaurant for lunch in The Mid Market. Their daily freshly made noodles can't be compared to anywhere else in San Francisco. Some unique and some authentic udon soups are made for each of your favorite flavors. Kagawa-Ya brings me some comfort food tastes like I used to had in Japan. As I've eaten at Kagawa-Ya several times, I can tell that the owner/chef wants to provider good quality of udon for everyone in San Francisco.", "author": "Akemi M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-08-03", "description": "3.5 rounding down\n\nBeef Curry Udon $13 ~ friend said it tasted like the package curry and the beef was actually beef stew - the whole meal looked unappealing\n\nNiku Udon $14 ~ there was so much beef in here that over time it became too much but I was left full so that's always a plus, flavor was good and noodles were not as soft as I'd like but no biggie, was also happy I could ask for no white onion\n\nThe add-ons: \n- crispy chicken $2 ~ and that was advertised as \"limited time\"\n- potato curry croquette $1.50 ~ this was the best of the 3 but I could've lived without it\n- shrimp tempera $1.50 ~ this was most disappointing because (see photo) the tempera I got chosen was the largest on the tray that was available \n\n$35 for everything, I was a little disappointed so I don't recommend (unless you're trying to complete your Yelp list like me lol) \n\nfor more bang for your buck + add-on free toppings too (cilantro, green onion, tempura crumbs) visit Marugame Udon instead", "author": "Yeanne L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-05", "description": "Long pending review. Loved that they have a completely vegetarian option which can easily be made vegan by excluding the cheese. \n\nThe broth is tomato based and was very rich in flavors and I loved it. They have a pretty spacious restaurant and as far as I can tell the service is quick (I had ordered ahead so there was no wait for me). It is a self service kind of place. Hope they come up with more vegetarian options , but even the 1 they already have is good.", "author": "Umang D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-29", "description": "I'm normally not an udon person, but this place was amazing! I got the #7 (zhajiang udon) and my sister got the #5 (creamy kabocha w/chicken udon). Zhajiangmian is one of my favorite dishes and this zhajiang udon did not disappoint! The noodles were super chewy and the sauce was really good, albeit a bit salty, but the pickled radish was a nice touch that balanced it out. I tried my the broth of #5 and it tasted a lot like clam chowder which I actually enjoyed.\n\nReally liked the chill vibe and the high ceilings of the interior. It's not in the safest area on Market St though so I would try to go for lunch.", "author": "Alice C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-25", "description": "Finally got to try this place! I love Maragume Udon and I would say this place is quite similar. Cafeteria style where you can choose your udon and help yourself to tempura, spam masubis, etc. I ordered the Kitsune udon with tempura on the side. Delicious and very filling!", "author": "Brenna L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-08", "description": "Finally tried Kagawa- Ya near the Civic Center/Van Ness area. They make fresh sanuki udon daily--look at these long strands! \n\nI got the kitsune udon, which was pleasant, though I would have liked a little more flavor in the broth and a bit more chew to my udon. Other Yelp reviews mentioned the noodles being chewy, so I'm hoping it was just a little over that visit. I would definitely try it again.\n\nYou can get a free piece of tempura with a Yelp check-in, so I opted for an ebi/shrimp. Pretty decent, and there's hot tempura sauce near the shichimi togarashi and other condiments.\n\nSeating is cafeteria style, but there are plenty of tables and it was clean.\n\nAll in all, it's a quick, enjoyable lunch, and well-priced for San Francisco.", "author": "Lydia C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-27", "description": "While I was on a walk recently, I decided to give Kagawa-Ya a try. During dinner time on a weekday, there wasn't a wait so we managed to go straight in to order. The menu was very straight-forward. 7 udon flavors, and an assortment of tempura to pick from.\n\nI decided to go for the beef curry, while my sister tried the creamy kabocha. I was initially planning to try the niku udon, but looking at some reviews on Yelp I went for the curry option instead.\nBeef curry: The beef curry is quite flavorful, and made from a solid soup base for the udon. The udon was cooked reasonably well, and was the perfect texture.\nCreamy kabocha: Also a very flavorful broth, definitely great for those who enjoy the pumpkin flavor. I personally enjoyed the creamy kabocha more, but it's not for everyone.\nWe also each got a fried tempura through the yelp check-in. Definitely a great supplement to the udon. The tempura was a bit over-battered in my opinion.\n\nOverall, the udon was solid and the food came quickly. The prices were reasonable, particularly for something you're getting on market street. I'd return for another meal if I'm hungry for udon and I'm in the area, but I wouldn't go out of my way to eat here.", "author": "Michael L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-19", "description": "Not sure how long it took for the ridiculous line to die down for good but it was a good 6 months or so before people realized they didn't want to spend $20 for a bowl of udon and tempura LOL\n\nMy favorite dish is their #2 Cold Udon. Perfectly fresh made noodles in a cold broth served with daikon, egg, green onion and nori with a lemon wedge. \n\nSean who is the owner...i believe? Is amazing and super friendly! At times when i am at work and on my coffee break i would pass by Kagawa-Ya and i would see him inside prepping noodles and waving at me from the inside. \n\nPretty big and decent place with great views for people watching on market street. They are located in the Uber building. i went in recently this week and noticed they are selling retail ! Super cute decal that i forgot to take a photo of. :) updates soon !", "author": "Anh T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-08-13", "description": "Sooooo..... If you've ever been to MARUGAME UDON this place is definitely not the same level I feel like. I ordered the beef niku udon, the broth was ok but the meat was very thickly sliced and not tender as beef udon should be. The udon itself seems like it was pre-cooked (?) hence it was a little bit over cooked because when i tried to pick it up with my chopsticks the noodle would most likely break. With that said I went with my coworkers and the ones that ordered the beef curry udon looked pretty good and flavorful. In terms of price I thought it was kind of expensive for what we got. I would say the price was around the same as MARUGAME UDON but there is a quality difference. Overall I would like to come back again and give the curry beef udon a try.", "author": "Nina Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-14", "description": "I tried 4 of their udon and my favorite is the creamy kabocha with chicken! You can order the bowl without the udon, too! The concept is very much like Chipotle, you're in and out after going on their assembly line. Do yourself a favor and order some broccoli tempura! It's really good! The noodles are the right amount of chewy and the flavors are really unique. Don't expect your typical udon here, because they combine flavors to create new items!\n\n$5 Kitsune Udon on 4/12 for the first 100 diners!", "author": "Charlene F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-24", "description": "I'm from LA but visited this Udon place 3 times and I keep craving it every time I'm on the plane ride home!!\n\nI always order their veggie option. I love how quick they are with their service/ prep but the meal still tastes of great quality. Their soup base is rich and full of ingredients. Their udon noodle is soft yet firm enough to not soften up with the soup. I'm crazy for mushrooms and when I take a bite of the mushrooms in the soup, it's spilling with soup and flavor. This is my go-to spot EVERYTIME I visit SF and want a quick lunch.", "author": "Jaddis H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-25", "description": "Decided to check out Kagawa during my lunch hour.  I see coworkers bring back their udon to the office pretty frequently so I figured I should give it a shot.  Plus, overcast weather makes me crave carbs and soup.\n\nI dared to brave the weekday lunch rush but was pleasantly (and also slightly skeptical) surprised to see a pretty short line.  I did not do any prior research/Yelp stalking but thankfully Kagawa has TV menu boards that show photos of the dishes with a description.  I decided to try out the Creamy Kabocha w/ Chicken Udon.  \n\nThe vibe I got from Kagawa is like a trendy Morrison's Cafeteria.  You go down the line, place your order, take a couple steps to pick up said order, select any additional bites like tempura, and pay.\n\nI did not have the highest expectation (cafeteria PTSD) but I did enjoy my bowl.  Typically I bring lunch from home, which has made me pretty choosy about where I go since I foot the bill.  Kagawa impressed me with their Kabocha so I'm down to explore their other udon creations.\n\nPROS: \n- Fresh udon!  The noodles were definitely the star of the dish.  Great texture-- did not taste gummy or like they were sitting out.\n- Chicken was super flavorful and had great texture.  Not overcooked or tough to eat which can be easily done in stew/curry-like dishes.\n- Fast service\n- Clean and spacious cafe\n\nCONS: \n- Next time, I will ask for bonito flakes and nori on the side.  I did not travel far but both of those completed melted into an unappetizing looking gunk\n- My dish was very bonito-forward (will ask for it on the side next time)", "author": "Cimma S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-29", "description": "A little early to my interview, so I decided to check out this place if I'm going to be working in the area. Not many options to choose from, but what I like is how they cater to their customers. Quick, simple service for those who are on a time crunch during lunch.\n\nThe process is simple. Order what type of udon you want, grab a tray, pick up your bowl down the line, grab tempura/musubi/onigiri if you'd like, pay, and enjoy your meal. \n\nI tried the Kitsune udon and grabbed a beef onigiri. About $15 for lunch. Sounds about right for San Francisco. Anyways, I enjoyed my udon. The noodles were soft and the broth was flavorful without being too salty. My bowl didn't include any meat, but there were so many veggies that I didn't mind. I enjoyed my beef onigiri a couple hours later. It still tasted great. Sadly, even with instructions, I couldn't open it correctly. Practice makes perfect! I was expecting it to just have a filling in the middle, but all the ingredients are mixed in with the rice. You get all the ingredients in every bite.\n\nWhen you're done, recycle, compost, trash, and place your tray at the window. Water is self serve with cups right by it. Extra condiments and tempura sauce next to the water. Quick, simple process for some great food!", "author": "Tiffany N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-20", "description": "Kagawa-Ya was the perfect spot to eat if you have a 30 minute lunch break and need to be in and then be out. The workers have speedy down to a science and the udon is good but not the best in SF. Would go back if I found myself downtown but probably wouldn't go out of my way to eat there as I've had better udon!", "author": "Sydney G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-09", "description": "Just stopped by today for my second visit and ordered the Spicy Sweet Bean ( Zhajiang) Udon! It was on point and really tasty! So tasty that I ended up taking the leftover sauce home so I can add more noodles and have it as a second meal! The crisp daikon and cucumbers really elevated the flavors and made the dry Udon dish much tastier.  I love that this place is very innovative with their Udon menu and switch items up from time to time to keep things interesting! They make everything fresh in house, which is a rarity for most fast casual places. \n\nI got my bowl within 2 minutes of ordering (crazy fast!)\n\nThe staff is super friendly which is refreshing. The restaurant is really clean, bright and airy. I can't wait to come back and try the other flavors!", "author": "Kay H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-09-18", "description": "Pretty basic Udon place with a simple menu, some add-ons and chipotle-ish style of ordering. I've definitely had better but it seems like a pretty popular place as a lot of people were eating there. Went here once, glad I tried it but I wouldn't see myself coming here again.", "author": "Navdeep D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-12-20", "description": "Had high hopes for this place, but it looks better than it tastes. And for $17 for udon ($14 Niku, $1.50 soft boiled egg, $1.50 shrimp tempura), it was too pricey for a bowl that wasn't anything special. The broth and noodles tasted like something you can buy at Ranch 99, and the beef was dry. The spam musubi was $3 and did not have flavor. I had to add sriracha to give it more taste. \n\nSigh. The price you get for SF. If only it were as cheap and delicious as Marakume Udon in Hawaii or udon in Japan. I couldn't finish it so at least it gave me 2 meals.", "author": "Raquel Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-07", "description": "Came here on a Thursday evening. It was pretty quiet due to it being a holiday the previous day. Had a hard time deciding which udon to choose from since the curry and creamy sounded really good. I opted for the original kitsune. Also got two tempura sides: shrimp and chicken. The udon was pretty good. The tofu skin was sweet and the broth had a good amount of flavor. I sorta regretted not going with the other broths as I think those would have more flavor. The shrimp was delicious as it was battered beautifully. I never had tempura chicken before and didn't like it. I wish it was karrage. Overall i would come back and try the other bowls.", "author": "Jeffrey W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-30", "description": "Good fast causal go-to for good chewy udon noodz. Not the best you'll have, but very fulfilling. Ordered pickup once via Grubhub and walked-in another time and ordered takeout. \n\nI don't know if it just depends on who is working, but I like that they separate the noodles and soup in two bowls when I ordered takeout online. When I ordered takeout in-store they put everything in one bowl. Which makes the noodles soggy-ish. And you get less noodles. \n\nThe Kitsune udon is my go-to. Light, flavorful broth. Clean. \n\nSo far, I haven't enjoyed any of the tempura I've ordered (have tried the fish cake, egg, and broccoli). Will try again next time.", "author": "Ashley S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-02", "description": "Late weeknight comfort\n\nCurry beef udon\n- delicious broth and good quality texture noodles\n-soft boiled egg is always a good addition to noodles,  glad they had this option\n\nAmbience is cafeteria style\n\nWith reasonable price for good food,  this place is one of those few places that we gotta keep alive in SF", "author": "Tina A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-28", "description": "A little expensive for what you get (even for downtown SF), but really solid, fresh food. The line moves quickly, and the atmosphere is clean and inviting. The tempura is awesome, and a great add-on to the main entrees. Will definitely be back!", "author": "James E."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-08-22", "description": "As an avid foodie and a pop-up restauranteur, I'll probably say some things that sound harsh but hopefully they utilize my feedback. \n\nThere were several things I identified that could use some work. I breakdown noodle soup into three main components. The first is the broth, second is the noodles, and lastly is the toppings. Ill start with the soup. I ordered the Niku Udon. The broth is claimed to come from fish and beef. At first sip, I felt it lacked a true depth of flavor. It wasn't salty enough nor was there enough beef or fish flavor. It also was extremely sweet which might have overpowered any natural beef or fish sweetness. The noodles are precooked and rolled into batches. When you order, they do a quick parboil to reheat the noodles. Since the noodles sit on a rack, the internal temperature and external temperature is different. Even after the parboil, the noodles aren't completely hot. One thing I did like about the noodles was the texture. It was chewy and bouncy at each bite. You've got to eat fast though or else it will start to soften and crumble. Lastly, the niku beef was so overcooked, it was like chewing beef jerky. Kagawa-Ya separates the beef and broth in different heated containers; however, this just allows the cooks beef to continue to cook which brings it to the point of over cooking. In addition, since Niku beef is supposed to be braised, they should probably use meat that has more fat content. \n\nAt $14 a bowl of Niku Udon, I expected a lot more. I've had plenty of experience eating in asian countries where Maragume Udon is like their McDonalds. I don't think I'll venture back here to eat unless they change the process they make their beef and broth. And for those that want extra udon, it is $3. So at $30 for my two Niku udons and an extra portion, I don't think it was quite worth it. The food they presented to me more closely aligns to a price tag of $6 per bowl. Save your money and go get poke at the Twitter market. I have attached a picture from Kagawa-Ya with the dry beef :(", "author": "Jason W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-04", "description": "Ate here after some drinking down the street at Beer Hall. Had not been here before and only just pulled it up on my Yelp app while drinking a beer with my friend.\n\nWe were glad to see plenty of seating inside on a Friday night. Didn't know it was cafeteria style but I was pleasantly surprised once I paid up and got my food! \n\nI ordered the tomato broth udon with shiitake mushrooms (vegetarian option). I wasn't feeling too much meat that night and actually really glad I got the veggie option! It was really good mmmm. I also grabbed a Spam musubi for an additional $3. My total came out to around $13. \n\nThe biiiig hoooottt bowl of udon was really nice to have on such a cold SF night. As others have said, the tomato broth was more of a paste consistency. It was like eating pasta almost - but it was great! I also agree with one reviewer that it was reminiscent of all the sweet Asian tomato sauces I've had in my childhood (and adulthood, who am I kidding). My family will sometimes make 'Asian style' pasta with a sweet tomato sauce with hot dog and mushrooms. My veggie udon reminded me of just that! \n\nYum! Simple and affordable for the area this place is in. Right under Uber headquarters (must be busy during lunchtime!)", "author": "Shanise M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-06", "description": "If only my office was closer to Kagawa-Ya, I would come more often for lunch.  ha!  Maybe it is better that I am in the Embarcadero *wink wink*\n\nThis is my second visit!\n\nCame here on a Tuesday, 12:30pm.\nSimple concept - cafeteria style.  Take a tray, order your udon, slide down a bit to the opening so your bowl of noodles can be handed to you.  If you want some tempura, grab a plate and help yourself (using tongs of course!)\n\nI ordered the Creamy Kabocha Chicken - and it was SO GOOD!!  The noodles are perfectly cooked - thick, chewy and perfectly satisfying!  The broth is teeny bit sweet probably bec of the pumpkin squash.  Note- this is NOT curry.  It may look like it, but it has cream to thicken the broth.  The green onion + nori topping added a really nice touch!\n\nAs for tempura, I decided to just try one - the sweet egg... delicious!\n\nI enjoyed every last drop of my broth and every single udon noodle.  I would definitely come back.  Only thing I wish was for the broth to be a bit hotter, but no biggie.\n\nThe place was spacious and clean.  Price point was fair given that this is located in San Francisco.  Staff was friendly.", "author": "Margaret W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-08-21", "description": "Yaki too.   Like the food and service.   Yaki plate was huge. Place is pretty bare inside. \n\nI have and will keep coming back.", "author": "Larry W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-20", "description": "Still coming here, its always on my radar. I'm not a huge mushroom fan but the mushroom udon broth is wonderful.", "author": "barbara r."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-12-11", "description": "Creme of clam tasted like potatoes.  Not a clam in sight.  The bacon crunchiness to offset the warm guey noodles was a nice touch.\n\nBut at a $12 price point I wanted clans, not to be switched to potatoe which is what the noodle should gave been called.\n\nThough the review is biased downwards it's because mainly of false advertising and cost.  Add tax and could tempura it was $17 for a super small bow of Campbell's soup.", "author": "David H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-22", "description": "I finally go to try Kagawa-Ya Udon in Mid-Market past The Market building.  You line up and tell one person what dish you want, they make it, you pick it up and then grab maybe some more food, and pay.  Super easy and Fast!\n\nI got #5 Creamy Kabocha w/ Chicken Udon $12.  Sign says broth contains chicken & fish, Pumpkin squash broth, chicken, cream, green onions, nori & bonito flakes.  It's pretty tasty, chicken can be dry, but with the soup it made it fine, tasty udon noodles - bouncy and chewy, not sure I tasted the kabocha I guess it's mushed up really well in there.\n\nI also got a beef Onigiri $3 - I didn't follow the directions on the plastic sleeve on how to open it so it was difficult and not how it was suppose to be, it fell apart and I just dumped it into my soup.  Tasty enough.\n\nThey sell out quick on the Spam Musubi $3 - so get there early if you can.\n\nThey take credit cards, think I saw a bathroom need code - didn't use it.\n\nHelp yourself to free ice water on the other side, and Rooster sauce, Katsu sauce, Tempura sauce on the side table too.  Bus your table after you are done.\n\nHrs: M-F 11-2:30pm, 5:30-8:30pm\n\nNext time I want to try: Cream of Clam & Leeks $12", "author": "Ann L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-09-20", "description": "Eh, I've had better udon. \n\nPopped in for lunch yesterday at Kagawa as the photos looked really good and I hadn't had udon in a while. Unfortunately the result was lackluster and just ok. \n\nThe concept makes sense for the location (next to Uber and Twitter) but, it felt a bit to cafeteria to me and didn't make for a great experience. I ordered the #3 (beef broth, shredded beef/onions) and added a couple pieces of tempura. The broth wasn't as flavorful as I had hoped but, the udon noodles and tempura were pretty good. \n\nAll in all it's not a place I'd visit again but, I understand the appeal for those lunchers in a rush.", "author": "Benjamin F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-01", "description": "Dinner review. Udon-ya.\n\nOrdered:\n#1 - Fish broth\n#6 - Kabocha broth\nTempura crab\nTempura fish cake\nTempura shrimp\nCurry potato\n\nOverall, not many udon shops in the city. Probably the best option. \"As good as it gets.\"", "author": "Mark O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-09", "description": "Pro tip: if you check in on Yelp, you get a free tempura of your choice. I would give this place 3.5 stars if I could. I came here during dinnertime on a Wednesday, and there was hardly anyone in the restaurant which was refreshing, given most places in SF always have a wait. \n\nThe set-up of the restaurant is like an udon bar where you get a tray, order your meal, receive it, and find seating on your own. It felt like a model of the famous Marukame udon bar in Honolulu. \n\nI ordered the kitsune udon with a poached egg and a shrimp tempura on the side. The broth was not hot enough for me, and the noodles were still a bit chewy. The broth was decent, but I prefer a stronger taste. There was a good amount of food though, with ample veggies and wakame too. It was a decent, convenient meal close to Civic Center Bart. I also liked how they gave us free onigiri when they were closing to avoid letting it go to waste.", "author": "Victoria L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-17", "description": "Great for those who has problems making choices since the choices are few.   I had the sweet bean with ground beef udon.  I enjoyed the home made el dente udon.  One bowl will satisfy your appetite, it did for me.  Cafeteria style, stand in line to order.  They give your bowl if udon to you immediately with or without extra cilantro.   Check in yelp and you get one piece of free tempera.  They keep replenishing so it should be new.  My friend had the beef soup udon.  It smells great.  Choose your drink.  Pay. Find a table and slurp up.  Bus your table.", "author": "Helen L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-09-19", "description": "Parking is super difficult here, since it's on the same street as the Westfield Mall and right next to the Uber corporate office. We came in at around 5:30pm on a Tuesday, and there was plenty of seating. The restaurant is really big and there's plenty of seating. When ordering, you first choose which udon soup you want, and then there's a section where you can choose which tempuras you want. \n\nI went for the niku udon and it was a good size, with a lot of beef and onions (almost 1/3 of the portion was meat, which was nice if you like meat in your noodles like I do). The broth was flavorful and light, and I enjoyed the noodles, which are supposedly handmade. However, I have had fresh udon at other places, and this spot was just alright. The broth and noodles didn't stand out too much, but it's a good place for a quick lunch or dinner. However, it's pretty pricey--the niku was about $13 and it didn't come with the poached egg; that has to be added for an extra price. The food was definitely a 3.5/5 but I am rounding it to a 3 because of the price and parking. \n\nI would definitely come back if I was in the area, but I would't make a trip to the city just for it.", "author": "Sandra S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-10", "description": "I finally got the chance to come back to Kagawa-Ya. I thoroughly enjoyed my Kitsune udon. Delicious, comforting broth with fresh udon, seaweed and sweet soybean skin. I added a few pieces of tempura - light and crunchy. \n\nSince my Kutsune lunch was so satisfying, i ordered the Spicy Beef Tan Tan Udon to go. I just ate it for lunch and it's become another favorite! The broth is spicy, rich and flavorful; the bean sprouts provided a nice crunch and the cilantro added a fresh note (yes, I like cilantro). \n\nI will definitely be back! But I won't know what to order; Kitsune, Spicy Beef Tan Tan, Curry...", "author": "Mary L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-03-23", "description": "Pricy and overrated. \n\nThe noodles are made quickly, but besides that selling point, Kagawa-Ya Udon does not have much else. I tried the Niku Udon, which came to around 15.19 with no add-ons, and consisted of a very simple bowl of udon. There was plenty of beef, but it and the broth were not very flavorful. The noodles were also really soft, even though I ate it immediately afterwards. \n\nIt's just not worth it, unless you are in a hurry, as there are so many better places nearby.", "author": "Hannah H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-17", "description": "I stumbled upon this place by happenstance.  Among my numerous trips to Japan the one thing I truly missed was a good bowl of udon noodles.  The place is in an economically upon and coming area - but is new & clean inside.  The staff was nice and smiles!  The portions good sized, but pricey for udon.  The taste wasn't quite like Japan (maybe a little sweeter broth - could quite finger it) but good for the states. I tried the beef with a shrimp tempura piece.  Tempura wasn't life changing - in the US the batter is almost always too heavy & such was the case here.  But all and all my noodles tasted good for my American pallet. And that's what really counts.  You'll never get an actual Japanese taste in the US as the chemical composition of water is different (for starters) which impacts almost everything served.  But if I found the place delicious and am very likely to return.", "author": "Robert C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-18", "description": "Went here for lunch and got the niku udon plus some tempura (fish cake, shrimp, and a giant zuchinni). Both yummy. The broth was flavorful and they gave a lot of beef. The tempura was crunchy and perfectly cooked.  Service was quick and the place was clean.  I also took a spam musubi but was too full to eat it.  It's sitting on my desk waiting for me to demolish it still. \n\nMy friend got the creamy udon and a curry potato tempura. She said the potato needed more curry. \n\nIf you are going to compare this to the amazing Marakume Udon in Honolulu you will find that it's not better, but a good substitute. I would go here again. My only wish is they expand their hours since it's not easy to get out here on a workday and to expand their tempura selection.", "author": "Joanne T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-27", "description": "I really like the soup at Kagawa-Ya Udon and I'm happy they have a spot on Market. \n\nIt's cafeteria-style with just a few options on the menu for quick service. I've had the kitsune udon and the pumpkin one. Both are delicious and very filling. The only one I can't eat is the soup that has beef in it. I know I'll have to come back and try the veggie option and the cold udon. \n\nI find the broth in the kitsune to be comforting, and I like the different textures from the tofu skin, tempura bits, and the seaweed. The tempura, after awhile, gets soaked into the soup so I prefer to dine in when choosing this option.  And the udon itself is cooked perfectly. The noodles are thick and have a good bite. \n\nThey also have assorted tempura for $1.50 each. As my coworker says, my eye be pimpin my brain because I always order at least 2 pieces of tempura, but can barely finish my lunch because the soup is so filling! Luckily I didn't get the musubi. That would've put me over the edge. So far I've had the shrimp tempura, curry potato, and the fish cake. Crunchy and it's not too greasy. \n\nThe space is open and very clean. The are different table set ups so it's easy for groups or solo diners to sit among each other. \n\nThe soups are around $11, and go up from there. I find it's a good place to easily get lunch, or dinner after work if you're really hungry, in the area, and just can't wait to eat.", "author": "Vira P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-07-20", "description": "It's okay. \n\nI ordered the Niku Udon, added an egg, and then picked up the fish cake tempura, chicken skewer, spam musubi, and a beef rice ball for later. \n\nNiku Udon - As most people have described, the udon itself is chewy and has a pleasant texture. What's really lacking here is the broth flavor and dry, unpleasant, flavorless, beef. The broth is too mild to deliver any flavor to the noodles, maybe a bit more dashi? Beef was horribly cooked (or possibly the wrong cut of meat is chosen here) and absolutely did not warrant the $14 base price of this bowl.\n\nFish cake tempura - Added to my bowl, tasted very delicious while lightly soaked with the broth. Didn't have any excess oily bits. Their tempura is probably the real star here.\n\nChicken skewer - Flavorful and juicy. Nothing unique, but tasted amazing in comparison to the \"ok\" udon.\n\nSpam musubi - They've folded in a lot of furikake, not sure it does much though. It's salty meat and rice, you can't really screw this up.\n\nNiku rice ball - Okay, I'd just like to clarify that had I known the meat in my udon was going to be dry and gross I would have avoided this entirely. This only gets its own section still because this was the weirdest rice ball I've ever had in my entire life? Again folded in with furikake, but the meat, instead of being in the center, was also folded in with the rice? It was literally all over the place and just made the entire thing taste like college ruled paper. Disgusting.\n\nI wouldn't go out of my way to come back here, but if I'm in the area I might pick up a piece of tempura or something.\n\nEdit: To the owner, thank you for responding so quickly. While I appreciate the suggestion, I don't believe a curry (or other) udon is the appropriate solution when the udon I was looking forward to was so vastly different. The larger problem overall was the beef, not the broth.", "author": "Nikki L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-24", "description": "Ready to go, fast casual udon. I'm a fan. Small menu, so for those of you who complain about not having options.. uhhh, this is so you get in, eat and get out. Go elsewhere. You're missing the concept.\nI personally don't mind a small focused set menu. They also say no substitutions. \n\nI would say Kagawa-Ya is decently priced for the area, but it can definitely add up. \nI had the beef curry udon ($13) but added a soft poached egg (additional $1.50 I think). I decided what the hell, why not go all out and picked up spam musubi ($3) and a Hawaiian Sun drink. After tip and tax, I somehow blew $22 for lunch.  I'm a big eater so I finished everything and was left satisfied. \n\nBeef curry was quite good. I enjoyed it because it wasn't overly salty and the beef was incredibly tender. Worth the $13. Noodles were al dente. Soft poached egg was delicious and worth it. \n\nSpam musubi had too much rice and I think the spam could've been grilled longer. Will be back for niku udon and curry croquette!", "author": "Susy C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-04", "description": "Fantastic udon at very reasonable prices. The richness of the broths and the freshness of the noodles are both excellent. Love Kagawa-Ya!", "author": "Eric B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-03", "description": "Come before 12pm to avoid long lines. Check in for a free tempura. All broths are pre-made and they just pour it over the udon which is made when ordered. I got the Cream of Clam and Leeks Udon and I have to say it was so bomb. It was like clam chowder with udon lol. Sad I think there were only a couple of pieces of clam. I thought it tasted pretty good. Portion was good, since udon is pretty filling. I would definitely come back for lunch.", "author": "Benita M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-07-19", "description": "I hate ranting but I think I could get similar udon at any other Japanese restaurant that doesn't solely focus on udon.  The tempura was also dinky, not hot, and not fresh.  Udon isn't high on my list in general but after eating here, it makes me want udon mizugo in jtown even more.", "author": "Vince L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-09-25", "description": "Not my favorite place but I live nearby so went there to try it out because my wife was sick and I didn't feel like cooking after a long day of work. Overall, this place is a nice place for busy techy who work near by. But a place to go out of my way to eat there I don't recommend it.", "author": "Michael Q."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-28", "description": "I came here in a hurry with a 30 minute lunch in between meetings since I was in the area and I heard that this place is super quick - and it is! I'm really amazed at how fast it took for me to be in & out of this place with a satisfied tummy :) \n\nI ordered the creamy kabocha udon and the creamy croquette. The broth was very rich and flavorful, but did not taste fatty and oily like ramen broth. The texture of the udon was great as well. The creamy croquette was just OK to me, but I think I'll give it another try next time - maybe the regular croquette. The bowl however, was pretty small though and a little pricey for its size, however it is super convenient and I would definitely come back if I'm in a hurry and don't have much time for lunch. The service was also great. The cashier was really friendly and helpful. Overall, great lunch spot, especially if you're going for a quick lunch.", "author": "Bailey L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-02-18", "description": "Was looking forward to this place since it opened, but never had the opportunity to be in the neighborhood until this past weekend. The menu prices were not the cheapest for udon, $9-$15. I opted for the #1 kitsune udon (no meat, but had greens and tofu) and with a check-in offer of a free piece of tempura. I got the chicken tempura and a curry potato croquette making the total to about $13. \n\nThe tempura and potato were cold and didn't taste very fresh as it was probably sitting out for a while. It was a Saturday afternoon, so probably not as fast-paced and busy as a weekday. There was a good amount of udon and the greens were good, but the broth was super salty. \n\nThe location is pretty close to Twitter and a bunch of other tech companies, so I can imagine it gets pretty busy during week day lunch time. Definitely not worth the trek of going to the area specifically to try this place.", "author": "Christina G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-25", "description": "This is probably one of my new favorite spots in the city :) we stumbled upon this udon restaurant yesterday and boy I must say I'm so happy we did . This establishment reminds me of the set up of marukame udon  in Honolulu Hawaii . Like marukame they also hand make their udon noodles every few hours . You can tell the put a lot of pride into their Craftsmanship . My only gripe about this place is My soup was not extremely hot and i received a under cooked Broccoli tempura :( \nWill be back to try our more goodies", "author": "Monica M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-28", "description": "Kagawa-Ya Udon is perfect for a quick and casual bite to eat right before heading to a show. My friend and I had tickets to the Nutcracker on a Wednesday night, and I picked this spot since I've been meaning to check it out and it was conveniently nearby.\n\nOrdering is super simple. You choose a base udon (they have a decent selection with 7 options) and then grab any additional tempura toppings you want. \n\nI wasn't that hungry, so I went with the basic kitsune udon ($9.50), which comes with dashi broth, sweet soybean skin, wakame seaweed, tempura crunch and green onions. The kitsune udon doesn't come with any meat, so I also helped myself to some shrimp and fish cake tempura.\n\nTo me, udon is a simple but delicious meal. The hot dashi broth really hit the spot for a cold winter's night in San Francisco, and the shrimp and fish cake tempura helped add some flavor to what would have otherwise been a bland bowl of udon.\n\nThe space is nice and big too. It was well lit and had a very modern look to it. Given that it was a random Wednesday evening, it was pretty empty and we were able to take our pick of seating.", "author": "Dianna H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-01", "description": "Good, casual spot for a quick lunch if you're feeling something soupy.  I got the Creamy Kabocha w/ Chicken Udon and it was nice and creamy (as advertised!), with the chicken being super tender and the noodles having a great spring to them.  My only wish was that the soup was actually hot as it was more of a lukewarm temperature but overall good flavor.  I also got a side of the tamago tempura (really interesting as I haven't seen this often anywhere else and the sweetness was a nice offset to the rich Udon though a bit warmer temp would've been nice) and chicken kara-age which was fine but again not super fresh.  $12 for the udon and $1.50 per side so a bit on pricier side at $16 for lunch but sadly par for the course in SF.  All in all I'll likely be back to try other udons and sides!", "author": "Aaron K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-12", "description": "I love that an udon place has opened up in this area.  However, prices and quality of the udon is a bit disappointing.  I ordered the #1 Kitsune.  It's the cheapest option and the most basic udon with two pieces of soybean skin.  However, the price increases when you add on items.  Each piece of tempura or egg costs $1.50, which is quite pricey.  Taste-wise, the broth itself is very nice, but the udon was a bit too soft me.\n\nI might come back if I'm ever wanting a bowl of hot noodles, otherwise, there are better price options for lunch.", "author": "Karen L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-03-03", "description": "This is one of your semi-fast food joints that does a solid job, but isn't anything to write home about. Also, when we got there, they ran out of noodles, so the quick eat draw got thrown out the window when we had to wait for the next batch to be done. \n\nThe noodles were well done, but the broth was a bit on the sweeter side. Also, compared to marugame, I would have preferred to be able to add my own green onions, tempura topping, etc. but, the tempura here was better, imo, than marugame. It was fresher tasting and crispier - I tried the fried fish cake and highly recommend it. I got the niku ramen, and it came with LOTS of meat...I would argue too much and that the ratio was off, but I know that doesn't affect most people.\n\nRecommend for a solid quick stop if you're in the area, but not worth navigating to just to try.", "author": "Annie S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-01-08", "description": "My friends and I were really excited about an udon place opening up in SF. All in all, the food wasn't bad, but it was a little pricey and lacked the refinement I would've expected from the price and the hype. The noodles themselves were fine, but the broth was seriously lacking. Though udon broth is not as rich as ramen broth, it should still be flavorful and unique. I didn't feel that came through. The choice of broth and toppings were good, but it just adds to the price.", "author": "Sherry L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-20", "description": "Came here on a Wednesday night before catching a show at the SHN Orpheum. I arrived a little bit after 6:30 and was slightly worried because they closed at 7PM. Ordering was super easy and the food came out fast. We ordered the Kitsune Udon and the Niku udon and got a spam musubi, sweet egg tempura, and a curry croquette. I didn't think anything special about the noodles. I thought they would boil the noodles when I ordered it but what I saw is that the noodles were already boiled waiting on a steam bed of some sorts. \n\nThe broth for the kitsune was very good and I liked the kitsune although different than what I had before. Their kitsune is a sweet soy sauce flavor which I liked. \n\nThe Niku udon was okay. The broth was too sweet for my taste. It reminded me of kbbq marinated bulgogi but udon style.\n\nSpam musubi was good but I thought the proportions were off. Lots of rice compared to the thickness of the spam. Made it seem healthier though.\n\nThe sweet egg tempura I got because it seemed interesting. It was okay, wish it was softer and air-re-er (I don't know how to spell). \n\nThe curry croquette was just okay too, I've had better at Nijiya market. Probably would not get that again.\n\nOverall pretty good and glad I made it in time!", "author": "Avita S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-04", "description": "Great meal for the price and super yummy. Not a huge noodle fan but this place is one of my favs. Local ownership, great menu options, and friendly staff make this a place you'll want to keep coming back to.", "author": "Katherine M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-03", "description": "We really like Kagawa-Ya.  We have been there a a bunch of times and they have never disappointed.  It has become our go-to comfort food spot. The noodles are amazing. Try the curry too! It's my favorite.", "author": "J D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-30", "description": "On a week with no work I had to pop into Fatted Calf for something, and decided I'd have lunch nearby.  I chose to eat at Kagawa-Ya since it's only open on weekdays.\n\nThis is sort of like Marukame-light.  Last time I was in Hawaii I had Marukame Udon and it was great and a fun concept.  You get your udon (with handmade noodles) and a selection of tempura to accompany if you so choose.\n\nThat's basically what you get here as well.  I don't know if there's quite the selection of tempura but otherwise it's pretty much the same experience.\n\nEverything I had was tasty and being that I came in at the tail-end of lunch hour I was able to get my food pretty much immediately.  I got my kitsune udon and 3 pieces of tempura for around $15.  If I find myself in SF on a weekday I'd return for sure.", "author": "Brent T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-19", "description": "Had the opportunity to eat here for dinner during my short stay in SF. I ordered udon with some added spice and it was pretty damn tasty. The wife had the curry udon and she thoroughly enjoyed it. I'm usually not a fan of batter but I have their tempura a try after hearing my wife recommend it and it was definitely worth it. If you are in the area I highly recommend you try their udon! \nAnd their service was pretty good. We had a lot of questions about the food and they were very friendly and offered some sound suggestions.", "author": "Howard T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-16", "description": "Very clean and spacious!\n\nBeware they ask you not to make substitutions and just choose a number option. The unique part is the little tempura bar they have set up right before you hit the cashier station. I think people should just get a separate little plate for your tray if they want to add on tempura pieces otherwise it gets soggy from the broth when you place it in your bowl.\nAlso something I didn't realize until halfway through my meal was that there is a water/condiment table around the corner from the ordering area. I guess I missed it as I walked in. If you don't notice it at first like me then you will notice it when you are bussing your dishes because you pass the condiment station to get to the dishpit area.\n\nIn terms of the food, I found the #5 to be a bit bland but the over all dish was very filling. Because of the kabocha as the broth it was heavier and creamier. I also added the rectangular sweet egg tempura to my dish. That was interesting and I hadn't seen that before. It tasted like a sweet omelet rolled up. The eggplant looked like it was cut in a very unique way and not just sliced. I'll try something different next time!", "author": "Laura Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-25", "description": "Had great udon. This place is a good pick me up on a cold date. Also love spam musbi, can't get enough.", "author": "Mike J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-25", "description": "Since there are probably a decent number of people familiar with it, I'll compare Kagawa to Marukame Udon in Hawaii (which is usually in Yelps top 100).  Kagawa-Ya is a cafeteria style udon restaurant in the heart of SF.  It has a good variety of udon choices as well as tempura.  I was even surprised to see spam musubis!  \n\nWhile the pricing isn't all that cheap, the portions for their udon are pretty large.  The tempura is about the right price at $1.50 per piece (regardless of vegetable or shrimp tempura).  Spam musubi is quite pricey at $3.  I ended up going with the Kitsune Udon which came in at $9.5.  The only udon under $10 just fyi.  Anyways, it was alright.  The broth had a great dashi flavor, noodles were cooked great.  The inari was just ok, a bit too big, would've been nice if it had been cut in half or something.  The inari also felt rather thick.  The shrimp tempura was okay, seemed like frozen pre-battered kind.  The vegetable tempura was great, I was glad they had pumpkin tempura available.  As for the spam musubi, it was good, the rice was seasoned with furikake which added some extra flavor.  It didn't appear to have any kind of teriyaki sauce like you might find in some musubis.\n\nOverall, it is no Marukame Udon, however, it is a good attempt at the cafeteria-style udon restaurant.  The food here is great if you're craving udon, especially since there aren't many restaurants in the Bay that specifically specialize in udon.  Personally, I wish the udon had a small-sized available, that way I could eat more tempura.  The udon portions are quite large.", "author": "Bryson L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-17", "description": "I ordered the Niku udon. The broth was good, not heavy but flavorful. Meat was pretty tender and complemented the soup well. Additionally, the udon was a good consistency. The egg was a little too runny for my taste, but others may like it to seep into the soup the way it did. \n\nI think the only real drawback is that, despite being peak dinner time, they ran out of udon noodles, and some guests either left or had to wait upwards of 6-7 minutes, like me. (This is in addition to waiting in line while others ordered, so our wait time was probably like 15 min for what should be a 5-minute deal). My friends and I chose to eat at Kagawa-Ya because we were in a rush and knew we could get a quick yet delicious bite before heading off to the ballet a few blocks away. Unfortunately, the precious time we lost waiting for the udon to cook meant we had to gulp  down our food as fast as possible without really enjoying it. \n\nOf course, once the noodles were done cooking, everything else went as planned in a timely manner. Not the best first experience, but I'd come back!", "author": "Jennifer L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-28", "description": "First time here and i can already tell that this will be a regular place for me when it comes to udon. The noodle is excellently cooked not over cooked like other places broth is seasoned well salt is over powering the main ingredients of the dish and plus they serve soft boiled egg which  i dont see all the time in any noodle noodle place ive been. Just a heads up this is a self service noodle place not a full service restaurant but who cares  as long the place is clean and serve a really good food", "author": "Allan A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-12", "description": "Yesterday, I was walking to The Market in the Twitter building to grab a quick bite when I saw Le Boss walk out of Kagawa-Ya. \n\nLe Boss: \"Hey, you try this new udon place yet?\"\nMe *SHOCKED*: \"No, I haven't...I'm going later this week.\"\n\nLe Boss: \"You gotta try it, it's soft opening today and grand opening tomorrow!\"\n\nI stood there in a state of shock. \n\nWho is this hip, foodie guy? \n\nI guess you can't judge a person by their favorite restaurant, even if it's iconically horrendous (Sinbad's: https://www.yelp.com/biz/sinbads-pier2-restaurant-san-francisco-2). At least it's famous for something?\n\nEven though I had plans to visit Kagawa-Ya later this week, I decided to stop by yesterday to give it a try. Kagawa-Ya's specialty is their housemade udon which is served 5 different ways ($9.50-$14): warm dashi broth, cold dashi broth, braised beef, beef curry, and kabocha. You can add a side of tempura (shrimp, kobocha, sweet potato, broccoli rabe, or tamago) or an soft boiled egg for +$1.50 each. If you're not feeling noodles, they have a curry rice option (beef or vegetarian). They also have sides like spam musubi, inari, and onigiri. For those with MSG sensitivities, the staff told me that the curry contains MSG but the dashi and creamy kabocha doesn't. \n\nIt's a fast casual eatery - line up, grab a tray, order by number, watch your order being assembled, grab a plate and pick out your choice of tempura under the heat lamps, grab your udon/rice bowl, and pay. I appreciated that the tip choices were 5%, 10%, and 15% unlike some fast casual spots who program the tip choices as 18%, 20%, and 25%. I always tip for fast casual but you shouldn't expect customers to pay the same tip as a sit-down restaurant when they're having to serve and clean up after themselves. \n\nI love kabocha so I naturally gravitated towards #5 Creamy Kabocha Udon w/ roasted kabocha, dashi broth, cream, nori, green onions, bonito ($11) and added tempura shrimp, kabocha, and sweet potato (+$1.50 each): http://bit.ly/2p66i5C. Since the udon just contains noodles and broth (no kabocha), I highly recommend adding tempura for a full meal. \n\nI really enjoyed the creamy kabocha broth which was deliciously creamy with a good savory sweetness. The housemade udon noodles were al-dente but were missing that toothsome chewy bite. The tempura was nicely battered and fried producing a light, airy crunchy exterior. It was perfect for dipping into the creamy kabocha broth. I just wish the tempura was warm. Even though the tempura was sitting under the heat lamp, it was tepid.  \n\nService was friendly and fast. I was in and out in less than 20 minutes making it the perfect quick lunch spot. My only suggestion is to place the water dispenser out front so the cashier doesn't have to be bothered with filling cups when they're ringing up a customer.  \n\nFormerly Happy Donuts, the new space is spacious and contemporary. There's seating for about 40 - two-tops and communal tables. I like that there's an open kitchen so everything is transparent.  \n\nKagawa-Ya is a great addition to the Mid-Market lunch scene especially on cold, foggy days that call for a piping hot bowl of soup. But, just like with most of the new fast casual eateries in the city, it's not cheap. It was $18.50 out the door for lunch (no drink). I guess the $20s is the new $10s [lunch]?", "author": "Cherylynn N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-13", "description": "Not sure what to expect at first... but this place is a cute restaurant on market street. It's good for lunch breaks and In betweens. I ordered the mushroom udon and it was super delicious!!!!", "author": "Summer M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-08-07", "description": "Everything already made, just needs to be mixed in. A decent menu and options. Overall, I was happy with my udon but it wasn't special or anything. Felt that the udon and tempuras were overpriced! So given that, 3 stars for decent/ average udon in the city", "author": "JJ W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-03", "description": "If I have to describe this place in a few words, it would be 'udon fast food' but don't the fast food part fool you because this place still has the fresh udon noodles, flavorful broth and jam packed with meat and whatever topping that comes with your particular order. \n\nOther than the complaint that this place closes too early (7pm on weekday), this place is a great and fast place to grab dinner. You grab a tray, tell the person which udon you want (menu on the board) and within 1 minute, the noodle, broth, meat and topping is all scoop inside a bowl and passed to you. You can then proceed to add a half boiled/poached egg and grab individual fried tempura ($1.50/piece) to your liking. Katsu, tempura sauce on the side when you're down paying.\n\nI got #3 Niku udon, which was essentially beef + onions. The broth was very rich and flavorful. They were pretty generous with the amount of beef, to the point where I couldn't finish it. I added a half boiled egg, and it was the perfect consistency.  Additionally also got some tempura-- which were still crispy regardless of the fact that we got the last pick of the last batch. \n\nEven though you don't get direct table service, the customer service here was excellent. The dispenser was out of tempura sauce, and they were unable to make a fresh batch since we came right before closing. Came back around and they poured out what was remaining in the dispenser for us to use. \n\nTLDR; Fast food style udon with fresh ingredients. Overall good food and would definitely come back again. Great service!", "author": "Jenny N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-19", "description": "This place is dope! I've never really been into Udon, but I know every time I see one of my friends in Hawaii eating Marukame, I want tempura. What's not to love about tempura? \n\nIt can be on the pricey side, I think I ended up paying $20+, but I got a kitsune udon (beef sounded too heavy at the moment) with a bunch of tempura and a spam misubi and poached egg. Very tasty, and now I like udon, but probably only from places that have tempura (since tempura is awesome).\n\nIt's too bad this place is so far away. We need one of these down in the south bay so I don't always have to go up to SF to eat this :).", "author": "Kenny N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-24", "description": "Fast casual udon bar with a bunch of soup choices and an à la carte tempura bar.  Seemed like comparable quality to Ramen Bar.  A strangely huge space given the sparse seating; hope they aren't being gouged in rent.\n\nNiku Udon: The udon noodles were large, firm and delicious.  The broth had a heavy ginger streak with some beefiness mixed in.  The meat was just ok.  It was like something at Yoshinoya, but clumped together and not as thinly sliced.  I kinda prefer the Yoshinoya beef more, though everything else in the Niku Udon was better.\n\nCurry Potato: A creamy curried potato mash deep fried in the shape of a hash brown.  Quite filling and bursting with texture/flavor contrasts.\n\nShrimp Tempura: Pretty much what you'd expect.  Compared to the Curry Potato, it wasn't as good for being at the same price point.\n\nBeef Niku Onigiri: Interesting presentation where the seaweed was wrapped in plastic and then wrapped around the rice/beef mixture.  The pro is that you are guaranteed a crispy non-soggy seaweed wrap.  The con is that you probably can't wrap an onigiri like a professional.  The filling was just ok; felt a bit skimpy on the beef since it look like just flecks.", "author": "Adam B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-12-29", "description": "Niku (beef) udon, $14\nTaste: broth has a little sweet taste. Beef was soft\nshrimp tempera, $1.50\nsweet potato, $1.50\nTotal plus tax: $18.44\nI don't hate it but I don't love it. Environment was cool but not worth it. Still hungry :(", "author": "Jasmin T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-05", "description": "Good size bowl of udon but broth was not hot enough for me.  Check in on YELP and get one free piece of tempura.", "author": "Agnes K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-06", "description": "Walked by this place a couple of times as I was visiting friends in Uber/Square. Turns out they share a building! It's right off Market, so it's hard to miss. \n\nGot the curry udon, and boy did it taste like heaven. \n\nIf you're a udon lover like me, you should definitely try this place out! Has nice wooden tables for nice instagram photos too.", "author": "Cheechee L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-25", "description": "Awesome! Great finesse and skill in the dashi broth, fried tofu, tempura, and fresh made noodles! People are so nice too! Their kitsune udon is the taste of my childhood! Great job!", "author": "Young I."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-08-15", "description": "Overpriced noodles and soup. While the broth is kind of light, there's not much to be desired by this. I can see it it's a cold day this might be a good place but otherwise i would not recommend this place", "author": "Jaymon H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-15", "description": "This place is bamb. \n\nTried the kabocha/chicken udon and their monthly special - the spam fried rice waffle stuffed with karaage \n\nI was impressed. The kabocha broth was delicious and creamy with the perfect ratio of noodles, soup, chicken and garnish. My eyes were bigger than my stomach and I was unable to try the SFRW and took it home.\n\nBut wow - it was delicious. Such a creative combination of ingredients with a wonderful presentation. I hope they cycle it back into their specials or add it into their permanent menu!!  \n\nA lot of folks complain about the prices but uh, I'm sure their rent is through the roof! Things to consider, yelpers... I'll definitely be back!", "author": "Fuu C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-21", "description": "You know, I can't believe my unbelievable luck of having two new udon places open up in SF during the past year. Udon is one of my favorite foods, and to have smacked right on Market Street makes it even better. I was very excited to try out Kagawa-Ya, and I came here on a weekday evening with a friend to satisfy my hunger for udon. I was expecting it to be really crowded here since it's smacked right in the middle of where all the tech companies are and we came during dinner hours but was surprised when it was at 20% capacity. The good thing about that was that we got to choose our seats, and we decided to sit on the stools by the window peering outside. \n\nWe then went up to the line and ordered our respective udon dishes. I decided to go for the Beef Curry Udon and for the tempura I got the sweet egg tempura, vegetable fritter, and the curry potato. They have a wide selection of tempura and I like how you're able to just choose one of whatever tempura you want instead of having multiple of the same tempura. I sampled the beef curry udon first and was very pleased with my choice, as the curry tasted fantastic and the tender beef just falls apart once I bit into it. What I like even more than the beef personally was the potatoes, and curry is always better with potatoes. One thing about the curry udon is that it wasn't as thick as I would have liked, and this was honestly more personal preference than anything. I moved onto the tempura next, and I started with the sweet egg tempura. I think the sweet egg tempura was alright, but to be honest, I never had a sweet egg tempura before, and I think it's more likely that I just don't like sweet eggs as a tempura in general. The vegetable fritter, on the other hand, was to my liking, and it was pretty crunchy and was a nice meld of vegetables. However, my favorite tempura was the curry potato, since it had a soft crusty exterior and a very soft interior. The curry flavor wasn't strong in the curry potato, but that could be because I was eating the beef curry udon at the same time, which probably overwhelmed the subtle curry flavor in the curry potato. Nevertheless, I felt very satisfied with the curry potato.\n\nOverall, I was very pleased with the meal, and I really like how they gave a generous helping of beef and potatoes with the udon. One thing about the price is, it's actually more than what I would expect to pay for udon, and the curry udon alone was $14. I can somewhat justify this since there were very generous portions of udon, and I did feel really bloated after eating it. I would definitely come back here again, and I could see myself ordering the Creamy Kabocha with Chicken Udon, or the Cream of Clam & Leeks Udon the next time I come here. As an aside, I wish they had more cold udon options besides the regular Cold Udon, and hopefully, they would expand their repertoire of cold udon. Other than that, I would highly recommend Kagawa-Ya for anyone with a craving for good udon in SF.", "author": "Nelson X."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-15", "description": "(Note: I have a very sensitive palate. This means I don't like spicy foods, but I can taste the difference between generic, mass-produced noodles and handmade. If you can't get plain noodles right, you have no right being in business.)\n\nWhen it comes to noodles, Kagawa-Ya knocks it out of the park. My only complaint about the Kitsune Udon was that I ate all the noodles and didn't want to stop! This is udon done right.  \nThe sweet soybean was a pleasant surprise. I also had the sweet potato tempura, heavenly.  My friends got very excited about something that was essentially spam-fried-rice turned into a waffle cone and stuffed with chicken and other goodies.\n\nThe space is open and airy, and always very clean. I love that they have compost, recycling, and landfill bins. The staff is always very courteous to us, and very efficient.", "author": "Teresa L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-31", "description": "Wasn't quite sure what I was going to get with a fast food Udon place but this place was better than I expected. \n\nFirst of all, you can't come to Kagawa-Ya expecting super high restaurant quality Udon. But if you have tempered expectations, I think this place will be perfect for you. The pricing is pretty typical for SF and the portions are about what you would expect for that price. If you start adding all the add-ons, it does get to the pricier end of udon. I got the cold udon dish and it was really refreshing.\n\nDon't come here expecting restaurant quality food. It is a more cafeteria style, fast-food udon but it is good for that experience!", "author": "Cassie Z."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-24", "description": "This place reminds me a lot of a chain I frequented in Japan called Hanamaru Udon where I could reliably get a cheap and delicious bowl of noodles. Kagawa-Ya's selection is significantly smaller (just six options) than Hanamaru's but thankfully one of them is my go to: Kitsune udon.\n\nAs in Japan, at Kagawa-Ya you grab a tray, choose an udon and after you're given your bowl you can serve yourself croquettes or pieces of tempura before settling your tab at the end of the counter.\n\nI dig the concept and the offerings but wasn't wowed by my kitsune udon. The tofu was denser than I prefer and the broth was just okay. The tempura bits that topped the dish turned slurry-like quickly which wasn't so pleasant. \n\nIf I were nearby I might stop in again to try the curry udon, but I wouldn't go out of my way to return to Kagawa-Ya Udon.", "author": "Miriam W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-08-11", "description": "Similar to Marukame, Kagawa serves the same kind of Sanuki style udon in a modern udon bistro and operate in the same cafeteria style.  They said their udon is made fresh daily.\n\nTake Muni and stop at \"Van Ness\" station and it's just a couple minutes walk after you exit to the street level.  It's located in the Square / Uber building ground floor.\n\nTo get your food, just line up like in a cafeteria, pick up a tray, place your order with the person behind the cook counter, grab your bowl of udon, select your choice of tempura ($1.5 each piece) if you want, then make your way down to the end of the line to the cashier for drinks and pay.  Get your water, tempura sauce, utensils, etc...then find your own table, eat, finish and return the tray to the window where they will collect your dirty dishes.  Pretty much everything is self-serve and you can be in and out fairly quickly if there's no line.\n\nTried their basic Kitsune Udon with soft boiled egg (onsen style), tempura, spam masubi and onigiri.  Only recommending the udon and tempura and you can skip the spam masubi and onigiri.  Spam was about a 1/4\" think and rice almost 1.5\" thick, it's completely out of proportion with too much rice.  The onigiri was pretty bland.  \n\nI think I will go back if I feel like a bowl of warm udon soup to warm my soul, I mean tummy in a cold chilly day but otherwise, it's pretty mediocre.", "author": "Shirley H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-22", "description": "This is my go to spot for noodles,  masubi, broth, and specialty drinks in all of sc. They beat out j town and the place on mission across from st lukes. But most def for their broth and noodles which are made fresh multiple times during the day.  I work here in the city as a paramedic and I am always amazed at how fast they make great healthy tasting food.  Even if I only have 3 or 4 mins I can get in and out.  Their prices are more than fair for the amount of food you get.  The place is clean including their bathrooms.  Can't give enough praise!!! The only thing I wish they had was a food truck or cart for when I am posted outside of down town!", "author": "Jonathan W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-10-20", "description": "I had the creamy Kabocha, which was noodles in a pumpkin broth with chicken.  \nThe udon noodles themselves were excellent.\nThe broth and other condiments were good, but I would describe them more as \"interesting\" good and not really \"wow, I gotta have more\" good.\n\nPortion size was average, considering it was a $13 bowl of udon.\n\nI probably won't be rushing back.", "author": "Lewis C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-24", "description": "I got the beef udon. It is good and you can get free tempura if you check in. But I would say it is a little bit pricey compared to some other udon places. But the location is pretty nice and food is decent, really good option if you work nearby.", "author": "Xu C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-01", "description": "Wow. I came here since i love the house made fresh noodles and I'm glad i did!  The place is so clean and spacious. i got the chance to try 4 of the 6 kinds of udon soups. It was SUPER YUMMY ..  the side tempura is unbelievably fresh and the seaweed rice was so neatly packaged and delicious also.  I was so full trying everything and Togo the rest for later. MUST TRY", "author": "Kate L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-28", "description": "A quick, casual, convenient, and delicious noodle shop! Came here on a Thursday an hour before it closed and there was plenty of seating and no line. \n\nThe menu is pretty simple (6 different udons) and you can choose to add a soft boiled egg for $1.50 or tempura pieces for $1.50/each. \n\nWe tried the Creamy Kabocha with Chicken Udon ($11) and Beef Curry Udon ($13). Though both were very flavorful, I'd have to say my favorite was the Creamy Kabocha. The chicken was very tender and the broth was thick, rich, and flavorful. I enjoyed how the bonito flakes garnish on top moved with the steam! We also decided to try the beef oniguri ($3). The ratio of rice to filling was a little more than I expected, but it was still pretty good. Next time I'll probably opt out of additional small bites since the noodle portions themselves are quite large and filling! \n\nApart from the food, the staff here were super friendly! As soon as we entered, we were warmly greeted by the cashier. Overall, I was quite pleased with Kagawa-ya Udon. If you're looking for a quick warm bowl of noodles in the bustling city, this is the place to go!", "author": "Kris C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-06", "description": "Wow, I had the Creamy Kabocha with Chicken.  With a soft-boiled egg. \n Oh man oh man oh man.  OK, I'm not an Udon expert, but it was really, really good.  I mean, completely blew me away.  I'm comin' back for this.  But I guess, I should try other things on the menu, b/c if this was so good, maybe the other things are also.\n\nIncredible.  Still kvelling over it, and it was 2hr ago.", "author": "Chet M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-24", "description": "Definitely worth the drive!  The noodles are made fresh in-house, and you can most definitely taste the difference.  The broth is flavorful... a perfect bowl every time!  Thus far, we've tried the kitsune, niku, curry beef, tomato, cream of clams & leeks, and zha-jiang (the newest recipe!) udons, and we've thoroughly enjoyed each one.  \n\nWe forgot to take pictures of our delicious bowls of udon before hungrily diving in.  We'll try to remember next time :)", "author": "C T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-24", "description": "For a place that has udon in its name, Kagawa-Ya did not disappoint. I came here tonight on this very rainy evening craving something warm and soupy and this fit the bill in every single way. I ordered the clam and leek broth with my udon and it was incredible. If you love clam chowder, you're going to love this broth, as its thick and creamy, and shares a lot of the same flavors as your typical bowl of chowder. The broth itself has small bits of clam scattered throughout. I'm not sure if bacon was the best topping to put on the udon (it seemed kind of random), but as somebody who likes bacon, I'm not one to complain :) The udon noodles themselves are cooked to order in front of you so you can expect them to be the perfect texture and consistency. After I picked up my ramen, I selected a few pieces of tempera - the sweet egg, the chicken, and sweet potato. Each piece of tempera was light and crunchy on the outside with no sign of soggy oil. Definitely grab one or two with your udon. A bowl of udon can get pretty expensive if you choose an expensive base and add a lot of tempera ($1.50 per piece), but for the quality, it is well worth the price. I would highly recommend Kagawa-Ya.", "author": "Austin W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-28", "description": "Delicious tomato udon and awesome selection of tempura.  Friendly service and fast, counter order system.\n\nI enjoy it about once a week.", "author": "Ryder M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-06", "description": "Food here is served cafeteria style, both for takeout and sit in; everything is self serve apart from any udon dishes (which, you have to order via the kitchen staff). \n\nStaff are friendly and the restaurant is clean. There are only a few tables so be prepared to either share a table or have your meal as a takeout!\n\nDownsides: although super delicious, the tempura selection on offer and korokke can often be a little cold. This means that you have no idea how long the tempura or korokke have been sitting out for under the heat lamp. \n\nEach time I've been, the broth for the udon was just luke warm. Thankfully, each time I was super hungry so I ate it pretty quickly! The udon is definitely the star of the restaurant; it has a great chew and thickness and you will not be disappointed. \n\nOverall, it's a good little restaurant if you want to get your udon fix but I would avoid the tempura and korokke unless you see them coming out fresh! The onigiri are also worth a try if you're feeling greedy :)", "author": "Simon Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-02-11", "description": "It was alright. I wish it was better and worth a trip to that area of Market. To be clear I don't live or work near there but I had been wanting some udon, and asked my cousin to meet me there for dinner after work one day. The whole thing was fine but I probably wouldn't go back on purpose. It's a bit too casual in the cafeteria style ness of it. I wouldn't mind the cafeteria style if it was something fantastic. Maybe if I was in the neighborhood, and was craving some udon it would be an good option.", "author": "Veronica L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-06-15", "description": "Was pumped to finally try this place out with a friend after seeing it had been under construction since 2016! Overall, it was pretty good for a fast casual place, but the price point just felt a little high for the quality.\n\nIt's a fast casual place, so you basically order upfront when you arrive (similar to Chipotle)! At 12:30 on a Friday, there was almost no line - a pleasant surprise! \n\nI ordered the Creamy Kombucha (#5) for $11 and my friend ordered the Kitsune (#1) for $9.50 with a soft boiled egg ($1.50). While you're ordering, make sure you're getting enough broth - or ask for more if you need!\n\n- Creamy Kombucha: had pretty good flavor - though I found the broth to be lukewarm temperature. Would have preferred if it was warmer and didn't feel like there was that much chicken in the broth, so wasn't feeling I was getting a good deal for the price. I also didn't find there was anything special about the udon noddles themselves. 3/5\n\n- Kitsune: Pretty standard flavorwise for the broth. Again noodles were pretty good, but nothing super out of the ordinary compared to a grocery store. Softboiled egg for $1.50 didn't seem to be worth it to my friend. 3/5\n\n-Tempura: it's sitting under the heat lamps so it's not made to order therefore it's not perfectly crispy! It's pretty good (sweet potato is white instead of typical orange), but I don't think one piece is worth a $1.50. 2.5/5\n\n-Spam Musubi: $3 for a pretty good size. There's a bit too much rice for my taste, and the spam could be fried with a bit more sauce. 3/5", "author": "Kristie M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-15", "description": "This place is an udon phenomenon cafeteria line kind of place! You line up, choose an udon, pick it up as you go down the line, pick up tempuras with different prices to add, and then pay at the end of the line. Interesting concept. I think it's nice for all the bustling business people working around the downtown SF area to get a quick, filling bite to eat during their lunch break or after work. \nI got the Niku Udon, and it was guud! Very soothing for my stomach. I added a $1 tempura fish cake and thoroughly enjoyed that along with my broth very much. Portions were pretty decent for the price of $14 - $18 for a bowl. That's what you pay in SF for a simple bowl of udon, but hey! It's not the worst you'll see around here. Plus, like I said, the portions were fair. They gave a lot of noodles. At the end of your meal, you clean up after yourself and bring your plates and trays to the kitchen. \nAll in all, I liked this place. Wasn't a phenomenal OMG WOWZERS LIKE BEST UDON EVER place. But, I had no complaints!", "author": "Kim N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-03", "description": "My coworker and I decided to order delivery through Uber Eats and try this place out. Thankfully they separated the noodles and broth so it was still hot when it arrived and the noddles weren't soggy. I got the creamy kabocha and chicken and my coworker ordered the Niku. I thought the kabocha broth had a really nice flavor- it's a bit thicker than typical broths bc of the kabocha but it was tasty. My coworker really enjoyed hers too! The noodle portions are pretty generous as well. The only thing missing is vegetables! If you're craving udon, give this place a try. We'll definitely order again to try the other varieties.", "author": "Stephanie N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-13", "description": "Overview: Kagawa-Ya is a Japanese casual-eatery specializing in udon noodles located under UberHQ between 10th and 11th on Market St. Its dishes are simpler than the equivalently priced Ramen place but they offer a wide variety of tempura pieces a-la-carte for people like me who need more variety of texture and flavor in every meal.\n\nThe Establishment: Kagawa-ya's interior is spacious and beautiful with 3-story high ceilings, modern furniture, and a clean, open look. It's almost a cafeteria style system where you start at one end of the kitchen and pick up a tray/bowls and request what you want from the chefs/staff.\n\nThe Food: I have both high praise and high criticism for the food here at Kagawa-Ya. Individual aspects of their food are excellent. The udon has a excellent chew, texture and flavor, the broths have just the right balance of sour and savory, the tempura pieces are battered and fried with a good level of crunch without being oily, and the imported drink choices (nectar and teas) are fun to sample. On the flip side, Kagawa-Ya needs to increase the complexity of its meals or increase its value to compete with the well-established ramen places nearby such as Marufuku and Iza. The last time I was here I felt that the beef was overcooked and chewy. \n\nThe Service: This is a order-up-front then bus-it-yourself establishment so I would consider tip being optional here.\n\nConclusions: Kagawa-Ya is a beautiful, spacious, casual Japanese udon shop with high potential. I suspect that in 2 years, it will either be one of Mid Market's new cornerstones or be out of business.", "author": "Andrew H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-12-08", "description": "I was really excited to eat at Kagawa-Ya because I had hopes that it would be similar to or match up to Marukame Udon in Waikiki, Oahu, HI...but man, was I was disappointed. \n\nTo be fair, the concept here is similar to what I was looking for. An fresh udon bar with selections of tempura and yakimomo (pan-fried appetizers). In essence, I think Kagawa-Ya achieved that but San Francisco ruined this one for me. First off, the location is slightly unappealing. While it is in SOMA, close to Uber HQ and Twitter HQ, the neighborhood around it makes me uncomfortable to walk around at night (near Civic Center/Tenderloin). That said, the inside of the restaurant looks clean and modern. The quality and flavor here was mediocre in comparison to what I have had before, lackluster and oversalted at its worst. \n\nYou line up at first to select from their preset menu of udon styles (warm soup, cold udon). After they heat the udon noodles, combine it with broth and toppings, you can take a plate and pick any tempura from a line of selections; ranging from tempura shrimp, carrot, broccoli, curry croquette, spam musubi etc. This style of serving is very similar to Marukame Udon. Overall, the style is similar but the price is 2x as expensive as its counter part in Hawaii. In comparison, the tempura here was poorly made, lukewarm (not nice and piping hot, freshly fried), oily and very heavy to the palate. I really like properly-made Japanese tempura, which seems to be so hard to find in the SF Bay Area.  I guess compared to the average Japanese restaurant, the tempura here is alright. But again, not as fresh tasting or light as the restaurant in Oahu, Hawaii. \n\nI will say two of their udon soups were more inventive, going for fusion flavors like cream of clam and leek udon, and spicy tomato udon with roasted shiitake. I was quite excited when I saw them and ended up choosing the cream of clam and leek broth. One thing that I definitely surprised me was that the quality of their udon noodles was very underwhelming. It honestly tasted like frozen udon noodles from Japan. It didn't have the nice bouncy al dente texture and freshness from homemade udon, which it actually really quite nice and more alkaline. I don't know where their udon is made or sourced, but they didn't have a noodle chef making it and it also didn't taste homemade to me. \n\nNow onto the broth. I'm going to be honest, I might be more harsh and critical about broth and taste because I often cook Japanese food at home, eat out at mostly Japanese restaurants, and have stayed in Japan for 2 weeks recently. I expected the broth to taste light, clean, ungreasy and well-balanced. It was the exact opposite of that. The clam and leek broth was oversalted, heavy and did not have a single clam in it! It makes me wonder if they used clam juice/clams in a bottle instead of real clams cooked down. The broth did not have depth and was overly heavy. I couldn't finish my dish, which is actually REALLY rare for me.  My husband ordered the classic niku (beef) udon, which was slightly better. However, it too was oversalted and lacked depth and complexity. For the price of about ~$15-18 per bowl of udon, I was pretty disappointed. The spam musubi was pretty standard and nothing to write home about. Because the tempura was lukewarm, fried in a bad batter, it tasted greasy a lack of crispy texture. Tempura, when done well, does a great job at highlighting the freshness of the vegetables, which was not executed well here. \n\nOverall, it was not a pleasant experience. While seating was plentiful and clean, the environment felt sterile. It reminded me a dormitory cafeteria but without the liveliness and chatter of a college campus. The food was mediocre- broth, noodles AND tempura. I know I am a food snob when it comes to Japanese food, so I understand that my review is low and disagrees with others. That being said, I think even if you do not eat Japanese food much, there are still better options for udon in San Francisco. Maybe they are a bit further, but they'll be a better bang for your wallet and it will taste noticeably better. \n\nI will try to come back next year to see if there was been improvement.", "author": "Jenny Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-18", "description": "i 've been having\nthe noodle sometimes it remainds me my home.\n\ni love UDON in genenal,the place is\ngood potion,super clean ,convinience\nand taste is good\nmy favorite is KITSUNE (with egg/tempura) is the best and basic.\n\njust -star is the price + curry udon is wrong recipi that i like my experience.i've had many curry udon...i understand this city and area\nand i can not find UDON place.\nbut i never seen in my home this 1 bowl of UDON\n$10-up and if add tempra would be $15!!?noway\nprice any reasons.so i come every onece awhile (4-6month)when i really miss hot UDON", "author": "Tokibox 6."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-12", "description": "Kagawa-ya sells udon and tempura in sort of a Chipotle type format: you line up for a counter where you tell them which of a few menu items you want and they make it quickly in front of you, then there's tempura vegetables you can grab and canned and bottled drinks on offer as well. \n\nI stopped by during the lunch rush and there was a line but it moved pretty quickly. The prices we're reasonable and it was possible to grab seats at a table after waiting for just a bit. Seating may be hard to find, though, depending on your luck. \n\nAs for the food, it was very good. The udon was delicious and I really enjoyed some tempura as well. Definitely a good spot to grab a fairly fast lunch, and the location is very nice as well.", "author": "Jesse C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-29", "description": "This place is great!  I went here for lunch and got the beef curry udon.  I've never had anything like it!  So delicious.  The tempura is perfectly fried, and the spam musubi is also a knockout!  I strongly recommend eating here if you want an udon fix!\n\nAlso. Special shout-out to the service!  Everyone was extremely friendly and personable. The cashier was very bubbly and welcoming!  Nice breath of fresh air from a chaotic day in the office!", "author": "Matt H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-20", "description": "Great place for simple Japanese Udon. When you collect stars for 9 bowls of Udon, you get the tenth one free. I ordered the Kitsune which is perfect. You can choose to add your Tempora.", "author": "Kalin M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-04-24", "description": "I was not wow-ed. I work across the street and maybe I just had hyped it up in my mind too much.\n\nYou get in line and it's like cafeteria line (like Chipotle) where you order your base and as you move down you can add more. I ordered the Creamy Kabocha Udon and it was just okay. I added on one tempura (since it's $1.50 a piece). The taste of the broth is kinda basic to almost bland.\n\nIt's quick though and probably comforting on a rainy day but given that I can buy udon soup base and frozen udon noodles from Nijiya and probably recreate this at home, I'll pass on returning.", "author": "Mimi T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-20", "description": "Decided to check this place out before seeing Aladdin.  Delicious Kitsune Udon.  I recommend getting the shrimp and fish cake tempura as well as the creamy potato croquette.  Will be back!", "author": "Julian C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-08", "description": "Here for their soft opening today! They're gonna be officially opened next Wednesday, April 12th. They had reasonable price udon from 9.50-14 and each mini side (tempura) was 1.50 with the option of spam musubi as well as onigiri. Their cold udon already has a broth in it so it's not dipping like you'd imagine. They're currently not open on weekends and once they do open, their hours are 11-7 which is pretty neat since I live at nema and work in the square building! The interior was nice and minimalistic and the place smelled deliciously like my favorite noodles! Excited to have an udon place inside the  building!", "author": "Vanessa K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-10-20", "description": "Honestly, not the best udon I've had. For a place that specializes in udon, I had high expectations. Pricey for the portion size as well. I was still hungry after my bowl of udon :(\n\nI do like how quickly you get your udon because it's fast food, cafeteria style. I went after work on a Wednesday and there were only two other people in the restaurant.\n\nHowever, I wouldn't go out of my way to come here again. $19 for a bowl of Niku udon + egg + 1 tempura fish cake?! No thanks. I'll be going elsewhere for my udon cravings.", "author": "Benita L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-01-20", "description": "This a weird taste of udon, tomato sauce base udon, sauce is too sweet for udon. It tastes more like Italian tomato sauce pasta. Udon is not supposed to be like this, worst udon I have ever had.", "author": "Ellie Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-14", "description": "It is finally open! All noodle lovers rejoice!\n\nThe moment I caught wind that Kagawa-Ya was open, I set up a little lunch field trip with a dozen coworkers to check it out. The lines was nearly out the door but moves quickly. I was a bit worried about the limited number of seating when I arrived but the steady pace udon being prepped and slurped down seemed to work out perfectly.\n\nI have to admit I was a bit skeptical as I heard others casually comparing Kagaway-Ya to Marukame. Although I think this is a solid contender, the menu options are fewer and of course SF pricing are always going to be bumped up a bit. Then again, well worth the 3 block journey versus a 5 hour flight for an udon fix.\n\nThe breakdown:\n\n1) Start by ordering your base bowl, there are 5 options: Kitsune (classic), Cold, Niku (Beef), Curry Beef, a Vegetarian option, and Mushroom Curry (Rice). These base bowls range from $9.50-14\n\n2) Add on as many soft poached eggs or pieces of tempura your heart desires. They are $1.50/each. I was disappointed that the pumpkin tempura were on the small side but the shrimp were big enough to satisfy.\n\n3) Grab a spot and chow down.\n\nI was pretty impressed by the solid umami broth in my kitsune bowl. The bowls might not look very big but they gave me plenty of noodles to feel beyond full. I will definitely be back agin soon.", "author": "Elizabeth T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-20", "description": "Hands down the best udon in SF. I love their beef udon and tempura but the real knock-out is the creamy kabocha. I was a little hesitant to try that at first because I knew how easily pumpkin squash broth can go wrong, but it turned out to be very rich and flavorful, not sweet and tangy like I expected. Delicious, satisfying, and fast!", "author": "Carl W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-19", "description": "Great location, clean, friendly, and fast. Came here for the first time the other day. Flavors were great and noodle texture was good as well. I had the Niku and recommend. I also had the shrimp tempura and was ok but could've been a bit lighter on the batter. Many tempura options and spam musubi. The spam musubi seemed like it was mostly rice and wouldn't get again. I would definitely come back again!", "author": "Emily F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-17", "description": "Very tasty and a good option in the area if you're craving some soul-warming noodle soup on a foggy day! It's cafeteria style so perfect if you're just popping in for a quick bite. \n\nNow here's the Marukame comparison (and reason why I docked 1 star):\n- Only 1 portion size available here. Kagawa-ya's bowl is probably equal to a regular (small) at Marukame. I was satisfied after eating my niku udon with tempura kabocha and egg but not full.\n- The udon soup is more expensive than Marukame. Coming in at $13 for a niku udon base where you can get twice the amount of noodles and soup at Marukame for $7\n- The niku udon is a delicious clear soup but lacking the traditional Japanese dimensional flavor. Tastes good but is missing \"something\". \n- Good tempura batter, light and crisp. There is a good variety of tempura to choose from but at Marukame they have many more veggie and meat choices.\n\nThis is just me being nit-picky. Seeing as Marukame is 2000 miles away, I will definitely come back to Kagawa-ya.", "author": "Melissa N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-07-08", "description": "Food was decent. Was Hoping it would be better, but for quick service it was ok. Broth a bit too salty and meat was harder than it should be. Also the tempura was way too overpriced and not good. Tasted like I was eating broccoli in a bland batter with too much oil soaked in. I paid 1.50 for each tempura item on their menu. In total, one bowl plus a runny egg(menu says soft boiled but it's actually poached), plus 2 tempura items and a soda cost me $22. Way too overpriced and the food was just decent.", "author": "LaSeñorita M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-26", "description": "Loving this new spot!  I've tried the Niku and the Beef Curry Udon.  Both were delicious and as the summer approaches, I can't wait to try the Cold Udon.  YASSSS!  \n\nYou really can tell the difference in the quality of their noodles and I love that the service is fast and friendly.  I'll definitely be back!!", "author": "Lesley Q."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-09-03", "description": "For ~$15 per bowl I expected more. There was only one vegetarian option and it wasn't...good. The noodles were kind of cold, the broth tasted a bit like dirt and was under-seasoned. I like umami flavors but this just didn't have any balance to it. Tastes are subjective so you may like it - I personally wouldn't come back here. Definitely wasn't worth it and ended up throwing it out after a couple of bites.", "author": "Rita R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-05-04", "description": "I used to work near Uber and would pass the sign that indicated that Kagawa-Ya was opening soon. I've been telling my boyfriend that we needed to go when they opened. So when it finally opened, we went. \n\nI really liked how the layout was kind of like udon shops that can be found in Japanese subway stations. You get in line, grab a tray, and indicate which kind of udon you want. Then you move your tray along and pick up some tempura pieces before checking out. \n\nI ordered the kitsune udon and picked up 2 shrimp tempura and 2 croquette. I've always tended to stay away from udon places because I could make almost the same quality udon at home from those semi-instant noodle packets that are sold at Asian markets. The noodles were ok, nothing too special. The tempura and croquettes were crispy, but not hot. \n\nThe prices were a bit pricey, but understandable considering the location. The udon was $9.50 I think, which is ok. But after I added the tempura and croquette, it was an additional $6. \n\nI will go back if I'm craving udon near Market St. But ultimately, I would rather eat udon at home and go out for ramen.", "author": "Carolyn Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-28", "description": "Don't be fooled by the cafeteria-style line. If this is your first time, I encourage you to pick up that tray and give it a go! You won't be disappointed. The service is quick, clean, and easy. Even my McChickens take longer to come out. But just because it's quick, doesn't mean it's bad...!\n\n[3.5/~$15] Creamy Kabocha w/ Chicken Udon + soft boiled egg was above my expectations considering I thought it said Kombucha at first--I was preparing myself to dive into a bowl of some funky udon SCOBY-juiced, concotion. (I mean, YOLO right?) Luckily, Kabocha is a type of Japanese winter squash. WHEW! Overall it wasn't too bad. This place is no Marugame Monzo (shout outs to Little Tokes), but it'll hold you up for a quick lunch. Wish it was cheaper, but hey, we live in SF, what can we do? Sigh...", "author": "Brandon T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-01-26", "description": "It was okay. Located approximately at Van Ness and market this option for lunch and dinner was okay. The food/beef udon was good and the restaurant was clean. No fuss, no muss. You go through a line to order, take it to your table, in my case with co-workers. When you are done you bus your own table. No views and no ongoing customer check-in. Not that kind of place. You want noodles and nothing else and you have to get back to work, then it is a good option.", "author": "Matthew R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-09", "description": "After visiting Tokyo, I thought I'd never be able to enjoy fresh udon again without traveling 5,151 miles. I'm so glad this place opened up! \n\nI ordered the beef curry udon and instantly fell in love with all the flavors. You can tell that the curry is stewed with a lot of patience and care. The meat was incredibly tender to the point that it fell apart and was everywhere throughout the curry broth. \n\nKagawa-ya Udon also has a dope tempura station! I def recommend trying the sweet egg and fish cake. Perfect if you don't want to eat udon, you can always stop by to grab tempura! \n\nLast but not least, super friendly service! I'll be back to try everything else on the menu!!", "author": "Steph W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-05", "description": "My love for udon exploded when I had the best curry udon EVER in South Korea. Ever since then, I was on a mission to try curry udon at any restaurant that carried it.\n\nI came with my brother and sister so we were able to try 3 bowls: the beef curry, creamy kabocha, and the cream of clam and leeks.\n\nThe curry udon was amazing! Broth wasn't runny and thin but wasn't heavy and salty. The flavor was just right! I love the thick pieces of beef and all the red pickles on top! I was able to finish the entire bowl!\n\nThe creamy kabocha was rich and soothing. It felt like a hug when you ate it. I would drink the broth alone because it's THAT good!\n\nThe cream of clam was a pleasant surprise! I was thinking \"ok, infamous SF clam chowder\" but it doesn't have the saltiness of regular clam chowder. It was slightly sweeter and with the bits of bacon, it's definitely a unique one to try! \n\nIt may go without saying but the handmade udon noodle themselves were bomb! Chewy just like they should be.\n\nI'm glad they're open Saturdays now!", "author": "Anh L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-14", "description": "Really excited to have a good udon place open up in SOMA! I really like the efficiency and reasonable prices. I would say the portions are on the smaller side (I did get take-out). I did pay $13 for the Beef Curry Udon and still felt a bit hungry after, hence the 4/5 stars. However, I do admit that I have a large appetite. I came at around 3pm and there were only a couple diners, but given that Twitter and Dolby are right around the corner, I can imagine this place getting crowded. \n\n[Food]\nThere's only five options, so if you're indecisive like me that makes your life a lot easier! I really enjoyed the Beef Curry Udon! The beef was tender and was not overly heavy and the udon noodles were deliciously chewy (I like my noodles al-dente). I'll definitely be back to try the Niku and the Creamy Kabocha Udon. There's also the Cold and Kitsune Udon. \n\n[Service]\nThere's a line where you select among the five options. If you want take out they'll put it in a paper bowl for you to take away. Bag is 10 cents. I would say the portion for take away is smaller than eating from the larger bowl. \n\n[Decor]\nOpen space with an efficient ordering system. SOMA vibes. \n\nIf you're in SOMA and looking for a no hassle quick and delicious meal, definitely stop by and give this place a try!", "author": "Alice Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-02", "description": "My friend recommended this restaurant to me and she did not disappointment me. I had Niku Udon, it was delicious. The beef was tender and the broth had so much flavor. The udon noodles are made in-house, the quality was awesome. I am Asian, so I do appreciate good noodles. My son is a picky eater and he had the beef curry. He loved it. Just recently he asked me to make a trip up to SF for the curry bowl. \n\nWe did add to the order and purchased a spam masubi and shrimp tempura. Both were a great addition to the lunch. Yes, we got more then we needed, but it all looked so good, we could not stop ourselves. \n\nReally looking forward to my next trip to Kagawa-Ya.", "author": "Caterina D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-03", "description": "I jumped off the F street Car with my toddler when I saw this place as he loves noodle soups and we were starving. Taking a toddler for soup is not for the faint of heart, but the staff was incredibly gracious and even made recommendations for a toddler-friendly meal. They cooled the broth down for him and even got us a high chair. On top of all this, the udon soups were delicious! I devoured mine and he happily slurped away at his noodles. \n\nWe'll definitely be back and will make stops here part of our adventures downtown!", "author": "Lisa L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-31", "description": "This place is decent, passable udon. If it was cheaper it would get more stars, but the quality is pretty low for almost 20 dollars.", "author": "Thomas T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-19", "description": "I have been waiting for this udon shop to open for months! Went on the grand opening so the line was long but moved fast. It was really cool to see the chef rolling out the udon right then and there. Chatted with the owner who was at the register and she said it takes 2 days to make the yummy noodles. \n\nSo I've been back twice and both times the noodles, the soup and the accompaniments did not disappoint. The first time I ordered the curry udon. I'm Japanese and love curry, and I have to say, it was legit! The beef in the curry was ridiculously tender and the noodles were cooked perfectly. The veggies in a curry often get overlooked but the big chunks of carrots in there deserve a mention. De-lish.\n\nFor my second visit I ordered the Niku udon. Again, the broth was on point and the noodles were great. On my second visit to any restaurant I'm looking for consistency and they definitely were.\n\nBoth times I couldn't pass up the tempura. My favorites - shrimp and chikuwa (fish cake). Light and crispy batter, just the way it should be. \n\nKagawa-ya now has a permanent spot in my lunch rotation.", "author": "kumiko e."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-08-20", "description": "I tried the Niku Udon. It wasn't bad, but it wasn't great either, especially for the price. The beef was very chewy and the soup was too sweet.", "author": "Pat T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-01-22", "description": "Had high hope on this place when I saw on Instagram and yelp. Drive all the way to sf just to try their udon. It was ok......The egg was way too raw I thought it was half boiled and soft inside but is not........also have a lot of MSG I rather to have a bowl of pho lol. Service is fast, restroom and dining area are clean.", "author": "Mandy C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-22", "description": "Reminded me of my childhood, eating udon cafeteria style in big Japanese supermarkets. it's not supposed to be fancy dining, it's essentially street food but laid out in a cute modern restaurant setting. \n\nTheir tempura is really yummy and light and their udon broth tastes fresh and authentic. \n\nSmh some people really need to get off their hipster asses critiquing this place for not being gourmet udon. Udon is not gourmet lolol especially when the restaurant is cafeteria style. \n\nReally delicious, quick, and nostalgic :)", "author": "Stephanie K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-28", "description": "Wew lads, this may be San Francisco's first authentic professional-grade udon noodle house!\n\nI get regular cravings authentic Japanese noodle dishes, but I'm rarely in the mood to line up for Mensho Tokyo or Hinodeya Ramen. Kagawa-Ya might be my solution from here on -- at 1pm, there was barely a line, and fast casual service meant that I was seated and eating within 5 minutes of entering the establishment.\n\nI recommend getting Kitsune udon (warm dashi broth) with 3 shrimp tempuras. That comes out at $14 for a hearty meal.\n\nThe noodles were very dense and chewy and clearly fresh made with a lot of care. It definitely surpasses the quality of frozen sanuki udon (which has more of a light tapioca springiness) and  the noodles at Udon Mugizo (which is often cooked so soggily by their careless staff). The dashi was very rich and satisfying, and the sprinkle of fried tempura batter in the soup definitely brings out a pleasing fragrance.\n\nKeep doing what you're doing, Kagawa-Ya! My only advice is to maybe watch out for your tempura cook (2 shrimps of mine were great, but the eggplant was under-fried and kind of raw). Smooth out kinks and I think this place will last long. Good luck! I will be back.", "author": "Ken H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-19", "description": "A friend of mine photographed the owners wedding and suggested that I go and try this udon place off market. The service was great and I was even able to meet the owner's. One was working the registrar and the other was head chef. The experience was what I enjoyed most. Being able to watch the entire process from beginning to end right in front of me was very entertaining. While you wait for the udon to be finished, there was an area of tempura with quite the selection. Overall I had a great experience and would definitely recommend this place to anyone likes udon or soup. \n\nBy the way, I ordered the beef curry udon and it was ON POINT!", "author": "Adam S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-08-17", "description": "Good quality comfort food ruined by not so nice manager. I am soup person and with that said this is the only descent place that serves comfort food. I enjoy their udons every time I go there. Today, I was on an important phone call while ordering and the cashier and manager gave me such an attitude that scared the heck out of me that wouldn't come from a good place.", "author": "hha a."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-13", "description": "This place is AMAZING!!! The noodles are chewy and bouncy (if u know what I mean) and the broth is flavorful and not over salted like some places. The meat is tender and the fat melts in your mouth aka the fat is not flubbery. The chives are fresh and have a nice crisp flavor as well. I like how the croquet was crispy on the outside and not over saturated with oil. I'm def going back here (p.s. spam musubi was bomb too)", "author": "Jade K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-01", "description": "I don't eat carbs regularly, so when I have a cheat meal I have to choose what I want and it better be worth it and Kagawa-Ya Udon is SOOOO worth it. Some of my favorites are the Kitsune Udon, Beef Curry Udon, and Niku Udon, along with their tempura and Spam Masubi.\n\nThe udon noodles are so fresh and absolutely amazing, the texture is soft, but has enough bite which is exactly what makes a perfect noodle. The broths are all made from scratch and you can tell, the flavor is amazing and really comes through with every taste. The tempura is fried beautify, light and crispy, and you can't go wrong with the Spam masubi.\n\nIf you're in the area, and you want something that is from a legit kitchen, but is still fast and quick definitely check this pace out.", "author": "Dave W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-03-31", "description": "This is more of a fast food line than a restaurant. The soup was lukewarm and the noodles were overcooked/soggy and didn't have a good texture. It was also on the relatively pricey side. Not worth the price at all.", "author": "Annie B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-06", "description": "Walked by everyday and been waiting for them to open since last year because I am a food craving person.\n\nA new FRESHLY made Udon in the Soma. This will be my new go-to and pick-up place for lunch since it's really convinenced right next to the office. Only 6 choices on the menu, pretty clear designed, easy to understand and pick, unlike some places where you need to spend few minutes to look for tiny words of the description of the food. Heard that they'll substitute some of the choices in every season/quarter. \n\nAgain, noodles are freshly made and been through stages before it gets to my bowl. So warm and touchy. Get some tempera pieces along with the noodles and I'm full and satisfied for lunch. They always have the Onigiri (the triangle thingy wrapped with seaweed) and spam musubi ready to go. I like to just grab one for snacks :P \n\nService is fast, although there's a line. I got my bowl and seated within 5-10 minutes. All you do is to tell the chef which bowl number you want, they will make it for you and you just have to take it on the side, follow the line, and tempera station is self served, keep moving in the line and pay! Staff are nice and helpful. There are tempera/katsu/spicy sauces on the side to adjust your customized taste. I like that they serve the same amount (one serving of the noodles) no matter you dine in or take out. No Cheat Cheat :) \n\nI normally get the #3 Niku udon and #2 cold udon with shrimp tempera and sweet egg tempera. They are just awesome! Words can't describe the feeling inside me, you just have to try it and you'll know how awesome it is. PS: ask them to add a soft boil egg if you like.\n\nSeats are well organized and clean. Staff will wipe down the table time to time. After you finish eating, just leave the bowl on the side window and the dish washer will take it from you. It's really like a cafeteria setting. \n\nAround $15-20 a meal depending what you get and my stomach is fully stratified. I will come back for sure just because the food is great and I won't get sick of it.", "author": "Kalum Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-03", "description": "Shitty entitled yelp \"foodies\" who leave reviews irrelevant to the food are the reasons small businesses don't survive in this city.\n\nDo you like convenient locations where you can grab some noodles without waiting in line for 78 minutes? Yay!(which sometimes means you pay a little more because the business has to pay rent?)\n\nDo you like house made noodles with QQ texture? Yay! \n\nDo you like simplified options that represent a good spectrum of Japanese udon? Yay!\n\nIf you don't like any of the above, there is a Cheesecake Factory in union square that will cater to you every whim, include cheap af food, 78 minute wait and 64 page menu. Go there. \n\nFor the rest of the reasonable humans: my favorite broth is kitsune and creamy kabocha. I like to add a shrimp or fish cake tempura and dip in my broth. Add a little Hawaiian sun if I'm getting crazy.\n\nGo, enjoy, be a decent human being.", "author": "Natasha W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-12", "description": "Finally a place for udon in the Bay Area!!  I'm surrounded by ramen places in the San Mateo region (which I love too), but have grown a little tired of them. \n\nYou can watch the square-cut udon being made fresh in-house, literally the most perfect udon noodles I've ever tasted. \nThe place is reminiscent of the popular Marukame Udon in Hawaii, and the line moved quickly. Nice place to grab a quick, quality meal. \n\nMy 4-yr old son loved the #1 classic udon and spam musubi. My husband got the #3 Niku Udon (I had a taste of the amaaazing broth, he drank the whole bowl), and I had the #4 Beef Curry Udon which was savory curry goodness without being too heavy. \n\nI really loved the tempura. Flaky, light crispy outside without being greasy. I could eat a whole plate of just tempura with the tempura dipping sauce.\n\nFound street parking nearby.\n\nNice way to warm the body and soul on a windy nippy SF day!  Already craving those noodles........", "author": "alice a."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-07-14", "description": "If you've ever been to Marukame Udon, imagine a menu with half the selection, 3x the price, and maybe 1.5x the wait, once you order. (If you've ever been to the Waikiki Marukame, you know what I'm talking about.)\n\nUdon doesn't have to be great. But, Kagawa's noodles had no body at all. The soup wasn't bad, but it was a little weak. The kitsune udon had some massive piece of thick, chewy \"kitsune\" which wasn't really pleasant to eat. I usually like to savor it as I eat, so that was a pretty big disappointment.\n\nI love Japanese noodles, so I really want to have more shops besides ramen in this town. But, I won't be eating here again. If you want to have some good udon, go to mugizo.", "author": "masa s."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-11", "description": "Pricey udon, but so is everything in this city. Noodles are good, broth is decent. Solid lunch option, gets the job done but nothing to write home about. Counter service is always stellar, which goes a long way.", "author": "Lauren J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-04-20", "description": "Spam Musubi - unfortunately I'm picky with my spam to rice ratio, and I would want my spam crispier, so I'm better off making my own when I have the craving. But good to know where I can get some when craving it/dont' want to make a whole batch! \n\nBeef curry udon - If you want a gravy type of beef curry, with potatoes and carrots, but just swap out rice for udon, then this is for you. I like marugame beef curry better - that one is more soupy to my taste. \n \nCreamy Kabocha with Chicken Udon- texture of chicken can be hit or miss, but love the broth. This is the thickness consistency I wish the beef curry udon broth was like. \n\nSpicy Sweet Bean Zhajiang Udon - the best one out of the three thus far to me. Meat is tender, savory flavor, and good amount of veggies. \n\nI appreciate the unique flavors, quick service, and refreshing variety it brings to the neighborhood. Looking forward to try more flavors! I think the cold udon is next with summer weather approaching! \n\nPeople may complain about the price, but noodles made fresh, and portions to me are so huge. If you get the ones with meat, I can't see ordering tempura or musubi in addition anyway.  \n\nTip - like all the other places around, if your lunch is flexible, go before noon, or after 1pm to avoid the crowds.", "author": "j w."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-24", "description": "Place was only OK. I was super excited to try the place since they make their noodles fresh daily, and assemble your bowl in front of you. I tried a place called Marakame Udon in Waikiki, with the same concept, and that place was amazing! I was hoping Kagawa-ya would be just as good, but I was sadly disappointed. This place was pretty expensive as well. A bowl of udon starts off at $11-$15, and you add $1.50 for each tempura topping. My bowl came out to be about $19 because I added a soft boiled egg, broccoli tempura, and shrimp tempura. Would I come again? Probably not.", "author": "Michelle T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-03", "description": "I thought this place was amazing! The service was great and the food was delicious! We ordered 3 bowls to share. The cold, kitsune, and niku. It was all very delicious and the noodles was perfectly cook. My favorite was the cold udon and the niku. The cold udon  was perfect for a warm day in the city. The broth was perfectly seasoned, and the egg, yummmmmmm! The Niku was delicious, I squeeze the left over lemon from the cold udon  and it was perfect! The beef was so tender and flavorful. I only got a zucchini tempura bc I felt it was too much too for two people. I will definitely have to try the others next time. The dipping sauce was on point. I was going to get the spam musubi, but I was too stuffed, the  portions was huge! The prices didn't really bother me, if I'm willing to spend $20+ on ramen at mensho, then I don't think $14 is that bad. I would definitely come back for more.", "author": "Tia O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-14", "description": "Nice and straightforward Ramen house with a good selection of dishes. Flavorful broth and good noodles. My wife tried the pumpkin ramen and that was really good.", "author": "Daniel N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-28", "description": "I'm leaning towards giving this place 4 stars, but the price bumps it down to a 3.5. The portion is perfect for a nice lunch but I suppose the extra tempura options would be perfect if one were to be hungrier. The udon noodles are made in house and when I was there it looked like a lot of workers were eating there for lunch. \n\nI guess if you can afford the $12-15 lunch then this would be a good spot to frequent. My experience ordering was extremely efficient and simple. The menu is small with only about 6 different types of soup. The order starts by grabbing a tray, letting the cook know your order, and then scooting over to choose additional tempura munchies for $1.50 a piece. To make the bowls the cook simply puts a portion of noodles in a bowl and ladles in the soup of choice. It took about 2 minutes to get my food and pay. \n\nHere's what I tried:\n\nKabocha udon- 3/5. Ever since I went to marugame Monzo in LA I've been dying to find another creamy udon dish that would be up to par. So this dish is really what drew me to try this restaurant anyway. In the end all I have to say is that they're different. Kabocha is a Japanese pumpkin and so the kabocha soup has an earthy, sweet, seaweed taste to it. It was good, but I think I was expecting something else. This dish was $13. \n\nBeef udon -4/5. What the classic beef udon should taste like. It had thin slivers of beef and some green onions. Not bad! $13 was a bit steep though. \n\nCurry udon-4.5/5. Definitely my favorite of the three. The udon came with tender pieces of beef stew cubes, carrots, potatoes and some red pickled vegetable. After eating it a while the spice of the curry begins to creep up on you, but it's the perfect amount to leave your nose a little runny. Sometimes curry udon comes with thick kind of gloopy soup and it doesn't really feel like you're eating udon anymore. I really think kagawaya perfectly brings out the Japanese curry flavor I love and balanced it with a really nice broth that is just thick enough to coat the noodles. This dish was also $13.", "author": "Jennifer S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-03", "description": "Needed some soup and happen to walk by this place.  Ordered Beef Curry Udon and the noodles and broth were yummy.  Wish it was a little warmer though.", "author": "Stephanie T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-05-24", "description": "Bland bland bland.  Noodles were good, broth bad, tempura bad, onigiri awful.  Not worth a visit.\n\nNot sure where these \"elite yelpers\" ate to give them 4 and 5 star ratings.... But based on the quality of food alone, there's no way that's accurate.", "author": "Fredrick L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-18", "description": "Great food for the price. My girlfriend and I came here multiple times and have tried the creamy chicken udon, cold udon and zhajiang udon. \n\nAmbiance:3.5/5\n\nClean, modern and newly renovated, but market street is never that idyllic of a place to eat, not really the restaurants fault here but above average ambiance for a SF restaurant \n\nFood: 4/5 \nVery tasty udon and flavorings for the price! Zhajiang udon was my fave (reminiscent of my childhood) and surprisingly authentic in flavor\n\nService: 4/5\nFast and friendly, what else can you ask for. One star off for not allowing phone orders.. why not?? \n\nOverall solid 4 star restaurant for the area. Awesome for a quick lunch or dinner spot after work. Probably not the best place to bring a date but whatever floats your boat..", "author": "Pei Lun L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-10-02", "description": "The Niko udon #3 is a great choice. It could use a little more flavor tho. This is my 9th time at this place since it opened and today I was a little disappointed. I walked from work and grabbed $15.00 as I thought my item was $13.00 however I was 19 cents short. I asked can I come back with the 19 cents and I was told no and to come back with the money.  I felt as if I was being treated like I'm begging for free food or as if I didn't have a corporate badge on showing that I work in the area  but anyway the food is okay", "author": "Michelle X."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-04-02", "description": "Walked in right when they opened, so you would expect the soup to be hot, but no! Food is served cafeteria line style, which I don't mind, but the noodles were over cooked and the soup was lukewarm. It's not worth it for the price.", "author": "Ying Y."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-05-11", "description": "The taste of the udon is good. I had both kitsune and cold udon. The main problem of this place is the price. This place is an insult to Japanese Udon. niku udon in the original Kagawaya is priced around 490 yen. That's $4.3 in today's conversion. The niku udon as of today is priced around $14. That's an insult to anyone who knows that a good udon can't only be good, but it also has to be cheap. I would understand if their portions are larger. I feel full after eating Orenchi ramen where their main ramen is priced around $13. This is not the case for this place, their portions barely makes me full. The tempura prices are alright.\n\nSo until they start pricing their niku udon around 8 to 9 dollars and their kitsune around $6 I am not going back. I'm okay if they keep their price but double the portions that is also acceptable. If you're feeling like eating Udon, pack instant kitsune udon from nijiya priced around $1/$2 and skip this place. I guarantee, if they keep their price and portions of today, they'll be out of business in around 6 months.\n\nEDIT:\n\nI'll change the review if they wake up and realize they're not in the ramen business. They're in the udon business.", "author": "Tomo U."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-06-01", "description": "This place is more of a fast-casual dining option for people working around the area. If you are not in the area, I would not recommend going out of your way to try this place. The flavors and udon noodles taste fine, but nothing special. There are much better dining options around SF!", "author": "Vivian F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-17", "description": "Six words. Spicy Tomato Udon with Roasted Shiitake. So good. Just the right amount of spicy. Good, chewy noodles. Got it without cheese for the vegan option, and didn't miss it, but might try it with cheese sometime. So much flavor and every sip or bite a delight. While I wish they had a soba option, I can only rate what they do have, and what they do have is great.\n\nNote that they change their veggie/vegan option from time to time, but they always have something vegan available. This time they hit it out of the park.", "author": "Charles B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-28", "description": "I have eaten here twice and have thoroughly enjoyed the food, atmosphere and service.  My favorites are the beef curry udon, Zhajiang udon and creamy kabocha all with a soft boiled egg (a must have with the udon) but I have to believe you can not go wrong with any choice from their menu.  My wife likes the simple tastes of the Kitsune as her go to choice with potato croquette tempura and a spam musubi.  The freshness of the noodles and broth can be tasted immediately from the first bite.  I could tell extreme care and attention to detail was given to their ingredients as the food was delicious.  The lines moved quickly as well with more than enough seating in the super clean and spacious dining area.   I am a customer who enjoys value for the price I pay and I will admit the portions are huge with very reasonable prices.  Finally, my wife and I picked up a couple of their custom T-shirts before leaving as we thought the design was unique and looked awesome.  I would highly recommend trying it and would come back if in need of great udon in the City.", "author": "Victor C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-15", "description": "Nice little spot tucked away in Mid Market serving up freshly made udon and Spam Musubis. Got the Niku Udon with some Tempura and a Musubi. Portion size was perfect and broth was delicious. I can really appreciate the speedyness of service too as I was hungry.\n\nUdon is made fresh daily and the quality of ingredients are top notch. Getting hungry just thinking about it.", "author": "Derek L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-26", "description": "Their udon is delicious. The place is cafeteria style and has a friendly and laid back atmosphere. Its worth noting it is a bit pricy, due to its location. The cashier was also friendly which was greatly appreciated.\n\nAlso nice: There is also tempura you can pick out yourself which is awesome. I got the potato croquette and sweet egg tempura which were really yummy.", "author": "Art S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-10", "description": "Unfriendly! My first time visiting and the server behind the glass was very rude (female).", "author": "Jessica P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-17", "description": "Best udon I've ever had. Please. Can you come and open in London? Combination of luxurious silky udon and broth was sensational. I almost ordered another... instead I'll just tell everyone about it and come back again.", "author": "Paul C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-04-27", "description": "$9-$14 for the bowl of udon. Take note that they all come with different toppings also. \nWITH add-ons $1.50 for the tempura items/hard boiled egg or $3 for a spam musibi\nI wish it was more customizable considering the only toppings you can choose yourself is the tempura. \n\nCold Udon~ It was HOT weather and I wanted to try something different. The broth was light, but nothing too special. I did like that I get the hard-boiled egg included. DEFINITELY add on a tempura item. \nKabocha Tempura~ It's very creamy, which was too much for my friend and my taste. It did have a strong kabocha flavor.\nThe udon noodles were good. \n\nUnfortunately, in my group of 6 and myself just wasn't full after the meal leaving us unsatisfied.\n\nSo, YES, I have to compare this to the Marukame Udon in Hawaii (especially since there are Hawaiian drink products sold also at Kagawa-Ya). I LOVE LOVE Marukame all the food is delicious (you see them making the noodles in the storefront) and cheap. Key word is cheap! \nMarukame you can get a bowl of udon, pile on a lot of a variety of toppings that they offer and tempura items, and grab a drink, all for less than $15. A PILE of toppings to get you full. I was spoiled. I just can't go here without thinking of that store.", "author": "Casie C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-20", "description": "Pretty good for SF. There's not many places that make Udon fresh and this is one of the 3 prominent ones I'm aware of that do make it well. Noodles have a nice chew to it and the broth tastes freshly made with real ingredients.\n\nI've only had the Sanuki udon but do like the broth here. Its light and crisp tasting with just enough flavor for a light meal on a hot day. Will try the kitsune udon next time but the rest aren't as interesting, seems like they're just to round out the menu with more options palatable to the demographic.\n\nOne thing they could improve on is not making everything in one big batch. The noodles start tasting old and they lose that springiness near the end of the day. Hot crunchy tempura is a real treat with the sauce but degrades much quicker and starts getting chewier, stale as they turn room temp. It would make a huge difference if they fried to order or at least every hr or two.\n\nIt isn't really the place or kind of food that 'must be had' but rather if you already have a taste for it or crave it. The location isn't bad but the restaurant itself feels too much like a cafeteria. If it weren't for places like The Market down the block, it would feel more awkward. It most likely wouldn't do that well if it were an actual hole in the wall with cheaper rent and lower prices though.\n\nNot bad for a quick bite and a little overpriced but the quality is there for when you do want some decent udon.", "author": "Peel S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-21", "description": "Nice to have an udon place to go to amongst all the ramen options around. I like that this place is fast-casual, but the price is where I get caught at. Menu is simple - choose an udon dish. There's only a handful or so. If you want, you can add pieces of tempura to your meal, but each tempura piece is $1.50!! If you eat with your eyes, this can add up easily. Under the heat lamps, they look real inviting. I like the potato and curry potato croquette. But other good ones include a veggie medly patty, pumpkin slice, and zucchini fan. The spam musubi and onigiri are $3 each. Pretty good portion and tasty. I like the kitsune udon best because it's savory and I can add tempura without feeling guilty. The cold udon comes with an egg and has a clean, simple taste. Niku udon has tons of beef. I can eat this one without adding tempura. Creamy kobocha is okay. Tastes buttery, creamy. The tomato udon reminded me of red pasta sauce. Not bad, but not my favorite. Interesting to try. Overall - you line up to order, pay for your order, find a place to sit, which isn't hard because the turnover is pretty high for this casual lunch spot. Clean digs. Bus your own trays.", "author": "Jennifer W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-17", "description": "Update: Their tempura became delicious a little after they opened! It's nice and of light. I now always get at least two prawn tempura with udon. Now they open longer for dinner and even lunch on Saturdays. Go Kagawa-ya!", "author": "Akiko O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-09", "description": "The kabocha ramen is truly awesome. It's worth getting in the car and making the trip. Together with the 'out of this world' noodles this is a firm favourite of our team. Absolutely love the place.", "author": "BeAkira L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-05-11", "description": "Cold Ramen \nFlavor - 2.5 out of 5, average, nothing spectacular \nUdon - 3 out of 5, cooked well \nPortion - 1 out of 5, for 11 dollars, not worth it for the size \n\nTempura variety - 2 out of 5, don't get the deep fried sweet egg or fish cake\n\nSpam musubi - 1 out of 5, lacking flavor and spam \n\nKatsu sauce was horrendous and super sour \n\n\nWhat we ordered - cold udon and traditional udon (tofu skin was extremely sweet), regular and curry potato, 3 shrimp tempura, spam musubi, tempura sweet egg, tempura fish cake and 2 drinks  for 45 dollars", "author": "Vince L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-04-16", "description": "Don't expect good Sanuki udon noodles at this place.\n\nI had cold udon noodles at this place. It is the best item for quality test on udon noodles. Honestly speaking, it was below the bar. I expected it should be Sanuki udon noodles since the place name is \"Kagawa\" (Sanuki is the old name of Kagawa). Maybe my expectation was too high.\n\nIn the other day, I tried hot kitsune udon. The broth is good. But the noodles are not good for hot broth as well.", "author": "Satoshi N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-12", "description": "I have been hearing about this spot for months and am so happy they are now open!!!\n\nThis was the most delicious Udon I have ever had in my life, and that is no lie!  I had the Beef  Curry Udon and the texture was so good I couldn't believe what I was eating.  The portions were generous, the broth was Hot and the service was excellent!  I can barely button my pants' but can't stop thinking about when I am going to go back and if what I will have next time!!!\n\nI love noodles, I really love Udon Noodles and I have finally found the perfect spot!", "author": "Mac S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-16", "description": "I came here with 3 coworkers around 11:45 am Tuesday morning, and there were only 4 people eating inside, plenty of space! Most of the tables are right next to each other so you'll have to be comfortable potentially bumping elbows with strangers.\n\nThe restaurant is cafeteria style: you grab a tray, tell them your order, and watch them blanch the noodles, scoop up the broth of your choice, and hand you your bowl. \n\nNext you slide your tray by the tempura selection. They provide small plates so there's no need to soak them on your soup. They have curry potato and creamy potato coquettes, as well as shrimp, squash, sweet egg, sweet potato, zucchini, and fish cake tempura, all for $1.50 each. \n\nIf you want something small, you can get spam musubi or beef niku onigiri for $3 each.\n\nThey have a small side table with cold water, hot sauce, and tempura sauce. The tempura sauce was good, not watered down at all. \n\nOnly complaint: They need better soup spoons. It was very hard to get the yumminess at the bottom.\n\nI had their beef curry udon today. Very flavorful. I prefer my curry spicy so I had to shake some pepper into it, also available at the side table. Don't bother comparing it to Muraccis because nothing can compare. But as a near-by lunch option with yummy food, I will definitely be back!", "author": "Lilimae S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-16", "description": "I had no idea what the food was going to be like, but It was dinner time and I missed lunch so I went for it bc it was the closest eating establishment to me. Usually, in moments of hunger desperation, I make terrible restaurant choices because I'm so hungry I could eat a kangaroo. So I usually end up eating some unidentifiable food that quite possibly contains... well, kangaroo. But the experience at Kagawa-Ya miraculously broke my personal Hunger Games losing streak, offering the exact experience I needed (quick serve-at-the-counter & easy to go), and the udon soup was hearty, satisfying, & delicious. The soup was more solid food than broth, so while it seemed pricey, it was filling enough to split into two meals. I had the Beef Curry (which is nothing like Indian Curry, btw) & it was almost exactly like my grandmothers beef stew (which I've missed almost as much as I have her), but with udon noodles. It's my new go-to when in that part of the city. The kind of food you crave and can't wait to get next time. AND... while this may disappoint some, I was relieved when I realized the soup did not contain even a trace of any kind of marsupial.", "author": "Jill S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-08", "description": "Haven't come across any places specializing in udon in the area; I was so excited to finally try Kagawa-Ya! I got the Creamy Kabocha with Chicken Udon, which was a wonderful mix of rich broth, tender chicken, and of course, fresh and chewy udon! The place offers classics such as niku and kitsune, as well as their own creations like the tomato and shiitake; it was really difficult to settle on one bowl out of so many tantalizing options. An assortment of tempura was available at $1.50 per piece. I got the vegetable kakiage and the potato curry croquette, two of my favorite appetizers, and they did not disappoint. There are also interesting tempura like the fish cake and the sweet egg, which I wanted to try as well. After my meal, I got the spam musubi and the beef onigiri to-go; portions for both were very hearty, and I especially liked how the flavors of the nori and green onion worked their way into the onigiri. As expected from the location, prices here are slightly on the higher end, but the creativity of the menu, as well as the quality and care the people here put into their food, more than make up for it. I'm looking forward to visiting again and trying more of their delicious udon and tempura!", "author": "Yen Ting L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-10-12", "description": "Overhyped! Noodles are okay, but I'd recommend checking the tempura sauce to make sure it's HOT before you order any tempura because the tempuras aren't made to order nor will they have hot tempura sauces/make new sauce at 5:30pm knowing the store closes in 1.5 hrs (7pm).", "author": "Eudora Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-20", "description": "Pretty good but a bit pricey but it's expected for the area.  We got the number 1  and tempura and we really liked it. Wish the broth and tempura were little bit more warmer but besides that it was good.", "author": "Samantha N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-09-22", "description": "Not a bad place for a quick dinner. Clean, well lit space. Food was filling and affordable. The noodles were a bit mushy and my chicken was on the dry side but flavors were decent and I liked the tempura.", "author": "Jen K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-26", "description": "The food is delicious and the portions are plentiful. I gave four stars instead of five because it is a bit pricey. The cost will stop me from returning on a regular basis.", "author": "Geno M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-13", "description": "Great udon! All fantastic choices made fresh by husband and wife duo. Get there early so you can beat the lines. Tempura is crisp and yummy to add on the side of your udon. A must try and continue to go back kind of place. Location is perfect. Great job Katherine and Sean!!!", "author": "Daniel R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-29", "description": "I am getting over a cold and wanted something other than the usual chicken soup, pho, etc. (plus been there done that didn't help)  I ended up getting the niku udon, which hit the spot. The noodles have the perfect texture, not surprising since they make it fresh in house. The beef slices had the tiniest amount of fat to make it tasty, but not so much that I'm having to tear off visible pieces of fat. The broth is soothing, flavorful, clean (not greasy), and just perfect for a person fighting a cold on a chilly SF summer day.", "author": "Rache C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-14", "description": "The atmosphere is friendly and welcoming, and the customer service was nice. The noodles were very fresh. I think next time I would get my noodles warm, instead of cold, though. Overall, average price for food in SF and a creative menu.", "author": "Nicole H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-13", "description": "Very tasty food- noodles and tempura especially. Clearly priced for the tech crowd who don't bat an eye at spending $20 for lunch. Too rich for my blood- no matter how good everything tastes.", "author": "Kelley M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-04-30", "description": "Seriously, I have experienced better. \n\nThis place is located right beside our office and I think they've been open for about a month now. It's conveniently located to some of the biggest company and offices around downtown. The place is just ok since it's nicely decorated, unlike some other ramen house I've been to. I look plain and dull really. Nothing that stands out really. I think came in like a week after their opening and I was just curious if the place was any good. There was just a few chair that just looks out of place. There were only a few chairs out and seems very disorganized but you can easily see where the counter where to place the order. The menu was actually nice and clear that even without my glasses I saw it.\n\nNow, the only issue was the quality of the food for the amount I paid. When I came in, I asked the chef, what can he suggest for me. I was thinking about getting the Niku udon but since it's something new for me, I went to trust the chef suggestion. I had it go since there was not much chair. Like I said, it's just a huge space with a kitchen/counter. The suggested the curry udon as it's one of the best selling they noodles, which I find weird but ok, might as well. I would've thought he'll suggest a classic udon with miso soup. I got my order really fast and the lady handed me over the plastic. I took a peek of the bag since I thought for the amount that I just paid, I will be getting a lot more. I was so tempted to ask the lady if this is the $15 Beef Curry Udon I ordered. I swear, I thought there was more like. Yes, it was the typical take-out with a small container for my food. I was so disappointed coz I just paid with $15.  I went back to our office and I was hoping that the tastes weren't that bad. There was nothing but noodle and curry. There was some few pieces of meat and definitely not more than 4 small pieces. Not even that good either.\n\nFor that price and quality, seriously, I have experienced better.", "author": "Marvic R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-25", "description": "Service is great and fast but it's overpriced. Don't get me wrong, the udon i've had there the last few times have been delicious but $14 for beef udon is too much for the size you get. You can get a bigger bowl in Japantown for the same price, not like the \"to-go\" size bowl here at Kagawa. If it were more in $11-12 range that would make me come back more often for lunch on a regular basis cuz I love udon.", "author": "victoria y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-01", "description": "Been here 3 times, got food poisoning the 3rd time :( I enjoyed the food when it stayed down, don't think I'll ever be coming back :(\n\nChanging review: Just wanted to update this to say that the owner reached out to me which was sweet and I didn't expect that. I have to add that the restaurant does present as clean, and maybe I just happened to get unlucky. Maybe one day I'll come back, for now I just don't have the stomach for udon or spam musubi...", "author": "Ceanne H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-26", "description": "Oh man, this place has the best udon. Try everything at least once and order your favorites over and over again. I use their delivery service through trycaviar when I can't leave work.", "author": "Rachman C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-29", "description": "Love the interior of this place! It's modern and super clean. I had the beef curry udon with tempera shrimp and squash and spam matsubi. I loved the beef curry udon. The broth was creamy with chunks of velvety beef. Ordering and service was extremely efficient and friendly. Can't wait to come back to try the other items on the menu!", "author": "Mel T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-02", "description": "I think their soup and noodle are getting better!! I love it. Actually I go there at lease 3 times a month:))", "author": "Iguanatte S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-06-20", "description": "I was hoping that this place would be like the Marukame Udon in Oahu. San Francisco is well-overdue for a good old cafeteria style Japanese noodle place offering variety of tempura and rice balls to go with noodle soup.  The place fell short in a few aspects that are fundamental for a good casual Japanese noodle place.  First of all, their broth lacked umami.  Second, it is overpriced for this type of eatery.  Yes, this place is located in a building that houses Uber in now trendy and pricey Mid Market area.  However, there is no excuse for a cafeteria style place to charge $10 + dollar (the most basic option starts with $9.50 plus tax) for a mediocre tasting bowl of soup.  If you are looking to try udon noodle soup, I recommend Udon Mugizo in Japantown.", "author": "Ryoko M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-06", "description": "This place conveniently located near transportation. The service was quick. When I went there virtually no line and there were tables available. I had the curry beef Udon. The flavor was great. The amount of meat provide was plentiful. For me this was four stars. I also order shrimp tempura and the croquette. They both were cold to luke warm and this was at noon. Serving cold food is not acceptable two stars (if warmer it would have been four). Portion size is small but for me this wasn't problem, in terms of being full. The reason I am not a fan is the cost. I understand SF is expensive, so the price is not surprising, However, I  wouldn't add it to my go to place for lunch. For others, I thinks it's a great place for  lunch if you want a quick bite to eat and don't mind spending $15 for lunch.", "author": "Yaya H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-21", "description": "Yum. They sure have improved this place since they first opened. The portions are much larger, and the tempura was fresher. Very enjoyable udon.", "author": "Bruce M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-07", "description": "I love the food and the service. I lived in Japan and this is this restaurant closely resembles the quality and the experience of some Tokyo restaurants.", "author": "Alex T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-21", "description": "loved the noodles. Very tasty, one of the best I've ever had. Kind of pricy, but you get a good portion.", "author": "Ramin A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-15", "description": "I am so glad Kagawa is in San Francisco! The udon there is amazing and reminds me of Marukame Udon in Honolulu. I had the curry udon, and the curry was exactly what I needed it to be. There were good size chunks of meat and the curry was the correct spicy level. The only mistake I made was thinking the eggplant tempura was sweet potato, so I definitely need to come back to grab the correct thing next time.", "author": "Belle Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-05-04", "description": "Good food. Waiting was not long. I got a curry udon bowl with 2 pieces of tempura. It was about $17 before tax and tips. I found too expensive for the amount of food. Right after I finished my food, I went back to the office and devoured a bag of snacks. You're leave this place hungry if you an average size guy.", "author": "Ken D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-18", "description": "This place looked like the food would be very good, and since me and my friend were craving some form of noodles, we went to this udon place. The first thing we noticed was the style of how you order- its different from most places, in that it is reminiscent of a school cafeteria. You grab a tray, place your order, and move down a line to get your bowl and then choosing tempura if wanted. Then you pay at the end. I don't think tips are required. I got the creamy kabocha chicken udon, while my friend got the kitsune. The chicken one was pretty good, with a nice portion: it doesnt leave you starving, but you don't get too full either. The kitsune was not as creamy as the chicken udon, obviously, but was equally as good with a giant fish cake and nice salty soup. The kabocha's soup was a little bland, and was not exactly salty. However, everything else balanced out to create a harmony. If you are looking for something not as salty, I would recommend the kabocha, and for the ones craving something saltier, the kitsune.", "author": "Melody Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-12", "description": "I had the pleasure to eat at this restaurant. I tried three dishes already and will definitely come back.  The price is reasonable, food taste Really good, amazing decoration and all clean and nice people.. San Francisco deserved places like this.. I'll come back for sure.", "author": "Luis V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-16", "description": "I tried the beef curry udon and it was very good. Just hit the spot on a cold SF day! I would recommend it.", "author": "Michael H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-03", "description": "Kagawa Ya my \"go to\" spot for Udon in town. Nothing compares to their Beef Curry Udon bowl. Check out the Kagawa Ya Udon team for \"oodles of noodles\"!", "author": "Christopher T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-20", "description": "I frequently work at City Hall and found this place about 2 blocks away. Love that the menu is super easy and simple (straight to the point). I have now visted 2X and must say it's amazing! I recently had the Beef Curry Udon and as I was checking out they surprised me with Spam Musubi which was a perfect combo. Fast service for lunch which is highly accommodating.", "author": "Oscar U."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-15", "description": "Awesome noodles! Chewy and firm at the same time, the perfect bite. Very clean space and smiley service. A very welcome addition to the mid-market restaurants. I already wanna come back and try all of the bowls! I live in this neighborhood, so my wish is that they stay open during the weekends. The Market (Twitter HQ) is very busy on Saturdays and Sundays, they should tap into that market.", "author": "Jonsey B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-08-29", "description": "The food is very good quality, but I give it 3/5 stars because there aren't many options, and it's pretty expensive-- $18 for beef udon, then $1.75 for each piece of tempura.. but I know it's in the city so I guess that's what you could expect to pay, even for a bowl of noodle soup.", "author": "Jannet H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-09", "description": "This place is clean and inviting. Very cool monitors for the menu. We were a party of 4 and tried 4 different bowls of udon and just about every side of tempura and wrapped appetizers. My favorite was the curry udon. It was super flavorful and not salty. The others liked the beef broth and original. There is no substitutions but you don't need to, the bowls are delicious just the way they are. I brought my 3 yr old in and she loved it which is saying a lot since kids are picky. Just found out they deliver too. Yay!", "author": "kelly y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-27", "description": "Fresh noodles, great broths and toppings. Portions are just right and the price is reasonable. One of my favorite lunch spots on Market.", "author": "Eric W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-26", "description": "I absolutely LOVED the food!  Everything was made fresh onsite, and before your very eyes!  The noodles are incredible and loved the Kabocha Udon!!!!!  The ambiance is also light and bright and it was a nice place to be in as well.", "author": "Daniel F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-22", "description": "I want to like it more, but it's just okay.  I got the Kitsune udon ($9.50) and added a piece of fishcake tempura ($1.50 per).  And I agree that it's a little pricey, especially for the non-meat (what is fish considered?) version.  Flavor is okay.  It had a lot of oil, and I felt a little greasy (and yeet hay) after. Tempura wasn't the crispest, but it's also been sitting out for a while.  The portion sizes worked for me. I'd probably just add more tempura pieces on hungrier visits.  I'm not opposed to going again, but I'm also not rushing back.", "author": "Glo T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-06-20", "description": "Way too expensive even for SF for what you get- total was $16 for a bowl of measly , greasy fatty bits of beef with no veggies and $1.50 per tempura piece-not going back there ever again.", "author": "Jamie M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-18", "description": "Amazing spam musubi and onigiri ! Beautiful and warm space and very friendly employees :)", "author": "A V."}
