{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-29", "description": "I had heard so much about Kaisen DON and was so excited to try it! I was meeting up with friends and we decided to eat here on a whim. We got here right when it opened. They informed us that they didn't have any blue Fin tuna at all today so they would be replacing the bowls with tuna with other fish. The menu is quite extensive in terms of the bowls they have and they have a rotating menu of appetizers and specials! \n\nI opted for the truffle salmon don and it had 6 pieces of seared salmon topped with truffle sauce. It also came with cucumbers , tamago and some seaweed on the side. The rice was nicely seasoned and when you wrapped the rice, seaweed and salmon together it was delicious! We also tried the salmon ochazuke and it was ok. The salmon was a bit salty but it was still decent. Probably wouldn't be something I order again but I would come back for all the other bowls.\n\nThis place is def not on the cheap side, but if you like good quality fish this place is a good option. Can't wait to come back to try the other dons.\n\nTotal for 3: $95", "author": "Stella J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-10-29", "description": "This place is good, but not really good/unique enough that I'd recommend it strongly. I really wanted to try it b/c it was all over Instagram for a while, but when I went I don't really think it has anything over other sushi places. \n\nIt's a super small space on Ocean Ave, maybe enough capacity for 15-20 people. I went on a Monday so there was no wait, but I can definitely see it being difficult to get a table on a weekend. \n\nThere's quite a few different styles of bowls, ranging from around $15-$30 depending on what you get. I get that raw fish isn't exactly cheap, but the prices still seem a bit steep. \n\nIt didn't help that the waiter seemed like he was always trying to upsell us on random stuff: we (party of 5) went on a Monday to get the $1 oyster special. Originally we wanted to order 10, so two per person, but the waiter said we could only order 6 or 12 even though it doesn't say anywhere on their menu that you can only order in increments like that. We also each ordered an unagi taco and he tried to convince us to order more of different types so we could try them all. No thank you... \n\nOn the plus side though, the bowls are absolutely beautiful!", "author": "Melissa H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-10-21", "description": "$22 for 1/4 Tray of uni that's supposed to be 7 big pieces.  Only the piece on top is a whole piece, the ones underneath are broken pieces pieces. Complete ripoff!!!!\n\nThe sushi rice are not subpar possibly cheap grains were used.  \n\nFish was supposed to be from japan but It sure doesn't taste like it.\n\nService was not good either.", "author": "A A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-08", "description": "いらっしゃいませ！\n\nKaisen DON defines Chirashi bowls to me. Came here on a Sunday for lunch and the place was packed. Every table were seated and I see that every table had at least one Omakase Don- so I knew I had to order that! I ordered the Omakase Don along with their daily special: Truffle with Scallops. \n\nOmakase Don: the bowl have 12 pc of fresh sashimi and sushi rice/ comes with seaweed and wasabi/soy sauce.\n\nTruffle with Scallops: 4 pcs of scallops topped with tobiko and truffle\n\nOverall, the sashimi was fresh but the cut can be more generous. The concept of this place is not bad since they are mainly serving the fresh fish/bowls or hot bowls such as unagi don, salmon ochazuke don, gyu don and etc. If you like chirashi- I recommend coming here! For price wise, I do think this is an average price for chirashi bowls but I wish they would give the option to substitute some fish.", "author": "Sammi L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-12", "description": "Hubby and I were looking for a kid friendly sushi place and have been seeing some pretty photos from Instagram of this place. Located in an odd location on ocean avenue, parking was easy to find (we paid for meters but later found there was ample street parking).\n\nOmakase nigiri set is $55 so I opted for the regular nigiri set at $28. Hubby went for the omakase chirashi bowl for $30.\n\nFood was good, quality of fish was good. Presentation was also nice. Ambiance is relaxed. We came quite late around 1:50 and was there last seating. We brought our huge stroller and our baby and felt relaxed since we went during this odd time.\n\nVeterans and students get 10% off and also check in on yelp for a free edamame or seaweed salad.", "author": "Betty C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-07", "description": "This place specializes in Chirashi bowls. I ordered the rainbow don, which came with hamachi, salmon, and tuna. The sashimi were fresh and thick. I also got the uni sampler, which came with uni from Peru (Peru produce uni??), Mexico, and Santa Barbara, 3 pierces each. SB uni won the crown. \n\nThe waitress was extra nice to us!! 5 star service!", "author": "Angela T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-13", "description": "I recently went to Kaisen Don on Ocean Ave for lunch. They specialize in Chirashi Bowls.  There are 10 Don bowls yet only one vegan option- Very Green Don- Seaweed, tofu, cucumber, & sweet tofu all over sushi rice. This is what I ordered since I am a longtime vegan of 19 years (will get my pension in veganism soon). \n\nKaisen Don is a Rice Bowl which some different Sashimi are placed on Sushi Rice. Normally, it's served at Sushi restaurants & is popular for lunch. \n\nChirashi, also called chirashizushi (ちらし寿司) is an interesting Japanese meal. The word \"chirashi\" means \"scattered,\" so this is basically a big bowl of rice mixed with fish, vegetables, & additional ingredients of your choice. Glad they had at least one vegan option. It reminded me of unwrapped sushi in a bowl.\n\nThe Very Green Chirashi Don bowl also had pickled ginger & wasabi like is typically accompanied w/ sushi. I found it quite alright yet would love them to have at least one other vegan option such as avocado perhaps or even a more innovative vegan option.\n\nThe Very Green Don also came w/ a complimentary miso soup w/ wakame sea vegetables. I had this w/ a side of edamame-seasoned soy beans. \n\nAlthough was an interesting experience that I am glad I had would be more likely to return if they had some more interesting vegan options as aforementioned.", "author": "Shane S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-25", "description": "Kaisen Don is a quaint little family-owned sushi restaurant, bringing you delicious chirashi bowls!\nThe Omakase Don was amazing; it had fresh & yummy pieces of sashimi, and the sashimi to rice ratio was also perfect! So even though this place is a little more on the pricey side, you get a good amount of the quality sashimi that you're paying for.", "author": "Kathy Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-02", "description": "Good Omakase Don place!\n\nWe got here around 5:30 on Sunday night and we were the first customers! We both got Omakase Don - Chef's choices 12 pieces ($28.95) which came with Uni, salmon, tuna, hamachi, tamago, fish roe, crab meats, cucumber and seaweed.\n\nFish was fresh and tasty but I felt that there were too much rice in a bowl. I wish there is less rice and bigger pieces of fish. Nonetheless, it was good. Uni tastes amazing! I checked in on yelp to get free edamame which was okay but good for free appetizer. Also, their tea was unexpectedly good. \n\nI recommend this place!", "author": "Clare L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-31", "description": "A unique dinning experience. The place is small but the staff are nice. They have one menu for specials of the day and their standard menu.i tried the rainbow don and the eel don.\n\nThe eel was war and flavorful. I wish it had more sauce tho. The miso soup was nice and not salty Iike most places I have tried. The rainbow don't comes with 3 slices of salmon, 3 slices of tuna and 3 blue tail fish. I have never tried the blue tail fish, but it was fresh and nice. \n\nThe basic concept of the place I believe is like finger food and you can make your own hand roll. I wish it had more fish, because you get more seaweed to fish, or maybe I'm suppose to cut the fish in half to make a better hand roll. But will come back to try another dish. It does get busy after 6:30.", "author": "Bonnie C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-08-26", "description": "We came to this place to see what people have been talking about. We ordered a few items: Omakase Don, Hamachi Don and Blue Fin Tuna. Food looked good and tasted fresh for the most part. Our stomachs weren't happy afterwards so doubt that we will be coming back anytime soon. \n\nPros:\nFood presentation can look good on instagram.\n\nCons:\nWay too much rice.\nNot worth the price point.\nService can be improved. (It's extremely awkward and rude for them to stand over your shoulder as you try to figure out how much tip you want to leave!)\n\nThis was our personal experience and thoughts, though others may feel different. All in all, we won't be rushing back anytime soon and probably won't be recommending to friends or family.", "author": "Roman L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-16", "description": "WOAHHH. BOMB AF. \n\nI definitely recommend everyone to give this place at try. We ordered:\nSalmon Ikura Don\nKaisen Don\nScallop Lover\nAll were bomb and fresh! I love how they give you a side of seaweed to wrap it like a sushi roll. \n\nThere's not many seats in there. I went on Thursday at opening time 5:30PM and it was not crowded at all. \n\nAlso, check in and get a free edamame, which was actually really good. \n\nThe server was super nice, parking is easy and food was good. Nothing bad to say here. Just go! :) I'm definitely coming back!", "author": "Darlene T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-10-17", "description": "Tried them at the NorCal Night Market at Alameda County Fairgrounds this fall and they're whack. Uni was poorly presented and very skimpy portions for $17. Wasn't even the live uni from Santa Barbara.\n\n\nDon't know if I will give them a try at their actual location.\n\nBetter try fine dining for my sashimi needs.", "author": "Rebecca B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-07-12", "description": "The SO and I are absolute sushi lovers and were disappointed with our experience. The service was alright-- it was sometimes difficult to flag down a waiter/waitress as the two people working that night were chatting by the registers. \n\nWe started with a scallop burger and blue fin sashimi. The uni in the scallop burger had a funky flavor that completely overpowered the scallops and the blue fin was very fishy and not melt-in-your-mouth tender. My main was the rainbow don and the SO got the omakase don. Both of our dons tasted very fishy and overall we felt that the fish was not very fresh. There was a decent fish to rice proportion but I ended up eating a lot of the rice to cover up the fishy flavor. \n\nI'm hoping that my one experience was just an off day and I'd like to try it out again in the future... but it's just a bit on the pricier end for sushi.", "author": "Andrea K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-25", "description": "This place is pretty good if you're looking to satisfy your craving for sashimi and sushi! We came at around 7pm on a Saturday night and there was a small wait. The parking wasn't too bad, but it was all street parking. \n\nMy friend and I both decided on the Rainbow Don, which cane with salmon, hamachi, and tuna. They didn't have tuna that day, so I subbed for scallops. The portions were decent, and the sashimi slices were fatty. It came with seaweed strips, which ended up being a good idea with the sashimi and rice. Of the three sashimi choices, my favorite was the salmon. The scallop has somewhat of an unusual taste, and they weren't sweet and fresh like they usually should taste. \n\nPrices are a little high for the chirachi here but nonetheless, a pretty good experience overall!", "author": "Sandra S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-18", "description": "This place is pretty damn delicious!! If you go to omakases a lot and find yourself always just looking forward to the salmon, ikura, and uni pieces... This is the place for you. If you want variety and favor tuna, this might not have as many options for you.\n\nEither way, omakase quality fish at very reasonable prices!\n\nService is iffy here. Didn't give us spoons or plates despite asking many times, so we were basically eating off a napkins. Also, they kept the door open which made the whole experience freezing cold.", "author": "Betty T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-31", "description": "The wait was unbelievably long, but I guess it's normal for such a tiny restaurant with very limited seatings. For a party of 4, we waited close to an hour, and we were only second or third on the waitlist. Goodness. So you might wanna reconsider going with large parties.\n\nTheir menu is quite extensive I'd say, lots of options to choose from. Portion is very big and I had a hard time finishing my food. Sashimi was super fresh & delicious, we ended up ordering more on the side, maybe that's why I had a hard time finishing my food. Overall I'm super impressed. The price is very very reasonable for the portion and generosity in ingredients. \n\nThe main dishes we ordered came out very inconsistently. Some was quick, some took forever to get on the table. Service was excellent though, and I think it helps that it's a very small place, haha.", "author": "Elle T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-30", "description": "So I've been coming here for months and i've been behind on reviews.  When they first started the prices were reasonable, but now they are slightly higher.  Most of that time that will matter, but the food is honestly really fresh.  I love how they have a daily special menu and it changes everyday.  Which is kinda a hit or a miss.   One of the times i came here i had the salmon truffle don and was so amazing.  It was rich and fresh at the same time and once you've tried this, you'll get addicted to it.  Our at least i got addicted to it.  I also had the scallop burger which was sandwich between the seaweed with uni.  It was so delicious!! I wish i can order more of this!  There are days they have uni specials where you can order a half or full plate of uni, but watch your wallet. \n\nHere's are the types of Dons i had in the order i like it\n\nSalmon truffle Don\nScallop Lover Don\nRainbow Don\nHamachi Don\n\nI wish parking was here at night, but i guess if it was easier, i'll come her a little too much.  All the times i've been here, the service was always perfect.  I recommend this place to any lovers of chirishi or sashimi.", "author": "Belinda C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-16", "description": "I have been to Kaisen Don twice since they opened and I ordered the same thing both times. Their Omakse Don is pretty good with a wide variety of sashimi. My personal favorite is their salmon, uni (it can be a hit or miss, the ones I had the first time was so so: however the ones I had the second time was really tasty!) and scallop. For $34, you get all kinds of fresh seafood, I will definitely go again!", "author": "Ching L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-16", "description": "Updated: Changed my rating from 4 to 5 stars as I've been there a bunch more times since my review and the food is awesome every time. Super consistent and so much fresh uni!!!!\n\nKaisen Don is a fantastic little chirashi joint that I have wished into existence. Chirashi is my favorite way to eat sushi.\n\nI have been here 3-4 times. Most of the time, I order the Omakase Don and it's always creative and fresh. Last time, in addition to the medley of beautiful seafood atop a perfectly cooked bowl of rice, it came with a small slice of foie gras. Another time, it came with truffled scallops. Always comes with a spot of uni and is so delectable.\n\nThe presentation and plating of the sushi here is a clear indication that the chefs in the kitchen know what they're doing and care about their craft. Everything is so artful and pretty, it's hard to dig in!\n\nI wish they sold a simple beer here, such as Sapporo or Orion. I'm guessing they don't have an on-sale beer and wine license.\n\nKaisen Don is priced fairly for the quality and quantity of food.\n\nKeep up the good work, Kaisen!", "author": "Tala D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-17", "description": "Food is great service is great \nJust like what I ate in Japan \n5 star king salmon and scallop so fresh", "author": "Jia W Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-07", "description": "We came on a Sunday to eat lunch, it's a small restaurant. The waiter was attentive to our needed and refills our tea.\nWe order Rainbow Bowl and Kaisen Don, Unagi Don and Sashimi. The food was delicious and looks nice. \nIt's a little pricey but good experience to try .", "author": "Lily L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-18", "description": "Pricey but yum. Came here a while back. like a while back, but never wrote a review. Tried their Rainbow Don ($18.95) and NegiToro Don ($35.95). The rainbow don came with 3 pieces of hamachi, tuna, salmon, and cucumber over a bowl of rice. Sashimi was fresh and nicely sliced. The toro don was made with chopped up fatty tuna under ikura. Not sure I liked the chopped up toro with the rice by itself, but wrapped in the seaweed was like a negi toro handroll which was great (LOVE negi toro). They gave us about 3-4 pieces of seaweed which wasn't enough so we had to keep asking for more seaweed and that was an additional cost. We also ordered a side order of scallop sashimi which was also fresh. Overall, a very yummy meal but not completely filling. And for $20-30 for a bowl was pretty fricken pricey for the portion plus the additional costs for the seaweed is crazy. Haven't made a trip back since then but I noticed they offer more now and even have nigiri's.", "author": "Anissa D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-14", "description": "Absolutely loves this place. It is a small shop so best call ahead to see how the line is like but also the staff is very attentive and friendly. Portions are great and i highly recommend the uni as it is super fresh and does not have the strong ocean taste. \n\nI had the Salmon Ikura bowl and everything was delicious. The salmon roe had a hint of sweetness and perfectly balanced out the meal\n\nWould definetely come back to try the other chirashi bowls with more uni!", "author": "Danny F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-10", "description": "This place is delicious and full of noms! We ordered the omakase don, the rainbow don, and the kaisen spoon. All were completely delicious. The omakase don had a good variety of fish and a great rice ratio. Super fresh and tasty. Same with the rainbow don. The kaisen spoon (which I believe has oyster, ikura, tobiko, and ponzu sauce) was really flavorful and a perfect portion size.\n\nService was great and the complimentary tea was surprisingly tasty. The complimentary edamame (check-in with Yelp) was decent and nothing special but nice for a small, free appetizer. \n\nCan't wait to go back!", "author": "Yanni L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-11", "description": "LOVE this place! Fresh fish, modern and simple look, and overall a great experience! \n\nWhy I was here // Came with a group of 6 for dinner since we had friends visiting from LA. \n\nFood // \n-my friend and I split the uni scallop burger // $10 // Don't be tricked, its a burger- but when they say burger, it's 2 scallops with some uni in between wrapped with seaweed. \n-Omakase Don // $28.95 // Worth getting if you are a fish lover like me! So fresh and everything was tasty and full of flavor down to the sushi rice! \n\nOverall // This place is pretty pricey compared to a few other places I've been to, but you are paying for quality. Everything is delicious and I would definitely love to come back! \n\nI think it gets busy pretty quickly, so it helps to maybe call in (not sure if they take reservations) or come closer to when they open so you can get a seat. The restaurant space is very limited.", "author": "Emily T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-05", "description": "Amazing service with awesome food. Basically tried every fish in the menu and I've got to say...I was impressed. The salmon was so tasty and the tuna was perfect and as you'd expect from a good sushi restaurant.\n\nThe space is great and finding it makes you think that you've stumbled upon a hole in the wall that you'd like to keep as your own little secret.", "author": "Joshua F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-23", "description": "Woah~ lcuky on trying this new omakase bento box. They look great :), love the presentation. Fish are very fresh and yummy! The Ikura nigiri is the bomb to me. I am not a big fans of ikura because i don't like them taste salty. But, their ikura is not salty at all, you can taste the fresh of the fish mixed with subtly oily but not greasy while they popping inside your mouth! Bravo! \n\nWe went on a Sunday night and the place packed after we sat down for 10mins. Decoration is simple, but clean and neat. Could have some improvements. \n\nService is great. Servers are very nice on explain the day of the specials and telling the names of fish for my omakase bento box. My tea cup never ran out of tea :)  wait time on food is average. Will recommend this place! Keep up the quality :)", "author": "Yong Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-29", "description": "I'm a huge fan of omakase and charashi... so this place was perfect! \n\nI came here right before closing and was able to get seated. Ordered the omakase don. Each meal comes with a miso soup. \n\nFood came out pretty quickly and I was in love with the presentation- especially the wasabi. I'm not a fan of wasabi so I had to pick it off :(\n\nThe bowl itself was delicious! Everything was hand-picked by the chef! My favorite was the uni, salmon and toro. The quality of everything was very fresh. \n\nThe rice however was mushy. \n\nI will definitely come back regardless of parking and the rice. It's on ocean so street parking is all metered unless you find a residential spot. It's all worth the drive for the quality of fish. I left with a fully belly and smile on my face :)", "author": "Elaine C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-12", "description": "New restaurant opening excitement gets the best of some of us. I'm one of the biggest offenders but I'm glad I waited on Kaisen Don.\n\nKaisen Don soft opened about 3 months ago in the former Rainbow T Dessert space. It's a small restaurant with seating for about 20 people so it's not a place to come rolling in with your entire posse of 10. It's ideal for solo diners and couples. No reservations.   \n\nKaisen Don's specialty is chirashi with about 10 variations. For those squeamish about raw fish, they have dons with cooked proteins: chicken teriyaki, unagi, chashu, and beef curry. Each order comes with a complimentary bowl of miso soup. Currently, they don't have a liquor license. \n\nIf you see a particular item on their Yelp page that you want, call before visiting. I saw a pic of the shaved ankimo but they didn't have it and the girl at the table in back of me wanted negitoro but they didn't have that either. \n\nNote to the owner, there's a small discrepancy on your Yelp page. It says, to mention Yelp to get 20% off but the grand opening check-in offer is 10% off. \n\nLast week, I had some time to kill because of street cleaning in my area so I figured it was the perfect time to visit Kaisen Don.\n\nI ordered the Omakase Don ($28.95): http://bit.ly/2H8jKfF. The fish and seafood toppings will vary daily and based on seasonality. \n\nOn the day, I visited my Omakase don was topped with Mirugai (geoduck), Hamachi (yellowtail), Ikura (salmon roe), Uni (sea urchin), Hotate (scallop), Sake (salmon torched), Amaebi (raw shrimp, no head), Kani w/ its brain (crab leg w/ torched brain), and Tamago (sweet egg omelet). For the value driven folks, the cuts of fish (~12 slices) are thicker than usual for a chirashi. Small sheets of nori are provided so you can make mini hand rolls. \n\n(+) Good variety with some premium offerings like mirugai and uni. Remember I said, I was glad I waited on visiting Kaisen Don? During their soft opening, the toppings for the omakase don were run-of-the-mill fish like maguro, hamachi, and sake. Didn't see premium offerings. \n\n(+) Everything was super fresh with my favorite being the perfectly sweet and briny Santa Barbara uni. So good. \n\n(-) Knife skills could be improved. Several slices didn't have clean edges (i.e. amaebi). \n\n(-) While the sushi rice was a good temperature and texture, it was underseasoned and plain. \n\n(-) The wasabi was awful quality (dry, crumbly texture). Yes, it has their cute embossed fish logo but I hope the owner looks into using higher quality wasabi to match their fish.  \n\nService was polite and friendly. I was their first customer of the day and it took about 20 minutes for my order. \n\nMinimalist dining area with wooden tables and metal chairs. I enjoyed the 80s and 90s music they were playing. \n\nLooking at their pictures and their reviews for the past couple of months, it does seem Kaisen Don has some consistency issues and/or still trying to figure things out but I wouldn't be opposed to returning. Their raw fish is good quality and that's what's most important to me.\n\nWhen I'm having a raw craving and don't want to spend $$$ on a nice sushi dinner or deal with the madness at Amami, Kaisen Don will do just fine.", "author": "Cherylynn N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-12", "description": "My new favorite place to eat. The special salmon sashimi topped with truffle was heavenly! The place is small, but we did not feel crammed. We had a large party (7 adults and two kids), and we did not feel rushed at all. Definitely a neighborhood find to share with friends and family!", "author": "Angelia H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-08-06", "description": "Service = A\nFood = B\nDecor/Ambiance = non existent\n\nKaizen Spoon = $7. 1 bite of oyster, uni, and tobiko. It was a nice combination of sweet uni and salty oyster.\n\nRainbow bowl = $19. 3 pieces each of tuna, salmon, and hamachi. Pretty fresh, but none of the fish was amazing or had a wow factor\n\nKaizen bowl = $28. Chef's choice. Best part was the uni.\n\nI do like that they give seaweed strips to make your own handrolls. Service was really quick and the waiter was really attentive to our tea refills & anything else we needed.\n\nOverall, we thought it was overpriced for the quantity and quality of food served.", "author": "Jessica C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-08", "description": "This place is delicious! It's kind of everything I was looking for in a sushi bowl! Fresh fish, decent price and generous portions. I came here on a week day around 7pm and there was a bit of a line, but not bad. The place is super small, so if you don't want to wait come off hours.\n\nWe ordered:\nUni Spoons: Fresh and delicious in one spoonful! Uni was so fresh and loved the combination with the sauce!\nScallop Bowl: If you are a scallops fan, this is your type of bowl. They gave lots of scallops and salmon roe all over it, so good with the rice!\nOmakase Bowl: RECOMMEND! If you want a bit of everything, this hits the spot. The amount of fish they give is generous and each bite was pure happiness to my tummy.\n\nOverall, I would come here again! I wish they had a Uni bowl, but they just opened not long ago, so maybe someday ;) \n\nP.S every bowl comes with a miso soup! #winning", "author": "Natalie L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-03-05", "description": "I really wanted to love this place but the stomach pain that I had almost immediately after I finished my bowl made me feel otherwise. I ordered the Kaisen Don, which had scallops, crab legs, and ikura. Two of the four scallops that I had in my bowl tasted funny - kind of a stinging/sour feeling in my mouth. I disregarded it the first time, hoping that the feeling was just from the wasabi, but when I got the same taste after not using any wasabi, I knew it was the scallop. Either way, I still finished my bowl (big mistake), but I had a pretty intense stomachache after I left. Luckily, it didn't last the whole night. Maybe I just got unlucky with a few bad pieces of scallop, since, judging from reviews this doesn't happen often. \n\nOn the other hand, my boyfriend ordered the Rainbow Don, which I also tried a bit of. His bowl was great, the fish tasted fresh and we both really liked how they give you strips of seaweed on the side to make your own sushi roll. Every bowl also comes with complimentary miso soup. They also have hot bowls with chasiu or unagi, etc. \n\nI would say that the chirashi bowls are on the pricer side, around $20-30 per bowl, with the hot bowls a little cheaper. I might be willing to go back to try their other options, but definitely won't be getting any of the scallops!", "author": "Cecille W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-16", "description": "Came here early on Saturday night and was able to grab a table right away. \n\nI got the Omakase bowl and my husband got the Rainbow Bowl, along with an Uni/Oyster spoon. \n\nThe service was friendly, with one person running the front of the house. The place is pretty small, seats 20 max. \n\nThe fish was really fresh,but I left feeling unsatisfied, and my husband still hungry. \n\nThe 20% opening discount made the trip worthwhile, but it would be nice to see some additions to the menu like appetizers. I believe they are a few months away from getting their liquor license, until then, no sake with your fish.", "author": "Mimi T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-16", "description": "The 20% off your order for their soft opening was definitely a draw in! They didn't specify for how long, but I'd go before it ends!\n\nTheir décor was incredibly minimalistic and set a very clean atmosphere. I liked their concept on how to eat the bowls. Not sure if that's the traditional way but I've never seen it before and fell in love. You're supposed to wrap bite sized rolls with the contents of your bowl into the little seaweed pieces that are provided with your dish. I opted for the Kaisen Don #2 ($18.95) but I wish I had gotten the Scallop Lover ($16.95) instead. I don't think the crab legs were worth the extra $2 and the scallop was so clean and fresh, the Scallop Lover would have been a better option for me. \n\nOverall, I liked Kaisen Don and the 20% off was definitely a steal.", "author": "Annie N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-11", "description": "A pretty decent place to get your Chirashi don fix. The portions are perfect. Not too big and not too small. They're also really generous with the rice. Miso soup was complimentary. However, the prices are a little high. \n\nPlace is pretty small and it threw me off when there was a very strong fish smell as soon as I walked in. My jean jacket still has the smell of fish stuck to it. \n\nMy favorite item that was ordered would be the uni scallop burger. The uni scallop burger has black truffle sauce stuffed inside. Each burger is $10. This item isn't listed on the actual menu but is written on a very small chalkboard near the cash register. If it wasn't for yelp, I wouldn't have known this item existed. \n\nOther items ordered were the Kaisen spoon (oyster topped with uni), salmon ikura don, and chashu don. \n\nSalmon ikura don was about $20. It was good but I don't think it was worth $20!? Luckily, there was a 10% discount for the yelp check in!", "author": "Bonnie T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-07-18", "description": "Ordered Chashu Don, Hamachi Taco, Salmon Truffle Don. Free edamame with check-in. Service was very attentive and courteous. Food was tasty but portions were small for the price. I was about 80% full after eating the Chashu Don and Hamachi Taco.", "author": "Cathrin P C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-24", "description": "I'm always in the mood for sashimi so I knew I had to give Kaisen Don a try when I saw it pop up on Yelp! We were lucky enough to not have to wait at all- I could imagine that the wait times will change once people start hearing about this place. \n\nHere's what I liked:\n(+) Fresh sashimi - everything in our omakase don were de-lish especially the crab!\n(+) They obviously put thought into the presentation of the donburi so that they are gram ready!\n(+) 20% off during their grand opening!\n(+) UNI UNI UNI\n\nHere's what I thought could use more work:\n(-) The service was not terrible at all, but our waitress was a bit flustered and unorganized.\n(-) The 1/2 tray of uni that we ordered didn't really come out in a half tray. It seems to be a smaller portion than what I'm used to, but it could very well be just perception because of the presentation. \n\nI think I'd definitely come back for more especially while they are still offering 20% off!", "author": "Tiffany U."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-23", "description": "Stellar food. Beautiful presentation! Friendly service. Ample street parking. Limited seating. Clean bathroom", "author": "Linda L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-14", "description": "A hidden gem for good donburi AND UNI!  Came here for a later lunch on a Saturday (1pm-ish).\n\nVenue / Service: on the smaller side, the biggest table probably seats 4 people and fits probably no more than 20 people.  B/c the kitchen is small, food does take a bit on the longer side, but not long enough that you start to get impatient.\n\nFood: in general, the donburis are well portioned, in fact larger than I've seen at most places.  Enough protein vs. rice and bowl sizes are good enough to fill the stomach of a hungry guy.\n-- Santa Barbara Uni / Half Tray (~$30) - came here mainly for this since we love uni.  A half tray is around 5 pieces, which are placed on slices of cucumber and served with wasabi and pieces of nori.  We basically placed pieces of uni in the nori with a bit of wasabi, which I think was the best way to enjoy the taste cleanly.  Uni was pretty fresh and sweet (being from Santa Barbara); definitely worth the trip for!\n\n-- Gyu Don (thin beef, onion, tamago)($12.95) - to supplement the uni, I ordered one of these.  The tamago was tasty, even if it looked more like cheese.  The beef was nice and tender and they give you a decent amount vs. rice.  Wish there were more veggies / onions, but the taste was pretty good.\n\nMy date had the Unagi Don (BBQ eel, seaweed, pickle)($15.95), which was also quite tasty.  A bit too much of the sauce on it, but the eel was nicely cooked and was a pretty big piece.\n\nAll in all, we weren't disappointed after driving out of SF just to try their uni and the donburis.  Price was a bit high, but I think my date and I would make a trip out again here.", "author": "Audrey H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-12-12", "description": "Don't get me wrong, I'm not a sushi hater.  I actually prefer fish over meat because its low in carbs and high in protein.  That equates to less time in the gym to burn off those calories.  \n\nUnfortunately, the portion of rice to fish was excessive.  I would say a majority of the bowl was rice.  I ordered the kaisen don #1 and there were a few pieces of tamago, salmon, and ikura.  Honestly I thought, the omakase don my sister ordered was a better deal.  Especially with the 20% off.  \n\nThe yelp says their fish come from the Tsukiji market which is a well known fish trade port in Japan.  However, the preparation of their fish could be improved.  I felt like the texture wasn't firm enough and on the mushier side.  I was also very surprised to find a piece of bone that was still inside one of the yellow tail pieces.  It's fortunate that I didn't swallow the piece whole...", "author": "Derek L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-02-10", "description": "3.5 Stars\n\nLong story short\n\nSeating is not great for large parties\nPortion of rice is copious however inconsistency in cooking was a let down\nPresentation of the fish was good and enjoyed the variety in the Omakase Don \n\nOverall Thoughts\n\nIf they can step up their rice game I could see myself coming back to try their other bowls", "author": "Eddie W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-02-04", "description": "Fresh fish, good miso, service was relatively quick, not too busy as it seems to be a soft opening. \n\nHowever, it's a bit too expensive averaging around $20 or more for a bowl, seems a bit high. For that price, I was expecting a bigger bowl...at least five more rice for the impression of a bigger bowl.", "author": "Long C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-27", "description": "Thanks to @yelpsf for the recommendation. I have been wanting to try this new hot spot out and finally made the worthy Foodie Adventure thanks to @derjaymarz for visiting all the way from Germany and hungry SF Foodie @epumas.eats and @da.dan.chan for the company. This Omakase Don took me back to the day I went to Tsukiji Fish Market in Ginza. I went with homie, @kenikophoto, met a dope couple that shared their company and eduacated us about delicious fresh Uni.\n\nGo and try this delicious bowl and utilize that soft opening 20% off.  \n\nLarry the owner, opened up the door and me and my friend waited outside patiently. First one there I asked if he was the owner and he told us he was. It was nice to meet him and that now I know that there's a way more delicious spot than the other fish bowls nearby the area. Cost a little more but if you want to taste fish similar to what they have in Japan, GO HERE you will not be upset.", "author": "Jray M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-13", "description": "First off, if you've been to tsukiji market in Tokyo then you'd really appreciate this restaurant... I wanna say it's the first of its kind in the Bay Area since I haven't seen anything similar around the area. But it's pretty much different selections of chirashi (fish over rice), exactly like how they serve it in tsukiji. For this reason alone, it gets a higher rating from me...\n\nAs far as my experience here is concerned, I think there's definitely some improvements to be had, but they're still in the soft opening stages so guess I'll give them some slack... the main issue that I saw on my visit was the lack of efficiency/staff (tables were not being cleaned, which meant longer wait time). Other than that, service was very good.\n\nFood wise... the taste and freshness was there. I ordered the ikura/uni don and the ikura tasted exceptional! It was very well marinated with a balance of sweetness and saltiness, probably one of the best I've tasted (even compared to Japan). The uni was also very fresh with no fishy-ness whatsoever. BUT....... even though it tasted good, there was a slight issue with it. The amount of ikura WAS NOT the same as advertised... and for $30, I'd expect the rice to be fully covered. Although, there is still the 20% soft opening discount, so I guess I won't complain too much :p\n\nOverall verdict... \n\nI'll definitely be back for more! Cause the other stuff looks good too.", "author": "Marco M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-16", "description": "Super tiny place, prices are a little high, but absolutely delicious. I came in 40 minutes before they were closing for a table of two and had a very short wait.\n\nWe got the salmon ikura don and rainbow don to share. The bowls are very similar, except the rainbow don has a variety of fish instead of just salmon. If you like raw fish, I'd recommend the rainbow don instead of the salmon ikura don because it has more slices of fish (unless you love roe then get salmon). All the fish were fresh and the rice was very addicting. It comes with a side of seaweed so we made our own mini sushi wraps.\n\nService was great, but it should be since the restaurant isn't that big. Overall, I will definitely be back despite the high prices.", "author": "Julian Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-25", "description": "Decent place with a good concept! Not many places offer a variety of don options. This place has just the right amount! Menu is clean but not overwhelming. \n\nIn terms of value, I've definitely had other chirashi bowls I find more worth it but this place isn't bad at all. Everything was fresh and delicious but portion was a bit small for guys especially.\n\nThe complimentary miso soup was very bland. It was like drinking hot water :/ I had the Kaisen Don, it was good! I saw on other yelp posts that there seems to be a Kaisen Don #1 & #2 but the waitress said there's only one Kaisen Don so that was slightly confusing.\n\nI really wanted to try the appetizers (kaisen spoon $7/ea. & scallop burger $10/ea.) but they just seem a bit too pricy for the quantity.\n\nDefinitely worth trying but I'm not 100% on coming back because of the price.", "author": "Mandy H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-27", "description": "Fresh sashimi. 20% off for their grand opening still going on this month... for how much longer, I do not know. This place is small with only a few tables. Prices are a little on the pricier side but you pay for quality freshness. Delicious but might not be as filling for some. I certainly wanted more sashimi as I neared my last piece! But my wallet didn't want to comply. They accept credit cards and they will bring around an iPad with a Square reader to take your payment. The music playing in the restaurant is also connected to the iPad though so when your payment is going through, the music will suddenly stop as it gets awkwardly silent.\n\nRAINBOW DON\nThree slices each for salmon, hamachi, and tuna with a big bowl of rice underneath. You get some seaweed on the side and also it comes with a bowl of miso soup.", "author": "Diana C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-19", "description": "I love chirashi bowls so when I found out that this place opened up near my neighborhood I was so stoked to check it out. I went with the omakase don because why wouldn't you want a little bit of everything?! It came with salmon, tuna, yellowtail, octopus, salmon roe, and shrimp. AND TO MY SURPRISE, uni and tamago! I didn't even want to touch my bowl because of how beautiful it was. Each piece of fish and seafood was so fresh! \n\nFor a new business, these guys know what they're doing. Service was great, I didn't feel rushed at all even though we stayed past their lunch hours (...sorry! But thank you again!!) I now found a new spot for when I have my cravings!", "author": "Christene M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-26", "description": "FYI- Their prices have been going down! So stop by to see rather than look at the menus we Yelpers uploaded :)\n\nHappy to see a newcomer on Ocean Ave, and with a pretty and clean aesthetic. I've gotten the Rainbow don to go and while they were out of yellowtail, the woman behind the counter let me know that she subbed in some scallop and ikura - a pleasant surprise!\n\nI love chirashi bowls, and while this might not be a weekly meal for me, I'll definitely make it a point to bring my starving boyfriend here. The price point is pretty solid considering the quality and amount of raw fish. Comparable to even ordering the same amount of nigiri (raw fish on top of a little mound of rice), actually. The bowls come with a standard miso soup and some seaweed.\n\nService can be a little slow in the evenings if just one person is working, but they've been really friendly. You would think that it would be more crowded considering the yoga and gym crowd around the corner...\n\nThey're still working the little kinks out, but I'm digging their logo and food. Give them a try!", "author": "Colleen M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-03", "description": "Don bowls done right! Great new chirashi spot to fill a SF void. The bud and I came here on a Saturday for a noon lunch. Zero wait. Only one other table filled in the restaurant. Parking was a bit of a nightmare bc this spot is pretty close to the 24hr fitness on Ocean. \n\nAnyways, within 30mins of our meal, the entire spot was packed. In fact, by the time we were leaving, there was at least 3 groups waiting to be seated. So come hungry, come early!\n\nAs for the food choices, there's just about a dozen to choose from. I was mostly disappointed bc I didn't see an option with uni + fish. I misread a previous post that said their uni specials are wknights only. AH. But otherwise, my friend and I both stuck with the Rainbow Don option, which was delish. The fresh salmon, hamachi, tuna sashimi pieces were massive and came with a refreshing slice of lemon each, on top of a bed of pebbled sushi rice. A TON of rice. We felt wasteful bc we couldn't even get through half of our rice!\n\nWith 20% off during their soft opening, it made for a great (more) budget friendly lunch option. I'd come back again on a wknight to try the uni special! 4 stars :)", "author": "Jennifer L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-29", "description": "For a specialized chirashi bowl place in a quiet part of Ocean Ave, the food is fantastic, fresh, and portion is generous. Quality is consistent, price is fair, and I am so happy they are here to bring different kinds of Uni to this neighborhood! I ordered take out as well as have been in the joint with friends, and I always feel satisfied. Love it!", "author": "DC H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-05", "description": "A hidden don spot! (Dons are short for donburi which are Japanese rice bowls!)\n\nKaisen Don is a new donburi restaurant. They have a wide menu; from curry dons, to unagi dons, and even chirashi dons! (fresh fish dons). This looked like a cool new place to try!\n\nMy friend and I came at around 7pm on a Monday night. Parking here is atrocious so just a heads up! The restaurant is tiny and most of the tables were filled. Luckily there was some open spaces so my friend and I did not have to wait!\n\nMy friend and I both ordered the Rainbow Don (Hamachi (yellow tail), Ikura Roe, Tuna, Salmon, cucumbers, sushi rice, ginger, and wasabi). When you order a don, you get a complimentary miso soup! \n\nThe miso soup was a bit on a salty side for me, but beyond that it was good classic miso soup.\nThe Rainbow don here is the main attraction for me. First and foremost the presentation of the don cannot be understated. It looked gorgeous and the various colors and textures made it pleasing to the eye. Overall, I liked this dish a lot! The portion size was definitely small, but the quality of the fish and overall ingredients were good. The fishes definitely all had a good amount of fat for me and the taste of each individual fish could be distinguished. However, I definitely think the sushi rice could have been a bit more flavored for me. I didn't realize it was sushi rice until 1/4 of the way in.\n\nOverall while this was an expensive experience it was one to remember. The service here was also very good and friendly, it is something I really appreciated! A lot of the dons are rather expensive, but they have a ton of dons here to try and the rainbow don was definitely something I enjoyed!", "author": "Anthony Y."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-09-03", "description": "It smelled quite fishy when I walked in so I was skeptical about the quality. \n\nThe price is very hefty for what you get. Everything was very mediocre for the value. Would I come again? Probably not. The bowls are just cram packed with rice and just had a few sashimi slices. \n\n10bucks got me like 4 thin sliced scallops that if you put together was probably barely one scallop.\n\nA hand roll wasn't even rolled. It was literally a seaweed on display with some rice on top. I think it was aiming for aesthetics but it was way too novelty.", "author": "Allan W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-04-19", "description": "The bf & I were pretty excited to try this place based on the reviews & the close distance from his home, but we were sadly disappointed by the quality & price.\n\nFOOD:\n- Omakase Don $29 \nWhile this don offers a h-u-g-e variety of fish & etc, the quality doesn't deliver. The squid & scallop were also extremely disappointing - leaving a gross aftertaste in both of our mouths. The rice was ok.\n- Rainbow Don $19\nWe ordered this based off of yelp reviews but don't be fooled. I didn't know a rainbow only had 3 colors.. but there were only 3 sashimi options offered with this & only 1 out of the 3 actually tasted decent.\n\nETC:\n- Parking may be difficult, as it's on a very busy street.\n\nGiven that it seems like a fairly new restaurant, we might consider coming back.. or not. We'll see!", "author": "Rachel Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-10", "description": "Very fresh fish especially Uni, worth very penny. \nThe restaurant was very small with one waiter but service was very attentive.", "author": "S T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-18", "description": "The salmon ochazuka bowl is warm and delicious. The sashimi is very fresh, especially the salmon. The omakase bowl is ok, if you check in this restaurant, you will get a bowl of edamame for free. At lunch time, every customer will get a miso soup for free.", "author": "Vanessa Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-28", "description": "Small humble shop, super fresh fish prepared in small batches. Omakase bento is the one everyone should opt for. It includes select dishes of the day as well as new flavors only select to them. I really appreciated how fresh each piece of fish was and how the flavor profiles of each slice. Even in the bowl that we had, most bowls from other places seem to be one tone, but not there!", "author": "Owie P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-29", "description": "Came for dinner on Friday and it was soooo good.  I noticed some changes since the soft opening.  Food was served in beautiful matching Japanese ceramic and the menu has evolved with photos, which speaks a thousand words.  If you love fresh fish, then you are at the right place.  The fish is so fresh, you can taste the difference and well worth the price, for the freshness and the way the food is presented.  The bowls come with miso soup and seaweed, so you can customize your wraps to eat. They have daily specials too.  We ordered the Hokkaido uni, which tasted so sweet and rich.  Nice cozy place, which only seats 20 people, so best to come early, to ensure a seat and to find street parking.", "author": "Elaine Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-10", "description": "This place is awesome! Quality is like being in Japan! I frequent Japan 2-3 x a year and this place is my savior for my cravings. Monday they had $1 oysters, and the salmon truffle bowl is a must!", "author": "Lanai T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-30", "description": "Kaisen Don is an excellent new Donburi shop near Daly City. Portions are just the right size for a meal - not too big, not too small and the fish is very fresh. They're quite small so seating can be limited, but since the neighborhood is not too busy you shouldn't expect too much of a wait if one at all. \n\nI like how they put the menu together with basically one concept: chirashi but a variety of different combinations for you to choose from. It's quick, it's easy, and it's yummy.", "author": "Annie Z."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-04-04", "description": "Came here with the recommendation from a good friend. We showed up around 8pm on a tuesday night and was seated promptly. The restaurant is small, somewhat hidden amongst all the businesses on Ocean Avenue. It's right across the street from 24 hour as a marker. Probably not an ideal location for a big party. \n\nOverall, we would say that the meal was enjoyable. As someone that loves fresh fish and Chirashi style meals, I had really high hopes that Kaisen Don was going to live up to the hype.\n\nBoth the BF and I ordered the Omakase Don which looked beautiful, but for what it was was, I can't say that we were blown away by the quality nor the quantity of the bowl. Like another yelper mentioned, the rice has too much vinegar and the rice to fish ratio was poor. I know quality fresh seafood is pricey, and I expected that, but overall I can't say that the meal was memorable. I've definitely had more enjoyable chirashi dons at other places for better pricing and quality. \n\nUnfortunately, there was a very strong fish odor when you walk into the restaurant. I know, i know, it's a fresh sushi/sashimi restaurant, of course, it will smell like fish. However, the smell was overwhelming and a bit offputting. \n\nI believe the best thing we had that night was the scallop truffle burger. It tasted great..but I can't justify the price in the future. \n\nWould I come back? Probably if i felt like splurging. Would I recommend it to a friend? I'm not sure. Like I said, unfortunately, the meal was not memorable for me. What I do praise is the owner's passion for wanting to bring something he loved from Japan to here. The execution was a good homage to the bowls that we would eat in Japan and it's a great addition to Ocean. \n\nAll in all, it's a local/private business that is worth checking out if you're okay with spending a little more on your meal for seafood.", "author": "Diane T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-20", "description": "Delish and legit dons!\n\nYou are definitely tasting quality with every bite of fresh sashimi, sweet roe, and perfectly cooked sushi rice. \n\nThe pricing is a bit steep, but you do get what you pay for! Omakase Don was $29 which has a variety of everything, including uni. I personally thought it was way too much food. I prefer to get the Hamachi Don ($16.95) which is smaller but oh-so delicious with healthy slices of hamachi and topped with a quarter bowl of sweet roe. \n\nI also tried the Scallop Burger ($9.99) which consisted of two pieces of scallops sandwiching uni and truffle butter. This was decent but wouldn't get again. \n\nThe restaurant is pretty small with only 5 tables or so. I wouldn't bring a huge group as there is only one \"big\" table that can fit up to 6 people.", "author": "Kathleen N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-01-17", "description": "Definitely not the best chirashi I've had, but not the worst either.\n\nMy friend and I wanted to check out Kaisen Don after seeing it on Instragram.  We found seats no problem on a Monday night at 7pm, but the restaurant is tiny, with only room for about 15 people.  I'd anticipate a wait on the weekend just because of the size of the restaurant.  \n\nThey had scallops on special that night, so we went with one omakase don and a scallop don.  I have to say, the scallops were super fresh and sweet.  So good!  The rest of the fish was pretty good too, but I think I was expecting a little more in the omakase after paying $30.  Some other people mentioned this, but what took away from the dishes was the under-seasoned sushi rice and the addition of raw daikon in the don.  Both were bland and I avoided eating the daikon entirely.  It was more like it was put there to take up space in the bowl.  The wasabi was also really low quality, which took away from the taste of the fish.  A lot of what makes a restaurant great is in the details.\n\nService is really great though, the waitress must have refilled our tea cups 10 times!  I'd be willing to come back if they did something about their wasabi and rice.\n\nTips and Tricks\n-The K line will take you to almost right in front of the restaurant, pretty convenient!\n-Almost everything is served as a donburi, not much variety in the menu", "author": "Jessica L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-04", "description": "Came here Thursday evening and there wasn't a line which is great. We ordered Omakase don and Negitoro don and a Hamachi Kama. \n\nI was expecting the Omakase don like the ones I see on pictures with crab but I have the baby octopus instead, and I thought for that price, the baby octopus shouldn't be in that bowl and there should be a bit more quantity to the bowl. However, the quality of the other fishes has wowed me enough, so I give it a 5 star. \n\nFor the Negitoro don, it was the most expensive item on the menu, and we expected pieces of blue fin tuna toro bedded on top of sushi rice, but instead it was minced toro tuna. We thought chopping up the toro would be such a waste of a good fish, but surprisingly, the minced tuna rice and salmon roe and roasted seaweed flakes were a perfect combination, it was so good that we finished that bowl in just a sec. \n\nI also have to make a comment on their Salmon roe. The only time I had Salmon roe that is not fishy was the time when I travel in Japan. But this place rocks that Salmon Roe. IT IS NOT FISHY AT ALL. \n\nLastly, the Hamachi kama was cooked perfectly. The portion is big and the meat are so tender and juicy. We usually will order Hamachi kama whenever we dine at Japanese restaurant, but never had any Hamachi Kama with this quality and size. \n\nWe will definitely come back!", "author": "Cherry S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-12", "description": "There aren't many chirashi places in San Francisco, so I was excited to see this place in my recommendations. TL;DR Despite the positive//negative reviews, try this place for yourself because you won't regret it!\n\nIt's a small restaurant with seating for only ~20 people so the wait may be longer than usual. I went in around 8:30 on a Friday and waited till 8:55 before getting a table for 2.\n\nWe ordered an Omakase Don ($26.95) and a Gyu Don (13.95). The Omakase Don had various types of fish, but it was your basics (tuna, salmon, hamachi, etc.). The Gyu Don is pretty much a beef sukiyaki bowl. The fish is fresh and sukiyaki is well made, not too salty and not too sweet. However, there is a problem with both of these bowls - too much rice! There was so much rice in the Omakase Don that half of the bowl was still full. There was a lot of filler on the Omakase Don - I truly hope they decide to add more fish on it, then the $26.95 would justify it.\n\nOverall, I had a great experience here, the employees are friendly and pretty hardworking. I think that only two people work here and it can get overwhelming for them. If you're the manager, help them out and hire one more person!", "author": "Nicholas H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-10", "description": "Had the sashimi omakase Don (I think). Very tasty and well decorated. Good service and not too busy for lunch on a weekday. \n\nNeed to stop by again. :)", "author": "ben c."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-06-30", "description": "Ok the first 2 times I came I was really happy. Order the Kaisen Don & uni special on Tuesday. Was really happy both times and excited that there was an actually good don place close to my home. \n\nUnfortunately the 3rd time we came back order the kaisen don again and was truly disappointed. They skimped on the rice, didn't include some of the fish I got the first 2x, fish quality wasn't consistent with the 2 previous visits. \n\nI'm gonna give it one more try hopefully they redeem themselves because it was really good and convenient.", "author": "Rio J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-23", "description": "It's exactly what you would expect: a specialized menu with about 15 choices of various dons/chirashi. \n\nI ordered the rainbow don, it had hamachi, salmon, and tuna. It was on a bed of rice and came with shaved radish, some cucumber slices, and wasabi/ginger. It was really straight forward. I really liked the rice actually. (When you walk in, it smells of vinegar rice.) Their fish is fresh and it was a good enough portion to feel satisfied. I broke up some of my fish chunks, eating them in half piece for better portioning with rice and nori. \n\nI would say that their service is good. Wendy was our server and she was very friendly. I'm just confused on whether this is a place where you go up to the counter to pay... After our bowls were taken, the check never came. Our server came later with an ipad to ring us up, but to me, it's just an awkward paying experience because what if I wanted to spilt the bill differently or something. I'm not sure, next time I'll just be more direct. \n\nI'll definitely be back. I liked it a lot.", "author": "Tina Y."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-02-10", "description": "The fish was fresh. The price and the RICE was not! \n\nUgh, the rice was seriously disappointing. Enough that I wouldn't return and enough that I won't be recommending Kaisen Don. Rice is extremely important in Japanese cuisine, especially for rice bowls. The rice here isn't cooked or seasoned the right way. I understand there's more than one way to season rice, but Kaisen Don's rice isn't authentic. Their method for cooking rice and for seasoning rice aren't on par with other Japanese restaurants that fall into the same price point. \n\nI've been to Japan and other Japanese restaurants located in the nation, and I don't touch rice unless it's good. Hence, it's very disappointing that the only options they have here are rice bowls with disappointing rice.", "author": "Debbie T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-12-12", "description": "First place I wanted to try coming back home was Kaisen Don. Thank you Yelp. \n\n20% off Chirashi bowls? YES.\nThis means that the most bang for your buck is to order the most expensive one. And that's what I did. I got the Omakase Don $28.95 which included Tako, Hamachi, Salmon, Ikura, Tuna, Ebi, AND Uni. The Uni wasn't specified in the menu or picture, but I got it anyways. Merry Christmas to me! \n\nThe restaurant is small and limited to small parties. The menu is simple as it comes with different kinds of dons (donburis). Although not stated in the menu, it comes with a bowl of mushroom miso soup which was a delightful start to the meal. \n\nThe bowl takes quite a while to make as I'm sure they prepare it fresh. \n \nMy thoughts, if you've been to Grubbies, I find this place awfully resembling of it. The cute fish logo reminds me of their fish soy packets and the bowls were kinda similar in style. \n\nThe fish tasted fresh, but immediately entering place  you can smell the fishiness. The pieces of fish are of good size but some pieces were oddly sliced. The fish was good, but something was missing as the texture was non-existent. Salmon was bland, toro was lean, and ebi was skimpy looking. Uni was fine ... but lacked sweetness. Lastly, the rice was too unportional sticky. Fortunately the good thing was the tamago, ikura, and tako. \n\n+Tamago was sweet and firm\n+Ikura was like tiny dragon balls that popped nicely in your mouth\n+Tako was tender\n++Seaweed pieces were great as it provided extra flavor and texture\n\nI've had better for cheaper. The fact it is located near SF State, I'm sure it'll attract the millenials, me being one of them. 20% discount is a good deal and that's probably the only reason I'll be coming back along with Super Cue right there.\n\n****For another review of this place: My brother Derek L.", "author": "Fiona L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-11", "description": "Every time I've eaten here the staff has been super nice and the fish is incredible. So fresh! So glad we got another great restaurant in the neighborhood.", "author": "Justin W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-29", "description": "I think I found this place through yelp's new businesses and then followed up with looking through pictures of their amazing donburis. Four stars for their creativity and simplicity in opening a place that only serves donburis. Don't expect anything more but don't expect anything less either.\n\nA \"don\" is short for Donburi which is basically meat and rice in Japanese food language. They offer around 15 different dons - ranging from the Omakase don to cooked items like Teriyaki Chicken don. \n\nFor three girls, we ordered:\nOmakase don - features a range of different sashimi at two to three pieces each: uni, hamachi, tamago, salmon, toro, tuna. \nRainbow don: another mix of sashimi, very similar to the omakase don\nScallop Lover don: scallop sashimi with Ikura \nUnagi don: unagi with sauce over rice\n\nWe came in on a Saturday night, 630pm for three, about a 20 min wait. Their fish overall is fresh, better end of Japanese restaurants. They give you enough fish a lot of rice and ikura. We ended up taking the seaweed pieces they gave us to make Ikura nigiris. \n\nThey are still in their soft opening phase. Very apparent with their furnishing and this place is small. Imagine a newly painted apartment living room with open kitchen split in half for you to only dine in the living room portion. Would not recommend a party of more than four. Not cozy at all, pretty bare but comfortable enough for dinner. \n\nOverall, I would return because I do want to try their Uni special which is only available Tues-Thurs. Otherwise, it would be a go to place for take out donburis! I would not wait more than thirty mins for this place. Just get the take out instead if you have a rainy day.", "author": "Miffy Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-19", "description": "I've had good experiences with Chirashi bowls, and I was excited to try this place since it's close by and there aren't many places like it in the neighborhood. \n\nThe place was cute! I liked the hip wooden decor and minimalistic branding. It is small, but we got there before noon, so there was still lots of seating. \n\nWe got the Kaisen Don #1 and the Rainbow Don. We waited a bit for our food to come out, but it wasn't too bad. And, we had some miso soup to sip on while we waited. I was pleasantly surprised when we got our food. The bowls were so beautiful, especially the Kaisen Don!  Each piece of fish seemed meticulously place. I loved the little wasabi stamped with the store logo. \n\nThey give you really crisp seaweed on the side to go with your bowl. I liked how the wasabi on the milder side, not as nose-tingling as other places,. The fish and shrimp was very fresh, not fishy at all. And it was a fair amount of fish for what we paid for. The flavor of the sushi rice was good, not overpowering, and the texture was nice and sticky. The amount of rice was typical for a Chirashi bowl. I wasn't a huge fan of the tamago as it was too sweet for me. I typically like it saltier, but it was nice and firm. It was a good amount of food for me, so I was pretty full by the end of the meal. \n\nThe owner was very nice and came by to refill our cups whenever we ran out of tea. \n\nOverall, it was a great experience, and I would definitely come back again. They mentioned they would be adding more stuff to the menu in January! I'm excited to try the new stuff!", "author": "Christine L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-01-15", "description": "Ordered 4 chirashi bowls for take out last night and they looked nothing like the pictures or what are served at the restaurant. \nThere was so much rice and so little fish. It also look like we were given end parts of the fish that they would not served to dine in customers. One of the bowl which had a strong bad tuna smell to it had to be discarded. We asked to add ikura in one of the bowl and they added a tea spoon of ikura to the bowl after charging us an extra $5 for it. The waiter forgot half of of our order also and we had to ask them for the seaweed that were supposed to come with the order. \nVery disappointing for the takeout and do not recommend it. Also the staff are very disorganized and forgetful. \nThe price of their bowl even with their current 20% off is too high considering the quality and quantity of fish you get.", "author": "Sty S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-07", "description": "I typically don't eat a ton of seafood like this, but I really enjoyed this place.  I ordered the Omokase Don which allowed me to try a little bit of everything (tuna, salmon, tobiko, sweet egg, shrimp, and hamachi).  The fish tasted extremely fresh with a hint of sweetness in the flavor. Not sure if this is a thing based on my lack of familiarity with seafood.  The dining room was also quaint and the staff was very nice and attentive.  I would definite come here again with some of my fish loving friends.", "author": "Mitch T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-08", "description": "I almost don't want to review them because I don't want it to be hella packed next time I come...but it's amazing! Presentation is on point. Everything is clearly prepared with precision and care. And the flavors are equally amazing. \n\nTried the uni taco, unagi don, and truffle salmon don. All delicious. Chirashi bowls served with nori strips.\n\nI'll be back.", "author": "Gina R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-08", "description": "Not bad!\n\nCame here with a party of 4 a little after they had opened for the evening and we were seated right away. I ordered the scallop don, while he ordered the unagi don. There were a few bowls that they were out of, so be prepared with 2nd and 3rd choices when you order.\n\nAll of our orders came with miso soup to start. My scallops tasted fresh and there was enough protein to satisfy me. The cooked donburi bowls take a bit longer to prepare (obviously), and they don't bring everything out at the same time. Service was good. Overall, would come back.", "author": "Leslie C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-09", "description": "A fun casual chirashi spot! They give a very nice portion in the Rainbow Bowl and the Kaisen don. All the sashimi is very fresh. This place is surprisingly not crowded considering how small it is, but maybe its the location. Overall, fair price for quality sashimi bowl.", "author": "Nikita K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-28", "description": "Raw fish on top of rice is the best! Kaisen is about a 10 minute drive from my house although it is in an area where it's difficult to find street parking. I recommend that one either take the muni or uber. \nSince they are brand new, they had a 20% off grand opening special which I took advantage of. I got their rainbow bowl. I haven't gotten their uni bowl but I definitely will in the future, hopefully.\nThe bowl was good, with thick cuts of raw fish. There was lots of rice underneath after I finished the rice. \nThe restaurant itself is tiny. It's much better for take out. Pricey but then again, it's SF and raw fish.", "author": "Michelle R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-08", "description": "Yelp said I might like this place. On Yelp's suggestion, I was feeling a bit whimsical and had a huge craving for sushi so I decided spur of the moment to check this place out. It's kind of far if you live centrally in San Francisco, but it's right off the public transportation line so it's not a terrible trek.\n\nFor their soft opening, 20% off was an awesome deal. We got the omakase don and rainbow don. It comes with miso soup and tea gratuit. The service was friendly and it wasn't difficult to get a seat at 6pm (nor was it hard for anyone who walked in after us to up until 7pm). One thing I loved was the amount of fish that you get on top of the chirashi bowl - Kaisen Don is by far one of the more generous places. As for improvements: the rice (as others have mentioned) and quality of wasabi are in need of help. I'm kind of picky about my rice, but I think it could have used more seasoning or \"sushi rice flavor\". The menu pictures also don't exactly match what you get... For example in the omakase don, no uni is pictured, but you do get uni in your bowl. A simple difference like that could entirely change my decision if I want a bowl or not! Granted that they've only been open a month and are still working a few things out, I think they have the potential to build out a strong following of Yelpers and diners soon. :)", "author": "Joanne Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-17", "description": "This was such an unexpected find! So glad that my sisters and I decided to try this place. This restaurant specializes in Kaisen don's (hence the name of the restaurant). Kaisen dons are basically rice bowls with different types of sashimi on top. I got the rainbow don, but I switched out the tuna for more salmon sashimi. The quality of the fish was top notch! I could tell the fish was super clean and fresh. There wasn't any fishy smell or taste at all. Would definitely recommend trying out this hidden gem!", "author": "Eunice C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-23", "description": "A very small restaurant but has a marvelous japanese sushi and Donburi meals to offer. We went here on Mondays because we always go for the oysters happy hour which means $1 per oyster.  We definitely fall in love with Kaisen Don and it is very close to our place. Can't wait again for this coming Monday!", "author": "Salie E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-10", "description": "It's pretty fresh good uni, I will come back again just for the \"half tray UNI\"  No place like this that you can have a whole tray of uni!", "author": "Heidy S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-23", "description": "Saw this place listed as a new business and that's just a huge flag for me to go try it out. I LOVE chirashi bowls and to see that they combined an omakase experience into one bowl, I just really wanted to try the concept. \n\nIt is currently still soft opening and a Monday night, so the restaurant was empty except for the lady and I. I like the small feel as it does help me feel like the food isn't mass produced to meet the demand, but carefully crafted to impress a small audience at a time. \n\nI ordered an Omakase Bowl and was impressed by the presentation. See picture for what I really mean as words are kind of hard to explain! The one gripe I have about and -1 Star for is its kind of hard to eat. The wasabi is right smack in the middle, the ginger is bundled to the side, radish(?) shreds are supporting the fish, but the rice is almost impossible to get to. We also ordered the spoons, which were alright, and I have mixed feelings about them being $7/spoon. One thing for sure is the quality of the seafood and the time and effort put into each dish.", "author": "Tyler D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-06-25", "description": "Quality is good but I feel that the portion is small.\n\nThe pictures are decieving when it comes to portion, I honestly feel that they cheap out on rice,  but the quality of the fish is actually good. I honestly think this place is overhyped and overpriced  but if I'm craving for a kaisen (seafood) don, I will be getting it from here since it's around my neighborhood.", "author": "Toni Rose M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-04", "description": "the best ikura I have in US！Sweet and umami！very nice service！five stars for this place. I will come back again even Im in east coast！flight straight for Kaisen Don！", "author": "Yuri Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-15", "description": "Really fresh!  You pay a little more than usual, but it's worth it! \n\nThe unagi don, best one I have had in the city.", "author": "Deb L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-27", "description": "Very fresh seafood at a cute, modern place on Ocean Ave. Delicious Scallop Don! (2$ off for being the daily special, Check the board outside.) Complimentary tea and miso soup (not too salty, with a nice and light\n flavor) Friendly Staff. They also do to-go orders", "author": "Laurie C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-24", "description": "My partner and I stopped by here when we were craving something less saucy then the million poke places. The fish here is amazing, and incredibly fresh- especially the salmon, and it looks like the bowls are seasonal. The fish slices are hefty, you definitely get your money's worth. Tea and miso soup and served, and our waiter was highly attentive. They also gave you nori pieces!! \n\nThere aren't any don places here, (Japanese dish over rice) so it's exciting to have one with such fresh fish nearby. Definitely recommend stopping by, definitely coming back. \n\nThe one thing I also really appreciated was the authenticity of the place. We just came back from japan, but we felt like they definitely got it right. It would be nice if in the future they could offer half portions. I was so stuffed I felt like I couldn't move. Worth it, but half portion would have been great too. Good luck!", "author": "Kimly D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-23", "description": "I love their Hamachi Kama. The reason I took away one star is because there are some bugs or flies circling around our table all the time we ate there, which isn't too pleasant.", "author": "Jane A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-04-13", "description": "I had high hope for this place for from what I saw and read, it seemed to be an authentic place for some good Chirashi. The portion is tiny compared to the price. I ordered an appetizer called scallop burger, that is $15 for 2... which when they delivered it was literally 2 pieces of scallops... and the chef's choice was $30 dollars... pricey for the food... fish was fresh and nicely cut, but the portion is tiny.\nWith$45 per person you can get some decent nigiri.", "author": "Shirley Z."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-06-13", "description": "Small portion, expensive $, average taste. I decided to try because it is a new business and close to home. They should offer a soup and salad with the don to make it a meal. I understand the operating cost in SF is high but for the price of almost $20/person for just a don with rice and a small portion of fish, I rather go to those poke places.", "author": "Sharon H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-01", "description": "Good service, and grand opening 20%off\nI like their salmon don and scallops don\nTheir sashimi are fresh \nEverything was perfect!!", "author": "Khloe M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-08-25", "description": "I really wanted to write a great review from this place bc a friend of mine and my brother heard great things about this place but even before I started eatting, I already had a sour taste in my mouth. \n\nI get sushi, sashimi and chirashi bowls all the time. What makes a Japanese place more unique or better than the others? Not that much. Its just gotta have yummy fresh fish and great service.\n\nSo I came to celebrate my father with an outting with my family. I got there early and asked about the Nigiri Omasake that was not on the menu bc i saw it on Instagram as a new dish and knew my dad would l-o-v-e it. So I asked and they told me they only serve it at lunch bc at dinner they are busy and understaffed. No problem. Fair. It was dinner time and there was like only 5 people in the whole restaurant. Fair, maybe it does get busy. 10min later, he serves the table next to me that \"Nigiri Omasake\" that I had asked about that is \"only served at lunch\". Funny I thought, so I looked at him and gestured and had a confused look on my face and he said \"Oh they are for Instagram\". Wow. I have a foodie account on Instagram too and was planning to post about it but I came here to have dinner with my family too. But because I am not for Instagram, I can't order it? It would be totally fine if it was a standard rule but just minutes after I was told it was not serve-able, its served right by me? When I had seen it on Instagram so I came here?\n\nReally horrible experience. Food was just fine. Service aside from the above wasn't memorable. But I really didn't appreciate the customer experience as a whole. When we were eatting, nobody else walked in and it was just as empty as when I had asked about the \"Nigiri Omasake\". I would have appreciated it if he had offered to serve it after I clearly was not happy. Didn't attempt to try and make up my displeasure. \n\nIf all that didn't didn't happen, I would have given 3 stars bc this place isn't that special and I have other Japanese places to go to that have better service and food in general. \n\nGotta work on your customer service.", "author": "Jessica L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-16", "description": "My friends and I all ordered the same bowl, Rainbow Don. \n\nPrice: $$\nYou will end up paying about the same, if not more, for a 9 piece sashimi assortment. (and it usually does not come with rice and miso soup) For some people, one bowl might not be filling enough.\n\nFish: Good Quality\nWe expected red tuna to come with our order. We were shocked when we got chu toro instead. I'm not sure if we just lucky. The other photos I see on Yelp are red tuna. They gave us SO MUCH RICE. The rice to fish proportion didn't seem right.  \n\nVenue: Small\nThe restaurant itself is small so please go earlier and avoid dinner rush hours.\n\nService: Good\nThe server was very attentive. She actually recommended that we all order something different so we can have variety. \n\nI highly recommend that you give this place a try. The quality and service are both good. The only downside is that you might walk out hungry with just one bowl.", "author": "Autumn L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-05-13", "description": "Wow I'm so full and my wallet has so much money in it after this meal.\n\nJust, like, no...no. Service is passive. Food is a joke. Just don't come here?", "author": "Christopher X."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-06", "description": "So good\nThe restaurant is clean and food is fresh.\nThey have the logo on the wasabi   very cute.", "author": "Peggy L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-09-15", "description": "Fresh seafood but i think a bit overpriced. Very small portions. Japanese rice could be better.", "author": "Jasmine And Wibby F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-29", "description": "This is one of the hidden new gems on Ocean Ave. Fresh, high quality sashimi for relatively affordable price is a rarity and this place is that.\n\nIt's a small place with a small staff so service and wait times reflect that nature. It also smells strongly like the ocean (brininess). \n\nFor those trying this place for the first time, I suggest going hard and trying their omakase don. If you're not a fan of raw fish, their unagi don is made to order and delicious (it can be too much of the same texture/taste for some due to the quantity you're getting). The salmon ochazuke is also a good Asian comfort dish, it's very remeniscent of porridge; something I would order if I was sick. \n\nAll in all, I think this place is worth trying and has become one of my go to places for good sashimi that isn't a Michelin star restaurant. Plus, you can order a goddamn tray of uni here, please.", "author": "Eric L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-04", "description": "Nice addition to the neighborhood, considering there are only a couple other Japanese spots (Yama & Sakesan). Quaint inside, lowkey has a fishy smell. Pretty good quality but prices are on the higher side. Would return for a chirashi fix, they are open for lunch Monday thru Saturday!", "author": "Siri E."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-29", "description": "Needless to say. This place is so \"overpriced\" for what it's worth. I went in with the expectation that it's going to be overpriced, but figured that I'd give it a try due to the positive reviews.\n\nAfter eating there and $32 later, I realized that it was a complete waste of money. True that they use very good and fresh ingredients. But I could get similar if not the same quality but cheaper at many of the city's decent Japanese restaurants. \n\nIn addition, some reviews say that they serve generous portions here. That is totally not true. My sashimi was very small. \n\nI will not recommend this place to anyone or come back myself. Also, don't know how a place like this can survive in today's competitive market.", "author": "Jennifer D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-01", "description": "Came here couple times, twice on Monday to try the oysters, they have $1 oyster on Monday and love the special menu, hamachi taco and crab legs, very fresh fish, will come back more often", "author": "Mable L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-30", "description": "Kaisen Don is a great addition to Ocean Ave. The Don menu is divided logically between sashimi and non-sashimi selections. They have high-end delicacies and staple items on the menu. The uni and scallop specials are incredible and make their way into the don dishes. \n\nStreet parking is not difficult. Small venue, great for lunch and dinner. \n\nAviento 5 estrellas. Buen provecho!", "author": "R S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-02-24", "description": "A-ok. Got the Kaisen Don and the daily special of the uni and hotate don. The scallop and ikura was decently fresh. The rice was a disappointment, mushy and bland. Added ebi, so not worth it, $5 for a tiny piece of shrimp. Total after tax for 2 don plus the ebi was $43. Each don came with a bowl of watery miso soup. Went on a Saturday and it was not buzzing, plenty of parking too. Come to get your don fix, but don't expect too much.", "author": "Erica B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-05-23", "description": "The first two days to eat oysters and strip hamburger, no woman boss, the first and second visits to the boss are very fresh, this time did not see, the belt and oysters feel not fresh, my friend eat fat cattle back three times in the stomach, hope to do more effort and care in food.", "author": "珊珊"}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-03-10", "description": "Skip this place. The restaurant isn't ventilated so it smells fishy when you walk in. The bowls are really small, sashimi are ok but I wouldn't call it fresh. What bothered me was that the wasabi and ginger were in the bowl, and that the rice isn't sushi rice but it's not plain rice either. Also, the server was trying to organize the chopsticks and napkins and dropped them on the floor, and then placed them on the table. Um... am I wiping my mouth with a napkin that fell on the floor??? \n\nAnyways, maybe it's better if they do a pick up only, I was pretty disappointed in the experience.", "author": "S Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-01-03", "description": "First impression reminds me of Tokyo. A small, authentic, clean restaurant with a very polite host greeting you with a smile. I saw the reviews on Yelp and I thought, I knew, I really hoped it would be the best sushi I had in a long time. \n\nI ordered the Uni, Ikura Don. I was pleased by the freshness and presentation but disappointed with the quantity. Paying $29 for 4 Uni which 3 pieces were very small did not compare to the pictures on the menu or the Yelp reviews. The Ikura was plentiful and lots of rice but for a premium price I expectedly least 6 pieces of Uni and large pieces like the photos. \n\nThe Miso soup was barely warm. Very disappointed in the soup. The hot tea was good. \n\nI want to return to try other dishes but there are so many places I feel are better deals and better prices I likely won't return. \n\nOnly a 3 star rating because of price and quantity did not meet my expectations. \n\nService was good and the place is clean. But the 6 table restaurant only seats 16 people. \n\nI've seen hole in the wall restaurants grow into huge successes by exceeding all areas of importance. Quality, price, and quantity. Service is 4th on my list but everyone is different. Not talking about bad service just service is last to quality of food, price for value, and quantity so you feel good about a deal. \n\nI don't feel like I got a good deal this time.", "author": "G S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-02", "description": "It's nice to have a chirashi bowl restaurant open on Ocean Ave - a welcome addition to the loads of Chinese restaurants along the street.  Both restaurant size and menu are small, but the quality and value of the meal are worth it.  I thought for the price (they were running a 20% off promotion at the time we visited), the amount of fish in each bowl was pretty generous.  The cheesecake we had for dessert was quite tasty too.", "author": "David C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-13", "description": "Hotaruika! That firefly squid!!!! I just can't believe almost all dons are under $30! And in good quality! What made me happy the most was that yuzukoshou (citrus pepper mix) garnishment was on top of hamachi. I've never seen hipster kick-ass trick like that in SF! Job well done!!! Woot woot!", "author": "Toshimi N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-12-29", "description": "This is more of a 1.5 star review. Anyone with a 3+ star review has either:\n-never had a decent chirashi bowl\n-has a diet consisting of Old Town chirashi (see above)\n-was high while eating\n\nWhy?\n\nI know its 20% off, but is it also 20% off the portions as well? I ordered the Kaisen Don #1, but at full price, I would not. Its about $19 for the bowl. At that price, I'm expecting an extra slice of salmon or 2 and one more sweet shrimp. Also leave the lemon out, it just doesn't go with the bowl.\n\nAs for the taste, its alright, but not worth $19-alright. The rice was plain, where's the seasoning/rice vinegar? Hello? I mean it's just rice but the rice vinegar makes a big difference especially when paired with raw fish. \n\nAlso, get rid of the lemon, the lemon rubs onto the fish and partially masks the freshness the taste/freshness of the fish. Unless you're using shitty fish, get rid of the shitty lemon. Once you use rice vinegar, the lemon will be too overbearing anyways. Or put it to the side if you insist putting lemon in the bowl.\n\nAnother, the thickness of the cut of the fish. The salmon were basically in blocks in my don (there's much photographic proof that this is so on this yelp page). Just look at the photos, they're goddamn 2-match-box-combined sized chunks.\nThe reason why a lot of chirashi places have thinner slices is so people can easily wrap their fish around their rice and dip it in sauce. But instead, you have a block of salmon which you eat separately from the rice. \n\nThe radish. \nThe goddamn pile of #radish.\nSure it makes it instagrammable or whatever, but nobody eats that much radish with chirashi. If you insist on leaving that much radish then at least place it over a leaf/seaweed/lettuce so people can pull out all the radish in one fell swoop instead of picking at it to remove it.\n\nJust from these small but important details you can tell these guys were just like \"Oh hey let's just open a Chirashi place because it's easy to make the food and it's popular\" without much regard on how Chirashi is supposed to be made.\n\nOne more thing to pick at: \"bringing Tsukiji's food CULTURE\". So is the fish from Tsukiji or are you guys only talking about the food culture in which they have fresh fish everyday? Because this place is literally just fish over rice and not how chirashi actually is.\n\nI think this place can be a lot better. I think SF needs more chirashi places like this one BUT BETTER. I hope my review has given you some insight what to expect (as a potential customer) and what can be improved (as the owner). I'm hoping when I give this place a 2nd chance in a month or so, it'll become a place I can bring my friends without feeling embarrassed.", "author": "Chris C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-14", "description": "I'm definitely a fan. I came here to check out the place since it seemed really promising (and also 20% off during their soft opening is such a good deal). \n\nI was warned in prior yelp reviews about the fish to rice portion, but I didn't think too much of it. When does anyone not complain about how much rice you get? It did seem like a lot of rice, but I didn't think it was excessive. \n\nSince it was a weeknight, they had their uni trays and we got the 1/2 tray. It was delicious and creamy. I was pretty happy with the portion as well. At first, it looked like five pieces on five cucumbers with a sprinkle of ikura, but it was about three pieces on top of each other. I also got the omakase don and it was well worth it. It had salmon, tako, tamago, ikura, uni, scallops, hamachi. Everything was really fresh tasting and I was pretty content with the dish. I was pretty stuffed at the end of it. \n\nTheir menu prices changed to be a bit lower. We received three menus with the pricing and then one menu with the changed pricing. I'm sure they are still adjusting in the early stages. The omakase was $28.95 originally but was lowered to $24.95. I thought the prices were pretty reasonable for what you get. \n\nI'd come back whenever I need a chirashi fix.", "author": "Jeannie L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-27", "description": "I am leaning towards more of a 3-3.5 stars.\nWe have ordered twice from them now, and I get the same thing, but it's been inconsistent with what they place on top. So maybe they are figuring out what works best?\n\nThe sushi rice the first time was decent but the second time, it was bland, tasted like normal rice not sushi rice.\n\nthe only solid constant was the sashimi, always tastes fresh and nicely cut, so that is great.\nThey also give a good amount of ikura, (happy husband)\n\nmy rainbow don- first time I had tamago, and maybe one slice less of each sashimi? second time, I was like \"oh yay they added more!..but wait! where is my tamago?\"\nso I'm not sure which is the correct version, I think it's the second one, since the recent pictures look like what I got.\nBoth versions were fine, but when you are expecting something and don't get it, it can be disappointing. \nwe also were given seaweed packets the second time, which was very nice!\n\nmy only other irk was that we ordered over the phone, but it still took a while to get our meal....and they didn't seem that busy? Ah well, like my husband said, they could have had LOTS of to-go orders...\n\nwe'll still definitely come by again for their fresh chirashi bowls...a little too much rice in my opinion though...\nworth it with their 20%", "author": "Christine M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-23", "description": "W O W the quality of the fish here is superb. If you're a hamachi lover like me, I would totally recommend the rainbow don! The hamachi melted in my mouth and was super fresh. The salmon didn't really have that glistening effect that I usually see on fatty salmon but the quality of it was pretty ok. I think the lemon helped make it more tasteful. Ehh I would probably skip the seaweed they give on a little tray. It was pretty stale and hard to bite into. I tried to bite a small piece of it, but it got stuck on my teeth LOL. The rice was pretty good too! Idk if they only put rice vinegar to it but it was pretty tasty with the fish. My friend's order didn't have enough fish for hers :/ I think she only had like 6 pieces compared to mine? I forgot her order! Either way, I think people should check this place out before the 20% off soft opening coupon expires because this place is pretty expensive! I do like how they have a sashimi bowl place here that I wouldn't need to go to downtown and try the Grubbies. Other than that, I don't think I would come back unless I really REALLY want to treat myself out!", "author": "Sarah F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-02", "description": "Really fresh and good quality fish!!  We have a party of six and everyone loves his/her order!", "author": "Felicis W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-11", "description": "This review is based on my visit of their soft opening on Saturday, November 11 and a follow-up visit. \n\nThe seafood has been noticeably fresh during my visits here and service has been excellent. Larry and John are super friendly and accommodating. \n\nI'm hoping they can maintain their quality and somewhat reasonable prices. Looking forward to my next visit!", "author": "Michael K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-30", "description": "I think this place could be truly special with some minor tweaks. \n\n1. More seaweed papers to eat the bowls with. Making your own sushi is kind of the big appeal here, otherwise it's just a pretty Chicago bowl. \n\n2. Less vinegar in the rice. I went here during the soft open and the rice had wayyyy too much vinegar. It simply over powered the fish and roe, nearly ruining the whole dish. \n\nOther than that, the food was delicious and fun to grub.", "author": "Nathan N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-12", "description": "Their bowls are fresh, and their server is super sweet. \nIt's quiet and simple inside. \nNo BS, just good fresh fish.", "author": "Faye-Denise L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-14", "description": "Hahahaha ... this little cozy place is a definite must try. Great selection of fish and great flavors of rice bowls. Specials are prevalent everyday and have amazing balance between flavors. I will come again and try more bowls in the future.", "author": "Patrick L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-02-06", "description": "I was expecting a lot so I was kinda disappointed. After reading some reviews I thought I found the best. The price was pretty high considering the area. Ive eaten in Japan town and was satisfied for less. The fish were pretty fresh, good presentation but kind of bland tasting. The server was very polite and the wait time for the food was very good. I might be back after they have been open much longer.", "author": "Jolens V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-25", "description": "Really fresh fish, delicious and simple chirashi and rice bowls during their soft opening. It's not high brow, but sashimi you can eat on a daily basis. Though, maybe weekly cause you don't want to be like that guy that pulled a 5 ft tape worm out of his stomach cause if his daily sashimi habit... \n\nWe had the uni scallop bowl and the chef's omakase bowl. Both so good. Simple, fresh, and underrated. Cute lunch spot. I'll be coming back again soon! They're planning to add a bunch of side dishes, too. Excited to try them all!!", "author": "Steph M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-01", "description": "This place is really, really good.  The fish is incredibly fresh and the rice perfectly prepared.  Comparable to some of the chirashi bowls I have had in Japan.  Price is extremely reasonable (especially for the quality), and the service is really kind.  For the amazing omakase bowl, we paid the same price as we would for mediocre sushi rolls from a commodity sushi restaurant.", "author": "Daniel W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-01-26", "description": "This place has quality fish, love the ikura but very skimpy on the fish for the price even with the 20% discount. Usually the bowl would be covered with no rice showing but this place doesn't even cover the small bowl with fish so value not so that great. Lunch is not a affordable meal more of a splurge lunch. With all the students around they have to have more affordable dons.", "author": "Whitney N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-24", "description": "This place is absolutely delicious. I can't wait to come back and try the chef choice. The price is very reasonable for the quality you get. Don't expect to get full if you can eat a lot. I was very satisfied...", "author": "Aylee G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-25", "description": "15$ for a scallop ikura don,are you kidding?\nYou can easily spend that much at any cheap Asian around and get some mediocre food.\nThis is delicious!!!!", "author": "Ganesh B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-20", "description": "The staff was super nice, the decor is adorable and perfect for date night! The Christmas tree had tiny little don pictures on it! We ordered our food Togo I got the #1 and it was delicious! The eggs were sweet and the salmon and shrimp was so fresh! Will definitely be coming back!!", "author": "Jenni A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-08", "description": "Pluses are:\n* Super fresh fish - plus the ikura was glistening and popped in your mouth! Also, slices are good sized (1/4\" thick). \n* Wide selection of bowls - if you aren't into fresh fish, you should go somewhere else, this is Kaisen Don meaning \"sashimi fish on rice\"! If they were a true Kaisen Don as their name suggests, then this would be true. However they do offer beef, salmon or beef curry on rice among other things.\n* Friendly owner\n* Continued 20% off discount after soft opening\n\nCons:\n* Weird/small table layout - I realize they are still working things out, but after 1 month they need to get this squared. Waiting families had no where to sit, but stand against the wall?!? When we were there, the layout was a definite fire hazard and non-handicapped compliant.\n* Unusually long wait time - we had to wait about 25 minutes after ordering to get our bowls. Fish put on rice. That is essentially what the bowls are. Felt awkward when people waiting for a table are almost right in your face.\n* Cost - borderline high. The 20% discount helped, but I think that people should take photos with some reference in it like a phone or something. *I shouldn't talk as I didn't do it either.* In the photos the bowls \"seem\" big and packed with goodies. Again, the fish is super fresh. But we actually left a little hungry.\n\nLastly, I hope that this restaurant tries to understand the minute differences that true Japanese restaurants reflect. A huge plus they already have is the quality of fish. However, omakase means to \"let the chef decide\". It does not mean \"put a little of each thing on the menu\". \"Omakase\" is meant for the best of the best that day, so what it includes will also change day to day. As a Japanese customer, it saddened me.", "author": "Mark M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-06", "description": "The ingredients here are amazing. For the price tag, they have the best Hokkaido uni, Hokkaido scallop, and Ikura.", "author": "Edward H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-12", "description": "This is definitely our favorite chirashi don (Japanese seafood bowl) place! It's so conveniently located in our neighborhood and the interior is very sleek and clean. We tried their Scallop, Ikura and Uni Don, Salmon Green Tea Don and Hamachi, Uni Don! Ingredients are so fresh and yummy that will definitely bring us back! Highly recommend this place to all sushi lovers!", "author": "Big Day Service S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-16", "description": "The first thing I want to get out of the way is that if you were expecting a replica of Tsukiji Market or a more authentic Japanese chirashi don you're going to be missing one big thing: the rice. \n\nNormally I wouldn't point out something that seems to inconsequential but since it's a location that leans marketing heavily on being inspired by Tsukiji, I was expecting it to feature the more heavily vinegared rice from Japan.  \n\nWithout it, even though the ingredients were buttery and soft, you get the distinct impression that it feels there's too much rice. Let me be clear though: I don't actually think there is too much rice! Especially if you get a bowl with ikura, there's enough to go around. But WITHOUT a more flavored rice this is the impression you get, you can see this in other reviews as well.\n\nSome places mitigate this with sauces, like a poke bowl or similarly inspired chirashi dons. I get the impression they included the seaweed paper / nori to mitigate it here without adding sauces. Kaisen does try to be authentic in the bowl, you get just the fish / sea food, but without the strongly vinegar laden rice you get in Japan to compliment it, it's going to fall short of expectations. Those who've been to Japan will know it's the rice being bland, those who've never been to Japan misattribute the problem to being too much rice when there's the right amount, it's just unflavored.\n\nBut at the end of the day, it's not bad and it's in my neighborhood and I always appreciate more options. The 20% off during soft opening till the 17th makes it a good deal, plus the customer service is very friendly and attentive. The decor is trendy and clean. This review is probably a 3.5 star, but I want small businesses to succeed so I round up instead of down.\n\nThey were told me I could request more vinegar next time i order so I'll try that and keep praying that some place is bold enough to offer the good rice.", "author": "Susan L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-03-27", "description": "Came here on a Friday night with three others, and since they didn't do reservations, we were expecting a wait. Upon arrival, we almost missed the entire restaurant because it is a very small shop in the middle of the block fitting 20 people maximum. Small spot, but surprisingly no wait. We got there and were seated within 5 minutes. There was only 1 server working the whole floor, but she was friendly. They're known for their chirashi bowl so we ordered three: two Rainbow Don and one Salmon Scallop Don. The bowls were a good size and served with a side of seaweed for you to DIY. The rice was not bad, and the perfect amount to place with each piece of fish on seaweed. Fish and seaweed was pretty decent too. We also decided to try their specials of the day: Scallop Burger and Kaisen Spoon. The spoon was good, however I couldn't taste the uni on the spoon, mostly oyster - but still tasted okay. The miso soup that came with the chirashi bowls were like any miso soup served in town and probably not homemade. The scallop burger was extremely tiny and was one piece of scallop cut in half to fit the uni and truffles. The truffle flavor overpowered the scallop and uni so I didn't realize the scallop was so sweet until I had it in my chirashi bowl. Not the best I've had, but decent.", "author": "Amanda C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-09", "description": "New place utilizing a small space very efficiently. Staff is nice and courteous, a good first impression. Simple dinner to enjoy, would definitely come again!  The ingredients all tasted fresh and the rice was cooked well. Yes, rice was cooked well, cooking rice is art. I like it a certain way, not too soft and not too hard. Maybe some alcohol in the future? LoL hopefully the city will allow them :) haha I'll enjoy sprite in the meantime here, or some tea.", "author": "Jeffrey W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-09-01", "description": "This is place is overrated. I ordered two bowl and it was already $70. Rice has too much vinegar in it. Fish was not that fresh. Picture looks really good though. However the taste is not the best. I would've eaten in a nice restaurant if I were going to pay that price.", "author": "Donna D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-12-28", "description": "Picked up some dinner here a couple weeks ago. Small place with a couple of tables, probably seats around 15 people. The inside is nice and clean albeit a little plain. I ordered takeout for my girlfriend and I though since it was a cold night and I wanted to get home quickly to watch the Warriors game. The guy who took our takeout order was nice and gave us ample time to pick what we wanted.\n\nI don't 100% remember what she ordered but I believe it was the Kaisen Don #1 and I ordered the Rainbow Don. The fish was very fresh but unfortunately, the portions don't match the price. My girlfriend gets full pretty easily but she ended up still being slightly hungry. Personally, I think I might have needed two to fill me up. It's about 3 pieces of each fish in the don. I know in order for them to have premium fish quality, they have to charge higher than other places but the prices are still too high. For this specific order, I still ended up spending around $30, even with the 20% discount they offered. I don't think I could fathom the thought of coming here without that discount. It honestly had me craving some Poki Time at Westlake just because the fish portion at Kaisen Don just wasn't enough.\n\nI'm hoping that Kaisen Don can turn it around though. They have a great product but the prices are just too steep. I wish them the best!", "author": "R C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-27", "description": "I ordered the Rainbow Don and asked if I can replace one of the item with something else since I'm not a fan of tuna. They were very flexible with my request, so I got more salmon and hamachi. The fish were absolutely fresh and thick--just how I like it! The rice was perfectly cook. Their miso soup was good as well, not salty like most places. We also ordered the Uni Special, it was so fresh literally melted in my mouth. Will definitely come back for more.", "author": "Mimi Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-30", "description": "Everything was fresh and very tasty.  Great presentation of the sashimi.  The kids loved their Unagi Don and Chashu Don.  Nice service and casual atmosphere.  Parking in the area is also easy which is a plus.  Will come again.", "author": "Michael C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-30", "description": "Went there for lunch and we were seated  right away. Its a new place so its very clean. The service was good and very welcoming. We ordered Omasake and Rainbow Don. The fish are very fresh and rice is well prepped. We also order the Hamachi Karma but was a bit undercook, which we sent back to get it steamed. I would say its bit on the pricy side, but you get good quality fish and food.", "author": "Jeff L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-29", "description": "FRESH & on point! This new establishment in the Ingleside neighborhood is mind blowing! It might seem like all the other poke bowl places; yet, it's completely different. Their chirashi bowl is so refreshing, not too saucy. With the seaweed they serve on the side, you get to personalize the way you eat your fish. Give it a try, and you'll be hooked", "author": "Zee Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-26", "description": "Very impressed with the quality of the fish! We ordered a Kaisen Don #1, Hamachi don and a rainbow don. Fish were fresh and nice portion. I like how they serve the seaweed on a side and I can assemble my own sushi roll. I will definitely come back again to try other don!", "author": "Vic L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-17", "description": "Love this place! This is our go to Japanese place. We did noticed that the portions have gotten smaller which bums me out. We usually get the rainbow don, tuna don, chirashi and gyu-don.", "author": "Joy S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-23", "description": "My son and I ate here and had a great meal. The space is small so I wouldn't bring a large group.  The restaurant was very clean and the service was professional. They offer a variety of proteins on rice.  The raw fish wash fresh and nicely presented.  The uní don had a very generous portion of ikura.  Hot tea was graciously included.  They also offer several bowls with cooked meat for those not eating raw fish.  Vegetarian options were also offered.", "author": "Kat M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-21", "description": "Kaisen Don has good Donburi. The  fish  is fresh and the rice is good. We went on a weekday and it wasn't crowded. The staff is also very friendly and took their time explaining the menu. A little pricey, but worth it for fresh seafood.", "author": "Wilson W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-27", "description": "The fish is so fresh.  I hope they keep the quality of the fish up because that is key.  The high prices are worth it as long as the quality stays where it has been. I recommend the Rainbow Don", "author": "John G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-06", "description": "Had the salmon ochazuke. The cooking could be improved; but in general, had a great experience and I'm glad to have this eatery here in the neighborhood :)", "author": "Tianyi Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-03", "description": "Best chirashi bowl I've had in my life!! Get the omakase bowl it is amazing value. Somehow tastes even better than it looks.", "author": "Jessica S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-07", "description": "An fine option for don in the neighborhood. Limited menu so seems like the kitchen is limited too. Quality of sashimi was good. Although unfortunately on the pricey side.", "author": "Heather R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-02", "description": "Their dons are decent and sashimi tasted fresh.  I liked how they brought us some fresh seaweed as well. The portion is just right for me, but the price is a little on the high end.", "author": "Joey K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-24", "description": "Fresh, modern and simple. Stumbled onto this spot when I was craving sushi. More expensive than I would've liked, but totally worth it! \n\nFor sure going again soon!", "author": "Melanie R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-02-12", "description": "Here's another review hoping that Kaisen Don steps up it's rice game. \n\nIt's unfortunate that with most sushi restaurants, rice is an afterthought and the fish is main attraction when it should be entirely the other way around. The rice at Kaisen Don was close to a good texture but slightly too wet and mushy, and completely lacked in any flavor whatsoever. No signs of sushi-su or sweetness and it ended up completely bland, reminding me of plain white porridge, which is really unfortunate because this place seems promising.\n\nThe fish, while not the best, was portioned very reasonably for the price. The nori provided was the highlight for me, I only wish that they provided a small dish to put them somewhere. I had to place them awkwardly on top of my don bowl as I ate, and ended up moving them onto my napkin.\n\nOverall, I'm looking forward to giving this place another try in the future.", "author": "Mack S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-09", "description": "Yes, the portions are fresh. No, the bowls are not as big as portrayed on Yelp (slightly bigger than a miso soup bowl).\n\nNonetheless, I was impressed by the freshness of this place. We tried the scallops and uni bowl / ikura bowl. Scallops and ikura were sweet and fresh without any aftertaste. The uni was on the tinier side but very fresh as well.\n\nI recommend to try this place, but have some snacks first.", "author": "Steph C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-11-20", "description": "I would request a bigger menu.  They basically only have maybe four or five chirashi bowls and beef curry which was the only hot dish.\n\nI think they're new to the restaurant business as they lacked finesse.  We had to ask for utensils and then were surprised when they brought out cheap plastic spoons.  Waiter would bring out one dish at a time and then go to other tables to bring out their dishes (those customers came after us).  By the time the last person in our party got her dish, everyone had been sitting around for 10 to 15 minutes to start eating to be polite.  And everyone ordered the same thing but one person who ordered the curry.  According to that person, the curry tasted like it came right out of a box with barely any beef in the dish.\n\nThe staff was very nice though.  I think for what is offered and for the area, the menu prices are high for such a simple establishment.", "author": "Bea Q."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-23", "description": "Great local spot. Very fresh fish. Good service. I enjoyed my meal there and will return and now just trying to hit the word quota.", "author": "R M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-15", "description": "Amazing fresh don bowl.  I'm not sure why some people says the rice is bland but I love the rice here - soft and chewy.  Maybe I came at good time?", "author": "Nara S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-26", "description": "Yum! Reminds me of the little mom and pop shops in Japan. The scallops and uni were sweet and served at the perfect temperature. Portions are huge. The salmon ochazuke needed a little bit of soy sauce but it was the perfect comfort food for rainy SF weather. I will be back (and bringing friends!) to try their sashimi.", "author": "Alice C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-25", "description": "Terrific fresh fish.  Great addition to the neighborhood.", "author": "Andrew N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-30", "description": "Small place, but my good friend recommended me.  I love Japanese food, sushi, sashimi, ramen, udon.. all my favorites.  I even have an Japanese cuisine expert showing me the good stuff in SF and elsewhere in the world.  I don't claim to be \"the expert\", but I certainly do enjoy food.  When I go to Japanese restaurants, I do scan the menu for chirashi bowls.  I love sushi rice and sashimi.  You can pair the right of rice with your fish, and I pick my favorite flavor of fish.  When I heard that there's a new place that specializes Chirashi, I was super excited.  \n\nAt a glance, the place is small, looks modern, somewhat resembles bubble tea/fast food restaurant.  Dinning room seats small amount of guests, this is probably due to SF regulations.  Things looks very clean and sterile.  When I walked it, around 5:40pm, it wasn't so busy, but I realized there was a line outside the door about 15 minutes after i sat down.  \n\nI was brought a menu with very nice pictures.  Not too much choices as a regular Japanese restaurant, but enough choices.  There are the scallop lover, Hamachi love, blue blue fin tuna, and even uni or toro.  The prices to me compare to many Japanese restaurants' Chirashi bowls are rather reasonable.  Usually, the Chirashi in a regular Japanese place is about 25 bucks above.  You can get the same less than 20 plus a 20% yelp discount - that is a deal.\n\nI brought my family there, my wife and two kids.  We ordered a box of uni for appetizer.  My wife ordered the Rainbow bowl, and I ordered the hamachi bowl.  I ordered the thin slice beef bowl for my kids to share.  The bowls came up rather quickly, but not all at once.  They were well presented.  The chef did really take a lot of time making sure the bowls presentable.  The fish are very fresh and high quality.  I enjoyed every bite of my Kaisen Don.  \n\nWhile I was there, I was able to located the owner, Larry.  While the places wasn't too busy, he told me about where he learned how to make chirashi bowls.  He basically like me who love chirashi.  He also recommended me to mix and match your chirashi bowls, and don't have to pick from the menu.\n\nI did read Chris' review, and I appreciate him pointing out how Larry's chirashi isn't the perfect chirashi for him.  Perhaps Larry can learn something from his review.  For me, I am pretty satisfy with mine, or Larry's representation.  I feel that if everyone's chirashi is exactly the same, there won't be any innovation in food.  We will eat the same thing for hundreds of years, but perhaps someone like Chris will enjoy that, and there is nothing wrong with that.  Larry is certainly someone who will probably take advice from his toughest critics.  If not, how else would you make your customers happy.  5 stars for my experience.  Thank you Larry.", "author": "Dennis L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-12-13", "description": "Went here for their soft opening. They had 20% off. The fish is alright. The portions aren't too huge so it's not like you will stuffed. I got the Rainbow Don and had approximately 9-10 pieces of fish and some ikura sprinkled on top. Presentation is done really well. It's a tiny spot but nice for a neighborhood meal with a friend.", "author": "Jessica H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-13", "description": "This place is delicious! It's kind of everything I was looking for a sushi bowl! Fresh fish, decent price and generous portions .", "author": "Vlad S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-06", "description": "The wait for Saturday lunch was short, about 5 mins. We ordered scallop lover and rainbow don. Food came with hot tea and hot miso soup (yums). \n\nBoth dons came with a good amount of warm sushi rice. The presentation was beautiful (should've taken pictures but too hungry!) The fish and scallops were really fresh! No fishy taste or random chewy bits. The hot tea kept flowing throughout the meal. No complaints. \n\nFor non raw fish eaters, they have a selection of cooked dons which looked equally as impressive.", "author": "Michelle T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-01-02", "description": "The fish was ok and fresh which is good. I think everything is overpriced for the quality of the fish.\n\nThe worst was the sushi rice. It was just plain rice which is a big disappointment. It felt like I was just having a big bowl of white rice with some fish on top. The rice was missing the vinegar, sugar and salt. The basic ingredients that you will have in sushi rice. \n\nI ordered the rainbow don and added an amai ebi to my don. My amai ebi was really small and what made it worst is that my friend got the exact same thing as me, rainbow don with amai ebi but her amai ebi was a regular size. I was upset that I got a really small ebi but my friend got a regular size and she was sitting right next to me. We are paying for the same price, so how come my ebi was so small. They should just give us the same size or add another small amai ebi on my bowl to make it seem like all the portions of the rice bowls are the same. But they charged us $10 for two amai ebi. \n\nThe place is really small and they had one server working. It wasn't really busy the day we went and the server was nice and he refilled our teas from time to time. \n\nOverall, I just feel like everything is overpriced even with the 20% off for soft opening.", "author": "Katie Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-01-11", "description": "So far I've tried this place twice, first time for the scallop bowl and uni 1/2 tray, 2nd time for the unagi bowl. The quality of the seafood is rather average. The uni and scallops were rather bland for being usually one of the more flavorful sashimi you can get and the unagi was not any better than than a frozen eel you can get at a Japanese supermarket. Actually, the two poke places nearby this particular restaurant has better unagi than this place. They also give you miso soup with the donburi, which is nice, but it is also of average quality. The presentation of the food is very good, though, and would look quite nice if someone was doing it for the 'Gram. Overall, this place is OK.", "author": "Angela L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-30", "description": "This is my first time try out at this place. I am falling in love with this place. Food is exceed my expectations. Sashimi is extremely fresh. Price is very reasonable. I will come back again. Highly recommend this place.", "author": "Kathy M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-08", "description": "It's sosososososo good!! Nothing else I could say. Right now they are on soft opening，everything 20% off. It's definitely a good time to check out.", "author": "Xiaochen Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-02", "description": "Ordered the unagi and chasu don, and my goodness were they delicious! The flavors are subtle, unlike other places' overwhelmingly sweet or salty versions. The owners were a sweet couple who gave us hot tea and miso soup while we waited for our food~ DEF coming back here whenever I'm back in the city! I just have to make it there at the right time cuz the space is quite cozy and gets filled up quickly!", "author": "Jasmine K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-28", "description": "I will definitely take the family here on a frequent basis. The sashimi was fresh. Generous portions at a reasonable price. Staff was very friendly and attentive.", "author": "Anna K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-26", "description": "I live nearby, so I was happy to see this new addition to the neighborhood. \n\nThe space is intimate and tastefully decorated, a quiet oasis on a busy stretch of Ocean. Complementary miso and tea was brought to the table quickly after I sat down. The fish was fresh and the rice perfectly cooked. The ikura were like little salty pearls. The little embossed wasabi puck was a cute touch. My very pleasant server, Larry, kept the tea flowing, welcome on this rainy day. Prices were fair for sushi fish. \n\nI'm told that the next iteration of their menu will have a vegetarian option, which my tamago and inari-loving kid will like. Her beer-loving dad hopes they get a liquor license, too. \n\nWelcome to the neighborhood, Kaisen-Don! Gambatte!", "author": "A P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-13", "description": "Amazng new Japanese Restaurant. I had the Curry Beef was delcious. My buddy had the Unagi and he loved it. We found this new place to eat and will be back. The staff is very nice. Leaving with smile.", "author": "Ron L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-26", "description": "What a great new restaurant on Ocean Ave! The best thing about this place is how fresh the sashimi tastes. No other Japanese restaurant in this area is on the same level. Prices are very reasonable for what you're getting. Also, the service is super friendly. My partner and I shared a Rainbow Don and a Beef Curry Don. Both were excellent. Each bowl also came with miso soup. Highly recommend and will be going back soon!", "author": "Garrett L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-11-11", "description": "Sorry, I'm going to disagree w/Michael re:reasonable prices. We paid $18.95 for ea of our bowls & felt that we didn't get much food. The service was ok..certainly not w/a smile, but was served in a reasonable amount of time. Our miso soup was lukewarm at best. Glad to have gotten a 20% discount for the soft opening, but I don't think this place is for me.", "author": "susan w."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-01", "description": "Great food and service. Got seated promptly and the food came out very quickly too. Ordered the thin beef , Salmon and another dish. All three were good but the beef was the best.", "author": "Manoj Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-18", "description": "Just stopped by here during their soft opening and I'm so glad that we have a decent sushi place in our neighborhood!  Hubby got the hamachi bowl--large slabs served with tamago, salmon roe and cucumber.  I got the rainbow don with tuna, hamachi, salmon and salmon roe.  The fish was fresh and the meal came with free tea and miso soup--nothing too special but nice on a chilly day.  The menu is pretty limited, with only sushi rice available as a base.  It sounds like they plan to add more choices in the future.  If the quality stays good we're looking forward to making this place a frequent stop for dinner.", "author": "Andrea K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-20", "description": "Really fresh ingredients. Good quality for price! Still soft opening so they gave us 20% discount. Would recommend.", "author": "Katrina W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-01-23", "description": "Overpriced for very small portions. The restaurant is extremely small and tiny there's not enough space for people to sit. Overall food was OK but not particularly fresh", "author": "Alex H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-30", "description": "Food is fresh, flavor right. One thing they could improve on is the rice. It was a little hard and not chewy.", "author": "Phuong P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-23", "description": "Good services. Tasty fish and fresh. Not bad for a quick healthy bite. Comfortable and clean feel restaurant even though is small.", "author": "Henry C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-02-06", "description": "Our table of 4 got seated right away on a Friday evening. The atmosphere is minimalist, not charming or comfortable. I would like more ambiance going out to eat at that price point (~$20/bowl). We tried 4 different bowls. Mine was scallop and uni from the specials board. The scallops were good, but it's a very small portion for $20.95. The uni was just two small pieces. It had ikura, which was not mentioned as part of the bowl. Unfortunately, I don't like ikura. We asked for the 20%, and at first they said that was over. We told them we saw it on Yelp and they asked us to show it to them. The Yelp mobile phone version doesn't mention the 20% discount, but the Yelp desktop version did that day (and still does 4 days later as I write this review). The servers were nice enough and eventually they said the manager would extend the 20% discount to us. Overall, we it was a very underwhelming experience and we will not return.", "author": "Jane M."}
