{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-23", "description": "Ordered two type of meat together with rice - roast duck and roast pork. They give you a lot of meat and rice for $8.80. The skin of the roast pork was very crispy and the meat is also tender. The sauce they pour over the meat and rice was also good too. \n\nDo note that this restaurant only accepts cash, and there are limited seats inside.", "author": "Celine K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-09", "description": "The best thing to do when entering a Chinese BBQ place is to stare into the window for 10 seconds to look over the delicious hanging meats and then immediately go for the duck upon ordering.  It's like trying the bread/oil combo at an Italian restaurant to judge how good everything else is or a basic taco at a full service Mexican place.\n\nWell, the duck was some of the best I've ever had in the many major cities I've tried it in.  It still had the star anise hanging onto the crispy skin as I devoured every little piece possible.  The rice plate which costs as much as an extra value meal, comes with a good amount of rice and a small mix of choy and lettuce.  We also had beef chow foon and a side of cooked lettuce.  Neither were as spectacular as that roasted duck, though.  \n\nIn Boston, we are used to cold and quick service.  Not here, they took their time to listen to what we had to say, made sure we understood clearly that it was cash only and the lady taking our order made sure I didn't overpay for a crispy noodle dish.  I'm still a little weirded out by SF culture and those who are nice to you, it's not standard everywhere. \n\nAll of the places we could have eaten in Chinatown and we decided to go back a second night, it was seriously that good.  I loved everything about this place, it was quaint, a little bit on the dirty side and still a big enough hole in the wall where you didn't feel cramped.  As mentioned, the service was stellar and the chefs greeted us both on our way in and way out.  You can't ask for anything better.", "author": "Jeff M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-07", "description": "The old Asian lady next to spoke little-to-no English but still managed to indicate following...\n\nI was using chopsticks correctly\nHer Char Siu (rice plate) was better than my Roast Pork\nShe was enjoying that MJ was enjoying her Roast Duck\nShe liked Filipinos\n\nFive Stars!", "author": "James G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-14", "description": "everything is so darn good here.\n\nKam Po Kitchen doesn't serve up Michelin-standard cooking, but it serves up big hearty portions of delicious Hong Kong style dishes. There are a lot of tables within the restaurant but all the tables are very close to each other. Be prepared to share some personal space! Kam Po Kitchen offers sit-down meal service or a take-out line for those who wish to bring home roast duck, soy sauce chicken or any meat of the sort. \n\nI have tried a number of the dishes offered here. Roast duck over rice, duck wonton soup and prawn with egg chow fun are all good choices. Everything is also inexpensive. Unlike many of the butcher shops in Chinatown, Kam Po does not skimp out on the meat. I have tried the prawn with egg chow fun dish throughout many Chinese restaurants in Chinatown, and the one here is hands down the best. \n\nMany of the staff members here don't speak English. Two of the female staff speaks English and provides good service though. The only thing that irks me is that the dining tables are always so greasy or oily from a lack of quality deep cleaning. This is a very popular lunch spot for locals in Chinatown. Kam Po is great for your stomach and easy on your wallet and it's definitely one of my favorite lunch spots in Chinatown! CASH ONLY!", "author": "Philip M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-04", "description": "This is a no frills cash only Chinese dive and it's damn delicious!\n\nDon't expect much table service here and don't be too adventurous either. Their menu is vast, but for a place like this - stick with the basics: porridge, noodle dishes, or rice plates.\n\nWe began with a medium serving of fish filet porridge, my families baseline for porridge these days. I thought it was delicious - it had the right consistency and was very generous with fish. It was also infused with a good amount of ginger and cilantro which definitely kicked it up a notch!\n\nNext came the beef chow fun and Peking duck and roasted pork over rice. Hands down, the latter won. The roasted pork was awesome! We also chose to order this because we noted the hanging pig was still within the half range point (the best area). It was meaty, not too fat, and well spiced. The pork skin was nice and crisp. The duck was on the fatty side, but like good Peking duck, it dripped all its glorious juices into the rice beneath and that greasy goodness reminded me of days when I used to throw a tantrum as a child and get this or soy sauce rice as my alternative dinner. And yeah, maybe I did this a little more often than I should have....but it's so worth. The beef chow fun was pretty standard but I liked that they didn't use too many fillers (onions and bean sprouts). The noodles were also sauteed correctly and not glued together. Kudos to the chef!\n\nTo get a few veggies in, we also opted for gai lan sauteed with beef tendons. The veggies were crisp but came soaking in beef tendon sauce/broth which probably eliminated all its health benefits but sure tasted good anyway. The tendons were also large and not chewy, cooked just right.\n\nAll in all, it's definitely one of Chinatown's best casual places to grab a bite!", "author": "Elaine Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-28", "description": "It's my go to. And I love it. Know what you want and you'll be stuffing your greedy little face before you know it. \nI'm a scrambled egg (runny) kinda gal and in my humble opinion it's the best in Chinatown. Super hearty and generous portions. I get it with flat noodles and shrimp. Not on the menu but the hostess knows the deal. The soups are HUGE and enough for two. Same for porridge. I'm not complaining. \nMy dad always gets the curry which has loads and loads of green pepper which is super sweet and crunchy. \nThere's not much time for fussing around - expect to sit down, have (free) hot tea slapped on the table and to order within about 5 minutes. Honestly I don't think there's better value.", "author": "Poppy C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-08-13", "description": "This is a dive, a genuine hole in the wall.  With a capital D, capital I, capital V, capital E.  This no frills spot on the edge of Chinatown is known for its BBQ  and roasted Chinese meats. It's totally a quick, cheap eats spot.  \n\nArrived here because I had a real craving for wonton soup.  So much so that I couldn't proceed any further with my day before satiating my craving.  I've been here for take out of their roasted meats, as well as their beef chow fun.  The chow fun here is always nicely wok fried, and the noodles never clump or stick together. \n\nI heard this place served very generous portions, so that piqued my interest.  You know the saying though, \"The proof is in the pudding\".  Well, my response to that has always been, \"Serve up the pudding!\".  Show me!  Prove it to me!  And not with words.  Talk is cheap...Well, they did.\n\nI was served a huge bowl of roasted duck with wontons and rice noodles, for just $8.00 pre-tip.  The massive portion of roasted duck was very meaty and moist.  Most importantly, unlike many noodle joints that literally drown their meats in the broth, Kam Po perfectly \"floated\" their meat atop a massive mound of rice noodles.  This kept the skin of the duck perfectly crispy.  This was worth the entire dish, my friend.  \n\nThe won tons, filled with pork and shrimp were fine. \n\nThe amount of rice noodles were literally ginormous.  In fact, I would've preferred 50% less. Did I just say that?  Yes, simply because rice noodles tend to absorb liquid like a sponge, and by the time I finished only about 20% of the dish, I was left with gloppy rice noodles, and barely any remaining broth.  However, if you like huge portions, this is for you.\n\nAgain, this is a DIVE.  If one desires to dine here, one must remember that a nice ambiance is obsolete.  While I was here, an elderly Chinese gentleman was literally yelling on his phone in Chinese during the entire course of my lunch.  The other elderly Chinese customers also seemed perturbed.  However, this apparent soliloquy seemed to go completely unnoticed by the staff.  Just another day here, it seems...", "author": "Lori N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-04", "description": "If you're looking for a cheap and good meal for two this is the place to go. If you're a clean freak, this may not be for you. They have a pretty good spread on their menu from soups to noodle dishes and bbq items.\nWe ordered the combo plate with roasted pork and roasted duck and both were so good! One plate was big enough for two hungry adults to share. The roasted pork had crispy skin and no foul pork odor that we've had at other Chinese bbq restaurants. It was so juicy and flavorful. The plate also had roasted duck and this was by far the best roasted duck I've had in SF! The crispy skin was the best part for me. :)", "author": "Jane C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-20", "description": "No frills, just straight up good food! Cash only please!! Grab a table and order yourself a bowl of duck noodle soup, skip the wontons. You'll thank me later.", "author": "Lizzy S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-14", "description": "On the outskirts of Chinatown, right before the Broadway tunnel brings you to another neighborhood.  Totally worth the hike because there is just so much delicious meat at such a reasonable price.  A very unpretentious place, where office workers can eat beside construction workers.\n\nRoast Pork: The bubbly crispy exterior is simply amazing!  The meat and fat underneath isn't quite fall part though.  It's firm to the bite, but not too tough.  The whole thing is really good with a little of the chili oil that's on the table.  Only disappointing thing was the inconsistency of the crispy skin; it seemed my table mates got more crispy skin on their plates.\n \nBBQ Pork: The highly marinated end pieces are the best.  The large leaner pieces are good too, with a nice balance of flavoring.  Wasn't a fan of the fattier pieces since they didn't absorb the marinade as well and the fat seemed tougher than the fat in the roast pork.\n\nLo Mein: More exciting the white rice.  No flavoring or sauce, but that's ok given how intense the meats are.  Stuck together a bit though.", "author": "Adam B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-14", "description": "{Cash only} We came to Kam Po because they open early. The Chinese bbq entices you as it hangs in the window. We needed a place to eat before we caught a flight back to Houston. With us being used to the central time zone, eating Chinese bbq at 9am wasn't as odd. The woman working the restaurant seems to always be in a hurry. She talks fast and moves fast even though we were one of two tables there. You're offered a glass of water and a glass of hot tea. The hot tea is perfect for the cooler SF mornings. We ordered the two bbq meat option w/rice: roasted pork and roasted duck, bbq pork w/egg noodle soup, and a beef chow fun. The portions are huge and the food is cheap. The Chinese bbq was all delicious. Crispy skin on the roasted pork, the duck was juicy and not dry, the bbq pork wasn't overly sweet and not dried out as well. It's definitely worth a stop if you're in Chinatown. A lot of bang for your buck.", "author": "Lanha T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-29", "description": "Yummy. The cold boiled chicken is really similar to kainan chicken. I really like it.", "author": "Michael N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-18", "description": "Note to self: do not come at 7:20 cause they'll lock the door and lock your booty outside the door. Typical Asian restaurant who holds strongly to their hours (7:30pm).\n\nPortions are large, price reasonable, cleanliness iffy and services fast. \n\nBe ready to order right when you sit. This lady is like a lighting ball that flashes from table to table. If you don't have your orders ready, then she'll be running away to serve another table.\n\nDuck was fatty and yummy. It's difficult to cook a duck wrong, but I only wish the skin were crispier.\n\nWest lake soup... not good at all, not what I wanted nor what I expected. The flavor profile on this one is all wrong and off... even the color.\n\nStir fry pea sprout, a huge plate with loads of msg on top. It's good, but the flavor is still a tab bit off.\n\nPlain egg noodle soup, by far the best of the night. I think this is what they're known for; noodle soup. The noodles were cooked perfectly; the soup was nice and clean; the veggies were crispy and pairs well with the noodles. \n\nTip: come before 7:20 or don't expect to even get into the door. For 2, keep at top 2 rice or 2 noodle dish unless you're looking for left overs for the next day", "author": "Rosemary T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-14", "description": "A delicious spot to get your grub on. It's a little different than your typical restaurant in that the tasty meats are hung up for you to see but hey it makes it easier to point out. The menu it's vast but straightforward, I opted for the fried pork over rice. \n\nThe pork over rice was amazing and the portion sizes were hefty. I wouldn't have imagined getting such a good deal for the quality, taste and large portions. \n\nThe service is pretty good. My server was patient and was quick to answer my questions as I normally bombard people with my thoughts. She quickly took my order and promptly returned with my meal. \n\nFinal and important note, this location is cash only. My general impression is that most of this area prefers cash only. \n\nDefinitely, will return next time I am in the area.", "author": "Juan Carlos H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-23", "description": "My bf loves hainan chicken, so one day we were on yelp searching for this specific dish and we decided to walk to this place to try it out.\n\nThis place was very dirty, but the food was really good. Unfortunately, every time we go here since they don't have hainan chicken. They have something similar called Chinese chicken.\n\nMy bf is addicted to this place, we go here almost every weekend to get his Chinese chicken with extra ginger. The to go line is actually more expensive than dining in or calling for to go. So we just call in now order to go. I like the roast pork.", "author": "Kimberly D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-02", "description": "I never write reviews while I'm still out of town and i always end up writing reviews a few days after i get back home but we're currently waiting in a long line for boba so here it goes:\n\nDont go to Kam Po if you want a nice dining experience. Actually, dont go to Kam Po at all if you are looking for any kind of dining experience bc there really isnt one!  Well, except we had a funny experience...\n\nWe tried ordering the roasted duck & bbq pork and i couldnt explain to our waitress who did not speak english.  I pointed to roasted duck and bbq pork on the menu but i was trying to explain that we did not want two separate plates but that we wanted one combo plate with both the duck & pork.\n\nLucky for us, there was another table who ordered exactly what we wanted so i pointed my finger at their plate and told her thats what we wanted and she said \"OHHHHHHH WOASTED DAK & FARFEQUE FORK COMBO!\" \n\nThe roasted duck was arguably one of tbe best I've ever had.  Super juicy, full of flavor, and most importantly: ZERO GAMEYNESS.  The BBQ pork was very good also but I've had comparable pork at other places but the duck here is almost in a class by itself.\n\nUnfortunately the customer service is not all that great, the restaurant is not all that clean, and i don't know how long this place will hold up but i hope it stays open long enough for people to try their roasted duck...", "author": "Jang N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-19", "description": "Lol @ the reviews griping about customer service. I mean, bitch, what did you expect? \n\nLike, it's 2018. You should know you ain't gonna get cloth napkins and indoor voices in a Chinatown establishment. You're lucky that she even brought you the tea. \n\nAnyways, I love this place. \n\nSuper fast service, and efficient.\n\nAnd I don't even speak Cantonese properly but that waitress was like that one aunt with RBF that actually loves you deep down.\n\nIf you were drawn in by the BBQ, get a BBQ and rice combo. You could even be extra fancy and get half and half roast pork/cha shu. So damn good.\n\nI dunno if it's the same in English but she'll give you a choice between leaner or fattier cuts of pork. \n\nI'd come back.", "author": "Andrew C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-22", "description": "A great place for bbq chinese food. Huge portions for what you pay for. Little room to sit and It may not be the cleanest place for sit down to eat. I take out is probably the best way", "author": "Derek L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-29", "description": "If you can get over the dried pieces of food on your utensils, layer of unidentified oil on top of your scalding hot tea, and other cleanliness question marks, this place is pretty darn solid for hole-in-the-wall Chinese food. Just don't grab the underside of the table with your bare hands to pull yourself closer to it. \n\nWonton soup, rice plate with roasted pork were pretty straight forward, just tastier than most. Maybe I lucked out with super fatty pieces of pork, but the white pieces weren't dry. A feat, when it looks like the hanging pig from which they cut your meat looks like it's been there for a while. \n\nMaybe that's it. It looks like just another Chinese food place, but they have lots of customers.", "author": "Sheewon B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-12", "description": "CASH ONLY!!!\n\nAn amazing value for authentic chinese food and the best you can get in SF (saying that because this place would be just average in LA). This place has large portion sizes for cheap. My boyfriend and I spent $15 on two dishes and had lots of leftovers to bring home even though we eat a looooot:\n\nDish 1: Porridge! With duck and preserved egg. We got the large and it was huge, but primarily lots of porridge and not much duck/egg. I still loved it and felt the porridge itself had its own subtle, comforting flavor. I didn't like that the duck had bone in it - was hard to eat.\n\nDish 2: Two items with rice - we got the roasted pork and hainan chicken. Both were good and tender, but I wish they had actual hoisin sauce and soy sauce for hainan chicken available. They had typical soy sauce and chili oil, but it's not the same.\n\nOverall, great chinese food for cheap.", "author": "Elvi T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-02", "description": "Ok, I feel bad for giving this review 3 stars in the past. I ended up coming back and getting the Chicken Chow Fun (~$6.50 ish). It was pretty good. Much better than the mushroom chicken dish I ate earlier. I was able to make three meals out of this dish! I think I will come back here in the future since the food is sooo cheap.", "author": "Kristina M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-14", "description": "This place is bomb. I don't think the guy chopping everything up spoke English but we were able to communicate just fine by pointing! We got a huge portion of roasted pork and another huge portion of BBQ pork for less than $15. The skin on the roasted pork was so crunchy and delicious. The BBQ pork was perfection. We also got a side of white rice and cabbage. So delicious. Cash only!", "author": "Taylor P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-10", "description": "If you're looking for cheap but delicious roast duck or pork this is the place to go. You can get a giant plate of meat with rice for only $6.50. \nThe menu can be somewhat daunting, I believe there's around 140 items, but if you stick with what you know you'll be fine.\nMight not be the cleanest place or the friendliest service but it adds to the character.", "author": "Taylor B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-26", "description": "Came here around 10:30am on a cold gloomy day looking for some comfort food. We ordered a Hainanese Chicken and Rice dish as well as a Roast Duck Wonton Noodle Soup bowl. The wonton soup bowl was a generous portion size, with a large amount of roast duck and several large fresh tasting wontons. The Hainanese Chicken was tender and the green onion topping was flavorful. Both were excellent and at a very good price. The restaurant also served complimentary hot tea. Service was efficient and the restaurant was clean. Plenty of indoor seating. Parking can be difficult to find however. Overall definitely worth a visit.", "author": "Tina D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-12", "description": "Cheap noodle soup place that definitely hits the spot when you're battling a massive hangover. Cash only!\n\nI've been here a few times and my personal favorites are the Beef Tendon Noodle Soup w/Egg Noodles ($6.95) and Beef Chow Fun ($5.50). The portions are huge and is it enough to feed me 2 meals!\n\nI'm looking forward to coming back to try their porridge with some Chinese Donuts. Yum!", "author": "MyTien P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-06", "description": "Great place for Chinese BBQ! I purchased a few items to go on a Sunday afternoon, and it wasn't too busy around 4pm. I tried:\n\n-Roast Duck: Super flavorful, and they marinate their duck well since all the pieces of duck have flavor. I also loved the crispy skin, and the duck wasn't super fatty- highly recommended!\n-BBQ Pork: Great version of BBQ Pork, but I liked the one from New Golden Daisy slightly more since I believe they use more wine. However, this version has a great sweet undertone, and I loved the sticky exterior- recommended!\n-Poached Chicken?: I'm not sure what the English name for this style of chicken is, but the skin is white/yellow, and it's not roasted. The version here was also really good, and very flavorful- recommended!\n\nI will definitely be back here for more Chinese BBQ! The BBQ chef is not the nicest, but their other staff were really nice. Parking in this area is the most difficult part about coming here- with all the construction, spots are extremely limited. You'll likely need to circle for a while to find a street parking spot. Plan to come with another person so that they can double park while you run in!", "author": "Amy D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-22", "description": "Awesome takeout roast duck and pork. No English or credit cards allowed. We pointed, paid, and tried to be friendly and were met with some deadpan looks that will stay with me. I almost felt...unwelcome. I stupidly mentioned that we had found them on yelp and we had come all the way from LA to try their duck, and the look they gave me made me feel that I had just pissed all over their grandmothers grave. Ok, so not friendly but the food...\n\nAwesome; we ordered a half duck and a half pound of roast pork for about $25. Both so very good, my mouth is watering thinking about it. The pork skin was crispy and delicious, even cold. \n\nWe took our loot to the hotel room and snacked over the course of a few hours. At no point did it turn and not taste absolutely amazing. Can't wait to come back! Awesome meat for a great price.", "author": "Kyung E."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-07-14", "description": "I have a very mixed opinion of Kam Po that ultimately leans negative. While my roast duck was delicious and moist, my husband's was dry and his wontons had a very unpleasant taste. The stained plastic dishes and sticky tables made the overall atmosphere poor. If the food had been excellent, we could have overlooked that. Unfortunately, we had a bad experience and would not return.", "author": "Marie S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-11", "description": "Kam Po Kitchen is a Cantonese restaurant that is outside the tourist circuit in Chinatown but it looks any other restaurant in the heart of Chinatown with various BBQ meats hanging from the window. The menu is your typical Cantonese style which means it a gazillion choices ranging from wonton noodle soup, porridge, rice plates and pan fried noodles to curries and snacks.\n\nThe BBQ meats in the window looked good so I decided to get a 2 Item with rice ($8.30) combo to-go and went for the soy chicken and duck. Payment was cash only. I got a huge container that was filled to the brim with good quality cuts of both chicken and duck. I mean their serving size is almost double of what you will get at Yee's which is in the heart of Chinatown. The duck here actually had some meat on the bone and did not consist of all fat that you get elsewhere. I've come back here a couple of times and the quality has been consistent across visits. I haven't tried anything from their huge menu but if it is anything like their BBQ meats, I think it would be really good. Kam Po Kitchen gets a thumbs-up from me.", "author": "Ahmad J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-14", "description": "I read all the reviews and my family and I planned to visit this establishment while vacationing in San Fran. We were all glad we did! The food was so delicious and the price for each dish is ridiculously cheap! \n\nI recommend the BBQ pork, roasted duck, shrimp fried rice, and combination chow mein!\n\nWe will definitely be back when in town!", "author": "Bianca G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-15", "description": "During my family's quick stay in San Francisco, it became our purpose to find great Cantonese food. Online Kam Po had great reviews, in person it looked like any other restaurant in Chinatown. It had the roast duck decorations and the jam packed dining room. Our eyes grew larger than our stomachs when we saw that most plates were under $6. \n\nCue the order for bbq pork, chicken chow mein, fried rice, bbq short ribs, roast duck, Mongolian beef, and kung pao chicken. Everything was succulent but maybe a tad heavy on the salty side. I feel like I gained 10 lbs in one meal but I couldn't stop. Even my family the picky eaters were in love with this place. \n\nMy only cons were that the Mongolian beef was more onions than beef and don't expect to have your own table. We shared ours with other customers. The restaurant can fill up but we didn't mind. \n\nThis location is a bit off from Chinatown which helped us find parking as well. I did notice a lot of customers ordering different variations of their noodle soups. They looked and smelled delicious. Hopefully someone else has reviewed them.", "author": "Cam M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-07", "description": "Neighborhood eateries. Prices are reasonable and taste like home cooking.  Most of the diners are people who live in the neighborhood. They have soup, noodles, rice plates and entrees.  It's the same people who has been working here since I moved back to the city.  I think I remember the waitress when I used to have dinner with the family on vacation.  They do tons of take outs!", "author": "Stephanie C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-24", "description": "Kam Po has been consistently my favorite restaurant in Chinatown. It's rarely crowded, the service is friendly and, most importantly, the food is REALLY good.\n\nThis small eatery specializes in roasted meats, namely char siu (BBQ pork), roasted duck and roasted pig (with the crispy skin). My favorite dish is the BBQ pork won ton noodle soup. It's the only place in the world where I enjoy won ton noodle soup, because they give you such big portions of everything for about $7.\n\nThe char siu is phenomenally good, and I'm very picky about char siu. You can choose if you'd rather have a fatty or lean cut. I always choose lean, and it's still tender and moist, not unlike a fine Texan brisket. All meats can be taken to go by the pound for home consumption.\n\nI usually only come here when my folks are in town, mostly because I don't eat out often. The kind woman who works here somehow remembers us and always treats us well.\n\nI recommend Kam Po to everyone looking for a delicious but affordable bite in Chinatown.", "author": "Keane L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-30", "description": "TL;DR - Cheap, tasty, filling. Don't expect to be treated like royalty, and no, the customer is not always right. CASH ONLY\n\nIf you are the kind of person that only cares about how tasty the food is, this place is for you.\n\nIf you like paying as little as you can for said tasty food, this place is for you.\n\nIf you think that customer service is the most important part of a meal, please avoid.\n\nGet any of the bbq items, but I recommend the duck and the pork. I've basically never had a bad item here.", "author": "Crystal Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-18", "description": "1. Delicious Cantonese bbq: duck was tender. Just slightly dry maybe because it was the last batch of the day\n\n2. Casual environment. The space gets crowded and tight. Had trouble moving among the chairs, maybe I need to either lose some weight or lower my food consumption \n\n3. Decent portion for two people to share. Great value.", "author": "Eileen H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-07-21", "description": "Quality-wise cannot compare to what's in HK, and it's weird how they use wide rather than thin noodles with wontons. But they do give you a LOT of food, so you're guaranteed to leave full.", "author": "Mike L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-07-06", "description": "I grew up in the neighborhood and ate here often as a kid - without knowing better.  This is still a great place to fill your stomach, but this \"restaurant\" is glorified fast food for dirt cheap.  There's the staple selections of Chinese BBQ items hanging in the front as well as cooked items from the back kitchen.  \n\nI ate here with my mom recently, and I can't recommend this place as an adult.  First, Kam Po has anywhere seating with no host/hostess.  Be prepared to elbow/jockey for position against elderly folk who know that the rule is make-your-seating-anywhere-there's-an-opening.  Be prepared to sit with random people, whether you like it or not.  Once you grab a seat, you will have to wait to be served if other customers are more aggressive than you.  There is one waitress for the entire restaurant.  Your table may or may not be bussed when you sit.  Have fun ordering from the impatient waitress.  Good luck with refills of tea or tap water.  Don't be surprised if you see vermin.  Yes, I saw a dead rat on the floor in plain sight.\n\nOn the positive front, food comes out fresh and hot, and it still tastes as good as it did when I was a kid, hence 2 stars.", "author": "Don L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-28", "description": "Kam Po Kitchen is the perfect place to grab a delicious and cheap dinner. The restaurant offers a variety of different meats to go with their soups, rice plates, and porridges. \n\nI highly recommend getting the Roast Duck and BBQ Pork Rice dish. The portion size is very large and filling, and I would suggest either sharing the plate with another person or being prepared to bring back some leftovers. The meats themselves are very well-cooked and super flavorful, but the best part about the dish was that it was less than $10.\n\nDo note that this place is quite no-frills, so keep your expectations for the service low and just come here for the great food!", "author": "Yuan J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-07", "description": "I LOVE this place. \n\nIt's very convenient to call your order in ten minutes prior, illegally park, then run in to grab your bags of enough food to survive for the next two days, all\nfor something like $20! \n\nMy go-to items are their chow fun, roast duck, roast pork, and wonton soup.\n\nSweet customer service goes a long way, too.", "author": "Camille L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-25", "description": "My brother took me here because he knows how much I love BBQ delicacies! Oh man, delicious! We had the oh so delicious barbecued roast pork/roast duck (which sold out shortly after we ordered ours), prawns with salt & pepper, and water spinach with preserved tofu. The roast pork was so crispy!! Mmmmm. There's so much on this menu that you'll be sure to find the Chinese dish that you're looking for! And the prices are not too shabby at all! My parents have been here as well so it's a family fave. Will definitely be coming back for more!", "author": "Monissa W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-14", "description": "Every time I go there to eat they always serve me better bbq pork there. The service is really good", "author": "King Hong C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-12-22", "description": "Pretty good roast duck and BBQ Pork that's similar to several spots in Oakland's China town.  A little bit of each (but enough for a a meal) came out to $9 out the door which by SF standards is excellent. You can order to go or eat in the restaurant itself which seats I'd say around 30 ish people.", "author": "Rod M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-01", "description": "This is a hole in a wall type of restaurant but that's usually where you can find the most authentic Chinese food! We got to San Francisco and were craving some good Cantonese food and found this spot. You really get a lot of food for the money (7 dollars for a large plate of meat and rice) and the food was really good.  You just can't expect great customer service but we didn't walk in with that mindset so we walked away very full and satisfied.", "author": "Rongling Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-16", "description": "This gem is located outside of the busy tourists area. No one speaks English, the floor and tables are dirty, but the food was phenomenal! We ordered the shrimp wonton, yum!!!! The duck was to die for! And the fried rice and delicious. Best of all: we only spent $17!!!! It is dirt cheap, especially by San Fran standards!!!", "author": "Frances R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-21", "description": "DO NOT COME HERE. YOU WILL NEVER WANT TO PAY MORE THAN 10 BUCKS FOR ROAST DUCK AGAIN​. The chow mein was also pretty amazing. I wish we got more stuff because​ their menu has an absolutely​ insane spread of dishes (I think we counted like 100+ items). I'm​ coming back here whenever I'm in the city. Great place to eat after day drinking. Cash only though but almost everything is so reasonably​ priced you could put yourself and your date in a diabetic coma for 40 bucks.\n\n\nI've since returned (while sober even) and the food was still great. The roast pork is also fantastic, same with the fried rice with with scrambled egg and shrimp ( get it with the gravy)", "author": "Matthew W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-14", "description": "Food is heaven! I had preggo craving so caught a uber here. I slurp down their beef stew wonton soup on 5 mins and ordered a rice place with 2 bbq items to go and half duck ohhhh and half lb of beef tendon. Don't judge me who doesn't love a skinny girl that can eat? Lol\n\nCash only. \n\nCustomer service was ok. The chef/butcher was mean, I actually wanted some cuttlefish too he said I have to buy the whole thing or nothing at all  I know I got a big appetite but I can't eat that much now... overall good experience. Brings back childhood memory like 15 years ago when I lived in CT and used to do laundry with my mom across the street and eat here to wait for our laundry. Awwwww", "author": "Kris J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-22", "description": "Great place came here from OC. I got half and half duck and pork with rice. Big amount of meat fast service.  You have to look past the ambiance here. The most important thing here is the food and it's awesome.", "author": "Dimitry J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-23", "description": "This is gets busy during lunchtime or else you have to stand there and wait. The hot food to go line is decent.\nThe menu prices is reasonable . I get the combo - duck with bbq pork over rice and sometimes, I get the roast duck wonton rice noodles. Come and visit soon", "author": "Jsphn T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-09-19", "description": "I will admit, for value and convenience Kam Po cannot be beat! They were open at 9:30 am on a Saturday when I woke up in a daze with a hankering for noodle soup. Their congee was only $3.50 and the roast duck and wonton noodle soup about $7. I mean, geez, we were stuffed with a total check amount of less than $12! For these reasons, I do recommend Kam Po and will probably be back...only when it's the only option available.\n\nThe preserved duck egg and pork had good flavor but the pork had that weird off taste of lower end Chinese restaurants. The duck was good but the noodle soup and wontons were otherwise lacking in flavor.\n\nGreat stop to stop by when you're looking for a quick, cheap bite, otherwise there are definitely other options nearby.", "author": "Christina L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-27", "description": "This week, I came down with a cold and a sore throat so I wanted to get something simple and soothing. I decided to go for some porridge because this place was close by and they serve sampan porridge. I came with a friend and we were seated immediately in the middle of the restaurant. We ordered the sampan porridge, the frog porridge, and the curry beef over rice. \n\nThe sampan porridge was the first dish to come out and it was pretty large. I'd say there was enough porridge for roughly five small bowls in the big bowl that it came with (it seems to be what they classified as a medium, which is very generous, especially for $3.90).  \n\nThe curry beef over rice came out next, and then finally the frog porridge came out. I ordered the frog porridge mostly because I never had frog in porridge. The bowl that the frog porridge came in was of equivalent size to the sampan porridge, which means that we had the equivalent of ten small bowls of porridge to eat, along with the curry beef over rice (the sampan porridge only had one size (medium), while we also got the frog porridge in medium size for $5.10).  \n\nNow, this is probably one instance where I should have checked the pictures of the porridge on Yelp to get a feeling of the sizing because when everything came out, I didn't know if we were going to be able to finish this. I must emphasize again that the portions are very generous here, and in retrospect, I think we should have just ordered one bowl of porridge instead of two. We were hungry, but not ten small bowls of porridge and a rice plate hungry. \n\nAnyways, the Sampan porridge contained assorted seafood, and a generous helping of peanuts to top it off as seen in the picture. I was honestly a little surprised to see little slices of squid in there. The curry beef was delicious as well. I was also pleasantly surprised by the frog porridge and its deliciousness, and the only thing that could have made this dish better was if they stripped away all the bones beforehand cooked with the porridge, but that's probably asking a bit too much. We managed to finish all three dishes in roughly forty minutes, although it was a bit difficult finishing the porridge due to the sheer size of it.\n\nOverall, my assessment of this place is solid four, and I came away from this experience very bloated and satisfied. As I sit here writing this review, I could feel myself feeling a bit better after the large helpings of the porridge. The only thing that could be better about this place is if they took credit cards, but it is what it is. Now if you skipped all the way down here and didn't read any of the literature preceding this sentence, all you need to know is that there are very large helpings of porridge at a very reasonable price; that's my one takeaway from eating here.", "author": "Nelson X."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-22", "description": "honestly yall idk why people be trippin over service quality. the nonchalance is kinda just a part of the Chinese food culture and adds to the authenticity. Besides the service was fine when i went. The workers were eating when we came in to sit, but server still came to serve us and took our order and etc. \n\nAnyway, I LOVE THIS PLACE. I was raised in Hong Kong and this place totally brings back memories. If you want authentic taste, this is it. If i had to show someone what i usually eat in hk, id take them to this place. Andddd this is what they call \"best value\". you get a good amount of food for the price you pay, and its so tastyyy! Total GOOD DEAL.\n\nI got the roast duck rice noodles ($6.25). The soup was amazing (the magic of MSG, i think LOL this assumption is not verified but it tasted like it). I was stuffed afterward. Honestly i was so happy the entire time i was eating. I WOULD DEFINITELY COME BACK.\n\nand remember, CASH ONLY.", "author": "Jen K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-03-23", "description": "Minus 2 stars for the food excluding the bbq items. The service wasn't too good either. But I guess for the price, you can't really expect much. \n\nSingapore Fried Noodles - 1/5 no flavor to it, just oil taste and literally all noodles.\n\nCongee - 3/5 Not bad tbh, \n\nStir Fried Noodles - 2/5 No exact name for it \n\n4/5 for the duck, octopus and roasted pork . Definitely tastes better than the places we have up in Seattle but they forgot  the pork skin when they gave us roasted pork. Kinda awkward considering we had to ask for it, when it should've came with it... We were given the back part of the duck, so there wasn't really any meat on it, and there was no plum sauce that came with it???", "author": "Carol T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-17", "description": "The price is amazing. You can't really find cheap Chinese food anywhere else. Some of the entrees need a little more or less salt, but I'm not complaining at the price!\n\nThey always serve tea in a cup that gets really hot. If you want water you have to ask for it. It's also cash only, so be prepared for that.", "author": "Brad C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-20", "description": "Great pricing and it tasted like homemade Chinese, but better! The roast pork belly was really good and had a really crispy skin, definitely the best part. The roast duck was also delicious. We also had seafood tofu clay pot and the beef stew noodle. Everything hit the spot after a nice long walk. We'll be back when we're in town again!", "author": "Clifford M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-12", "description": "one of the most authentic Cantonese kitchen I've been so far.\nthis place (in terms of ambiance) is a real basic Hong Kong style hole in the wall eatery. \nso, the focus here is the food.\nI had the Herbal & Pig Liver Soup & Roast Duck and Roast Pork over Rice.\n\nif you don't speak any Cantonese, just pretend that you're a tourist somewhere in Hong Kong being stranded in alleyways somewhere in Mong Kok, Yau Ma Tei or Sam Shui Po.\n\nbig menu, generous portions, hearty and delicious.\nI really like this place. \n\nby the way, it's cash only.", "author": "Rudy H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-01-08", "description": "Yes, it's cheap, and the portion is huge and the food tastes okay but I tasted a lot of MSG in the food.  \n\nAlso, the restaurant needs to pay more attention to the cleanliness.  The table smelled like an old rag and it really made me lose my appetite.", "author": "Phyllis K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-30", "description": "I have been eating at this place since I was a child and it has never disappointed me. If you're looking for good portions, cheap price, and good food, this is the place to go. \n\nIf you're looking for a spacious and clean restaurant however, this is not the place to go. It is your typical hole in the wall (ish) Chinese restaurant where people come to eat and leave, but it's always busy so you know it's good.\n\nThe BBQ, wonton noodle soup, rice noodle soup, fried noodles... everything. Everything is good.", "author": "Lauren J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-09", "description": "Best roast pork I've ever had (better than Hong Kong too)\n\nSometimes I'll just look at pictures and reminisce about the good times when I had it\n\nThank you Kam Po", "author": "Vi T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-15", "description": "Big portion. Yummy Roasted Duck, Roasted pork, Soya source chicken, porridge. It is very delicious. The restaurant was so simple but the taste is equivalent or better that Hong Kong.", "author": "Natalee R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-24", "description": "Prices are great! Had a generous portion of roast pork, rice and cabbage for $6. When you eat there they also offer tea and soup.", "author": "Goldy C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-01", "description": "This is your Chinatown BBQ place, good BBQ, good portions, bad service. For large plate of rice and BBQ is $6, and everything else is reasonable. Another order of BBQ is $5 so you know. The BBQ is quiet good for the price, but don't expect gourmet fancy. It will get you full and keep you wallet full. The waitress seem very busy so don't expect getting your check quickly, just go up and hand it to them. It is also close to the Broadway tunnel so expect it to be noisier with the faster cars going through. Prepare to share a table and eat.", "author": "Tony C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-22", "description": "This a great place to eat traditional Chinese BBQ. I love to order the combo plate: half bbq pork and half roast duck rice plate. They give large portions of food for a low price. They've been around for at least 30 years serving the community, got to appreciate how they keep their prices low too!", "author": "lydia m."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-22", "description": "Ordered roast duck and rice to go ($7.50).  Service was fast.  Duck was absolutely delicious - just the right amount of saltiness and fat.  Rice was way more than enough.  \n\nI originally wanted 2 meats and rice but the man behind the counter didn't hear me well and I didn't bother to correct him once I saw how much duck I was getting and how good it looked.\n\nWill definitely be back!", "author": "Siv L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-14", "description": "HK style BBQ is a must for me when I hear of a place that does it right! \n\nMy boyfriend introduced me to this little gem tucked away in the corner of SF's Chinatown. I ordered the half and half roasted pork belly and roasted duck while my boyfriend had half and half roasted pork belly and char siu. \n\nEven though I was ordering in Cantonese, there was still some mix up in the orders. One of the waitress spoke extremely fast and gave us double the portion of meat rather than half and half. There was another waitress who was more patient and asked us if we wanted \"lai tong\" which is the free soup that usually comes with BBQ meals.\n\nThe soup came first. It was carrots and leafy greens in a clear pork bone broth. Even though the description isn't that appealing, I'd still encourage you to try it out! It's very light and clear tasting and the carrots add sweetness to it. \n\nI knew our roasted pork would be good the moment I saw it hanging near the butchering station. The pork skin was roasted to perfection and was extra crispy, and the flavor was consistent throughout the pieces of it! The pork belly was fatty enough for it to melt nicely with the rice. \n\nThe roasted duck was not bad, but I had better. My boyfriend didn't enjoy his char siu as much as he thought he would. Overall, the meal came out to be ~$20 for food enough for 2 meals (we both took our food home for another meal). Roasted pork belly was definitely the winner though!", "author": "Alice L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-12-21", "description": "This was my first time here, and I ordered the duck wonton soup and chicken fried rice. First off, probably the best sized portions for the price in the city. The fried rice was awesome, but the duck was cold and the soup was 3/4 rice noodles. I want to come back for another dish, because I really want to like this restaurant more than I do. My review is\nFlexible to be changed.", "author": "Ross S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-29", "description": "Extremely great value for money. Kam Po is slightly out of the way from the main street of Chinatown. I was there after the lunch rush, so no problem getting a seat.\n\nGot a two item combo- roast duck and bbq pork over rice $9. I was amazed at the portion. It was huge. Thankfully, i was hungry. You also get a complimentary bowl.of soup with your meal. definitely value for money.\n\nI asked for duck breast and lean pork- which was what I got. Bonus point. Taste wise, it was on the bland side. The duck wasn't crispy - the skin was soggy but the bbq pork had a nice flavor. The tiny hole  in the wall place also appeared to be clean. No greasy table, which is A++\n\nThey have a variety on the menu - wanton noodles,  claypot rice and stews, as well as stir fried noodles. Definitely give this place a try.", "author": "Reese D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-14", "description": "Old school Cantonese deli.  Portions are huge.  Not a lot of staff so be patient.  Had bbq pork, preserved egg and salted pork porridge and beef noodles.  BBQ prom was v fresh and tender.  Too bad there were burnt bits. Unpretentious and I'd definitely visit again.", "author": "Kam L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-08", "description": "Pure heaven. Delicious, authentic, cheap - Chinese BBQ at its best. The prices are so...1980s. I don't know how they can possibly find margin in a $6 rice plate with a healthy - wait, maybe UNhealthy - serving of meat, but they seem to have been in operation for a long time, and will no doubt continue to thrive. Good news for all of us! Nom nom nom.\n\nOh by the way, skip the soups. Not good at all. I may have just found their margin!", "author": "Kristen S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-03", "description": "If you want to dive into the Chinese culture and surroundings, you must come to Kam Po to eat. We first came here about 10 years ago and have been waiting for the day when we would come back to eat here. It is exactly as I remembered. \n\nIt's a little intimidating when you first walk in here. The customers are mostly local Chinese and a few others who have braved the parking and the streets to try out their food. Don't expect 5 star dining or service. This is a no frills place - you come in, sit down, order and eat. Cash only, by the way. \n\nWe stayed a total of 5 days here in San Francisco, and of all the places we've eaten, this is the one we talked about the most. We had their roast duck, roast pork, pork fried rice, shrimp fried rice, shrimp wonton soup, and their Chinese broccoli. Everything was delicious! For a party of 6, we only paid $57. Most, if not all of their dishes are $6-$8.\n\nAfter returning from our trip, we were craving Kam Po food, so we ordered from our go-to Chinese restaurant, and nothing comes close. I guess we're going to have to wait for another trip to SF for a visit!", "author": "Anna D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-18", "description": "Nice little roast duck and pork restaurant. Roast duck wonton egg noodle soup is grub. The garlic pea sprouts is really tasty. Roast pork is just average. It's a tiny place but service is fast. They only accept cash.", "author": "Andy V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-03", "description": "We walked a fair distance to grab a whole duck here. So glad we did! Line was out the door even at 5pm Christmas Day. We ended up getting the last duck hanging in the window. We felt bad for the few patrons behind us, but there was plenty of other good food available. The duck was amazing. The broth that comes with it was so full of flavor!!! It was the kind of place that looked like they hadn't changed a bit in all the years it's been open. Why mess with perfection?", "author": "Jennifer D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-10", "description": "While not to the same extent as other parts of the city (hello, Mission), Chinatown has seen its fair share of changes over the years.  Unfortunately (for me), it seems that a lot of those changes have involved the restaurants my relatives and I used to frequent.  Great Wall, Pacific Court Cafe...all gone.  Thank goodness Kam Po is still around though.  It's been a while since I've been back, but my first trip here was over 20 years and they're still going strong!\n\nStepping inside, Kam Po likely won't impress, save for the tasty looking rack of roasted pork, ducks, and chickens next to the counter (https://www.yelp.com/biz_photos/kam-po-kitchen-san-francisco?select=GOlu69zPbWbawS0Moe9L2g)  The place is somewhat small, the floors aren't exactly spic-and-span, and the tables have obvious signs of wear and tear.  However, the menu and, more importantly, the food do not disappoint.  The range of offerings may not amaze, but the quality, as well as the cheap prices, definitely stand out!\n\n-- HAINANESE CHICKEN WITH RICE...$5.55\n(https://www.yelp.com/biz_photos/kam-po-kitchen-san-francisco?select=IMKRS_R8gTerP666h8K6Vg)\nSuch a large portion for such a tiny price!  The chicken was meaty, tender, and moist and they certainly didn't skimp on the garlic sauce (poured on top rather than on a separate dish).  Plus, there was a lot of pickled vegetables too!  As good as everything was though, I wish the rice itself had a stronger taste of chicken and ginger to it.\n\n-- TWO BBQ ITEMS WITH RICE - Roast Duck and Roast Pork...$8.30\n(https://www.yelp.com/biz_photos/kam-po-kitchen-san-francisco?select=ZZTE_asvtu5sg-Ilq7tgzQ)\nCompared to my go-to for Chinese BBQ (Cheung Hing), Kam Po holds up pretty well!  While some of the skin could have been crispier, the cut of Roast Pork was fairly thick and didn't have a ton of fat on it.  As for the duck, it was just as good as what I had as a kid - very juicy, luscious, and oh so tender.  Plus, the sauce they pour on the meat and rice is so delicious!\n\nAdmittedly, had I been on the fence with how many stars to give, I likely would have been a little more generous simply because of all of the memories I have from coming here as a kid (it's been a family favorite ever since my grandfather had moved to Chinatown).  However, I can honestly say I didn't have to in this case.  Sure, I can see why some might not be as enthused as I am, but we've never had any problems here and the food (and value) more than warrant the four star rating.\n\nThanks, Kam Po, for the delicious comfort food and trip down memory.  Here's to you guys sticking around for another 20+ years!", "author": "Mike L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-12-29", "description": "Was really, and I mean REALLY, looking forward to roast duck. Expectations were high thanks the four stars this place has here on yelp and also cause the roast ducks hanging by the front window made it seem legit. \n\nWe ordered the roast duck wanton noodles ( turned out to be soup) and roast pork and rice. Soup and wanton were flavorful. I wish there were meatier pieces of duck. The bbq pork was all fat and scarce on meat. So all in all, ate a ton of carbs here. \n\nService was friendly hence the 3 stars. Also the noodles were pretty good tho not what I came for. And so the search for good roast duck continues.", "author": "Joanne N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-12", "description": "CASH ONLY. Don't go there without CASH. CASH ONLY CASH ONLY! I hate walking into restaurants to find out it's cash only, so I hope you read this before you go there. A total hole-in-the-wall gem, there's nothing foo-foo about it. We went there for the duck and the duck only. Okay...we ordered the green beans w/ garlic because we needed something green to make ourselves feel like we were eating somewhat healthy. Very tasty, the service is normal service in a place like that. Go and eat the duck!", "author": "Samantha G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-02-01", "description": "Been here a few times already for their roasted pork and Chinese BBQ pork, and it's really good! Possibly the best around Chinatown San Francisco. \n\nService is a whole another story, they are really rude, and be ready to be aggressive if you want to order something because the other Asians around will cut in line and not care even if you been waiting.  \n\nOverall long story short, service is horrible but good is great and price is decent. And also they only accept cash just like many other places in Chinatown.", "author": "Christopher G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-29", "description": "Depends on the day. Today I got 2 meats with rice: BBQ pork and some kind of chicken. I think I ended up choosing some sort of special chicken because it ended up being $11 (still, tons of food), but everything was great. The bbq pork was super crispy today and chicken was flavorful. \n\nThe last time I came the BBQ pork wasn't as crispy, so I think it really depends on the day/time you get there and if they pull it out fresh.", "author": "Michelle T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-28", "description": "It was our first time coming here, so our server helped us out a little bit. She immediately told us that they're famous for their duck. And that they're one of the cheapest restaurants in the city. So while I was in the bathroom, she somehow convinced my friends to order 5 dishes for the 3 of us. We had plenty of leftovers to take home but somehow those 5 dishes came out to only be $40 before tip. Incredible. I'm used to the food scenes in NY and DC, and the Chinese foods that I found there were not this cheap while tasting this good. \n\nIt is cash only, so be sure to bring some. It's also a small place, so it's better to come a little off the busy lunch and dinner times.", "author": "David K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-11-25", "description": "Appears to be an authentic Chinese restaurant. \n\nWe had the following for lunch:\n\nCentury egg porridge - 4 stars. I've been looking for hearty Cantonese 'zhok' for some time and this hit the spot. It was not too salty and the pork was seasoned just right. Real comfort food in cold weather. \n\nRoast duck rice - 3 stars. The roast duck was not bad although I think I've had better elsewhere in the city. \n\nRoast pork noodles - 2 stars. The roast pork had a thin smooth crust which wasn't what we were looking for. I guess we envisioned the dim sum roast pork version with the crackled skin. The noodles were very dry and the cabbage was unfortunately not well-cooked. \n\nI wanted to like this place since it came with a bit of hype but the roast meats did not live up to expectations for a roast meats restaurant. But portions were huge and very good value for money. I saw a neighbouring table having egg horfun and may try that next time. \n\nCash only.", "author": "Lindt C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-23", "description": "A traditional Cantonese / Hong Kong style restaurant in Chinatown. \nWe only ordered two items, and we couldn't finish everything.  The portions were HUGE.  One of the good things about small traditional cantonese restaurants is they always give you a bowl of complimentary soup. \n\nNote - if you are looking for a clean and comfortable place for dinner, this place probably is not for you.  \n\n1- shrimp with veggies - the gravy was just okay.  BUT the portion was huge, it had good amount of shrimp and veggies.  I wanted to have a lot vegetables, so it worked out for me. \n2- Two BBQ items over rice -  the roasted pork and duck were so delicious. I don't mind eating this dish everyday.", "author": "Rachael C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-06", "description": "Like all things prices goes up but this place still offers one of the best chinese bbq in town at a reasonable price. Remember this is a place to get fed for a cheap price so don't expect fancy surroundings or service. My usual is a big plate of roast duck and crispy roast pork over rice for $8.30. Easily good for two people. Beef Chow Fun was $5.95 which usually goes for 8 to 11 bucks elsewhere.  Remember old people and blue collar workers are indicating of good plentiful food at a very reasonable price.", "author": "Laurence C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-19", "description": "This place is how San Francisco use to do it! A local no frills cash only Chinese place with reasonable prices and good portions. I had wonton noodle soup for $4.25. And I was reasonably full afterwards. Where can you get a meal in San Francisco for less than 4.50? Granted there is virtually no service,decor, or hipsters around but this was fine for me. I've been looking for a place where I can get decent meal for under 10 bucks and I finally found it. I'm not saying the food was life-changing-but it was wonderful for the price point. And this certainly a place that I will be back.", "author": "Robert C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-09-02", "description": "Not a hygienic dining experience as they scored below 90 on healthy inspection.  We stopped in here for a quick lunch which it is not. They only have 2 waitresses and the place was packed. We had to wait for the menu and to order. The portions are generous but the food isn't the best quality. Truly can be described as a greasy spoon. Certainly our noodle dish was ful of oil. My water cup was dirty so I went without liquids with my meal because you can't find a waitress. My roast pork didn't taste fresh.  Hubby even sad he wouldn't return.", "author": "Ry T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-06", "description": "This restaurant is the real definition of a hole in the wall. It looks run down, there's no huge sign that grabs your attention, the tables look shabby, and yet... there's the amazing prices, the feels-like-home comfort food, and unpretentious eating!\n\nLocated in Chinatown, don't expect great customer service or amazing English. It's not that they're rude or anything, but servers will definitely cater to Chinese-speaking customers first and will give them faster service!\n\nYour meal starts with a complementary chicken and vegetable soup. It's very simple, designed to warm your stomach and clean your palate while eating. The menu is a bit overwhelming? There are so many different rice plates, soups, noodles that all I can say is... just pick what your heart desires and you'll probably enjoy it LOL. Prices are very CHEAP. I would say most items are ballpark $5-$8 and the portions you get are worth like twice the amount of food you paid for. Go here if you're trying to get the bang for your buck!\n\nTIP: portions are large so order a rice dish if you want to take it to go. Otherwise, share the noodles with someone because it gets pretty soggy and oily. Definitely not something you would want to take home if you can't finish it.", "author": "Lizzie P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-01-19", "description": "Definitely can't beat a $4 bowl of shrimp wonton noodle soup for lunch on a cold rainy day.  The wontons were near perfect and the portion was plentiful.   Noodles were cooked perfectly and have that \"al dente\" crunch that is the epicenter of great wonton noodles.  The broth was flavorful, but not quite the best I've ever had.  Though the waitress had limited English for dine-in, she was really nice.", "author": "Patricia N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-09", "description": "Super big portion. I got rice with Char siu, but can't finish it. Would love to try beef one in summer.", "author": "Raydolph Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-18", "description": "This is the taste of HK I've been searching for...\nI must admit, food in SF is much more authentic old HK style compared to LA. But this place has really exceeded my expectation!!! Large portion too. The server with the mullet has the service of fine dining restaurant to my surprise. I give it 5 stars and 4 thumbs up!! (2 from my husband)", "author": "Gigi K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-12-18", "description": "Disappointed.\n\nThis is truly a great place for a fast bite if you order anything from the window... but if you get something fancy like the clay pot or even the noodles, make sure you have over 45 minutes to wait!\n\nThe food was just alright. It didn't have that wow factor I was really hoping and even borderline expecting from a local Chinatown joint. We ordered the duck, the pork, the clay pot. The duck noodles were pretty good but the duck was mostly fat and the skin was not crispy. The pork was practically chewy and drenched in watery sauce. The clay pot took over 45 minutes and was undercooked... I feel bad taking my parents there ON VACATION!\n\nThe service was like any Asian restaurant and the cleanliness likewise.", "author": "Linda S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-12", "description": "Kam po kitchen may look a bit rundown on the outside (and inside.) but the food is quite good and decently priced. A group of 8 of us were originally planning on eating at Lai Hong Lounge, but after we found out the wait was over an hour, no one wanted to wait. Kam Po Kitchen is conveniently located a block away! \n\nThey serve a variety of authentic cantonese dishes with large portions and reasonable prices. Although a bit on the oily side, I like their huge menu. They have everything including but not limited to: jook (porridge), many different types of noodles, clay pots, clay pots with rice, duck, chicken, pork, whatever you can think of they probably have it! :) \n\nA great place for lunch. I'm pretty sure they take card but don't quote me on that.", "author": "Annie Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-19", "description": "Kam Po Kitchen is famous for their Hong Kong foods. Their chicken and ducks are juicy and delicious. I always come in to get their beef and egg rice. Their egg is so smooth when you mix it with the rice. \n\n1 word. Delicious!", "author": "Andy L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-31", "description": "Like being stuck in a 90s time warp in the best way possible. Huge portions, amazing food. This place reminded my parents of the kind of food they used to eat when they first came to America, both in quality and in price. They don't have many Chinese restaurants like this any more.", "author": "Danielle Q."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-13", "description": "Authentic BBQ pork place in the outskirts of Chinatown, tender juicy and fatty cha siu on rice for only $4.99, generous portions\nAlso got the egg shrimp rice noodle which was just as good at $5.99\nCan't beat the price and quality here for awesome authentic Cantonese food just like back in the old days in Hong Kong", "author": "Arcadian B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-28", "description": "My husband and I came here after seeing all the great Yelp reviews and it didn't disappoint. We got in around 3pm and it wasn't packed, but wasn't empty. Service was a little slow, but we weren't in a rush after walking up from Union Square. A nice leisurely late lunch was what we wanted. Portions were super big, which made sense why it was all families and groups besides us. This is the only congee I've ever had that tastes like my Aunt's arroz caldo. It would be exactly like my Aunts if I could still see full rice kernels and if the skin was still on the chicken. Be careful when you order roast pork, it is the crunchy lechon style pork hanging by the counter, not the BBQ style pork in the front window. That is what they call BBQ pork. I ordered the roast duck noodle soup, which came as expected. I wasn't a big fan of the dumplings, but the duck, broth, and noodles more than made up for that. We had so much food leftover, we decided to take it home for dinner. Great value and super good.", "author": "Mabel J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-17", "description": "Wow very very good food. This is extrmly traditional so if you are looking for Americanized this is not it. But if you want to feel transported to China go experience the best Chinese food I have ever had!!!!", "author": "Sarah W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-07", "description": "Kam Po doesn't have the most exciting interior and decor but makes up for it by having food that doesn't suck. It's a small restaurant giving you an intimate setting and a view of all the meat hanging from hooks and being chopped.\nThe menu is too big, sometimes it's bad having too many options. You can try to narrow it down to what you want like porridge, noodle dishes, rice dishes, bbq meats etc or go with some of their more exotic options like duck feet dishes.\nFood here is fairly good overall and the prices are so affordable. The food here is so varied and prices are so cheap that you can come here frequently without having second thoughts.\nBTW, the lady may pick your dish for you if you seem unsure about what you want.", "author": "Roman S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-02", "description": "Boss lady does not play here, you better know what you want before sitting down.  We don't even ask for menus anymore, ain't nobody got time for that!  Been coming here the last two decades since they opened.  My uncle said they remodeled the interior last year, still looks the same to me.  We order the usual roast duck/BBQ pork rice plates, and boss lady hustles over with a pot of tea on our table and voila!  Often times, there's also soup on the house.  Within minutes, plates of food arrives, and everyone digs in as if we've been famished for weeks. \n\nI've also seen her chop up the meats for take-out; she does it all I tell ya!  The chefs are inside cooking and wrestling with gigantic woks, ensuring your food comes out super hot & fresh.  Watch out Martin Yan j/k lol.  This place is definitely a hole-in-the-wall if you want some awesome Chinese food.  Not only is it cheap, you can feed the entire family and still bring leftovers home for lunch the next day.  Everyone goes home happy with a fuller tummy.\n\nP.S.  If you order any clay pots, order immediately, as they take longer than roast duck or any other rice/noodle/vegetable dish.", "author": "Christine R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-09", "description": "Wow!  I have come here four to five time now and am never disappointed.  I usually get the roast duck and crispy pork over rice, which comes with a bit of cabbage.  The portion sizes are insanely large!  For 9 dollars, the amount of food i got could legitimately feed a family of four.  Not an exaggeration.  I felt like I got 3-4 pounds worth of total food.  The meat is really tasty, and the sauce the butcher pours over everything is very savory.\n\nThe butcher is a really legit looking Cantonese guy that wields his massive blade with great efficiency while appearing lackadaisical and chatting up the locals. Pretty cool local feel inside.  Not many tourists/non-locals to be found.", "author": "Patrick J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-12-13", "description": "Mediorce chinese food.\n That tasted bland nothing specail.\nFriend told me it was his favorite resturaunt, I was not impressed at all.\n\nSorry William!!!", "author": "Anthony M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-28", "description": "Holiest hole in the wall. Makes me think of Macau. They only take cash. The noodles are fresh and homemade. I ordered the roasted duck wonton soup. The wonton was decent but not to my liking. The duck was generous and flavorful. There were pieces of cabbage in it. They ran out of chicken feet which made me sad. I also got the BBQ duck and pork over rice. The portion was insanely huge. It was a ton of food for such a small small price. The food tastes as good as Macau-so incredibly authentic and delicious. I will have to come back and bring the whole gang.", "author": "Elle R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-16", "description": "One of the best Chinese food I ever have. Hand down for the grilled duck. Add a fried agg then you meal will.be perfect! !\nGenerous portion and friendly service. \nAlso the taste was authentic! \nHighly recommend and definitely come back!", "author": "Sea P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-04", "description": "Chinatown and SF in general is undergoing a major construction boom, as a result many moms and pops businesses like this one are either going out, or are changing their business model.  This is one of the last of the dying breed, in terms of good quality Cantonese/Chinese food in Chinatown.  They do a good job on Cantonese rotisserie.  Most items are under $10.  When I come though I like to ball out a little bit, so I get the rotisserie combo rice plate, but instead of regular chicken I ask for free range, and instead of regular roast pork I ask for the belly ribs, the best part of the roast pig.  This sets you back $13, but it's enough food for two people, and pretty delicious.  If you haven't done this place do it soon, like I said they're quickly dying out!", "author": "Jackson Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-19", "description": "The bbq pork is still the way to go. I know their roast pork is supposed to be famous but at Saturday lunchtime it was not great - dry meat, hard skin (not crispy hard, but hard hard). The wonton soup with roast duck was okay. Good wontons. Okay roast duck.", "author": "Jean K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-22", "description": "Ahhh Kam Po, a childhood favorite from my Chinatown days. I used to come here all the time as a kid, even after dentist appointments. I'd be numb from Novocaine yet I'd still shovel roasted duck and rice into my face. In  my opinion, it is still one of the best Cantonese roasties shops in SF. \n\nIt's cheap. Ca$h only. It's small. It's a dirty hole in the wall. If there's a line, it moves quickly. Helps immensely if you speak Cantonese, but if not the waitress usually can figure out what you want or need. \n\nAlthough I grew up with the roasted duck and rice, I've grown to love roasted duck over lo mein. The sauce from the duck mixed into the cabbage and noodles just does it for me. Salty, a little sweet, fatty, umami goodness. I also really like the complimentary bowl of MSG soup they give you. Yea, I call it MSG soup. My folks have called it that since I was a kid and to be honest, that's pretty much what it is. \n\nI was recently able to take 2 friends here and they thoroughly enjoyed it as much as I always have. Glad to have others enjoy a childhood favorite.", "author": "Susy C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-02", "description": "The food: OH MY GOD THIS IS THE BEST CHINESE FOOD I'VE EVER HAD. My boyfriend (who's Chinese) says it's \"delicious\", and he's usually pretty picky about what he deems good authentic Chinese food. You HAVE to try the duck. It's juicy, tender, and the skin just melts in your mouth.\n\nThe place: When eating in Chinatown, you need to have expectations of how the seating and restaurant will be. The meat is hung sizzling and gleaming behind the windows, and don't worry, there aren't any flies or bugs swarming around. The meat is only in the window a short while before being pulled down for an order. \n\nThere's plenty of seats but it is a small place and the tables do feel crowded. I'd suggest ordering to-go and enjoying your food in the comfort of your home or hotel room. The service is fast and friendly.", "author": "Jayme D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-09", "description": "Flip to the back page and order one of the rice dishes. For the extremely fair prices (mostly $5.10), the portions are gigantic. I love the roast duck on rice, which comes with some cabbage and an entire plate of rice. You really can't go wrong with any of the bbq options. If you stay to eat, you get soup as well.\n\nService is very quick whether you take to go or eat in, though there is often a lineup at the front for togo orders, don't make the mistake of trying to order it without waiting in line. If you go in to eat by yourself, expect to share a table. If you are seated near the take out counter, expect customers to be temporarily putting their belongings on your table trying to recollect themselves before they leave to head out, because the restaurant is quite crowded and there really isn't anywhere else to do that.\n\nThe wait staff are busy so the best tactic is to put the money on the table so it's ready to go for the bill. Sometimes if they recognize you, they don't even bring you a menu, probably assuming you know what you want, so you have to be ready for that too. \n\nOf course the service isn't that great and the interior isn't the cleanest - what do you expect from a Chinese restaurant with such reasonable prices? I love coming here for quick 20min meals.", "author": "Elisa L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-01", "description": "As far as I can tell, the roast duck I got at Kam Po was a faithful interpretation of the duck dish iterated upon and canonized several centuries ago in China. In other words, it was hella good.\n\nSF is blessed with many a cheap and tasty restaurant - but Kam Po edges out the competition with borderline uncompetitive prices and non-soul-crushing wait times. \n\nMore and more people are starting to flock to this restaurant and its giant, glistening pieces of poultry hanging by the window. Regardless, I'll be back for more of that dank duck meat.", "author": "Dian J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-28", "description": "Don't simply judge on their decoration because you would be amazed by the food quality-everything is so good!!!! Just a tip: the noodles are a bit dull. Not as good as their rice.", "author": "Annabelle L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-03", "description": "CASH ONLY\n\nThis is one of my favorite spots for cheap Chinese food! Don't expect anything fancy or the service to be overly friendly and attentive. Yes the server throws menus at you when you sit and you might have to flag them down if you want something but it's all part of the local Chinatown experience. It's more about good cheap food in large quantities.\n\nOrdered the porridge with preserved egg ($3.50). It was served in a massive bowl and was enough for 2 people by itself. Personally I LOVE this dish. It feels so homey and filling. I took my friend who had never had preserved egg before and he really didn't like it so it's definitely an acquired taste.\n\nOrdered the roast duck in wonton noodle soup ($7) but unfortunately 10 minutes into making it they told me they didn't have roast duck anymore and asked if roast pork was fine. It wasn't really the best alternative but it was still good too. The soup broth and wontons really made up for it. You get this giant bowl enough for 2 people on its own!\n\nOverall go for the food and prices not the service.", "author": "Linda X."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-01", "description": "This is my go to spot for crispy BBQ pork and roast duck. They do roast duck extremely well. The bites are juicy and tender and never seems to get dry. It looks like they pour some sauce or oil over it to make it even more moist. \n\nDon't expect service to be anything great. They get you the food and that's all that matters.", "author": "Victor N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-04", "description": "This corner joint brought me straight back to memories of delicious Catonese food in my grandma's kitchen. The smells, the food, the service was exactly what I needed to combat my homesickness from Vancouver for a good hour. \n\nWith dishes at $5.95, the experience is what you'd expect - NO FRILLS, JUST GOOD FOOD. \n\nNote: CASH ONLY. \n\nFood: \n1. Tomato beef chow mein: 3/5\n- Not as good as the one at Sam Po and it was a little too greasy. \n2. Lettuce and fish ball soup: 4/5 \n- The flavor was on point and the fish balls were yummy. \n3. Duck chow main: 4/5\n- The duck was so good!! Slid right off the bone and had wonderful flavor.", "author": "Emma W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-21", "description": "Came by to grab some roasties the other day. I think this joint is considered more North Beach than Chinatown! ...if the walk is too far from any of the Chinatown garages/streets, just grab a ride from a rideshare! (Uber/Lyft)\n\nDespite a queue at the door, the line moved quickly. Ducks are now priced by size with varying prices depending on the qualitative size... The \"Large\" duck is now ~$22...not sure how they would define a \"Large\" vs. \"Small\" duck... \n\nThe duck was surprisingly very meaty, juicy and flavorful despite being rather pricey!\n\nThe BBQ Pork was decent, especially at $5.75/lb.\n\n...notice how they don't use the register to enter sales, and don't fully close the till... I wonder if they pay tax?!?", "author": "Derek S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-07-17", "description": "It is cheap for sure but you get what you pay for.  Food was okay but cheap.  We got salt and pepper prawns, roast duck, cod with Chinese broccoli, American broccoli with garlic sauce and bbq pork fried rice.  \n\nDuck was greasy and unimpressive.  Waitress tried to push the half duck.  Thank god I didn't get it.    Prawns was tasty but overly oily.   Same with fish.  Western broccoli and fried rice was decent. \n\nI give it 3 stars for the price and speed of service.   Won't be back any time soon and definitely not for dinner again.  \n\n\nPlace feels not clean and there is no service to discuss - typical Chinese fast food service.", "author": "Lei H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-03", "description": "The restaurant is small and crowded, so we decided to order take away and find a good view to enjoy our lunch. The price is super cheap! I ordered roasted duck, char siew and roasted pork with rice, only USD 15, and that's totally can feed 3-4 pax!", "author": "Caster T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-10", "description": "Fairly cheap. Big portions. Quick service! Always packed! So not really great for big groups unless you're willing to wait..\n\nCame in today with my family (party of 10) around 2:30pm and there were no tables open so we waited a good 20-25 minutes before a table opened up. The staff was very nice and quick to let us know it'll be a while until we were seated which was no problem because only half of us were there first. \n--Minus 1 star for all the people who came in after us and seated themselves at random tables instead of waiting to be seated.--\nBy the time the rest of the party was there it only took us about 5 more minutes until we were seated.\n\nOnto the food... We decided to do family style dinner, so we ordered wonton soup, seafood tofu soup, salted fish fried rice, pan fried house noodles, beef chow fun, roasted pork belly, Garlic Chinese broccoli, garlic water spinach and fish with sweet corn over rice, all to share amongst each other. Everything was really good and our tummies were satisfied! The dish that stood out the most to me was the fish w sweet corn! It sounded weird at first, but don't knock it til you try it!\n\nObviously, since they sell fresh af Chinese bbq in store as well, we had to buy some to bring home for family dinner! Sadly they didn't have oxtail.. But we ordered roast duck, roast pork, bbq pork, pork intestines, chicken feet, &soy sauce chicken. When we got home tonight, we had a feast! Ate all that with side of baguettes & soy sauce, Vietnamese style! \n\nThis is always my family's go to lunch spot when we're in Chinatown SF. We'll be back soon!", "author": "Lihz P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-24", "description": "Real authentic Chinese restaurant. Cheap price but the food is really good. I would say to try it out and make sure to bring cash cause they don't accept creditcarfs", "author": "Reyzell M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-02", "description": "Really good Chinese BBQ (char siu, roast park, roast duck). Their other dishes are really good too and very reasonably priced. Highly recommended!", "author": "howie f."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-19", "description": "Yes, the ambiance is less than stellar.  Yes, the service is not friendly or smiley, but I'm not paying $5.50 for a HUGE order of house chowmein with shrimp, bbq pork, chicken, probably some beef, bok choi, mushrooms and onions for the ambiance or service.\n\nThe food is awesome.  If you like noodles, you will like this place.  If you don't like noodles, stop reading my review, I don't really want to help you out.  If you like noodles but you just aren't in the mood for noodles, that's cool, you may continue reading.\n\nThe meat is pretty good quality and fresh.  There is a butcher knife wielding tactician working every type of meat you can imagine that is hanging from the various meat hooks.  He has a weird mole on his face with a few 7 inch hairs growing from them.  It looks gross, but in Chinese it is good luck.  Again, I'm there for the food, not for what people look like.\n\nThe portions are big here.  The value is amazing.  If there is a line to eat there, don't worry, tables turn over fast.  Do not go in with an expectation of great service.  It is usually tough to find courteous service in chinese restaurants, especially casual ones, and especially in chinatown.  I do not mean any of this in a racist way.  I'm just trying to prepare your expectations, so you don't get bent out of shape after your visit.\n\nDo not take a first date here, it is not romantic.\n\nEverything on the menu looks good.  Give them a try.\n\nCash only.", "author": "Ty C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-17", "description": "Classic Chinatown! I didn't know places like this still existed! (Certainly not that I've seen Seattle). Everything on the menu is ~ $7 or less. Cash only. Giant portions. They speak Canto. There's hanging roast meats (duck & pork) in the window. So many soup noodles. \n\nCame here for dinner seeking some roast duck. We left stuffed with duck, noodles, bitter melon, BBQ pork (char siu), wontons... The roast duck over rice is a good deal. Not only does it feel like you're served half a duck, but it's also really tasty! The flavor seemed pretty great and the meat was juicy.  The skin wasn't super crisp and on the fattier side, but I kinda like it that way. You can also get the roast duck in a bowl of won ton noodles - you get a lot of duck and wonton dumplings, but the skin isn't crispy.. the addition of won ton dumplings (they're just ok, a little starchy and dense) isn't worth soggy duck.  \n\nChar siu (BBQ pork) was definitely homemade and not cloyingly sweet - which I really appreciated. It also isn't bright red like you might find at other restaurants. What you end up with is a natural looking savory BBQ pork, with a hint of sweetness. It's also a bit fatty. Yum!\n\nVeggies - the garlic green beans aren't as garlicky or salty or fried as other places, but it's a simple dish. It's still a bit oily, so I don't know if you actually feel healthier for eating these vegs.  The bitter melon was pretty good though - if you enjoy bitter melon. I found it pretty mild and simply seasoned here.", "author": "Lydia N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-11", "description": "To me, Kam Po is exactly what you would expect in any Chinatown. It's a bit off the beaten path, and seemed to house more locals than tourists (aka me). When we entered at 2 for a late lunch, there were no tables available, which made me really excited. Secondly, the staff spoke minimal English, so it seemed more authentic than American. Lastly, like the Chinatown visits of my childhood, roast duck and pork hung in the window and there was a cook with his large cleaver slicing them on his wood stump. All of these things just made me break out into a gigantic grin. \n\nAfter a bit of a wait and some awkward waving/eye contact attempts, we were seated crammed in a small table. I opted for the beef tendon noodle soup, and my friend went with the duck noodle soup. We ordered a side of crispy roast pork, because he had never tried it before and I was curious if it was as good as the one my grandmother used to make or ones I have eaten out at restaurants throughout life. The pork, I was disappointed. I think they served us some that had been previously cut, so the meat was a little dry and it was cold-ish. The skin was oily but not very crispy, lacking the crackle I love so much. Redemption came in the form of noodles, as we both enjoyed the dishes they brought out. My friend, unaccustomed to Chinese noodle soups, was surprised to see how bland the broth was in comparison to say pho or ramen. I agreed, but this is the style of the Chinese and what I grew up with, so I still love it dearly along with pho and ramen!\n\nOverall, this is a great place simple place to either dine in or carry out. The meat hanging in the window is chopped for you and weighed per pound, so you can come and try all the varieties of pork, chicken, and duck that your heart desires to go. I especially liked their selections of egg and rice noodle soups with meat.", "author": "Lianna N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-04", "description": "Perfect hole-in-the-wall HKG style BBQ place. Cheap, quick, and tasty Hong Kong style BBQ : roast pork, BBQ pork, roast duck, etc. Cash only and probably not the cleanest place but tasty and cheap.", "author": "Aaron H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-03-24", "description": "I was in the neighborhood and saw the good reviews, so I checked out the place and I was very disappointed. \nThe place is very crowded and everyone is loud. The staff are far from friendly, and one lady with short dark hair kept screaming at customers and other staff. Also the chefs didn't wear gloves and they'd touch people's cash and the food again without washing their hands. I had to wait for a very very long time to get my food. I ordered the roast duck and pork with rice which was pretty horrible. The duck was oily and mostly skin and bones. To top it all, the restroom was absolutely disgusting.", "author": "Sydney X."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-15", "description": "They are still the cheapest, best with big portions.  The guy next to us had a meal with rice, soup, bittermelon and chicken for 6.00 including tax.  Our meal total was 14.00 for 2 and leftovers for another meal.  Go figure.  We had wonton, noodle, and beef tender tendons and bittermelon with black bean sauce beef and chow fun.  Yes this place is cramped and tsbles are a bit greasy.  But it is an experience.  You get served quickly, you eat, and you don't lounge around.  So much to eat but so little room in the tummy. The duck looked good.", "author": "Helen L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-05-05", "description": "Meh -- I guess it gets the job done when you're craving meat but I've definitely had better and fresher in NYC. I ordered the BBQ pork and roast duck. The pork was too tough and really lacking that glistening sweet glaze that makes BBQ pork really outstanding. I also think they microwaved my dish but I was too hungry to complain.\n\nThe duck was better but still not as tender as I'd like it to be. Their complimentary soup was really good though.\n\nCheap and filling - $10 + tip for a lot of meat -- and I really was craving meat. But I don't think I would come back. \n\nCASH only.", "author": "Cindy W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-30", "description": "Came here on a Sunday at noon and it was packed, but the turnover is so fast that it took about 15 mins to get seated even with a few parties in front of us. \n\nI was after the delicious duck/wonton noodles. Extremely generous servings of duck, I expected like 4 pieces for the price, but they gave almost more than I could eat! At least 8 pieces.\n\nThe surprise of the day though was the $3 porridge. We ordered 2 bowls, thinking it would be personal sized bowls at $3... but turned out to be LARGE bowls, the size of the noodle bowls! We took almost all of this home because that one porridge bowl serves about 8 personal sized bowls of porridge! Amazing!!! Talk about great value. \n\nAlso the da dou miao (veggies) was cooked nice and garlicky. We didn't really order it, the waiter forcefully recommended/ordered it for us, and we were too noob to decline. But in the end I'm glad we didn't.", "author": "Amanda C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-22", "description": "Originally we were going to China town for some good Cantonese dim sum, however, the waiting time was almost an hour. With my hungry stomach, we decided to walk across street to give that corner restaurant a try. Obviously, they were very busy during their lunch hour. They have the counter for barbecue pork and duck. It looks so fresh and good. We had been waiting about twenty minutes to be seated, and steated with sharing a table with other customers. \n-environment: old table, old tableware. The wall was dirty, they might need some cleaning and paint\n-service: waitress were nice but rush, you'd better decide what you want quick. \n-food: their barbecue duck was very good and flavorful. You can choose the meat you want from the duck. We like the duck leg, and they were generous on the meat portion. We had a clay pot of oysters with barbecue pork, it's a good amount of portion and it was very yummy. The spicy ong choi was well cooked. And their won ton noodles was ok, the noodles texture was not the Cantonese type of noodles. That was a very Cantonese style lunch for us, and we enjoyed them a lot. \nThe price was cheap, you cannot find another Cantonese restaurant as cheap as this one, plus their food was good too. Happy tummy.", "author": "Karmen S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-29", "description": "The owners are really nice and the food is good. I used to come here pretty much everytime I'm hungry and in CT.", "author": "Yvonne Y."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-11-07", "description": "The head cook ( the tall guy with a hairy mole on his face) at the restaurant cheated me. Bought cooked  lamb stew and the scale clearly said $7.29. He charged me $8.00 telling another customer in Chinese that he charged me $8.00 instead of $7.29. He thought I thought I don't understand Chinese.", "author": "Mary W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-23", "description": "This is probably one of my favorite comfort food places to eat in SF. It's one of the few HK style cafe/restaurants that I know and trust in SF. \n\nI'm going to forewarn you right now, this is place isn't the cleanest. The service is meh but the food is good. \n\nI always order the BBQ Pork with rice and it's so good. The panfried noodles with chicken are also good. The prices are a steal and if you eat there, they give you the house soup on the house. (ha) \n\nIt's a local place where they try to move a lot of people so if you're a table of one or two don't be surprised if you have to share a table. \n\nIf you're looking for some noodles, meat over rice, or some won ton noodle, I highly recommend this place but don't expect five-star service. (She's always nice to me :) )", "author": "Stephanie W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-01-03", "description": "Torn between 3 and 4 stars - main thing keeping me back from 4 stars is the greasiness of the food.  I've been to Kam Po twice - first time was several years ago.  All I could remember from that visit was how greasy the food was.  Decided to give it another shot - and yep, the food is still fairly greasy.  Any hoot, more on that later.\n\nKam Po is located on one edge of Chinatown, not too far away from the main drag.  Definitely a hole in the wall, and you'll see a good handful of locals coming in and out to pick up some of their BBQ meat items to go.  Seating space is OK - they have enough room for perhaps 8 or 9 parties.  Yes, their selling point is authentic Chinese cuisine and cheap prices.  Rummaging through the menu, you'll see items in the $4.xx to $6.xx range.  We picked up 3 entrees - beef noodle soup ($4.65), chow fun ($5.10), and roast duck lo mein ($6.00).  Our total including tax  and tip was about $20 and our party of 3 left pretty full.  \n\nI would say the portion sizes are about average for a Chinese place.  I was a little disappointed with the noodle soup - amount of noodles wasn't huge (hence, for a party of 3, each person got a small amount of noodles).  The soup tasted OK, but I thought it was odd that the soup was a little on the greasy side as well.  I like my soups to be hot and comforting - not to leave me feeling like I wouldn't need to use any Chapstick for the rest of the day.  Chow fun was also a tad more oily compared to other places - I know it's normally greasy, but Kam Po seems to like to take it up a notch.  Lo Mein was pretty OK - noodles weren't hugely flavorful, but they put in a decent amount of roasted duck (meaty portions, not just bones).  \n\nService - well, pretty standard for Chinese eatery.  Cleanliness was also on par with your other Asian spots.  \n\nOverall, if you like cheap Chinese food, this is the place.  If you don't like greasy food, this isn't the place.  I wouldn't mind stopping by here again since it's a great place to go if you're on a budget.", "author": "Laura C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-26", "description": "This place is always packed so I had to try it out. Especially when you live nearby and walk by it everyday.\n\nWhole Peking Duck (roast duck) costs $18. Their prices have gone up since the old yelp reviews. \n\nPicked this up for my family on Xmas Day and they said it was the best Peking Duck they have ever eatin.", "author": "Joy M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-01-11", "description": "Wait Time: 5-10 Minutes for a BBQ dish to go. Can't speak for other dishes. \n\nUnique Factor: 1/5 - Quick, Simple, Classic Hong Kong/Cantonese comfort food. \n\nService: Chinatown service - you get your food and that's about it. Depends on their mood, sometimes you hear the bald \"butcher/chef\" saying degrading things (if you understand Chinese) to his possibly wife, who works as the waitress.", "author": "Vivian Y."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-07-06", "description": "I came here KNOWING that the service was shitty. I was prepared for that. But I didn't know it was THAT shitty. \n\nI was craving rice porridge in the morning and this was one of the only places that was decent enough on yelp. Despite all the warnings, I came here anyway (worse decision of the day). It was around 8:45 on a Monday morning. I walked into the restaurant and no one was there, it looked like they were still setting up.. which was strange because I thought they weren't opened yet (even though on yelp it said open at 8am)\n\nWhatever. someone finally came out from the back, the chef? literally just stared at me then continue doing what he was doing, when he finished he handed me a menu then went to the back again for a good 5 minute. Leaving me in the front. After some awkward waiting time, I finally manage to order what I needed to order, got my food, then left. \n\nMy ride porridge was good. I liked it. But it doesn't matter how great the food was, it still didn't justify the crappy service. \n\nThere are a ton of restaurants in Chinatown, we'll survive without this one.", "author": "Yen P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-18", "description": "In a city nearly defined in its culinary circles for the endless array of choices when it comes to inexpensive, very good Chinese food, Kam Po Kitchen deserves to be mentioned in this conversation. \n\nDingy hole-in-the-wall restaurants throughout Chinatown, the Richmond and Sunset districts that specialize in Cantonese cuisine seem to be synonymous for authentic, cheap, very tasty Chinese food in generous portions.\n\nChief among my Cantonese favorite dishes are the Char Siu (roasted or barbecued meats) that always consists of duck, chicken and pork. Other popular dishes include chow mein and chow fun, lo mein, congee (rice porridge), wonton noodle soup with a variety of meats and soups that usually includes lettuce and some type of meat, meat and vegetable rice plates and seasonal vegetables.\n\nKam Po Kitchen had a pretty comprehensive menu list and is known for preparing most of these traditional and uniquely flavored dishes exceptionally well, including what many say are some of the best Chinese noodle soup in the city.\n\nWe reluctantly chose lighter dishes this evening because of our prior dinner reservation at Tony's Pizza Napoletana just a block away and dropped in looking for something to tie us down until then.\n\nThe noodle soup dishes, we figured, were a must-try and not too heavy. A friend also ordered a plate of steamed offals that we could share.\n\nThe mixed innards (offal), $3.95, were a good mix of steamed pig ears, intestines, stomach, gizzards and liver sparsely layered with a soy sauce and sesame oil mix. It was a rich and uniquely flavored, traditional dish that made for a great starter or appetizer.\n\nThe beef tendon noodle soup, $3.75, was a very good choice because they use the peripheral parts of the tendon which carried bits of flesh and fat, giving it a real beefy flavor and a meaty depth. The stringy egg noodles went perfectly with the hearty chunks of tendon and really soaked up the flavor of the delicately seasoned beef broth.\n\nThe shrimp wonton noodle soup, $3.25, had great texture and good flavor in its ingredients and nearly met my high standards for this dish. The gumdrop shaped, succulent shrimp wontons were made with whole shrimp and complemented with a mild soup broth and tasty wide rice noodles that were velvety soft and luxuriously smooth. The broth could have had more flavor. Otherwise, it would have been prepared to perfection.\n\nMost dishes fall under $5. I hope to return and try their Char Siu that they are widely known for to gain a broader perspective on the food here. Upon my one visit, I felt fairly certain Kam Po ranks among the best Cantonese style noodle soup restaurants I have tried. Their shrimp wonton noodle soup, in particular, is worth repeated visits here.", "author": "Andrew K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-08", "description": "This is the place for great bbq pork and duck! I was in the mood for some fatty pork and this place delivered the goods! Simple yet so flavorful especially with a little rice. I'll be back!", "author": "Nate E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-02", "description": "Came in around 6PM on a Thursday. They still had plenty of roast duck, chickens, char siu, roast pork, octopus and all those BBQ foods. However, hot foods were running low by this time. It contained very few choices. Therefore, I got half the guay fay chicken and one pound of octopus.\n\n Guay fay chicken meat was not at all rough, it was indeed very smooth and very tasty. Didn't even need the oily ginger sauce that I almost always use for my chickens because of the blandness. But this was one of the times that I don't need to dip the chicken in the ginger dip and can still manage to eat the white meat parts. \n\nOctopus, to me, was average. Nothing special. Nothing horrible. However it was definitely fresh. Also, I think this place is the only place in chinatown that sells octopus. Be sure to stop here if your in chinatown and want some octopus(:", "author": "Wendy T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-15", "description": "$7 for a bowl of bbq pork and shrimp wonton with noodles wins me over. Portions are generous. Expect dirty hole in the wall noodle shop that will fill your happy tummy and you will not be disappointed.", "author": "Richman L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-29", "description": "Good stuff! I ordered the Soy Sauce Chicken with Rice. My boyfriend ordered BBQ Pork with Rice. And we shared a Roasted Pork with Wanton Noodle Soup. The portions were pretty decent and the price was right...only $19 for those three items. Service was alright. Cleanliness was probably not of the highest order. This seemed like a pretty authentic style of cooking. Out of all the items ordered, I liked the BBQ Pork the best -- I'd give that a 4/5 and would return for that. I loved the way it was seasoned. Soy Sauce Chicken was pretty good -- 3.5/5. Neither one of us was super stoked about the soup. It was nice to have some warm soup on a cold day. And it wasn't bad. But it wasn't a favorite either. We both liked the BBQ pork the best. I'd give the overall experience a 3.5 out of 5.", "author": "Renee F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-19", "description": "This place is amazing! Anyone who knows me will tell you that I am a duck aficionado. I had to get the half duck and a pound of pork. Bother items were so tasty! The service has room for improvement, but I wasn't expecting much, especially because I don't speak Cantonese or Mandarin. I had leftovers for days which was really handy. This place is really affordable, but at the same time very intimidating. If you can strap on your big boy pants and place your order, be ready to eat some of the juiciest duck you have ever tasted!", "author": "Kaitlyn F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-01", "description": "I use to come here as a kid. Cash only,  and price is extremely reasonable considering everything around these are expensive.  Found free parking at 7pm . Food hasn't come out yet but will update when this happens.\n\nService so far is typical Chinese style which is fast and efficient.", "author": "Chi H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-27", "description": "Cha siu was great, and around $12 a pound. However, there's a huge language barrier and so if you're ordering at the meat counter go with someone who speaks taishan cantonese-- because they speak in a dialect that is hard to understand and will get mad at you for not understanding.", "author": "Y W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-06-14", "description": "I only put three stars, but here's my actual rating:\n4 STARS for food taste\n2 STARS for poor service.\nBut I guess you can't really expect too great if a service from any Chinese restaurants. But I gotta say, their food taste great for a very cheap price!\n\nThey only have two waitress at a time, so the service is slow. Warning: most of the waitress dont really speak english. So either bring a chinese friend with you or just gesture at which stuff you want from the menu i guess. \n\nKeep in mind, their food taste great especially the claypot menu! I love their tofu claypot (:\n\nIts in chinatown, traffic is crazy.. So i suggest you walk or take the bus here. Parking is going to be hard to find too.\n\nCASH ONLY!!\n\nCheers!", "author": "Inge C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-01-07", "description": "I'll never go back to this place !!!! After I paid 15℅ tips, the server/owner told me I have to give 20℅. The reason was their food is cheap. Seriously????? That's something new to me\n\nAnyone have the same experience??", "author": "Sweety Smurf S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-12", "description": "On a whim, we went here after a day spent riding over the Golden Gate bridge. Everything we had (shrimp fried rice, char siu won ton mein, taro/duck claypot, sauteed pea shoots in garlic) was amazing. And there was so much of it! Leftovers for days!\n\nThis place certainly reminds me of Hong Kong (except the service is quite friendly) and the food is excellent. I'm definitely coming back the next time I'm in San Franciso!", "author": "Eric C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-20", "description": "If you like things being somewhat authentic and to eat among the locals, welcome to this place. The food is very good, large portions, cheap (we ate for 30$ being seven.. We just had the impression to steal). Don't look too close to the cleanliness and be ready for this Chinese peculiar way to be greeted and served and you should have a good time.", "author": "X L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-01", "description": "I LOVE THIS PLACE. BBQ pork over rice (char siu fan) is so, so good. When my family visits, this is a must! For $5.60 a box, you get 2-3 meals basically. Cheap, fresh, and absolutely delicious, you can't go wrong with any of their meats honestly.", "author": "Stephanie C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-20", "description": "So good and so cheap! Fresh noodles. Had the Shrimp Wonton and 炒麵. Both very good and not at all oily. Service is nice as well.", "author": "Amanda L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-12-28", "description": "Worst service ever! I'll give a zero star if I can!\n\nAlert: If you cannot speak Cantonese and don't want to be pissed off by the arrogant stuff, don't eat here!\n\nI waited around the counter for more than 5 min with no customer before me, and finally I just left feeling really angry.\n\nI asked to order food twice in English, but the man behind the counter seems cannot hear and buried himself in slicing the duck, this really pissed me off! Another waitress just kept on walking around without even looking at me! Seems they are really confident about their food that they can just ignore customers.", "author": "William T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-12-25", "description": "Have been here a few times over the years. It has some very good and decent quick, comfy noodles and rice plates, along with a few clay pot items and very good barbeque items. The one thing that just turns me off is when the chinese ladies don't really communicate well; I had asked about two different choices on the menu and she keeps telling me it can't be done or, it's a different kind of meats. A bit frustrating. And then, at the end, there's always the \"leave tip! words to the non locals. however, they don't seem to do that with the chinese elders.", "author": "Dennis Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-05-20", "description": "Nothing wrong with Kam Po, but I just can't go all the way to four stars.  We had mustard  greens, soy sauce  chicken and duck wonton noodle soup.  All were fine, with the wontons in the soup the best.   On the other hand, all that, with tea and rice for less than  $25 before tip.  Who can complain?", "author": "David R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-08-26", "description": "I am visiting from NY and I figure the food here would be comparable to NY Chinatown.  You definitely don't come here for the decor or cleaniness.  However the portion they serve is outrageous.  It was so much food for so little price.  I got mapo tofu rice dish which was quite tasty.  My son for a huge bowl of congee and my wife for roast duck noodle soup.  Flavor wise profile is so so.  Nothing to really boast about except for the extravagant portion.", "author": "Kevin C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-03", "description": "Every time we're in the neighborhood, this is where we go!  Awesome authentic Chinese food and known for all their bbq and roast meat.  Been going to this restaurant for over 20+ yrs and just decided to write a review.  Their food never disappoints, everything is priced reasonably, and you get a ton of food!  We usually end up having leftovers.  No complaints about that.  We always order beef tendon because it's tender and delicious.  Maybe it's not something everyone would eat, but we love how it's made here!  Duck, bbq & roast pork (yummy crispy skin!) are good here too.  Always a satisfying experience for us.", "author": "A. C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-10-30", "description": "The very windy interior is not the best during cold months. We dropped during the evening when it was a little chilly to find their door propped open and vented windows open as if it were a hot summer's day. Good grief, I'm surprised they can even stand the hilly draft blowing napkins on the floor and chilling you to the bone. They did eventually close the door, but it's still a cold restaurant, so don't how up without warm clothes!\n\nCrsipy roast pork was dry and chewy, and the crispy skin was soggy and flavorless. It was actually kind of bad. I would not recommend this.\n\nThe roast duck had an excellent flavor, albeit on the salty side. A shame it was a little bony too. As far as the skin and meat go however, it was tasty.\n\nThe wonton soup was a light broth with wonton filled with mushrooms and possibly meat. They had a slight woody flavor that we weren't super excited about, but they are ok.\n\nRice is a ridiculously cheap, light, and flavorless affair. Unless you are jonesing for rice, this is not the place to get it. Flip side is that they I've you a big bowl of the crap for $1.", "author": "Marc M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-28", "description": "What the duck!  This is the best Chinese food ever.  The perfect little place that doesn't have many tourists but lots of locals...tells a lot.  For $15 you will not be able to finish a couple of meals for two people.  Had the duck and it was the juiciest, most tender, and flavorful I have ever had.  Choice after choice with some really unusual ingredients if you are adventuresome.  And this from a chef that owns his own restaurant.  TRY THEM!", "author": "Craig F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-31", "description": "Since pretty much every restaurant was closed on Thanksgiving Day except for the restaurants in Chinatown, my family and I decided to stop by Kam Po for lunch. The reviews for their roasted duck made my mouth water, and seeing all of the BBQ delicacies in the storefront window ... \n\nI think this restaurant's roasted duck is the best I have ever had in my life. They don't give you any additional sauces for their meats (BBQ, sweet and sour, etc.) and to be honest, you don't really need it. The meat was tender and tasty, but the lightly crisp skin was so tasty! The BBQ pork was also really delicious. The pieces of meat weren't too fat, but not too skinny either. The fried pork was just okay. I've had better, and so I wouldn't recommend ordering the fried pork here. I think we had more pieces of dry skin than I would have liked. \n\nAlso, the waitress kept recommending the spare rib noodle soup. She said it was really good, and though my mom didn't really want to have spare ribs with the noodles, the waitress made it sound so good that we just went with it. Haha bad decision because they were so dry and not tasty ...\n\nI only give this restaurant 4 stars instead of 5 is because we told the waitress what we wanted to order. She changed it up and said it wouldn't be enough food for us and made the 2 delicacy with rice to be 2 different BBQ items with separate bowls of rice. I think what we wanted in the first place was fine, but sometimes waitresses in restaurants think they know their customers' stomachs more than we know our own.\n\nCash only! And buying a whole roasted duck carryout in SF seems so much cheaper than in LA!", "author": "Tiffany C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-25", "description": "It took 15 minutes to take my order with 3 people working because the lady ahead ordered 3 ducks and was super picky about it but that's not their fault I guess.\n\nI got the duck wonton noodle soup and it was amazing. Silky, chicken broth with chewy egg noodles, giant meat filled wontons, and succulent roast duck. The soy chicken over rice was also one of the best things I've ever eaten in Chinatown. The chicken was so tender and flavorful, like it had been marinated and roasted all day. Must try the pork next time. \n\nIf you're a carnivore, this is a must try.", "author": "Fiona Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-08", "description": "Food (4.5/5): My bf and I split shrimp fried rice, roast duck, and bbq pork. Both meat dishes were perfectly cooked with lots of flavor without being too salty. The fried rice wasn't the best I've ever had, but pretty solid.\n\nService (4/5): I wasn't expecting much, since a lot of reviews mentioned that service was whatever, but everyone was really friendly to us, even though we didn't speak Canto. \n\nValue (5/5): We left full and with leftovers for $20 total! So worth. Haha we're always on the lookout for cheap and yummy places, and I'm so glad we found this one. Definitely will be back :)\n\nNote - cash only!", "author": "Abby S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-13", "description": "Hole on the walls. I like it very much. Come here often.\n\nClay pot with rice and various meats will take 30-40 min to cook. Gonna try it one day.\n\nHours are bad sometimes. They closed early a few times.\n\nCommunication is not the best with the waitress even in native tongue. She can be argumentative even when she did something wrong.\n\nOrdered 1 lb BBQ pork and 1 lb roast pork to go. The butcher put together in one box. It's over 3 lbs total at the end. She argued the butcher can't be too accurate, right!!!\n\nShe asked... I instructed her to separate amount for dine in and 2 separate take outs, but we will pay together in cash. She gave us the total amount only without breakdown. She argued because we wanted to pay together.\n\nOh well, I can overlook these flaws and still support them.", "author": "Zack W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-05", "description": "Huge portions, super cheap. Doesn't taste super amazing, and hence why only 4 stars. Still, it's better than majority of bad restaurants in Chinatown.\n\nOn a side note, the manager here impresses me with her multitasking both the togo counter and waiting the tables.", "author": "Tuan V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-24", "description": "Black Pepper Beef & Rice is delicious. The rice plate serving portion seemed very generous so it's definitely a nice lunch meal. Service is good and some of the staff members here are friendly. There is also a fair amount of seating available if you plan on eating here.\n\nOverall:\n- good food\n- good prices\n- good service\n- positive first experience\n\nI'm definitely making my way back for lunch when I am nearby.\n\n*The Soy Sauce Chicken, Roast Pork and Roast Duck - lean and delicious!", "author": "Bennett W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-19", "description": "I was craving something meaty one afternoon and settled on getting half a duck to go. $8. What an absolute steal! The quality of the duck is also on par with the \"high-end\" Chinese restaurants I've visited.\n\nQuite the trek up Broadway but so worth the leg burn.", "author": "Linda X."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-03-19", "description": "I went in there with my parents twice today - the first time was to try and get a table for lunch.  It looked like too long of a wait so we left.  Then we stopped by after lunch to get a roast duck to take home.  We stood in line behind the counter, all 3 of us.  When it got to our turn, as soon as I opened my mouth and started speaking Mandarin, the guy behind the counter miraculously found not one, but two take-out orders he needed to work on.  And both of these were sizable orders, compared to our order of just a duck to-go.  This isn't the first time I've been discriminated against in Chinatown because I can't speak Cantonese, but this is definitely one of the most blatant.  Needless to say, we left in disgust, never to ever set foot here again.", "author": "Judy C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-24", "description": "I friggin' loveeee this place!! After my friend recommended this as a \"default\" of his, I just had to try it for myself!\n\nHere's a tip:\n- If you're dining in, you just seat yourself and they'll bring you menus.\n- If you're taking out, you get in line at the door.\n\nI ended up in line when I wanted to dine in. Fail whale. But they were nice enough about it :)\n\nWe ordered:\nChicken on Rice - Yes, this was kind of amazing. Its the hunan kind of chicken..and it was super juicy and tender. yumyumyummmmm~\nDuck - You CAN\"T do duck wrong in Chinatown. Seriously..plus it was only $13 for the duck. AMAZING.\nWonton Soup - This is ONE serving which is big enough for 2-3 people to share it! PERFECT with some rice and duck...mmmm..\n\nWonderful place to catch a quick bite. Don't expect anything fancy or service to be spectacular..but DO expect some really good comfort food.", "author": "Jennifer S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-09-21", "description": "Locals go here because the food, meat and rice plates are cheap, cheap, cheap!!!...and good!!!\n\nSometimes, there is a line to wait and order up some chopped up, cooked meat, but it is do-able - especially with the huge portion and unbeatable price you are paying for.\n\nI dislike the uncleanliness of this restaurant.  The bathroom feels murky to me.  The dining area needs to be refurnished.  I think if you avoid the need to go to the restroom and  can get over the worn out decor, this place would be a good dine in for you!", "author": "Tiffany D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-10", "description": "Uber cheap and pretty tasty roasted duck wonton noodles.\nHowever, service is super slow, esp for a Chinese eatery. \nHence the long wait.\nTook them 20++ mins to get me my dish", "author": "Jocelyn L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-04", "description": "Seriously amazing down home Chinese cookery! There's not much to be said about the decor, its barely clean but if you look beyond the greasy tables and the stacks of old newspapers you'll find one that Kam Po is probably one of the best Chinese places I've tried in Chinatown. \n\n1/2 Roast Duck - Im a huge addict to great roasted duck, from the crispy skin to the moist fatty meat, there's just something comforting about that smell of five spice that sort of reminds me of autumn. KPK nailed this down! \n\nSmall Roast Pork - Small really wasn't all that small. Probably a good half pound of killer roast pork that came with rice and a side of pickled cabbage. My thoughts, rich fatty pork, I mean come on, how can it be so good? Even the crunchy skin didn't stand a chance against me and my love for pork.\n\nShrimp Wonton Noodle Soup - About this time our server pushed together another 2 top table against ours. With just the 2 of us ordering so much food, shit just got real. The soup had a good flavor and the chewy shrimp wontons were even better once I adorned them with a whole lot of chili paste. \n\nBeef Chow Fun - Greasy beefy and awesome! The noodles had a good amount of char and smoke flavor from a wok that's hot as hell. One thing to note is that the portion sizes here are huge and very sharable. \n\nAt this point we were starting to hit the wall. We had chowed like it was our last meal though considering how hung over we were, it might as well have been. With this meal sitting in our bellies our hangovers started to subside. So another insight about KPK, a definite hang over cure.", "author": "Alexander C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-11", "description": "My last meal on Earth would be their roast duck over rice. Good duck with drippings over perfectly done rice at Kam Po is one of my favorite things. I sometimes buy their whole large duck.\n\nI like their roast pork as well. It has good flavor and is one of the better versions that I've found in Chinatown.\n\nBesides the BBQ items it's also generally a good restaurant for Cantonese food.", "author": "John W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-31", "description": "The duck and the chicken as well as the noodles - they make me crave for San Francisco! A ridiculously cheap eatery but the flavours and quantities are definitely worth more. Tip: don't lose patience with the shoddy service; it's a small place that is always packed and the two waitresses are doing their best so have some patience - it's worth it!", "author": "Sadia H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-19", "description": "4 stars on the ROAST DUCK. \n\nThe BBQ pork is not very good, I have had better. Garlic Chinese broccoli is ok, not very tasty. There is a soup that comes with your meal - put it over your rice!!\n\nThis place is like eating at home at your grandmas. Big Asian bowls and Chinese plates. It is not fancy at all - they are also a \"pick up\" and \"to go\" location. \n\nIt is the BEST BANG for your buck. So much food for SO CHEAP!", "author": "Belia P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-21", "description": "Still going here over 10 years long and 10 years strong. I still maintain this place has THE BEST Cantonese BBQ on the planet. It's a fortunate thing this place is tucked away im Chinatown SF, or I would be here every other day!", "author": "Doug R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-11-22", "description": "We ordered roast pork and duck. They taste very bland, but they are at least very cheap. The shop owner, who received money from a previous customer, obviously thought it was okay to not washing his hands using soap and water. He briefly rinsed his hands using water, and the dried his hands on a towel which looked old and colored, and then chopped up the duck for us.\n\nI have had Peking duck at several restaurants in multiple cities in the U.S. In my opinion, the best one is the Sang Kee Peking Duck in Philadelphia. Kam Po Kitchen ranks towards the bottom on my list.", "author": "Holiday W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-09-16", "description": "Don't know what the fuss is all about.  The guy who was cutting the meat also handled money without washing his hands.  GROSS!!  \n\nI ordered a roast pork and duck with rice, sure the value is good for the price, but the duck is tough.  Would I come back? No!!!", "author": "Kevin L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-08", "description": "First off, this place isn't the cleanest, nor is the service the best but what it lacks in those two categories, it more than makes up for with it's food. I ate here the first weekend I moved here and have been going back whenever I am craving some good down to earth Chinese food. Not only is the food here good but it is extremely cheap as well, we were able to order enough food for four people and order half a roast duck and BBQ pork for just under $50 and let me tell you I was stuffed. \n\nYou see many restaurants around china town with various roasted and barbecued meats hanging in the window, don't let that discourage you from going in, this is probably the best part of the restaurant. I've come by multiple times to grab a quick dinner or some barbecued meat to go and the taste/price of the food is enough to make me want to come back many more times.", "author": "Zach C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-02-02", "description": "we came cause I saw shrimp only wonton noodle soup hong kong style which is hard to find, 99% of places use shrimp and pork in their shrimp wonton noodle. the other 1% is 3000 miles away from NY Noodletown. \n\nnot as amazing as NY Noodletown in the broth but no one is. also the noodles while al dente wasn't as light and chewy as NYN. the duck while good was on the salty side cause of the dripping sauce and to many cuts with no meat. also ordered their char siu pork which was disappointing. it wasn't a deep dark red more light red in color and it had an affect on flavor. also very few cuts had the dark red crusty ring around it which also ruined a bite. it would take me three weeks later to rectify my taste buds with proper char siu in the most unlikely place.", "author": "NYSD G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-08", "description": "What's with all the hate? It sounds like folks are expecting a lot from this place--it's supposed to be a hole-in-the-wall small operation with small tables for casual eaters, folks! Look at all the customers who know what they're doing, and you'll see 8 out of 10 come here for the take out Roast BBQ Pork, which is clearly the whole reason why this place exists!\n\nOrder take out if you can, since that's what this place is for! Or if you want to stay don't make a whole feast and order 10 dishes :) I don't think they expect you to tip either. It's supposed to be the Chinese version of fast food!\n\nThe BBQ meat certainly is one of the best I've eaten, with large portions. Look no further if you're craving so savory BBQ-ness", "author": "Henry L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-27", "description": "Prices have gone up like everything else here in Chinatown.  Roast meat still good.  Lots of customers lined up for their roast duck and such.  Owner and workers been here for more then 20 yrs.", "author": "Mar H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-05", "description": "Cheap, huge portions of pretty good chinese/canto food!\nI came here on a Wednesday afternoon, around 1.30pm. There was a lot of spaces. Service wasn't THAT bad, just that they were not super attentive. Got seated within a minute. It wasn't a big shop. I ordered a pork rice plate and the portions were GENEROUS! Rice was inconsistent, with some parts soggy whilst others hard. The meat was tender in general, with 2 pieces being really hard, dry, and a little chewy. Not a bad experience. Good spot for a quick, filling meal!", "author": "Audrey H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-11", "description": "So much tasty food for such a small amount of money! My boyfriend and I made a big mistake ordering 2 separate dishes thinking that the portions would be on the smaller side since the prices were so low. Nope! We ended up boxing up half of our dishes because there was so much. No matter, they made for tasty leftovers later on that evening. :) \n\nWe weren't the only ones to make this mistake. The table next to us ordered 3 bowls of soup and ended up laughing at their portion sizes while scratching their heads wondering how they would finish it (they didn't and ended up taking the rest home).", "author": "R B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-30", "description": "Yummmmy. We had the bbq duck wonton egg noodle soup, soy sauce chicken fun noodle soup, Chinese broccoli, two meat rice platter. All were delicious. Easy 5 stars if it weren't for the rude gesture of leaving a tip when we haven't yet left....", "author": "Jo J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-29", "description": "Amazing service, authentic, and inexpensive Chinese cuisine. Had the roast duck, shrimp won ton soup, Hong Kong style fried noodles", "author": "Mikey M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-08-02", "description": "Kam Po draws a steady stream of Chinatown locals who get fresh barbecued meats to go. As a dine-in place, I can get over the grungy lack of superficial cleanliness (sadly typical of many U.S. Chinatown restaurants, as I'm used to seeing), so I decided to give this place a try based on the high average Yelp rating. \n\nThe roast pork wonton noodles were cheap ($6.25 including tax) and generously portioned. Rice and noodle dishes were even cheaper and looked just as large. Still, taste was just average. Moreover, the roast pork was very fatty and some of the wontons had inedible bits in them (likely pieces of shrimp shells). Overall, meh on a quality scale. To their credit, service was fast and courteous given that I can speak Cantonese. \n\nGrab your order of barbecued, custom-butchered meats to go, for lunch or dinner at home. If you're conscious about the fat, make sure to trim it out on your own.", "author": "Vincent L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-11-04", "description": "Sad to report that they are no longer the Sui Gow (dumplings in soup) Kings in my book!  Today's order was mainly comprised of ground pork. mushy shrimp pieces, and small amounts of wood-ear fungus (you know, those dark crunchy strands).\nFortunately, my BBQ pork (cha siu) was lean and tasty and the portions, as usual, were very generous.\nNot sure whether they are compensating now for the low prices by skimping on the quality.  Sad sad meal...", "author": "Mike C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-10-22", "description": "If you like affordable greasy Chinese food in large portions.., this is the place for you!  Kam Po Kitchen is more idealistic for takeout, as the dining area is small and the bathroom is nasty.  You can always tell how authentic the Chinese restaurant is by how dirty their bathrooms are.\n\nAs of 1/8/13; Kam Po Kitchen received a Food Safety Score of 83, which means \"Needs Improvement\".  If you ignore the cleanliness of this restaurant, you'll appreciate the quantity of their portions for the very cheap prices that you pay.  The food is very flavorful, but it is too greasy.", "author": "Johnny W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-15", "description": "Cheap, straight forward, simple yet authentic chinese food. When I visit chinatown, and I don't want to wait for the big dim sum places during lunch hour, I go here, Is it cramped and perhaps less than comfortable? Yes. Is it loud? Yes. But it's chinatown, the whole place is like that. At least it's cheap and good food. That is all.", "author": "Peter K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-18", "description": "Definitely a hole in wall, I wouldn't have gone there judging by the looks of the place but my BF grew up eating food from here and told me it was bomb, so I go skeptically. \n\nIt only took me one trip here to fall in love with their food, I mean how can you argue with cheap food that comes in huge portions!? \n\nEvery plate is under $7 bucks and the food is more than enough to fill you up! \n\nI love the eggplant dish with rice. So good that when I was deprived of good food in Santa Cruz, I asked my BF to drop some off on his way back to school!", "author": "Kelly L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-16", "description": "Took my wife and a visiting friend from Ohio to Kam Po yesterday.  This was my second visit. \n\nI ordered a half duck. I will confirm that this was the best duck I ever ate anywhere. Large portions of meat and the outside was prepared in a way that was tastefully superior to any I ever had. Only $6.50!  Five stars for the duck. \n\nPork fried rice was good but not exceptional. (About $5.55)  Regular size portion. Three stars.\n\nBeef over rice. Large portion of that with so much beef. (4.65) Good taste. Three and half stars.\n\nBeef chow fun. (4.65) Wonderful taste and not overly greasy but about right. Good portion of beef. Enjoyed it.  Four stars.\n\nBeef stew wonton soup (4.75) . Very good and tasty. Large portion. Soup had a wonderful taste to it as did the added meat and noodles including the wonton. Four stars.\n\nRestaurant was crowded (weekday 1:30 PM)  At one point, we had to share our table, but that was all right. \n\nService was average. \n\nPrices are EXCEPTIONALLY low. Large portions, good food and low prices. Five stars for price/value.\n\nOverall would give it a four star. \n\nWill be in town until October. Will be sure to return there.", "author": "Steven G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-04", "description": "Food was delicious and cheap, despite looking like a \"hole in a wall\"!  I would have given 5 stars if it wasn't for the service, but I can't blame the waitress since she was the only one there serving (she tried her best) as well as being the bust boy.\n\nDon't be hesitant go in and try...especially their duck!!!", "author": "june b."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-02-22", "description": "The server threw the menu at me. My jaw dropped.\n\nAnother server saw it and she intercepted her service. Their food is fresh but don't expect decent service. I found out through my Chinese co-workers not to eat in, just order to go, I work 10 feet away from that place.", "author": "Lee Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-05-03", "description": "Decent roast duck and beef chow fun. Cash only. Interior decor reminds me of 1940-1970's HK eatery.", "author": "Maggie S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-13", "description": "Update! During lunch I always see a crowd here, and after coming back to try their lunch combos I can see why. For $5-$7, cash only, you get large scoop of rice, some cabbage, and a generous helping of whatever protein they have hanging there. I always see these people lining up for their crackling siew yuk (roasted pork belly), or their roasted duck. Both are really crispy and fresh. You can also get BBQ pork or chicken. There are plenty of other things on their menu, however I'd only recommend the things I mentioned above. Really good value considering the portion and quality. You can sit in or order to go from the counter which can be a bit more intimidating. Its not the cleanest place if your sensitive to that so i can't give it full 5.", "author": "Huy V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-05", "description": "I am not into super strange food and cannot eat with chopsticks.   After looking at the menu, I was quite nervous to eat here and nearly demanded that my family leave and go to a pizza joint.    But we found some innocuous things to order and ended up being pleasantly surprised.   Sweet and sour chicken and shrimp lo mein were the clear winners.   Huge portions.  Definitely enough to share.   Cash only.   Give this place a try.", "author": "Addison H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-11", "description": "I call this Chinese soul food. \n\nI used to come here alot when I was younger. There's been so many owners since then but the quality of the food remains good. It's a little run down, it can be dirty (just wash the utensils in the hot tea) and the waitresses can be a bit rude, but I swear the food is good! I love their meats - roasted duck is my favorite and I have it over rice or wonton noodles. If you feel like having more than one type of meat, you can can order it that way too - like roasted duck and soy sauce chicken over rice. They're not shady with the portions and it just delicious. Easy, quick, delicious meal.\n\nPlease try not to get grossed out with how run down/dirty it is! Give it a chance if you haven't been.", "author": "Rosie W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-02-26", "description": "This is probably the 4th place I've been to in SF where yelp has failed me. Out of about 8 places. \nI ordered the duck and the bbq pork on rice.\nThe rice had some weird cinnamon spice in it. Both the pork and the duck were crappy cuts, really fatty and boney. It was also served lukewarm. \nThe only advantage is that it was cheap, but this is SF so still not that cheap. Expensive by Sydney standards. \nIt's just not worth going here, I'm not sure how these places get to 4 stars...", "author": "Michael S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-07", "description": "How lucky are we San Franciscans to have Kam Po and Cheung Hing in our city???? These two temples to Chinese deli greatness could be visited as part of a progressive meal and I'm not writing about Democratic-party politics here.\n\nI once attended an event at E & O Trading company honoring Anthony Bordain and was awed by his statement that, and I paraphrase, all great chefs have at their core a Chinese chef.\n\nHow is it that Kam Po can make cucumber soup that would make many chefs cry.\n\nAnd the Sha Shui and roasted pork? Well, it's right up there with same dishes served at Cheung Hing although in this poor writer's opinion Cheung Hing marginally edges Kam Po.\n\nEnough pontificating. If you're west of Divisadero and have jones for Chinese deli,  get some at Kam Po!!!", "author": "Jay D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-15", "description": "Coming from LA, I used to always joke around that when you're in Chinatown, the health ratings all have different meanings. A = \"Americanized,\" B = \"Better,\" C = \"Chinese. \"  Keeping that in mind as I trekked down Broadway, I knew this place would be legit. Minimal decor, crowded seating area with mismatched chairs, and a somewhat questionable kitchen area. \n\nI forgot about all of these things as soon as the food arrived. Every bite I took brought me back to my summers in HK. I have never been a fan of roast duck, however, the duck here is phenomenal.  The best way to describe it is a hybrid peking and HK BBQ duck with thin crispy skin and flavorful juicy meat. The preserved egg and pork congee was probably the best I've ever had. It's also worth noting that the portions here are HUGE. The burly construction worker sitting next to me filled up on one order of roast duck and rice before heading back to work. Needless to say, I had delicious leftovers to bring home and enjoy the next day.", "author": "Tiffany W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-11-27", "description": "Cash Only.  We went to Kam Po Kitchen for dinner Fri 11/26/10.  It's a hole-in-the-wall place in SF Chinatown on Powell St.\n\nWe were heading elsewhere, but have always to try this place & since it was in front of us we went in.\n\nFood is cheap, but not all that great.\n\nI got a Roast duck wonton noodle soup $5 or so.  I got it with large rice noodles.  Some pieces of the duck were good, but others mostly bones & fat.  Wontons were small, some bok choy with the soup.  Just ok.\n\nB. got beef stew noodle soup about $5 - one piece of beef stew was tender, other pieces he said wasn't very tender.  He got egg noodle & like that ok.\n\nB. ordered chicken feet about $5 - I thought they were pretty bad.  Not very tender, not enough flavor.  Skip it.\n\nSomeone ordered a plate of 1/2 roast chicken meat & 1/2 bbq pork over rice w/ side of veggies.  That looked good.\n\nAnother table tried to get chow fun - waitress said they ran out of chow fun!  That's strange.  They picked chow mein instead.\n\nThere's 1 unisex bathroom - didn't use it.\n\nBefore tip was $15.20.  Cash Only.", "author": "Ann L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-10", "description": "Word of the day: value. Value, value, value.\n\nI can't give this place 5 stars because the service was basically cold. I didn't really feel that wanted there, perhaps as I didn't speak Chinese and only ordered two dishes. Also, I feel like our bill was fudged a bit but it was still cheap so whatever.\n\nOrdered sweet & sour chicken with rice and chicken chow fun. Each dish was $4.65. FOUR. SIXTY. FIVE. I couldn't believe my eyes, but I went with it.\n\nHefty portions of really tasty, well-prepared and well-presented food. This is the BEST food I've ever gotten for the cost. Without exaggeration. I'm not sure I've ever, in any city or country, been served a better meal for a raw $9.30 before tax. Our bill came to $12.50, maybe I'm wrong but at current tax rates I don't know how we got there. Still, after tip I left $15 which for what we got was still pretty cheap honestly. They were pretty good about refilling on hot tea, so there's that. Also the soap in the bathroom was watered down. I hate when restaurants do that.\n\nFor REAL though, I've not ever had so good a meal for so little. It isn't a beautiful shop with the nicest employees but... VALUE. I'd come back if I were in Chinatown.", "author": "Riki N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-22", "description": "visited San Fran Jews for Jesus, great and a place to stop...AND for an eatery= ...has Cantonese special dim sum,  Barbeque hehe duck too, goodie hehe, large portions...some are just ok...yet fairs better than others in China towns. high price and you never can be sure other places....here it is priced right reasonable and a little wait in the lunch rush, don't bring a big group, unless you wish to split into smaller groups...\nor wait the while. David in His amazing grace, and stay tuned..i do get around...don't know how to comment on INTERNATIONAL TIPS Israeli, Italy, and more countries eateries, seemingly not listed...ISRAEL...great hummas and veggies and grains...but if your an American guy in Italy in Rome...go to Ladispoli by the sea.. don't trust most of the guys,  hoards of kids, or ...'guests' there", "author": "David I."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-07-02", "description": "This place was totally misrepresented. It is not fusion. It's Japanese which would have been fine if that is what we were in the mood for. Do not say Asian Fusion if you are heavily one type of food!", "author": "Benny R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-09", "description": "I never realized how great this place was until I went off to college! Everything here is super delicious and cheap! Their seafood jeen meen and beef chow fun (dry or wet) is my all time favorites! Their won ton noodles and roast pork/duck are really good too! There always seem to be a line though!\n\nThis is pretty much a hole in the wall place but definitely worth going to try. Authentic chinese food! Can't wait to go back to get some!", "author": "Shanna C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-20", "description": "This place reminds me of back home in LA. I basically grew up in Chinatown, and sad to say that it's slowly disappearing. However, the one in SF? WAY different story.\n\nI was hungry and didn't know what to eat. Therefore, I called a friend, who knew the area, to recommended me a place. She said it's something HK on the corner of Broadway and Powell. Wander around, found the place and she told me \"I miss their dry fried noodles.\" So, she decided what I was going to eat.\n\nGoing in, the actual place brought back childhood memories of me as a young one, in Los Angeles Chinatown, having mommy order some food to go, to take home. Or just staring at the dangling ducks behind the glass.\n\nI placed my order in Canton, and asked how long is the wait. Server said, \"not long at all\". And I waited. Not even 5 minutes has passed and BAM! My order's done. I even said, \"wow, it came out REALLY quick\" and the server just smiled.\n\nThe noodles were $5; however, the $5 is filled with grease, with not as much MSG as like how I had the two noodle dishes from Sam Woo's happy hour. Tastewise, it's a bit bland. Not really complaining THAT much because I was able to find a cheap dinner in SF.", "author": "Tom T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-21", "description": "Food is not bad, HUGEEEE PORTIONS!!! lol. service sucks if you cant speak chinese, and its still  not that great when u can... lol\n\nthe food was good, i got the Black Bean Beef Chow Ho Fun with gravy. Not bad. except they threw hella bell peppers on it. I HATE BELL PEPPERS GROSS. I picked it all out, and my coworkers ate it all for me. haha. \n\nPretty authentic I must say. Another one of those 1 mile hikes to get here from my office. \n\nThe tables are kinda sticky and small. \n\nOh, did i mention they're dirt cheap? haha. \n\nI'm gonna come back for some roasted pig and duck!!!!! NOMS NOMS NOMS\n\n\n=] Happy Face for me today!", "author": "Judy W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-28", "description": "If you're looking for fancy, not the spot. This place is good Chinese comfort food. All the BBQ and roasted items are on point. Their porridge has good consistency and options are vast. My favorite... The frog clay pot with extra ginger. Rice and noodle plates never disappoint. \n\nService is okay. Not the greatest but eating in a place like this your not looking for a concierge. Good food and decent service! I'm a regular!", "author": "Jason T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-03-26", "description": "After seeing this place packed full of people with delicious looking food, my friend and I spontaneously decided to eat lunch here. The portions were huge, and the food was cheap, but the food wasn't the best. \n\nWe ordered a Beef Stew Flat Noodle Soup (Ngau Lam Tong Ho), a Wonton Noodle Soup, and a plate of Cha Siu. The Cha Siu was probably the best part of the meal. It was pretty lean, tender, and juicy. I thought it was seasoned pretty well with salt and savory spices, but it could have been sweeter. It didn't have that glistening glaze on the outside which was kind of a let down. \n\nFrom the outside windows, the noodles soups looked pretty good. It was the main reason why we got them. I could tell that the wontons were all shrimp just by peering through the glass. Despite the really slow service, I was still really excited to dig into my bowl when it arrived. When I took my first bite, my excitement quickly dwindled as the broth and noodles were so bland. The wontons really were all shrimp which is what you'd find in more desirable upscale wontons, but they also lacked any kind of seasoning. My friend's broth was similarly bland, and her beef was tough and flavorless. It was pretty disappointing all around. Maybe the roast duck is better? I guess on the plus side, it's cheap.", "author": "Nei N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-30", "description": "Bomb roast duck wonton noodle soup. Bowl was loaded and flavor was excellent. Noodles were thin and chewy. \"I'll be Back!\"", "author": "Jack N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-30", "description": "Kam Po, how do you do it so well? Like everyone says, the bathroom is tiny, service is ridiculous, and it's quite sticky, but man, you're at a Chinese restaurant in Ctown. What are you expecting? Look, their prices haven't changed in years, and you still get the same gigantic portion sizes for $5.88 a plate. This place is seriously ridiculous. I mean, they have a dish that has noodles, flat noodles, wontons, and roast pork in soup. It's $5.88. Not a joke. Food comes out super quickly and piping hot. Seriously, this place kicks major butt. It's so small though, so you're going to have to stake out a table if you're coming on a weekend or during rush hour.", "author": "Danny C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-01", "description": "Good food, alot of chinese People but thats what makes it Authentic :-)\n\nDont ask for water or else... :-)", "author": "Clipperson P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-30", "description": "This is the only Chinese restaurant I've been to that reminds me of the Chinese restaurants back home. It's cheap, big portioned, and delicious Chinese food.", "author": "Enoch L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-21", "description": "My Asian friends showed me Kam Po and I cannot get enough of this place! Right outside the Broadway Tunnel is this gem. I always call in and order the Shrimp Chow-Mein (Very tasty), Curry Chicken, Beef & Broccoli, Tofu Soup and a few containers of rice. Large portions for cheap! Doesn't get any better than that!", "author": "Julian T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-10", "description": "Cheapest hole in the wall chinese restaurant in the city. You want Hong Kong style pan fried noodles? There's no extra charge unlike other places. This is where all the Chinese people go. :D", "author": "Walter W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-21", "description": "I really love the BBQ pork or duck here. Everything is just right. And the price too! Probably the best in the bay area, especally if you consider goodness for the money. I know a place in Oakland that might be a little bit better, but it's several more dollars an item..Is it 30 percent better? Nah", "author": "Paul M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-08", "description": "Cheap and DELICIOUS--people do not come here for ambience or exceptional service.\n\nRegardless of the latter, Kam Po deserves four stars for the nommy food alone. The bf and I each got the roast duck (crispy skin + juicy meat + tasty sauce = orgasms in my mouth), which comes with a hearty portion of rice and veggies. We also split the shrimp wonton soup, but it was so much food that we had leftovers.\n\nA meal for two and a snack for later, for only $13.50??? We'll definitely be back! I'll try the BBQ pork next time, though it might be hard to pass up that scrumptious duck--but for ~$5 per meal, I'll probably end up just ordering and chowing down on both. :)", "author": "Michele P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-11", "description": "Was caught off guard with the huge portion sizes, however i was then left with left overs for that late night Chinese food fix! Not complaining :)", "author": "Chanise F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-15", "description": "We literally went in and ordered roast duck, roast pork, pig feet, chicken feet and steamed rice. No funny business - just real down to earth good ole grub. Happily satisfied with promises to come back.", "author": "T C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-11-08", "description": "Ordered beef chow fun and roast duck. The chow fun was dripping with grease and had no flavor. The duck was ok. Big portions but would not come back.", "author": "Heather A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-13", "description": "Cheap, good, questionable cleanliness and more Chinese patrons than other races. Just the way I like my Chinese dive restaurants. \n\nIf you want some hoity-toity experience, go to Yank Sing. But, if you want some down home southern Chinese cooking, this is the place! \n\nBeware, it gets crowded for lunch and you might have to share a table. \n\nMy go to winter lunch is the won ton noodle soup. Hand made and oh so comforting!", "author": "Brian L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-17", "description": "Roasted duck over rice was so so so amazing!!!! You must try it! But has to wait for pretty long time to be seated.", "author": "Kyle X."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-07-04", "description": "Ewwww . . . just ewwww . . . \n\nI love a good deal but there's a sanitary line that I draw in the sand that a restaurant just shouldn't cross and this one does.  By golly, I wish they'd raise the price of all their dishes by a dollar and use the proceeds to buy a bit of hygeine.  \n\nThe roast pork is pretty good and I love their vegetable dishes but if I were to buy something there again (which I doubt I would), I would eat somewhere else because the environment there is just so unappetizing.  From the sweaty butcher up front with a foot-long hair coming out of his facial mole to the greasy dirty tables and chairs, I'm just not a fan of Kam Po.  Sorry folks.", "author": "Linda H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-11-26", "description": "Many of you wondered, \"How was my Thanksgiving?\"\n\n\"Well I worked, but I love the Holiday pay though!\"\n\nMy wife knows I love the food from Kam Po. And this Chinese deli/restaurant also sells cooked Turkey on Thanksgiving Day and Christmas. She bought a half of a cooked turkey, which weighs five pounds, for $3.00 per pound. In addition, the short-haired waitress and the dude behind the counter seen me, as an employee of San Francisco, and seen my wife dined here many times and gave us a discount on half of the cooked turkey.  \n\nMost of the turkeys I've had for the past thirty-seven Thanksgivings were very dry and unbearable to eat. But Kam Po's version was very moist. Especially eating it for dinner, when she bought the half  bird earlier this afternoon. And Kam Po's gravy with the turkey was thick, tasty and covers the rice and vegetables (made by wife) very well. \n\nMost of the Chinatown Delis also sell cooked turkey on Thanksgiving, but Kam Po makes a good bird and affordable too. Even without my discount. \n\n\"Happy Thanksgiving, everybody!\"", "author": "Matt G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-01-11", "description": "I ordered beef tendon noodle soup for take out and it was okay. Three stars because I was hoping the soup would be more of a beef broth, but it tasted rather fishy.  After calling in the order and waiting in line, I wish I had ordered the barbecued chicken/pork with crispy skin.", "author": "Krystle L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-28", "description": "Affordable solid little no-frills chinese place specializing in roast and bbq meats it seems. Had a non-standard \"hainan chicken\" dish here ($6), along w/ some dou miao ($6.50) to balance out the meal. The chicken dish while tasty was closer to the canto \"Bái qie ji\", or poached chicken w/ a ginger-scallion-garlic oil sauce, on top of a bed of pickled vegetables. AFAIK, that is not the type of sauce one uses for hainanese chicken. The rice also was lighter flavored and colored; I'm told really good hainan chicken rice should have a nice yellow hue and be more strongly flavored of chicken. Still, the food is a great deal here; I wanna come back and try some of their jook. (They also serve a hefty shrimp dumpling and roast duck noodle soup here for a little over $6! Screw Katana-ya.)", "author": "Linus W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-12", "description": "Kam Po Hong Kong Kitchen rules: believe the hype. \n\nThis joint is the sort of locals-only joint that is in it for the long haul what with their mind-bogglingly extensive menu, unpretentious portions, and budget-friendly prices. The only drawback I could possibly foresee is the wincing disgust of vegetarians attempting to find a guilt-free offering here. Having lived near this bastion of Chinese soul food realness for more than fifteen years my friends and I have come to call Kam Po H.K.K. by the nickname \"Meat, and meat alone.\" Located just two blocks West, uphill from what most tourists would consider the Chinatown exit/North Beach entrance portal, I encourage any and all SF visitor ballin' on a budget to make a detour for this deliciousness. Just be aware that you will be dining with multiple carcasses hanging in plain view, the whole roasted pig being more of a plus than a drawback.", "author": "Kelly O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-10", "description": "Is the place dirty? YES\nIs this seating comfortable? NO\nBut is food good? YESSSSSSSSSSSSSSSSSS\n\nI have a lot of respect for this restaurant. While other restaurants in Chinatown increased their prices over the years, Kam Po maintained modest and affordable pricing for the community.", "author": "Fu D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-12-06", "description": "If you're looking for the best roast meats in Chinatown, hands-down it's probably found at Kam Po Kitchen. In fact, rumor has it that they provide the roast meats for several other eateries around. \n\nI believe it's almost 4 years to the day that I stumbled upon Kam Po. I had just moved to the city and got lost in the labyrinth that is Chinatown at night but it was a most fortuitous detour since I found my go-to Chinese roast house. \n\nFirst off the roast duck is just such a guilty pleasure. Wonderfully fatty and tasty with the most perfectly crispy and succulent skin. Order it over rice and you can easily split it into 2 meals. The roast duck in wonton noodle soup is also one of my favorite hangover cures. The plump wontons and the warm soup work in tandem with the duck to get me out of my funk. \n\nIf you've never seen a whole roasted pig come out of the roaster then you need to get here. It truly is a sight to behold when they bring the whole perfectly roasted hog out and hang it on display for all to see. What's impressive is they actually go through more than a pig a day. But wait till you bite into it. The crispy skin is perfection - the kind of thing that makes Anthony Bourdain salivate on camera. \n\nI've had other dishes here ranging from salted fish fried rice to dry fried beef chowfun and they are all decent but the real stars at Kam Po are without a doubt their roast meats. Considering that meals here are so inexpensive (most average around the $5 mark) though, it's hard to order something wrong.\n\nThe service is fast and earnest here especially the lady with the short cropped hair. She is a star here and runs a very tight ship. She negates the attitude from the grumpy butcher.  Don't come here for the ambiance. It's a dive. Order take out if you're afraid of the place but trust me you won't regret it. The food at Kam Po is truly yummy.", "author": "Jon L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-14", "description": "My first review was simply a complaint on the wait. Kam po is hands down the best roast duck in SF. I can't go to Chinatown without coming here. Duck heaven.", "author": "Junel S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-01", "description": "If you're around Golden Gate bridge, Palace of Fine Art or Lombard Street and if you're looking for an authentic Cantonese restaurant, then Kam Po is the place.  Parking is always difficult in the Richmond district.  The restaurant is \"hole in the wall\", small and busy.  We ordered soy chicken, char-sui, salt and pepper prawn, beef egg plant, beef fried rice, beef chow fun and vegetable  crispy chow mein.  Everything was excellent and the price is very good.", "author": "james V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-12-29", "description": "Good reviews are hard. It's so much easier to dismantle than to praise. Good reviews sound flat and uncreative. Humor is easier when it's harsh.\n\nBut Kam Po is good. Very good. On a street full of Chinese restaurants, Kam Po is full when the rest are empty. The flavors are intense but not just sweet and salt, like so many American Chinese places. Where else can I get pork liver lo-mein if I ever wanted it. I haven't yet, but I like the option.\n\nI chatter with the woman who I think owns the place with her husband, the only waitress I've ever seen, in a mixture of English, Cantonese and Mandarin, and I don't even speak Cantonese. She gives me free soup because I eat there all the time and I'm too thin. She's like my second mother, and my first mother loves Kam Po because it's so cheap, so good, so fresh. When you sneak off to the tiny bathroom, glance into the kitchen. Last time I did, I saw the whole hogs hanging from the ceiling.\n\nI always order the duck. Now, I get a whole one so later in the week I can eat duck from the fridge and tide myself over before I go back. But a 1/2 order of crispy duck is the way to go if you don't want leftovers, and it'll only set you back $9. \n\nCash only.", "author": "Liuyin S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-01", "description": "Last night in SF we went here for dinner. Seated quickly, waitress was a little abrupt and was sure to tell us cash only before taking our order. The place was full and there was only the one extremely busy waitress. Also it seemed strange they did not have ice. \n\nWe ordered beef chow fun, wonton soup with roast pork, and rice plate 1/2 duck 1/2 pork, it was all very good and CHEAP!", "author": "Shawn G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-06", "description": "5 stars! Don't make the mistake we did by ordering too much food. The dishes are giant, don't be fooled by the price. \n\nTHE DUCK IS A MUST!!!\n\nIf you're looking for a cheap place to eat in Chinatown, this place is perfect. (most dishes are a little over 5 dollars)", "author": "Robert C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-30", "description": "Let's get to the point: this place gives you RIDICULOUSLY LARGE DELICIOUS PORTIONS for CHEAP. \n\nWe ordered Beef Intestines, Beef Tripe, Chinese Broccoli, and several bowls of Wonton Noodle Soup, and Duck Noodle Soup. All of the portions were insane, everything is between $4-$7 and it's SO MUCH FOOD. More importantly, it was delicious, savory, and filling.\n\nThis place was actually very busy for a hole-in-the-wall place. My BIGGEST COMPLAINT is that the restaurant is SUPER SMALL and PRETTY DIRTY. The floors were sticky and there was crumbs and things of that nature everywhere.\n\nService is fast, friendly (particularly if you can speak Chinese), and it was an overall enjoyable experience if you exclude how cramped and untidy it was. If you're visiting San Francisco and you're hungry, swing by here with some friends, share the food family style, and be satisfied out of your mind.", "author": "Corey P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-28", "description": "I returned here for lunch last week due to some field work in the area.  The menu now still shows a lot of Chinese BBQ rice or noodle soup dishes for under $5 before tax and tip.  For $4.95 I got a pretty good bowl of roast duck and wonton noodle soup.\n\nThe waitress who served me was quite nice, a plus for a restaurant like this.  I recall it wasn't as busy as previous times I came for lunch (don't recall if it was because it was a later hour like after 1pm).  That was good for me because in the past during very busy hours the service can become very disorganized (especially when there's also a line of people ordering Chinese BBQ for takeout).\n\nAlso, keep in mind that this is a Chinese BBQ place where the \"star attraction\" is the roast duck.  Therefore don't expect a super-clean place.", "author": "H K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-01", "description": "This is one of those small mom and pop Chinese restaurants. They don't focus too much on their interior decor and presentation. The food is really cheap and they give you quite a lot. My parents and I ordered seafood chow mein, chow fun, and porridge for only $15.10 total! We also had enough to take home. They used the same bowls and plates that I use at home so I feel like I'm eating a home cooked meal. The food isn't amazing but you definitely get what you pay for.. And maybe more.", "author": "Connie V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-03", "description": "Ordered roasted duck over rice because of the good yelp reviews. I am not a big fan of duck meats as a lot of times the ones I had were too gamy. But I really enjoyed their roasted duck.  The skin was so crispy and the meat inside was tender and juicy. Plus, the portion was generous for 5 dollars.", "author": "grace k."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-06-06", "description": "Hot diggity duck!\n\nhttp://www.yelp.com/biz_photos/0Yw-OWhZAU8BI852cx21ug?select=4pgA69Ao2Eth6PuchWOdXQ\n\nI'd dropped into Kam Po several times over the past few years to pick up components for dinner, such as some chopped up roast pork or a box of steamed rice, but I had never tried anything off the menu.\n\nI finally had my chance when I was working nearby yesterday. I walked in at lunchtime and stopped in my tracks...why had I never noticed before that the big menu on the wall is only in Chinese?\n\nI started scoping out what the 99% Chinese patrons and 1% smart tourists had on their tables and kept going back to the roast duck that an older gentleman seemed to be greatly relishing.\n\nWow. So incredibly flavorful. The accompanying steamed cabbage and white rice picked up the wonderfully rich brown sauce from the duck, and the duck itself was moist, tender, fatty goodness.\n\nI came thisclose to stopping back in later for another order for dinner but decided to wait. I'll leave the memory of that velvety duck percolating in my mind for another few days...let the anticipation build up. That way it'll feel like the first time all over again.", "author": "Valeria R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-25", "description": "IF POLICE OFFICERS EAT HERE, THEN YOU KNOW IT MUST BE GOOD.\n\nWent on a food run here today and got the Roast Duck over rice to-go. It was only $4.75! which, for roast duck is as cheap as you can get. The duck was not just skin and bones like other places I've had it and the butcher actually gives you good portion sizes. It's topped off with some steamed cabbage and soy sauce that soaks in with the rice magically.\n\nThere's also other poultry that looks mouth watering so I'll have to come back soon! Too bad they don't have any hot sauce.. I'm not too fond of the oily chili flakes but can't blame em.", "author": "Albert L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-12", "description": "great portion nice price.\nI love that they ask if we want the Char siu fatty or lean\nI like it lean.", "author": "Rina C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-05-07", "description": "I saw the reviews and thought I should finally try this place.\n\nWe had the duck rice plate and bbq pork. The BBQ pork was pretty good but overall just felt a little gross after eating it. Amazing $5 prices but yeah, not totally blown away. it didn't help that the chef had this ginormous mole with the longest hair ever sticking out of it...", "author": "Karen S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-10", "description": "You won't write a review unless it's super good or super bad. Kam Po is the former one. Every time I get a chance to go to San Francisco, no matter whether I am hungry, I always stop by and have my special triple combo meal. Although the service there maybe not that perfect but the FOOD definitely worth it, let alone the incredibly  reasonable price! Just go and get ready to be blown away!", "author": "峤"}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-10-26", "description": "Good..straight up  chinese food.  Super huge portions and cheap.  If your starving great place to stuff your gut.  99percent locals who couldnt have been nicer and tried to help us order", "author": "Steven K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-19", "description": "CHEAP. DELICIOUS. FILLING. CHEAP\n\nWhat more can you ask for if you can get a decent meal for just about $6! My favorite go to choice is the Roasted Duck with Lo Mien OR Wonton Soup. Regardless, they're both delicious and filling. These go around $5.\n\nThe place is packed during lunch and dinner time so be sure to get there early to snag a spot. It's so popular that they always seat small parties on the same table and just hustle and bustle the flow to get customers full and going.", "author": "Joyce M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-21", "description": "Great little spot if you want classic Chinese in China town!  The plates are big!  I recommend the garlic broccoli.  \n\nThe duck wonton soup is great and also comes with chow win noodles in it, so no need to order another noodle dish.\n\nAlso, they only accept cash!", "author": "David W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-05", "description": "Key word is CHEAP but quality is not sacrificed\n\nRice plate with choice of BBQ item is $5. Not $5 and some change, just $5. Char siu and roast duck are both great here. When you get it to go they fill up a whole box with rice, throw some veggies on the side, and load it up with greasy meat. Perfect for anybody on a budget.", "author": "Harry T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-06-19", "description": "How about the guy that cuts my meat don't handle bacteria and disease infested cash and then touch my meat which leads me to have diarrhea or worse and then they will deny it because I can't prove it. Fucking sick.", "author": "U L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-07-02", "description": "PLEASE LOOK AT THE PHOTO I POSTED BEFORE GOING THERE.\n\nThe table top containers looked like they haven't been cleaned in months!!! \n\nThe food was really greasy but cheap and the portions were generous. If you are okay with the EEK factor than this is the restaurant that suits you. For me, I think not", "author": "Pamela I."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-06", "description": "The roasted duck is succulent and so moist! This will definitely be my go to for roasted duck when I find myself in the Chinatown area.", "author": "Chauanh D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-11", "description": "Pork & Duck, their best in meat.  This place has been here since I was a little fry.  It doesn't have all the decor & glamour, but they don't need it.  When Asian businesses open up in Chinatown, it stays like that forever, the same, things falling apart.  Americans tend to fuss over furniture, seating, accommodations, etc.  Kam Po may not have all the glitz looking at it from the outside in, but it works.  Nothing changes hardly but they have it going on with a stream of patrons.", "author": "BanBan B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-24", "description": "Oh Hell Yes! WTF?\nThis is so deep shit!\nMust to get the HK style BBQ duck because, thin crispy skin and flavorful juicy meat.\n\nI hate myself for loving the Kam Po!\n\nMidnight, gettin' uptight, where are you?\nYou said you'd meet me, now it's quarter to two\nI know I'm hangin' but I'm still wantin' the Suckling Pig\nHey, Kam Po, it's a fact they're talkin' in town\nI turn my back and you're messin' around\nI'm not really jealous, don't like lookin' like a clown\nI think of the Roast Duck every night and day\nThe Roast Duck took my heart and the Suckling Pig took my pride away\nI hate myself for loving the Suckling Pig\nCan't break free from the things that you do\nI wanna walk but I run back to your Roast Duck over rice to-go.\nThat's why I hate myself for loving your HK BBQ duck \nDaylight, spent the night without your Roast Polk\nBut I've been dreamin' 'bout the lovin' the Suckling Pig\nI won't be as angry 'bout the hell you put me through\nHey, man, bet you can treat me right\nYou just don't know what you was missin' last night\nI wanna see your face and say forget it just for spite\nI think of the Suckling Pig every night and day\nIt took my heart and it took my pride away\nI hate myself for loving the 1/2 roast chicken meat & 1/2 bbq pork over rice \n\nI hate myself for loving Kam Po!\n\n..... shit, I feel like I am seriously drugged by tons of msg ..... and going to Hell .... tomorrow morning, ...... hope I can still wake up,..... and take a shit .... if I could ,... it'll be A bomb. Did you know that HK style bbq duck gets me a big bomb every next morning. every time I said my self, \"I hate myself for eating the shit!!!\"\nI will be dying, on X'mas day.\n\nUp date, I'm still alive! Merry X'mas!", "author": "Nobu K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-30", "description": "Huge portion of no frill Chinese delicatessen. Super duper cheap that makes you wonder what you got yourself into. Most people leave with a takeaway box after their meal.  Hidden away from the touristy spot of Chinatown itself. Wish I didn't have to tell anyone about it. \n\nPs. If you're extremely sensitive to how clean a restaurant has to be or spend too much time wondering if that table was well wiped down, please avoid this place...or Chinatown entirely. This place is clean enough but I know people who can't stand slightly damp tables. Heads up.", "author": "Amolrada T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-03", "description": "I've been coming here since I was an infant.  It's a family favorite and I appreciate that in the past 20+ years I've been a customer -- not much has changed.  The duck and roast pork from kam po is my favorite in all of the Bay Area.  Can't beat the prices of this historic Chinatown spot.", "author": "Dylan M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-24", "description": "To me this is as comforting as it gets; wonton noodle soup, duck noodle soup, you name it, you got it! To be truly honest, the roast duck is right on, it's juicy and fragrant. Good place for a quick lunch and with the crazy hilltop winds, you're served with a cup of hot Chinese tea, and i mean HOT! \n\nMaybe the place doesn't look much, but it has that hong kong old coffee house vibes, somewhere to get a great and easy bite without having to put on a suit. Parking might be a little bit of a pain, but if you want great food, then you'll probably just have to find one to stop by.", "author": "Ann Hui Y."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-09-14", "description": "2.0 Stars. I am biased. I know Kam Po can do better. They are off their game.\n\nTheir portions are still very big. Unfortunately, their prices are not rock bottom cheap.\nThey used to do a better job at tenderizing their beef or at least used better quality beef. My ordered bitter melon w/ Beef over rice. The beef was a bit chewy. Good hefty portion of rice.\n\nI ordered their Duck Won Ton Soup and it was $5.80. That's about the market rate. That's a problem... Kam Po is known to be cut rate...now they are on par price-wise. I think I counted 6 won tons in the soup. I believe it used to be 8. The won tons do not seem as tasty as in the past plus they're smaller, too. The Duck was still tender and juicy as always. Thank God. If they had messed up their duck...what's the point in visiting Kam Po's anymore.\n\nI keep coming back because I do enjoy their duck, the waitress with the pixie haircut is hospitable, and they validate the Chinatown Park N' Ride ticket.", "author": "Winston W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-08-11", "description": "This place is really terrible.\nDirty, smelly.\nWaitress has bad manner, rude.\nHere doesn't accept card.\nI ordered hainanese chicken rice and I got terrible salty boiled chicken rice, soup came when I'm almost done. Waitress asked for tips that she doesn't deserve.", "author": "Natcha N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-05", "description": "I come here to eat dinner with my mom sometimes. It's one of those places that I like coming here with my mom. I think the food is great! The place feels a little dirty though.", "author": "Hina W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-15", "description": "Super legit. I always love being the only white couple in a joint. Hong Kong style noodles and the Mongolian beef are standouts", "author": "Martin R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-03", "description": "Great fast food styled Chinese food. It is really popular in the area and really cheap. During rush hour you may have to share a table with people if you really need to eat. The atmosphere really gives you a sense of Chinatown. It looks ok in the photos but it more like one of those holes in the wall type restaurants. \n\nFood I recommend:\n\n-- The duck with rice\n-- Mongolian beef fried noodles (custom not on menu)", "author": "Andrew W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-20", "description": "The roast duck and barbecue pork over rice is delicious and best deal at $8.50. It's a typical loud Chinese restaurant with dodgy hygiene but it's what it is. Authentic hole in the wall.", "author": "N A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-18", "description": "One of my favorite restaurants in San Francisco. They have authentic Chinese food for a very low price. You get a massive portion of food tasty  which is always good for taking home for a late night snack.\n\nOnly problem is that they barely speak english, so do not try to make some extra wishes. They probably get it wrong....which can be really surprising in some cases!\n\nDefiantly best restaurant in china town!", "author": "Laurens F."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-09-07", "description": "This place has seriously gone done from previous times I've come. The food is salty and bland at the same time. I don't know how they do it but my chicken chow Marin had such salty vegetables and super tasteless chicken. The noodles were probably the best part of the dish. Just the noodles. Maybe the sauce that they were fried in helped a bit. \nWhen the bill came, and in the middle of packing up our leftovers, the waitress hurriedly comes back and waits for the bill. Instead of adding tip I decide to hold off and she asks about the tip. I tell her since she's in such a hurry she can pick it up later. I hate being asked for tips. I know this is in Chinatown and I shouldn't expect anything better but c'mon. Seriously? Can you not wait? Pissed me off. If my mom was not there leaving the tip I would leave nothing and tip her with some advice to treaty he customers a lot better and not ask for your tip.", "author": "Alex T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-10", "description": "One of the best places in the city! Sure the BBQ rice plates are the way to go but it is good to try other thing due to the great prices.", "author": "Mister T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-09-09", "description": "Look, it's Chinatown.  You're not going to Chinatown for ambiance or cleanliness (unless that ambiance is greasy counters and bad service).  You're going specifically to Kam Po for the amazing duck.  I have the distinct suspicion that anyone that's complaining about the cleanliness has never been to foreign countries and ate at the local street-food-type establishments.  I mean, that's why you're in Chinatown in the first place, right?  Authenticity?\n\nAs for the people complaining that the food there isn't that good, I have no idea about the other food there because I only go for the duck.  Just like I only go to McDonald's for a Big Mac not dessert and I only go to Peet's for coffee and not lunch.  I don't know why people would go to a place known for its duck and order beef and broccoli.  \n\nGet a whole roast duck or a $5 duck plate lunch; and if you're that big of a wimp, take it to go.  You won't regret it.", "author": "Matt S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-01-23", "description": "Here's the dirty on this place:  It's dirty.  But if you can get over that hurl, I meant \"hurdle\",  the duck, roast pork and the bbq pork is what's popular here.  We also like to order the curry Singapore Rice noodles, you order this and other menu dishes from the Lady, not with Mr. Cleaver.  Mr. Cleaver, the deli guy with the stern look, he doesn't like anyone, so don't take it personally.  Here's how you can have a smooth transaction: Know which cut of meat you would like before you get up to him. Would you like your pork fatty,  a bit fatty or with little fat, do you want a young duck or a large duck.  Just to let you know, a little fatty on the pork is the better choice of the three.  Have your money out, the longer you take the greasier your bag will be when he hands it to you.  It's a sick game, and I know it's \"fowl\"  here, but they do good chinese bbq here.", "author": "Chris O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-07-31", "description": "i love this place! For less than $7, you can get a lot of food that is not only tasy but also authentic. \n\nthe last time i was here, i ordered the claypot rice. the waitress told me i had to wait 30 mins, i told her fine. The wait was worth it! the flavoring of the meats and rice was amazing. Along with a side bowl of their house made soy sauce... perfect! \n\nfor $7 I got a generous portion of claypot rice, complementary winter melon soup and a plate of bak choy. Definitely worth it!", "author": "Connie M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-21", "description": "We came into Kam Po on a rainy Tuesday evening around 7:45 and sat right down without a wait. The menu is extremely extensive, but the husband and I are boring people, so I ordered the yang chow fried rice and he got chicken chow mein. And apparently both dishes come with soup, because we got soup without ordering it.\n\nBut ohhh... the pork! The BBQ pork in the yang chow fried rice is so delicious it should be criminal. Both of us stuffed ourselves and declared we were finished multiple times only to find our forks drawn back to the plate of fried rice for \"just one\" more bite of pork. \n\nOur entire meal came to around $10, and we took most of the chow mein and what little was left of the fried rice home, which was more than enough for my lunch the next day.\n\nAn elegant night out this place is not, but it's cheap, fast, delicious, and provided lunch the next day, which adds up to four stars in my book.", "author": "Whitney G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-11-02", "description": "My \"other\" go to place in china town...\n\nI usually go to Yee's because it's closer to work and I dig their happy hour but sometimes I'll trek the extra couple of blocks to Kam Po.\n\nFirst of all, Kam Po is almost always busy and there's little space; it's a squeeze to get in most of the time and if you are a larger person I would avoid it altogether.  Second; this place is pretty dirty, I haven't gotten sick yet (I eat here about twice a month) but if dingy restaurants are a turn off than don't bother.\n\nSo, why five stars?  The food is awesome and relatively cheap.\n\nMy favorite?  The roast pork lo mein!  The roast pork is super tasty and I love crackled skin; simply amazing.  The lo mein noodles come with oyster sauce and some steamed cabbage and a side soup.  The soup seems to be whatever extra pieces of whatever they have lying around thrown into a broth; sometimes it's just a broth with a  few pieces of unidentifiable goodness, other times it's packed with unidentifiable goodness. It think it's $5.60 or something; awesome meal.\n\nI've tried their other stuff and it's all good; congee, noodle soups, etc. etc. but I always come back for the roast pork.\n\nIf you are an adventurous eater, enjoy real chinese food, and can put up with a dingy crowded restaurant than this place is for you; it's a genuine hole-in the wall treasure.  If you're looking for fine dining, keep walking.", "author": "D D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-11-22", "description": "Ordered beef with veggies over rice....one of the simplest dishes to make.  Very little beef even for $6 a plate. Service was quick and efficient but the portion was very small.  Taste was good but not great. \nI've gotten bigger servings of beef from a gourmet food truck and we know their portions aren't big!", "author": "Doug W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-04-24", "description": "I have no idea how this place received a health score 86/100. They must have cleared the restaurant for a day and all night. I eat here because it's cheap and convient to my job. Other than that its beyond filthy though.", "author": "Tasha L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-09-13", "description": "Sorry I'm not a fan. Don't know why people are raving about this place. The duck is good. But so are all of the other million places in Chinatown... If you wanna wait 30 mins for an order and deal with a rude waiter/meat cutter..... Then be my guest. I won't be coming back here. I came here because I thought It was crowded so I assumed it would be good. Don't be fooled. Sometimes crowded places are not necessarily the best...", "author": "Eileen W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-25", "description": "Hole in the wall- good food. I grew up in this ghetto CT and this has to be one of the dirt cheapest place for some artery clogging food. I ordered my two item and quickly finished it. It was a surprise to myself-- since I have been on strike with eating rice... I scarfed down the yummy food.. and was so happy I wanted to buy some to go! \nOne of the best Chinese BBQ hole in the wall to go to!", "author": "Monika T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-28", "description": "Great prices, tasty food, big portions. \nThey have the usual selection of Chinese food, with porridge choices that get under $4 a serving. \nThe only thing is that since their kitchen is so open and they walk in and out of it a lot, the seating can be a tad sticky. Utensils and plates are always clean though.", "author": "Karen C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-02-18", "description": "What a big no no.\n\nI picked this place only because we were being mad rushed by Mr. Rushy Rushmore who wanted to pick the first dirty hole in the wall he saw - granted, we were all about to eat each other because none of us had eaten for hours- so we were all power walking - in hot pursuit for a decent looking CLEAN place to eat.  \n\n(Note - next time, bring more quarters for the parking meter.)\nI insisted we eat at a place with hanging ducks, which McRushmore was fighting me every hungry step of the way. The reason I wanted duck so much was because I wanted to compare the duck in SF compared to the best duck I had which is still in Philly.  \n\nSo which bullhead wins? Soju Soldier has nothing on Mademoiselle B - please. But she is a gentle soul so she does pick the 1st hanging duck restaurant she sees for Tiffy & Ricky are just innocent victims in this tug of yelp war.\n\nSo, we sit down at our first table. That day was a little chilly - so I have no idea why the restaurant had the air or a fan on full blast. So I suggested we move to another table. The others obliged because everyone was chillin like a villian as well.\n\nSo we sit in the cut of this restaurant and even though we were pretty much the only patrons other than 2 other tables - service is less than prompt. \n\nWe ordered only 4 dishes and didnt eat so much as inhaled the food. \nAll of us were in serious grub mode. Every plate was polished.\n\nHere's what we had...\n1.Beef Chow Fun (I always order this when I'm at a Chinese Restaurant) this had no flavor and no color. the worst I've ever eaten.\n\n2.Crispy Pork - the best dish - it was not oily, the breading was crispy and the pork was lean. \n\n3.Mixed Vegetalles Dish as they call it - had bean curd and thin glass noodles in it as well - pretty yummy - just wished they used more fresh veggies instead of the canned vegetables \n\n4.Duck on Rice bowl - no duck meat was on the tiny 6 pieces of duck we were supposed to receive. Should be called duck skin on rice bowl.\n\nNOTE: I am a fantastic food photographer even with my old digital camera so do not be deceived by my photography skills and be suckered eating here.\n \nAll in all - I say a yummy, non-rushed, leisurely meal was wasted by eating here.", "author": "Enjella L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-07-12", "description": "Crazy cheap. Crazy good. Crazy busy!\n\nFood = plentiful, savory, delicious, and just filling!  Presentation = good.  Noodles, rice, wonton soup, congee/jook, and some stir fry dishes.  Come here for their BBQ though... innards, duck, roast pig, BBQ pork, etc.  Oh yeah...the duck here is LEAN.  No, not fat-free, lardbutt, I said LEAN (as in not all fat!)\n\nService = hustle, bustle but super friendly!\n\nDecor = throwback to 1980's NY Chinatown joints.  \n\nSeating = simple tables and chairs.  If it's busy, expect to sit with a bunch of unknown people.  They'll keep the tabs SEPARATE.  \n\nPrices = cheap! Cash only, yo!\n\nOverall, we'll be back...whether it's take out for dinner fix or quickie lunch fix.\n\nQuasi-Chinese Lesson of the Day: \nKam Po...is the same phrase as the words Kung Pao (in Chinese characters)...which is derived from  gng bo , literally, palace guardian.", "author": "Fannie S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-06-07", "description": "My girlfriend and I just found a MAGGOT in her Chinese broccoli. We politely told them, showed it to them, and they did nothing. We told them we wanted to leave, and they brought the check! Haha. Left a $20, won't be back. It took this to happen for my first ever Yelp review. I'll stick to Henry's Hunan.", "author": "Curt P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-03-18", "description": "Okay so I am pretty much a fanatic of all things duck. Roast duck is what I refer to as \"O.G Duck\" (Original Gansta Duck) since it's the first kind I ever had. I've been eating it since I was a wee munchkin and have experienced very awesome versions and not so awesome version. \n\nKam Po had the former - the duck was succulent, wasn't just bone and skin like some places (although I'll never turn down duck skin, let's be real). It was greasy, yes, but wasn't overly so. Super flavorful, delicious, moist, everything chinese roast duck should embody. \n\nHere's where 2 stars (and potentially three) were deducted. I walked in at 7pm on a Saturday. The restaurant was somewhat busy but there were a few tables open. Everyone was already eating already so in theory, I should have been helped right away right? \n\nWRONG. \n\nI was ordering half a roast duck to go. I walk in, say hello. Three guys, include the butcher, look up. No response. The waiter goes back to filling tea kettles. The dishwashers continue washing. The butcher goes back to putting lids on condiment containers full of sauce. NO ONE ACKNOWLEDGES ME. \n\nI literally watched the butcher put lids on 30 sauce containers ( I know bc I had enough time to count all them) and then he started putting them away in a box before I cleared my throat loudly and asked to be helped. \n\nAt that point it was pretty smooth sailing (minus some english/chinese language barriers). Regardless, I understand when you go to Chinatown, especially one known for FOOD, you will get shitty service. This is to be expected. But at least when I walk into most places, they acknowledge your existence. Jesus. \n\nAnyway, I will go back maybe but will continue to shop around. If y'all know of anywhere that does Roast Duck better, holla at me.", "author": "Carmen K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-03", "description": "Likes: inexpensive Chinese food, quick service, fish congee, won ton noodles, dry pan fried beef flat noodles, pork with the crispy skin\n\nDislikes: didn't really like the won ton for some reason, tasted funny.  parking not", "author": "Karen M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-12", "description": "I came here with my brother when he came to visit me here in SF. He said he wanted \"authentic crispy duck\". Authentic crispy duck is what we got! The duck was so flavorful and absolutely fantastic. We ordered a whole duck, kung pao beef, sweet and sour chicken, and bok choy. All of our items were absolutely phenomenal. I'm looking forward to coming back here again.", "author": "Noa R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-07-01", "description": "My buddies told me about $5 duck rice plate for a while now and I was thinking \" wow what a great deal, lets go try it one day!\".\n\nWell that day finally came and as you can see from the score I gave them, you can tell shit probably happened. We sat in and I was excited waiting for this duck rice plate my friend kept boasting about. Our food finally came and as I was eating half way in, I realized a lot of my duck pieces were pinkish. I looked at both my friends' ducks and it was gray, so I thought something is wrong here. \n\nMy friend called the lady to the table and I spoke to her in Cantonese. I asked her, \"how come my duck is so red?\" She replied only one piece was red and I was flipping through all the pieces I did not eat and I pointed out that my friends' ducks weren't red or pink at all! She kept denying the restaurant's mistake and told me to take it home and microwave it! What a slap in the face to the customer. \n\nI did not tip them at all because most of my food was inedible... I will not come back no matter what people say about this place. Surprisingly a high rated restaurant turns out to be illegitimate. If you go home with a stomach ache, I would not be surprised. \n\nFood sucked and service sucked, that's a double zero. If you are hungry in Chinatown and have a tolerance for crap, then be their guest. They will be happy to get $5 from you, I am sure of it.", "author": "Victor Q."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-01-04", "description": "I'm not sure why this place gets all the 4 and 5 star ratings.   It was ok for was ok for what it is but I'd say average at best.  I am from NY who has the best China town there is.  I guess I had my hopes too high.   This place would not make it in the big apple.", "author": "Shane C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-03-11", "description": "This is my new favorite Cantonese restaurant in SF. It reminds me so much of the dirty and grungy restaurants that I frequented when I lived in China -- none of which would ever pass a standard health inspection, but all of which are always crowded because of authentic, delicious Chinese food at outrageously low prices.\n\nIf you can stomach the unsanitary environment (including very questionable silverware -- e.g., deep brown stains on white soup spoons) and don't mind stuffing yourself into a crowded, loud space (during weekend lunch rush hours), then you're in for quite a treat at Kam Po. \n\nI'm actually surprised at how good the service is here -- on the surface, Kam Po should have the laughably-horrible customer service that we've all come to accept and love from Chinatown restaurants. The two waitresses were unbelievably busy, but always made time to come fill up our tea and bring us whatever we wanted. They even cracked a smile once or twice.\n\nThe most entertaining spectacle of the restaurant, however, is the butcher behind the counter, elevated as if on a stage. This is someone who possesses a razor-sharp butcher knife as an extension of his arm, slicing and chopping through pork ribs and duck necks in a way that looked strangely artistic. You could imagine a Beethoven symphony playing in the background as he beautifully butchers the back bones of a suckling pig. Benihana performances ain't got nothing on Kam Po. \n\n--------------------------------------\n\nFOOD:\n\nRoast Pork = Incredible. The skin was perfectly crispy and the meat was unbelievably tender and juicy. We got there a little late, so the meat was a little cold from hanging on the hook throughout the morning, but the juiciness wasn't compromised in any way. I can only imagine how delicious it must be immediately after cooking.\n\nRoast Duck = Pretty good. I'm more of a fan of the Beijing-style roast duck with the crispy skin than this kind, where the skin is soggy from sweet and sour sauce. The meat was very tender, but I just don't really like having it drenched in so much sauce.\n\nPreserved Egg & Pork Porridge = Possibly the best preserved egg porridge I've had in San Francisco. There are so many full flavors packed into this porridge that it makes every bite delicious.\n\nGarlic Sauteed Pea Shoots = Loved it. It's a little oily, but the garlic flavors explode with each bite. The pea shoots are very nicely stir-fried, without being overcooked like they usually are. Keep in mind that it's actually pretty-hilariously written in Chinglish as \"Garlic Pea Sharts\" on the menu. I want to give Kam Po an extra star just for that.\n\nTotal: $20 after tax & tip. Yes, it was seriously that cheap.\n\n--------------------------------------\n\nKam Po is like a wonderful slice of the true Chinese neighborhood experience. I've tried many restaurants and delis in Chinatown whose food is comparable to (and probably even better than) that of Kam Po, but Kam Po definitely delivers the full experience that I love most about Chinese restaurants.", "author": "Roy C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-12", "description": "This place has really really good food. Got two different chow fun dishes, green vegetables, soup, roasted duck, and pork. (Yes my family eats a lot...). Everything was delicious and cheap! Service was fast too. Would definitely come back!", "author": "Carolin F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-02-25", "description": "Tried this place because I passed by and the smell of wonton noodle soup drew me in. That's how my bf and I found our beloved wonton place in HK so we thought we had found the ONE in SF. \n\nHowever, this place was a bit disappointing. The staff of two middle-aged women were welcoming and super nice. We got the huge chicken leg as a side and duck wonton noodle soup. The chicken leg had good flavor on the skin- soy sauce-y but the insides were a bit too dry. THe wonton noodle soup base was good and light. THe wontons were pretty good-had a lot of shrimp and yellow chives. However the noodles were not so good. Tasted wheaty and a bit dry. Did not have any elasticity. \n\nBut haven't tried any other bbq meat/wonton place in SF so I'm not sure how this is compared to them. It's decent I guess.. but nothing compared to the ones I've had in HK or NY's Big Wong.", "author": "Elizabeth N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-31", "description": "The best roast duck and roast pork in Chinatown. The Chow fun and HK style pan fried noodles (chow mein) are top notch too. Very good Wonton, meaty morsels wrapped in just the right thickness of Wonton skin. Atmosphere for dining is undesirable, prefer to order to go. The food is actually deserving of 4.5 star rating.", "author": "Paul L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-29", "description": "Cheap, quick fix if your hungry. Little on the oily side but what you expect from a fast Chinese joint. I go here weekly", "author": "Tinh T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-26", "description": "Was looking for a place to eat for cheap in Chinatown and a friend of mine suggested Kam Po to eat dinner. When we first sat down the table was a bit sticky and was a bit cramped with small tables but I don't really mid that as long as the food is food. We ordered seafood food rice and it can pretty fast and the flavoring was pretty good and it also came with house soup. Would return to try some of there B.B.Q. later on.", "author": "Peter C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-31", "description": "Kam Po has, hands down, the best BBQ pork in the city. The porridges are authentic and delicious as well. It's nice to know that I can always count on piping hot porridge any day of the year since they are open all year round. Take note that they do not have a takeout menu available and it is cash only.", "author": "Jessica K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-06", "description": "San Francisco has some really great Chinese \"chop\" houses serving up heaping dishes of BBQ duck, BBQ and roasted pork, and several varieties of chicken over rice, but there is only one the I've been coming to consistently with my dad over the years.  Taking a break from our urban exploring, my buddy and I decided to drop in for some solid Chinese food to fill our empty bellies.\n\nWe decided to sample a little bit of everything and ordered two-item plates of BBQ pork, cold-boiled chicken, roasted pork, and soy sauce chicken over rice.  While the cleanliness is a bit suspect, all of their meats are top quality for a Chinese restaurant.  Everything was very meaty and generally devoid of excessive fat, and the portions were huge.  If we knew that we wouldn't have to walk around with it for the rest of the day, we probably would have taken the leftovers home.  In fact, there was so much food that we probably could have just shared a single plate between the two of us.\n\nWhenever I'm in North Beach, I'm pretty much drawn toward Kam Po for lunch.  It's a fantastic bargain and I would normally be able to make two meals out of the one, saving a lot of time and money while enjoying great food.  For the price of a fast food meal, I can get some of the best, authentic, Hong Kong-style BBQ short of actually going to Hong Kong!\n\nFood: 9/10\n\nService: 6/10\n\nPrice: $\n\nAtmosphere: 6/10", "author": "Joe M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-01-14", "description": "Food was pretty decent.  Foo Young BBQ Pork with Rice was not what we expected at all.  The prices were very affordable, we haven't seen prices like these at a Chinese restaurant in years!  I posted pictures of the menu if you don't believe me.  The food was not particularly amazing, but the for the price, I would definitely come again!", "author": "Alissa Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-12-21", "description": "I always always always come back to Kam Po for lunch whenever I'm in Chinatown. Even if I'm stopping by, I'll get a box to go. The best is the roast pork and the FRIED RICE! Omg, the aromas of all the meats mixed together with the rice makes me drool every time. At $4 a rice plate, you really wonder if they are even making a profit. So cheap! And they give you a lot of rice and a side of veggies AND delicious complimentary soup.\n\nDon't come expecting excellent service or anything- the restaurant is CROWDED. You'll be sitting with other people, your tables are less than a foot away, and it'll get awkward. But it's all a part of the experience! Sit down, don't put your bags in the aisles, shut up, and eat your food. It's Chinatown.", "author": "Sally C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-11-21", "description": "Still a fan.  Last meal there was ok - soup noodle was lacking a little flavor but you still can't beat the price, portion and speed.  \n\nFor the first time, we ordered stuff to go.  We called to order soy sauce chicken over rice and a beef chow fun to go on our way home and they were ready when we got there less than 10 minutes later...here's the topper, $8.90!  2 orders including tax - $8.90!  Crazy.  It was damn good too. \n\nWe ordered to go again.  This time, roast duck over rice and bitter melon and beef pan fried noodles - $9.80!  Still under $10!  \n\nFast, cheap, large portion...this is the place.", "author": "Gloria H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-03-20", "description": "OK - I love finding the \"out of way\" local place that serves authentic food for a good price.  This is that place!  If you are looking for an American restaurant that is clean and neat where you do not have to rub shoulders, stay away!  \n\nWe walked in and the waitress asked a local to share a table and gave us the 4-top where he was sitting (we had 4 people).  At first I was worried that the other couple would be offended by the disorder or the ducks hanging in the window or possibly the large cooked pig that was hanging by its rear legs with cooked juices dripping in to the sink.  Thankfully, they were as adventurous as us!  \n\nThe food was amazing, the service was fun to watch, and the entire time we were dining, we were the only Caucasians in the place.\n\nLOVE IT!!!!  Get the duck!", "author": "Chris J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-04-25", "description": "Loved the shared tables at this place -- we shared with two old Chinese ladies and tried to order what they did. But they ordered so much food, we couldn't keep up! There was bbq pork, steamed chicken, wonton soup, fried rice ... it just went on and on. \n\nKam Po was very cheap, though other reviewers are right about the sticky tables and cramped conditions. Also, it's pretty tricky to figure out what to order (and you can go really wrong that way), so it's best to read more detailed Yelp reviews before arriving (which we hadn't).\n\nKam Po was lively and fast, but I didn't think the food was actually that spectacular. It certainly has a dedicated local following, so they must be doing something right.", "author": "Jesse A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-09-16", "description": "Just as I was complaining to a friend that there were no cheap Chinese places of quality to eat in Chinatown I found this place.  \n\nMy friend and I stuffed ourselves from a plate of HK style house chow mein and Hainan chicken for $10.50 including tax.  And it came with free house soup.  Given we had to pack the leftovers home, it came to like $3 per person per meal tip included.  That's what I call good price-value ratio.  Actually, that's what I call - \"time to stop cooking because it's cheaper to eat out.\"  That's it.  I'm done with cooking.\n\nI'd had HK Style House Special Chow Mein at a few other places, but they were usually like $10.  Granted you didn't get a tonne of seafood (just shrimp), but there were generous portions of meat.  Instead of being dried gross BBQ pork, their slices were tender.  I guess they must be popular for their BBQ stuff as there was a lineup out the door when I walked in.\n\nDon't use the bathroom though.  Or practice getting really good at holding your breath for very long extended periods of time first.  I don't know how I didn't pass out immediately from the toxic fumes from that thing.  Ewwness.", "author": "Pokin Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-22", "description": "There are two things for certain when coming to Kam Po: 1) you'll probably be eating at a greasy-looking table wiped down by a towel about 3 months past its prime; 2) the food will be ridiculously good. So if you can overlook #1 (when did we all become such sissies in SF?), then you're in for a treat.\n\nKam Po is definitely my go-to spot when I'm hankering for roast duck, roast pork, bbq pork, or any other culinary treat that can be hooked and dangled in front of a window. In particular the roast duck wonton noodle soup is my favorite in the city. The wontons are super flavorful, perfect ration of meat to wrapper without that weird gummy consistency, and don't make me feel like I'm eating dumpling bought from Costco; and they are definitely not at all skimpy on the roast duck portion which is more than generous.\n\nKam Po is one of those places that actually feels and looks like what one would imagine to be an authentic Chinatown restaurant.\n\nLooking forward to my next bowl of soup!", "author": "David H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-07-19", "description": "Service here can be crazily bad! We waited 25mins just for them to take order. Food are not bad, but I don't think you can enjoy the food anyways with this bad service.", "author": "Qiaosi C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-24", "description": "Definitely a hole in the wall. One waitress for the whole place (albeit a small place). But the crowded tables tell you that people think it's worth the wait and then some!\n\nDishes were ordered for me and everything tasted pretty great. Just ignore the fact that the waitress takes orders left, handles money, wipes down tables, and serves food without washing her hands between any of it. :D\n\n8 people were fed dinner for under $60, with leftovers for the next morning. Definitely a bargain in San Francisco.", "author": "Eva N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-08", "description": "Yum!  Great, authentic Chinese food! I was very pleased with the food each time I came here with friends.  However, the environment wasn't the best.  The bowls and tableware was sometimes dirty-ish, and the bathroom is a bit scary.  Feels just like China though.", "author": "Aishan S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-07-01", "description": "Crazy cheap Hong Kong BBQ joint!  I was afraid to order the congee (they have a dozen kinds) because it was so cheap (under $3) and no one had ordered any.  Rice and noodle plates seemed to be the most popular items.  You can get pig's feet, organs, kidney, tendon and liver.  We shared a table with a guy who was digging into beef & bittermelon with rice.  It's a full size dish for $3.50!  And you get free hot tea.  Don B. accidentally drank someone else's tea!\n\nI ordered dumplings ($3) figuring that was a safe bet.  You get 7 large dumplings, some bok choy and a shrimpy broth.  The dumplings had very thin skins and they were filled with chopped shrimp, wood ear fungus, bamboo shoots, chives, etc.  They were good but I was hoping for juicy pork dumplings.  These weren't juicy.  I had two cubes of their roast pork - one piece was very chewy and dry and the other was pretty good.  \n\nIt looks like Kam Po has been here forever.  They've got ducks and pigs hanging in the BBQ area.  People share sticky tables in close proximity and the place is filled with Cantonese (locals I presume).  A true hole in the wall. I gave them another star just for their prices. It must be cash only.", "author": "Lolia S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-01-26", "description": "Kam Po Kitchen's updated their menus for 2010 (see pictures) and now includes clay pot Porridges and clay pot rices.\n\nThe prices are a tad higher than before but it's still a great place to go for $5-6! I've never eaten here, but we always order stuff to go every week all year long! Although it can take 30 minutes before it's ready, the clay pot rice dishes are excellent. Their porridges are always a good choice to warm your body.\n\nThe Roast Duck, Roast Pork and Soy Sauce Chickens great choices for when you're to lazy to prepare the \"meat\" at home.\n\nOther favorites include: Singapore Style Vermicelli, Beef with Scramble Eggs over rice and Beef Stew Won Ton Noodle Soup", "author": "Peter L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-02-21", "description": "If you're looking for a cheap chinese meal, this is the place to go. The portions are also quite big considering the amount you pay.  The roast pork was very fatty and juicy. However, the wonton skin was not as silky smooth as I normally prefer.", "author": "Tina W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-09-02", "description": "Food had little flavor. Had soup, fried rice and a tofu dish. Would not go back.", "author": "Sara R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-10-10", "description": "Service is terrible. Duck won ton soup is mediocre at best. Perplexed on why this place is so highly rated when there are far better gems in Chinatown. Skin on the duck was not crispy, broth had bits of bone debris in it. Yuck.", "author": "Arthur N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-25", "description": "This place is a true Chinatown hole in the wall that has CHEAP food in remarkably large quantities. 4 stars for the large quantity and cheapness, 3 stars for the food taste.\n\nI ordered the roast duck and beef chow fun. The beef chow fun lasted me at least 3 meals. Really greasy, but super worth the $4.30 I paid. The roast duck was probably drenched in sodium, but it was still pretty good with the rice underneath. Also less than $5. What a steal.\n\nAtmosphere is very grungy-esque, but still, lots of people on a Tuesday evening.", "author": "Adele Z."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-09-01", "description": "First time at this spot out of the many, many times I've been to Chinatown. It is sort of hidden on Powell and Broadway away from all the other restaurants off of Stockton and the lower part of Broadway. It was one of the only places open at around 7pm on a weekend. I was with two of my white friends who had never been to Chinatown before and hardly ever eat Chinese food. I felt bad for bringing them to some place that I've never been to, but it turned out to be OK.\n\nWalking in this place looked like any other to-go Chinese place with roasted duck and chicken hanging in the window and cooked foods in heated plates on the side. However, they also had a good amount of seating on the inside. There were a good amount of people. Couples, families, and just random people there to grab dinner. It took a while for us to get seated and a menu because there was only one \"hostess\" who was running around taking orders, serving, boxing, and cleaning.\n\nWe got three dishes: beef chow fun, beef broccoli chow mein, and bbq pork over rice; and  we also got a free soup. The food was extremely oily. Nothing was special as the bbq pork was fatty and dry, the beef chow fun was oily and the meat was dry, and the beef and broccoli was kind of bland. The soup was probably the best part of the meal.", "author": "Kevin H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-12-22", "description": "Nothing special here. Came for the beef chow fun and it was just OK. The people at the table next to us all got some egg noodle duck stir-fry, so maybe that's the item to order.", "author": "L L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-11-13", "description": "I got the Beef & Fried Egg Rice plate, which had a strange gelatin all over it. It looked like they poured raw egg drop soup all over it. The soup it comes with had a tasty broth. I may come back may not. Average.", "author": "Bonnie N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-11", "description": "So cheap and good. A Chinatown staple for roast pork, roast duck and bbq pork. Each of the meats were tender and flavorful. They are familiar to my taste buds and comforting to my tummy. The bbq meat order comes with a huge serving of rice, meat and veggies. They will ladle sauce over it. Cheap comfort food that opens til 8 pm.", "author": "Eve C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-08", "description": "I ordered the rice with roast duck.  It was awesome!  Very tender and flavorful duck.  The meal also came with soup and some cabbage.  My mom got the rice with roast pork.  It was good, but can't compete with the duck.  Service was good.  Everyone else dining there was Chinese. Seems like an authentic place.", "author": "Susan P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-05", "description": "It's greasy. it's cheap. It's authentic.\n\nAll the roasted/barbequed pork/duck/whatever's hanging on the walls you can possibly imagine, for $5.\n\nIf this ain't your spot for Chinese food...I really don't know what is. Probably should go with someone who speaks Chinese though, otherwise ordering could get a little complicated. It's that legit.", "author": "Anthony L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-30", "description": "Very reasonably priced, extremely tasty.  A basic BBQ butcher counter with restaurant attached.  Staff was very accommodating of our group order, and the food was quickly prepared and delicious.  The atmosphere is not fancy, but the quality and value were outstanding!", "author": "Jay S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-06-02", "description": "I used to come to this place after school every Saturday. It was the tradition that kept me going to Chinese school.  \n\nThe food here is good and fast. There are two women who work and they seem to have boundless energy. It might also have to do with the fact that I'm never here unless its around lunch time.\n\nIt's a small place, but the women make it work. There's really only two places to walk between tables, which makes dine-in a little less disruptive from other customers. If you're looking for a quiet place for lunch though, its not your best bet.\n\nThe food here is made very well. Most recently, I had a Chicken and Bok Choy dry Flat Noodle (I have no idea how to say this in English), and it was really good. The Chicken was lightly fried and the Bok Choy was cooked well.\n\nThe only reason I'd give this place 4 stars instead of 5 is that the silverware for dine-in is questionable and its really crowded all the time.  But that's only for dine-in. Take out is fast and great!", "author": "Lily W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-10-16", "description": "not great but i don't know where else you can score duck for five bucks\n\nbesides, i enjoy seeing the deadstock through the glass in front", "author": "Clark G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-28", "description": "I was debating of going here for an early lunch or to the Mee Heong Bakery for their spareribs and rice. The bakery had 5 tables and was packed. This place had a decent amount of elderly people. And when you see elderly Chinese people in a restaurant one knows the prices are good.", "author": "M C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-10-11", "description": "If you are looking for a hole in the wall Chinese restaurant, this would be the place to go. Price is incredibly cheap and the portions are very generous. If you are not too hungry, you can definitely order 1 dish and split between two people. For certain dishes, it comes with a soup as well. But other than the great value of the food, the restaurant offers little else. The service is lacking and sanitation is questionable. But I guess you can't ask too much from a Chinese restaurant in Chinatown", "author": "Teresa W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-09-03", "description": "A quick BBQ spot on the corner to get a quick BBQ fix. Most of the time when Im there I always ordered the BBQ pork over rice plates, besides that they have other traditional easy made fast meals typical chinese food too. If you happen to dine there, if youre lucky soup is on the house. \n\nIts not a nice place to be, but what can you say its cheap and good, even the police officers and meter maids stop by to eat here too.", "author": "Linh D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-24", "description": "Like eating at grandma's house. Everything fresh, piping hot, delicious, home cooked traditional Cantonese \"comfort food.\" Inexpensive, fast, real. Consistent over the years. Their Cantonese BBQ is one of the best. Eaten here hundreds of times with my fam and friends and NEVER DISAPPOINTED. Good food, Aww shoot. Now I'm craving their \"syu yok ap fan\" (BBQ roast pork, roast duck combo rice plate lunch) and it's 1AM!! What do I do now?! Can't wait till tomorrow lunch. GOOD FOOD. nuff said.", "author": "George F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-10-20", "description": "another 5 star review for food only.  \n\nchinese people get scared away by this place - so this is a warning to all non chinese people - this is a hole in the wall.  its been this way for years, and the food is excellent.  ignore the fact that it looks \"gross\" (aka normal chinatown).\n\nthe service is fast, done by one gal who is pretty damn good at her job.\n\nthe soup noodles are top notch - we had bbq pork spareribs with noodles, and crispy roast pork with wonton mein.  both items were under $5 (each was $6 including tip).", "author": "Jason J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-11", "description": "cheap, dirty, delicious. That probably sums up Kam Po Kitchen.\n:)\nMy grandparents live up the block from this place, so I basically grew up walking past this establishment. I recently came here for dinner with my family. \n\nMom: Chicken and salted fish fried rice\nDad: Peking duck over rice.\nBrother: Beef and tomato with pan fried noodles with extra sauce.\nMe: Fried flat rice noodles with no beef\n\nThe bill was $20.20...that's pretty damn cheap. Where else are you going to find a place with yummy Chinese food for four adults around 20 bucks in Chinatown! \n\nPS, the chili hot sauce on the tables are to DIE FOR.", "author": "Tiffany L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-02-18", "description": "It was cheap. Yes, but not clean at ALL. I get it, the \"hole in the wall\" spot is charming and always has delicious food - but this spot just takes the cake for dirty. I appreciate small, dinky spots that are cheap and yum, but Kam Po is just too much.\nI called in an order about 30 minutes before and they didn't even start cooking it until we arrived! Our won ton soup was cold, they don't have potstickers and the chow mein was bland. \nWill I be back? Maybe, it's so close, but I'll try out the other 400 options in the 5 block radius first.\nBottom line: it's dirty.", "author": "Francesca F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-08-15", "description": "A shabby and authentic Chinese deli. (Or that's what I'm told. What do I know from \"authentic Chinese deli\"?) The restaurant is usually crowded, and there's a line at the counter where you try to tell the guy with the huge cleaver what you want. He's surrounded by all manner of cooked ducks, chickens, and pork ribs, plus vats of chicken-feet, intestines, and various mysterious glistening things I don't know what the hell they are. The menu is huge, full of typos and authentically contains things you wouldn't be caught dead eating, but also includes duck, pork, noodles, soup, and congee. The service at the tables is slow, and the staff's knowledge of English is spotty. \nHowever, the duck is wonderful. The skin is crisp and tasty, and the meat is juicy. I've had a pork and noodle dish that I really liked, and some random soup that was also good. The barbecue pork is swell too. I accidentally ordered congee (rice porridge) once, not knowing what it was, and it was filling but seriously bland. (I think it's supposed to be that way.)\nThe place is not as clean as it could be (I dinged it a star), and the staff gets impatient with non-Chinese speakers. But I've enjoyed my meals there, and I'll happily go back if there's an open table.", "author": "Paul M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-06-16", "description": "The place is crazy cheap for food.  You may get food poisoning but its cheap!  Most dishes are $5.  The BBQ meats are kinda gross though.  The duck is good as long as its warm.  They served cold roast pork and duck.  When these items are served cold the fat is disgusting.  I'm always sweating so my fat is nice and soft.  Getting a table is a shit show.  +1 star for the price.", "author": "Fatty A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-22", "description": "This place is always busy that must count for something right???  been coming here for the last 13 years and the taste of the food hasn't change a bit. The soysauce chicken, roasted duck, roasted pig is amazingly good and crunchy. From noodles to rice plate you name it im pretty sure you will love this place for their prices and great taste of chinese food", "author": "Allan A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-12-11", "description": "I always order the duck here. And it's always 4.70 for a lunch meal. About as cheap as it gets. Seating is pretty limited so I always get it to go and eat it in the park a block away. The whole duck is great as well. A terrific design of nature. Enough fat on one bird to confit two legs, plus the carcass left over to make a sauce. It's a self contained dinner that even comes with its own cooking element.\n\np.s. the guy chopping up the birds has probably been working there for years but everytime I say \"duck\" he acts like it's the first time he's ever heard the word. If someone wants to fill me in on how to say \"duck\" in canto that'd be great.", "author": "B C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-31", "description": "Huge portion of roast meat on rice for $7. The duck is delicious and fatty. The roast pork I had was a bit dry, so I'll probably have to try it again to see if its just a one time incident. \nYeah, the restaurant is dirty and the tables and chairs are sticky; what else would you expect.", "author": "Jun W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-23", "description": "It's cheap, greasy, and Chinese.\n\nWhat's not to love?!\n\nI came here with my in decisive sisters and after walking around Chinatown with empty stomachs, we ended up here. My sister is a regular here so she knows how to order.\n\nBecause of her, I continue to learn how to eat.", "author": "Karry D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-05-09", "description": "Kam Po Kitchen is the one place that, I have not gone back in a very very long time since my high school days!!!  I am surprise that this very old chinese restaurant is still here for such a very long time. The food item what, I like most when coming here for lunch at Kam Po was having their Hong Kong Style Pan Fried Noodle. Kam Po Kitchen is not that bad of a place their food is not that bad at all and the food prices are very cheap.", "author": "William B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-17", "description": "I ordered the Roast Pork... LOVED IT! it was so flavorful, juicy, and the skin was still crispy after about 2 hours sitting in the car. \n\nThe cha-sui was a little too fatty, next time I'll ask for non-fat instead of half and half. \n\nThe location is good and the bbq  is cheap.", "author": "Elsa Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-26", "description": "It's great! They have all your Chinese meat and butchery stuff here! Steamed chicken, BBQ pork, and some rice plates/entrees. I really like the ginger sauce that comes with the steamed chicken. It's crowded (C.Town is always crowded anyways) And it's yummy! $21 for steamed a whole chicken and 1lb bbq pork? FANTASTIC BABY!", "author": "Kevin C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-04-27", "description": "Ambiance : -2.5 stars  (yes, minus 2.5)\nCleanliness : -2.5 stars (another minus)\nRoast Duck over rice :  10 stars (a TEN? yes, indeed...)\n\nSo, they add up to 5 stars. \n\nThis is one of those hole-in-the wall in SF chinatown that offer generous portion of authentic cantonese food for a bargain.  The grandmas and grandpas in chinatown who frequent this joint don't seem to mind the presentation but they definitely won't tolerate anything that is less than perfect roast duck, roast pork, BBQ pork, or won ton noodle.  At least that is my theory as to why their signature food is so good.", "author": "perry h."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-08", "description": "Oooo the memories this place brings back! Once upon a time when my parents weren't too busy from work, we actually trekked to Chinatown each weekend to spend the day grocery shopping and eating! \n\nI loved the days when we walked up the hill and I would get excited to order my usual, Beef Stew Ho Fun Noodle Soup. It was theeeee best! My brother always ordered the House Crispy Noodles and it was the most magical concoction I've ever heard of. They are noodles that are deep fried shaped like a bird's nest and topped with stir fried meats and veggies with sauce that makes the middle soft but retains the crunchy side of the noodle. It's a great combo. Called Chien Mein (translates as crispy noodles)  and you can have it with chicken, beef or seafood. The house crispy noodles includes intestines or livers, so if you're up for the challenge, try it!\n\nI continued to come back here for lunch without my family when I grew up old enough to go out by myself. I brought my boyfriend here when we first started dating after school since we went to Galileo and he loved the crispy noodles! He never heard of it before and couldn't believe he was deprived for so long. It's also dirt cheap! its only about $3.50 for a whole plate that can fill you up. In fact, everything here is dirt cheap. I know it's probably not the cleanest place, but hey, I grew up in Chinatown and the food there probably helped me build immunity to a sensitive stomach and I can eat practically anything. Thank you? \n\nDon't think about the hole in the wall place, you'll forget all about it as soon as you see, smell, and taste the food!", "author": "Connie C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-06-08", "description": "Why oh why didn't I walk out when the couple next to me found a bug in their food. But nooooo, I stayed and how I wish I didn't. Absolutely the worst Chinese food I ever had. I had the BBQ ribs which not only tasted nasty but appeared cold. Stay away!", "author": "Barry P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-02", "description": "This is the best Chinese food I've ever had in US. Very authentic contonese. If you are looking for great taste, big portion and reasonable price, this is where you wanna go. More importantly, the owner of this place is great! I've been there several times and once my parents left their bags with important belongings and they kept those bags and waited for us to go back and pick up.", "author": "Jonathan C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-31", "description": "Quintessential hole in the wall...and it was delicious. \n\nWe had: roast pork and rice, roast duck noodle soup, and beef and tofu over rice. The beef and tofu was average, but the roast meat items were standouts. Looking around, I knew the place was legit because we were surrounded by old Chinese people.  Each item was less than $5. Service was super fast, though not exactly friendly. Whatever though, you come to this place for the food - especially the roasted meats. \n\nCan't wait to come back again!", "author": "Jennifer K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-21", "description": "This place is not exactly hole-in-the-wall, but hole-in-the-wall prices for sure.\n\nThis place used to be my mother's go-to place for roasted goodies like duck, pork, chinese bbq pork, etc.  And their roasted duck tasted just like the one from Hong Kong.  Very authentic, cafeteria style eatery spot with tight seatings.  kinda dirty, kinda just like hong kong too....\n\n5 bucks get you a nice huge lunch plate with your choice of meat with complimentary soup.  $10 bucks for 2 people with leftovers for the bf as snack.  One of my all time favorites.", "author": "Gigi T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-05-19", "description": "Would like to start off by saying i am white. \nPros:\n-cheap\nCons:\n-you get what you pay for which isnt much\n-gross\n-terrible service\n-dirty\n-dont speak English", "author": "zach w."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-21", "description": "It's an interesting atmosphere. The interior design is more suited for a Hong Kong-style cafe but it has Chinese BBQ. Their rice plates and chow fun are pretty good. Cheap, too!", "author": "Henry P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-28", "description": "Really really good roast pork over rice.  The price is a deal and you will be full hours later.  The pork is moist, tender, and flavorful.  Even the cabbage is so tasty.  Be warned.  This is a local's place.  Don't be afraid that almost everything is in Chinese on the wall.  There is an english menu.   They do understand what is on the menu.  Oh, and a tip.  Make sure you know what you want before you go in.  It's crowded and busy.  Everybody wants their food right now.", "author": "Jack R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-10", "description": "I've only had the roast pork (siu yuk) wonton noodle soup. It's a pretty filling bowl with several wontons and a lot of roast pork. It's a pretty good deal because I paid about $8 after tip. There's actually quite a huge selection of different dishes... vegetables, rice, meats... pretty much all the standard cantonese foods. The best part about the restaurant is sitting inside facing the counter, and watching everyone at work. There's usually one waitress around who always has a smile on her face. There's another tough looking woman, whose duties revolve around managing the money, the chopping block, and serving customers. She seems like a real strict boss type, but after a while of watching her at work, you'll soon come to see that she's just a really hard-working person who means well. Finally, there's butcher who is never without his cleaver. He might be handling money when he's the only guy behind the counter, but don't misunderstand. He's here to take care of all the meat, from the roast ducks behind the window to the huge slab of siu yuk hanging as the centerpiece of the room. Everything about him from his physical appearance, demeanor, and his skill with the cleaver indicates that he is the embodiment of the original chinese deli butcher. Come if you're interested in some nice chinese food with some real characters to observe while you eat.", "author": "Andrew S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-10-17", "description": "hahahahah...........this has to go to my list of 5 star food at 1 star places.  I haven't been here since I was a kid.  \n\nI came here with my old roommate because it was close by and the food here is good and cheap.  I think I saw an order on the menu that was around 2.60.  I couldn't believe my eyes.  As for the food, it is pretty damn good for a hole in a wall Chinatown restaurant.  The broth on the soup was awesome, the wontons were good (not great because I have had better but for 4 bucks what can you say), the roast pork and roast duck were killer!!!\n\nI need to start coming back to Chinatown to eat more often.  It's sorta an adventure when you haven't eaten here for a while.  I will definitely come back to this place.", "author": "jason g."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-24", "description": "Came here since I was in SF and wanted some legit Canto food. Prices were very reasonable; our party of three ordered a roast pork and duck rice, a soy sauce chicken rice, beef chow fun, and a seafood tofu clay pot, and that came out to be around 25 dollars (plus a lot of leftovers enough for a second meal)! The roast pork was crispy on the outside, and both the duck meat and chicken were tender and juicy. Since being a legit Chinese restaurant, service wasn't the best, but we got our food in a timely manner (and the waitress seemed overwhelmed manning the whole store by herself). Would come back again if I go back to SF!", "author": "Raymond C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-11-29", "description": "I love it here! My friends and I always come here if we want some good roast duck or roast pork over rice. Seriously, for $5 you can get that. \n\nThis place is always PACKED! \n\nI remember I used to come here a lot when I was young, then I stopped because my mother got into the whole health trend. But now, screw that, I want me some crispy duck skin.\n\nHere are a few tips if you decide to go to this restaurant:\n1. Be aggressive. Don't wait around for them to notice you. Once they see you, let them know you are here and how many people you have.\n2. Don't drink too much of the tea. I'm not saying the tea is dirty (it might be), but this will help you NOT use their bathroom.\n3. The only things that should be ordered here are rice plates paired with some sort of roasted meat and crispy noodles.\n4. Don't sit and chat with your friends like this is some sort of cafe. It's not. People around you will think you look stupid.\n5. Bring your own bottle of water. \n6. Respect the waitress. She works here 7 days a week during all the hours that this restaurant is opened. She's the first one here and the last one to leave. Cut her some slack.", "author": "Jenny Y."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-03-06", "description": "Do you want to be drinking water all day because of MSG?  Do you like your food hanging up at eye level with cooks snorting and sneezing all over it.  Do you like being treated like a white POS?  - Then come here.", "author": "Kyle K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-26", "description": "This is my favorite chinese deli to go to.  The waitress here is so funny and very efficient.  The BBQ food is awesome.  I have always had great food here.  The waitress there always makes us feel welcome.", "author": "remy m."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-30", "description": "I've been to quite a few Chinese restaurants in Oakland and this is my first Chinese restaurant in the city. I've finally discovered the formula to good, cheap and authentic Chinese food!\n\n- Whole roasted duck and chicken steaming from being under heat lamps\n- As many red furniture and decoration as possible. It's for good luck!\n- Handwritten Chinese menu on the wall with the only understandable (to me anyway) characters being the cost. I'm SOOOO tempted to throw a dart at it and order whatever the dart falls on. =D\n- Free mystery soup with your meal. It seems like the soup is whatever leftover that they have in the kitchen - spinal cord, chicken feet, carrots, mystery meat - and then they boil the mess out of it. The soup itself tastes good if you don't think too much or look too closely at what's inside the soup.\n- Chili, soy sauce, vinegar, ground pepper condiments in little containers in the middle.\n- Freaky (to an American anyway) menu items: frog, pig intestine, sea cucumber, hairy mushroom, etc.\n- The waiters are there to take your order, give you food and drink and give you your check. That's it! Don't expect anymore from them. \n- Sticky tables. Ewwww...\n\nThe more of the above that a Chinese restaurant has, the more authentic the food will be. Kam Po has ALL of the above! I will be back for sure if I want real Chinese food and not Americanized-garbage that a lot of places...** cough ** PF Changs ** cough ** have.", "author": "Don D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-24", "description": "3 n half stars\n\nHmm this place is your typically hole in the wall of chinatown. So the place is a little greasy and grimey. The Chinese bbq is above par roast pig bbq pork and duck. For those who are adventurist there are pig intestines , bbq chicken livers, and pork stomach stew in soy sauce. There are the tradition wonton noodles with ur choosing of a meat . Apointer if u get bbq items on soup dish always ask for it on dish, its a much better cut. This place is really inexpensive and yes its cash only and they close around 7pm.", "author": "Jorm K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-02", "description": "Their roast pork and BBQ pork are both pretty good . Their chicken leg is not ... it's very dry and lacks flavor . Will be back to try their chicken and roast duck .", "author": "Eileen L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-10-02", "description": "Dirty little place, but they can make jook and wonton soup any way you want it, and their roast duck is sumptuous. Very affordable prices. Don't take skittish people here, though. I haven't been back in a while, but this is the kind of place that stays precisely the same for years and years.", "author": "Josh K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-26", "description": "Probably one of the best places in Chinatown that I've had good duck in awhile. The service is really friendly. The food is amazing. What else can I say?", "author": "Claudia M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-01-10", "description": "This use to be my favorite place to dine until we found a roach in our food!  Never went back.", "author": "Marie E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-31", "description": "Food is very good and super cheap (4-6$)!! Huge portions. A typical Chinese restaurant. No beverages can be bought, only tea.", "author": "Ferdinand W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-08", "description": "fan of the suckling pig.\n\nfast and quick takeout such as beef chow fun and salty fish fried rice.\n\ncan't be too bad as this place is always packed.", "author": "Dorothy L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-11-22", "description": "This has GOT to be the DIRTIEST restaurant on the face of the planet. I haven't been here in years but my aunt loves this place because they give u a lot of food and it's CHEAP. Who cares if the plates are still greasy and the water cups still have lip marks on them? Who cares if the waitress and meat chopping guy wipes their nose and has greasy hair? Who cares if the bathroom has probably never been cleaned since they opened?\n\nNo thank you. I'm not that desperate for cheap food.", "author": "Jenny T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-07-18", "description": "Preserved egg w/ pork porridges - hands down. no complaints!\nBbq pork and roast duck - hands down. still no complaints!\nShrimp w/ scrambled egg chow fun - not bad. \nSeafood chow fun - huge disappointment. Not much flavor. \n\nNow, the bathroom.... quite disgusting and scary. But if you have been to China and survived, then you should be ok.", "author": "Sue C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-06", "description": "This is not going to be a fair review. I haven't had good chinese food in five months. I was missing authentic char siew and liver soup. So this was like a dream come true! Now I just wished I spoke cantonese better...", "author": "Eugene T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-09", "description": "Good food, big portions, great prices.  I love the rotisserie pig hanging in the kitchen!", "author": "Kevin P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-05", "description": "This place's dry chow-fun is really something! Its taste is comparable to the ones I have had in Macau and Hong Kong.\n\nEverytime I am there I order a chow-fun along with a dual-combo rice. The dual-combo consist of \"white cut chicken\" and bbq pork. I don't know how they do it, but it is so delicioussss! The portion is so generous that even two people cannot finish the entire plate of rice.\n\nTheir BBQ pork and fire roasted pork are to die for. The skin on the fire roasted pork is so crunchy that not any other place can compete with them in Chinatown.\n\n-1 Star for sanitary condition...", "author": "Chi T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-05-05", "description": "On the suggestion of one coworker we went together with another coworker for lunch. He told us beforehand about the butcher and the questionable cleanliness of the place, but said the food was cheap and good - I was in. Yes, the place is crowded during lunch (thankfully we got there a little early), it's not the cleanest looking place I've been in, but the food was pretty good. We all got the roasted duck with rice and cabbage and some soup. The waitresses were busy and only checked on us once, but that was ok with me. Overall I'd definitely go back and I liked the food - roasted duck and rice for less than $5 can't beat it.", "author": "Travis R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-03-28", "description": "This is one of the few last inexpensive restaurants available in San Francisco. Most plates are less than $5 and satisfying.  Food is decent. Hygiene is not excellent but I doubt anyone had issue, that's why I give a four stars. For non-Chinese pals, you can still enjoy your meal but not expect native speaker around, most people can get away with what they want for their meal. And don't expect to be pampered, they are generally very busy.", "author": "P. C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-06-27", "description": "This place is no freaking joke. Whoa. \n\nI walked up and was thinking, man, you're really trying to impress me aren't you? Just kiddinggggggggg!\n\nBut yes, it's definitely a bare bones restaurant. I had the won ton soup with roasted BBQ pork (not bad, LOTS of pork but the broth was relatively flavorless) and the roast duck on rice. The duck was good and it was an extremely generous portion. \n\nYou could definitely get by on a really really small budget by eating here. There was more than enough food leftover for dinner which basically means you could easily eat for 4 bucks a day if you so desired roast meat galore and rice as your sole diet.", "author": "Alli J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-29", "description": "Food Quality is good and food taste good.\n\nReasonable Price.\n\nRecommend to go if you like chinese food.", "author": "Gruber T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-11", "description": "this is the spot for Chinese food. the roast duck  over rice is the bomb and only under 6 buck!!!!! it is a little dirty but the food overcompensate the service and cleanness. Some people would compelling of the service but this is the spot to eat real Chinese food", "author": "janet l."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-08", "description": "Wow, really good simple Chinese food. The place looks like nothing but was pleasantly surprised at the food quality. The portions are really big, so it's easy to order too much. Fried rice and pad tai were delicious.", "author": "Lena G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-07-05", "description": "Ridiculously cheap, but kind of dirty and the food was pretty bland. Typical Cantonese place. I'm not a fan of bland, greasy Canto food though, but that's pretty much all you can get in Chinatown, so for what it is, this place is fairly good. Nice windows in the dining room. Bad service. And again, CHEAP.", "author": "Max M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-21", "description": "Great little gem in Chinatown! Great prices! Large portion and decent taste! Recently we order the tendons over veggies, claypot rice and porridge! Always come back for a cheap dinner with leftovers!", "author": "Maggy C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-12", "description": "Not as dirty as some had mentioned. Maybe they started to make an effort to clean up. Roast duck was great! Sweet and sour pork was great too!", "author": "Johnatton L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-02", "description": "Generous portions and fresh ingredients make this a clear winner at this price point.  Had the duck, pork, soup and broccoli with  garlic sauce for $21.", "author": "Daniel P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-02-18", "description": "It is what it is. Cheap and moderate chinese food in SF Chinatown. But it's really delicious after you had a long day that included driving over 400 miles in the open road, getting lost for 2 hours searching the Macy's building and Chinatown while the navigator is passed out cold in your passenger seat and last meat had was 18 hours ago.\n\nSo we ordered the roasted duck over rice, assorted vegetables, beef chow fun and roasted pig. The duck was bleh, a rip off that came only about 6 small pieces over a bowl of rice. The vegetables dish was decent. The beef chow fun was surprisingly good, beside how hard is it to fry chow fun with beef. The roasted pork was alright, I wish it had came more, besides roasted pork are usualy expensive and each dishes were only 5 to 6 bucks each. Can't argue much.\n\nSo yeah, either I was really really hungry or the food was just too delicious that we CLEANED up the bowls and plates.\n\nps: The Chinese kid knows the whats up in Chinatown and listen to him.", "author": "Rick W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-03-08", "description": "I love coming here to grab some BBQ Pork and Roasted Pork.  I haven't tried the duck or chicken, but the pork is definitely good stuff.\n\nSince it's off the main streets of Chinatown, it's not nearly as crowded with tourists, but you have to be careful 'cause a lot of locals will fill it up on weekends.\n\nOne of these days I've gotta try their actual food 'cause I've only ordered their BBA togo.", "author": "Jason K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-01-02", "description": "Everyone crams into this lunch joint b/c it's got some of the juiciest roast duck and pork in Chinatown AND it's unbelievably cheap.  Just keep in mind it's a hole-in-the-wall crammed with scrubby tables and a restroom you should pretend doesn't exist.  Carry anti-bacterial, wipe down your utensils, chow down, then jet!\n\n++ | Roast Duck / Pork |\nOrder it any way you like (over rice, in soup, half/whole, to-go, etc.), as long as you try some of Kam Po's reknowned roast!  Some people will ask for extra \"duck sauce\" (au jus) or ginger-garlic paste to taste.\n\n++ | Rice Dishes |\nMonstrous heap of rice w/any selection of the standard Cantonese sautés.\n\n-- Noodle soups\nDon't order any of the noodles! The soup base is bland and the noodles are grocery store boring.\n\nA filling, quick and dirty lunch = $5/person", "author": "Christina J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-10-26", "description": "Greasy Chinese food, but good greasy. Maybe even great greasy.  I admit I am biased towards greasy (good) Chinese as it's nostalgic. Definitely come here for their BBQ on rice, but I love it all since it's yummy home cooking to me.  They're small and busy, so you'll likely be sitting at a damp, newly wiped table with strangers.  Out of the way, but worth it.  Cash only. Yelp majority are right once again.", "author": "Yan E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-11-02", "description": "I only order one thing from here: char-sui won ton mein. LOVE IT.", "author": "Jocelyn W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-23", "description": "Best cheap authentic food I've had here since moving across the country. Cheap, fast and complete hole in the wall.", "author": "Cindy T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-09-06", "description": "I'm not sure if Kam Po even has a menu printed in English. They certainly have lots of things written in Chinese taped up in their windows and along their walls.\n\nAnd I have never eaten INSIDE the restaurant. Always ordered TO GO.\n\nBut I do know they've got some of the best damn Roast Duck & Roast Pork in Chinatown because... well... it's hanging right there in the window!\n\nI don't think the fellas with the meat cleavers that work behind the counter speak much English, but we've developed an almost unspoken understanding over the years... all I do is ask for a half order of Roast Duck & Roast Pork over steamed rice, TO GO, and the fellas grab the duck & pork off their respective hooks, place em on the cutting block, and do what I can only describe as... well... *MAGIC* with that meat cleaver!\n\nAll this food & the show for just $6? That's one of the best deals in town, my friends.", "author": "John Eric S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-10-23", "description": "I'm amazed that I haven't reviewed this place until now, because, really, when it comes to affordable Chinese restaurants you can't get better than big portions + good food + bare basement prices. Whether it's wonton and roast pork noodle soup or a soy sauce chicken rice dish, you get gigantic portions (that to a normal person is two servings, but I tend to eat a lot). That's not all as well, before you get your entree you get a bowl of delicious homemade soup. All that for less than $6 (I wish I could get anything for less than $6 now that I live in DC)\n\nOkay, so the place may not be the most sanitary of places. The tables are pretty cramped and during busy times you'll have to share. And yes, it's cash only (but that's pretty much anywhere in Chinatown anyways). But really, all that is worth it for the lipsmaking goodness coming your way at Kam Po. I'm definitely looking forward to coming back to San Francisco again and eating another delicious meal here.", "author": "Jon W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-10-11", "description": "This is one of my favorite hole in the wall restaurants for lunch/dinner in Chinatown.  \n\nThe roast pork and peking duck is excellent!  I usually get their special for dinner which is 3 full entree with rice and soup for $18.99!  You cannot beat this price and quality at any other Chinese restaurant.  \n\nDefinitely check this place out!", "author": "Jo S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-10-23", "description": "The best thing here is their roasted duck with the white noodles(don't know what it's called in English, but in Chinese, it's 'Lai Fun'). Mmm. Haven't been here in ages though!", "author": "Vivian L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-03-26", "description": "They got 88 out 100 in their health inspection.  I've never got sick from eating this place.  They sell a lot so, there's never any stale food.  All local Chinese customers eat here, not like NanKing where there's only \"white\" folks (get it?).  \n\nI love the wonton with noodles for $2.55.  23 years ago, it was $2.30, so their prices are super reasonable.  \nA bowl of JUST wonton is like eating a bowl of dim sum.  Lots of shrimp in the wonton.   You got to try their wonton it's truely amazing, like dim sum.  It's the cheapest and best wonton, I've had...\"Two Kinds o BBQ\" is $5.50 which is a lot of meat.  Feel free to share it.\n\nIt's not fair to review a restaurant if you havent' eaten their food.  I've been eating in Chinatown for over 30 years and this is a secret hold in the wall.   Yes, the tables are old, but they are clean.  Once in a while the floors are sticky, but they do wash it every night.  Most good, cheap places like this one is CASH ONLY", "author": "Sunny O."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-09-23", "description": "I came here because they have my name in their name.\n\nCheap and good.", "author": "Po L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-09-26", "description": "I can't believe I'm giving this place 4 stars. Honestly, I'm just going to pretend I've not seen the inside. It isn't clean and for now, I'll live in denial about what the health department has likely said about this place. \n\nThat said, the food always tastes really good and they have some of the best duck ever. Really cheap food with gigantic portions. If you're willing to brave the place to get the food, check it out... even better, send someone else to pick up some take out and live in denial.", "author": "Anita B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-05-21", "description": "Okay, so maybe I was ordering the wrong thing, or I was setting my expectations too high.  On that note I would give a 2 star rating but feel that it wouldn't be fair to do so since I clearly wasn't having the same experience that other reviewers were having.  I'm glad people have posted their suggestions on what to get because I could've used a few pointers.  I will say this though, their service was really good.  It is a small joint, so if you're coming in during the lunch hour, you might be stuck with a wait.", "author": "Margaret N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-06-28", "description": "Great place.  Keep with the rice plates - we got Roast Duck and BBQ Pork; great and only $4.75 (including soup).  The butcher is outstanding and the portion sizes are good.  Comes with steamed cabbage and good sauces.  Nice people.  Cash only.", "author": "Brian C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-09-09", "description": "This place is disgusting. I came here on my lunch break and ordered the roast duck like everyone recommended. It ended up in the trash and made my way over to Golden Boy.", "author": "Mike S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-06-06", "description": "I was craving for roasted duck very badly so I went on Yelp and wanted to find a decent roasted duck place and I found Kam Po Kitchen.\n\nThis is  a review for a To -Go experience,  my hubby bought me a whole roasted duck and before I open it, i was expected to see crispy skin and juicy meat, but when I open it..oh nooooooooo, the duck is super fatty, there's one big layer of fat below the skin and the skin was soft and I felt like this duck has been sitting more than one day old and it costs $13\n\nI will never go back again.", "author": "Amy A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-03-01", "description": "This place is always full! The food is extremely cheap. Five dollars in your pocket? Well that gets you a meal that you could split into lunch AND dinner. I always get the roast duck with rice or the roast pig with rice. I could admit although, I have had better BBQ pork, I don't hate it or anything, I just don't like it. I lived in Chinatown most of my life and I have had WAY better bb pork/ roast pork/ and roast duck but this place does the trick. It is decent food for a very cheap price. I come here at least once a week.\n\n4 stars just because its not all that clean or organized...", "author": "Nelson Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-12-27", "description": "Understaffed and super tight seating. We got to know our neighors pretty well there. Be aware incoming guests will stand over you while you wait for your bill or while you are wrapping up your meal. Good bitter melon dishes. The wait staff sometimes screws up orders as we witnessed for the next table.", "author": "Rrr X."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-06", "description": "Roast Pork/Roast Duck Combo! $7.45 and well worth it. It's always a bit cheaper when you get just one item alone but as a carnivore, the combo for me is a must. What has me praising this place is the portions and pricing...two things that pair together well when used right. Look past the \"greasy spoon\" ambience at this place and try it out! You're guaranteed to keep your tummy and your wallet full. Great Food! And for those of you adventerouse eaters...go ahead and try your hand at the pig intestines, or maybe some chicken feet, but the roast pork or duck here is the staple! RECOMMENDED", "author": "Marcel W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-25", "description": "Ill keep this short and sweet. The place looks a little questionable health code wise, but after closer inspection it seems like it might pass. The food on the other hand is undoubtedly fantastic. One of the gems of chinatown here in SF. I live one block away and this place is a consistent stop when wanting inexpensive, yet delicious food. Roast duck, chow mein, and the clay pot menu are the best items, but dont take my word for it. Just give it a try.", "author": "Emilio B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-02-24", "description": "I wanted to give this place four stars because it was (have not been there in a long time) the cheapest, nastiest place that you could get good food from.  My criteria for a good place to eat have changed though.  I've seen bums eating in there on occasion but I didn't care.  I just chatted with my friends, ate the food, paid, and left.\n\nThe duck can be quite good (4+ star, IMO) but make sure you chose the right one.", "author": "Jensen L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-07-21", "description": "Food: Noodles - 4 stars\n           Rice plates - 3 stars\n\nI used to come here a lot when I was in my pre-teen years and then every so often when I was in high school. It was cheap and tasted good.\n\nThe place itself gets pretty noisy in the busy hours, and the service gets a little slow too, but that's because they have only 2 waiters and it gets really busy around the lunch hour. Cleanliness wise, is just okay. One side there are tables to sit and eat, and there is a small part where you can order to go food.\n\nI was just here in the past weekend, and man have things changed. It used to be that the rice and ho fun tasted pretty decent, but now...We ordered a shrimp chow ho fun, and it was extremely oily, even for chow ho fun, and pretty tasteless. We also ordered a rice with beef and veggies. The beef had a weird taste to it, and the sauce's taste changed too (not sure if it is because they changed the chef or not...). We ate the veggies and some of the rice, but left the beef.\n\nThe last dish we ordered was beef tendon noodle soup. This is the one thing that still tastes great. Even after all these years, their noodle soup still taste the same. The soup base was just as tasty as ever, and they gave a large helping of the beef tendon and noodles. I recommend getting the noodle soups (especially the beef ones) because they are a must try. I really can't say the same for the rice dishes anymore. \n\nThe place is cheap and the beef noodle soups are to die for.", "author": "Jay L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-08-26", "description": "If you take it for what it is, this place is great. The food is incredibly cheap and, for the price, is pretty damn good. I ordered the beef chow fun, which was a bit greasy and slightly lacking in flavor, but for the quantity (huge portions) and at $3.90, I really couldn't complain. They also give you free soup. There was actually a fly in mine, but I wasn't that surprised...and didn't even really care. First, I was way too full from my dish to have any room for soup. Second, I knew I wasn't eating there for the cleanliness, and for the prices, I really couldn't complain. As long as your expectations are in line, this place is actually a fairly decent hole-in-the-wall kind of place.\n\nAlso, this place is a lot more crowded during lunchtime than dinner.", "author": "Willy C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-10-26", "description": "This place is a small hole in the wall with great food at very good prices!\n\nThis place has the best pork with crispy skin, and their Roast Duck is on par with the best in the Bay. As if that's not enough, their prices are awesome for the generous proportions they give you. I always stop by whenever I'm in the area!", "author": "Donald F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-10-20", "description": "1) Super cheap (usually $3-$5) \n2) Super big portions \n3) I don't recommend drinking their soup because I found soggy newspapers in my soup once, and it makes me think they just pour whatever other customers don't finish back into the big pot and reserve\n4) And because of #3, i don't think this place is necessarily sanitary \n5) Area is small\n6) 0 ambiance\n7) Rather crowded\n8) Sometimes their food isn't all that fresh, i.e. the wontons \n9) I suggest sticking with the rice plates with the chicken, cha sieu, or  roast duck (because those are made fresh) \n10) I come back once in a blue moon", "author": "Emily L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-07-28", "description": "I wear a constant grimace the moment I walk onto the streets of Chinatown. My dad parks on Russian Hill (because parking sucks in Chinatown) and the view is gorgeous. I can see Alcatraz to my left and houses sloping down and then up into the distance. The sun is out but it's a windy day in SF and I forget to wear my jacket. I'm in a T-shirt and shorts. I get increasingly angry about my attire as I walk around the overpass onto the sidewalk. I see glimpses into shops as I pass by doorways. One is a dimly lit barber shop and another is the behind the scenes of a butcher shop. I make out a slab of roasted pork lying on a metal countertop. We turn the corner and we walk into Kam Po. Kam Po used to be owned by this man in the 90's who gambled a lot. He had two restaurants and had a hot temper. He used to beat his wife and his mother. (ho ma faun uh!) He lost $200,000+. So he gambled until he had to flee the states (jow low) because people were running after him with butcher knives (pack yau). He also disappeared with a truck load of coveted shark fin, sea cucumber and other expensive Chinese delicacies.\nI walk into Kam Po (which really is called Gum bo) and I see my mom at a table so I join her. I'm with my younger brother and mom and dad. My dad talks about the owners and who's working at the restaurant today and who's not. I zone out and observe all of the people in the place. The place is small and I feel very cramped. The table is sticky. The waitress comes over with our cups of tea and our menus. We order. I can see the grime on the laminated menus as she takes them away. There is a red lace curtain that runs along the bottom half of the windows of the place. It serves to just block passersby from seeing you in the restaurant. I can't help but stare at the old lady (ah mo) at the table diagonal to me. She's staring at me too. We have a staring contest and I win. Behind her I see a small closet doorway and men keep walking in and out of there. It's a bathroom. There was a particularly rotund male who had to slip in sideways. I wonder what it smells like in there.\nThe waitress comes by with one of our four orders, a stack of plates, chopsticks and napkins. My brother takes a plate and inspects the bottom of the plate. My dad tells him that's not a good idea. I grab the cleanest plate and pair of chopsticks. My brother exchanges his set for a new one by walking over to the butcher part of the restaurant and grabbing a pair from a mass of red chopsticks. I try our first plate and it's pretty darn tasty. Our second plate comes and my dad says, \"Doesn't this look great (jang!).\" In my head I think, \"no, actually it looks like throw up.\" I eat it and it is pretty good despite what it looks like. Do health inspectors come to Chinatown?\nTo my right, a well dressed teenage couple is ordering food. After they order a gay couple sits down next to their table. One of the two males is white, so the waitress comes to take their order and I hear her say, \"die coke, roas pok mmhmm...vally vally good.\"", "author": "Louisa L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-02-18", "description": "day 6\n\nsolid 3 star review. i came here cuz my eating compatriots said you aint a true yelper foodie unless you eat chinese food at a place that has dead ducks hanging in the window. whatevs. panda express never had hanging ducks and i been completely happy. dude my feet are hurting, i said lets go to the closest ones but no way, these chicks wanted hanging ducks. dude i dont know what crimes the ducks committed but i dont want to see them hanged and walk 4 blocks to see it. im a daffy and donald fan for life!\n\nwe were 3 koreans and 1 chinese kid who looks filipino. we ordered yet my favorite dish was the one the chinese kid ordered. let koreans order at korean place and chinese order at chinese places. \n\nchow fun? fun but not the best. the duck? pretty good. the veggie plate? ew. the crispy suckling pork that the c-kid ordered? dang its like a slap to the face. i was mad he held out on good chinese dishes on me all these years and let me eat panda all this time. the crispy pork was good. \n\npanda, add it to the ala carte!", "author": "Sam Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-06-04", "description": "Good take-out Chinese food.  Anytime I feel lazy and don't feel like cooking dinner, I order food to go here.  Prices are insanely cheap for the amount of food they give you.  This is not the cleanest place to eat at and you may have to share a table sometimes.  But hey this is Chinatown, and sharing a table is the norm, so get cozy!  The waitresses work their butt off here so give them some slack.  The butcher that cuts up the meat for you in the bbq section is hella funny.  He's always trying to make you buy more than you need.  So you gotta be tough with this guy.", "author": "Lucky M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-01-14", "description": "I have struggled to find good Chinese food in SF and this place is authentic, delicious, and a great great value.  Food: YUUUUMMM.  The noodle dishes are really good (singaporean noodles and chow mein).  The roast duck and rice dish is huge and always good.  The people in there eating are legit Chinese ppl.  You may not like the ambience (it is Chinatown) and just know if you sit by yourself they like to do it family style so some person(s) may just sit with you.  But don't worry, they really don't talk to you.  You get these HUGE portions and each dish is from under $4 to less than $7.  This stuff is GOOD.", "author": "Deal G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-03-18", "description": "every time I hear the term \"dirty hole in the wall\", I think of Kam Po Kitchen immediately. the place would probably not pass well with the health rating but what I don't see, I don't care. if you want a quick good bite with the best deal in Chinatown....here it is. no frills and not the best Chinese place to give off any great impressions to first timers.\n\nI've been a regular here since I was a kid growing up in the area (in fact, my family first moved into an apt. upstairs when we first immigrated to the States). my mom reminds me these days \"only $3 for a bowl of noodle with EIGHT wonton!\" that is a bargain you can't find elsewhere.\n\n* if getting the soup noodles to go, ask for the soup in a seperate container so you don't end up with soggy noodles.", "author": "Katie K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-07-08", "description": "This is my all time BEST place for Chinese food in the city for three reasons - 1)great food, 2)huge portions, and 3)CHEAP PRICES.\n\nBe forewarned, it is impossible to get a table between noon and 1:00 so either plan your lunchtime meal for 11:00 or after 1:30, it's that popular.\n\nThe decor is a step up from a hole in the wall but the food speaks for itself.", "author": "John C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-02-02", "description": "I have been buying meat (hanged on the rack) from this place a few times a year for a couple of years. Quality is ok. I like it mainly because it is easier to find parking on this part of Chinatown. When I buy I usually bring the exact amount, so that I don't get any change back from the person who chops up the meat -  the change money is always mixed with grease.\nAbout two months ago about one hour from closing, I bought a $6 soy sauce chicken (this is the small size type, cheaper). Got home, open the box, right away I could smell the spoiled odor. Got back to my car, drove back there, looked for parking again, knocked on the door (they closed already) they did not examine the content of my returned box but gave me my refund! From my experience,  the person who chopped up the chicken (I think he is the owner?) should know that it was spoiled because as he chopped it up, he should smelled the bad odor.\nYesterday, I bought another $6 chicken during lunch time (should be pretty fresh at this time of day). Went home and found chicken meat to be rubbery and skin so chewy that I cannot break any skin in the box. Believe me, I have good teeth. I was eating that chicken with a friend (who specifically wanted soy sauce chicken for dinner) at home and it was extremely embarrassing. And frustrated again because the same guy who chopped up the meat should know it was very chewy (from the feel of the knife gets into the chicken). I did not go back to ask for a refund. I think I want to calm down for a few months to ease my blood pressure then see... \nMy family has been in the restaurant business in the East Bay for twenty years. One of the restaurants we had owned, was a Chinese BBQ restaurant like Kam Po! So I had worked in a BBQ restaurant before. \nFor irresponsible business ethics, one star.", "author": "Adrian A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-06-21", "description": "Wow, the char siu and roast duck over rice that we just ate was humongous ... LEAN duck, what's the secret?  Unlike Cheung Hing's and a few others I could mention, Kam Po's really got the roast duck down to lucious, lean duckie goodness ... it's like when you get a hunk of  crab claw meat on your Swan Oyster Depot salad and you get a nice mouthful of pure \"MEAT\" and it's culinary oral orgasm ... *satisfied smile* then gourmand after glow ... This was actually the 2nd day in a row I stopped by for roast duck on rice with roast pork for variety ... parking is such a bee-ach and those hot foods on display in the front are rather beckoning but it's pretty much a HK barbecue charcuterie to go for me ... as far as dining in goes, well yeah, decor leaves a lot to be desired but the prices offset that demerit so it's still one of those San Francisco treasures and the place to grab roast ducks, copious portions of roast pork, char siu, roast and boiled chickens, etc.  Heard those used to have roast goose and now I have kind of a hankering for that ... last time I had it was in Dong Guan and it was memorably good ... Kam Po Kitchen, the food's a steal, real deal and you will feel duck satiatied in the best of ways ...", "author": "Terry A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-05-13", "description": "Ive been going here since i was 9 years old when it was at their old location, which i guess is about 20 years.  they have had numerous owner and I think they finally have an owner that cares about cleaniness.  It stopped smelling like bleach.  their chinese bbq are the great.  I love their roast duck.  and their food is soooo cheap... they give you so much food, its insane!", "author": "Janet S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-05-06", "description": "the cheapest chinese restaurant in SF!!!  Ordered the beef chow fun, wonton soup with like 12 pieces of wonton and bbq pork rice plate.  The bill was $10.35.  What other places can beat that!  The place is small and can be dirty, just like any AUTHENTIC, typical chinese restaurant is.  But if you're use to little hole in the wall type of chinese restaurant and finding good food is the primary reason, then you gotta give this place a try.", "author": "Heidi F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-03-09", "description": "The first time I came to Kam Po h.k.k. (I pretend it stands for Hong Kong Kapaow) I pushed aside the fork in favor of chopsticks which happen to be a far superior eating utensil. I'm not sure if chopsticks are usual fare for non-Chinese people eating in Chinatown, then again I'm not sure if many non-Chinese people eat in Chinatown or H.K.K. for that matter but either way the lady that serves food here seemed quite amused. Since then she has been very friendly, gives me free tea, and always makes it a point to give me chopsticks.\n\nAnyway, the food here is the best, the best Chinese food ever in fact. Try anything that contains the BBQ Pork. I like it in the wonton soup or the China green chow-mien or even just plain by itself. The soy sauce chicken is also delicious as is pretty much anything on the menu. And you know it's fresh because they pull it straight out of the window. Oh and make sure you look at the menu you can hold in your hand rather then the menu on the window because it has more food choices on it.\n\nIf I could give a bonus star for every inch of hair that's growing out of the face mole of the meat-chopper guy, I would.", "author": "will s."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-05-14", "description": "Well, it is what it is. Hence, the low prices. I don't really care that much because I'm used to these places. I wouldn't call anything healthy, but I'm just lunching, so I really don't ask for too much. There are very few places these days where you can get a decent Chinese meal for 3-4 bucks. (I'm Chinese, so I know.)", "author": "Alex Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-09-07", "description": "Made the trek to SF from the south bay a few days ago and went here for some food.\n\nLike everyone said, this place has a lot of food for CHEAP CHEAP CHEAP, don't come here with huge expectations. The 3 of us ordered separate dishes that were all ~$4 each, but getting 2 dishes would've probably filled us all up.\n\nThe food was probably loaded with msg because i got so thirsty later that night.\n\nA little thing i noticed was that this place is pretty small so people would end up sitting in a table with some other random person which was a bit amusing.", "author": "Daniel N."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-09-30", "description": "Ordered #1 roasted pork with rice (how can you go wrong right? WRONG.). They give you the cheapest/dryest cut. Portions were huge but did not make up the quality of the pork. My advice would be eat at kin tin restraunt down at washington. Way better quality cuts but a little more expensive. 2 stars for portion size and price.", "author": "Jimmy C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-08-07", "description": "This restaurant is the very definition of good, authentic, cheap Chinese food. I love the noodle soups but the full panoply of fast Cantonese rice and noodle dishes is available. Any dish with the BBQ meats that are on display up front will be a tasty bargain - roast pork (crispy skin), BBQ pork (that's cha siu), and roast duck are the three main ones.\n\nThe lady who seems to be there all the time is amazing - she doesn't need to write down your order and she always gets it right. She has amazing energy to keep going at all times of the day. She's my hero.\n\nThere's an English menu, but there's also Chinese language signs on the walls. I can read Chinese, but I've  never ordered the Chinese-only dishes - just because they feature things like frog and bitter melon that I really don't like anyway. If you want to be adventurous, tell her you want to try one of them - it won't cost much!\n\nThe place is small and the bare tables are packed in together with little elbow room. But that's part of the appeal, for me. No pretension, no creature comforts - just delicious cheap food.", "author": "Oh G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-01-26", "description": "I was tempted to give this place 4 stars because of the decor, which is obviously a pretty old, no-frills  chinese restaurant.  However, this place is worth 5 stars in my opinion because the food is really the best deal in town.  I am able to get lunch/dinner for less than $5.  My orders to go are served promptly.....one of my favorite places in chinatown!", "author": "Andrew G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-04-09", "description": "All I got was the roast duck and the BBQ pork, and both were good.  The duck was most likely fresh as it was a nice combination of fatty and crispy.  BBQ pork was about as good as I would expect from a BBQ place like this, nothing super extraordinary.  This is a hole in the wall type of joint where you can expect cheap food that has good quality.  Caveat: I have never actually gone into the restaurant (just dropped off people to pick up the duck), but I think this is probably the best way to go so that you can avoid both the hellish parking in the Chinatown area as well as the crowded restaurant.  The roast pork looked good even from my car in the street so I am looking forward to going back to try that.", "author": "Mike Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-06-16", "description": "So my girlfriend who is white was wanting Chinese food.  And I being Vietnamese and eating authentic food,( Panda Express is good but like saying Taco Bell is Mexican food), decided to get some roast duck.  If it isn't hanging in the window you really have to wonder right?!  But needless to say Kam Po is DELICIOUS!  I usually get the Roast Duck Won Ton Noodle.  You get a bunch of duck.  A bunch.  And it is tasty and filling and all for under $5.  Then to go I get the rice, Roast Duck, and BBQ pork.  Its like getting 2 meals.  Lots of meat, great value and its quick.  Going there is ok but the people who work there are not so english speaking.  But then the food makes it worth it.  My girlfriend and I ate there 3 times in three days before.  The beef and broccoli chow mein with the chinese broccoli is fantastic.  During lunch hours you see a wide variety of people stopping off to get food to go.  And its worth it.", "author": "Jerry V."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-08-23", "description": "Heyy Mel! how ya doin? (inside joke) i really don't like this place. actually, i dont think the place likes me. HAHA", "author": "Jasmine T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-10-07", "description": "this is the diritest, cheapest chinese place in all of california. with that being said, the food is quite good and honestly, to walk out 5 bucks eating all the different variety of chinese food you've ever wanted? its insane. i rmember i went with two people and we walked out under 10 bucks. and we were all full and happy. and peopel complain about roast duck over rice bla bla. then just order one to go. u get the whole thing, AND its cheap. can't beat the price man. i guess im just cheap. but thats why it gets 5 stars.", "author": "Rick L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-21", "description": "don't go here for atmosphere - unless the atmosphere you desire is an authentic chinese cafe.  the denizens of chinatown dine here, i do too!  it's always full of pensioners getting very good food for very reasonable (even cheap) prices.  we usually get noodle dishes here which are generous - especially the black bean beef chow fun.  the bbq pork is a tasty treat to bring home for snacking or a late meal.", "author": "Chris D."}
