{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-17", "description": "I'm definitely not a ramen connoisseur by any means, but I love Kan. I've been to quite a few other ramen places in the city and this is definitely in my top 3 favorite, flavor wise. It gets five stars because the food is always delicious and well portioned, the wait is short, and the price is perfect. \n\nI've tried the tonkotsu ramen (extra spicy), chicken katsu curry, gyozas, and chicken kara-age. The katsu curry was flavorful and, after adding noodles, filling enough but the ramen is definitely my go-to.", "author": "Becca W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-16", "description": "This one is an easy 5 stars. The food was impeccable and the service was always available. It was pretty empty inside, which made us uneasy, but we are very glad we stayed. \n\nThe location is great, food is great, 5/5.", "author": "Timmy B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-17", "description": "Kan has become my favorite ramen place in the city. My partner and I always get the black garlic special with the duck on top. The meat is tender and delicious. The egg is well spiced. The spinach and mushroom add great contrasts. The noodles are always done to satisfaction.\n\nDefinitely worth checking out if you are anywhere near North Beach.\n\nI am almost hesitant to write this review, because my favorite part of Kan Ramen is that I can go whenever I want without waiting in line. Go check it out! I am happy to wait if my favorite bowel of ramen is getting its due recognition.", "author": "William W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-27", "description": "Ramen isn't really something you look for in the North Beach area of SF, but after hearing about this place and nothing but positive feedback, I decided to check this place out with one of my friends on our noodley food adventures. What I like most about this joint is that you could find no frills, yet delicious ramen for an affordable price compared to the places in the city now that a basic bowl of ramen is about $15. They have a staple three options (shoyu, miso, tonkotsu) for broth base that all come with thick pieces of chashu, menma, wood ear mushroom, spinach and half an egg for 9.95. Their portions are standard for what you would expect at a ramen restaurant. They have one special which is their garlic tonkotsu ramen for 14.95, which still isn't bad considering the price point of what ramen is expected to be in the city and they have alternate, cheaper options.\n\nNo wait when I came here on a weekday evening, which I think is great as most ramen restaurants have up to an hour wait especially when really popular. I would definitely suggest checking out this place if you're craving ramen and in the area.", "author": "Kathleen S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-11", "description": "A ramen shop under my name... I had to check it out (I might be biased because... I mean come on, it's my name). We came here during Lunar New Year's as originally we were looking for Chinese food, but it seemed like everyone was pretty much booked. We went through a couple of Chinese restaurants and upon learning that there was no seating, I checked Yelp and walked around the corner and we stumbled upon here...where there was no one. Good or bad?\n\nWell, when we got seated (table of 8) we were handed the menus promptly and since it's a new thing to ask the waiters if we could split the checks...the waiter responded that it would be no problem. (Since when was splitting checks a bad thing?!)  And don't worry, people started coming in after we were seated.\n\nAnyways I ordered for appetizer (for myself) the Gyoza, and the Chicken Kara-age. I followed up the appetizer with the final meal of the Black Garlic Ramen.\n\nOverall, it was okay. As I said earlier, this review might be a little biased. The Gyoza and Chicken Kara-age was good. The gyoza wasn't stuffed fully, but it definitely had a good amount of filling and the chicken kara-age was crispy delightful when you bit down into it.  For the ramen, I thought the broth was a little weak for my taste. There was only a couple of black garlic cloves in the bowl which to me lacked for the flavor of the black garlic. Or, maybe my taste buds aren't that great when it comes to ramen. I thought overall it was pretty good, especially for the price and where it's located.", "author": "Bruce K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-15", "description": "Number one pro: no lines ! My boyfriend and I went on a Saturday around 3:00pm and the place was empty. I was surprised, given all their great reviews. Like most of SF, it's hard to find parking in this area so I would suggest getting dropped off. I had the black garlic ramen extra spicy and it was exactly what I hoped for! I didn't need to add any sides, it came with flavor + everything I wanted (egg, mushrooms, green onions, bamboo, etc.). The spice is real, don't underestimate it. The ramen came with pork AND duck breast - sooo good. The restaurant was clean and modern and service was good. The portions were perfect, I could finish the whole bowl and could still breath. If you're looking for an appetizer, their potstickers are so flavorful. I would definitely return for another meal!", "author": "Brieanna S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-25", "description": "Absolutely one of the best Ramen I've had.  I specially love the pork broth.  I savored the wonderful flavor down to the bottom of the bowl", "author": "Sergy F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-28", "description": "Delicious ramen! The noodle was chewy and elastic, and I picked the mild spicy broth (Tonkotsu). I didn't feel thirsty after drinking the broth and that feels good! The pork belly was large and had a good proportion of fat and lean meat, love it! The ramen came with a soft boiled egg, bamboo shoots, seaweed and spinach, and the portion was good enough to feed a big eater like me. The staff was friendly and helpful. I asked for hot tea after she poured me ice water, and she happily entertained my request. The hot tea was free and I was super amazed about that because I have been charged a lot for hot tea in other ramen places. My bill was $10 and was very reasonable. I think they treat customers well with a humble attitude, I highly recommend this place.", "author": "Christina O."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-08-31", "description": "I came during their lunch service. It was pretty slow. \n\nI ordered the black garlic, y'all know how I love me some black garlic ramen, and it was sadly disappointing. I had it with the mild spice.\n\nMy other friends ordered it with super spicy, that was ridiculously spicy! But there was a good amount in the veggie bowl. Even the medium spice was a little too spicy for me. I'm so weak.", "author": "Lynn C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-01", "description": "Kan Ramen is an above average ramen shop near the financial district and chinatown.  They do have a house special of black garlic ramen but I would just go with the usual ramen flavors such as miso, shoyu or tonkotsu.\n\nPrices aren't bad and this place doesn't get that busy.  I go here because I live around the area and everything else around the area is overpriced and not really that good.", "author": "Mark C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-14", "description": "I was hoping that there might be solid ramen in the city. On a cold day, you just need a rich bowl of broth, flesh with noodles and slices of slow-cooked meat. Yeah, yeah, it's July, but have you felt how chilly wind can get around here?\n\nI intended to go to Sam Wo in Chinatown for dinner with a friend, but that plan fell through when we realized they were closed on Sundays. We didn't wander far until we got to Kan Ramen, which was sparsely populated (probably should have listened to that warning sign). We were seated quickly and the waitress didn't delay in taking our orders. You don't have to ask for a glass of water; they'll provide it. They're also prompt with the refills, and leave you alone to enjoy your meal in peace. My friend and I spent an hour catching up as we ate, overstaying our welcome for a solid half an hour after the bowls were cleared, and they left the check as a hint to get out.\n\nIf it weren't for the company, I wouldn't have minded heading out early. I thought the black garlic ramen ($14.95) was lacking for what it was. Two slices of seared duck breast and two slices of char siu? Eh, could've given me a little bit more for that price. Duck was over-peppered but tender, while the char siu had the same flavor as the soup. Black garlic was just strange -- there were whole cloves of it, meaning all the flavor came through in a single bite. There were a few drops of black garlic oil, and it didn't taste like much. In fact, the whole bowl of soup lacked a flavor other than salty. There was no depth expected of broth that's been simmering for hours.\n\nSaving graces: bowl was massive, noodles were fine, seaweed and spinach were properly portioned. Some of the appetizers sounded tasty but weren't popular, considering that only one table in the whole restaurant had ordered anything off of that part of the small menu. CNN played in the background as a nice reminder that you shouldn't tune out from the news, even when you want to relax.", "author": "Gwen W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-06", "description": "I'm no ramen expert, but I really enjoyed my beef udon here. It was a very reasonably large portion of super flavorful broth and ingredients. The fried tofu was also really good, although I could have done without the fish flakes. Pricing was also pretty inexpensive for San Francisco.", "author": "Elizabeth M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-06", "description": "I thought the garlic Ramen here was pretty tasty! The portions are massive and comes in a giant bowl. There is never a weight which is nice.", "author": "Tina L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-01-05", "description": "I'll preface this by saying that I'm not a Ramen person.  I don't like soup in general because I feel the broth is just a waste of space...\n\nContinuing on that theme, the very large bowl of broth came out piping hot and ready to roll.  I ordered the night's specialty add-in of steak.  The steak was perfectly prepared - just pink enough to be delicious if you ate it quickly enough before the broth finished cooking it.  There weren't nearly enough noodles, but I stole some from the friend I was dining with (who seemed to have way more than I did).    The bamboo shoots evened out the bitterness of the spinach, and the black garlic was just...there.   The Diet Coke was served by the can, which is always annoying if you want a bit more beverage.\n\nService was friendly, but not terribly attentive given how quiet it was.  They were prepping for an 8 top coming in though, so I imagine the place will do enough business to stay afloat.", "author": "Jes G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-05-31", "description": "It was a cold, windy day in San Francisco and we were craving ramen and searched Yelp for somewhere to satisfy that crave. Based on the reviews, a lot of yelpers ordered the black garlic ramen but the idea of duck meat wasn't at all appealing to my husband and I. \n\nWe both ordered the tonkotsu ramen, mildly spicy for me and medium spicy for him. First of all, there wasn't enough broth for the noodles. I found myself pacing the amount of broth to my noodles so I don't run out. And it had spinach. I've never had spinach in my ramen before. It isn't a vegetable common to this dish. The pork Chasu wasn't that tender. The noodles were too chewy as if they weren't simmered long enough and seemed a step before al dente. While it wasn't inedible it was very standard and I wouldn't make a trek to come here again. I've eaten at Ippudo in Manhattan, NY and Kitakata Ramen Ban Nai in Costa Mesa, Ca so excuse my tastebuds because those two places alone have set the bar high for what I'm used to when eating ramen.  The mild was also pretty spicy. I should have ordered it with no spice at all. My husband said his medium was more like hot spicy. \n\nWe also ordered the chicken kara age and this was lightly battered and tasted like chicken breast meat was used served with one slice of lemon and a mayo dipping sauce on the side. This appetizer was delicious and I enjoyed it more than my ramen. \n \nThe server was fine enough. She refilled our hot tea. But she gave us two sets of thin napkins and took away our bowls with leftover broth without asking if we were done with it.  Then to top it off, she split our check without asking us. We ended up having to use the card twice to pay. I was slightly annoyed she assumed we were paying separately. It wasn't really busy at all and she seemed to be moving slowly.  I am pretty understanding because I have been in the restaurant before, but this server seemed to lack some skills common to serve in anticipating a guest's needs. She should have assumed we would need more napkins and asked about the rest. I probably won't be going out of my way to eat here, the next time I'm in San Francisco. I just wasn't wooed.", "author": "Tina S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-06-03", "description": "Not bad, not great. I got the tonkotsu ramen which had a decent taste but nothing to be amazed at. The noodles had a great texture though. It wasn't overcooked and was chewy. I asked for mild spiciness, and while that gave the broth a nice kick, the spiciness definitely was more than mild =P It's better to get it non-spicy and add chili peppers that are given to each table.\n\nI really enjoyed that the ramen came out within a minute of me ordering. This place is really good for a really quick meal since there's basically no wait for your food. And for $10 (cheaper ramen than other places around here), it's quick and cheap.", "author": "Desmond C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-05", "description": "Place - easy to find. Pretty many tables and bar inside. Normal japaneses style interior. \n\nTaste - I ordered chiken ramen and black garlic ramen. Chicken ramen was simple and clean soup. It was light soup. Usually I couldn't eat all heavy soup base ramen. But this one was light soup and not too salty. So I ate all! Really deliciousXD!  Also black garlic ramem was is so great! Garlic in teh ramen was black. Overall ingredent were well cooked. \n\nService and Price - service was good and price is reasonable!", "author": "Da Won L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-11", "description": "On 4/8/2017 while I exploring San Francisco, I visited to this latest Japanese Ramen restaurant called, \"Kan Ramen.\" Located at Columbus Avenue between Financial District and Chinatown, this place serves the customers to taste their finest Ramen and Udon noodle soup creations especially appetizers and eatable foods. The atmosphere is very laid back and calming as I welcomed there. The concept is much original compared to your local Japanese Ramen restaurants across the United States although inside while I entered, it's much dark in daylight filled with low light settings across the whole room.\n\nThe employees here from servers and cookers are doing a good job for making the customers like me a spectacular service! No cons at all.\n\nNow onto the food! I ordered the Beef Udon Noodle Soup which it includes thin sliced beef, onions, a tofu, shittake mushroom, soft boiled marinated egg, napa cabbages, green onions and whole wheat udon noodles in Beef Udon broth. As I ate it, that beef udon noodle soup tasted very good! I can feel the flavors for both basic ingredients of toppings and beef udon broth combined, and it blended perfectly in a perfect harmony. The udon is much fresh and eatable to bite which I'm very satisfied about it. Not a bad meal at all for an early dinner!\n\nParking at Kan Ramen can be challenging to park. You can park at the nearby surface street metered parking nor the parking garage available. Alternatively, you can also ride a bike, walk, carpool, ride sharing or public transportation easier without the hassles and gimmicks.\n\nIn the end, Kan Ramen is the most amazing and incredible local Japanese Ramen restaurant that I've ever discovered for the very first time. Perfect for friends, family and co-workers gathering every day and night. A well visit! My rating: 4 solid stars.", "author": "William L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-08", "description": "I had the tonkotsu ramen (not spicy) and I  Loved it! It came out very quickly. I also was served water is soon as I came in and the hostess was excellent at keeping it filled. I also had no problems when bringing in my service dog. Once I clarified that she was a service dog the staff did not care that she was there. When I went in it was nearly empty but within a few minutes the building was completely full. This did not make the service any slower. I would recommend us.", "author": "Murphy H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-03", "description": "It's probably a good idea that I didn't get the hottest ramen in the house. Went with the 3 out of 4 hot and it was perfect. After a long insurance audit at Transamerica in SF, we built up an appetite that warranted satisfaction.\nIt's San Francisco. There are plenty of places to choose from in the financial district but I was able to plant the seed early on and got my way so we ended up here. \nWe waited 20 mins for them to open and were served right away. I ordered edamame and the best Gyoza in the whole city... Funny thing but we all ordered the ramen with pork and we were all impressed. The consistency here is spot on and the menu is short so they can get you in and out in a jiffy. \nMy only complaint and compliment all in one is that they don't give you enough broth... but then again, this isn't pho so enjoy the offering. 4.5 stars  so far.", "author": "Carlos F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-21", "description": "Underrated ramen place in North Beach. I think this place is comparable to Marufuku in Japan Town. I love the green spinach on top of my ramen. Probably not traditional way of eating ramen but it works!!!! And you don't have to wait in line. I will definitely come back.", "author": "Vy T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-28", "description": "I was looking for a good ramen place in Chinatown and this was a super solid ramen experience. The portions are good and the price is definitely reasonable. The regular ramen is $10/bowl. There's only a couple items on the menu but I'm glad the focus is on the ramen. \n\nI got the Tonkotsu ramen and the broth was super flavorful. It had a good garlic flavor and the broth was delicious. The noodles could have been more bouncy, but they were still delicious. I also like the pieces of pork it came with. Usually I'm not too excited about the pieces of pork on top of ramen but this one was really good. My bowl also had a bunch of raw spinach, which was strange and something I've never had before in my ramen. No complaints from me though since I love veggies! \n\nThere's not a lot of tables and luckily my boyfriend and I came right before the lunch rush. The waitress was super quick in taking our order and our food arrived promptly. Great experience overall!", "author": "Kelly N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-11-16", "description": "Kan Ramen is affordable and their noodles are cooked al-dente, but in the end their recipe really phoned it in in terms of taste/ingredients. You can tell it's just a business and they aren't very passionate about getting ramen 'right'. It feels like they could just as easily be selling postcards or office supplies or poke bowls or boba tea instead. On a small college campus, this would be considered the best thing in town.\n\nThe tonkatsu broth is good but average, like it could've come from a can. The noodles are standard store-bought. The udons are a mess of inauthentic ingredients my own Chinese mom would use, which is not bad, per se, but it's definitely more southern Chinese grandma homecooking rather than well-researched professional stuff. That's fine! $9.95 a bowl is still a good 1/3 cheaper than most ramen. I'd say their price is the main draw - that and it's competently made. The waitstaff is super slow here. Overall, it's not a bad cheap eat, but for real professional ramen for a higher price, go to Kirimachi a few blocks away.", "author": "Ken H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-21", "description": "This is my favorite Raman place in the city. The ramen from experience is quality. I have had my share of good quality ramen suggested by many people who know ramen from Japan and this is a good one. The black garlic ramen is highly addictive. The price range is reasonable compared to other thing in the city. The service when I've been here is always good. Service staff is always attentive.", "author": "Patrick T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-06", "description": "As the food trend continues with ramen, hot pots, and Indian (Asia) food, there are now more options in the Chinatown, North Beach, and Financial District these days.  Having heard about this place over a year ago (yes Cherylynn N. (https://www.yelp.com/user_local_photos?select=5Me2Ji0kh4w9aBdMlVHS-w&userid=saJuyv784apZzH--psHZ3Q), you were one of the first to put it on my radar), I hoped to get to them one by one.  A few weeks ago, I walked here for a weekday late lunch and noticed the sign in front of the restaurant (https://www.yelp.com/user_local_photos?select=oxv8P7FjfjjC27v45sRURQ&userid=saJuyv784apZzH--psHZ3Q).  Though having just enjoyed a King Henry's prime rib a few days earlier, I couldn't resist the special.\n\nWanting to try a variety of their offerings, I started with their chicken karaage (https://www.yelp.com/user_local_photos?select=GtgldaRAaeCN-NkOq_bVhg&userid=saJuyv784apZzH--psHZ3Q).  They were crispy and served hot with a nice aioli dipping sauce.  The only drawback was the crisp part outshined any meat taste.  I took half of my order home as I wanted to save my appetite for my main.  The  roast beef ramen (https://www.yelp.com/user_local_photos?select=5Me2Ji0kh4w9aBdMlVHS-w&userid=saJuyv784apZzH--psHZ3Q) which I added corn was served in an interesting bowl, wider than it was deep.  Given an option on the spiciness of the broth, I chose the second highest degree which is spicy.  The zing seems to come from white pepper that was likely added to the broth.  The beef was tender though cooked medium rather than the ad's pictured medium rare.  With the add on, my meal was around $25.00 but that includes my leftover karaage.\n\nThe restaurant has about ten tables so large parties should make reservations.  Dining solo, I was seated at the front corner table away from the door... made me think of \"Dirty Dancing\"... nobody seats baby in the corner.  There were three occupied tables when I arrived and a couple larger parties of four and eight came just before I left.  Service was efficient and my water glass refilled.\n\nIt's a nice option if you're in the area and there is a good variety of options here.  Still looking for a favorite ramen in the City.", "author": "Mike C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-09", "description": "I have been to Kan Ramen more times than I can count. It is my favorite ramen place in the city. I always get the house special ramen, which comes with most of the goodies you expect in ramen, plus a few hunks of duck meat. The broth is flavorful and the noodles are firm and chewy. \n\nThe service is polite, and there is rarely a wait. Sometimes I wish the menu were a little bit bigger, but, who am I kidding? I'm still going to get the house special every time.", "author": "Matthew L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-22", "description": "Its a small, clean shop and, at 8:30pm on a tuesday night, I was the only one there. I ordered the beef udon and thought it was good. A little too sweet for my taste, but still very satisfying for a crisp, summer night in SF. Price for udon was $9.95 plus tax = $10.80.\n\nI will definitely be back!", "author": "Joann V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-09", "description": "I honestly walked into this restaurant not liking ramen because of past experiences. My boyfriend was craving it and we decided on this place because it is close to my apartment. I'm so happy we did! I got the shoyu ramen (medium spice level) and he got the tonkotsu (very spicy and they were not kidding around). SO GOOD. I was surprised at how much I loved it. The broth and toppings tasted very fresh. Will definitely come back again.", "author": "Diana R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-16", "description": "I ordered the Chicken Ramen ($9.95). At first, I was about to order the Vegetable Udon ($7.95) but it did not look appetizing on the Yelp photos.\n\nThe noodle to topping ratio was about 4:1. The chicken was very firm and I was given approximately 5 small slices. There were not too many kikurage mushroom pieces, but they were tasty. There was an ok amount of spinach. The spinach did not seem to match with the rest of my dish though.\n\nThere was a decent amount of broth. I was glad it did not taste too salty!\n\nMy food arrived quickly. The portion size was decent for its price.\n\nThe waitress was attentive. I felt like she was watching me the whole time I was eating.\n\nUnfortunately, the menu states that you can not substitute toppings. I would have substituted the spinach with shitake mushrooms.", "author": "Kristina M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-16", "description": "Service was a little bit slow but it seems that there were only 2 people working in the entire restaurant. My go to ramen is the traditional tonkatsu ramen. Their tonkatsu broth was great but the black garlic ramen I thought lacked in the flavor side, almost bland compared to the flavor rich tonkatsu. The waitress was super accommodating to some people in our group who haven't tried legit ramen before.", "author": "Vanessa N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-04", "description": "This is my new favorite restaurant in sf China town. We order the pot stickers and the black garlic ramen. I ordered the ramen with medium spicy. It came out just perfect. This was the first time I ate ramen with duck. The duck with perfectly cooked. The broth was hot and very satisfying. The portion was very generous.", "author": "Tony Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-02-15", "description": "My coworkers and I were here in SF working in Chinatown for the week so we ventured here after work because it was only about a block or two down. The restaurant was pretty clean and there was only one other table dining in at the time that we came in. The menu had some build your own ramen options with choices of broth and they also had appetizers and some other specialty items on the back such as udon or rice dishes. For every dish, they also have a customizable level of spice that you can choose. I ordered the black garlic ramen which came with duck breast, chashu, soft boiled egg, spinach, bamboo, black fungus, etc. I ordered my broth to be medium spicy. The ramen came in such a huge bowl that I couldn't finish it but the broth was really good, and spicier than I thought it would be which I liked. The noodles however, were not that great to me. They were too over cooked for my liking (I like my noodles to be chewier), and the duck breast was pretty rare which I did not like and I ended up not eating. The chashu was sort of dry. Other than those issues, I really did like the broth and the service was really good too.", "author": "Victoria Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-11-27", "description": "I had hope...\n\nI know they Kan make it\nI know darn well, they Kan work it out\nOh, yes, they Kan, I know they Kan, Kan\nYes, they Kan, Kan, why Kan't they?\nIf they wanna, yes, they Kan, Kan...\n\nI bet you didn't know the Pointer Sisters were singing about ramen. Anyhow, Jamie W. and I were strolling on Columbus Avenue after having a satisfying pasta dinner at Piccolo Forno when we noticed this relatively new ramen place had opened. By the following weekend, we were back in North Beach to give it a try because that transcendent bowl of ramen I always long for remains somewhat elusive in this city except for the likes of Mensho Tokyo which is indeed awesome. This is no Mensho Tokyo, not by a long shot, and while I find that marginally disappointing, I can hardly say I was surprised by the middling nature of the food here.\n\nAfter all, we were the only ones in the place for a good half-hour before a group of rowdy teens came in with their indiscriminate palates. We started small with the $5 plate of Chicken Kara-age, which were prepared more like crunchy McNuggets than true fried chicken bites. However, a squeeze of lemon helped as did the accompanying hot mustard (photo: http://bit.ly/2gMiZPD). For his entree, Jamie bypassed all the ramen for the $8.95 Chicken Katsu Curry, which was a good-size portion but lacking somewhat in seasoning. The curry was full of potatoes and carrots, almost excessively so (photo: http://bit.ly/2gMiW6p).\n\nHe got a bowl of piping hot miso (photo: http://bit.ly/2g7ckhI), but it was left to me to try the ramen. I ordered the $9.95 Tonkotsu Ramen with Garlic Pork Flavor. It came with a couple of slices of pork chashu, half a soy sauce-marinated soft-boiled egg, kikurage mushrooms, bamboo shoots, spinach, seaweed, and green onions. I had them add two slices of duck breast for $3 and corn kernels for $1.25 (photo: http://bit.ly/2gvpohj). The noodles were al dente enough, but the rather paltry portion of medium-spicy broth refused to come to life and had an inconsistent consistency that made the whole creation disappointing despite the added meat.\n\nFOOD - 3 stars...the ramen had the right ingredients but failed on the broth front\nAMBIANCE - 3.5 stars...decent-size space in North Beach, all dark woods\nSERVICE - 3 stars...efficient but too quiet to be helpful\nTOTAL - 3 stars...middling ramen made me heave a heavy sigh......no, they Kan't Kan't", "author": "Ed U."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-23", "description": "We had our first authentic ramen at Kan Ramen recently and fell in love!  We wish our hometown had a ramen place like Kan Ramen.  We knew it was the real deal because we were never offered forks or spoons.  We're not chopstick users but we learned quickly.  Our meals (chicken and black garlic ramen) were to die for!  Fantastic service, helpful staff, super clean facility and great value for your dollar.  Kudos to the owners/staff ... you guys are awesome.  Thank you for a fantastic experience.", "author": "John And Tracy C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-24", "description": "This is a surprise find for good ramen. It's a small place with no frills but the service is nice and there's a lot of items on the menu.\n\nI came here with a party of five and we all got some appetizers to share to start. The gyoza was tasty and fried just right, but they only give you four pieces per order. The chicken karaage was good too although the skin was more like katsu skin. The edamame was adequately salted and plentiful.\n\nWe all got the black garlic ramen because we couldn't resist. It was indeed very good. The broth was a tonkotsu style broth (very creamy) and very salty. But the flavors were very rich. I got the mild spicy and I was already dying, so I can only imagine the medium and hot to be out of my league. It was about $15 for this bowl, and they give you lots of meat and veggies. They even have sliced duck, which was delicious. I thought the pork chashu was okay.\n\nI should take my ramen loving friends here to see what they think. I have been generally disappointed with ramen in the Bay, so this was a nice find.", "author": "Danielle C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-02", "description": "Small ramen place we found after walking around in the rain. One server but she was nice and tried her best to be tentative. We got the Tonkotsu ramen and seafood ramen (which was not on menu but a special they had). Both delicious but I preferred the seafood ramen due to the taste of the broth. Overall experience was good.", "author": "Diana N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-03", "description": "The broth is a bit too salty for my liking but the ramen is pretty good and I really like the duck, pork, and egg in the ramen. \n\nAlso I love how there's no stupid long lines, meaning I can eat before I get hangry. :)", "author": "Clara Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-16", "description": "I've had the black garlic ramen the last time I was here with duck and I am a huge fan of duck meat. It's not very traditional to have duck in ramen, but seriously I don't care. Duck is good. Soft boiled egg was good, not perfect, but good. Chashu is decent, broth is just ok, ramen noodles are fine, and ramen is expensive as hell. So why the 4-star rating? Obviously it was the duck.\nI would definitely come back again, but it's hard to justify around $20 for a bowl of ramen after tip and tax. I'll probably have to skip or bring lunch from home one day, just so I can have another one of these duck ramen!\n\nI had the regular tonkotsu ramen before and it didn't stand out that much, but still beats non-ramen specialty Japanese restaurants.", "author": "Mike O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-18", "description": "wow... is all i can say... i love the ramen... san francisco is san francisco a place for unique blends of food. I must say the black garlic is a must to have when you're in Kan Ramen. \n\nPrice is actually pretty good for the place and location. 5 stars for having one server but  able to do everything in a breeze... it was a great experience and i will definitely do it again.", "author": "Maria D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-02", "description": "I wanted udon, so I wandered around for a bit. Getting lost along the way until I ended up here. I ordered the chicken udon and extra spicy (cus I thought it wasn't going to be spicy). My udon came out rather quick and when I took a sip of the soup I almost died lol. It was so spicy! But I enjoyed it haha plus it was hot out to me so I think that made it worse. Usually when I order anything chicken I hate it because the chicken always seem to be dry or lack flavor but the chicken in my udon was so tender and juicy! It was very filling and I left satisfied.", "author": "Linh N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-09-17", "description": "I love me some ramen, but haven't been able to find anything that lives up to Ippudo NY.  On the border of Chinatown & North Beach, this joint serves up ramen that is just ok.  It's decent compared to nearby restaurants, but its ramen is no star among ramen.\n\nBlack Garlic Ramen: I was really looking forward to this because I love tonkotsu broth and I like black garlic.  Unfortunately, this was just ok.  The broth was cloudy looking, but didn't have that super rich pork bone flavor.  The black garlic was essentially three 3 whole cloves of fermented garlic thrown in the soup.  That created for some really intense and unbalanced bites.  Most places which serve black garlic wisely add it as a mince, purée or sauce so it gets evenly distributed.  The roast pork was standard.  The boiled egg had that nice semi-runny yolk.  The duck breast pieces were a little too rare and chewy.  I feel like in a soup, roast duck would work better.  Noodles were fine.  Portion seemed large.\n\nChicken Kara-age: Perfectly crispy chunks of breast meat.  A tasty spicy mayo dipping sauce.  Definitely a nice way to whet your appetite.", "author": "Adam B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-06-01", "description": "Me: \"Hey, what do you want to eat?\"\nFriend: \"Dim sum, you?\"\n\nMe: \"I wanted to check out the new ramen place 2 blocks away.\"\nFriend: \"I really want dim sum.\"\n\nMe: \"How about we go to dim sum first, eat lightly, and then, share a bowl of ramen?\"\nFriend: \"I'm getting old...my metabolism isn't the way it used to be.\"\n\nMe: \"You can always bring the dim sum home for leftovers?\"\nFriend: \"OK...dammit, I'm going to look like a pregnant troll by the time I turn 40.\"\n\nAfter said friend demolished everything at dim sum because he didn't want to carry the leftovers, we made our way to Kan Ramen. We walked into a dark and empty dining room before noontime. Did someone forget to pay the electricity bill? \n\nWe sat down and perused the menu of 4 ramen: Tonkotsu, Miso, Shoyu, and Black Garlic and choose to go with the Tonkotsu Ramen ($11) with an added marinated soft boiled egg (ajitsuke tamago) for an additional $1.75 (typo on menu states $3.75). If you're not in the mood for ramen, they also have udon, curry, and katsu rice with the typical Japanese apps: edamame, wakame, gyoza, karaage, and tempura. I liked that they highlighted the \"O\" in Tonkotsu since it's often misspelled as \"Tonkatsu\", the fried pork cutlet. Cc's accepted.\n\nThere was a language barrier (non-Japanese owned) as I wanted to confirm that they didn't use msg in their broth. I asked three times and even in Cantonese but the waitress gave me a blank stare. I asked if she can ask someone in the kitchen and she gave me a blank stare. Ok, nevermind...I guess, I'll find out sooner than later.\n\nTonkotsu Ramen w/ chashu, hard-boiled egg, spinach, lotus root, kikurage mushrooms, bamboo shoot ($11 + $1.75 ajitsuke tamago): http://bit.ly/1ZdgWQK.\n\nThe highlight was the chashu which was melt-in-your-mouth tender but one slice was thickly cut while the other was half the thickness. The noodles were mushy and definitely from a package as I saw one of the cooks in the kitchen separating the strands so they wouldn't clump when cooking. The tonkotsu broth was porky and salty but missing that creamy depth of flavor. They should just do away with the plain boiled egg and replace it with half a marinated boiled egg which had a savory sweet molten center. \n\nMy friend thought the ramen was good but isn't picky. This is a guy who says, he wouldn't mind having his bachelor's party at Denny's.\n\nAside from the language barrier, service was quick and cordial. \n\nI know ambiance is often an afterthought in Asian restaurants but they should turn on the lights and add some background music. It was pretty much crickets until another couple arrived who also commented at how dark it was inside. \n\nParking is ridiculous because it's in Northbeach/Chinatown and this is by no means a destination restaurant. It's best suited for those who work around the Transamerica Pyramid.  \n\nFriend who demolished all the dim sum at lunch, also demolished the bowl of ramen here. \n\nMe: \"I thought you were full?\"\nFriend: \"Gotta work on that pregnant troll figure!\"", "author": "Cherylynn N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-16", "description": "I adore this ramen shop. It's a nice, quiet little place in the middle of the city. Nothing fancy and just perfect. Their ramen is high quality and has exceptional flavors. The broth is obviously done right. I really need to try their other specialties, but I just love the shoyu ramen so much! Can't wait to go back next time we're in the city.", "author": "Christy O."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-06-03", "description": "Meh\n\nI ordered the black garlic ramen and it was $17. I don't know about you, but I think spending $17 on ramen is kinda expensive. The portions were enough but for $17 I expected better taste and portion size. The bowl looking plate is looks deceiving, but really it's just a big flat bowl. Don't believe me, spend $17 and try it on your own expense", "author": "Stephanie Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-16", "description": "I can't believe this place has been in my neighborhood for this long and I never checked it out! Beyond impressed with their ramen, and it will definitely be my go-to spot from now on. My friend and I had lunch there right at 11:30 when it opened and we were sat and served immediately. The lunch menu is pretty sparse; there are three ramen choices (tonkotsu, miso and shoyu) and a list of add-ons (extra noodles, extra egg, etc). There were some non-ramen dishes on the back of the menu but that was about it. \n\nI chose the miso ramen, medium spice, with an extra egg. My friend ordered the tonkotsu. My ramen was SO delicious. The noodles were perfectly al dente, the broth is very flavorful, and the eggs were seriously cooked to perfection. I slurped up every last drop. The pork is tender, not too fatty, and there's just the right about of veggies. My friend's tonkotsu was a bit lackluster; the broth definitely needed a bit more flavor. \n\nThe atmosphere is average, but pleasant. Service became a bit spotty once the place filled up around 12:30. The ramen is reasonably priced and delicious. A great lunch spot in the neighborhood, and well worth the food coma that hits you when you return to your desk.", "author": "Regina L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-27", "description": "After a rough morning at work there are two things that pick me up. My mom's chicken soup and Kan Ramen's Tonkotsu.  A soothing calm restaurant in the middle of busy San Francisco. I eat Ramen everywhere I travel. The tonkontsu here is amazing.", "author": "Marion R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-10-17", "description": "Honestly surprised how this place has 4 stars, although right now it only has 74 reviews. I should've known something might be off when I walked in and the place was totally empty at 7pm. But I was cold and hungry and thought a bowl of ramen would hit the spot.\n\nI ordered the shoyu ramen, mild, and it was just straight up bad. The broth was extremely salty, the noodle texture was clumpy, tough, and reminded me of instant-ramen style products with each bite. The chashu had no real flavor and wasn't very tender. The bamboo shoots flavor wasn't good, and the spinach they dropped in there made your mouth feel even weirder with all the saltiness going on.\n\nI still ate the whole bowl because I was cold and hungry, but if I ever return on another cold and hungry night, I am for sure not ordering the shoyu.", "author": "Gore S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-19", "description": "The Cool Tea Bar on Columbus Avenue is gone (Rest in peace). And inserted in the same spot is a new ramen restaurant, which has not officially open yet and currently in the soft opening stage. Even with the restaurant has not open, I still managed to sneak in to try the newest ramen place in North Beach. \n\nFrom the menu, there are very minimal offerings. And I ordered the Black Garlic Ramen soup. For a pricey $17.50, I get sliced Cha shu, sliced daikon, soft-boiled brown eggs, soba noodles in a creamy and garlic-flavored broth. The price is indeed very questionable. But the key ingredients were solid. And the soup was very creamy and the garlic flavor was not too overpowering.  No mint was needed after eating this unique bowl of soup. \n\nI forgot to mention on my Quick tip. The newest ramen place does not serve hot tea yet. But I did mention that the restaurant accepts Cash only. So be prepared. \n\nHopefully the restaurant will get what they need to do to prepare themselves for the official opening and offer more from I got from my visit.", "author": "Matt G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-04", "description": "Yay! I'm a fan!!\n\nI ordered the tonkotsu ramen. Broth was creamy, flavorful and salty (not unbearably salty though). Noodles were perfectly cooked - springy with a bounce. I was very satisfied with the copious amount of toppings, in which all were delicious! Chasu was tender and tasty.. I was honestly impressed with this. The only downside would be the half boiled egg, which was a bit overcooked in all of the bowls at our table (however that doesn't seem to be a problem for others, so maybe it was just a minor hiccup). Other toppings include kikurage mushrooms, a lotus root, bamboo shoots, spinach and green onions! \n\n*Don't forget!!!! If you like your ramen spicy or with a little heat, ask for their house made chili sauce! It was served in a tiny tub on the side, which was great since I could control how much or how little I would add to my bowl. Their chili sauce is delicious... a little garlicky, tangy and of course... spicy! I thoroughly enjoyed adding a good amount of it to mine! \n\nWe also ordered the karubuto squash tempura, which had a lovely crispy exterior and a soft interior from the squash. We all loved this.\n\nPersonally, I was a little bummed that their black garlic ramen is $17! Once I heard they offered this, I knew that was the bowl I was going to order. After finding out it was $17, I quickly changed my mind to the regular tonkotsu instead.. ($11). (FYI, garlic ramen has a marinated soft boiled egg, where as regular tonkotsu's egg is not marinated.) \n\nAll in all, I will be back for sure!", "author": "Kris C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-23", "description": "Not bad... not bad at all in comparison to all the other ramen places nearby. \n\nCame here for a table of 3 around 2PM (late lunch...hehe) and the place was practically empty except for one other customer. The interior wasn't bad, a little dark but overall a pretty modern ramen shop layout. Slight complaint about the environment is that they seemed to have a slight gnat problem. There was a gnat chilling on the chopsticks, as well as some flying around when we ate. \n\nI got the tonkotsu ramen and overall the ramen was pretty good. The broth isn't as milky and a little more salty than other ramen shops I been to but every restaurant has their own uniqueness. Loved the half boiled egg. Bamboo shoots tasted like they're straight from a can. Portion size is a little smaller than most places since I was able to easily finish my bowl, where at other places I would struggle. Also a big plus since they gave me a sample of their house special hot sauce to try....and I love spicy food @___@ \n\nOverall, I would come back. Service was great, food was good, prices not bad.", "author": "Jenny N."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-05-10", "description": "New. Thought to try it out with a friend. Almost walked right past the place as the store itself didn't stand out with the windows all covered. If you didn't look up at the store name, you'd probably walk right pass and miss it. Entered in and the lighting was quite dim and dark. Got seated and the menu looks similar to other ramen places. Both got tonkatsu ramen and also gyoza. The food didn't take long to come.\n\nGyoza: disappointing as it was not pan fried well. Just pan fried on the bottom and the rest was soft and soggy like boiled pot stickers.\n\nTonkatsu ramen: broth was nothing special. Friend said noodles were too soft. The char siu was ok\n\nProbably wouldn't come back. The place is really dim and dark...no decor on the walls.just not a welcoming or nice feel to the place to eat at.", "author": "Carmen L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-03", "description": "The light was quite dim inside the restaurant and I was not sure if it was open but the colorful, neon \"open\" sign shone brightly so I entered. And ended up having a wonderful bowl of ramen. The cutlery was really classy. It was quite unique for me to eat ramen with duck slices. The duck was cooked to the right extent but I think I prefer the usual style of eating ramen with pork slices. The ramen eggs were pretty salty but addictive. The fact that most of the customers were Asian is testimony to the quality of the ramen here. :)", "author": "Fang Wei G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-02-14", "description": "Not the best ramen, but not horrible. LOVED the soft mainated egg, boiled to perfection. Boring broth, kind of odd taste. Probably wont come back.", "author": "Kelli N."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-09-11", "description": "This is a pretty poor ramen shop. The broth is not much other than salty. The noodles taste like instant. The chasu was bland and a bit tough. No evidence of black garlic. The soft boiled eggs were fine.\n\nGlad I was not too hungry as I didn't need to eat much of the large bowl.\n\nAlso no beer only tea and soft drinks.", "author": "Scott K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-30", "description": "Although it's not as hyped up as some of the other spots in town, this was one of the best ramen experiences I've had in San Francisco!\n\nThe best part is that you're not waiting in line forever. Two of us walked in at 7:30 on a week night and the place was almost empty.\n\nThe tonkatsu broth was rich with flavor but not overwhelmingly rich. The noodles were cooked well and the egg was soft boiled to perfection. I love that you're able to add duck chashu! It was rare and a delicious compliment to my soup.\n\nI will definitely be back instead of waiting in line at one of the trendier spots.", "author": "Sara M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-04-02", "description": "Overall this place was not great. My husband and I love trying ramen everywhere we go. But the broth here was average. Noodles were good but basic. The soft boil eggs were good and cooked correctly. Nothing special. However the service was great.", "author": "Karla S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-06-25", "description": "Let's just say I wouldn't go back here I had ordered a ramen and it was bland  definitely needs more flavor we also had ordered a plate of just fried rice on the side and the rice was hard like they just microwaved it.... very disappointed....", "author": "Leticia L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-22", "description": "Came upon this little spot on my way towards home.  There was a parking spot right across the street so it seem destiny I'd try out some early evening broth and noodles.\nThe atmosphere and the menu are spare.  What they do offer is quality.  The service is traditional and the ramen is tasty.  I had the Black Garlic Duck Ramen in a pork broth.  They give you a choice of spiciness ranked from no spice all the way to 3 chili peppers for hot.  I was feeling tame so I chose 2 chili's for a medium level.   The duck was tender and flavorful as duck is.  The extras of bamboo shoots, spinach, soft egg and sprouts was just right proportional to the noodles and broth.  I was almost able to finish.  I'm ashamed to say I packed the rest for home; I hope the chef wasn't insulted.\nI really enjoyed Kan Ramen.  The only thing I'd love for my next visit is a selection of Japanese beer and sake...maybe some plum wine.  They only offered canned sodas and water.  A tea menu might be great.", "author": "Luke B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-06", "description": "Decent big ramen portion.  Also ordered Gyoza which is not worthy - five tiny Gyoza which costed $6.00.  Overpriced..", "author": "Michael H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-24", "description": "This place is a hidden gem tucked away in San Fran. I loved how I could customize my broth, noodles and heat level! And as a Caribbean native who is used to spicy food, this place knows is spice!", "author": "Sarika R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-05-03", "description": "How is Kan Ramen rated so highly? My experience was completely different from those of other reviewers, apparently.\n\nI went to Kan Ramen over the weekend with some friends and had very high expectations due to the Yelp rating. The service was very good and the appetizer was fine, but sadly the ramen was incredibly disappointing and sub-par.\n\nOur dishes:\n- Chicken Kara-age\n- Tonkotsu Ramen\n- Black Garlic Ramen\n\nThe chicken was nice - I liked that they fried it with real panko breadcrumbs instead of the batter that some other places use.\n\nHowever, the tonkotsu ramen broth was super bland. Looks were VERY deceiving, and after my first spoonful of broth I was completely let down. We poured so much shichimi togarashi into our bowls just to give it some flavor. One of my friends tried my noodles and compared it to eating boiled spaghetti. Additionally, the soft boiled egg that comes with the tonkotsu ramen is a plain egg with no marinade. I was pretty disappointed for having paid $11.\n\nMy friend ordered the black garlic ramen, and while there was some garlic flavor, she also mentioned that her broth was very bland. For $17, I would expect the broth to be decent at least.\n\nI hope that we went on an off day and that it's usually much better. Sadly, I don't think I'll be back to try again.", "author": "Kelly L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-06", "description": "This is a small restaurant but very friendly, excellent service. Ramen is very good and pricing is very reasonable for the area. I'll be back next time I'm in SF.", "author": "Elizabeth C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-12", "description": "I hardly ever write the review sitting in the restaurant but for this spot, I had to. I ordered extra spicy black garlic - holly molly; that's all I can say. Food is so flavorful and super duper broth!!  I will come back soon.", "author": "The Food L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-07", "description": "Service: 4/5. It's pretty good for what it is, there's usually only one person on wait staff so if it's busy you'll have to wait for the person to get to you, but they're fairly competent at their job and do get to you fairly quickly. And the food also comes fairly quick.\nCost: 4/5. It's pretty average for what you get, not too expensive not too cheap for a ramen spot. It's roughly $10 a bowl and the amount of food you get is good enough to get you full.\nTaste: 4/5: the tonkotsu and black garlic is good. Nice rich, creamy broth. A good amount of pork with the usual bamboo shoots, spinach, wood ear mushrooms etc... good amount of noodles. I think most of the side dishes are too expensive for what they are but the chicken karaage is okay, it's a little expensive but they do give you a good amount.", "author": "Jacky Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-05", "description": "Simple menu, firm noodles and delicious broth. One of my favorite ramen places. Not a big fan of their ribeye ramen, but black garlic or simply ramen in Miso broth are fabulous", "author": "Kyrylo B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-17", "description": "Waiting time is too long tho! But it's really good ramen, and it can be the 2nd best Ramen in town. Definitely come back!!!", "author": "Kelly N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-12", "description": "Okay ramen- ranks last on the short list of places where I've had ramen. Noodles were harder than I'm used to. If I could go back and do it again, I would not.", "author": "Lon G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-05-27", "description": "New place (3 days old!) on the border of Chinatown and North Beach, across Tosca Cafe...so it's a good location as it's not too close to the other ramen joints on Montgomery. LOVE the interior: very clean, slate flooring, dark brown furnishings; wooden seats have cushion. Best of all: the tables are comfortably apart from one another, so you won't feel jammed up, smashing elbows w your neighbor. Interior: A+ for ramen joint.\n\nOk, so I ordered the tonkatsu ramen. Broth is great, milky and substantial; salty, but not outrageously salty like other places. Noodles were small in width, but they cooked nicely, not too soft, but some bounce to them...but the bowl other details that other places do not! For one, the hard boiled egg was probably the best I've had in the city: marinated and flavorful. There was even a big lotus root slice on the top. See pix.  Nice touch! All in all, I'll be back before the lines queue up ...! Ramen: A!\n\nUpdate: May 27. I was here last week for a second time and left disappointed: no marinated egg, and Ingredients didn't seem as fresh as before.  Hope they return to opening day standard.", "author": "Randy M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-13", "description": "I like this place. It is not hyped, and I love their food. Fav- tonkatsu ramen. Noodles are lovely and firm to the bite, their veges fresh, meat lean but tasty, and egg nicely done. I personally like the broth, simply delicious, just don't slurp it all down, can't be entirely good for you. Also, I am more into salty than sweet, so this is perfect for me. People are attentive, environment is practical, clean but not clinical, and has a nondescript untrendy couldn't be bothered vibe that I miss sometimes from places in some parts of asia. Recommended!", "author": "Juls C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-12", "description": "Came here for lunch. Tired the Tonkatsu ramen and chicken kara-age. Ramen was decent  and chicken was ok. Not the best ramen place in the area but for the price it surely is good value for $$.", "author": "Lochan P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-08", "description": "Delicious ramen! I got the beef ramen with garlic and it was very good, I will definitely come back.", "author": "Kristin S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-10-09", "description": "Mediocre ramen that's great to satisfy your cravings. Tonkatsu ramen was good and miso ramen also! Broth could use more flavor and depth to it. Seaweed salad is also good. Not very busy when we went so service was fast and friendly.", "author": "Pamela S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-01-28", "description": "I've been wanting to try this place out for some time but there's either a long line or it was closed for some reason. Walked by this Friday night at around 9PM and it was totally clear so in we went. I ordered the tonkotsu ramen and my boyfriend ordered the shoyu ramen.\nThe ramen came out at a fair time and had such a good serving of noodles, which doesn't always happen when you order ramen. I was definitely stuffed at the end. The broth was pretty good, not the best I've had, but it had good enough flavors and the shoyu ramen was just right for shoyu ramen. I like the inclusion of spinach, something that you rarely see in Japan or any ramen restaurant unless you're in the bay I guess. It's good to know that if you want something healthy in your ramen, you can eat the spinach :P The char siu isn't as soft and tender but it's still pretty good, and the soft boiled egg is boiled to perfection. Just gotta love that egg yolk. Not a fan of the bamboo, which tasted weird even for out of a can.\nGotta say, it was probably one of the few bowls of ramen that didn't disappoint me in the bay. It's not the best, but it would definitely hit that ramen craving and at a fair price for ramen places in the city.", "author": "Jenn T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-18", "description": "Excellent ramen that came out of the kitchen quickly. \n\nWe've been looking for a place that didn't take 15 minutes to serve a bowl of noodles. This is it. The menu is perfectly sparse. They have a couple of other offerings, but the focus is on ramen.", "author": "Jeff S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-07-31", "description": "It was a slow lunch, I craved for ramen and this place was near by. I got black garlic specialty ramen but when I received my ramen and half way, I noticed my pork wasn't cooked fully through... Two stars because it's cute and the server was attentive but that pork was a deal breaker for me.", "author": "Jay K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-23", "description": "Fast good service. \nFood is delicious at a modest price. \nI ordered the Tonkonsu with no extras \nPacked full of noodles, succulent pork slices. \nThey did not skimp out on the fixings. \n\nMy other ordered the beef udon.  So cheap but the bowl was packed to the brim with delicious flavors.\nMeat & onions marinated to perfection.", "author": "Brandon E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-23", "description": "Surprisingly good ramen. Jumped in here on whim for a quick pre-dinner bite, don't judge. Broth was well seasoned and rich, but not incredibly fatty. I got their signature black garlic ramen, which came with duck and pork chasu. Their egg yolk had a great creamy texture, not at all one of those sad overboiled eggs. Lots of included fixings such as wood ear mushrooms and bamboo. Quite delightful. Best part? No ridiculous line. In and out and off to eat more.", "author": "Minh N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-11", "description": "Me and my friend had dinner here and we were satisfied enough with their good meal. Black garlic ramen and Chicken ramen taste good. Spicy level was medium but was not that spicy I think. A little salty but fine.", "author": "Changmin L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-07", "description": "I ordered the standard tonkatsu ramen with medium spicy, which was just the right amount of spicy level for me. It was a pretty standard bowl of ramen, but their pork was really tender and soft. Some people in my group had also duck breast, and they said it was even better than the pork.", "author": "Kevin W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-01", "description": "Ate here on a day where it was 95 degrees out (not my best idea). The food was incredible. Get the black garlic broth. Full of flavor and huge portions.", "author": "Jared B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-06-13", "description": "Meh. Totally underwhelmed at Kan Ramen - the noodles weren't fresh and it seemed like it came from a frozen bag from a non-Japanese supermarket. The agedashi tofu is pretty good and the service is good overall. Totally empty the day we went there though! I'd go elsewhere if you want a good bowl of ramen.", "author": "Lauren L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-11", "description": "It took me a while to try Kan Ramen, partly because there isn't a lot of hype around it (unlike Mensho and Nojo) and the Yelp reviews aren't amazing. I'm glad my boyfriend and I decided to go on a random Saturday because it was surprisingly tasty! It's not world-acclaimed ramen but definitely hits the spot. \nI got the extra spicy tonkotsu ramen and the bf got the black garlic ramen. The black garlic ramen is priced at $14.95 on the lunch menu (not sure if it's still $17 at dinner) but for the extra $5 they give you another half shoyu egg and two slices of duck. My broth was perfectly creamy, not too thick or salty, and the runny, smooth shoyu egg was to die for. The noodles were pretty standard but cooked well and the chashu was very tender. The extra spicy spiciness level was good enough for someone looking forward to the rest of their day.\nHonestly, I would have a hard time choosing between Kan Ramen and Underground Ramen, which is also really good but kind of overrated. Definitely putting this on the lazy weekend lunch rotation!", "author": "Katie M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-24", "description": "I love Kan Ramen. The people that work here are so friendly . Food is great and service is very attentive! Would recommend to a friend! Oh and free wifi if you ask for it (: occasionally close for family matters but not for long and always leave a note on the door! Great people!", "author": "Flavia D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-05-20", "description": "I think this may be a Chinese approximation of ramen. That's not necessarily an indictment, but it's not quite the same as the actual Japanese version:\n* Noodles were uninspired. I don't think they're made in-house\n* Duck Char Siu is just not good, and overly rubbery\n* The black garlic ramen has a few cloves of blackened garlic in it, not the pool of liquefied garlic as one would expect\n* Broth was good, but it missing something that really diminishes the richness\n\nAt the end of the day, this place scratched the itch, but only a little.", "author": "Andy M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-06-11", "description": "I love ramen. So this place was a disappointment. Very basic and bland. I ordered the miso make your own hot. The broth had nothing to it, top ramen has more flavor than this place. I am giving this place a 3 star because the server was sweet and accommodating. I would not recommend coming here.", "author": "Lauren C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-03", "description": "My boyfriend said this place is \"pretty good\" let me translate for you... This ramen is f-ing great!\n\nHe got the black garlic super tasty... Perfect amount of silky rich broth with the amount of spice to cut the fat. FYI the spice is almost a tingling spice that does not build too much but rather is even tempered.\n\nI had the chicken ramen which was a home run. White meat and tender chicken with no grit. Yum yum! \n\nOur server refilled my water several times. Overall great service! Will definitely be back :-)", "author": "Stephanie I."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-17", "description": "Real  soup ! No MSG! No condensed soup base! How wonderful to see A real ramen shop in this area. Tonkatsu ramen and chicken-age are must try!", "author": "Betty L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-05", "description": "I come from Seattle, the land of mediocre ramen.\n\nOn that basis, Kan is great. Not amazing or mindblowing, but solid. Haven't tried many ramen restaurants in SF yet, so I don't have a solid baseline yet. \n\n+1 for being in Chinatown and not being cash only", "author": "Tuan V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-23", "description": "Great atmosphere! Pretty quiet and easy to get seats. The ramen was good, although not much of a choice for meats. I love pork belly ramen and they have no pork belly unfortunately. The udon was very good! I think my favorite thing was the chicken cubes! As an appetizer.", "author": "Kelly F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-05", "description": "Had chicken ramen, medium spice.  WONDERFUL broth; the egg was so silky and flavor-packed; chicken was pounded thin so it cooked quick & absorbed the umami broth; noodles were able to soak up so much delicious flavor, yet still stayed sturdy (not soggy).  Went at noon on Saturday, Feb 4, 2017, not-too-busy, VERY SWEET AND HELPFUL staff.  Would definitely go again the next time I am nearby.", "author": "Laura D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-06", "description": "Best ramen in town! No lines fresh food nice service! Coming from LA, this is truly a gem.", "author": "Peter S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-29", "description": "Excellent ramen, gyoza, atmosphere and service! We were greeted and promptly by a sweet woman who offered that we sit wherever we like. She immediately asked if we would like hot green tea (which was free), I presume because it was very chilly on the night we were there. We both ordered the Tonkatsu (pork) ramen and gyoza. The gyoza came out with a nice crisp and tender skin, the pork filling was very good. Then came the ramen. The ramen came with spinach, soft boiled egg, pork. The broth was milky and delicious, the noodles were cooked perfectly. There were other people in the restaurant but the atmosphere was nice and quiet overall (which we prefer). \nWe chose this restaurant due to great reviews and easy walking distance from our hotel (Hilton). I would highly recommend Kan Ramen!", "author": "Jessica A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-07", "description": "Black garlic ramen was absolutely killer, and I likes me some ramen. Get it Extra spicy!", "author": "George C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-07", "description": "Didn't really know what to expect from a ramen joint in North Beach, but it was so much better than I expected! And MUCH BETTER than any of the other ramen places nearby in the Financial District, and very reasonably priced. We got the miso ramen and shoyu ramen. Broths were flavorful, noodles and veggies were plentiful, and the pork was tasty. Lots of menu options and only a half mile from work... HUGE WIN!!!!!\n\nIf I could give half stars, I'd give it 4 1/2.", "author": "Darryl Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-29", "description": "Solid local haunt. Low key vibe. Don't expect bustling hipster vibe ala other ramen places nearby, nor fine dining. Just a nice quiet local setting with friendly family service.", "author": "Clutch R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-07-03", "description": "After eating ramen in Japan where every ramen shop is amazing, I am now looking for new favorites back home in San Francisco.  The topknots broth at Kan Ramen is indeed good.  I think it is actually boiled with the pork for about 16 hours or so.  The pork chasu is very tender and tasty as well.  My complaints are the noodles and egg.  The noodles looked and tasted like the instant noodles you buy in the packages.  There were not dense and chewy like they are in Japan.  Also, the egg that is included is half a very bland hard boiled egg.  To get the marinated soft boiled egg, which comes standard (especially in Japan) they charge a whopping $3.75 which brings a bowl of ramen to nearly $14.00", "author": "Max G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-23", "description": "My daughter had us stop at this place. Ramen was excellent. Chefs special Spicy Beef Bowl was danked just enough to spice.", "author": "Joel A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-22", "description": "The service is very good. Place is trendy. But most of all, the ramen is good. They use pork bone to create the soup base fresh everyday. So you can really tell the difference.", "author": "Michael L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-14", "description": "I live in the area and have been dying to stop by and check it out. As a ramen lover I am happy to say that I really like this place! I ordered the tonkatsu ramen and I'm super happy with it. Creamy flavorful broth, tender pork. I also go a side of shrimp tempura and it was great! Truly good tempura. The space was very cute but empty when I went at 530 on a Friday. Music was weird 90s music, but I got over it. Definitely coming back for my ramen fix!", "author": "Malina M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-30", "description": "The pork broth is the tastiest I've had in ramen places. Portion size is moderate. I wish they gave a full egg instead of half an egg. The one major complaint is that we waited 30-40 min to be served after we sat down. There was a large group party before us.", "author": "A J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-19", "description": "This is definitely one of the best ramen places in the city!Fast even when it's busy,an excellent service and extremely delicious ramen!This is my neighborhood place became one of my favorite Strongly recommended!!!", "author": "Tina T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-24", "description": "Went to Kan Ramen after a bus tour around the city. Hubby and I had garlic pork ramen, my son had chicken udon. The broth is very tasty. A nice comfy food in gloomy windy day.", "author": "Fang L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-24", "description": "We had the miso ramen and shoyu ramen.  Quite tasty, hinting on the salty side.  Enough toppings to have something in every bite besides noodles. Relaxing atmosphere, as hoards of people still haven't discovered this place yet. A nice change from the long wait at Underground Ramen and we enjoyed it more than Slurp Ramen.", "author": "S T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-28", "description": "Awesome place loved the food the waitress was nice enough to have a conversation with us (me and a buddy) the food was fantastic. I don't eat pork and of course ramen has it so I ordered a udon which is basically a ramen without pork haha and it has been my craving since I've eaten there I always crave it. Amazing food and great service at a affordable price. Saying cheap would sound rude but it is cheap food but quality is  amazing. Will definitely stop by next trip to SF for sure and will definitely recommend to another friend. Thanks!!", "author": "Ali S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-06", "description": "Wow.  I never leave reviews on places but I am a ramen enthusiast and this place overall just kills it.  I highly recommend this place.  Consistently consistent.  Great job.", "author": "Vito L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-18", "description": "Taste not bad, at least not salty the one I tried. I will come back because it's near my workplace in Chinatown.", "author": "Sandy Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-07", "description": "Was very accommodating and the broth was very good. Great place to grab a good bowl of ramen.", "author": "Nicholas S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-11-23", "description": "'Meh. I've experienced better' is apt here. I had the tonkotsu ramen. It wasn't terrible but the broth could be more flavorful (it was too watery). The pork did not melt in the mouth.", "author": "Linh D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-09", "description": "Easy in and out ramen shop. Service was quick and friendly! I tried the chicken ramen which wasn't the best ramen ever but the noodles were cooked perfectly. The hubs got the black garlic ramen which was delicious (I kept stealing his broth). Will definitely be back to try other ramen on the menu or stick with the black garlic!", "author": "Sally S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-22", "description": "Ramen was good! I'd come back for the shoyu ramen. Didn't think the soft boiled egg was worth the price though. No wait both times we went which was great.", "author": "Carmen Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-18", "description": "Was delicious. Ate the standard pork ramen", "author": "Gary B."}
