{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-17", "description": "Kasa is a nice fast-casual type Indian restaurant offering beautifully presented dishes with slightly above average taste.\n\nThey are incredibly vegan friendly. There are always minimally two vegan main dish offerings, plus the dal is vegan. The food could be more spicy, but I'm sure they're appealing to American taste and are trying to be more flexible with the fast-casual aspect of the business. That said, they have plenty of hot sauces you could add to your dishes. \n\nOverall, I think the dishes are good, but not incredible. Definitely satisfying for a quick lunch.", "author": "Christina M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-09-06", "description": "Food is pretty good but overpriced and staff can be very unfriendly and have an attitude. \n\nI was there on 9/6 around noon", "author": "Amit R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-22", "description": "Have eaten here three times. Food is good, fresh and seasoned well. The only hiccup is the price. It is priced on the high side. $70.00 for three people. HOWEVER, the food is very good and so is the service.", "author": "John Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-22", "description": "I'm giving them 5 stars because they are really good for a quick stop in for Indian food. It's Indian fast food and is actually quite tasty. I opt for the wraps and I like their chai, it's voted best in the city. Last time I went I waited a few minutes for my food and they gave me a free Mango Lassie. Their service isn't too bad. It was like under $10. Give them a try.", "author": "Leilani M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-14", "description": "I wish they had some of these in the East Bay or even near work in Downtown SF!  I used to come here more often, but it is a bit hard for me to get to these days.  I really love the food here.  It's fast and yummy!  I love Paneer and they have lots of different options.  The plates and wraps are filling and delicious.  I hope I get to go back again soon!", "author": "Megan M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-16", "description": "If you need a satisfying South Asian fix from a very limited menu, then Kasa works in a pinch. I first got acquainted with their fresh-tasting food when they opened their original 18th Street location in the Castro a few years back. Yelp had a sneak preview party I attended, and I remember liking their Lamb Curry Thalis Plate which they described as a deconstructed kati roll or to us unworldly types, an Indian-style burrito. Surprisingly I haven't been back there, but Jamie W. and I ended up here after taking a stroll on Nob Hill. We were thinking of grabbing a salad somewhere for dinner, but then I flashed back on my original Kasa visit and suggested we give this orange and magenta-hued corner eatery a try.\n\nNow I remember when this prime space on Polk and Post was a cool hipster coffee spot called the Fourth Wave, but it's been Kasa for at least five years. The brief menu still consists of kati rolls and thalis plates, but what caught our attention was the $9.95 Chicken Tikka Masala Salad, which turned out to be a generous size platter of Romaine hearts and greens mixed with kidney beans, crunchy vegetables like carrots, celery and red cabbage, and quite a helping of grilled spicy chicken. It came with a lentil chip topping along with a tamarind chutney and a yogurt herb dressing on the side (photo: http://bit.ly/2Dgq827). The combination provided tasty freshness with a minimum of decadence. This is a solid option in Polk Gulch.\n\nFOOD - 4 stars...uniquely flavorful salad with true Indian spices\nAMBIANCE - 3.5 stars...simple communal tables, seems like most of their business is takeout\nSERVICE - 3.5 stars...pretty efficient, not much for chit-chat\nTOTAL - 4 stars...Kasa survives and thrives with nicely spiced flavors", "author": "Ed U."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-08-02", "description": "Came with my kids attracted by lunch specials. Price is good, got Thali for $ 13.50 for the 3 of us. Don't hesitate when ordering or you'd get the clerk's look. \nPortion are enough, flavors okay. Chicken Tikka Masala was over cooked, your dish includes a fountain drink soda, about 8 different options of flavors, however cola was out of order, btw didn't like any flavor.", "author": "Myrna M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-27", "description": "My friend brought me here after 30 minutes of deciding where to eat. I ordered the chicken tikka masala combo plate.  The portions were very generous and I accompanied the combo with lamb curry. Everything was very good!  The taste was amazing and all food freshly cooked.  I couldn't believe I ate the whole thing!  I love their craft sodas also for only $2. Will be back soon.", "author": "Paul S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-22", "description": "Kasa never disappoints. This one at Polk street was pretty clean and the staff was very friendly. Definitely coming back for the kathi rolls.\nThe chai is best", "author": "Japna C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-07-21", "description": "Was an alternative for Indian as opposed to Curry Up Now nearby. Kathi roll , saag paneer and samosa were good.", "author": "Sunil R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-17", "description": "We LOVED our vegetarian lunch here!!\n\nRainy day, hot vegetarian Indian lunch... what's not to love? \n\nCasual, stylish, delicious. Cute decor. Lots of vegetarian options...... \n\nI had the paneer khati roll; SO flavorful!\n\nMy man (from India) loved his vegetarian thali..... He got to chose two items which came with a roti and salad and rice.... Natural soda fountain with yummy vanilla sodas, root beer and colas !!\n\n\nFive stars in its category (not a five star restaurant) so expect casual / stylish, NOT gourmet or fine dining, just delicious somewhat casual food. \n\nand the staff was super welcome too. \n\nBONUS;\nClean cute bathrooms!", "author": "Stylishshopper .."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-24", "description": "Kasa catered our wedding reception, and they were AWESOME.  They were transparent about pricing, super communicative and responsive, and worked with us to create a menu to meet our needs. Our wedding was in a park - they delivered and helped us figure out what we needed to make it work.  Anamika was flexible and helped us to figure out how much to order and we ended up ordering the perfect amount - just enough leftovers for people to munch on at the after-party, but not excessive amounts. Most important - the food was yummy! All our guests complimented us on the food, even the super picky ones!\n\nWe will 100% be using Kasa for catering again in the future. Thanks again guys!!", "author": "Meg B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-17", "description": "Great customer service the food is good, had the Chicken Tikka with Turkey/Pea and lentils and pickle onions. The tables were a bit sticky and restaurant apeared dusty, hence 4Star.", "author": "Sammy D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-20", "description": "Have walked by this place for years and always wanted to try it. Swung by for a quick late lunch a few weekends ago and was incredibly impressed. The kati rolls are amazing, and the portions are good (I had one plus a samosa, my boyfriend had two rolls - we were both super full).\n\nThe flavors are bold, everything tastes fresh, service is fast/friendly. I look forward to coming back and trying other flavors.", "author": "Katherine N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-28", "description": "Huge platter of food and lots of choices of different items.\n\nI noticed the tiny wraps were popular to order, maybe because they're good for grab n go. The staff on the line making the orders were a bit slow, they could've used a bit more sense of urgency because a line started to build up. There are tables to sit at on the borders of the restaurant and then one large community bar style seating table in the center of the room.\n\nI think I ordered well for my first time with one of their combo plates with lamb. One of the sides was a firm tofu which I don't usually enjoy as much as soft tofu but for this dish it worked for me. Had good spices and combined with some green veggie. The tahini sauce was also refreshing with the rest of the dish.\n\nI'd order that plate again but I'd wanna try their wrap next time!", "author": "Laura Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-20", "description": "I visited Kasa today just as they were turning the closed sign to opened. This is a fast cadual restaurant, nothing fancy. When I got into the restaurant there were already people ordering. Despite the fact that there were only 2 people ahead of me, I felt like service took way too long to get the customers their orders and take my order especially since the food is all premade! \n\nI ordered the combo plate which comes with two entres: chicken tikka masala and seasoned potatoes. I also ordered a side of samosa. The combo plate is a huge portion since it comes with a lot of sides. Of everything on my plate, the beans were the best! The samosa was easily the best part of my meal. Use the sauce they give!\n\nThe sodas are also amazing!! I tried every single one and they are so good!\n\nThe major disappointment of the mea was that it was served cold! For being one of the first customers of the day, I expected the food to be hot. Instead of enjoying the flavors of the food, I was so turned off because I would eat one bite that was lukewarm and another that was so cold!", "author": "Erika L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-20", "description": "We love Kasa - it's quick, really yummy, and the staff has always been very nice. Marissa is our favorite, mostly because she's so sweet and always has a positive attitude. I usually get the Naan Kati Roll with Chicken Tikka Masala and my boyfriend gets the Thali Combo Plate - both of which are delicious!", "author": "Jacob L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-09", "description": "The restaurant is cute but the food is only average. I did not expect an authentic taste, but the mix of spices weren't great. Aloo jeera had lemon on it. Paneer was lacking flavor. Roti wasn't roti per se.. it was a wheat tortilla. Mango lassi was yummy. Huge portions but lack flovors.", "author": "Sudha R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-09-02", "description": "I would give 0 stars for service. The young lady working today was just awful. Bad attitude, did not greet us, smile or even look at us.  She really seemed miserable like she did not want to be there. I was so excited to take my bf and the employee really ruined it for him.  As for the food, I'd give 4+stars - super fresh & tasty,  and the place is very clean", "author": "Nomnom N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-21", "description": "Great quick dinner for Indian food. The staff is REALLY friendly and efficient. The food portions are rather generous and they do have a really good chai. Stuffed to the gills afterwards, but so worth it. Hopefully, they will consider branching out from SF and move toward the Atlantic coast...", "author": "Steve M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-10-13", "description": "I came here with a colleague for lunch during work lunch hours. It was surprisingly quiet considering the amount of offices in the area. \n\nThe food: I ordered a combo plate with lamb curry and paneer Marsala. There was a large quantity of food. The lamb itself was a little gristly. There was an almost overwhelming amount of paneer.  The flavors were a bit light handed for my personal taste, but good - well bloomed spices. The beans were salty. Combo comes with fountain drink which was a variety of flavored sparkling waters???? \n\nThe space: It's an order at the counter and seat yourself kind of place.  I loved all the window seating. The decor was very welcoming.", "author": "Stephanie L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-03", "description": "Great food with lots of flavors, kind of street food and trendy place interesting decoration. We went in late afternoon so not so busy.", "author": "Suzanne C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-09", "description": "Delicious Indian food in quick casual format. Love their Kati Rolls (basically like one small Indian burritos in a yummy roti). Great meats and vegetarian options.", "author": "Justin W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-03-30", "description": "DO NOT EAT here. \n\nI ordered from Kasa via Doordash and got food poisoning. I ate the chicken tikka roll and the aloo jeera. While the food tasted delicious I have been sick for 3 days. \n\nYou can see their health violations here:\nhttps://www.yelp.com/inspections/kasa-indian-eatery-san-francisco-4", "author": "Priyanka P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-18", "description": "In two days we went twice. Place worth going even for their tea. I have to say that they changed recipe of their tea compared to 4 years ago. We used to feel cardamom strong before. Now we feel more masala flavor. Both are ok but my preference is strong cardamom flavour before", "author": "Victoria Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-31", "description": "I remember trying Kasa for the first time at their Castro location and having a great experience. \n I had been a fan of roti rolls (shoutout to Bombay Frankie back in NYC), and Kasa seemed like the closest equivalent that I could find in San Francisco.  However, my recent visit to their Polk Street location did not impress me much (shoutout to Shania Twain).\n\nI unfortunately entered when the staff was consumed with making a massive order (I'm assuming for some kind of an event).  I understood the need for a wait given how much food they needed to prepare, but I was surprised that no staff members greeted or acknowledged the line forming at the counter.   Once they took my order, they moved quickly to make my Aloo Jeera roll, which I got Unda style (with an added fried egg).  You could decide what type of sauce you wanted on your roll, and I got the spiciest available.  I added two samosas as an appetizer, and seeing the completed meal made me ready to dig in!\n\nThe samosas were fine, with a flaky crust covering a decent potato and pea filling.  My roll was tasty thought poorly constructed, almost immediately falling apart after I took my first bite.  I also wished that the sauce had more of a kick.  I had a good meal, but it was nothing to write home about.", "author": "Keith H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-24", "description": "Around here, fast, good and filling are super important. \n1. Fast - the staff is great. they get your meal prepared and packed just the way your order it. Fast and perfect. \n2. Good - The food is just wonderful, perfect seasoning and fresh. It isn't just a one hit wonder, everything on the menu is wonderful. \n3. Filling - portion size are really filling, there is always a bit leftover for a snack later.\n\nNEVER forget the CHAI... it is life changing.", "author": "Press S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-09", "description": "Kasa hits the spot for good Indian food for lunch. Depending on my hunger level I will order one of two dishes, maybe a samosa as well. Everything is hot and ready to go, so it's a fast meal, not fast food. \n\nIf I am really hungry, I will order the Thali Combo plate with chicken tikka masala (my favorite) and saag paneer or the lamb curry. It also comes with fluffy jasmine rice, daal (lentils), chutneys and roti bread. It's a big plate and delicious. \n\nIf I'm just regularly hungry for lunch, I'll order the one kati roll with cup of daal. A Kati roll is a small snack size indian burrito filled with whatever you like, but along with the soup - it's a meal. They will ask you for your choice in sauces and I always ask for the most spicy one, as it is so flavorful and hot. \n\nWith the lunch meals you get a free fountain drink, I love the natural sodas and prefer the black cherry sugar free one. The vanilla agave soda is very good too, the selection is unique and great. \n\nI love Kasa, first introduced to it through a yelp event in the Marina when it first opened and have been a fan ever since. If you are looking for something a little different with familiar flavors, give Kasa a try.", "author": "Rebekah T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-11-20", "description": "This place was good two years ago.  The food was comparable to Shalimar, across the street, but was served more hipster.  Now, it's just more hipster in all the ways two years can impact a city.  By that I mean that 1) the food is not actually very good anymore and  2) you will stand in a line, behind 3) a bunch of eat 24 and uber eats drivers just standing there diverting the staff attention from actual customers (admit it, if you are too lazy to get food yourself, you are not a full customer, but just a consumer of the food-you outsourced the service).  \n\nSo the food:  It now sucks.  How can you actually have tough chicken tikka masala?  How did you make gently simmered chicken so tough?  A fried treat like a samosa-3 hours old minimum.  Oh, and serve it with a napkin or clean silverware... not available.  Seriously-go somewhere else.", "author": "Talbot M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-15", "description": "Tried yogi salad and a burrito. Taste was average, not very Indian flavour as they claim. But staff was friendly, ambiance and sitting was good. Also ordered Chai that didn't tasted well. I definitely wouldn't order it again. But I'll visit this place again to try more item!", "author": "Maulik S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-09", "description": "Loved the take on Indian food. The place is nicely decorated and the chai was the best!", "author": "Chelsea G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-16", "description": "I've never been to this place during high volume hours, but every time I go they give me and my roommate great + fast service. We usually stay a while and place multiple orders since its so casual and I eat slow. Me and my friend usually share a lunch plate, even though he prefers the Khati rolls. Theres plenty of food and I also like ordering those colorful wheel shaped rice crackers with yogurt and chutney. My roommate got nostalgic over their chai and Parle-G biscuits. Personally, I thought the chai was kind of intense and I wasn't expecting that flavor from 'tea' but I've accepted it and now I order it every now and then. I think everything her is pretty decent and I don't really have any strong/ must try recommendations :)", "author": "Gina B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-25", "description": "I absolutely love the food here. First time I ever came, it was just because I was hungry after work and I just so happen to walk in. Best decision ever. I tried the super Kati my first time. It's basically just a huge burrito with my choice of meat, for which I chose chicken tikki masala. So delicious! It's $10, a bit pricey but anyone who likes Indian food and burritos must try! \n\nDecided to just get the naan Kati today for something a little lighter. It's similar to the super kati except naan instead of tortilla and no rice. I chose the most spicy sauce and I loved it. The naan Kati was just as wonderful as the super Kati. I also love how they give a small cup of yogurt with the katis. Really complements the food. This option is two dollars less than the super kati ($8).", "author": "Annie H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-30", "description": "I ate here for the first time on Monday and cannot wait to go back for more! As a person who needs to eat vegan and gluten-free, going out to eat is not usually very exciting for me. Kasa is a sparkling exception! It was absolutely no problem at all to get a delicious plate full of fantastic tasty food that was both vegan and gluten-free! It could not have been yummier! The nature of the actual selections, FOUR of them, is that they are VG and GF so they are not a \"compromise\" type food. I posted a photo of my lunch on FB in a group for Gluten-Free Vegans and in 2 days, it has garnered over 220 \"Likes\" and \"Loves!\" I also posted the KasaIndian.com website several times because people asked me where this was so they could go! Service was fast and very friendly...Super Accommodating! Perfect ambience for a casual meal. Clean. I would give it 10 stars if I could!", "author": "Joni W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-02-27", "description": "Solid spot for a quick Indian food craving.  I got the side order of chicken tikka masala along with a Samosa! \n\nThe service was a bit slow considering how it wasn't that crowded but I guess with one guy working both the cashier spot and serving it made sense. \n\nI would have liked a slightly larger portion for the price but I'd totally order from here again!", "author": "Kimberly L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-04-13", "description": "I don't know what I expected from fast food Indian fare.  I guess it's kinda on me.  But they just make it seem like it's more than that.  I say pass and find something else to eat.  The icing on the cake was when I ordered my to go plate, they rang me up and then said they were out of plastic utensils.  What the hell am I supposed to eat this sub standard food with?  Flurg!", "author": "Samuel P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-01", "description": "Kasa is a staple. Great food quality and it's quick and easy. \n\nExtra shout out to the staff working today (New Years day) on a day where most places around were closed, they were open and operating under staffed, but the one person working the front did a great job moving things along and getting everyone there food.", "author": "Jay S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-10", "description": "3.5 STARS\n\nWe were all starving and came by Kasa Indian Eatery on Saturday, April 30th around 5pm. I'd never been here before, but my girlfriends love this place. Recommended the kati rolls. It is suggested you get two to make a meal, but I was having dinner later at 7pm, so I got one as a snack.\n\nI got one Kati roll: Classic street food like a small and tasty Indian burrito ($6) with Chicken Tikka Masala: chargrilled and marinated all-natural chicken in a spicy, creamy tomato sauce. Each roll comes with green chutney, marinated onions, and raita on the side. I got it with everything, but I kind of wish I didn't as I didn't care for what I think were the marinated onions. They were too sweet. And since they layer it on top of the green chutney (which I loved), I couldn't get away from the sweetness. The roll itself was delicious! The chicken tikka masala was flavorful and comforting. I also got a Samosa ($2.50 for one): potato and pea pastry which was okay. Not much flavor inside so I didn't really like the samosa. I'd skip it next time.\n\nI'd love to come back and try the Keema Muttar. One of my girlfriends loves that kati roll. I'm sure if I'm in the neighborhood, I'll come back and try it. I do adore that Chicken Tikka Masala one!", "author": "Elena N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-04-10", "description": "Pretty good! Got the naan chicken tikka masala kathi roll. My husband got the paneer. We really liked it. The sauces were pretty good too. They ran out of samosas so we were a little bummed out. \n\nAlso the bathroom doesn't have a lock! So beware", "author": "Ashmita V."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-02-19", "description": "It's certainly an (shitty) Americanized version of Indian food. The gravies don't taste nearly what they should.\nInstead try Shalimar, just across the corner for a more authentic Indian experience.", "author": "Nnnjjjddd D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-09-06", "description": "Was 3 stars for average no frills Indian food at a relatively lower price vs restaurants (but same trade off in quality). However -1 star for poor delivery experience on the plate specials they offer. They recently made a change to the plates by removing the Roti which was originally included, and instead charging +$1 to have it included. I don't mind paying an extra dollar, my bigger issue is that this is not clearly represented on the order apps and getting Indian food delivered without your Roti when it was expected is extremely annoying. It forced me to run .5 mile to the nearest Indian restaurant I could find just to awkwardly buy a Naan to go. I had to take another shower that night. \n\nAdvice to management: just include the damn Roti and raise the price of the plate in total for online ordering", "author": "Pratul L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-13", "description": "Amazing delicious spot! \n\nWent here late night after getting a bad haircut down the street. \n\nService was fast and very accommodating. We'd never been before, so had a few questions. Great fast casual Indian food option! \n\nThink Chipotle for Indian food. If you couldn't tell, I am Indian and the smells were amazing. \n\nGot 3 different Khati rolls - Aloo Gobi, Paneer Masala, and Chole. All were amazing! Delicious full flavors and good portion sizes. \n\nThe only thing I was disappointed in was that there was no more chai! For a place that claims the best chai in SF, I was crazy excited to try it!", "author": "Aaditya S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-03", "description": "Kasa has a unique take of some indian dish classics. Their paneer is the best I have ever had. I am lucky my work gets food from here and hoard all the leftovers. The restaurant is great as well. If you like Paneer please come try theirs. Two thumbs up!", "author": "Amanda M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-17", "description": "Samosas! While living in Surabaya, Indonesia, I fell in love with samosas.  No, they are not Indonesian, but I worked at the Surabaya International School where there were several Indian families.  They made the fried or baked dish with a savoury filling, such as spiced potatoes, onions, peas, lentils,macaroni, noodles or minced meat (lamb, beef or chicken) and since then it is one of my favorite dishes.  Indian samosas are usually vegetarian, and often accompanied by a mint sauce chutney. Samosas are a perfect lunch meal for when time is of the essence.  I pop into the Kasa  Indian Eatery on the corner of Polk and Pine and get an inexpensive meal that will fill take care of my appetite.  Kasa also has many other excellent choices for food, but I usually eat only the samosas and sometimes will get the chai drink.  Their award winning chai is a little on the sweet side, but hits the spot when I need that pick me up.  \nThe staff at Kasa are always friendly and efficient.", "author": "Derald C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-25", "description": "So good! I tried the little burritos. Would have given 5 stars but my order was wrong and they did not fix it... BUT, even the mistakes were so tasty. The chai was great. Music lively! Great quick spot for lunch.", "author": "Vanessa A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-15", "description": "I had their chicken tika masala Kati rolls every night for dinner one week... true story.", "author": "Billy H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-03-22", "description": "I like the veggie samosa's. I asked for a small cup of lentils and the gal at the counter said I'd have to pay for the large size anyway. Really? Would be great if Kasa could be a bit more flexible...", "author": "Mark E."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-12-12", "description": "Earlier this month me and my mates came to this business for lunch on the occasion of one of my friend's birthday, I can't really comment on the quality of food as we were REFUSED SERVICE after waiting about 20minutes. \n\nMy friend went in and was told that we will have to wait about 10 minutes, that's okay, we all were understanding and we waited OUTSIDE for 20 MINUTES(SOMEHOW NOT IN THE CAMERA VIEW). My friend goes back in to ask how much longer is it going to take only get a reply in the effect of we have lots of to-go orders to handle right now and won't be able to offer service to you, well THIS we could have also understood given IF we were informed about this when we first walked in or atmost 5 min after we requested for service. Even after embarrassing us (including my friend- the birthday person) I still might have left them 2 or may be 3 stars giving them the benefit of doubt for now, but what irates me is, one of friend actually left a review here describing the whole situation that occured during our rather unpleasant visit to this business, courtesy: staff, the owner or manager or who ever handles this business's Yelp page replies back to her with incorrect information and said something in the effect of hunger making time seem go slow, well I take offense to this. Further ahead she mentioned us waiting for only 7 minutes? Well read my review again, we waited outside and NOT in the camera view for 20 minutes, WE WAITED THAT LONG, NOT YOU. This whole business rep snapping back at customers who have a rather serious complains about a business is something absolutely NOT acceptable, I expect you to step up a notch and provide further false information about our visit and keep covering for your staff. You should take these reviews as constructive criticism and work on it. \n\nYelpers can always update their reviews if they believe a business has improved from last time they visited. This way you are just spreading the word of really bad and absolutely un-professional customer service. \n\nPS: I really COULDN'T CARE LESS about what you have to say now, although I will try my best not to advice ANYONE to go for this business. I am a working professional, none of my office's catering events are knocking at your door. Good luck being disrespectful to your guests. Cheers!", "author": "Bhavesh S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-04", "description": "Chicken Tikka Masala packs a bunch of heat so beware \nNaan has just the right bite, not too chewy or soft\nPortion of filling is enough to get you through as a snack but you will need two roti's for a full meal\n\nOverall Thoughts\n\nQuick Indian food that gets the job done", "author": "Eddie W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-18", "description": "I love the Thali plate here. It's the perfect combination of veggies, rita, spicy sauces, rice, lentils, and main courses. Everything here is full- flavored and fun. Also, they have the best vending machine in the city with naturally flavored sodas like black cherry, grapefruit, and ginger. STELLAR.", "author": "Chris L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-03", "description": "This is a quintessential fast casual Indian restaurant.  Nothing fancy, nothing too shabby.\n\nLUNCH SPECIALS: It's basically almost the menu price but you get a free drink (I think the Thali is $11.50 instead of $11.95, but you get a free fountain drink.  So it is a better deal than otherwise but it's not like a knock it out of the park special.\n\nTHALI: For the price, it's pretty good.  Huge scoops of rice, roti, lentils, 2 choices of entrees, tons of chutneys, raita and a salad (which I don't get anymore because I don't care for it).  I like the chicken tikka masala and the channa masala (garbanzo beans - they aren't on the menu but I think they normally have it if you ask).  The aloo gobi is a bit one note.  The paneer masala is a bit oily.  The other potato dish is almost too sweet.  The saag paneer is just fake tasting.  Doesn't even taste like spinach.  So it was a little hit or miss for me, but I found two dishes I really enjoy!\n\nKATI ROLL(s): for almost the same price as the thali you can get two kati rolls instead.  That's basically a pice of roti with an entree inside of it.  I prefer the Thali since you get rice, lentils and all the other goodies.\n\nMANGO LASSI: it's terrible.  Stay away from it.  I don't even know how to describe it but it tastes almost like it's spoiled yogurt with sour mango leftovers.\n\nSupposedly they are known for their chai but I haven't had it.  But the mango lassi was something to stay away from so I'll stick to their food instead.\n\nThey are a little inconsistent, sometimes they just give away extra pieces of roti for people who ask and sometimes they'll charge you.  So you can ask but depends on how they feel I guess.\n\nThey offer samples, just ask.\n\nDine in or take out.  I think if you dine in you get WAY more food on the thali because it's a huge silver platter type of plate.\n\nAccepts credit cards.", "author": "Traci H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-12", "description": "Yay! New favorite quick bite go to. Huge portions, fresh & delicious, fast & very friendly.  Reasonably priced.", "author": "Alice Y."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-12-28", "description": "Disappointed.\nDal looks like lentil soup and has an off putting color (I'm used to a vibrant yellow and depth of flavor). \n\nKati roll was laughably small. At first I thought it was a side of flat bread/chapati for my dal but then I realized, it was the actual roll. \n\nTwo stars because the flavor of the Kati roll was great--in each of the 6 bites of the tiny roll :/\n\nI'm out $12 and lamenting that I could have just gotten an $8 burrito at a taqueria and been full + have a few extra bucks to get dessert. Thali combo may be a better value so I may check that out next time if I ever return.", "author": "Semuteh F."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-09-01", "description": "Kasa Sucks! Had a horrible experience! \n\nVery disorganized & had only 1 person helping several people at once. He & it did not flow well like others restaurants do.   \n\nVery frustrating; will not return.", "author": "Jeremy A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-16", "description": "Sooooo this place is sooo SO good. Recommended to us by friends we all ordered it on uberEats one afternoon.  The naan Kati roll with chicken Tikka masala - yum!!", "author": "Tanya S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-08", "description": "I am a sucker for Indian food, authentic or \"fusion\", so I stopped in on my way to a show at the Marine Theater one night. I had a samosa, roll, and one of the Indian beers they had available. I found everything to be flavorful, the service was good, and they were especially patient with me as it was my first time there.", "author": "Candace R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-06-13", "description": "Have been to these place a few times over last few years. I used to love their paneer and aloo jeera Kathi rolls. However, I feel the quality has gone down. The bread used to wrap isn't as good as it was before and the size of Kathi rolls is so small from what I have had here 2 years ago.\n\nSamosas were good.", "author": "Neha G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-08-16", "description": "This place was confidently located near my office but was just ok. I tried both the combo plate and their Kati roll. Each time I was sufficiently full after eating but not wowed by the quality of food or the service.", "author": "Lyndsay M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-06-02", "description": "I really wanted to like Kasa but it was Shockingly bland. Spent 14 dollars for a 2 Kati roll plate and drink (went with chicken tikka). It was not satisfying at all, and I typically love most Indian food. It was also unnecessarily spicy (didn't add anything to the kati roll). I left without finishing a lot of it to get another lunch because I really was not enjoying it. Giving it one extra star because the place was clean and people were nice.", "author": "Rick P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-01-30", "description": "I've come here for fast Indian food and the place is usually clean and efficient enough. However the dishes I ordered today were very unsatisfying (I got the Thali). The chicken tikka felt like heated leftovers from yesterday, very dry and hard to chew. The potatoes were blah. The only nice dish was the green beans with potato sauce, clearly it was cooked fresh compared to the rest. I ordered another serving to finish out the meal as I had a hard time stomaching the other items. I asked if I could order it as an add on to my thali but no, I had to pay an additional $4.50 even though I had gotten a pricey $13 combo thali to start. So...almost $18 out for a lunch of rice, green beans and potatoes. Not really excited to come back.", "author": "Fin D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-01-20", "description": "Bland, unsatisfying, mediocre Indian food that tries to make up for the fact they can't cook for s*** by painting everything bright purple.", "author": "Ritch G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-01", "description": "Very friendly staff and good service, they do offer tastings of any dish you'd like! All fountain drinks are different, meaning no coke or sprit or any traditional drinks, which makes the place a bit more authentic :) great idea and it is a good place to have a quick meal or somewhere that you do don't have 50 different kinds to choose from. I got the Chicken Tikka Masala with the Eggplant dish, sorry can't remember the name :/ but it was delicious! Finished all of it special with all the sides they give you with it :)\n\nEnjoy!", "author": "Adel F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-31", "description": "This is a great stop for quick and tasty Indian food, when you want something easy and simple without having to call in to place an order first.  The kati rolls are great.  They are not the common egg-washed bread but rather more like a paratha.  At $6 each, you can get a filling meal for $12.  While saag paneer isn't on the permanent menu, they often have it.\n\nWhen the line is long, ordering can sometimes take awhile.  Also, the chai is not available unsweetened, and it is pretty sweet.", "author": "Sona P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-04-29", "description": "The food here is par at best, but what's really upset me today is that we ordered 5 different kinds of kathi rolls via Uber Eats, and they're all unlabeled. I mean how hard is it to get a sharpee and initial some foil? Now I have to open up each foil, and bread one at a time to decipher what's in it. Not cool at all.", "author": "Varun R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-01-30", "description": "My boyfriend and I have been searching for a solid Indian food place to frequent since we both love Indian food and we're sad to have found that Kasa is NOT that place. \n\nOverall, the price to portion ratio is not worth it. The food IS tasty, but a single plate or roll is not enough for one person in my opinion, and I'm a rather average sized woman. If you buy more than one plate or roll it quickly exceeds $17 + per person. \n\nI just wish their servings were larger because I'd keep coming back for sure!", "author": "Tamara S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-04", "description": "Keeping this one simple:  Very good grab-and-go Indian Kati Rolls.  Well worth the price - it's delicious food.  \n\nI recommend trying it.  The sauces are so good.  Great dipping sauces - and the garnishes in the rolls are good too.  Saag Paneer is my favorite.  Also love Philia Aloo.  And the chicken.  \n\nJust awesome.  I always love it.", "author": "Adam S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-01", "description": "I come here from time to time for lunch. Good deal on the lunch special. I almost always get chicken tikka masala but if/when they offer chicken korma that is my favorite! I think the size of the roll is just fine!\n\nThe main reason I felt compelled to write this review is because the gentleman that served me today around 3:30pm provided excellent customer service. He greeted me immediately, was fast and attentive. I did not catch his name (has curly dark hair) and I sadly didn't have enough cash on me to tip him, but I am putting this here in hopes that management takes notice that he does an excellent job. \n\nLooking forward to returning to Kasa Indian Eatery again!", "author": "Katie S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-01-08", "description": "I had not been in this place because there is a line to go through like the cafeteria in Jr. High. There are steam tables like the cafeteria as well. The place looked fine but it just never called me in until today. It was great! It has an open kitchen behind the counter person who is standing in front of the steam table. Friendly...engaging in fact...honestly, I'm not used to ordering anything in this city from someone who actually speaks English as a first language. DON'T get all worked up about that...I was born here so it's been a life time of communication breakdowns...anyway, they do Indian a little different. I had the \"Nan-Roll\" filled with Chicken Marsala. \"...would you like everything on it?\" I said yes but didn't ask what that meant- excellent. The San Pellegrino was ice cold and they do serve beer. There are lunch specials...the prices were very reasonable. When you consider this food requires a LOT of ingredients and time to make it right...it was a good deal. The place was really clean-clean-clean! Personally, too much clean bugs me but this was nice...nice colors, comfortable seating-I sat in this corner booth type seat. It's the only one and it's right at the corner, it seats 5-6 people, you can see well and after dark, you want to see well in this neighborhood. Over all, I'd describe this as Indian comfort food very well done. Just because the gal behind the counter ignored me on the way out when I wished her a happy new year...she was texting-it doesn't make her a bad person, it makes me an old person...Happy New Year!!", "author": "Rodney M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-01-18", "description": "I was shocked to find out they are serving frozen packaged samosas and store bought naan. Their menu and signage around the restaurant says everything is fresh.  The woman at the counter said that everything else was fresh.", "author": "Marie S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-08-18", "description": "Hahahahahahaaaaaaaaaaa\n\nI used to go there all the time about a year ago.  The sign for the Kati rolls said to get 2 for a meal.  They were $4 each.  Awesome.  Even 2 is not a lot of food, but they sure are tasty.  Then all of a sudden they were $6.  Huge jump, and I stopped going as frequently.  \n\nStarted working in a different part of the city, but had a chance to  go back today for the first time in months.  Now the sign doesn't say you need 2 for a meal, it says its an \"Indian burrito\".    And its $8.  There is a sign outside for the Kati Roll being a \"New Menu Item\", so between that and the sign not saying you need 2, I thought this was a completely different product.  Ordered one and the guy kept trying to sell me something to go with it.  When I got it, I realized why.  ITS THE EXACT SAME THING THAT WAS $4 A YEAR AGO!!!  It was literally 3\" long and 1.5\" around.  For $8.  Seriously?!?!\n\nTurns out the \"new\" menu item is the Super Kati Roll, which is just adding rice to the regular Kati roll.  Pass.  Oh, and that one is $10.\n\nGave 2 stars instead of one because the food is really good.  I can recommend the plates, but the Kati Roll is an embarrassment for $8.  BTW, I eat super light.  I can't remember the last time I finished a whole sandwich.  But after I ate the Kati Roll I was still super hungry.  I'm so disgusted by the rapaciousness of this establishment I can't even go back and get something else.", "author": "craig F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-10-07", "description": "3.5 Stars\n\nA somewhat \"new/newer\" place to grab lunch while I'm at work. And it's just around the corner.\nI went thru a quick phase of not eating any meat and this place had plenty of vegetarian options. I've tasted the samosas, chicken tikka masala  and the paneer in my kati rolls. Everything I tasted from here is very flavorful and you can taste the many different spices. You have to get their chutney and the raita to kinda \"cool\" everything down. When I had the paneer, my mouth was on fire, but I couldn't stop eating. I've seen their combo plates and they give a lot of food!", "author": "Mimie L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-20", "description": "Kasa is a perfect meal for the bar hoppers on Polk street!\n\nCraving for the munchies after a bar hopping experience?  Kasa is right on the corner, in neighboring bars and is conveniently waiting to serve you readily, deliciously made Indian, Pakistani food. \n\nTheir variety on the types that can be served up on your Thali combo entree for $10.95, was superb.  I really like the taste of the lamb curry and all the mixed up sauces, being eaten together.  The rice was well made - not too dry or overcooked.  Their Roti, can be used as a dipping bread for all the sauces provided. \n\nIt was a flavorful, hot mess!", "author": "Tiffany D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-04-05", "description": "The reviews are far too generous which lead me to try this place and regret it.  I ordered a full side of paneer tika masala which came in a small metal bowl and made me wonder how tiny the half side was. I also asked for a side of rice, it was just plain white rice. I was given a few condiments but no papadum so I used them to flavor the boring my white rice. Two small bowls of nothing special for $12, way over priced and the worst paneer masala ever. Avoid.", "author": "Amanda W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-14", "description": "The Chipotle of Indian food. Fast, casual, and delicious. I just had dinner here for the first time and I'm hooked. Great vegetarian options, too. Their especially friendly staff happily guided me through their flow, and even offered samples before ordering, despite being rather busy.\n\nJudging from the five tablets running next to the cash register, they should be easy to order delivery from, too.", "author": "William C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-05-24", "description": "I would have to compare this Indian burrito restaurant to Curry Up Now. Curry Up Now has a much better menu and experience. I don't understand why the burritos are mini instead of a regular size. There is a super burrito, but that sounded like too much to eat. One mini burrito at Kasa is a snack, not a meal like dinner. Why should you buy two? I tried the chicken tikka masala burrito and it did not taste right. The wrap was falling apart and was hard to eat. I like sturdiness with my wraps. I had a lychee juice. I was looking for some dessert and there was none. Interior is nice and they have a unique drink selection. I don't know if I'll make it back...but I do want to try the Thali combo.", "author": "Denise C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-10", "description": "They don't call it \"best chai in town\" for nothing. Since I don't drink coffee, I take my tea seriously. I like my tea not too sweet, and not overpowered by milk. And the chai from Kasa is just right. \n\nThe place was not too crowded (but then it was weekend and not lunch/dinner time). The interior is clean and the staff are super friendly. My Indian friend told me that the taste of the food are really authentic Indian flavor. \n\nHad been curious about this place as we passed by every morning / afternoon but never had a chance to give it a try. So finally in one nice Saturday afternoon, we were strolling and decided to give it a try and satisfied!!", "author": "Haryati S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-08", "description": "Simple eatery corner that surprisingly deliver the taste. \nAgreed with 'the best chai in town', even thought I have had better chai elsewhere (outside SF). So their Chai is the winning chai for now!\nThe thali meal platter seems to have small rice serving size, but wait until you gulp them down (plus the best chai!), then your tummy will be satisfied!!!\nThe chicken tikka masala tasted great too. \nThe spice level is meeting my baseline hot level. \nThe place is clean, adequate seating, and the corner location will make you enjoy your meal while watching passers by. \n(I spotted classic BMW motorcycle whole chomping away my thali ... )\nWill definitely come back, and since I am currently working in SF, will surely try the delivery with the office folks.", "author": "Dwi C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-17", "description": "Kasa makes me happy.  Seriously.  I consider it SF comfort food.\n\nA chicken tikka Kati roll with a bowl of dal really hits the spot.  Flavorful and filling, without being heavy!\n\nKasa's chai is also tasty, and the fact that it is served Parle G tea biscuits from India is an especially nice touch.\n\nService and ambiance wise, Kasa is fast, friendly, and inviting.  Love it!", "author": "Barnali D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-11-08", "description": "Classic case of Americans now knowing what the real stuff tastes like.\n\nChicken is incredibly dry and tasteless. Probably because it's cooked on the hot plate and not a tandoor.\n\nNaan? What naan. There isn't any. Flat incredibly thin \"bread\" that you'd see served in a Mexican restaurant is not naan.\n\nFood is served lukewarm also. Probably wouldn't be legal back home in Australia for such a low temperature.", "author": "Aaron R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-11", "description": "I came here for lunch, and it's the perfect fast food place if you are in the area. I went for the thali combo plate, and the 2 entrees I chose were the keema muttar and saag paneer. These were both delicious! If you come on a weekday for lunch, your meal comes with a fountain drink.\n\nThe workers are very friendly, too!", "author": "Rachel H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-09", "description": "Great little place to get a casual meal that still tastes bomb. I got their wrap which is basically an Indian burrito and it was absolutely delicious. My only issue was that the portions weren't sizable but for some that is desirable. The place is also in a good location with lots to do on Polk and nearby streets. Definitely recommend!", "author": "Ray K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-11-23", "description": "I grabbed a to-go order of the Thali plate here with the following side dishes:  saag paneer (special side that day) and lamb ($1.00 extra because I felt like balling out).  It felt a little pricey for fast casual, but the portion size was a decent.\n\nAs I almost  always do, I requested hot sauce. I was surprised to receive a small container with some yellow-green clumps.  Nevertheless,  it piqued my interest and I most generously applied it to my Thali plate.  MAN, does it pack a punch! Don't let looks fool you.  The hot sauce is for real\n\nThe lamb, saag, and side dishes that came in the Thali were OK.  Nothing screamed amazing, however.", "author": "Sebastian N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-11", "description": "It's one of my favorite Indian place in Polk. I like their chicken tikka masala and Naan.they have good samosa which goes well with beer or chai. The prices are affordable and the taste justifies it. Highly recommended for any indian food lovers", "author": "Pandeeswaran B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-24", "description": "Fast,  friendly and clean, just the way I like my lunch. The meal was awesome from the moment of presentation to the very last bite. The portions were perfect. The ambiance is fast casual, will be back for more.", "author": "David S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-08-26", "description": "Door locked at 1530. Closed? I dont see their health department rating posted outside.  :(", "author": "Dean N."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-04-14", "description": "Comfortable place for Indian food, but taste and quality are below average. Very dry meat in their chicken tikka masala", "author": "Roy O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-29", "description": "I've been going to the Castro location for a long time, and I'm glad the whole experience has overall traversed to this location. Kasa is an amazingly solid Indian spot that also appeals to western tastes. I've always thought of this place as a local chain that is going to explode nationwide one day, quite deservingly too.\n\nIs their food authentic? Probably, maybe, sort of. I don't think it's worth getting into an authenticity conversation in that most folks here have not even been to India, and is any tikka massala considered authentic? Who cares, really? If it's delicious and involves curry sauces, I'm there, and regional adaptation is important and appreciated. For whatever reason, I don't get as much of the typical Indian food heaviness feeling here, and I don't feel like things are overspiced like at many Indian spots.\n\nI do feel like the food is just slightly better at the Castro location. Over there, it just tastes like the dishes have been cooked longer, are less greasy, and are served warmer. The green chutney at this Pine location is dull-colored and less flavorful. So this is an area for improvement.\n\nWhatever it may be, any Kasa is going to be a solid spot, and I think the current 3.5 star average is being at least a half-star harsh to this delicious restaurant that puts in so much effort.\n\nI really like the new natural soda machines and the metal trays. Brings me back to all those hearty meals I had in prison. JK.", "author": "Jared R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-09-07", "description": "I love Indian food so I had to try this place out.  Staff is great in a great location. But the food is ok.", "author": "Joseph B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-12-13", "description": "Everything about this place is really disappointing except the food. Only 1 person working, huge line, no bathroom door lock or paper towels. But great food.", "author": "Billy S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-07-10", "description": "Got delivery via Caviar. \n\nOrdered the keema muttar kati roll (added an egg) and got the saag paneer as well. Food was pretty good, but the Kati roll was smaller than what I was expecting. I chose the option to add the smokin' hot sauce, but the restaurant either forgot to put it on the kati roll or the hot sauce isn't very hot.", "author": "Faiz S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-26", "description": "I was feeling low blood sugar and needed a good snack and this place had a Zagat sign on the door so I went in. I ordered a samosa ($2.50 for a good sized one) and a small salad. The samosa came with a fabulous cilantro-y chutney dipping sauce that was so good I wanted to lick the plate. The salad was full of fresh cabbage and veggies with a sort of sweet vinegar dressing. Service was friendly and I was VERY happy to have stumbled onto this place even though the reviews were so-so. \n\nIt's not the French Laundry, but it's as good as it gets if you want reasonably priced, yummy, fresh Indian food and friendly staff!", "author": "Thalia F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-07", "description": "Holy smokes.  Just got takeout from these guys via \"The BIG Ride Share Company That Delivers Food Now Too\" and honestly this was some of the best Indian food I've EVER had, and I've had a lot.  \n\nGot a Saag Paneer and it was piping hot, fresh and just plain delicious.  Can't wait to order from these guys again.  Definitely vegetarian friendly, of course, as you'd expect an Indian place to be.", "author": "Matt N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-23", "description": "Kasa should be commended for making Indian food accessible in an innovative way. I was particularly excited to give Kasa a shot because I've tried Curry Up Now and they seem like competitors in that they're both striving to serve fusion Indian food in a cheap and fast manner. Unfortunately, Curry Up Now won the first boxing match, but I am definitely going to give Kasa another try.\n\nI ordered two vegetarian samosas, which were tasty, but not the best samosas I have ever had. The outer shell/crust almost tasted a bit burnt; however, they were cheap and came with a delicious green dipping sauce.\n\nI also ordered the chicken tikka masala burrito which I was not super impressed with. To be honest, it tasted like it needed a bunch of salt. In hindsight, I wish I had dipped my burrito in the delicious green dipping sauce from the samosas, but I was so hungry that I scarfed the burrito down without dipping it in anything.\n\nI will be back to try other options off the menu because maybe other dishes have more flavor. I'm giving Kasa four stars because the service was quick, the food was pretty decent but not amazing, and I am super stuffed after spending only $14.", "author": "John L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-04", "description": "Stopped by here for a bite to eat in the middle of the best pub crawl on Polk street. Their kati rolls are the perfect drunk bite, they're small enough, fresh and packed with flavor. \nI got their lamb curry kati roll. Coming from a family that takes their lamb and kebabs seriously, their lamb curry definitely exceeded expectations and made the authentic mark. \nTheir mango lassi isn't overly sweetened like in most indian restaurants. Extra points for the generous use of cardamom. It's a clean, cozy establishment, the servers behind the counter maintain strict hygienic standards, they promote proper garbage disposal. \nTheir thalis looked very wholesome and close to what we cook and serve back home, and I'm definitely going back for more.", "author": "Pranati R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-02-07", "description": "Tried their three vegetarian wraps -\n1. Paneer tikka masala naan wrap - of all the three wraps we ordered, this one was the best one. Had some flavor in the filling and was well cooked.\n2. Karahi paneer naan wrap- it appeared as if they forgot to put any spices. It was just paneer and capsicum with minimum to no seasoning.\n3. Aloo gobhi naan wrap - this was just boiled potato and cauliflower wrapped in a naan.\n\nNaan was soft and we were served wraps with yogurt dip which was tasty.\n\nOverall little disappointed with the taste of food and probably won't order again.", "author": "Neha J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-12-11", "description": "Much better than the food truck downtown\n\nHad a plate with chicken tikka masala and lamb curry\n\nQuite good actually. Not cuisine but for a place that specializes in street food they did pretty good overall. \n\n86 the naan though.  It had been steamed to death and came out like a tough tortilla. Nasty. \n\nRoughly 12 bucks for lamb, chicken, lentils, aromatic rice, raita, and that nasty naan. \n\nI'd go again for sure \n\nStaff is very nice.", "author": "Larry C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-09-02", "description": "I used to eat here very frequently; it had really great food for a fair price. Recently however, they increased the price of the Thaili plate to make it nearly $15 after tax. Unfortunately this is way too expensive for what they serve, and I will likely not be eating here any longer.", "author": "David G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-01", "description": "Came here to grab lunch before a movie and loved it! I split the super kati with my fiancé and we got it with the chicken tikka masala. We also got the kachumbar salad and chai tea. Everything was delicious and the service was great. Love the decorations and atmosphere of the restaurant as well. Definitely plan to return next time I'm in the area.", "author": "Katy A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-06-26", "description": "Blatantly low-quality food at a $12 price point....\n\nIn response to owner asking for a bit of clarification:\nThe chicken tasted like low-quality meat (not gross or anything, just clearly not great quality). Additionally, the daal was pretty bland. The saag paneer was pretty good actually, I found the sauce it was in to be underwhelming as well though. \n\nFor the price I paid I feel one can get much better food in the city.", "author": "Yoav H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-05-11", "description": "I live near by and so dropped by for a Lamb Kati to go and was happy with the taste but disappointed with the way the Kati was shapeless, unlike other places I've tried before that were neatly wrapped and compact. It's also hard to justify the price of what Kasa recommends for a meal - 2 Katis for $16 - when you can get much better Indian food or otherwise for that price.", "author": "Shelley C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-14", "description": "This place is so friendly all the employees have Smiles on their face and they seem like they're happy to come in quick fast and efficient the food is excellent I go in for the chicken masala rice and samosas if you ever have a hankering for Indian cuisine stop Kasa and enjoy aesthetic Indian food you will not regret it", "author": "David D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-06-03", "description": "Healthy Indian - finally. Their food is not soaked in cheap oil like so many other places.  I love how they have at least two vegan options for their big dish.  V egans unfortunately can't enjoy their \"burrito.\"  Please let us vegans enjoy your bread and stop using milk products.  They do that back in the old country too! \n\nWhy three stars?  Too expensive.  Come on guys.  I'll still come back because of the vegan options.  Would come back more if you guys had more vegan options.  I would even pay your premium for some rice and spoonfuls of veggie stew.", "author": "Khash C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-09-05", "description": "Wow, the daal is too salty to eat! Left it half-finished. No flavor, just a hint of curry and SALT. I haven't tried their other dishes-- dropped in for a light snack, but doesn't seem to have very authentic flavor.", "author": "Amy R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-05-17", "description": "If I could I would give this place no stars. Unless of course you want a METAL NAIL in your food. Apparently the manager, Kenneth, didn't think this was that big of deal.\n\nI just moved to San Francisco from Boston a few days ago and literally set up this Yelp account so I could leave this review for Kasa since it was such a horrible experience. I visited the Kasa location on Polk Street and got a thali to go. It didn't look that great to begin with but I thought I'd give it a chance. When my boyfriend and I got home, I started eating and within 2 bites I noticed something metal poking out at me from my rice. It was a metal nail. I immediately called Kasa and accidentally called the Castro location but at least Jerome (the manager there) gave two shits about what happened. I returned to Polk Street and when I told Kenneth (the incompetent manager there) what happened, all he was able to say was 'That's crazy'. No apologies. He literally didn't seem to think this was absolutely disgusting. He wasn't even able to give me a refund on my credit card, he claimed 'the machine won't let me do a zero refund'. He then proceeded to take a phone call while me and my boyfriend were standing in front of him as he was writing down his manager's information for me. I have emailed Wendy and I am waiting for a response and a refund. \n\nSave your money, and your teeth-- DO NOT EAT HERE.", "author": "Preeti R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-11-17", "description": "It would be 5 stars if they fixed a MAJOR obvious flaw in their serving system! Great food! I hate cold or lukewarm food. They use traditional stainless steel plates. These are not warmed up in advance in a heated box so the heated food is quickly made luke warm to cold at end by a cold metal plate! I am sure this is never a problem in India/Pakistan with warm air temps but ruins my meal and keeps Kasa less full no doubt.", "author": "Leifur M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-02", "description": "The food was pretty good but the bread (naan/rôti) left something to be desired. I enjoyed the way it was served though. The bathroom door also didn't have a lock on it so that was a bit concerning.", "author": "Brit L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-22", "description": "I got a thali plate delivered and it was very tasty. Not overly \"heavy\" or oily like a lot of Indian places out there these days. Fresh, light, nicely spiced. I needed to add salt to most of the dishes, but no big deal. Daal was good, roti outstanding. Very happy with my meal. I will def be back.", "author": "Maya S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-30", "description": "My favorite go to Indian food spot! The people who work here are always super nice, and the food tastes fantastic. They have an amazing lunch special if you can get in early.", "author": "Rachael P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-16", "description": "Kasa Indian Eatery is excellent! I ordered a kati roll with chicken tikka and it was delicious! It was a bit spicy for me, but still very tasty. I also had a samosa which was pretty good, too. I look forward to returning to try more of their dishes!", "author": "Kevin Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-25", "description": "I've been a fan of Kasa for a few years now back in the day I lived near Dolores Park and the Castro location was perfectly located for me... I moved a couple of years ago to Pacific Heights and it seemed like a hassle to head down there for a Kathi roll.\nThe minute I heard about their new location on Polk I was way stoked! I went in on opening day and was one of the lucky 200 to get a free meal and got to meet one of the owners.\nThe staff is great, the food is always fresh and I will certainly be visiting Kasa often.\nMake sure to ask for their spicy sauce to go with your meal its pretty amazing!", "author": "Albert Paris W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-02-16", "description": "Great idea -- thalis and katis filled with your choice of fresh ingredients.  Well laid out.  Pleasant, neat, and interesting decor.  Fast and friendly service.  I very much wanted to like this place a lot.  But, ultimately, the food, though fine and fresh, lacked that certain something to make this a regular dining kind of spot.  \n\nStill, if you're in the area (even if sober, but especially if you've been to the area's bars), it's certainly worth a visit and a try.  Especially since they're open relatively late.  They have a variety of seating options to accommodate groups from solo diners to larger groups. \n\nThe prices are not a bargain, but presumably you're paying for fresher ingredients and better service, so, overall, they seem reasonable.", "author": "Edward M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-30", "description": "Best indian food in this locality.. Authentic Indian taste.. With proper wheat chapati. \nBetter option than all the nearby Indian restaurants", "author": "Niraj G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-22", "description": "Today I finally figured out Kasa & it was magic. Thali is served here--a large , almost cafeteria style platter with rice, green chutney, raita cucumber dipping sauce, diced vegetables, daal, roti bread & 2 entree choices. Today I hit on the winning combo of Chicken Tikka Masala & Saag Paneer. In my opinion, there's too much paneer (cheese) & not enough saag ( spinach), but it was good anyway. The chicken was very tasty. I wanted fruit chutney which they don't have, but they gave me some nice tamarind sauce. Nice people. Although I wish this place was more comfortable & had some atmosphere -like lose the industrial metal chairs & the whole cafeteria vibe. Maybe open a 2nd location with rugs, pillows & romance. In any case the food is enough reason to be back. It's good.", "author": "Scott F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-21", "description": "Decided to go exploring tonight instead of going to the steakhouse with everybody else. And I'm glad I did. Ran across this place Kasa Indian eatery. The food was excellent and the prices were unbelievably affordable. First I had a vegetable salad which was fresh and flavorful. It had peppers, cucumbers, carrots and the most wonderful unique mixture of spices. Then I had a sampling of the lamb curry which was superb. Then some chicken tikka masala with a mint mixture and raita sauce made into a Kati roll. Don't miss out on that treat. Yum!\n\nThe people that worked there were friendly as could be, and were as excited explaining what the foods were as I was to start trying them.\n\nDelicious, unique and affordable! A must try.", "author": "Frank S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-06-18", "description": "We ordered different rolls. They were super small like 2.5 inch and veggie roll was terrible.", "author": "Shivendra S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-12-23", "description": "The worst chicken tikka masala I've ever had in my life. It's not supposed to have gobs of oil pooling at the top. And you would think something that greasy would be redeeming, at least, for those seeking comfort food, but sadly, this was just plain bad. \n\nThe gobi aloo was good, but the sag paneer was overly salty. \n\nBut really, an Indian restaurant that screws up CTM this badly is just not worth another chance. What good is cheap food if it's bad?", "author": "Deepa S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-15", "description": "Thali plate is delicious and the portion is perfect. Fragrant with the right amount of seasoning. Nice interiors, great affordability. I would definitely come back!", "author": "Lena P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-06-05", "description": "The food here is mediocre and lacks the zing. We ordered thalis: chicken and vegetarian along with the kathi roll. The curries lacked the flavor and the spice which the Indian food usually has. Probably good for one time, now that we know.", "author": "Neil S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-09-11", "description": "Kathi rolls made by amateurs who have probably rarely eaten one. I told the chap he's stuffing too much Channa in it, and he put a bare drop of chutney. Wise words from a formidable experienced roll consumer were conveniently ignored; and as as predicted - I ended up with a messy unappetizing situation in the end. Good content, but execution can be improved.", "author": "Abhimanyu Y."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-04-28", "description": "Meh. It's ok. They dont have a lot of varieties in my opinion.  I do like I am able to see them cook the food but it was meh tasting curry. Won't be coming back here again. I wasn't impressed =/", "author": "Ruhjeenuh Z."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-01-13", "description": "This happened again, I thought after the owner personally and publicly apologizing for this issue it wouldn't happen again, but no. Trying Kasa for a 2nd time, placed an oder over an hour ago when in fact the estimated delivery time was 25-40mins and again same problem: They're waiting for the delivery driver to arrive. Why accept deliveries when you cannot deliver?", "author": "Soheil Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-06-25", "description": "I love the selection they had. The food was very tasty! I do wish they had more types of naan. Speaking of naan, I ordered two dinner platters and received only one serving of naan...\nOther than that, very good.\nThe space is very clean and smells so good! The food was great as well!", "author": "lashawnte b."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-09", "description": "One kati roll is good for snacking, two kati rolls is a good sized meal, and the thali plate (combo) is a meal plus a little extra. :)\n\nI recommend either one kati roll for a snack or the whole thali plate. Chicken tikka masala, lamb curry, and gobi aloo are decent. The mango lassi was definitely the best part. \n\nOverall, not bad, but I think the Kasa food trunks may be better than the eatery.", "author": "Grace T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-30", "description": "Considering this is fast food this place is insanely good.\n\nYadda.yada yadda tadda tadda ya. Yelp sucks. Seriously, more often than not, less is more. Stop trying to control us in your passive ways.", "author": "H K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-18", "description": "We tried the Karahi paneer and chicken Tikka kathi rolls . Absolutely loved the karahi paneer but the chicken was average. Also would have loved a touch of lime on my roll to make it Calcutta style :)", "author": "Meera S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-17", "description": "This place is so good. Love the chicken tikka and the cabbage salad. The green hot sauce is also insanely good.", "author": "Claire K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-29", "description": "Pay attention.\n\nGuy in front of me represented the worst of present day San Francisco. Headphones on. Music up. Not paying attention to the trying their best staff.\n\nStaff: \"Would you like a bag?\"\nGuy: \"...\"\nStaff: \"Would you like a bag?\"\nGuy: \"...\"\n\nGuy: \"Can I have a bag?\"\n\nAbout as rude and condescending as you can get. Don't be that guy.\n\nInstead be the guy who orders the Kati roll with chicken meatballs. Touted as spicy but barely so it was the rich tomato sauce that sealed the deal. $5 and outstanding. \n\nTradition of excellence continues: http://www.yelp.com/biz/kasa-indian-eatery-san-francisco?hrid=LxCNVxeNFpoCPXXcciXYvQ\n\nKasa deserves your attention. Aforementioned guy and his brethren do not.", "author": "Jason B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-09-10", "description": "I work right around the corner, so I frequent this place about 3-4 times a week, as do my employees. \n\nI used to love it. I was pretty impressed with the food, service, atmosphere, and price. However, my opinion has changed. \n\nThe food is still reasonable, it's good stuff if you want something reasonably healthy for lunch. However, it always seems like they have new prices, and the service is now awful. I now expect to wait 10 minutes in line. But there will only be 1-2 people ahead of me. There's only one person serving food and ringing up. And there will be employees hanging around the restaurant that don't bother stepping up.. It's incredulous. It's also usual to expect that the person serving the food and arming the cash register won't delegate accordingly. I've regularly seen the person serving to start packing up stuff, or do odd, unnecessary jobs while there's a line. It's pretty astonishing. \n\nI'm honestly disappointed with this place. I used to love it, but they've dropped the ball.", "author": "Bianca D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-04-17", "description": "Two stars coz I got my stomach filled with something. This is not a place to eat Indian food. The food is pre cooked, served almost cold and doesn't taste anything like what the dishes should taste like. Plus, they had run out of 2 out of their 5/6 dishes. Biggest mess up, the guy served me yogurt before I could say no and when I mentioned I was allergic, it was scrapped off with a spoon.", "author": "Nishank K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-29", "description": "Excellent crust. Light and airy and tasty. Very nice servers. Quick service. The cheese pizza is good and we got a pepperoni, mushroom, and broccoli which was really good. We thought we'd have leftovers but alas no. Salads are okay. Caesar was good. The wedge was just meh. Kids loved the onion rings.", "author": "D T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-04-25", "description": "I've been to this place four times. So I gave them enough chances to receive a five star. But no. They deserve a one star. \n\nTheir food is always cold for both the places. On my last visit I had an insect in my aloo gobhi when I went to the castro restaurant. I was too embarrassed to tell them about it because there were so many other customers and I felt that I would be seen as someone creating a scene. I just threw my food and walked out. My chai was late. I had nearly finished my food when it arrived. The staff have no customer service at all and they seem to not know what they're doing. I saw a staff throw the filling at someones kati roll while the customer was standing right there. She was too nice like me to say anything. And kept telling her that she didn't want something in that roll but the staff just kept on throwing it in a rude manner. \n\nThe dhal needs to go. Its too thick and cold. \n\nI assume that the owner works for Google and doesn't care as long as his bank account gets big. I wonder if he ever bothers to go and do a surprise quality and customer service check. \n\nIf you're the owner and reading this review please do so.", "author": "Ronald S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-20", "description": "Food: 5 stars,\nAmbiance/Decor: 2 stars,\nMy Yelp star rating: Based on food only.\n\nSometimes you really want a $50 steak, sometimes a $5 hot dog. If they are both done right, they both deserve a 5 star rating. \n\nKasa is great. Think of it like Chipotle but with Indian cuisine.  \n\nI think I've had Kasa over 20 times and it's time to give it a 5 star review. This review is for the Polk Street location. \n\nThe menu is simple, you order at the counter, watch them make your order, pay, then find a seat with your plate of food. The place is clean and bright with tall ceilings, and wall to wall windows. I find eating there is very comfortable at lunch time. The meal is quick and delicious. \n\nI really recommend ordering the Kati Rolls (burrito style) over the Thali plate. With each bite, you get all the flavors and goodness combined together. The rolls are on the small side so get 2 for a filling meal. The Chicken Tikka Masala Kati Roll is by far my favorite. Ask for the green hot sauce for some very flavorful kick. I'm a HUGE hot sauce fan, and that green hot sauce is one of my all time favorites from anywhere. I always get an extra side of it. \n\nIf Kasa were to add a couple craft beer taps (like at their original location a long time ago), I'd be there 4 times as much.", "author": "Joe P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-05-07", "description": "This place is great if you like tiny baby portions.  Kati roll and super Kati roll are insanely small.  I just spent 14$ and feel like I had 4 bites of food.  Lame.  Last time I'll ever eat here for sure.", "author": "Dan J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-02-10", "description": "Pretty good for a quick Frankie. Chai was terrible. Way way too sweet for us.  Thali was ok at best", "author": "Laxmikanta S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-13", "description": "DRINK / FOOD\n1.) Mango lassi - sooooo yummyyyy.... like a yogurty drink, refreshing \n2.) Tiki masala - food's good nothing to go crazy abouttho\n\n\nSERVICE\nOrder and pickup at counter\n\nATMOSPHERE\nNot bad for a order at counter place\n\n11.24.13", "author": "Angela L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-03", "description": "This place is like the Chipotle of Indian food.  The food is made fresh daily (I work near by, so actually see this happening in the morning).  The staff was super helpful and pleasant.  I ordered both a chicken tiki and a saag paneer kati rolls.  perfect for a lunch at my desk.  The lunch special is two kati rolls for $7.50, which was the perfect amount of food.  the have a good selection of both vegetarian and meat dishes.  Will be back to raid their freezer on the next hot day for their yummy looking popsicles.", "author": "Jennifer L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-26", "description": "Came here for a quick and healthy lunch, so I ordered the Chicken Tikka Salad. It was loaded with veggies and chicken. I hate it when I order an entree salad and they skimp on the meat, and I'm glad to report this wasn't the case here. Fast and friendly service and a delicious and affordable lunch, I couldn't be more pleased.", "author": "Will P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-10-18", "description": "Will not order from this place again. Small portions and substandard chicken pieces in chicken tikka masala. I was nervous to eat. Best thing was the tikka masala sauce and the Raita. If they had used identifiable chicken pieces and served a larger portion for $10 full order, I might consider becoming a loyal customer. Food arrived late and cold but this may have been  the delivery service.", "author": "Olivia M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-09-22", "description": "Your Nob Hill \"oh my god I need to get something for dinner but I am absolutely not facing Whole Foods right now I just can't do it\" solution.  Love their Aloo Jeera and I'm a dedicated carnivore.  \n\nConsidering how fast it is, it's amazingly good.  The problem is you never know quite what you're getting as each person makes the kathi rolls differently, and they do it so quickly (and so messily) that there's not really a lot of time to point out too much chutney, not enough chutney, wait you forgot chutney entirely on that one, whatever.\n\nI'm not kidding when I say messy.  At least twice I've seen them dump food all over the floor as they run around, and if it weren't for the glass sneeze guard you'd have to factor dry-cleaning into the cost of eating there.  But it's fast and good and oh my Lord, that Franklin Whole Foods is no laughing matter at dinner time, let's just have Kasa instead.", "author": "Kevin S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-09", "description": "My first time trying it and I was very happy with what I got. I like it alot. Next time I'll try the burrito, I had ordered a dinner plate. It comes with rice, two sides, beans, salad, hot sauce, pickled red onions, and a tortilla. I ate almost everything. I had the tiki Masala and clicked tikka. You won't regret it! Its fast and they have good customer service.", "author": "Lai S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-29", "description": "Great place to go for a quick bite of Indian food. Their burritos are delicious, although quite a bit pricier than a Mexican burrito. It'll fill you up though! Chicken tikka masala was bomb.", "author": "Nancy O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-20", "description": "The chai here is phenomenal. Really loved eating here - one of my favorite Indian joints in San Francisco. It's very casual - not really a sit down place but the food is well worth it", "author": "Sparsh A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-25", "description": "Excellent kathi rolls - more options in desserts would be great", "author": "Kartheek S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-12-28", "description": "Yeah, well I have been a loyal regular here since it opened. Today I went in and found that they raised the Thali plate to $11.95. With chai, that comes to $16.04 for lunch. Sorry, despite what the Chron says, we aren't all rich now and that just put it past what I would call a good value.\n\nAlso, it is fine to have your pre-opening party with the music @ 150 Db - however when you open the door to customers, try to think if they want to sit there and listen to your music at that volume. A clue is when I have to ask you 5 fucking times to repeat something when I am giving my order.", "author": "George S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-29", "description": "I just discovered this place yesterday and went back today! I love the super Kati. Staff are friendly. Place is clean. Food is good. And prices are reasonable. What more do you need?", "author": "Diana T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-12-30", "description": "Cute decor, but I came here for the first time looking forward to decent food. Everything we ordered was over salted; I couldn't taste anything, but salt. \n\nUsually, I will try a place three times before giving it a thumbs-down.  I won't, for the sake of my palate, taste buds, and stomach be coming back.", "author": "Maricel S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-11-18", "description": "This is a great concept- cheap easy quick Indian food on metal plates with recyclable everything else.  \nThe execution of the concept is lacking.  \n- bread seems hard and dry\n- Kati roll not as juicy or hot (dry, lacking in ingredients and hard)\n- mixed plate rather flavorles\n- limited options \n- lamb was gamey and had disintegrated into the sauce\n- lassi was too thing\n- ice cream had freezer burn\n\nIf this place wants to stay in business they should increase the quality of their ingredients and put more care into their preparation.  \n\nThe atmosphere is cool and idea is great so I would hate to see them flounder.", "author": "M S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-10-01", "description": "Much too expensive for their portions. It took me a while to realize that THAT was my meal. I thought they had rolled an empty roti and wrapped it in foil:( taste wise..I have had better honestly. Chai was pretty good tho!  But I've never gone back. Walk across the street to Darbar, you won't regret it!", "author": "Stephanie C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-06", "description": "Great place to go for a healthy meal with an international flair - not authentic Indian food. I order the chicken tikka with the cauliflower. LOVE the spicy green sauce that comes with the meals, but it is not for the faint of heart. Ambiance is very casual. I'll be back.", "author": "Emily A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-02", "description": "I love indian food!  We were headed to another indian place that was recommended but couldn't find it, so we stumbled upon this place.  Fantastic food!!! Seriously this would be a great chain across several areas!  It's like Indian Chipotle.  We had the chicken tikka masala and the lamb.. Wow!  Really great flavor and texture like being at a 5-star indian restaurant.  If it weren't for the fact that our beer glasses were dirty, I'd have given 5 stars.. One beer glass looked clean but had a dead fly in it, and the other was literally filthy and sticky.. I was shocked they handed these to us as clean.  Get a bottled drink.. The food is fantastic!", "author": "Candace T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-30", "description": "I LOVE this place. Fast and delicious. I have a cilantro allergy and they are always so nice and patient in going over ingredients with me. Favorite neighborhood spot.", "author": "Frankie R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-08-17", "description": "Gawd... Sorry excuse for Indian Food. \n\nLamb curry - yep Oily and Watery\nBasamati Rice - Dry and hardened\nRoti -- cold and stale\nSamosa - Dry and the crust too thick\n\nYelp Stars simply states \"Meh. I've experienced better.\"", "author": "Madhusudhan R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-17", "description": "Oh hey, there's a Kasa close to my casa...\n\nKasa Eatery is yet another food truck gone wild with a large storefront to serve up its quick and bite-sized food. And I for one welcome their entry into the category of \"real places to eat\". \n\nFor those unfamiliar with Kasa, it's a (yet another) Chipotle-style restaurant where you choose a base (Kati Roll or Thali) and the stuffing (Chicken Tikka, Lamb, Aloo, etc...) and you're on your way before you can say \"omg that's an Indian taco!\"\n\nI usually go for 2 or 3 Kati rolls, depending on how hungry I am. \nJk, I always get 3 because I love those little things :)\n\nThe kati rolls are jam-packed with flavor: the roll itself is flaky and buttery, the stuffing is simmered in spices (usually curry or masala-based) and they add that delicious spicy mint sawwce that makes your taste buds do a little dancy-dance with every bite.\n\nBeware though, some people may find this meal too oily and messy. To me, that's part of the experience, but it sure won't agree with the super health-conscious.\n\nDefinitely check out this place for a quick bite and make sure to bring some extra napkins and hand-sanitizer, because shit's about to get down...\n\n-----\n\nDistinguishing factor: Buttery Indian goodness with the portability of a taco and the unreal flavors of Indian spices.", "author": "Nick A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-21", "description": "I've seen the food trucks and finally got a chance to check them out.  I wasn't too hungry so I opted for the Kati roll with Chicken Tikka. It's basically an Indian burrito made with Roti, stuffed with your choice of meat or veggie that also includes onions and other tasty Indian sauces. The side of yogurt was a perfect compliment the spice-filled Kati. \n\nGiving them 4 stars because though the chicken was yummy in all the spices, the white meat was a tad dry. I also had a sample of lamb curry that included gobs of fat only.  They're located right around the corner from my yoga studio so I will definitely be back.", "author": "Yvonne N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-13", "description": "Congrats Kasa, you are my first mobile review!\n\nThis place is awesome, lots of great flavor, cheerful, bright staff - lots of smiles and greetings.  The food tastes great and is very fresh.  I love sthe tyle of plates also, and decor.  Everything here is simple, fresh,  thoughtful and yummers!  Good job Kasa, you have charmed a new diner, and I can't wait to come back!  Good food, good experience.", "author": "Brandon E."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-07-06", "description": "Kasa: Indian Eatery. That about sums it up: it's Indian, it's an eatery. it's food. Do I have an issue paying $10.95 for a massive thali plate? Nope. I think that's a perfectly reasonable & fair price. Do I have an issue with bland Indian scraped from containers a la the mall food court? Yup. \n\nUnfortunately, I ventured to Kasa when it first opened and its reviews were stellar. I arrived and was surprised to see the set-up, but figured Yelp wouldn't lead me astray. Should have trusted my gut instinct(s). I ordered the vegetarian special (saag paneer) thali: saag paneer, some additional paneer + peppers, basmarti rice, chutneys, hot sauce, and a roti: sounds decent, yeah? \n\nThe (very nice) girl proceeded to scrape the bottom of the basmarti rice bin, add some watery, oily daal, plop some additional items from 3/4 empty bins, and top the plate with a dismal lookin' roti. I grabbed a mango lassi, thinking something could salvage the meal -- but even this was thin and crazy spiced with a hodge podge mix of chunky cinnamon. \n\nI *know* it's hard to find good Indian in this hood -- but trust me, this isn't your savior.", "author": "Lacey B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-17", "description": "The Chicken Tikka / Karahi Paneer Kathi Rolls are outstanding - especially for takeout.", "author": "Venkatesh I."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-25", "description": "Kasa has great chicken tikka masala. It is so full of spices that are layered and complex. I ordered it a la carte and had it with rice. It was great!\n\nI ate in at the restaurant and had a pleasant time. Seating is somewhat limited, but many people order carry-out so there didn't seem to be a problem for anyone. \n\nWhat could be a negative, but what I enjoyed, was a tv playing a movie that was strangely intriguing and often in Spanish. Not sure what it was, but it made for great conversation trying to piece it together with my husband.\n\nI'll be back to try something new!", "author": "Meadow P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-31", "description": "Solid home cooked style Indian food, home cooked as in what food at an actual Indian persons home would taste like, trust me i eat at a lot of Indian peoples homes.  Not like most indo-pak restaurants that make Americanized Indo-pak food (shalimar, pakwan, naan 'n'curry etc), Americanized indo-pak can still be tasty, but there's nothing like home cookin'.   Nicely decorated place with lots of windows for people watching, in this neighborhood that's a mixed blessing.   Friendly staff.\n\n\n\nRestaurant", "author": "Sunny J."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-06-29", "description": "Frankly quite disappointing.. Not sure why there are so many positive reviews here. I am a fan of the Kasa in Castro, so maybe I came in with very high expectations. The place definitely has great ambience, located very well etc.. but the food quality was mediocre at best. I ordered a thali as I usually do at the other Kasa.\n\nThe * saag paneer was decent (nothing too great),\n        * lamb curry was too salty\n        * Roti seemed a bit cold, uncooked around some areas\n        * Dal was good\n        * salad so .. so\n        * rest of chutneys were good\n\nMango lassi was quite bitter (maybe too much cinnamon), which I did get exchanged \n\nSo overall I would say salty food which didn't have any strong flavors. Hope this was just an off day.", "author": "Anand V."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-09-07", "description": "Ordered a thali and the food was not that good. It didn't feel like authentic Indian food. I just didn't like the taste.", "author": "Kapil D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-06-30", "description": "Dear Kasa,\n\nPlease remove the gorgeous man from behind the counter. He has the potential to severely skew my review. Blame my brown fever. Whatever it is.\n\nAs for my Thali Plate, opting for the lamb curry (to avoid the token white person chicken tikka variety - I'll be back for you) and keema mutter, along with all the fixins. Flavors were all delicious, but all was lost as the lamb went from hot to not and the sauce congealed into a fatty mess. It was the most unappealing thing to look at on a plate and my arteries told me no, as if my eyes already didn't. I just couldn't eat anymore of it, albeit tasty. Other than that, delicious, great looking plate for a good price.\n\nGreat for solo dining or with friends at the big communal table. Solid, homestyle Indian grub at an accessible price point and atmosphere, eye candy or not.\n\nRequest to Kasa: add some hooks under the high tables and bars so people have a place to put their backpacks or bags instead of holding them while they eat.\n\nAs for the guy behind the counter...", "author": "Alissa A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-08-28", "description": "Ordered lam curry kati roll and samosa, love the green sauce that came with the order, but I think the meat is a bit dry. Will try the chicken tikka masala next time.", "author": "Kylie K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-02-26", "description": "Watch out if you don't like their \"food\" or they will start sending you nasty notes through yelp. However, they don't have the guts to post their response in public. This place is a joke, and now, the owner appears to be a joke too. Keep up the great work.", "author": "Andy T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-24", "description": "Alright, I would come here again, it's a nice restaurant with good food and a nice staff.", "author": "Jan S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-01-10", "description": "I haven't really eaten Indian Food, BUT It was good.\n\nRice was lovely\nLamb soft and savory\nChicken also soft and spicy\nthe Cucumber salad and yogurt sauce was delish!\n\nThe problem I had was Friday Jan. 3 14 price was $11 and change\nand I got the exact same thing Friday Jan.10.14 and it was $17 and change....\n\nWTF is that....scketchy to me...", "author": "Franziska G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-07", "description": "There are few times in life when the meal is so prefecture crafted that it literally blows you socks off. Ha! KASA ROCKS!   try it!", "author": "Heinz G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-30", "description": "Samosas. I feel like for the price, it wasn't such a great deal. It's nice that this place is close to the bar zone though. It definitely hit the spot after a night of imbibing.", "author": "Ruobin W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-24", "description": "I love this place for a reasonably priced Thali!  Great spices - really good.  I lived in India and am very picky - I hit this place regularly!  Only complaint is that the music is too loud.  Other than that, YUM! And friendly staff!:)", "author": "Kbai F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-24", "description": "Their Castro location was pretty epic, but it was all the way over in far-off Castro.. so I barely got to devour their delicious kathi rolls :'(\nBut hungry no more!! Kasa has now opened a branch just a couple of blocks away from my apartment :D\nTheir storefront/ambience/decor are pretty awesome.. and the food is as good as ever!\nLike Chipotle, a lot of Kasa's appeal comes from the fact that they make the Kathi roll right in front of you.. watching them take a freshly made roti and stuff it with a yummy subzi and lots of onions and chutneys should make a compelling case for you to forget doing takeaway and gobble up it up then and there!\nBeware their spicey green chutney.. its pretty darn spicey... If the line isn't that crazy, maybe try one that is just \"mild\" and use that to figure out how spicey you want the remaining 19!!!\nThe Aloo Jeera subzi can get a little too dry, so maybe ask for extra yogurt if you are getting that one. I have had trouble with excessively watery subzis within the kathi roll in the past (from their castro location), so don't throw away the wrapping foil before you start eating!\nThey have some awesome Indian soft drinks in their freezer including Maaza which is a yummy mango drink I can never get enough of!\nA great addition to this neighborhood, hope they are here to stay.\nI hope they soon become neighbors to Vik's Chaat Corner's inaugural SF branch!! :D", "author": "Aditya M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-03-21", "description": "Pay way to much for so little. The naan is a wheat tortilla...or so it looks and tastes. Like the previous review the dahl is mre like lentel soup. Portio s are oh so small...comeon guys!", "author": "fred h."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-10-20", "description": "It does what it says on the tin;))) Clean, spacious Indian street food place. We wanted a light lunch before a long flight home - my 12-yo son had a chicken Kati roll, I had a vegan one. Size-wise it was exactly what we wanted. 2 rolls + chai =$15, in London you would pay about £7-9 in a Kati roll place. I suppose considering prices here $15 was ok;)) I know Indian food well, and this was more than adequate for a street food place. Recommended to eaters on a budget!", "author": "Tatiana K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-07-05", "description": "We are out-of-towners missing authentic Indian food & spices in our city. We just now had Vegetarian Kati Rolls & they were very yummy. Spice levels were perfect & the mint chutney gave an awesome kick/punch to the  taste.  \n\nBut only 3 stars because we also ordered KIDS ROLL for our 1.5yr old. It was really really TERRIBLE. Plz that's NOT \"Indian\" & it can never go on an \"Indian\" food menu. We never ever mix yoghurt + semi-Cooked egg + rice in a roti or a burrito. Yucky taste seriously!", "author": "Shilpa R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-10-08", "description": "Worst food ever .... who ever gave good reviews must be their own people ...I never visit here again...it is waste of money and time", "author": "Abc A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-03-16", "description": "My husband and I got suckered in by the \"best chai in SF\" sign. The chai was sugar with a side of luke warm milk and a splash of chai. Not to mention it was probably made yesterday. I ran to the restroom and when I went to flush the water splashed back all over me. Gross! On the upside the service was great.", "author": "H K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-27", "description": "Good -- if you are familiar with their food truck -- the kati rolls should be familiar. Had the Thali, which is a good deal since you get lots of variety.  The chicken tikka was \"so so\" since it's pre-made, but saag paneer, keema muttar, gobi aloo was good.  And it's a good value. Interesting drinks.", "author": "Dan C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-15", "description": "Just ordered a Kati roll with Chicken tikka masala from Caviar (this was a special today) and it was the perfect lunch! Delivered seamlessly to my office it was the perfect size for lunch and full of flavor and super fresh ingredients. They gave me extra raita (YAY) and hot sauce upon request. Loved this and will definitely be ordering again or going in to satisfy my tikka craving. Thanks Kasa and Caviar for an easy and delicious lunch!", "author": "Sarah A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-22", "description": "The chicken tikka tako(my personal name for the Indian cousin of the taco) is probably the best \"after-drinks\" snack. \nI specially love the cream-yogurt side that comes with each \"taco\"", "author": "Leonardo L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-01-19", "description": "I hate writing bad reviews but this was a really disappointing meal. I ordered their chicken tikka masala thali on Caviar. The CTM was WAY too salty, brown (not orange-colored) and tasted more like a Latin American dish than an Indian one (citrusy and lacking the familiar curry flavors we're used to with CTM). I probably would have forgiven the brownish color and Latin flavors if they didn't clearly douse the dish with what must have been an entire cylinder of Morton's salt. Truly inedible. I agree with Deepa: how could they screw up CTM??", "author": "Kimberly L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-01-22", "description": "This review is for the kati rolls that we had delivered - kadai paneer and chicken tikka. The two stars are basically for the excellent rotis used for the kati rolls. And my husband liked the green sauce and the yoghurt. Other than that it was not good. \n\nFor starters, there was almost as much rice in the kati rolls as anything else. No no no. Absolutely no rice in kati rolls. Anyone who tells you otherwise has no idea what they are talking about. A gracious point of view would be to think that they were buying into the whole burrito style of things. Though I am more inclined to believe that they are trying to make the rolls bigger without having to use more of the expensive ingredients (eg: chicken, paneer). Not done.\n\nAnd please don't deliver if you can't at least attempt to deliver food that is supposed to be hot, at the very least lukewarm. How do expect the food to stay hot if it's transported by bike across town in a brown paper bag? Least you can expect with a $7 delivery charge.\n\nGo to Curry Up Now for a much more authentic kati roll.", "author": "Sanjukta R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-03-27", "description": "A good place to grab something quick that isn't your average boring American fair.  I admit I am no expert on Indian food, and I will say it is a bit different from other Indian food I enjoy - but still very good just the same.    The vegie salad is a must try.", "author": "Greg B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-08-08", "description": "When Kasa opened in the Castro, it was our favorite Indian food! They used to make the roti from scratch and everything was fresh. Even the Kasa trucks used to have the home-made roti! Yesterday evening my husband & I went to the Polk St location and I ordered the chicken tikka masala kati roll and he ordered the lamb kati roll; we also had the samosa and the chai. The roti was not the hand-made type that I had had at the Castro location some time back; it was a warmed, pre-packaged tortilla. When I asked the person working behind the counter about the \"roti,\" he said that as long as he had been there they had been using the pre-packaged version.\n\nThe worst part is that my husband threw-up last night after having hours of bad indigestion from the food. I didn't feel great, but didn't throw-up. I guess any place can have a problem a single time, so hopefully this was just one of those unusual things.\n\nI am so disappointed to not have the home-made roti (and it still says home-made on the Kasa website). I am also disappointed that I couldn't find a way to contact the owners from their website. Kasa was a great idea and had great execution - maybe it's hard to expand and keep up the level of quality.", "author": "K S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-06-30", "description": "Indain food but Americanized.My only love goes for the Samosai ( chicken) with chai.Their rolls are great with Dry chicken (tandori) and onions.with lentil soup ... Next to yoga studio and me thinks all yoga come here to do their belly yoga :-)", "author": "Dannialson N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-07-01", "description": "Pros: some amazing food here (I would highly recommend the Karahi Paneer), service is super nice, and the price is great for the volume of food you get.\n\nCons: some of the food is meh (companion didn't care much for the chicken masala or the chicken tikka masala), there's a lot of food on your plate that seems to be there just to fill it up, and what I dislike ultimately, what you see on the menu is what you get. It's essentially a buffet of foods and there's not much they can do in regards to customizing things you want.\n\nThat being said, it's not often I would wander out alone to brave the dreaded Polk Street just for food, but I would *happily* do that for the Karahi paneer. That dish is AMAZEBALLS.\n\nIn summary, decent food, not my favourite for Indian, but I'd happily go there again.", "author": "Cassandra J."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-06-20", "description": "Unfortunately, the food here was not great. It was cheap which is nice, but there are far better Indian food restaurants in SF. I'd rather pay more to enjoy my Chicken Tikka Masala, Kasa's just did not taste good.", "author": "Kara S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-04-25", "description": "I remember when Kasa started on Fillmore St. (where Tacko now resides). It was OK back then. I dropped by the Polk St. branch earlier today and I'm sorry to say that it was abysmal. \n\nThe food? Simplistic, bland, questionable freshness, uneven temperature, poor cuts of rubbery meat, dry rice and rotis, etc. \n\nThe setting? That part of Polk St. is no flower garden but the cleanliness and overall set up of the restaurant is noticeably bad. \n\nThe service? Inoffensive. The guys seemed distant but they did what they had to do. \n\nClearly there is no joy in the food, service, and ambience. It's basically for starving students to get something in their belly that has a kick to it. \n\nAll is not lost though. I tried Curry Up Now for the first time last week and it blows Kasa away by a country mile.", "author": "1 D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-11-21", "description": "Bad food, high price structure, the McDonalds of Indian street food. AVOID. I have tried this place, both Polk and Castro locations, a couple of times for lunch. How could anyone take one of the worlds greatest cuisines and dumb it down this bad. Tastes like souless factory food. Frozen?\nEither $7 for a small wrap or $12 for a combo plate. Extra $1 for this, $1 for that type of upselling. The place is more about the money formula than the food. You leave feeling like you were pick pocketed.\nAs for service it all happens at the counter with the food slooped on to divided metal plates. Like dinning in San Quinter. Look elsewhere for your Indian fix.", "author": "David I."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-04", "description": "Just a very comfortable place. The food is casual but tasty. It's a real convenient location at the intersection. It's decor is bright and cheery, with the littany of silver Indian tiffins being a nice cultural and artistic touch. It seemed to be a very clean place, so it's not completely a hole in the wall, lol. And to top it off, the owner (I forgot her name) was very warm and friendly. Again, the word comfortable keeps coming to mind.", "author": "Parvez F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-02", "description": "I ordered a chicken tikka masala kati roll and a samosa. Soooo flavorful and delicious! The samosa was pretty big, i loved the chutney sauce, and the size of the kati roll was perfect. I really appreciated the friendly service I received from the gentleman behind the register as well!", "author": "Cat M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-05-05", "description": "Just had lunch here with my brother, it was OK, but a real daal is made with yellow lentils not black beans.  The food was decent, quick and cheap, but the chai tea was too sweat.", "author": "pochini m."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-22", "description": "Tasty kati rolls! Very nice ambience. Chai served with Parle G biscuits brought about a real wave of nostalgia. The poppadum with chutneys is not to be missed.", "author": "Balakrishnan S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-01-12", "description": "The food tasted fine. The server was very patient and explaned everything well. The soda they serve doesn't have corn syrup. I got pretty significant bleeding in my stool the next day which was the second time in my 35+ years of existence. The food didn't look fresh and based on the consequences, I will not return here again. I would suggest a hygiene and freshness check in all their food and appliances.", "author": "Emmanuella A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-06", "description": "This place was fast and flavorful. We were deliberating whether we wanted a Kati role(an Indian burrito) or a Thali plate(deconstructed burrito with rice). They let us try every item we wanted before deciding on our items. The portions aren't huge so we ordered a couple rolls and plates. Pretty cheap though. We'll definitely keep it in our list of neighborhood joints!", "author": "NJ A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-01-18", "description": "Order daal, cucumber salad and two kati rolls\n\nDaal was way too spicy to be edible. \n\nCucumber salad was dry and not enough dressing\n\nOrdered aloo gobi rolls - potatoes were large chunks and undercooked.\n\nnot worth the $15 we paid, I wouldn't recommend coming here.", "author": "Mayur K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-09-13", "description": "I was greeted by a nice warm smile and served charcoal dried rock hard chicken Tikka it was hardly edible and kinda expensive they just throw the food on the plate! The chicken tikka masala was ok the spices were nice not much on the plate though maybe 3 pieces of chicken. Had to rush to the bathroom not long after eating there hope I don't get sick! Won't be going back there again that's for sure! The two stars is for the smile and the spices!", "author": "Pedro D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-14", "description": "I've been here about 3 times now for lunch in my neighborhood and really enjoyed it each time. Still have to try their signature Kati roll, but strongly recommend their Thali combo plate - a good amount of food for the price (I think it's about $10-12) and an opportunity to try 2 entree offerings, along with rice, bread, daal and any of the side salads and sauces. Delish. Fresh and flavorful. I don't eat meat but there are at least 2-3 veggie entrees to choose from. Casual dining set-up where you order and get your food at the counter and then grab your own table. Water, napkins, utensils, etc are at a station on the side of the dining room. Restaurant seating is good for solo dining, couples and smaller groups. They do have one longer table down the middle of the dining area, but it's usually shared by said smaller groups and individuals. Haven't been here in the evenings so not sure about the scene. Check it out - better ambiance and quality than Shalimar further down Polk St. (although that place saved my life when I was drunk and starving.) Hopefully Kasa remains the friendlier, classier, quieter alternative.", "author": "Barbara K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-11", "description": "Had the lamb curry and chicken tikka masala Kati rolls. Both were tender and spicy. Pretty good.", "author": "Jian C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-01", "description": "Thali plate has been consistently good and delicious. Recommend the Aloo Jeera, Vegetable of the day or Chicken tikka masala.", "author": "Ssbk B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-03-10", "description": "The Chipotle of Indian food. It's not great, but will do if you need a quick Indian fix. I had the Gobi Aloo, chicken meatballs, and a samosa. Everything was on the average side, kind of like a trader joes frozen Indian dinner in a way. The samosa was pretty good but doesn't have that hand crafted quality that you will get from a real sit-down Indian restaurant. Would I go back? Only if I wanted a quick Indian food fix.", "author": "Denny C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-05-27", "description": "I came for the launch and I chose the Tali. Price was written 11.99 the white lady charged me 15.49 when I asked her why are you charging me more then the price you written there . She said I charged you rice surcharge. Hahaha quite funny. The food was no where ready to eat. Bad test. They charge u a lot and the food is so bad and un healthy.", "author": "Hidayat U."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-11-14", "description": "UH just awful. Over priced slop. I mean my goodness I have never tasted such a bland plate of food, waste of my time, sorry but DO NOT EAT HERE the service is just ok, the food is awful, I will give the airiness of this location one star, it is quite nice, \nbut go somewhere else if you want a decent tasty meal. Hands down worst Indian-if thats what were calling indian food these days-EVER.", "author": "Ann M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-07-01", "description": "Kasa Indian Eatery represents a new low in dining for me. It's simply the worst Indian food I have ever had in my 52 years on this planet.\n\nBefore I get into the reasons why, I'd like to exhaust whatever praise is due. \nThe concept of Kasa Indian Eatery is not a bad one. Basically, it's Indian fast food served in a corporate setting, in the same way that Starbucks is a corporate coffee place. (Indian/Pakistani restaurants in San Francisco tend to be low rent and funky, and some people would appreciate a slicker presentation. My guess is that those same people would be delighted to get their food almost instantly, instead of at the merely torrid pace most Indian/Pakistani places whip up their food.)\n\nThe creators of Kasa Indian Eatery have done a bang up job on their branding. The Polk street location of Kasa Indian Eatery is bright and airy, with warm tones supplied by wood tables and floors, and some bells hanging from the ceiling. The color scheme and fonts are professional and appealing. The background music is soothing, concept appropriate, and just loud enough to provide a veneer of authentic atmosphere without interfering with conversation. That pretty much exhausts my praise.\n\nUnfortunately, again like Starbucks, all of the creative energy of the owners has gone into either branding or, of paramount importance, the art of extracting the last penny of profit from consumers by providing an appalling product at inflated prices.\n\nLet's start with how ghastly the food is. Kasa Indian Eatery makes their basmati rice in a rice cooker, and they get the results you'd expect. The rice was clumped together and mushy in places and undercooked in others. Supposedly, it was cinnamon scented rice, but there was no cinnamon flavor or scent, or even salt for that matter. The spices in the Saag Paneer tasted raw. The cilantro chutney was harsh and medicinal. I could go on, but all the food my wife and I had was uniformly horrible. My wife remarked that the food tasted institutional, like it was from a hospital or a prison. Just so.\n\nNow, let's talk about value. In all cases, the portions were miniscule (which was a blessing in our case). For ridiculously small amounts of two types of entrée, a teaspoon of chutney, about an eighth cup of rice, and a small ladle of watery dal, the price was $10.95. That's what Kasa Indian Eatery jokingly calls a Thali (plate).\nThe final insult is the $2.50 charge for an eight ounce cup of admittedly good chai. As anyone who has eaten Indian/Pakistani food in San Francisco knows, the standard is to have chai available for free. It's a gesture of hospitality.\nSadly, the owners of Kasa Indian Eatery have no interest in hospitality, making good food, or serving the community. \n\nYou think I'm exaggerating? Trust me, no one who cared the slightest iota about good food could create dishes this inedible. It speaks volumes about the pure contempt the owners of Kasa Indian Eatery have for their customers. Same goes for their portions and pricing.\n\nGenerally speaking, I wish small business owners well, even if they are incompetent. It takes a lot of hard work and moxie to run a small business, and I appreciate that. \n\nHowever, in the case of Kasa Indian Eatery, the owners are so transparently venal and predatory, I wish them a swift and painful bankruptcy so a potentially prime restaurant space might be made available for restaurateurs who wish to serve the community while they are making a living.", "author": "Michael K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-07-15", "description": "The most DISGUSTING and inedible garbage I have ever had the misfortune of putting in my mouth!!! One bite of the so called \"kati roll\" and I threw the whole thing in trash (where it belongs). I had ordered their chicken and lamb kati rolls, which the person behind the counter prepared by slopping some curry in a greasy tortilla and wrapping it up. Kati roll is a very popular snack in India where skewered grilled meat (hence the name kati, which means skewer) is rolled inside a tasty paratha with condiments and sauces, and is somewhat similar to gyros. You DON'T PUT CURRIED SLOP in a kati roll. On top of it, the SLOP they put in the kati roll was just plane LARD and had a disgusting smell. I have had Indian food all over the country but had never tasted anything this vile ever! My partner had ordered the 'Thali\", she also threw the food in garbage after having only two spoon fulls.\n\nWhile Indian restaurants in the USA  tend to be mostly mediocre or bad, , \"Kasa\" takes the cake and is definitely the worst one I have ever been to. San Francisco has its share of very bad Indian restaurants, but \"Kasa\" beats them all. The food was greasy and horrible tasting and I wonder what kind of cheap and unhealthy stuff they put in it..", "author": "Joe M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-07-31", "description": "i was excited that this place was opening up, even though there are plenty of Indian restaurants on Polk st, but i was really disappointed once they did. They were out of all the good food when we came by to order (which is understandable because they're new and probably under staffed) but the food we did order ended up tasting really bad. i've had a lot of Indian food and i'm a big fan, but this food did not taste homemade, they're ingredients don't taste fresh at all. It was bland and just overall didnt taste good. the spice palate was just so dull i didnt even finish my plate. I should stick with Shalimar like my instincts tell me.", "author": "Lena E."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-07-16", "description": "I can see from my first review it's been just under a month since my first visit (and subsequent rave review). Tried it again tonight and to verify my suspicion that it has some work to do I checked reviews here and see I am not alone in thinking this place needs to step it up.\nMy first meal was a great experience. I was happy with it but I will agree with a lot of others on what they are saying about watered down, greasy and fatty substance (at least with the lamb curry). \nTonight I had 2 kati rolls - one chicken tikka masala and one the lamb curry. I'm not sure why but they weren't all that tasty. I decided to try another samosa and was disappointed to see (as I pointed out in my first review even though I gave 5 stars) that the samosas are still kept in a tin foil container and mine was lukewarm at best. So, after leaving I had already decided I may not be back and was extremely thankful Shalimar is still close by. \nI hate to be mean and I don't give negative reviews easily, but when I do it is always with the hope that the feedback will lead to positive changes that benefits everyone - the customer and the owner who sells more food. \nAs I mentioned in my first review, I've had plenty of food from the Kasa food trucks and I was blown away every time. So, I know it can be done. I'm not sure what it is about this location that seems to have something different going on but they should fix it and fix it soon.", "author": "Matt H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-29", "description": "Simple, awesome, and tasty. This place really has great indian food that makes me not feel like I'm dying of an oil overdose. I'm sure it's not the most healthy place on the planet, but it still tastes not as oily and greasy as a few other indian places I have been to. My recommendation - get the combo plate and split it! Bang for your buck...it's ALOT of food for one person. My one star deduction is because of the mango lassi - I've had better - and they are my favorites - so I tend to judge a little harshly.", "author": "Melinda S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-02", "description": "Kasa never fails me -- I love their food. Super super tasty, fresh, and a great value. I was happy to see the new (to me) location open on Pine & Polk, and I stopped there this evening on my way home. So good. Whatever it is you guys are doing, keep it up!", "author": "Bowen D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-02-14", "description": "In San Francisco where there are plenty of great indian restaurants Kasa is struggling to keep up. Sure that they have different concept and neat looking cool interiors compare to most Indian restaurant. However this is not the reason most people go to a  Indian or any other ethnic restaurant, people go for delicious food and thats what Kasa Indian missing.", "author": "Lyra S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-07-07", "description": "Ugh. Don't go here if you're hungry, you hardly get any food. A platter of gravy and sauces... Minimal rice and two very small sides.\nNot to mention, their menu is backwards. When you walk in the menu starts at the cashier \"pick one\" then you move backwards to pick your other gravy/sides. Maybe they should learn something from chipotle...", "author": "Maureen Z."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-10-18", "description": "The thali option is the best, followed by a samosa and chai combo. Food is good, though not my favorite indian food joint in the Bay Area. Always clean and staff is very friendly and courteous. It's a little overpriced for the quality and flavor.", "author": "Zeenia I."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-07-01", "description": "I'm not a fan of room temp. food. Tried the Thali combo plate today and what should be hot wasn't. Barely warm rice, roti, lamb and grilled chicken. Flavors were just okay. Only upside is you get your food fast since it's already cooked resting on steam tables.", "author": "Jane F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-08", "description": "This place is super yummy -- a MUST TRY. If the roti was a bit fresher, I'd up it to 5 stars (hint hint Kasa owners...).", "author": "Matthew J M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-02", "description": "Love the new location.  Nothing beats 2 CTM Kati Rolls.  Mmmm...  And cherry coke on tap.  Heaven.", "author": "Val U."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-24", "description": "Downhome Indian food that you would get at your favorite Aunt's house minus the cheek pinching. What can I say about Kasa that hasn't already been said. Food is great and this is a great new location.", "author": "Chandini D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-24", "description": "Well done Kasa team. Love the decor and the new menu. Food is delicious as always! Score for the Polk/Pine area!!", "author": "sally b."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-15", "description": "I love Indian food.  Kasa not only makes delicious Kati rolls, but their more traditional (by Indian restaurant standards) dishes are ridiculously good.\n\nI've had their black daal a few times.  The minute you take a bite it is incredibly apparent that this is the variety that has been slow cooked, kind of like mom used to make it.  It was a specialty at home, so when you get that kind of quality at a restaurant, especially a fast casual spot like Kasa, it is definitely notable.\n\nYesterday I was in the mood for Kati rolls (Saturday cheat day!).  I had mine made Unda Style, where the equivalent of a one egg omelet is literally fused to a tava heated roti right on the grill.  I ordered both of mine with chicken tikka, all of the fixings (3 or so fresh chutneys, pickled onions, tamarind sauce).  \n\nI wish I could convey how happy I was after my first bite.  Just an unbelievably flavorful experience.  Totally hit the spot.\n\nThere are a ton of Indian options, particularly down near the TL.  Kasa in my opinion provides a better overall experience.  It's quick, it's high quality, and it is significantly lighter.  I could eat Kasa everyday and not worry about clogged arteries...for whatever that's worth!", "author": "Bobby N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-23", "description": "Went to the pre opening last night and Kasa has done it again! Amazing location to compliment the best fresh Indian restaurant in SF. Very clean feel inside and great service by the entire staff. This place is a can't miss if you are looking for a high quality, affordable, quick Indian meal.", "author": "Alex S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-24", "description": "Was there yesterday for the pre-opening.....\n\nPlace was spotless and beautifully decorated.....\n\nFood was fresh and fantastic!\n\nLooking forward to some late night grubbin soon!", "author": "B P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-09", "description": "A unique take on the greasy Indian food I'm used to eating at Naan N Curry.  I don't understand why reviewers are saying it's bland, I experienced a spice overload (in a good way!)  Everything I had was delicious.  The plate is a LOT of food.  If you can finish it you're a champ. Paneer was great, chicken tikka masala was awesome.  Don't go in there with expectations of what Indian food is, they have their own style and I'm into it.", "author": "miranda b."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-23", "description": "Very fun environment with great Indian food to top it off! A great way to start your night if looking for a casual, yummy dinner before head out to on Polk.", "author": "Kelsey H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-05-13", "description": "I'm writing from a vegan perspective.  The Thali plate is available vegan style but my chief concern is that there is rarely a main dish for us.  You can order two add on sides, with the rice and naan bread and a small veggie side.  Usually the side dishes are potatoes of some sort.  So you're basically eating tons of carbs and starch.  The chana masala is the one protein source I have seen, but it is rarely available.  It is my birthday today and chana masala was on the menu and I was looking forward to it, but the server informed me after he was almost done making my plate that it was out.  That was basically the only reason I came in, so imagine my disappointment.  I am pretty sure the samosa he gave me has dairy in it, I can taste it, so I am pretty PO'd.  For $16 I shouldn't have to worry about someone being dishonest to me about my order.  I am not sure if I will come back again although I was a fairly regular customer before.", "author": "Teresa K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-01-24", "description": "Went to Kasa the other night for chicken tikka masala, it was the worst I've ever had, the sauce was greasy and the chicken reminded me of gristle, uneatable.  Not like their restaurant was on Fillmore.  Very disappointed, will never go back and overpriced.", "author": "Steven Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-02", "description": "Have to revise my original review after coming here again.  Tried the thali plate and would have to give that 3 stars compared to the kathi roll which deserve 5 stars.  Maybe it had something to do with it being the end of the day but the food wasn't as fresh this time around (particularly the rotis, daal, aloo gobi).", "author": "Sagar G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-11", "description": "I've eaten here several times. I've tried pretty much every thing on the menu. All items are delicious and for the price you get ample amounts of food. The only 2 things that I have noticed in many of the items (lentil and lamb dishes especially) is that the chefs tend to over salt much of their items. Given that many people are more health conscious these days, I wish that they'd not do that. Also, there is no \"brown rice\" option, but the staff mentioned that it was forthcoming, which is nice to know. Other than that, the staff is very courteous and helpful and the food is very flavourful.", "author": "Timothy L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-21", "description": "Yelp is bordering on useless at this point b/c it seems to attract people who are only able to speak in hyperbole (\"1 star, this is literally the worst thing I've ever put in my mouth!\"). But as a longtime fan of Kasa, I feel compelled to try to balance the scales a bit.\n\nEverything I've ordered from Kasa has been good. It's not the cheapest Indian food money can buy, but an unda style kati roll is worth the extra couple dollars you'd pay for a comparable sized dish at a cheaper place. \n\nAnd for the sake of not contributing to the hyperbole, I'll give it a realistic 4 stars because, as someone else pointed out, the kati rolls are just a bit too small to order just one, and a bit too big to need two. My only complaint for this restaurant.", "author": "j d."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-08-20", "description": "I was looking forward to this place opening near by after living in NYC and enjoying Kati Rolls on a regular basis. While the ones in NYC are more \"taco size\" these ones are quite larger more like a burrito. They aren't the same but pretty decent. I go for the potato one every time. \n\nI usually stop in for lunch for something quick but for a place that pretty much just needs to serve the food...they are slow! Maybe it's just a lunch thing?", "author": "Michelle L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-01", "description": "So delicious. A fantastic alternative to Subway and other quick meals. I got the chicken tikka masala Kati roll with the cilantro and onion. Amazing. $6.25 in total. Also love the yogurt sauce. Mmmm.", "author": "A B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-05-31", "description": "Great food but Mgnt needs a change.  We were the in a group and the lady that said she was the manager and said 'we must 'be quite'. We were the only people in the restaurant btw on a Saturday night!. The manager was nicer after a bit but our experience was ruined already with her attitude.", "author": "Mel R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-04", "description": "Great food. Good price. Some of the best chai in the city. I love their green chutney and I have really liked almost all of the dishes I've tried. Turkey and peas, lamb, cauliflower with potatoes, paneer...yum! My favorite thing about it is that the food is very fresh and not too heavy or oily. Awesome!", "author": "Melanie G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-06-29", "description": "I like the fact this place does not have pictures with terrorist writing on them or pictures that look like a X-Man movie poster with purple people with 12 arms.  The decoration is tasteful and modern. Also they did not cover up those big windows so the light comes in.\nIt is awesome to have a place with Thumbs-up and Limca in a bottle.\nWhile the food did taste like it was made with fresh ingredients, it was bland. Indian food is supposed to have a kick. Also the Roti was hard and cold, it tasted like it was made much earlier in the day. Re-heated roti is OK, but nothing is better then one made fresh and served off the pan.\nI have visited Kasa on Polk a few times, I can safely say the food is way to salty. The lamb curry was way to salty, and tasted more like Philippine adobo  dish then an Indian curry dish.\nFor the cost the portions should be bigger. The portions for the Thali are small and the roti rolls are tiny for 4 bucks. \nI would go back again due to the place being clean and they have \"thumbs-up\", I will make sure to bring my own hot sauce to kick the food up a notch.But  once the place gets dirty, I wont be going back since the food at best is just OK.", "author": "Bob b."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-12-05", "description": "Worst curry I have ever had and over priced for what you get.  Both Nan and Samosa were cold, bland and small in size.  Much better off going to the Pakistani place one block up across California St", "author": "Alex H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-26", "description": "Top-notch food - my office takes-out from there and the lunch table is mobbed when folks hear it's from Kasa", "author": "Steve W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-03", "description": "Wandered in, and glad I did. Staff is patient and friendly. Food is comforting yet at the upper end of my spiciest tolerance. I also realized I was eating my thali (plate) wrong after checking out the next table-- you make a little burrito out of it! Loved the cardamom pods, and the lamb was rich and tasty.", "author": "Sam B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-11-05", "description": "Oh my!  If you enjoy good Indian food, don't go to Kasa.  The food didn't taste anything like Indian food.  The Chicken Tikka Masala a. Was not cooked in a tandoori oven and b. The Masala (a brownish sauce and not orange) tasted bad.  Aloo Gobi was dry and had zero Indian spices.  They didn't have any naan bread.  It was Clean your own table, by pouring the food into a slop bucket at the counter that was full of flies.  I will not be going back to Kasa. To add insult to injury, I am now going to bed with some Pepto-Bismol!  YACK!", "author": "Tracy P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-10", "description": "yummy, quick.. I got some samosas the other day, their sauces are lovely.. the thali is also yummy", "author": "Madrone H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-01-16", "description": "Eh... opening up a South Asian restaurant within steps of Shalimar is a risky move. Indian food is never going to be super-healthy, so if you're going to indulge, might as well go with the best. I wanted to be fair to Kasa, but I just can't see myself going here again if I'm craving some palak paneer. I like the idea of a kati roll, but in reality, it's a huge pain to eat, really messy; one is not enough but two is too much (doesn't make for good leftovers either). Glad I tried it, but I probably won't come back for the food, maybe to try some mango ice cream.", "author": "sar h."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-03", "description": "There's nothing better than spending a (very rare) warm San Francisco weekday evening drinking along Polk st. What made this night even better? Coming across Kasa! We unfortunately showed up a few minutes after close so we couldn't actually try a variety of the food there, but the staff was very kind and even gave us a free end of the day samosa. This place is all right in my book - can't wait to go back and actually try more!", "author": "Lauren M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-07-05", "description": "Seeing that there are lots of good eats in the area, and have heard good things about this establishment, I was excited to try this place on Polk street. I have a favorite place already (Darbar), but of course I have to try other kinds of Indian restaurants, as everywhere is different. I ordered the Thali platter with Chicken Tikka Masala and Karahi Paneer. These were good, a bit salty, but not bad. I think for the value it's a good size portion. I like the space and the gentleman behind the counter was very nice. This is definitely a different style of Indian food. I'm not exactly sure if it's more Southern India, as with the other restaurants I like are more Pakistani/Northern Indian flavors. The flavors are light, the ingredients were fresh, and I didn't get that heavy feeling walking out of there. The mango lassi was actually quite tasty. It has different spices, a little tart, and not as sweet as the other mango lassis I have had. What I think would make this place better is cooking the food to order. I think it can be almost criminal to have food just sit out there waiting for people to eat it. I think the ingredients are too good to just sit, dry out, and not be as hot as it should be. The Roti became a bit tough, because it seems like they just make batches of it, and just keep it in a warmer. As with the food, the roti would be much better if it weren't sitting out. All in all, it wasn't bad. The flavors are light, ingredients are fresh, and the chutneys they serve balance out the main dishes.", "author": "Nadia M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-01", "description": "Awesome fast food Indian place! I did not expect the authentic flavors this place provided. And it's fairly reasonably priced and clean.", "author": "Shruti S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-26", "description": "OK I have been to all the so called good Indian places in SF.  They were all nasty.  But Kasa was delicious!  I had the Aloo Gobi, the paneer and the roti!  Very fresh, flavorful, nice portions, good prices!  I will come back!", "author": "John K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-01-04", "description": "food was good but the staff member was on the phone while he prepped our food which was rude and unsanitary !", "author": "Amy Nicole W."}
