{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-18", "description": "Absolutely amazing!! I went here in a date and the atmosphere was so chill. The service was great and I loved the decor. \n\nIt is sort of a New age Caribbean food restaurant. They place reggae and they really set a sort of classy tone in there. \n\nFood: the portion sizes are huge, delicious and very satisfying. \n\nWe ordered fried plantains and fried plantain chips for our appetizer. \n\nAnd for the meal we had Goat curry. Which was absolutely ahhmazziinnghg! \n\nWe also ordered a drink and they served it in coconuts! So cute! \n\nIt definitely made me feel a little at home since I am from the Islands.", "author": "Sharnan T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-09-30", "description": "Disappointing, maybe this food would be good from a food truck but for a sit down dinner in a restaurant it is amateurishly done.\nThe restaurant is attractive inside but no feeling of the culture of the cuisine. I thought the drinks were good but seemed short on alcohol.\nThe main things I felt was the kitchen had issues with portion control, presentation and lack of distinctive flavors. The appetizers we ordered where huge, they could be mains. The kale and beet salad was very off putting. There was too much kale and not enough beets. There is only two thin slices of a beat. The kale was not crispy and had some kind or old rosemary oil flavor. Very disappointing. Heather appetizer we had was a cod fish in the fish was to dry and over-salted but the coleslaw that it set on was very good. The main course of their signature Piri Piri chicken was a Slab of a half a chicken on my plate with some over cooked greasy potatoes. The flavor of the chicken was very good just the presentation was very poor. The Jerk chicken salad was very good but not very interesting, seemed like the vegetables were not super fresh nor unique.  Service was laid back and boring. \nNot a fan.", "author": "Garden Lover S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-09-24", "description": "I had dinner with some friends the other night and decided to go to Kaya. The service was great, pretty popular place that night, nice design. \nI had chicken as my main course, and it was ok. Was definitely not impressed with it and would not recommend it to friends. \nI had a Gin&Tonic before and it was $14 ! I am aware that San Francisco is expensive, renters are high, etc etc, but this is seriously ridiculous.  I didn't pay 14 bucks for a G&T at the Ritz Carlton. I guess people don't mind paying for it, but for a mediocre restaurant it is outrageous.\nThere are way better restaurants in the city, so after giving it a try I'll skip this one for the future", "author": "Sfo993 B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-07", "description": "Very friendly and good vibes in this establishment.  I enjoyed the window seat on a Sunday for brunch.  I ordered the black pepper tofu and side of sweet potato and russet fries.  The tofu was firmer than I'm use to but the flavor tickled deliciously my taste buds.  The roast on the potatoes and herbs on the fries were so good.", "author": "Rhona G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-21", "description": "Excellent! Good service, food, and ambiance. I had the curried vegetables, my partner had the jerked chicken, and our two friends had the jerked chicken salad. All were good portion sizes, especially the curried vegetables, which I ate the rest of for breakfast the next day. Also, definitely recommend the rum in a coconut, which you guessed it, is rum mixed drink in an actual coconut. You won't be disappointed.", "author": "Tara M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-06-23", "description": "Stopped by Kaya for brunch while I was walking around the city doing Pokémon Go.  Ordered the jerk chicken salad, the spicy ginger beer and the young coconut.  The food was good but not great:\n\n(1).  The portion size on the salad was huge and I really liked the plantains.  \n(2).  The young coconut was served with a straw - I wish they served it Asian style - with a bigger cut and a spoon to scrape the inside coconut meat. \n(3).  The spicy ginger beer was on point.\n\nService was not attentive but the restaurant itself was very nice.  With tax and tip (automatically included), this is about $40.  This place is a meh for me but I'm happy that there's another option along the mid-Market street corridor.", "author": "Andrew S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-10", "description": "Yummy new place in the neighborhood!\n\nDrinks: son of a peach was delicious\n\nFood: goat curry was sooooo yummy. Also had the jerk chicken which was good but not spicy at all\n\nAmbiance & service was spot on.", "author": "Laura D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-13", "description": "Now this was quite a surprise.  It was authentic Jamaican food.  The real deal.  We had the chicken wings, the beef patty, side of plantains, the papaya salad and the curry goat!  The goat was so tender and the curry was just right.  Beef patties have a kick but was good.  I really enjoyed it.  The rum punch was great as well.  This is a new spot been around since January. I will return.  The owner Nigel walks around and greets his customers.  Service was also great.  The have a great happy hour as well.", "author": "Pam P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-06", "description": "Can I just first say that their punch bowl is SO WORTH IT? And tasty.\nDeceivingly, the menu said it serves 4 (for $50). Four liquid-diet only monsters?! When it came out, it covered almost the width of our table. Damn, that bowl was huge.\n\nMoving onto the food. Mmm! \n\n* Oxtail stew ($26) - YES, YES, YES. Everyone please get this! I wish I got a whole plate to myself rather than have it shared (yes, I wanted it all). The meat fell right off the bones, melting in my mouth. The sauce was delicious. I soaked that bad boy up in all the rice that it came with.\n\n* Jerk chicken ($25) - Very good! I think if I hadn't had a bite of heaven from the oxtail, I would've thought the chicken was fantastic. \n\n* String beans ($11) - Pretty good! Standard.\n\n* Plantains ($9) - Mm. Cut into fat pieces, each was juicy and sweet but savory at the same time. \n\nLocated south of Market so not my usual spot to hang out, but for this place, would 100% come back. And to try out their HH and brunch. Vibes and decor A++", "author": "Vickie Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-06", "description": "Ok I love Kaya, you guys. And no, it's not just because I think tiki drink/rum based cocktails are a gift from above. I've been there during a \"30-day no drinking month\" and it was still just as delicious. Why? Well, I could pretty much stop with Salt Fish Fritters and Plantains because they are an utter delight, but also:\n\n-You can get a reservation and, shockingly, even WALK-IN at brunch, the most important meal of the day in San Francisco\n\n- Super friendly staff and a fast-paced kitchen staving off my hanger\n\n-Piri Piri Chicken\n\n-Jerk Chicken Salad for when you need that Jamaican treat, but also want to be a little healthy\n\n-Cinnamon French Toast because forget what I just said about the healthy thing\n\n-The Deep Dub Cocktail (coconut rum, pineapple, hibiscus, almond,  served in a delightful pineapple glass) and the rum-filled coconut that gives the Dolores Park Coconut Rum Guy a run for his money\n\n-They kept the soft serve for dessert from when this place used to be Alta CA AND They have an Irie hour!", "author": "Nikki M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-25", "description": "Wait/Ambiance: \nMy party of 3 had a reservation, but the restaurant was 1/3 full around 6 PM on Wednesday, but was packed by the time we left around 8. Modern ambiance with interesting artwork, a projector on a wall, and loud music. The only thing I didn't really appreciate was having to walk through the middle of the kitchen to get to the bathrooms.\n\nFood: \n- Salt Fish Fritters: too salty for my taste, but interesting to try. They're breaded balls of mostly fish.\n\n- Mango & papaya & plantain salad: delicious vinaigrette dressing and fresh veggies! I just wish there were more veggies to complement the amount of greens.\n\n- Jerk chicken: Yummy and spiceful, but really deceptive portions. It came with 3 small pieces of chicken and a few beans with rice and a few plantains. \n\n- Oxtail stew: Delicious, my favorite dish at the restaurant. Really flavorful stew that melts off the bone.\n\nOverall:\n- Portions weren't huge, but also quite pricey (big plates like the jerk chicken and oxtail stew were $20+ each)\n- Service can be a little slow. Expect to wait a bit.\n- Good and fresh food overall!", "author": "Victoria L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-14", "description": "I have exactly 24 hours at home. This might be the last 24 hours I'd have before end of this month. I read this is a new happening spot. So on that evening, I came here to see my girlfriend who was back here for her mandatory three week break from India and we get to catch up and for her to give me her keys to her flat in SoMa (just in case I don't have enough places to sleep with all the homes I own and hotels I stay at?). \n\nWe sat down to eat - I was a bit out of sorts as I've had a long day after having just returned and worked in the office for a whole day. Kale salad had our names written all over it. Salmon to share and so were the salt fish fritters and jerk chicken. \n\nJerk chicken was amazing. It reminded me of my days in Kingston, Jamaica and then most recently in East Flatbush, Brooklyn, where Caribbean food is seen aplenty.\n\nI think this was a little different than your usual San Francisco food scene. Food reminds me of New York and of course Caribbean, and it felt much more diverse than your usual Alice Water influenced Californian cuisine. And for this evening, a little something different felt just about the thing I needed before I fly.", "author": "Victoria E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-06", "description": "Parking : you're better off taking Muni or biking (or you could park in a garage lot nearby)\n\nAmbience : I loved it. A projector showing Usain Bolt's training and backstory (I did collegiate T&F so I really enjoyed this aspect). Great music and a very energetic atmosphere as people started to roll in after work. (I'd recommend a reservation just Incase!) We came on a Wednesday around 5:30pm and by 6/6:15pm, it got pretty crowded. \n\nDINNER REVIEW: \n\nService : wasn't sure if there was a trainee with our server when we went, but very friendly service. \n\nDrinks : I tried the rum-filled coconut (real fresh coconut) which was delicious and strong. \n\nFood : we shared the sautéed green beans which was really tasty but a little too saucy and salty for us. \n\nThe Jamaican jerk chicken salad was tasty - the chicken was just a little drier than I'm used to for jerk chicken. My friend got the shrimp (listed as an appetizer) and said it was delicious and seasoned well. \n\n--\nBRUNCH REVIEW:\n\nFood: The Kaya Scramble was delicious - I was able to sub jerk chicken for the turkey bacon. The cassava home fries were tasty and seasoned well, but some pieces were soft and others were a little hard. The scramble itself was simple : 2 eggs and vegetables. \n\nMy friend got the jerk chicken sandwich and said it was pretty delicious. Both of our orders were super filling. \n\nService : friendly but it did take awhile to get water refills and our check, even after our waitress said she'd bring it to us. She actually ended up asking us if we wanted more water twice before finally bringing it to us. \n--\n\nOverall : I'd come again!", "author": "Cheri C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-29", "description": "\"Heh mon... I need a hit of Ganja!\" I've been to Jamaica many many times. No way anythin good can come outta some fancy pants stainless steel and fully stocked kitchen, \"wit floor ta ceiling\" of booze in a two story up scale spot. \n\nI'm used to back allies and road side shacks along dirt Roads in that part of the island Chris Rock, in his HBO special refers to as \"tird world, on da wey to those gated resorts where da over priced and over sugared cocktails flow as easy as the breeze.\"\n\nYou know those places If you want to eat real Jamaican. Bright but dingy red green yellow panted shacks. No windows some no doors. There are as many stray dogs as people hanging out wit a red stripe puffing on ganja. Dogs waiting with practiced pathetic doe eyed melancholy hoping for any charitable scraps to come their way. \n\nSo when you enter this place, Jamaica is only hinted at through thumping bass playing a mix of reggae, old school R&B and video of random stuff on a far wall that featured Black Moses in full gold \nchains at a keyboard upon entering. It's modern it's open it's two stories of shelved bottled liquor of various types. On the other huge colorful canvases of a local artist. \n\nThe bar is swanky upscale befitting Wall Street lights, glass, bottles, libations abound. \n\nSo the abrupt juxtaposition of hipster modern and clean was a jolt to my sensibilities. Even Kingston 11  across the bay in Oakland, is funky, colorful and rough cut, more akin to to it heritage. \n\nFortunately the food delivered the proper heat flavor and spice. The jerk chicken I ordered was packed with flavor. Unfortunately, the portion was paltry. It looked deceivingly ample because a small portion of breast a wing and a drumstick were artistically arranged on a bed of brown rice with a few black beans sprinkled in. I assume to claim it was beans and rice... more like bean and rice. And the six slices of plantain (not plantains) also circled the artistic mound of rice. \n\nIt was certainly fancy and elevated cuisine. Fresh ingredients prepared with skill (I know cause we sat near the kitchen). \n\nBut here is the thing... the soul of Jamaican cooking is about filling your belly, your heart and soul while creating the heat needed to help you sweat and keep yourself cool in the tropical heat. \n\nThe translation here was like a well crafted snapshot on high gloss photographic paper frames in lucite of a scene in Jamaica, sanitized and airbrushed for the folks who think Jamaica is like one of those private all inclusive resorts Chris Rock alluded to-in his special. Glossy with added scratch n sniff. Yes it smelled great sitting there by the kitchen and authentic hot sauces?  You bet. I watched with envy as peri peri chicken was being distributed, ample falling off the plate. Damn! I ordered the wrong ting mon!\n\nWhen I ordered a rum to pour into my ginger beer I asked for Bacardi dark rum. After 20 minutes they returned saying they never heard of Bacardi rum. Whhhaaaat? The bat? It was even in their extensive rum menu. Wazzup wit dat? \n\nThe coffee however delivered in a hand crafted French press from Jerod the pottery artist based in Emeryville was awesome. Accompanied by shared black rum cake which was ok not great capped of the meal.\n\nWould I come back... sure good place for a couple or a small group. But it is tiny... we called when they opened at got the last available table at 5:35 on Thursday?  \n\nCome on mon!", "author": "Craig G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-03-27", "description": "Day O! Day O!\nDaylight come and me wanna go home...\n\nI'm no expert at Caribbean cuisine, but I have watched \"Taste of the Islands\" on Create TV. There were lots of plantains and papaya in those dishes, and fruit-and-meat combos can be a dicey proposition if executed poorly. However, this place boasts a true expert, chef Nigel James of Oakland's Kingston 11, in partnership with Daniel Patterson whose restaurant Alta was the previous occupant. I was underwhelmed with the overzealous California cuisine of that operation (review: http://bit.ly/2pMFjun), so I tried to keep an open mind about Kaya. You know how hard that was for me to do since the vibe was virtually identical to Alta.\n\nI came here after working out at the gym, so I was already self-conscious about how casual I looked. I slithered up to the bar and decided to start things off with an $8 Spicy Ginger Beer since I wanted something tropical and non-alcoholic (photo: http://bit.ly/2E11x0O). It was pretty refreshing but a tad too sweetly fermented for my taste. For my starter, I ordered the $11 Papaya + Greens, which mixed pickled papaya slices, Granny Smith apple slices, caramelized plaintains, and greens with their house vinaigrette in a good-size bowl (photo: http://bit.ly/2pNdBxs). I thought it was pretty good but again probably a little too sweet for what I was hoping from a salad.\n\nMy entree was the $19 Curried Vegetables, a rather hefty if somewhat pricey bowl of broccoli, green beans, carrots, chayote (cho cho), sweet and Irish potatoes, peas, and more of the caramelized plantains covered in a thick Jamaican curry (photo: http://bit.ly/2uqfq9r). The ingredients were fine, but the result was a little too heavy and unfortunately a bit bland. I was really hoping Kaya would be better than my previous dining experience at Alta, but I felt somehow it was another near-miss for Patterson. I'm not averse to unique cuisines, but I think I may need to do a restart when I try Caribbean food again. After all, the oxtail stew and goat curry sound calorifically good.\n\nDay me say day me say day me say day o\nDaylight come and me wanna go home\n\nFOOD - 3 stars...the ingredients seemed tight but the flavors were on the sweet side and often bland\nAMBIANCE - 3.5 stars...still the same dark, trendy space that Alta was\nSERVICE - 4 stars...the bartenders were most attentive\nTOTAL - 3 stars...my check done come and me wanna go home", "author": "Ed U."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-20", "description": "I love love love Kaya! The vibe is so artsy and exciting. The playlist is always on point. The food and drinks are incredible. Bring all your friends. One of my favorite restaurants in SF for sure.", "author": "Dexter H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-10-17", "description": "Wasn't not a big fan of the food here, in fact I actually changed my plate out because I didn't enjoy the Ackee and Saltfish. Replaced it with Tofu and that wasn't great either.", "author": "Endia H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-23", "description": "Enjoyed this Caribbean cool vibe place. We were seated quickly on a Tuesday evening in the pre-theater hour. Two delightful rum punches fit the bill to start. He had the jerk chicken with rice and peas and plantains. I had the  jerk chicken salad with mango and plantains, which was delicious. We were in and out in less than and hour. This place is SO much better than Alta, which I detested,  but I do wish they served lunch.", "author": "Candace S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-16", "description": "Closer to a 4.5.  We had:\n- Caramelized carrots (3/5) - Not bad, but nothing memorable.\n- Oxtail stew (4.5/5) - Not anything fancy, but really delicious.  A really interesting combination of spices in stew covering really tender, flavorful oxtail.  The stew goes really well with the rice, almost like a curry.  There's also a handful of tasty sweet plantains.\n- Crispy skin salmon (4/5) - Just had a small bite off my girlfriend's plate, but the salmon was seasoned very well and perfectly cooked, although the flavor profile didn't seem any different than what you'd get at a normal American restaurant.\n- Cocktails (4/5) - Had two pretty good cocktails, including one that came in a coconut and another made with chocolate milk-washed rum.\n\nOverall, we had a great meal here and look forward to coming back.", "author": "Simon L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-01-22", "description": "Does anyone remember Iron Wok?\n\n*cricket cricket*\n\nBefore the techbros took over Mid-Market, Iron Wok was a divey Chinese restaurant that also served sushi. Just looking at their health score gave me the hershey squirts but you couldn't beat their $6.50 Salt and Pepper Pork Chop over rice that fed two and then some. They were a staple of cheap eats for those who worked in the area.\n\nThen, gentrification happened and Iron Wok was replaced with Alta CA which well, wasn't my favorite so I was super excited to hear that a Caribbean restaurant was taking over.\n\nYAS - infuse some fiery spices onto this stinky stretch of Market street!\n\nI absolutely hate to be the first person not to give a glowing review for Kaya but my friend and I found the food and drinks to be underwhelming (for the prices) at this new Jamaican restaurant from Coi's Daniel Patterson and Kingston 11's Nigel Jones.\n\nEvery weekend dinner calls for some cocktails. Unfortunately, Kaya's cocktails were not even close to being on par with SF caliber craft cocktails. We couldn't wait to hit up another cocktail bar afterwards.\n\nI ordered the Rude Boi: White rum w/ cucumber, soursop, midori ($13): http://bit.ly/2DW2g4V which was overly sweet and artificial tasting. It reminded me of a not so good watered down midori sour without the sour. \n\nMy friend ordered the Montego Slang: Blended rum, mango, cilantro, cherry heering, benedictine, jerk ($13): http://bit.ly/2n1VSRx and said it tasted like cough syrup. Our initial server never checked on us and never came back to take our entree order, otherwise we would have told her.\n\nSkip the cocktails and just go with a bottle of Red Stripe.\n\nThe small food menu has about 15 items of small plates and entrees. There's a good amount of options for vegetarians and vegans. Prices are higher than any Jamaican restaurant I've been to (i.e. $24 jerk chicken) but I don't mind if the food is bomb. There's an 18% auto-gratituty/service charge which is fair. \n\nThe Salt Fish Fritters ($13): http://bit.ly/2BjYu2i were surprisingly bland and sadly, the chimichurri didn't do much to enhance the flavor, as it was also bland (lacked acidity). Thankfully, the trio of hot sauces on the table helped.\n\nI love tamarind and eat it fresh, dried, and in candy form so I was excited for the Grilled Wild Gulf Shrimp w/ tamarind sauce ($17): http://bit.ly/2G1FEAB. While the shrimp was cooked well, that pungent sweet and sour tartness was just not there. The tamarind flavor was too mellow but perhaps that was their intention since it may be too potent for some.\n\nAs a litmus test of solid Caribbean restaurant, we ultimately decided to go with the Jerk Chicken ($24) for our shared entrée: http://bit.ly/2DrbW6k. Our second server was kind enough to allow us to order dark meat only (thanks to my yelp friend, Adrienne H. on the heads up of the dry white meat).\n\nI like it HAWT and baby, this jerk chicken was fiyaaah - my mouth turned into a burning furnace on this chilly night. BUT, it didn't taste like jerk chicken. While it had great heat, it was missing the robust, complex spices one would associate from a good jerk chicken. My friend said, it tasted like a spicy blackened chicken and I agree. The chicken was tender but not fall off the bone tender. The accompanying fluffy rice and nicely caramelized plantains were our favorite items on the plate.\n\nService was a bit spotty but it's barely week two so it's understandable. After taking our drink and appetizer order, our server never came back to check on us or to take the remainder of our order...but she did check in with tables next to us. \n\nWhen we were looking for our server, the young server with the beard stepped right in. He was great, he took our entree order and checked in with us several times - thank you! The host was nice too and jumped in to clear our empty plates.\n\nThe dining room is still hip and dark (from the Alta CA days) with the addition of cool art from Caribbean artists and a Jamacian movie streaming on the projector screen. Not much sound dampening so it can get loud if it's a full house. \n\nWhile there's not a strong presence of Jamaican food in SF, it's hard to justify paying these prices again at Kaya since the food and drinks were very disappointing. The bold, Caribbean flavors just weren't there for us at Kaya or maybe this is Caribbean food for techbros?\n\nYou can find much better Jamaican food elsewhere and for a fraction of the cost (~40% less) at Flavas (SSF), Coconuts (PA), Back A Yard (MP & SJ), or even Cha Cha Cha (SF).", "author": "Cherylynn N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-02", "description": "Such a great Jamaican style meal! The food was amazing and I love the interior inside. The only thing it was a lil stuffy and wished they put AC on but other than that, great experience. Must get the Jerk Chicken, its pretty popular and perfectly cooked. Not sure why it says salad but definitley get it! \n\nWhat I ordered: \n- SALT FISH FRITTERS\n- GRILLED WILD GULF SHRIMP\n- SAUTEÉD STRING BEANS\n- JERK CHCIKEN SALAD", "author": "Jenn L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-16", "description": "Glad to see more Jamaican food options in SF! The new collab from Nigel Jones and Daniel Patterson is just what this area needs.\n\nEven on opening weekend, the food and service were solid! Our server came from Nigel Jones' restaurant in Oakland (Kingston 11), and he seemed very familiar with Kaya's menu already.\n\nOur table sampled a good amount of the menu. The Black Pepper Crab was the runaway favorite. The spicy sweet sauce was so addicting that we ordered a second plate! I just wish the sauce were a tad less sweet.\n\nThe Oxtail Stew was also great - rich, hearty flavor and nicely tender. The plantains were good too. I liked the Piri Piri Chicken, which was actually not that spicy but had awesome, bold flavor from the chili sauce.\n\nThe Jerk Chicken was on the dry side, though it had good heat. They didn't have a side of jerk sauce when we asked, but they did bring out some of the oxtail stew broth for us to dunk. For jerk chicken, I do prefer Back A Yard's blend of spices (Menlo Park, San Jose).\n\nFor sides, I tried the String Beans - with Thai Chili sauce and ginger, and the Papaya Salad - nice brightness, but had barely any papaya.\n\nI only tried one cocktail, Rude Boi, which was fine, but nothing standout. They did have large punch bowls to share, which looked perfect for happy hour.\n\nThe inside of the restaurant still felt very similar to Alta, but with new paintings and brighter colors. Still trendy, but now more relaxed. A large screen on the right side played videos to fit the vibe. I enjoyed my meal here and would recommend Kaya for groups - the large portions lend themselves naturally to family style.", "author": "Adrienne H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-30", "description": "I visited on a Wednesday night around 7pm, no reservation - and I sat at the bar because the tables were booked solid (so make a reservation lol).\n\nThis spot is right on Market, but it isn't very close to public transit -- keep that in mind.  Right when you walk in, this place is pretty cool.  I love the wooden bar, the black art displayed throughout the restaurant, the projected video on the wall of Usain Bolt...haha.  I'm always a fan of a black business in San Francisco.  \n\nI highly recommend the \"Deep Dub\" cocktail.  It comes in a pineapple shaped glass, and it's a BEAUTIFUL drink.  It instantly put me in a good mood.  On top of that, the drink was delicious!  Definitely great for your IG.\n\nFor food, we shared the fried plantain appetizer - which comes with cream and beans. Super delicious as expected, definitely recommend. \n\nThen we shared the oxtail entree and the piri piri chicken entree.  I definitely enjoyed and recommend both.  Everything was delicious...I feel like you can't really go wrong.  But I will note - the serving sizes are large, so definitely share -- that way you can try different items on the menu. \n\nOverall -- I definitely recommend this spot.  It's trendy, its caribbean, its black, and its delicious.  The cocktails are gorgeous and the food is totally worth it.  I will definitely be returning.  But this place is new and hot -- make a reservation!", "author": "Michelle S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-12", "description": "My friend took me here for lunch on Sunday (my first time) and let me tell you the food was DELICIOUS. \n\nFOOD: We had the fritters as an appetizer and I highly recommend that to start with. It was packed with flavor, cooked well and not dry/over cooked. \nI ordered the Cinnamon French toast with a side of plantains. It's supposed to come with a side of turkey bacon or chicken sausage but I don't eat meat so the waiter offered an alternative which I was happy about. The French toast was nice and light, moist, not overpowered with sweetness, and absolutely filling :)\n\nDRINKS: i was pretty indecisive on what to drink, but the bartender offers mystery drinks with a choice of liquor (I requested rum). I forgot the name of it but it was fantastic. My friend had the rum punch -his regular, go to drink when he comes here- highly recommend. \n\nAmbiance/Wait: There was a live DJ playing R&B hits and Caribbean mixers. Great vibes, friendly staff, and the waiter was respectful and genuinely sweet. I love the natural lighting in the restaurant as well. \nIt wasn't busy when we were there for brunch, so the food came out pretty quick. What I liked was how both our dishes came out at the same time. \n\nAll in all I will definitely be coming back! Bummer they don't have a restaurant in the South Bay, but it's worth the drive.", "author": "Morgan B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-12", "description": "if we're naming dranks after jamaican music & culture...\n\nNatural Mystic (album)\nDeep Dub (music)\nMontego Slang (geography)\nRemember The Time (egyptian close enough ripmj)\nZap Pow (band)\nRude Boi (culture)\n\n...then where's my TYPEWRITER punch?\nLEFTHAND SIDE bowl?\nor can I get some FLEX cocktails to hand to the laydees? :p\nwhatev it's all good i'm not trippin\n\n(^_^) lennOXTAIL STEW $25\neff a tinder date i need this tender ate\n\n(-_^) SALT FISH FRITTERS $13\npair w beer any beer all beer & ur face\n\nfriendly place, don't fear the neighborhood at night\n\nhopefully KETCHY SHUBY on menu next time\nor c'mon... FUNKY COLD MEDINA", "author": "Dan B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-25", "description": "I had my eye on this place since it opened up near my friends' apartment, and was excited to see it on some lists as a well-rated hot new restaurant in the city.  I've been missing good Caribbean food since moving away from my friends over in Crown Heights/Brooklyn, where amazing jerk chicken and plantains were around nearly every corner, and always at great value.\n\nThe ambiance of this place prepares you for what to expect value wise - this is more like the kind of place to spend some quality time with a date, rather than a place to pick up a hearty meal to-go.  Nevertheless, on price, the food delivers on flavor and fillingness.  By the end of the meal we were still talking about the amazing salt fish fritters.  The entrees were solid in every respect.  The jerk chicken was moist, with a rub packed with spice and held no punches with its heat, paired with plantains and rice and peas cooked to the perfect texture.  You'll be glad the oxtail stew comes with double scoops of rice to soak up every last bit of its rich gravy.  Can't wait to stop by again!", "author": "Neal B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-22", "description": "Probably the only Jamaican restaurant I've been to, but it's great. The owner is amazing , food is great but drinks , drinks are the best!!", "author": "Oleg K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-07-06", "description": "I had brunch at Kaya with my friend.  We both shared the plantains and I ordered the jerk chicken sandwich.   The plantains were very starchy and had no flavor.  It came with a dipping sauce, but I didn't use it. I used the hot sauce to add flavor to it.\n\nAs for jerk chicken, we both thought the chicken needed more flavor. I was expecting it to have a nice heat kick, but it didn't.   The size of the sandwich though was a good brunch size that I was satisfied after eating it. I hate small sandwich portions.\n\nAs for the service, our server was very friendly and attentive. I did like the decor and large bar space of the restaurant.  I think I will have to come back for the dinner, as the entrees seem more appetizing and appealing.", "author": "Marck N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-07", "description": "Came here before an event at the theater. So worth it. If you like Jamaican food then don't miss this place. Granted we came for happy hour, we will be back for even more of the full menu. Great happy hour with tasty food and drink. The staff were amazing and super friendly...by staff I'm speaking specifically about Shani and Langstyn. They were phenomenal. So there's not much we didn't eat off the menu...friend plantains, jerk chicken wings with fried dumplings, shrimp, salty fish fritters, Jamaican beef patties, chocolate habanero and spiced vanilla swirl soft serve, and some drinks. Seriously this place is  fantastic! I also knew it would be legit because early in the summer I saw the Jamaican Rugby 7s team in there eating. I loved how spacious it seemed even though it wasn't a huge area. They really used the space wisely. The bar area and seating was well done and I didn't feel crammed in. If you don't check this place out then you're missing a great gem in the city!", "author": "Dara M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-31", "description": "We started off with appetizers/ happy hour. We ordered jerk wings (only on happy hour menu), beef patty, salted fish fritters. The jerk wings were good but you only get three wings, that's the only disappointing thing. It is the full wing not just flat or drumstick. The beef patty was good too but it looks like a pop tart, this item is only on the happy hour menu. The salted fish fritters were ok and only came with two! I think too few for the price. \nFor dinner we all ordered different dishes, jerk chicken, piri piri chicken, oxtail stew, and salmon. The jerk chicken was exactly same as the appetizer but I felt for the price they should give you more chicken. The reason I say that is cause the piri piri chicken was a half of a chicken and just look and seemed so much bigger. The piri piri chicken was very moist! The salmon was good too and veggies that came with it as well. Oxtail was really tasty.\nOverall this place is ok but for the price of the dishes they don't give a lot of food. Even just a few extra pieces of chicken for the jerk chicken I would be more satisfied because looking at the jerk chicken plate versus the piri piri chicken makes it seem so not worth it. Also their menu doesn't have a lot of choices.", "author": "Shauna f."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-26", "description": "Happy to see more Carribean places, especially downtown. \n\nOx tail & jerk chicken plates were great, though I preferred the former. Portions are perfectly adequate for the pre-theater meal without putting you in a food coma. \n\nBig selection of cocktails, with many tiki drink elements. There's one served in a fresh coconut that we both loved.\n\nPlenty of table and bar seating, though the place did fill up for dinner.", "author": "Kevin L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-04", "description": "The first official brunch of 2018. I have a group of friends who try to get together for a brunch every month or so. It started as a Ladies Who Brunch type of thing and expanded to include a few guys. I made a reservation through OpenTable for a party of eight about two weeks prior for Saturday, March 31st at 12:30pm.\n\n*SALT FISH FRITTERS: chimichurri ($13)\n*FRIED PLANTAINS: black bean sauce + sour cream ($7)\n*JAMAICAN PATTY: beef ($5)\n*JERK CHICKEN WING: fried dumplings ($11)\n*PAPAYA + GREENS: pickled papaya. house vinaigrette ($11)\n*FRUIT SALAD: ask your server about today's market fruits ($9)\n*JAMAICAN BREAKFAST: salt fish, ackee, fried dumplings, bammy ($18)\n*CINNAMON FRENCH TOAST: coconut battered challah, seasonal fruit, blackstrap maple syrup; choice of taylor's spicy chicken sausage or turkey bacon ($15)\n*BLACK PEPPER TOFU WITYH FRIED EGG: ginger + soy caramelized tofu, jasmine rice ($14)\n*KAYA SCRAMBLE: two eggs w/spinach, onion, tomato, wheat toast + cassava home fries ($14)\n*HOUSE SMOKED SALMON: papaya salad + greens, sweet corn bread ($20)\n*JERK CHICKEN SANDWICH: coleslaw; choice of russet + yam fries or papaya + greens ($19)\n*SWEET CORN BREAD ($6)\n*FRESH-CUT FRIES: russet + red yams, thyme salt ($7)\n*TAYLOR'S SPICY CHICKEN SAUSAGE OR TURKEY BACON ($5)\n\nWe basically ordered the entire menu minus a dish of two. My group does love trying everything. I adored the salmon and the jamaican breakfast. The salmon was cooked perfectly. Still silky and moist. The salt fish in the jamaican breakfast added a nice savoriness to the scramble. I wasn't eating deep fried foods at the time, so I couldn't try the fritters, but I really liked the chimichurri. Was great as a sauce with other dishes. Make sure to also try their hot sauces if you'd like a little kick to your dishes. The french toast syrup was delicious! I don't know what alcohol was in it (probably rum?), but boy, did it pack a punch. We just kept dipping everything in it: the fruit, the cornbread, just whatever went with syrup. Yum!\n\n*MIMOSA: make it a pitcher ($25 each); blood orange x1, mango x1, passion fruit x1\n*NEGRIL-ONI: smith + cross, campari, sweet vermouth ($12)\n*RUM PUNCH: wray + nephew, lime, strawberry, pineapple, orange, coconut ($50 punch bowl)\n*FRENCH PRESS COFFEE ($10) x2\n\nSince it was brunch, we decided to try all three mimosas. I thought they were juice heavy as I really only like a splash for color. Out of the three, I liked the tartness of the passionfruit. I found the blood orange too sweet. Though some in our party mixed the two together and found a good balance. I don't know how the rum punch bowl serves four as it's huge! It drank our party of eight with quite a few extra glasses left. I'm not a huge fan of coconut, but I didn't mind it here. The punch was pretty stiff at first sip, but seemed to mellow out with drinking. If you're a big coffee drinker, they only do french presses here, so I'd suggest getting your caffeine fix elsewhere. The pots didn't yield many coffee cups.\n\nA fun new brunch spot. Definitely worth checking out if you like jamaican food (albeit with a modern twist) and rum punch.", "author": "Elena N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-03-15", "description": "I love Caribbean food and was so excited to try Kaya!  The restaurant itself has a cool vibe, good music and nice space. \n\nThe menu had lots of really great options, hard to decide what to order.  The host suggested salmon but I wanted something a little more authentic so decided to go with oxtail. \n\nWe shared the plantains and the string beans, both were really good.  The plantains were a bit dry but still tasty sauces.  \n\nThe string beans almost tasted Chinese but still yum.\n\nThe oxtail stew was good, missing a bit more salt or kick.  I put some hot sauce which helped but with all the beans, it definitely will do a number on your tummy.\n\nThe cocktail I ordered was way too strong for me (some banana one that was supposed to have jerk bitters but tasted like an old fashioned).  I didn't really drink it. \n\nFor $55 a person, I think the food was ok but a bit pricey.", "author": "Kimberly L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-06", "description": "New restaurant!! Came here with the bf today and the food was really good. ALSO we showed up late for our reservation but they were kind enough to accommodate us. Top notch customer service! During dinner we had the salt fish fritters (tasted like high end fish sticks which was actually very YUM), papaya salad (the plantains were amazing), the oxtail stew (SO FLAVORFUL!), and the swirl soft serve (you can actually feel the habanero!) Everything was absolutely delicious and there were no misses in our meal. I would definitely go back and try some of the other dishes.\n\nI don't drink so I didn't get the try their cocktails but they had a very extensive list. Probably a great place to get a topical drink!", "author": "Jocelyn K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-03-03", "description": "New spot in SoMa...it was popping, even at 5pm. I'm not super familiar with Jamaican food, but overall the spot was kind of hit or miss for me. \n\nFritters - miss, not a fan of the texture of the fish and flavor. \nKale salad - hit, they cut he beets up into thin slices and the leaves almost taste like they are lightly fried. \nPiri piri chicken - miss, some of it was dry\nOxtail - ehhh, not a hit or a miss...just in the middle \nCrab - hit! The sauce was so good, but I wish they cracked the crab before serving it\nSoft serve - hit! Both flavors were great, the chocolate has a bit of a kick to it, it'll tickle your throat a bit as you eat it bc of the spice, but the flavor of the spice doesn't really hit your tongue directly\nBlack cake - miss, not really expecting a fruit cake", "author": "Annie S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-05", "description": "I was so excited to finally try this place out after meeting one of the owners at their Oakland restaraunt: Kingston 11 Cuisine. I went this past weekend and am not surprised at all by how wonderful this experience was. The moment you walk in: friendly faces, beautiful art and decor, and a warm vibration. We arrived pretty early and due to reservations we sat at the bar (which I prefer anyhow!) but I would recommend a reservation for a party larger than 2. \n\nWe ordered the pomegranate mint soda and the ginger beer. Both tasted exceptional as they are hand made right in front of you. Beautiful start. We then shared plantains with a black bean purée and sautéed green beans. Flavor town. Then shared the oxtail plate and the piri piri chicken plate. My goodness. The oxtail fell off the bone and was so full of flavor. The chicken was perfectly cooked. Ended our evening with dessert! The vanilla spice with rum raisin sauce was seriously like Christmas in a bowl. Need I say more?\n\nGo go go. The city was in dire need of some Caribbean food. Viola!\n\n*This place is totally Gluten-Free Friendly! Just speak up.", "author": "Bree G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-03-20", "description": "Very cool space with the open view of the kitchen.  It makes the place seem bigger than it is.  Parking in the area is crappy though.\n\nIt always makes me nervous when servers don't write down your order .... especially when she's taking an order for a table for 10!  But to her credit, she got it right. \n\nWe had the sauteed string beans and black pepper tofu - they were tasty, but felt more Chinese flavor than Jamaican flavor?  Maybe my own bias ;).  Also got the fried plantains because I don't think you can go to a Jamaican restaurant without getting plantains!  For my entree I got the jerk chicken salad - it was spicier than I expected but very good.  \n\nMost memorable portion of the meal for me was the chocolate habanero soft serve!  The drinks all sounded delicious but weren't as amazing as I'd hoped.", "author": "Kathleen W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-21", "description": "Goat curry on Fridays and Saturdays are what I'm bookmarking. It's delicious and comforting -- will be coming back! Next time we will also try the kale starter -- tonight's tofu starter was tasty. Service and crowd all very warm and friendly.", "author": "Angie C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-03", "description": "Came in for cocktail hour and was not disappointed! This is my first time here and I am impressed with not only their banging decor, but their selection of rum! It is incredible! They literally have a wall dedicated to different rums in Jamaica and it is to leave you feeling very satisfied. \n\nTheir happy hour ends at 6:30, so after work, come in for a drink and a light bite to snack on. Take a seat at the bar or if you are looking to dine in, sit at one of their tables. You will notice the reggae music playing in the background and honestly, it is so chillaxin' (ya, I just said that) even though it looks like a fancy shmancy spot, it is totally welcoming. You will notice the bright projector screen and a movie playing in the background dedicated to the beautiful culture of Jamaica. What's not to like?\n\nThe food here is pretty generous in terms of portion and if you are a vegetarian like me, you won't be disappointed. There is something for everyone! \n\nMake sure to stop in for their Rum Punch (a glass if you are by yourself or a bowl if you are with others) and drink responsibly! \n\nAlso, staff was super nice! Big ups to you guys! Happy to see you guys do well!\n\n$$ (bit on the pricey side, but save your money so you can grub here! Do not let that deter you from this place, you would be missing out.)", "author": "Jenn N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-22", "description": "We had a great meal here!  We are so glad we discovered this spot before it becomes super popular and hard to get into!  Excellent food (some dishes were much better than others), great service, and an awesome ambiance!\n\nOur group of 4 shared the following dishes:\n\n1) Salt fish fritters - absolutely delicious!  Must try.\n2) Green beans - very flavorful\n3) Gulf shrimp - good, through not exceptional\n4) Jerk chicken - excellent, with just the right amount of spice!\n5) Curried vegetables - pretty good, though not a standout dish\n6) Spiced vanilla soft serve - delicious, an unexpected standout!\n7) Chocolate habanero soft serve - good, but I was not blown away\n8) Black cake - good, but some of the flavors were a bit too strong for me\n\nI enjoyed my spicy ginger beer - it was a surprisingly good non-alcoholic beverage.  My husband enjoyed his Mystic cocktail.  \n\nThe service was friendly, attentive, patient, and efficient.\n\nThe setting was awesome - modern, upscale, spacious, well-appointed, and inviting!\n\nOverall, this was a great find!  We look forward to returning, and only hope it won't be impossible to get in once it's \"discovered\"!", "author": "Barnali D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-07", "description": "Kaya is the new Caribbean joint located where Alta used to be, under the same management. I had a reservation but arrived 15 minutes earlier; the host let me know that while tables were still unavailable, there were still some bar seats left. OK, I thought, this isn't too bad as I was by myself, ready to rock out to QOTSA later that night. Ordered 2 dishes, 3 cocktails, and a Red Stripe. Here's the lowdown on this place:\n\nService: For bar seating, not too bad. Place was pretty loud but the bartenders & servers do a great job shuffling the food & drinks to you. Kitchen was open & people can walk through to get to the restrooms, which I think is pretty cool as long as us eaters aren't too nasty around it...\n\nFood: Had the Salt Fish Fritters and the Oxtail Stew. The fritters were nicely done in 3 well-sized balls of deliciousness, not even overly salty when eaten w/ some of the collard greens & the chimichurri next to it. The oxtail stew, WOW this dish is excellent. Could not get over the fat-laden & cooked-just-right oxtail w/ the dripped sauce right next to some butterbeans, 2 heaps of rice, and a few perfecto plantains. This was the best part of the meal, by far. Great to have tried such a wonderful centerpiece for the dinner.\n\nDrinks: Rum Punch + Rude Boi + Rum-Filled Coconut. The Rum Punch started out bitter, but gradually it delivered some really great citrus kicks. Wish I could have a bowl of this, but I'll have to bring some friends next time! The Rum-Filled Coconut, paired w/ a closing coup de grâce pairing of Red Stripe, was refreshing w/ the extracted coconut water and the effervescent rum. The biggest disappointment was the Rude Boi: the consistency was decent only for 1/5th of the cocktail, then it devolved into something of a \"sparkling Midori\" that was watered-down & left a terrible aside for my last few oxtail bites. Would've just gone for another Rum Punch instead, but oh well that's why I'm experimenting for you Yelpers!\n\nOverall, the meal was a pricey one, a few buckaroos over $100, for everything above (18% service charge included). Was it worth it? Just for the cocktails & fritters, probably not. The Oxtail Stew did its job to elevate the whole experience to above-average, while I would be amiss to remind that this place is still in its opening weeks. Consistency is what matters in the end, and I hope that Kaya's expectations of consistency elevate it to something much better for Caribbean cuisine in the City.", "author": "Eric L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-08-03", "description": "Drinks are good, food is pretty good but I prefer the jamaican spot in Oakland. Service is a problem they have good days and bad, my first experience here was horrible!!! I wouldn't be back but friends really wanted to try this place so I compromised. Second time around it was okay my bartender was really good!", "author": "Crystal M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-10-12", "description": "OVERPRICED for under seasoned food. I tried the salmon and oxtails and bill came out to $87, which included a drink. Portions are very small and it's not worth the money. Seriously, 4 slices of plantains, under seasoned rice, and over cooked oxtails for $87.", "author": "Sederic G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-07", "description": "We stopped in for dinner on a Tuesday night and easily grabbed some seats at the bar.  Not a ton of options for Caribbean in the city so was excited to try this place and overall a pretty solid spot.  We went with some of the classics in the jerk chicken and oxtail stew, with the papaya salad to freshen things up.  Everything was cooked nicely though I think the jerk chicken could have definitely had more zing to it.  The oxtail was fall off the bone tender with the rice there to sop up all the juices and the plantains offering a nice sweet counterpoint and the salad a bit of acidity and freshness.  All in all a good meal and a place I'd come back to if in the area but not necessarily go out of my way for.", "author": "Aaron K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-20", "description": "Really excellent food, everything from the fried plantains to the moist jerk chicken and the buttery rice and beans. Highly recommend the tofu dish. The cocktails are hit or miss though. Remember the time was a nice \"remember the maine\" variant (a bit sweeter). The coconut almond cocktail was barely potable though... tasted like weak coconut infused vodka mixed with almond milk. \n\nThe prices for rum pours are really reasonable though (5 to 9 dollars for 1oz) and seems like a good place to design your own flight. Didn't end up finding out because we ran off to smugglers cove.", "author": "Sylvia L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-25", "description": "Kaya is an ideal place to brunch on a Sunday, wonderful music, drinks and bites. I was highly impressed by friendly staff, we were fully taken care of from the very first minute. We received our drinks quickly from Alec, he patiently helped us, picky girls, out and the drinks were very reasonably priced. Our food was delicious, I got a chicken salad and I couldn't wait to eat it so no photo :( the chicken was perfectly spiced and the salad with vinaigrette ideally dressed the greens and veggies in it. The dessert \"Jamaican chocolate cake\" had a light twist of red wine to it and was served with sour cream. \nI have to mention the staff though. I have been to this place a few times now, we have been served by an amazingly caring Alex the other night and I highly recommend this place.", "author": "Anastasiia R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-09-04", "description": "We were disappointed in our experience here. We had reservations but were not seated until an hour past our reservation time. Although the wait staff tried to be nice about it, nothing was offered as compensation and it was only when we said we were going to grab a table next door so we could eat when they finally sat us at our table. Fried plantains dish was the signature and very delicious dish of the night but was then made a part of too many of the main dishes.  A few of the dishes (oxtail and jerk chicken) were very good with flavorful sauces but again overincorporation of fried plantains in every dish even with the Oxtail left us feeling like all we had was bananas for dinner.  We ordered the crispy skin salmon and it came out completely raw and not edible.  The caulifower side dish that came with the salmon was very flavorful and the best food of the night. On balance, the whole dining experience left a lot lacking and the inability of the restaurant to seat us in any reasonable timeframe soured the evening.", "author": "Jennifer R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-07", "description": "First time trying Jamaican food and it was delicious. Great atmosphere with a nice bar. I got the tofu and the mango papaya salad which were both very good. Good amount of vegetarian options and some delicious cocktails. Worth the trip!", "author": "Clara M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-08", "description": "Walking in, I liked the ambience, the high ceilings, and the huge, tall liquor shelves that opened up into the kitchen. \n\nI came in solo and got seated at the bar, which was cool. There were other solo diners at the bar as well. \n\nMy bartender recommended the pomegranate mint soda and it did not disappoint! It tasted like Shirley Temple, just a little more tart. \n\nFor food, I ordered the oxtail stew. It was a hearty meal. I liked the plaintains and would have enjoyed the oxtail more if it wasn't so spicy. I do have a low spice tolerance though. \n\nKaya is about a block away from Van Ness station so easy to commute to and back. \n\nWorth checking out!", "author": "Brenda B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-13", "description": "Love this place and an absolute must try. Great menu options, the food was delicious and the service was amazing. Went with my boyfriend and a friend for brunch. My boyfriend was not sure what drink to get and the staff went above and beyond to make him a customized drink. Looking forward to coming back for dinner and try the Oxtail stew.", "author": "Dayris F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-08-10", "description": "Kaya has nice ambiance but if you want Jamaican food close to the city I would go to Flavas Jamaican Grill near the airport. We went last night to celebrate a birthday. The menu was California/Jamaican fusion with a heavy emphasis on the California side. We were hoping to have a traditional rum punch and Black Cake after dinner. The rum punch did not taste like Jamaican rum punch and there was no Black cake? With a dessert menu that has only 2 options, the Black cake is a must. We were served soft serve ice cream with a candle for our birthday celebration. Also I noted later that they add an 18% gratuity but present the check as though the gratuity was not added. I think we paid an 18% gratuity and then left an additional 20% gratuity.", "author": "Mary Ann J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-13", "description": "Ambiance: Nothing really unique, your typical restaurant decor and SF scene with a few curious Jamaicans like myself sprinkled in who are here to judge one thing and one thing only...the food!\nSimple, nice & clean.\n\nDishes I tried so far :\n\nOxtail : The amount of oxtail your given is always a huge factor for me and in my opinion it was just the right amount! I have been to restaurants who had the nerve to give me 2 small pieces of oxtail and a scoop of rice....just a shame, so i was very appreciative of the plate size and of course it was a great dish overall.\n\nCat fish fritters : yummy but not sure if its something i am willing to order again.\n\nWill be back!", "author": "Kara W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-18", "description": "Really enjoyed the yellow vegetable curry with Kevin. He didn't like it so much, but I don't think he likes curries in general! I thought it was extremely well seasoned, and the vegetables were just so fresh and perfectly cooked. \n\nThe desserts were not very good! We ordered two. The ice cream was okay, and then I told the server I really did not at all like the cake. And instead of offering to comp one of the desserts for free, she just said, well good thing you ordered two! Not too happy about that and probably won't be back due to that experience! \n\nGiving 5 stars though because the rest of the food was tasty and experience was nice.", "author": "Nadia H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-04", "description": "The staff is so friendly and the place is not too busy for brunch which made it a great start to a relaxing Sunday. Good for families with kids (not crowded!), parties of 4 people max and couples. They have vegetarian brunch options and live music on Sundays. Boom! I'm in love. Highlights for brunch are the Jamaican breakfast, french toast and the scrambled eggs with roasted cassava I stead of potatoes. Prices are decent and all brunch options come with a side dish included ( fruit, sausage, etc)  Can't wait to try their dinner dishes and drinks!", "author": "Miriam L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-27", "description": "Just upon entering, the ambiance is extremely warming and inviting. The music is lively and it without a say lifted the moods of me and my three girlfriends (we were helping a friend get over a break up haha). The interior design was also entertaining in itself, and the whole place really had that Jamaican vibe to it that stayed true to its food as well. \n\nThe service was great and the staff was very friendly. Drinks got to us pretty quick and the Rude Boi I ordered was good, a bit sweet but it was bearable. Two of my friends ordered the Rum Punch and only one of them made a comment about the bitterness. Don't take it too seriously though, she's known to be sensitive to flavors like that and I tried warning her not to order it haha. My other friend ordered the Ginger Shandy and she really enjoyed the mango kick in it. \n\nFood was also good, we all tore those plates up in about an hour haha. The Oxtail Stew was my favorite personally, it was perfectly cooked and paired with extremely complimenting additions (like the plantains, yum). We all had a good meal at this place and everything was very pleasing to the eyes and tongue! While it was fairly pricey, I honestly think it was worth the price. Looking forward to going here more often with my girlfriends :)", "author": "Jasmine S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-03-14", "description": "The two stars are for the food, service and the 18% gratuity that they added to the check for a party of 2! I've seen the mandatory gratuity added for parties of 4 or 6 or more, but for a party of two is a little ridiculous, especially when the service wasn't even spectacular. \n\nThe hostess sat us at the worst seat in the restaurant and when I asked to move she said she couldn't. But a few minutes later my husband arrived and asked to be moved and they moved us. \n\nOur waiter was mostly dismissive of our questions about the drinks, he didn't seem to know much or just didn't care to share. Most of his replies were \"I think\", \"Maybe\" \"I can check\" \n\nFood was mediocre, flavors were unimpressive. Also the Peri Peri chicken is actually a half chicken so beware! They don't mention it on the menu. \n\nOverall, the dining experience was not the best. Will not be going back here.", "author": "Mandy K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-30", "description": "Another fantastic restaurant from Nigel Jones!\nTo celebrate our daughter's new job we went to Kaya and ate most of the menu including the Friday goat curry. Every dish was beyond delicious, the small plates were as well done as the entrees and they were perfectly done. We tried the Jamaican Black Cake and the soft serves, a great way to end a meal. Not to forget that the drinkers loved the assorted cocktails. Great food, great service and a very cool vibe. We will be back for sure!", "author": "Nigel J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-17", "description": "This is my first time having Jamaican food, so I can't speak to its authenticity. But I can say, everything we ordered was well seasoned and delicious! Came here on a Saturday for brunch. I love that it's not even crowded! The interior of the restaurant didn't change much from its previous establishment Alta, which was already very rustic cute. They did add different Jamaican inspired artworks, which are neat and special. \n\nWe got the jerk chicken (lots of spices, slightly spicy), Jamaican breakfast that came with savory fried bread, fried plantain, sauteed salt fish w/ ackee. Thoroughly enjoyed every dish. Love a place that's down to earth and serves fresh quality food. Staff was very helpful and friendly. In addition to the pitcher mimosa for $25, they have a good selection of handcrafted cocktails.", "author": "Irene S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-09", "description": "The atmosphere is great. I'm used to eating jerk chicken off the side of the road with my family in Jamaica or at the few fast food spots I've been to in the Bay Area. So I was a little skeptical of upscale Jamaican food. But the vibe, service and menu manage to pull it off. \n\nOur server Winston was great and helped us find a few things we missed on the menu. The cannabis infused beer was surprisingly awesome. Rum punch hit the spot. And the jerk chicken was properly spicy. Can't wait to come back with friends.", "author": "Jamilla H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-07", "description": "Seeing Kaya on Eater I realized it occupied the old Alta place. I wasn't sure about Caribbean cuisine but a buddy and I decided to check it out. Having a lot to catch up on we ordered a bunch of plates to share and dug in. \n\nStarting with a cocktail (yes, full bar) we talked as dishes started to arrive. Sautéed green beans with fresh ginger and thai chili pepper sauce had just a little kick and were delicious. The Black Pepper Crab with sweet + spicy black pepper sauce came next and didn't disappoint. Not a whole lot of meat but very flavorful. Next came the Carmelized Carrots and Beet Salad. I think this was the least successful dish. It had no strong flavor to stand up to everything else on the table. I think there might be something here but it needs a rethink. Next came the final two dishes...Oxtail Stew with jasmine rice and plantains followed by the Goat Curry. Both were very good. Perhaps the oxtail might have increased the meat to bone ratio but it was very good. I think the goat was the highlight. Tender without a trace of gaminess. \n\nSo, five dishes and four successes. Not bad, particularly for a place just recently opened. The service was very good. The room was a tad too dark. Sound level was fine. Don't count on street parking.\n\n4 stars.", "author": "Gary C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-22", "description": "Best food. Best staff. Best Sunday vibe. This place never disappoints. From L.A., but no trip is complete without a stop here. The owner is a beautiful human being who loves, respects, and supports his staff. They make sure customers feel welcome and the vibe is absolutely magical.", "author": "Kevin M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-14", "description": "Great ambience. Love the Bar and the care they take in making their cocktails. Really impressive selection. I only tried one dish, the salt fish fritters, and I quite liked them. However I can not speak about the food with authority unless I try some more. Recommend this spot for a date or a meeting spot before a show or the symphony.", "author": "Richard P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-10", "description": "They added 18% service charge without telling us then the bill came with the regular space for the tip. This is what makes it a four star review. Nice service and cool decor with flavorful dishes makes this a good location for brunch. I liked the music they were playing and the pomegranate mint soda was nice.", "author": "Nils H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-28", "description": "A wonderful addition to the mid-market restaurant scene. Excellent food, atmosphere, and cocktails.\nThe black pepper crab is one of the best food items I've eaten in San Francisco in the past year. A little hard to eat but worth the effort. Also don't miss the salt fish fritters or the crispy skin salmon. Will be back!", "author": "Jacob K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-08", "description": "Beautiful restaurant with a fun atmosphere due to the central bar and projector playing Buena Vista Social Club on one wall of the restaurant. As an Oakland resident I wanted to support the Kaya and Kingston 11 restaurateurs. I absolutely loved the Black Pepper Tofu and my friend enjoyed the Crispy Skin Salmon. I would not get the Jerk Chicken Salad again but that may not be a reflection on the quality of the salad and more on my personal taste. I am really bummed that I did not get to try dessert as they all looked amazing. I will make time to return to try the ice cream.", "author": "Lauren B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-08-01", "description": "One star for the cool vibes, second for the nice selection of rums. I would visit again and stick to cocktails. Sadly the only dish I found to be edible was the oxtail stew and for $25 it was on the skimpy side. Roasted kale + beet salad was a burnt mess and I don't recall any beets. The yellow yams with the fried lemon arrived undercooked and the fried lemons were just a bad idea. Salmon for $29 should be served with more vegetables. But it didn't really matter since the brussel sprouts had a yucky bolied flavor with burnt cauliflower and pickled tidbits and the salmon was overcooked. So sad to spend $130 on dinner for two and leave hungry.", "author": "Theresa M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-01", "description": "Really yummy food! The menu was simple yet unique. The veggie option was outstanding! The service was impeccable. My only complaint is that it's very, very noisy. Yet another place that could benefit from turning down the music.", "author": "Kim C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-05-25", "description": "Comparing to Kingston in oakland, no way. It was ok but it's worth the drive to hit Kingston because of better taste and better value (sf prices are stupid right now). The absolutely best though: Scotch Bonnet. It's a food truck that opened up a lunch spot in sf...but if you ate the lentils and any curry, you'd recalibrate if you thought Kaya was good.  I'd hit Kaya got a drink,  but the other 2 i mentioned blow it away.", "author": "A A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-15", "description": "I came by on Saturday to have a drink at the bar with two friends. We'd planned on going elsewhere for dinner, but the vibe and service were great, the wine list was savvy and the menu looked tasty, so we cancelled our reservation elsewhere and got a table. It was a great move. Despite the fact that it was only their 4th day of being open, the food and service were spot-on. \n\nLoved our charming, friendly, super on-it server, Langston, who made our meal smooth and fun, too. The kale and beet salad was simple but somehow amazing (I think the kale had been marinated, and the dressing was magic). The tender jerk chicken had just the right kiss of spice and heat. I ended up eating it with my hands, and I'm not ashamed to say that yes, I licked my fingers clean. Plantains are too often greasy, but these were perfectly fried. Loved the rice and beans, too.\n\nThe chef came out to talk to us at the end, and he was really cool. Just a nice guy with a calm, kind and friendly vibe. Maybe that's why this place had such a good vibe going-- not just because of his talent, but because of his spirit. This is the kind of place you want to come back to regularly. \n\nOverall, it's a great addition to the neighborhood (and a welcome replacement to Alta, which always had major issues with both service and food.)", "author": "Mary B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-18", "description": "Really good Jamaican restaurant!  Oxtail stew was fantastic - I ordered with fingerling potatoes instead of plantains (chef - cut the salt, though!). Good atmosphere - huge bar area.  Good job, Kaya.", "author": "David B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-25", "description": "Nice vibrant place. Oxtail stew was delicious, and the portion was perfect. Really good cocktails as well; my favorite is the Deep Dub!\n\nIf you're going after work, be sure to make reservations, as the place fills up quickly.", "author": "Angie J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-06", "description": "I love Jamaican food but it's so hard to find in the city.  When I lived in Palo Alto, I would always run to Coconuts and Back-a-Yard but other than the super trendy Caribbean-fusion Palm House, I couldn't find any options in SF.  \n\nAs fate would have it, Kaya moved right across the street from me into the old ALTA spot.  The decor is virtually identical to ALTA with the same set-up, just with some Caribbean art and a projector showing old Caribbean movies on the wall a la Foreign Cinema or Noir.\n\nWe were told the wait for a table without a reservation would be an hour and a half, although there were tables open (this was true of our experience at ALTA as well, weird).  There were two spots at the bar though, and we gladly took them.  We ordered the oxtail and the jerk chicken.  I really, really enjoyed both.  The plantains were great, the oxtail was super tender/fatty/fall off the bone awesome, the jerk chicken was a solid take on the Jamaican staple.  Just FYI the entree portions are huge.  We could have easily split just one between the two of us, and had to (gladly!) take the rest to go.  We were so full that we couldn't force ourselves to try their ice cream desserts, which looked awesome so that's good enough reason as any to come back soon.\n\nLimited but great beer/wine selection.  I eschewed the traditional Red Stripe in favor of a Pine IPA, and my wife had the house Sauvignon Blanc.  Both were solid!\n\nThe ONLY thing keeping me from throwing five stars at this bad boy is the price.  Just like ALTA was, it's really high for what it is.  Two entrees and two drinks cost us close to $90 with tip.  It's great food but personally, when I'm craving Jamaican it's always as a fun casual date night or guys night (think $30ish per person, $60ish per couple), not necessarily veering toward the $100+ club.\n\nWill I be back?  Definitely, probably many, many times given our location, but due to said price points probably more for splitting an entree and/or grabbing small plates at the bar with some good drinks.  For what it's worth, lots of people seemed to be doing it this way, the bar was buzzing with friendly groups and couples, many of them talking to each other and the bartenders and getting everything from full meals to shared punch bowls.  Potential to be a really great scene here!\n\nHappy to have some good oxtail in our hood!", "author": "James S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-04-10", "description": "Not very impressed with the food. I had way better jerk chicken. Very good customer service and is a very good place for all ages.", "author": "corina f."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-09", "description": "Since moving to the Bay and having been raised on Jamaican, Puerto Rican, and Dominican food, I've been wild skeptical about finding a place that would serve pretty authentic Caribbean food. Kaya definitely hits my mark. I was skeptical that the food would be made for an American palate, but everything was beyond on point. \n\nMy girlfriend and I went for dinner this past weekend, and I was excited to see the extensive rum listing (I haven't been able to find Brugal out here). We both got the Zap Pow and it was wild delicious! I was able to taste the rum in it (if was Wray & Nephew, I understand since that stuff is  just wild strong) and the drink was great. The burning plantain was a dope touch.\n\nWe ordered Fried Plantains as the appetizer and they were prepared perfectly! Not slimy, not crispy; just the right amount of sweetness, thickness of the cut, and the black beans and sour cream that came with it sent it over the edge. My girlfriend ordered the Oxtail which was so succulent and flavorful. I ordered the Curry Goat (don't knock it until you try it) which had the perfect amount of flavor and spice. Both didn't have an excess of bones so the plus side is that you get so much out of your plate. \n\nI'm definitely coming back to Kaya. This place is way too good not to frequent!", "author": "Thomas R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-03-19", "description": "I love Caribbean food. I have found some great hole-in-the-wall places with cheap eats packed with flavor. If you're a fan of Caribbean food too, you'll understand why this is important: This review was written without having tasted the Beef Patties.\n\nThat's right, the beef patties are NOT available for dinner. You can always tell a good Caribbean place by their patties so, without this taste, I can't give a full assessment, but I'll go ahead and talk about the non-patty experience I had.\n\nAMBIANCE:\n\nKaya is super hip. They have gorgeous wooden tables accented with colored chairs and a fun bar in the middle of the restaurant. A projector casts films on one of the walls as the packed restaurant fills with a social buzz. The restaurant is not in the greatest location, but it's gentrifying quickly so it's not too bad. You can see the kitchen in the back and if you're lucky enough to get a seat by it, it smells SOOOO GOOOD. \n\nFOOD:\n\nI'll quickly cover the drinks first:\n\nI started off with the Rum Punch - wray + nephew, lime, strawberry, pineapple, orange, coconut. It definitely tasted like rum with food coloring and I just couldn't down it. I kept trying through my appetizers but it honestly tasted like they forgot some of the ingredients. Like, I actually think the drink was just a mistake. In any case, they didn't charge me for it which was really nice.\n\nI swapped it out for a Deep Dub which was AMAZING. It was sweet and tasted like a pina colada. I would definitely get it again. Pretty sure I could feel the island breeze as I drank it.\n\nApps:\nI got the plantains of course, which were cooked SO well. Lovely flavor, lovely caramelized crunch with a warm, soft inside. Heaven.\n\nI also got the Gulf Shrimp which were okay. They are super sweet and could use a kick. I thought there might be some spice in it but it was pure sweet and it just threw me off. The shrimp themselves were big and juicy. Mmmm.\n\nFinally, I got the string beans which were salty but somehow, everything I needed. I would order them again in an instant!\n\nThe apps were the best part of the meal, as the main course floundered. \n\nI got the black pepper crab. We have a black pepper crab where I'm from so I thought it would be similar -- it's not. The crab is in the shell but easy to crack open, and there's a lot of meat. However, the sauce isn't really able to make it into the meat so it just sits on the shell and you can dip your meat into the sauce, but a good crab is infused with flavor, and this crab just didn't have it. The sauce is sweet, not spicy (it says sweet and spicy) and very sticky, but they'll give you a hot towel, so don't worry about that. The sweet sauce again was just okay... needed way more spice!\n\nMy friend got the Oxtail. It was good, cooked so well. Tender, amazing... It was just a small portion (mostly bone) so for the price, it was questionable. That being said, it was good. 7.5/10 and would maybe order it again. \n\nI wouldn't order the crab again. \n\n\nSERVICE:\n\nService was fine. People were nice. They didn't charge me for my botched drink. I felt like the staff was attentive but didn't pressure me to pay the bill even though it was packed.\n\nPRICES: \n\nPrices are expensive for the flavor, but normal for the city. If I wanted to pay $180 I would probably go elsewhere, but I get that SF prices are just sky high. Not ideal but I'm on board if everyone else is. Would prefer a $5 patty and $8 jerk chicken from a hole-in-the-wall place though.\n\nTL;DR\n\nNot the best Caribbean place and there are better ones at cheaper prices, but I'll probably be back. It has potential and is worth another shot.", "author": "Maya G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-17", "description": "This place is new and amazing! The cocktails in particular are fantastic! The Deep Dub (I believe it was called) was one of the best tiki style drinks I've ever had and I love tiki bars. As far as their food goes, I got the Black Pepper Crab and it had the most incredible sauce. I highly recommend it. My husband got the Oxtail Stew which was so tender it fell off the bone. \n\nWe stuck to the rum based drinks but we noticed they have a really interesting list of wines, especially by the glass. We will be back to try more of their menu and their wines!", "author": "Angela J."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-30", "description": "I wish there is option to rate negative star. This place is more than one way in my not again list.\n\n1. Most of the food here is not carribean, it is mostly some fusion american food. If you are looking for authentic caribbean food this is not the place\n\n2. They forcefully impose 18 percent service charge whether you like the service or not. Rip off!\n\nOnly visit this place if you want to eat non caribbean food and get ripped off", "author": "T S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-06-10", "description": "Ambiance was fun. Food was just okay...had the piri-piri chicken which was flavorful but pretty salty. Was super excited about he chocolate habenero ice cream but it was really just chocolate soft serve with some caramel sauce, not much bite at all. Cost was high compared to quality.", "author": "Alice C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-05", "description": "This might be one of my new favorite places to eat in SF. I must admit that I am a big fan of jerk chicken and Jamaican food in general but that also means that I can be highly critical of it's preparation. This place meets all expectations and surpasses them. The chicken was tender and perfectly complemented with pepper sauces and the Oxtail was prepared like a homecooked  meal. Great food and a rum bar of very well prepared drinks to enjoy to the tunes of Mr. Bob Marley and the visuals of Jamaican heritage projected on the wall. The place is clean, the chicken is to die for, and the service is great. Our server, Ryan, took great care of us and makes the experience all the more pleasant.", "author": "Gordon Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-03", "description": "Had a great meal last night at this new spot. It's Traditional Jamaican meets SF hipster. \n\nThe drinks were pretty good. I described a flavor I was looking for and the bartender customized a drink that fit the bill. \n\nThe food was actually better than I expected. The crab was sweet and spicy. Loved the green beans. The salmon was also really good. I'm a Pescaterian so I can't really comment on the other meat dishes but my table enjoyed the oxtails, curry goat, jerk chicken, and peri peri chicken. The jerk was just ok. The others were good. Rice was a little dry. The plantains were a hit. We ordered several rounds. Dessert was ok. Black cake is not my favorite (I'm half Jamaican). The spicy chocolate soft serve was actually tasty but you only need a few bites. \n\nOverall it was two thumbs up from my party of six. Will definitely be back.", "author": "Jennifer H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-06", "description": "Curry Goat, Mon! \n\nHow many words do you have to type to upload something that will save?  Reviews don't need to be verbose to drive a point.  Brevity is the Soul of something...  If you want a translation: Hi Friend; The dead hairy horned quadruped, hammered with habanero and pimento tree berries is worth a shot.  I think you'll enjoy it.", "author": "PJ B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-03", "description": "I called to get a punch bowl delivered to my friends table for a celebration.  A guy name Alex helped me and was so nice and helpful!  I don't know a lot of restaurants that do that service, but they did!  He emailed me a receipt and everything. So sweet, hope I can try this place out soon!", "author": "Shana S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-20", "description": "This was my second time at a Caribbean restaurant. The food was great and so were the host/servers. I'd definitely go back. :)", "author": "Jon B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-04-18", "description": "Bland and uninspiring food with the standard hipster restaurant decor.  The service was extremely spotty, I had to get up twice in a meal to ask for service.  The oxtail was way too greasy and had no flavor.  This one is on my never again list.", "author": "Rosalyn C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-04-06", "description": "I know this may sound weird, but their jerk chicken tasted like hot dogs. Someone asked me, \"How did it taste like hot dogs?\" It just did, I don't know how to explain it. Legit tasted like hot dogs.", "author": "Joe H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-12", "description": "We went there for dinner before attending the theater. This place has a very lively, Caribbean feel to it. The bar is amazingly stocked. After enjoying some yummy cocktails, we ordered pork belly appetizers. Entrées were exquisite. Our server was very friendly.", "author": "Aim M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-18", "description": "Being open for only one week, I wasn't sure what to expect. I was pleasantly surprised! The service was excellent, our appetizers came out almost immediately. The fried plantains were AMAZING, so much so that we ordered four for the table. And the jerk chicken was awesome! \nThe music was a little too loud for my taste, and I found it odd that you had to walk through the kitchen to get to the bathroom... but all in all, it was a good experience", "author": "Sarah S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-02-15", "description": "Initial reviews must be friends of the owners because this is nowhere near a 4.5 star restaurant. I was excited about the unique flavors of caribbean cuisine in SF and arrived wanting to like Kaya, but both the food and the service were lacking. We ordered suggested items including the salt fish fritters, gulf shrimp, jerk chicken, and oxtails. Honestly the food was just mediocre with the same unexciting, under seasoned sides across all the dishes (steamed rice, rice and beans, plantains). I've liked jerk chicken every other time I've had it (including the islands), but it was just not very exciting. Somehow they managed to overcook the oxtails as well. I know this restaurants is across from Uber HQ, but seriously this is very overpriced for what it is, and I happily pay for $30+ entrees if the food is worthwhile. Our waiter was obviously stoned, which I don't mind if he actually remembers things, but he forgot numerous requests and even brought us plates after we asked for our check. That was extremely confusing.\n\nFor food and service the restaurants deserves 2 stars, but the overall ambience (decor/music) was fun. The host was very nice/helpful as well.", "author": "John S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-18", "description": "Excellent Caribbean food place with some really great cocktails.  Highly recommended for the food.  They also have a really big rum list with some unusual options that you don't see at other (tiki bar) places.  It would be worthwhile just to stop by for a drink.", "author": "Nate B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-29", "description": "Insane.\nGinger beer. I could smell it across the table and it was strong. so good.\nKale salad was nuts. I hate Kale, but this was my favorite dish tonight.\nI love jerk chicken, but the salad was off the hook.\nThen the root veggies arrived, sweet and caramelized.\nSalt fish appetizer with the green sauce? Stupid. I took one bite and had to rest.\nThen the jerk chicken arrived. Crazy good. fair amount of heat, tons of flavor.\nBest meal of 2018 by far.\nGreat service, great menu, I recognized and liked every song they played too.\nFantastic birthday meal, I wont' forget this one and I'll be back soon.\nThank you to the chefs who prepared the meal tonight.\nThank you to our server, great evening.", "author": "Ely R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-08-04", "description": "Great and nice waiters and staff. Nice decor and ambience but a bit on the noisy side. Pricey drinks with hardly any alcohol in them. Pricey food and small portions. Great videos of Grace Jones circa 1980. Don't bother to order the kale salad, save your money, and just rake some dried leaves from your garden, add some toasted almonds, some slivers of red onions, a dash of balsamic vinegar and at a fraction of the cost, you've killed 2 birds with one stone and made yourself a salad of dried leaves to chew on forever and exfoliate your gums too at the same time! While dinning in a restaurant, nothing's more ANNOYING than meat with bones in it. There should be a global law that no restaurant is allowed to serve meat with bones in it. Who wants to pick through meat & bones and accidentally break their teeth while biting on a piece of bone and then sue the business for dental work? Me me!", "author": "Marc N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-02", "description": "I've dined at Kaya on 2 separate occasions while visiting SF. The food is amazing. The 1st time I got the Piri Piri Chicken. On my 2nd visit, I ordered the Oxtails. The meat was falling off of the bones. I'm not a fan of shrimp and even that was delicious. I'd like to add that yuca is a favorite of mine and the way that they prepared it was better than most Jamaican or Peruvian eateries in North Carolina. I can't wait to visit again. This is a great place to have a date night or enjoy an evening roundtable with friends.", "author": "Tiffany R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-03-23", "description": "A friend and I met at Kaya for a quick, early dinner before a performance at the ballet. It's a beautiful space and got crowded quickly. The bar is lively and well-stocked. The ceilings are high so, although it's pretty noisy, the noise isn't at all bothersome. The crowd is young, energetic, fun. And the service is great, we loved our server.\n\nThe food though is pretty mediocre. I had a ginger rum drink that was kinda tasteless, served in a small metal cup with lots of ice... there couldn't have been more than half a shot of rum in the drink. A small piece of grilled salmon (the fish was fresh, but there was nothing special about the flavor) with a very small quantity of slightly-burned roasted cauliflower and brussel sprouts was $29, which is in my book pretty ridiculous. The jerk chicken was very impressive-looking and had good flavor, but it was overcooked and dry. We passed on the dessert.\n\nThe restaurant's location puts it close to Twitter & Uber headquarters and, as I said, it's a handsome place so I suspect there will be plenty of customers who won't mind the prices, it'll probably do well. But eventually, Kaya will probably need to get their acts together and put more effort into making good food. If their prices were more reasonable, I'd return and wait it out. As it is, I can pick up a comparable piece of salmon and grille it myself for around $4-$5. And I won't burn the vegetables.\n\nBy the way, heads up: The restaurant adds 18% to the bill for gratuity, even for a party of two. Caveat emptor.", "author": "John M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-11", "description": "Kaya was a pleasant surprise!! Delicious brunch. Fun waiters. Boozey drinks. Ideal Sunday spot.", "author": "Chinae G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-09-23", "description": "My wife and I went to Kaya with another couple last night. Although we enjoyed the novelty of Jamaican food, my wife and I decided that one visit was sufficient. First, as others have commented, the background music--really foreground music--is loud, so it's not a place where conversation is easy. The design of the restaurant, however, is inviting and very chic, with a tall wall of liquors providing the backdrop. Now to the food: all of us agreed that it was tasty! The portion sizes vary, however. My wife's piri-piri chicken was a half bird with plenty of meat and accompaniments. My goat curry was bony, as goat tends to be, so there really was very little meat; I would have been hungry if I were not able to finish off the chicken that my wife couldn't eat. The curried vegetables ordered by one friend was ample enough that he took some home. The grilled wild gulf shrimp ordered by the other friend was billed as a small eat, but she had trouble consuming it because it was so spicy. We all  sampled the salt fish fritters, which some of us really liked and others not so much. Likewise, we shared a slice of Jamaican black cake, which was very dense with hints of rum that reminded us of a Christmas cake. Two of us consumed most of it, with the others satisfied by a small bite. My wife really enjoyed her pomegranate mint soda, but my spicy ginger beer really didn't taste very gingery or spicy at all. I'd opt for the mint soda. All in all, it wasn't a bad experience, but considering the prices of the big plates, we felt that the value wasn't there. There are lots of restaurants in San Francisco and this one deserves a try, but like us, you may find that a single visit is just fine.", "author": "William L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-13", "description": "I knocked off one star because the food took a while and the sides that came with the entrees weren't proportioned that well. \n\nI got the cod salt fish fritters, plantains, pili pili chicken, oxtail, and spicy ginger beer. \n\nI can skip the fritters next time around. $13 for 3 pieces and just not my favorite. \n\nThe rest was cooked extremely well and flavors were on point. Just needed a bigger portion for the sides to match the entree. \n\nAmbiance is fun and nice. Dimmed lighting and nice decor. I'll be back! Service was extremely friendly, I was impressed!", "author": "Daisy S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-02-26", "description": "Our server was super energetic and fun. Not the most attentive, but made up for it with his great attitude. There were four of us for dinner. We ordered 2 cocktails and one rum punch at happy hour price plus two starters, two entrees and the three desserts and it came out close to $100/person. The food was flavorful, but not very substantial. The entrees had way more rice/rice and beans than meat, so it was not really good for sharing. I thought the menu was pretty overpriced for what we got.", "author": "La Tache T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-14", "description": "Oxtail stew and Curry goat were amazingly delicious and exactly what we were craving for. We had originally called around 5pm to check if we could make a RSVP and they stated the earliest would be 9:30pm. We decided not to rsvp since we weren't sure if we could wait that long. The person on the phone did add that the bar was available if there was any seats available when we got there. We ended up getting there after 9 and we ended up getting a table right away. Enjoyed the music and atmosphere. I love plantains and had to order more. Customer service from everyone we talked to was friendly. Definitely a place I'd go again! Especially for that punch with rum...", "author": "Trisha P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-26", "description": "The cocktails are amazing! It's like a fruit and vegetable alcohol extraordinary creation! You have to try them there. Great food, vibe, service. Lengthy wait however this is SF so if you want someplace that's good it willl be crowded.", "author": "Laurence S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-10", "description": "Everything about this place makes me wish I still worked across the street from it. The ambiance, the staff (thanks for the amazing service Langston), the food was delicious, the rum was delicious. I recommend the saltfish fritters, caramelized carrots and squash, plantains, goat curry, jerk chicken salad, oxtails, Jamaican black cake, and spiced vanilla soft serve, which was our entire order. I will definitely be back. My suggestion is to make reservations as this place is popular. My other suggestion is to treat yourself to the wide assortment of rum they have.", "author": "Lemuel Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-10", "description": "Amazing food, amazing people! I loved everything we had especially the potatoes and chicken sandwich. The fries are seasoned with thyme!\n\nThe space itself is well apportioned and has plenty of lighting. They also have a great happy hour that I'd recommend to anyone!", "author": "Mical C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-08", "description": "Awesome brunch spot and can't wait to go back for dinner!  My friend and I split the salt fritters, jerk chicken salad, and jamaican sampler (must do).  All delicious - and the service was so great.  Our waiter helped us select the right mix and amount of food.  We also got to try several cocktails - and the pitcher of mimosa is a total value play.  Passion fruit mimosas were delightful.  Quiet enough to have a conversation where you can hear one another - even with a full room of people.", "author": "Laura W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-02-17", "description": "I was extremely excited to check out Kaya after reading the Purewow article of best new restaurants in the city. The service was fantastic! Our waiter was extremely kind and did not push us at all. He checked in appropriately to make sure things were going well and the flow of food coming out of the kitchen was at the right pace. \n\nHowever, we were unfortunately very disappointed with the food. The black pepper tofu was very dry and sweet and the jasmine rice was mushy. The grilled wild gulf shrimp tasted like the shrimp was frozen and had a mealy texture. The fried plantains were flavorful. I think they dehydrated the roasted kale and beet salad. I would have preferred thick chunks of beets. It was bad, but it also didn't hit the spot for me. The Mary's organic jerk chicken (big eats) was dry. I coated the chicken in their hot sauces so I can't speak to the jerk flavoring, but the meat itself was too dry. The rice and peas were enjoyable.\n\nOverall, I have to say I would much prefer going to Cha Cha Cha for Jamaican food. I am grateful for the kind service, but the food was underwhelming. I expected more and left disappointed. I wish them the best and hope they continue to improve.", "author": "Emma L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-26", "description": "I had a great meal here.  The service was amazing and the food was excellent.  I plan to visit again", "author": "Nicole M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-24", "description": "Great food.  Great service.\nWe split the Kale and Beet salad and the Tofu dish to start (it was difficult to pick just two).  Both were excellent and the portions were pretty big for starters.  I had the Jerk Chicken which was also very tasty (as you can read in many of the reviews).  We tried a few of the cocktails - they were all good but I wouldn't call out any of them as a favorite.\nThe service was perfect - I felt like they had the right balance of checking in frequently enough to make sure you didn't need anything but not so often that your dinner conversation was interrupted.", "author": "Danielle T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-03-20", "description": "Kaya replaces AltaCa which has really amazing burgers in our neighborhood; but, once I heard Kaya was Jamaican, I was super excited to support. My first visit I had the Patties and Jerk Chicken Salad. Everything was so yummy! \n\nThe second time, I ordered the Jerk Chicken salad again. Two issues that will not deter me from stepping into the restaurant ever again: \n\n1. Instead of a proper piece of chicken, the salad had no proper pieces of chicken and instead was full of very small chicken scraps that included bones. Very disappointing for a $19 salad.\n\n2. The salad was too spicy! I can take spice; but, it would be more palatable if Kaya considered adding a cooling element, even if it's just on the side.", "author": "Charlie D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-21", "description": "Tried the curried vegetables and the jerk chicken. Both were great and very flavourful! Service was super fast, and the ambience and decor were very nice. Will definitely go back to try the small plates and cocktails!", "author": "Divya S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-28", "description": "This is a great place, it's near both Muni and Bart and the service is very friendly.  The food is good and while the drinks don't seem to be included for Happy Hour they're good too.", "author": "a f."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-07-07", "description": "Great vibes when you walk in. Really good drinks and good food. Horrible service. Our server seemed ok at first, but when the food arrived, he handed me the wrong order and just walked away. I waved three times to get his attention and for a restaurant not that big, anyone would have noticed me waving. My boyfriend got up and told him he brought me the wrong order and all he said back to him was \"ok\". Being a server for almost five years while I was in undergrad, the first thing I would've have done was apologize and assure the correct order will come out shortly. I don't mind the mistake at all, everyone makes a mistake, it is how he handled it. We were ignored pretty much the whole night until I he sensed how I upset I was from the whole situation. To my surprise, he also automatically charged us 20% tip. From my understanding, that is only automatically applied with a big group of more than 5 or 6, but not two. I was so excited to try this place, but after tonight, I will certainly not go back to this place again. What a disappointment.", "author": "Ingrid C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-03-09", "description": "It was kind of just meh for the price. I had a tofu dish for brunch and the tofu was cold, hard, and dry. The fried plantains were okay. You'd be better off to try to find a hole in the wall soul food place. The drink I had was pretty nasty too and didn't align with the description.", "author": "Rachel M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-07", "description": "good happy hour spot.  the apps were reasonably priced, and the portions were pretty big!  i particularly liked the papaya salad, fries (which comes w/ regular potato and sweet potato), plantains and the salt fish fritters.  our salmon entree was also tasty.  the jerk chicken was only ok, so i don't know if i would order it again.", "author": "Helen T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-04-22", "description": "The food was fine but overpriced IMO.  Wife got the Jamaican breakfast.  She liked it and said the salt fish tasted Filipino.  The cassava home fries were good, but the fried dumplings were plain and nothing to write home about.  Fried plantains are always good (hard to mess up).  I got the jerk chicken sandwich.  It was also good but there was very little meat in it, about 3 chicken nuggets worth.  The rest was slaw or fried plantains.  Now I like slaw and plantains so it tasted fine, but for $19 I expect more meat.  Also, the papaya salad was mostly greens and 3 tiny pieces of papaya, so I thought that was a little misleading.  So decent not amazing food, but overpriced.", "author": "John K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-02-24", "description": "Was very excited to try this place as it was listed in an article on San Francisco's trending restaurants. Grew up with Jamaican home cooking and this was certainly no where near close. The vibe and cocktails (ginger shandy and rum punch) were fine. The entrees we ordered were the jerk chicken and the goat curry both were obviously previously prepared, they came out not to long after we ordered and before the cocktails. The food was mediocre at best and over $20+ per entree, not worth it.", "author": "Tania V."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-03-03", "description": "It's my first time here and I'm a little disappointed. The ambiance is really nice- music not too loud. However, jerk chicken doesn't worth $24 . It was spicier than I expected (comparing to other carribean restaurants around bay area) and there was nothing special with the chicken.", "author": "Gokce K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-15", "description": "A very nice break from the usual California fusion options and tired menus. Everything we ordered was delicious, but my favorite part of the experience was the service. Lovely, attentive staff who genuinely care about your experience. Go!", "author": "Osanna A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-11", "description": "I have always enjoyed the flavors of Jamaican cuisine but have found the execution to be imperfect -- dry chicken, overwhelming spice etc.  Kaya evades those traps with perfect execution and yummy inventive cuisine. Dungeness crab with black pepper sauce may not be a traditional Jamaican dish, but the flavors speak of the island and the crab is moist and perfectly cooked.  Great service and tasty cocktails round out the experience nicely.", "author": "Peter H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-20", "description": "All you need to know is that fried plantains are delicious and the staff is super helpful and friendly.", "author": "Jeff B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-03-26", "description": "This place has a great ambiance but everything else went downhill from there. Overpriced and underwhelming. Never had such small portions of Jamaican food not traditional at all and catering to the millennial techs who probably have never been outside the USA. Got the fried plantain, oxtail stew. Left hungry and felt like my money would have gotten more worth at Sweet Fingers, Coconuts and other Scotch Bonnet. Even his former restaurant Kingston 11 gives better portions and flavor. There drinks were a hit and had more flavor. Unfortunately I won't be back along with the other 6 of us who arrived excited but left disappointed. The stars given were for ambiance and cocktails. No stars for food.", "author": "KK M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-14", "description": "Really excellent, innovative food. We loved everything we ordered, especially the kale and beet salad. Pretty overpriced, especially the cocktails, but all around great dining experience.", "author": "Hali H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-02-24", "description": "Good music, decor, and drinks. Food was okay. A service charge is added to your bill, but when we asked a server, he was very unclear. His explanation sounded like we were supposed to tip on top of that fee (which we did since we didn't want to short the server any money) but I don't think that's correct.", "author": "Tina L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-08", "description": "I'm not one to leave reviews but I had to do it for this place or more specifically around their service. If you go there ask for Oleg. He is their bartender extraordinaire! He does great cocktails and is so friendly, I wasn't too sure what to get from the drinks menu and asked him to invent a cocktail with some bubbles and here it was..... bubble heaven! The food is tasty and portions are decent- i was very impressed by the speed of service there too. All together a great place to go with friends, unwind, have bites, refreshing drinks and great company! Definitely on my top 10!", "author": "Hadi L."}
