{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-26", "description": "Ate here last time on September 13 2018 which was on a Thursday... This was my very 1st time ever eating lunch at this Kichi Grill, there was so many food places to choose from at the Westfield food court at the San Francisco Downtown Area!!! \n\nI decided to go eat at the Kichi which, I have never ate there before so this was only chance to eat there... And this is what I ordered which was the Teriyaki MeatBall Bowl & Side orderd of Teriyaki Chicken and it wasn't that bad at all it both items tasted pretty good!!! \n\nWhen the next time... I go back to the Kichi Grill I definitely would wanna try eating another item from the menu of the Kichi Grill!!! If your shopping around at the Westfield of the San Francisco Downtown Area and if your hungry for some Japanese Food go to the Kichi Grill it's really a good place to eat at!!!", "author": "William B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-09-21", "description": "I ordered a salad with salmon. It was okay but it didn't taste $20 (inc tip) worth, especially eating it with a plastic fork, why can't these food malls supply metal forks and knives?! I've had similar salads for under $10 at other places. But I didn't have time to go elsewhere. \n\nIt's probably a 3 1/2 star review but I don't think it's 4 star worthy.", "author": "Ben B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-09-19", "description": "1. I dont like food establishment that ask for tip first before they serve the food. what are they going todo ? not cook your food ? not cook it right and not serve it to you if you dont give them tip to begin with ? The cashier, who i will call...Miss LPB ( short for latino priviledge bitch ! oh well.) didnt even said thank you when I said, \"you are welcome\" and gave me this nose up in the air attitude! \n\n2. I ordered the fresh salmon, the color of the salmon didnt look right to me, and didnt smell right either, like fishy smell but not in a good way, when I tasted it, it tasted bitter and sour at the same time. I tried it again and it tasted the same. I tried to add condiments to it, hopefully, the  taste will change but unfortunately, it didnt ! still tasted bitter and sour. i managed to eat it all only because I was hungry ! NEVER AGAIN !\n\n3. For $15.00 - $20.00 of your money, try other restaurants in the area. The food here is expensive for what you get.  \" oh, we have to prepare the food\"......and so like the other restaurants nearby too. Now you know why this restaurant is always empty and the rest are pack !", "author": "YelpIsExtortion N S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-09-15", "description": "Staff was friendly and the line was short. I got the chicken and beef bowl but had a lot of regret. Pros: miso mushroom soup was good, Pepsi was fresh, and rice was soft.\nCons: chicken was dry, salad dressing was not refrigerated and separating, side salad had no flavor, chicken was not cooked or marinated in bottled teriyaki sauce... this place fits the steroid type of japanese mall food...", "author": "Alex T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-07-18", "description": "They are an OK option in the Westfield shopping center.The tuna rice bowl was good but expensive at $16.  Surprised that Charley's cheesesteak place next to it is so busy and these guys are not ... maybe it is the price.", "author": "Sunil R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-09-20", "description": "This place is located in the mall near the sandwich place. They were handing out samples when we passed by as were many places in the food court.\n\nI had the Miso Chicken Meatballs and while the portion size was good, the food itself was mediocre at best. The chicken meatballs were rather salty and tasted pretty bad. The texture was unpleasant and given that it was also drenched in sauce, came out to be too much.\n\nThe sauce, rice and vegetables were not too bad though, so if you get something else like the chicken this could end up tasting much better. Pricing without Meal Pal is a little on the high side but this is the mall which has pricier than average food for what you get.", "author": "Tyler T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-02", "description": "pretty good for japanese cuisine. I got the tofu salad, and it was some of the best fried tofu I've had. I recommend if you want some quick asian food.", "author": "Marigny L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-08-20", "description": "Yoshinoa tastes better and is cheaper.  The beef teriyaki tasted like salty beef jerky with teriyaki sauce.  Gross", "author": "Fatty A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-16", "description": "Value for Money: I would say the quantity is really alot for the money I paid. (5/5)\nTasty: Miso checked seemed like a fusion cusine, but it was tasty. If you ask me if i would get it the next time? wellll maybe but would like to explore other options as well( 4/5)", "author": "Vipul S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-28", "description": "Good little Asian spot in the mall food emporium ! They have rice bowls, salad, pot stickers, spring rolls, and 3 types of sushi. Also a variety of proteins and vegetarian. \n\nI love that the bowls are displayed so you know what they look like ! \nPricing is good for what it is , my salmon salad was $15 but it was a great size and a big filet of salmon. \n\nThe salad was awesome ! A big piece of salmon in Teryaki sauce over dark greens , half an avocado, cucumbers, carrots, I did no beets and a good ginger dressing ! \n\nWould defiantly recommend !", "author": "Morgan M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-05-04", "description": "I ate some food from Sorabol at Westfield and got sick and this week I ate at Kichi Grill and got sick again...so in conclusion maybe I shouldn't be eating at the Westfield food court. \n\nI decided to try this place because I couldn't find Sarku Japanese. I had the teppanyaki chicken and beef dish. I ate it and it was edible. Kind of expensive at $15 for the dish.", "author": "Denise C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-03-25", "description": "This is an absolute typical food court food, it is decent and quick. My go-to is the chicken Katsu and teriyaki. If you like, grab the sauces by thermos on the side when you pick up your food. \n\nThey can sometimes give you more vegetables than other times so be aware of that.", "author": "Kevin L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-01-21", "description": "It confuses me because I can't find the price showing obviously where. I ordered a teriyaki chicken, but the cashier did not ask thigh or breast, I checked it twice with him. Also the cashier asked me whether I would like to have brown rice, I said yes, he added it and did not mention that their would be extra money. But anyway I did not know the price for white rice from the beginning. The food tasting guy was really happy and nice. The food tastes ok I think, average American-Japanese food.", "author": "Skylar H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-01-21", "description": "Fuck this place w their shitty ass California roll. Tastes like literal hay. Sad. Hurt. Upset.", "author": "Ayanna M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-22", "description": "I can't believe how lucky we was to find this hidden gem of a restaurant named Kichi Grill located in the Westfield Shopping Centre.  The choices are amazing and the staff is so friendly and understanding to my concerns of the use of any peanut products in their items.  My Son has a severe reaction to NUTS so as a Mom I wanted to make sure and I had no worries after the nice lady answered all my questions.   If you're ever in San Francisco and looking for a place to eat stop on by the prices are reasonable and I definitely would give it 5 stars.  The food was cooked to perfection and the rice was on point.", "author": "Margaret N."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-09-04", "description": "The whole experience was not amazing. They don't have prices displayed anywhere and I confused a dish number (11) for the price which ended up being $17. \n\nAlso wait was like 10 minutes for poke bowl.\n\nAnd the food was mediocre at best", "author": "V V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-05", "description": "One thing I love about the Westfield Food Emporium is the ability to dine on a lot of little things from a lot of places. One of those places for me yesterday was Kichi Grill.\n\nI had a dire craving for chicken gyoza and guess what, Kichi has chicken gyoza on the menu.\n\nIt just under $6 for five pieces, it was a little pricier than other Japanese restaurants I'm used to, considering it's a starter / small bite.\n\nNevertheless, they were tasty!\n\nOne great thing about Kichi is that you can self-pour any soy or teriyaki sauce that you want.", "author": "Kristin Leigh M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-19", "description": "Meeh... The Panko Chicken Ricebowl was decent. I only thing that annoyed me was that you get more rice than anything else. 3 small pieces of chicken, 1 tsp of veggies?!?. For the price I paid (11$) I could've bought a way more better meal like Sushirito etc.", "author": "Duy-Nam B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-12-04", "description": "This place advertises itself as \"fresh Japanese\" on the sign. I ordered a California roll and a cucumber salad. Both tasted day old. The sushi rice was mushy and cold. The cucumber salad was old and mushy. I paid $15 for the whole meal, took a few bites, realized it was completely inedible  and promptly threw it in the garbage. DIsgusting.", "author": "sparkle f."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-11-11", "description": "I ordered a combo chicken teriyaki platter that came with a salad, miso soup, and a fountain drink. I chose to go with water instead of soda, and substituted brown rice for the white rice, so it came out to $17, very expensive. It was not worth the money. The chicken was dry, the vegetables were bland, the soup didn't even fill the cup it came in, and the salad had no dressing! Very disappointing.", "author": "Jeddeo P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-02-18", "description": "Sad face for the most disappointing poke bowl I've ever had. Shame on me for not consulting Yelp before deciding to eat here given the wide array of other places.\n\nThe poke bowl I received was sparse with a dinky serving of tuna - at most a spoonful. It also came with a slice of avocado, daikon sprouts, ginger, cucumber, and some sort of cooked slaw. No seaweed salad or tobiko. It's extra instead of the standard.\n\nWith tax, the poke bowl alone came to $17 and some change. IMO, way above the standard mall makeup which would have been fine if the fish portion was more plentiful.\n\nThere are so many amazing poke places popping up throughout the Bay Area now. Do yourself a favor and cure your poke craving elsewhere. \n\n+1 star for the sweet gal at the register who was helpful and sympathetic to the sad poke bowl. Another star for the fast service. But, there was no one else in line (that should have been a warning).", "author": "Aye E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-02", "description": "Delicious option in this huge food court!\nOrdered the Spicy Chicken Bowl w/ Brown Rice,\ndefinitely worth it.\nEmployees were nice as well!\nCheck this place out :)", "author": "Gabby O."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-12-17", "description": "Service alone deserves a full 5 stars. Friendly customer service and I'm pretty sure the cashier was a robot because I've never seen someone hold a smile as long as he did in my life. Unfortunately, I can't say the food deserves the same rating. \n\nI ordered the poke bowl with brown rice. I will admit it looked delicious and I was excited about eating it. Not the most amazing quality of fish, but then again, I'm the one that decided to eat at the mall. I was hoping that the brown rice would just be...well...brown rice. Instead it was brown rice mixed with a TON of soy sauce; way too salty! I think they should allow customers to add their own soy sauce to their meal.\n\nAt the end of my meal I wished I didn't go for convenience and would have waited to spend my money on something else. $17 on overpriced salty food court food, never again.", "author": "Denise J."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-07-24", "description": "Ordered a poke bowl because I'm missing Hawaii. The tuna is stringy and the rice was served piping hot for some reason. And not cheap. Maybe other items are better.", "author": "Sam W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-03-17", "description": "Ugh I won't eat here again. Chicken was fine but beef was horrible. They put too much sauce, rice gets soggy. I don't want them to call this food Japanese (I'm Japanese)", "author": "Elena M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-14", "description": "I always keep forgetting there's a fairly large food court in the underbelly of the nearby Westfield Mall by my weekend job at Moscone, but today I took the trip with my friend for lunch. There's a lot to choose from, but when I sampled the Teriyaki Chicken from Kichi Grill I knew I had to try it. The girl behind the counter was nice and my order was ready within about 7 minutes from the time I ordered it. I ordered the teriyaki chicken rice bowl which also included some vegetables on the side. It was decently priced at around $9 bucks. It was great! The teriyaki had some great taste to it and it balanced nicely with the rice and vegetables. I liked it a lot and know I will definitely be back here in the near future to try something else!", "author": "James R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-05-09", "description": "Nice Japanese grill place in the Westfield Mall food court.\n\nThe \"food counter\" next to the cash register is pretty neat--it's the same \"realistic plastic food\" I usually see at real Japanese restaurants. The prices a little high overall ($10+ for a rice platter), but it's actually very reasonable compared to all the other stores in the area--for example, the pasta at another store costs around $10 as well, and it's ONLY pasta.\n\nThe food taste is ok--nothing to rave about, but also not too shabby either. Also comes with a free miso soup--sounds good to me.", "author": "Henry L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-04", "description": "Sometimes convenience trumps all.  \nFirst, they offer toothpick samples of their teriyaki chicken.  If this doesn't lure you in, then peruse the sample plates and bowls on their display counter.  \nWith the large variety of foods in Westfield's basement food court, you may feel a bit of sensory overload.\nI mainly purchase takeout side orders of their teriyaki chicken for my protein topper to my convenient instant noodles.  The sauce and takeout containers are at a self service spot to the right of the counter.  Nice that the tempura and teriyaki sauces are in warm Thermos.\nMight be back to dine in, but, for now, on the run works for me.  On a recent lunch run, I popped in for a side order for said friend and ordered a lunch bowl for myself.  The spicy chicken bowl (http://www.yelp.com/user_local_photos?select=18R01gOLb6tex3AYtmkErw&userid=saJuyv784apZzH--psHZ3Q) my choice.  The chicken was nicely grilled and, on a spice scale of 1 to 5, the glaze rates a 3; used some of the sauce station's teriyaki to flavor the rice.  The veggies on the side were just okay.\nFood rates a three, at least what I ate.  Plus a half star for the menu display, sauce section, and efficient service.  Will be back for the sides, but, given the food selection at this food court, not likely to be my first choice for lunch here.", "author": "Mike C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-08-13", "description": "Absolutely horrible! Paid 22 dollars for 4 piece sushi shrimp tempura rolls and beef teriyaki bowl. The rice was mushed up on all the rolls and had no taste. And the teriyaki sauce for the beef was too sweet to enjoy, and I had to use the all the rice to absorb as much sauce as I could. Never getting food here again. 2 stars because at least the lady at the counter was nice.", "author": "Vera M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-20", "description": "I am not a big fan pf the Westfield mall but compared to the rest of the food there Kochi is pretty good. I ate the teriyaki chicken and was happy.", "author": "Mike M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-16", "description": "They have an amazing chicken teriyaki burrito! And they were super nice and brought us water and samples and napkins. Very good.", "author": "Meghan H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-03-18", "description": "Overpriced, horrible quality food. I had the poke tuna rice bowl and my boyfriend got the beef and chicken teriyaki rice bowl, plus a fountain drink. The rice tasted very undercooked with horrible texture and taste. It honestly seemed like for his plate, it was already made and was popped in the microwave. Waste of $30.", "author": "Rowena A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-03-18", "description": "I hope you realize there are two sides of Westfield Mall of which never the twain shall meet. The invisible Berlin Wall occurs as you walk through that crowded hallway with all those vendors selling smartphone covers and other disposable paraphernalia from their kiosks. You can feel the difference and yet there is Japanese fast food on both sides. The ghetto side features rubbery chicken teriyaki served by the red-hatted staff handing out free samples at Sarku. The elitist side has this place, which just shows that come Armageddon that it will be bad teriyaki that will unite us and rebuild a more unified society since the sauce could easily double as mortar.\n\nI recently tried Sarku much to my regret, so it was a matter of time before I went uptown and gave Kichi a shot. For a whopping $13, I ordered the Salmon Bowl, which came with a reasonably large piece of grilled salmon with marks too perfectly spaced to think it came from an actual grill. It was accompanied by stir-fried broccoli excessively lubricated with teriyaki sauce and a scoop of brown rice for a fifty-cent premium (see photo). I was looking at my bowl thinking how much more expensive it was compared to Jamie W.'s Carnitas Bowl from Chipotle. It was probably the same amount of food but debatable whether I had the higher quality lunch. A return visit is not in my foreseeable future.\n\nFOOD - 2 stars...drab salmon with a sticky sauce\nAMBIANCE - 2 stars...it's the mall, stupid\nSERVICE - 2.5 stars...they handed my tray with panache\nTOTAL - 2 stars...I am removing Japanese fast food from my diet now, I swear", "author": "Ed U."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-03-01", "description": "The beef tastes like beef jerky. It was not edible. Rice was average. Vegetables were bland.", "author": "Brandon M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-09-21", "description": "That was NOT beef udon soup. \n\nThat tasted like instant miso soup mixed in with beef and broccoli. \n\nThey get an extra star for the shrimp tempura that came with the soup, but that's it.", "author": "P M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-01-23", "description": "Decent fairly quick japanese food in the san francisco center mall... there are many options in this food court and other small pockets of eateries in the mall but i wanted rice and japanese food so this seemed to be the right call.i got the beef teriyaki plate. it comes with a scoop of white rice, side salad and a lot of beef teriyaki. the beef was ok... it wasnt the best or one of the better ones i've had but it was a step up from the typical mall food. the side salad had a nice sweet asian dressing on it. you order and pay at the counter. they have \"wax\" samples of some of typical orders on the menu. they give you a pager that lights up and vibrates when your order is ready so you can pick it up at the side counter. worth the money? it wasnt super cheap but for the amount of food, yes.", "author": "Chuck D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-06-25", "description": "I wanted to have Japanese food while I was at the mall. I hesitated a while but it was in the most convenient spot for me.\nI had the teriyaki chicken bowl with brown rice (50 ct supplement). It wasn't bad but nothing mind-blowing. Chicken was pretty tender, I added teriyaki sauce available on the counter.\nThe order arrived fast.\nThe cashier was very friendly.\nThis place is a bit expensive for being in a food court (around 15$ for the grilled shrimp bowl, 14 for the salmon bowl... JUST for a BOWL!).\nAlso, they do not have a lot of sushi rolls options, only 3 choices available and no salmon in those (just tuna and crab)!", "author": "Leslie S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-03-19", "description": "Good little spot in the food court that was quick and easy. Big plus for me was the choice to substitute white rice for brown. Friendly fast service and helpful. Food was good and no guilt behind the choice.", "author": "Omar R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-10-14", "description": "I really regret eating here. The only reason why I opted to eat here was because my boyfriend didn't want to go eat raw oysters and clam chowder with me at the pier. Sad life.\n\nI honestly was in the mood for some Japanese food. Their wax sampled food displays looked so promising. I should've just begged my boyfriend if we could leave the Food Emporium. Ugh. Anyways, I got the shrimp tempura and teriyaki chicken rice plate. I was really hungry at the time but I seriously had the worst experience eating here. It wasn't because it was disgusting. Any food is great when you're starving. I was just really sad that I had to eat at the food court and on top of that, eat here when their scoop of rice was literally half the size of your palm. Also, they crowd the plate with more of their salad. I didn't even bother eating that.\n\nHonestly I think the best place to eat at the Food Emporium is Catch Isle. Pass on this when you can!\n\nPS: reading the reviews of their poke bowl right now made me thank the Lord I did not order it!", "author": "Jarleen V."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-01-17", "description": "Got the chicken rice bowl the rice was great but the chicken was nasty!  If I didn't know better I would think they got it out of the dumpster it tasted very bad", "author": "Jim E."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-11-23", "description": "I got the tuna poke bowl and it was disgusting. $18 for the most pathetic and bland food--even the seaweed \"salad\" was just some dried seaweed strips (probably one tiny sheet just shredded up). Outrageously overpriced. This is the second time I've been burned by this restaurant and the last. Go elsewhere in the court!", "author": "Irina D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-01-16", "description": "Apparently you can't substitute and pay the difference for a bottled drink instead of their horrible selection of fountain drinks. The food was pretty pricey for a food court place. Food had very little flavor and wasn't fresh", "author": "Jimmy R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-12-14", "description": "Mall food.  When options are limited, you end up eating here.  It's expensive, not fresh, and non-memorable.  \n\nPoke tuna rice bowl @$13.95.  Skip!!!  \n\nIt was dry, not fresh, and uninspiring.  Just stick to the cooked stuff.  If you want sashimi, it's best to go elsewhere.", "author": "Jenny T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-05-17", "description": "Bleghhhhh... I really wish I read Jenny T's review about the Poke Rice Bowl before coming here. What a massive waste and disappoint.\n\nFirst, I'd like to preface this review by saying that yes, as other reviewers have also mentioned it is in the Westfield's Food Emporium. In other words, there's plenty of other places around that are much better quality.\n\nBasically I just want to admit firsthand that I have made a terrible mistake.\n\nCustomer Service:\nLackluster. The employees seem more bored than friendly, but that's probably because of the lack of customers (I should have taken that as a sign as well, oops silly me).\n\nFood:\nI opted for the overpriced and disgusting Poke Rice Bowl. Normally, I loveeeee raw fish, poke especially. I was fooled and enticed by their interesting display counter of all their different meal sets. At the end, I probably only finished about 1/4 of my meal before I gave up.\n\nThe rice was overcooked or cooked with too much water because it turned into some goopy paste. The fish was most definitely not fresh (you can taste the tough chewiness of the defrost). For close to 14 dollars, I'm tempted to not write this review in order to save *myself* from the embarrassment.\n\nAlas, I have to warn my fellow Yelpers. Please please please choose another restaurant in Westfield (there's such a huge variety!).\n\nMy review can only be summed up with this sentence: I've made a terrible mistake.", "author": "Clarissa Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-04-23", "description": "Came by here since my mother and sister were feeling hungry after some shopping. My sister had the Ahi Poke rice bowl and my mother had a Katsu rice bowl. I liked the ahi poke bowl much better than the katsu rice bowl since the chicken was dry. The poke had good flavor, especially paired with brown rice and the avocado. Around $30 for two orders including a drink - a bit on the expensive end, but hey, what do you expect in DTSF.", "author": "Amanda C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-03-13", "description": "I ordered from here randomly to try something new. Ordered the Salmon Bowl and had a glass of water. It ended up being $15 about, which is pretty expensive, so I was expecting bigger things. The wait time was reasonable 5-8 minutes. They give you a little call back buzzer to let you know your meal is ready.\n\nI liked the whole salmon! It wasn't drenched in sauce and it was grilled nicely. The veggie medley was good too, maybe could use some pepper or some spice, but seamed healthy. What was disappointing was the rice scoops. It was completely mushy and too wet.\n\nThis was to try but I think there are better value options, even in the Westfield mall food court.", "author": "Michael C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-10-20", "description": "Nothing special about the food except the price. This is my 2nd time and I wasn't a bit impressed.", "author": "Master R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-29", "description": "I only had a little time to grab lunch a couple of weeks ago while working in the area and found a deal here for a box with teriyaki chicken, white rice, sushi, vegetable tempura and a small salad. The deal was $9.99, which seemed like a lot of food for a reasonable amount. I had also considered salmon. It was solid fast food court fare. \n\nWhat had lured me in was a guy standing out front with samples. That works! I went to another food court place the next day based on trying a sample and thinking it worked for me.\n\nYou could do much worse than here.", "author": "Eric W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-06-19", "description": "Kichi Grill, the former Mr. Hana.  There is only one item I order, the shrimp tempura bowl.  Everything in one bowl:  Four pieces shrimp, broccoli and carrot salad, and a generous heaping of rice.  Sometimes I will get a side of the chicken gyoza to accompany the dish.  I will have to try the shrimp tempura and teriyaki chicken combination.  In the meantime, I am and will be content with the shrimp tempura bowl.\n\nDomo ariagato!", "author": "Chiara A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-06-18", "description": "My favorite is the poke tuna rice bowl. I only order that dish. Rest of the food is pretty average! Nothing too spectacular. Basically what you'd expect. The rolls are pretty terribly rolled. They taste ok if you drown it in the sauce. As soon as i try to pick it up, it just falls apart. But like i said, i dont expect much. \nI mainly go there for the tuna rice bowl which i like. Service is actually very pleasant.", "author": "Anudari K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-18", "description": "Hands down the best food court restaurant ive ever been too. Went here twice on my vacation to the city and both times i ordered the same thing and it was phenominal.\nGranted, it was a salad, but still.\nIm drooling thinking about how yummy it was. Super consistant. \nConsider opening a location in hawaii guys, it'd kill up here!", "author": "Ella A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-07", "description": "Food was delicious!\n\nThe food was brought out pretty fast and was on display versus a menu. \nMeaning they had every single menu item already plated behind a glass counter, that way I know exactly what I'm getting. \nAll in all, i had a great time here, I would come again.", "author": "Fung S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-05", "description": "How cute were the people working here?  Completely sweet and adorable.  Anyways, I had a quick lunch here with hubby during a marathon shopping trip.  I had the chicken teriyaki bowl and hubby had the salmon bowl.  Completely satisfied with both and the portions were big for the price.  A good solution to a Japanese craving while shopping!", "author": "Christine T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-03-18", "description": "Had the Tuna Poke Bowl with a friend. There was lots of fish on it and not many places will give you a lot on a Chirashi bowl so that was a plus. But this is the only positive about it besides the $1 meat on a stick appetizer they served.\n\nThe Bowl of rice was mushy, If you can't have a proper bowl of rice it's just a bowl. I didn't noticed when I started mixing the rice but they put in a wad of wasabi so because to take it out. even that would be too much for anyone to consume even for dipping.\n\nThe avocado wasn't even sliced, they just plopped on a 1/3 of the fruit straight in the bowl. At $15 a bowl I won't be coming back to this place.", "author": "Andy D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-10-09", "description": "This place is okay no it isn't yes it is.\n\n...is what comes to mind as I think about Kichi Grill. My most recent time there saw me standing before the cash register ready to order, when a trio of people came up and had their orders taken even though I'd already been waiting. Confused by this, I watched the cashier's eyes; it was like she was purposefully looking everywhere but at me.\n\nWas it due to my untamed hair that morning? That's why I slapped on a trucker hat on my way out the apartment, to slay or at least conceal that bed head. So after some more lengthy seconds and narrowing her options down for not-at-me places she'd already glanced, the cashier did meet my eyes to calmly ask if I was ordering.\n\nFrom here on, things looked up. They nicely let me substitute tofu for the crab that came standard with the bowl I ordered. They had Sriracha (rooster sauce), a condiment that I don't always see at Japanese places. They had chilled cucumber water, which, with the addition of brine, could be chilled pickle water, technically speaking.\n\nThey also offered me ice to put in it. They asked and gave options for how I wanted the tofu prepared, the mere act of which is above the level of service I'd expect in a mall food court. There were ultimately two cashier type people up front and two cookers toward the back. They were all chill, and the cashiers smiled often.\n\nMy all-encompassing statement on Kichi Grill is that you should give it a try because the workers are nice and give you nice food, once they know that you know that they know that you're present.", "author": "Dan B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-03", "description": "For mall food, this is 4stars! I eat here frequently after wrk. I primarily get the spicy tuna roll with cucumber salad. It's fresh and tasty, nicely presented in a plate, and so much better than the sushi and cucumber salads at Bristol Farms, the market in the mall near Kichi. \nEverything I've had there has been tasty and as good as it looks: the seaweed salad, sushi rolls, veggie skewers, fried tofu, salmon, chicken. \nThe miso soup is a lightly oily kind with a mushroom taste. Not my favorite, but still good. \nThe sushi isn't authentically Japanese with the sweet rice, but it's still very good.", "author": "Xenoneon N."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-04-27", "description": "The teriyaki chicken bowl is ok but a little pricey.  They are stingy on the sauce but not with the samples.  The food takes a long time.  They do not have ramen here.", "author": "Chris L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-10-05", "description": "Gross.  First, it's ridiculous that the poke costs $15.  I would think $12 is reasonable. Everyone who is recommending the poke has never been to Hawaii.  Poke is tuna cubes lightly tossed with sesame oil and soy sauce.  Theirs has been marinating in soy sauce.  Rice was mushy.  Not that hard to cook proper rice.", "author": "Ryan Y."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-09-14", "description": "Food was surprisingly tasty, and they were one of the only stalls open at 7:30 on a Sunday evening (the food court closes at 8), but my partner and I both suffered food poisoning after eating there.  I had the Fried Tofu salad with beets, avocado, cucumbers etc and Miso soup, and he got the Chicken and Beef bowl with brown rice.  Never going back.", "author": "Letitia L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-18", "description": "I was shocked at how delicious my meal was from a mall restaurant.  I had the salmon (not overcooked), which is not what they offer with their free sample... Maybe they should!", "author": "Lorraine L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-18", "description": "I really like this place they are always very friendly and attentive, and they have one of the best chicken teriyaki bowls I have had in a while it's always fresh and cooked right there yum. They also have really yummy tempura shrimp that I got last time I was there. I love that they also have dispensers with warm teriyaki sauce for you help your self which is my one of my favorite things about this place Bon appetite.", "author": "Josh R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-03-06", "description": "Stopped by here for lunch one day after running an errand at the mall. Ordered the teriyaki chicken with rice and vegetables. \n\nThe chicken was good, very flavorful and a huge portion. The rice was a little over cooked, and the vegetables lacked any flavor. (It was mostly cabbage and carrots.)\n\nIt was a large portion and I thought it was reasonably priced (about $8) for the amount of food I received.", "author": "Stephanie T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-09-02", "description": "It's sort of funny to read people's reviews berating mall food. You don't go to mall food courts for great food; you go because they're close when you're hungry, cheap and you don't have to tip. \n\nWe ate at Kichi Grill in the Food Emporium and found it to be above average mall food, prepared fresh, not over salted, cheap and we didn't have to tip. The Salmon Teriyaki Bowl was very good in fact. I would eat there again. I might even leave a tip next time!", "author": "David M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-06-02", "description": "THE worst Japanese food I've had in my entire 21 years of life. It is not real food.", "author": "Leslie M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-04-27", "description": "Kichi Grill is a terribly expensive alternative to Sarku Japan Grill but is a bit more upscale & stylized a bit different.\n\nThis place us either a hit or miss, be sure if you are going to spend the money that your food is up to par - by that I mean Miso soup hot & if you are getting something grilled make sure its hot off the grill....\n\nThe menu has changed, their platters used to be a bit better & I used to like their cucumber water but since Sarku Japan Grill has opened ive stopped coming to this place simply cos it doesnt seem as good & if I wanted to pay such high prices I'd go eat at a proper Japanese restaurant that is not fast food style.", "author": "Julian I."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-11-30", "description": "Me and best friend came to the food court on Friday night to get something to eat, mainly for him since he didn't have much to eat that day. I ordered the chicken gyoza and that will be the first and last time I will be eating there. I got the worst case of food poisoning I have ever experienced in my life. It ultimately lead me to get rushed to the emergency room. It's quite unfortunate because this place was actually one of my first picks of where to eat in that busy food court. But after my sickly experience, I will not be spending my money here anymore.", "author": "Ashley O."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-11-01", "description": "Accessibility (Parking / Wait Time)\n\n0/1 Star:  You better be taking the bus here.\n_____\n\nService (Waiter / Cleanness / Ambiance)\n\n0/1 Star:  Fast food style.\n_____\n\nTaste (0=Not Edible / 1=Edible / 2=Good (average) / 3=Must Try!)\n\n1/3 Stars:  This place serves it's food near room temperature and isn't all that good.  I finished my order because I was hungry, and because I was able to cover everything in more teriyaki sauce.  The self serve teriyaki sauce was the hottest thing they had. \n_____\n\n\nOverall Experience\n1/5 Stars \n\n_____\n\nPictures\n\nTeriyaki Chicken and Tempera Shrimp Combo:  http://www.yelp.com/biz_photos/w31yredwoqFFaB7bynt8sw?select=eIYHeCbu533fw8UUdCNfBA", "author": "Elliott N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-04-06", "description": "Food court Japanese made by Latinos for American tourists and Westfield Mall rats. But my Salmon salad was huge, and satisfying. They also carry Japanese brand unsweetened Green Tea in the bottle, which is great because every American brand beverage is sugar loaded to the max!", "author": "Wanugee N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-05-30", "description": "TERRIBLE!!!!! I paid $20 for a tuna bowl for the food to have hair in it two bites in! I told the person working about it and they gave me a snide look and helped the next guest so I never even got to eat, I wasted my money, and left an entire plate of food. I will NOT be back!!!!!", "author": "Jennifer G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-09-25", "description": "I just purchased the Poke Rice Bowl. The cucumber slices were brown and soggy. The fish was fatty.  It left a bad taste in my mouth.", "author": "D. K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-08-12", "description": "I hate coming to Westfield on a weekend.\n\nI'm not at work, so I don't have to be here = grumpy Meg.\n\nBut we were hungry and having just gotten out of a movie we stopped into Kichi.\n\nI ordered the Teriyaki chicken, a seaweed salad and a miso soup. All of which were quite good for Mall food (especially the miso) and though the portion size was large it was more expensive than I found necessary.\n\nThe service wasn't that quick, for something so simple but I'd come back.", "author": "Meg T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-11", "description": "Poki!\n\nPoki Bowl! $13!\n\nDeconstructed, little piles of all the condiments and whatnot, all spread on a bed of seasoned rice topped with biggish chunks of tuna.\n\nYum!\n\nTried Cali bowl ordered by friend, very good, well seasoned. Tasty.\n\nEnjoy!", "author": "William M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-23", "description": "I eat at this food court Japanese because there are good choices of tasty \"bowls\". I know it doesn't seem possible, but this walk-up makes good food. \nThe times that I have been there, the cashiers & servers have been nice. \nI like that they serve with actual metal utensils & use glass cups-- it is much less wasteful. \nEven with all the choices in the center, I will come back here when I need my bowl fix. \nBTW- I usually get the Tuna Poke bowl or the Spicy Tuna Bowl. But the other bowls are good too!", "author": "Dawn R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-07-18", "description": "You can't call yourself an asian restaurant if you fail at making rice. The rice was overcooked with too much water. You know what happens when you do that with sticky rice? It becomes one huge blob.\n\nThanks for serving me poke that tasted bleh on a huge blob of white that wouldn't separate.\n\nTheir chicken teriyaki combo was on the other hand was edible. You get 1 extra star for that.\n\nLearn to make rice before you serve asian food.", "author": "Jack K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-02", "description": "Wow!\n\nMouth blowing!\n\nI was shopping with my girls and got hungry so decided to try this place out.\n\nTo our surprise the servings are enormous!!! Three people can share one order.\n\nThe I got the chicken teriyaki salad plate and it was so delicious!!! Fresh veggies ranging from lettuce, bean sprouts, radishes, avocados, slices of crisp apples and with a tasty vinaigrette. \n\nI recommend trying this dish :)\n\nHappy eating!\n\nToodles~", "author": "Mae M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-31", "description": "Being from Hawaii i'm always looking a place that can serve great fresh tuna. I currently work in the Westfield mall so this place is very convenient. Kichi Grill offers a dish called Tuna Bowl and in it it comes with fresh/previously frozen tuna, a slice of avocado, seaweed, cucumbers, and some rice. As a combo when mixed all together it's great and quiet enjoyable. The price for the dish is reasonable for what you're asking for. The downfall about Kichi for why I don't give this place 5 stars is because of how the proportions are very inconsistent and how unhospitable current staff is.", "author": "Pj A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-11-24", "description": "Had the chicken teriyaki bowl - it was alright.  This mall has so many more amazing options though that I def wouldn't come back here.  It did have a good amount of teriyaki, good rice, a little salad, and some pickled veggies that were good.  They also give good sauce and have sriracha you can take away.", "author": "Kay C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-13", "description": "Their food is pretty good, but is also a bit pricey. However, you do walk away with a full stomach!", "author": "V Z."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-03-28", "description": "My friend and I needed something quick to grab before we watched a movie at Century upstairs.  The food court at the new part of Westfield is known to the better of the two food courts.\n\nI initially chose to pick food at Kichi Grill because I thought they had sushi.  Nope, I was wrong, they don't serve sushi.  Kichi has a couple of appetizers plus bowls (i.e. teriyaki or fish) on the menus.\n\nFOOD:\n*Miso soup ($1.75) - The soup contained seaweed, green onions, and small tofu pieces BUT the soup was extremely watered down.  \n*Gyoza ($4.25 for 5 pieces) - Good.  It had a thin crisped layer on the outside and a decent amount of pork meat inside.  My complaint is the \"looks are deceiving\" container.  It came in a pint sized container, filled to the top with gyoza, BUT little did I know, a container of dipping sauce was on the bottom of the container.  The accompanied sauce should be a vinegar/soy sauce, but this one was sweet and didn't compliment the gyoza well.\n\nBottom line?  Expensive and below average food, but what else would you expect from food court?", "author": "Nicole S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-01-13", "description": "Didn't feel like meat so I decided to go with the poke tuna bowl.  Well, needless to say I shoulda stuck with something like chicken teriyaki.\n\nEverything in the rice bowl looked a day old with the exception of the steamed rice.  Typically poke is marinated with a soy sauce base.  Not this one.  The chunks of tuna sat on top of a bed of rice, with strips of dried seaweed, algae seaweed, few thin slices of squash, 1/3 sliced avocado, alfalfa sprouts, a ball of wasabi, and some sliced ginger.\n\n I could barely stomach eating my meal.  Had to dump more than1/2 of it.  Add insult to injury, it was $14.00 inc. tax. for mall food court food at lunch.\n\nStick with the chicken teriyaki bowl.  At least you know the chicken is grilled fresh.\n\nNote:  the cash register receipt still has Mr. Hana on it.", "author": "Shirley N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-10-08", "description": "Terriyaki chicken was average, not the best not the worst.  Comes with rice and a salad. Miso soup wasnt that great.  Trying to do too much different.  There were no tofu pieces. Instead it had mushrooms and garlic in it.", "author": "Mike B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-01-02", "description": "Pretty standard. Got a rice dish that was expensive, but I guess mall food always is. Ended up being pretty healthy and pretty yummy--there were 3 skewers in my bowl: chicken meatballs (pretty yum!), shrimp (always yum!), and a veggie skewer (some skip-worthy veggies but it was ok). Fast service. Might not have been enough food for the expensive price but it was all that I wanted so who knows, if I needed to eat in this food court again I could come back.\n\nThe employees at the register were pretty terrible, which is my main complaint. I was the only one in line and still had to stand in front of them for 2-3 minutes before the girls FINALLY stopped talking to each other to take my order. When my buzzer went off I had to go up and find my tray, then had no idea where the water was or who to give the buzzer back to because nobody was there, so went around to the other side and figured out the water easily (yum cucumber water!) and had to wait again to hand them my buzzer even though nobody was in front of me (probably could have left it somewhere but I figured they'd want it back, and I guess I had time).", "author": "Katie V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-22", "description": "I completely forgot about this food court!   I came a long time a go when I wasn't living in the area and then came recently with my roomies.  I forgot how nice it is.  People were giving away samples.  That could seriously feed us for dinner but we decided to eat at Kichi.  I love the displays of the food when you order.  It made me feel like I was in Japan.  The kabobs were $2 each so I got one of each.  Just read the print again because the shrimp kabob was $3.  The meatball and the vegetable kabobs were $2.  All 3 were delicious!  It's a nice small snack but for me it was my dinner.  Definitely a place to stop by when I am shopping in the area.", "author": "Chrissie O."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-09-12", "description": "Poke Bowl\n- salty and drenched with soysauce \n- poke was still a little icy from being frozen, but not too bad for mall food\n- decent amounts of veggies - they could be more generous\n- avocado was not as copious as the ones on display, but at least it's not oxidized and old\n\ndecent if you are looking for a quick lunch while you're on break.", "author": "Tina A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-04-24", "description": "Wolf returns.\n\nMark Knight's quite good interpretation: https://www.youtube.com/watch?v=iOA7NUI9Xhw\n\nKichi's quite good teriyaki bowl: White meat chicken breast covered with plenty of sauce, stir-fried veggies and steamed white rice. Served and wolfed down in no time.\n\nLikely would earn a fourth star if the $12 cost (tax included) wasn't more expensive than a Mark Knight ticket.", "author": "Jason B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-15", "description": "On my first visit I got the teriyaki chicken bowl and thought meh. On subsequent visits I've gone for the spicy tuna bowl on brown rice, which is  pretty tasty. \n\nThe spicy tuna bowl consists of a generous helping of spicy tuna, which is nice and spicy, and tastes pretty fresh. It's served on top of a bed of rice (white or brown), accompanied by some seaweed salad, shredded nori, daikon radish sprouts, a slice of avocado, some marinated cucumbers, pickled ginger, and wasabi paste. \n\nIncluding a soft-drink, my lunch costs over $15, which is a little pricey, but it's a big enough meal to fill me up nicely, and it tastes good.", "author": "Aaron M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-02-06", "description": "Expensive. Food isn't that great. But if you want Japanese, this is really the only place you can go (unless you count Sarku as \"Japanese\" and I don't...).", "author": "Sherry L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-14", "description": "Price and quantity this place is considered the best. There is another Japanese food joint in the mall but the amount that one is spending isn't as great as this place.\n\nAnd they make that extra effort by adding a few slices of cucumber in the water.", "author": "M C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-12-16", "description": "I know this is a food court, but with some really tasty options like Sorabol and Coriander at Westfield, I expected more from Kichi.  I ordered the udon noodles with chicken gyoza, and it was edible, but did not taste remotely authentic.  The gyoza had been fried too long, the udon and vegetables were both too al dente.  I guess I should have known with some of the options on the menu, like the California roll salad (a deconstructed California roll served as a salad).  Anyway, not returning again.", "author": "Vivian W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-01-28", "description": "Kichi Grill replaces Mr. Hana! If you're tired of Sorabol, Buckhorn Grill, and Out the Door like I am, KG is an ok option for your pseudo Japanese food fix. \n\nAt first, I was very skeptical about KG thinking that it was probably still \"Mr. Hana\"  but in a red disguise.  Although I've never tried Mr. Hana, my friends and co-workers have and complained about how awful the food was, so naturually I stayed away. And, if it weren't for the free sample (chicken teriyaki), I would have walked straight passed it.\n\nI opted to get the Combo Platter of Chicken Teriyaki and Shrimp Tempura. The platter comes with a salad, 2 gyozas, and miso soup. You have an option to substitute brown rice for an additional 50 cents. You can also choose white meat instead of dark meat. \n\n*Miso soup: I'm no expert on Japanese cuisine, but I heard you can tell a quality of the miso soup by how quickly the miso paste suspends into a ball.  KG's miso soup suspended very quickly into a pillowly cloud. However, the dashi broth was too salty for my taste. There was no tofu, seaweed, or green onion in the soup which I'm NOT use to.\n\n*Chicken Teriyaki (dark meat): The chicken was grilled very well. It was very tender and surprisingly moist. The char marks gave it a slightly smokey flavor. However, most of the flavor came from the teriyaki sauce which is topped after grilling. The sauce was light and was more on the sweet side. \n\n*Shrimp Tempura (2 pieces): Definitely from a frozen box. The tempura batter was heavy and not light and airy the way tempura should be. It was over fried, which was evident from the darker brown color. The shrimp itself was somewhat tender and sweet. \n\n*Gyoza: It was ok...the entire gyoza was deep-fried and had a thicker skin than most usual gyozas would have. It was very crispy and had a moist pork and cabbage filling.\n\n*Salad: Mixed greens and sliced carrots which were very fresh. The miso sesame dressing (in the bottle near the soy sauce) was on the watery side, so I would say it's more of a vinaigrette. It had a prominent sesame flavor and the ginger gave it just the right amount of zing. \n\n*Rice: I think it's very easy to screw up cooking Japanese rice. Too little water and it's undercooked with a hard center OR too much water and it becomes a glutinous mess. KG makes it just perfect. It's cooked to a perfect al-dente, slightly sticky with a slightly sweet taste. \n\nPrices: \n$8-12 for Teriyaki bowls and Combo Platters.\n\nService: \nI noticed the first reviewer said the employees were rude. Perhaps he encountered different staff? The male employee who gave the samples and worked the back seemed very friendly and always had a smile on his face. However, the cashier could try to at least crack a smile here and there. \n\nI went during peak hours at 12:45 PM and I got my order within 5 minutes. \n\nKG is nowhere near authentic Japanese cuisine, but what can you expect from a food court right? It's like what Panda Express is to Chinese food. Orange chicken is NOT chinese food people! LoL!\n\nIf you had bad experience(s) with Mr. Hana, KG is worth giving a try. And, if you're a 9-5 Mall Food Court Whore like I am, life is all about having different options right?!?!", "author": "Cherylynn N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-02-02", "description": "So I totally saved the menu so I could write out the description of my order but I can't find it anywhere. Homph :( \n\nCame here for lunch with my friend Willy. I got some tuna tartare rice bowl. I love that they offer brown rice. Weeeee. Its an extra 50 cents tho but whatever. \n\nService was fast and friendly. I love their cucumber water! I've never had it before and it was really refreshing. My friend hated it though. \n\nThe rice bowl was huge. I ended up taking some home and eating it later that night as well as spoon feeding it to my loverman. Haha. Plenty of tuna and I love love love the addition of apples to it! Amazing. \n\nTheir cucumber salad was super spicy but the seaweed salad was delicious. I thought it was overall really bland but they do have bottles of sauces for you to put on your food. I wish I had maybe done that. \n\nPretty pricey and my friend never got his soup. Oh and I had a piece of broccoli from his bowl and it was disgusting and I LOVE broccoli.", "author": "Tiffany V."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-04-04", "description": "Grrr... I was bold and decided to give Kichi a shot... boy was that the biggest mistake of the day.\n\nI felt daring and said \"why not, I'll have the poke bowl!\" The plate is half filled with rice, less than half a cup of \"poke\"- if you will, avocado and some dried seeweed. \n\nThe first bite of poke and rice...I think, \"ohh salty!\" Then I add the avocado and think... \"It's edible!\" After 6-7 bites, I say, \"Yakatelas!\" I forced myself to only finish the fish because this was a $15.XX plate! Absolutely Expensive! However, I left most of the rice!\n\nNot even 10 minutes later, I feel my stomach grumbling and making all sorts of funny noises. I run to the bathroom! \n\nStory of my life! Don't eat here unless you want to get the poops! Yakatelas! \n\nIf I could, I would give Kichi, ZERO stars! Next time, Kichi, use fresh fish please! I will not be back!", "author": "Diana L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-21", "description": "For food court food, Kichi Grill is definitely getting a 4-star review from me!\n\nLast night, my BF & I came to the Westfield Food Court to eat a quick dinner before watching a movie at the Metreon. We wanted something fulfilling, affordable yet healthy enough to be considered dinner. Kichi Grill was the answer!\n\nMy BF ordered the Salmon bowl and I ordered the Unagi bowl. Both of these bowls came with rice and veggies, making our meals complete. Both my unagi and his salmon were delicious! I was impressed considering this was \"food court\" food. There was also complimentary cucumber water for their patrons, which was refreshing and tasty! This helps you save a couple of bucks from purchasing a bottled water or soda.\n\nThe prices here at Kichi Grill aren't necessarily a bargain but about average to other food vendors in the food court. Each of our bowls were in the $11 - $12 range. Aside from salmon and unagi, there are also many other varieties of bowls one can choose from, including shrimp tempura, chicken teriyaki, beef teriyaki and poke (ahi). \n\nOverall, a good option for those looking for something semi healthy in the food court, or are in the mood for yummy, quick Japanese food!", "author": "Mari S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-18", "description": "Yummy!  We eat here on days we go to the office (which is on the 7th floor of Westfield)... I love the tuna bowl with brown rice and if they don't have the tuna poke, the california bowl with some tempura shrimp is delcious too.  Their udon is also yummy.  I always get the tuna poke bowl, though, if possible, and add one tempura shrimp if I am like starving.  I would recommend here... great fresh fish and so filling.", "author": "Lyndsey C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-01-20", "description": "04/2011: Hung out with my girl for a \"Ladies Day Out.\" We were starving when we got off BART so we headed straight to the eatery!  Let me tell you, the eatery at this Westfield Shopping Center is like NO other. Anyone that knows me, knows that I LOVE shopping. So, I've been to a lot of malls in my lifetime. \n\nThe variety of international culinary delight here is amazing! Of course this is SF...the land of flavor. I was surprised to see REAL Japanese food (as in SUSHI) being served here. We shared the Tuna Poke Bowl, edamame and a large Sapporo (BTW I never had beer in a mall either.) No plastic bowls or utensils here! They keep it real! The portions were huge and the Tuna was the perfect color, the other ingredients were fresh. The tab wasn't all that bad either.\n \nWe were ready to do some serious power shopping! Next time I'm at this mall, I would come back again.", "author": "Carmel S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-09-07", "description": "Kichi Grill isn't too bad of a place to go for a quick Japanese food fix.  A and I ate here a couple of months ago.  There was no one else in line before we ordered, but there were a bunch afterward.  Because, obviously, everyone wants to eat where A and I eat, right?\n\nAnyway, I ordered the Poke Tuna bowl.  It was basically all the ingredients from a sushi roll, but in a gigantosaur bowl.  Seriously, gigantosaur.  No way a small person like me could finish that entire bowl full of food (mostly rice) for lunch.\n\nIt consisted of Poke, some seaweed salad, wasabi, ginger, cucumber, avocado, topped with some dried seaweed over rice (in the gigantosaur bowl).\n\nAll in all, it was pretty good.  The fish was fresh.  The seaweed salad was good.  The whole dish could've been a little bit more flavorful, but it was good.  A little expensive for food court food though.", "author": "Kris L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-05", "description": "I've been coming to the Westfield food court for years now, and each time I've always resorted to Buckhorn, but I'm glad I wandered out of my comfort zone and gave Kichi Grill a try.\n\nThe chicken teriyaki salad is delicious!  Mixed greens, kyuri asa-zuke (pickled cucumbers), beets, avocado (nearly a whole avocado!), jicama, carrots, fried wontons, and of course the chicken teriyaki.  Combined, these half-a-dozen ingredients make one of the best salads I've ever ordered!\n\nAt about $10, this salad is a little on the steep side.  But considering that the proportions are large and that a salad at Buckhorn is about the same price (their salad doesn't even come with any meat!), shelling over $10 for a Kichi salad isn't all that bad.\n\nI will be returning to Kichi Grill in the future!  \"Yay! I'm a fan!\"", "author": "Matt S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-11-04", "description": "The food is usually good but inconsistent & egregiously overpriced.  What brings me to write is the service: rude, rude, rude.  The women running the register must hate being there because their displeasure shows.  Efficiency does not belie friendliness & decent customer service.  The owner should take note.", "author": "Stephen D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-06-07", "description": "Kichi Grill is an example of how food court fare can actually be fresh and tasty. I had their Cali Bowl which is basically like a California Roll in a bowl. Thus named \"Cali Bowl\" - duh.\n\nFor $12, you get a huge bowl of rice (which I did not eat), topped with imitation crab, avocado, seaweed salad, rice, sprouts, and a bit of wasabi and ginger on the side. Even without eating the rice, I was full. And, I went back at least three time to refill my cup with their delicious complimentary cucumber water. Woot! \n\nOkay so it's not the cheapest meal around but trust me: cheap = pre-prepared heat lamp food. You'd much rather eat where your food is made to order.", "author": "Mariela D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-11-23", "description": "So I wasn't expecting high end Japanese cuisine, but I was looking forward to something tasty and satisfying. Most of the food outlets at The Food Emporium dining court are really good, but Kichi Grill is definitely not one of them.\n\nThe food at Kichi Grill reminds me of the frozen entrees that are very popular at Costco. The ones you pop in the oven for 20 minutes and get an instant dinner. I ordered the chicken teriyaki and shrimp tempura platter. The chicken was actually tender but it wasn't seasoned well. The sauce was very mild. The shrimp tempura was crispy but lacked much flavor. This platter also came with miso soup that was just ok. \n\nThe service here was bad. I was skipped by the blonde chick who cut me. The register guy saw me and knew I was in line. My opinion...skip this place. You are better off going to Buckhorn or Corriander Thai a couple shops down for better quality food!", "author": "Paul C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-28", "description": "My new go to Japanese spot when I'm shopping near Bloomies.  Albeit kinda pricey for a teriyaki chicken plate (it's about two dollars more than Sorabol around the corner) but I can tell its prepared with love.  :). All joking aside their chicken Gyoza is great.  I usually get a brown rice chicken breast bowl and I love it!", "author": "Marylouise R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-06-12", "description": "Their Shrimp Tempura and Chicken Teriyaki Combo is pretty good!  Just wished it was a few dollars cheaper though, as $12.32, is more than slightly expensive for mall food!  I think Hahn's Hibachi on Irving has something almost exactly similar to what I ordered for a few dollars less, except that place specializes in Korean.  \n\nI have to admit though that the quality of the chicken that's used is good - you won't get no tough, burnt, chewy and some bad pieces here and there like some of them other places that be serving chicken teriyaki out there.  The chicken is cooked just right and the teriyaki sauce is not overly salty nor too sweet.  The tempura is pretty decent too, same goes for the fried gyoza.  Miso soup, on the other hand, was a bit of a disappointment as it was already lukewarm by the time it was ready for me to pick up my order, but I kinda expected that.  Aside from buying something Japanese at Bistro Farms, this is likely the only place in the food court that serves Japanese food, if you happen to be in the mood for that.", "author": "Kahanalei M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-04-01", "description": "K inda cool to see \"premium\" food court options\nI  just wish the food lived up to the prices, though\nC ould be 4 stars if it weren't overpriced\nH ard to justify spending $17 for lunch and drink...\nI n a food court at the mall\n\nG ot myself the Salmon Teriyaki Bowl\nR eally nice flavor on the fish -- basted just right\nI t didn't taste too fishy and wasn't too dry\nL iked the rice and veggie stir fry sides\nL oathed paying that much for a food court rice bowl", "author": "Anthony N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-12-03", "description": "Can you really be picky when you are minutes away from collapsing due to starvation? It's what happens when you skip breakfast and decide to eat lunch past noon.\n\nAll I could think of was shove food in my mouth as fast and as much as I could. I would have probably finished my food without paying attention of how it tasted and gave this place 4 or 5 stars. But what went really wrong? The seaweed salad was very SALTY! What did I order? I can't remember, all I know is I picked it because it had seaweed salad in it and it turned out to be inedible. \n\nI won't mind giving it another chance. After all, it saved me from passing out.", "author": "Lora M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-03-31", "description": "Worst ever! I got food poisoning...probably from miso soup which had some weird mushrooms in it rather than the shitake mushrooms. NEVER again!", "author": "Deborah L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-09-15", "description": "Typical mall food.  IT's good.  And you get a lot.  One of their plates is enough for two people.", "author": "Emily S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-07-29", "description": "OMG bad bad bad service\n\nYou 'll never find a smile from this restaurant...\nDo all the employees here HATE their job or what?\nOr maybe the owner is very rich already so they just don't care who's working for them so they just picked those people to ruin they business???\n\nI went there on Monday evening around 7.30pm \nand I ordered with the cashier lady (name on the receipt Nadia): \nBBQ chicken with shrimp tempura combo. \nShe said \"What?\" to me and looked at me like I did something wrong.\nSo I was like \"What what?\" and told her I meant the chicken dish combo that comes with the tempura and she replied \"What BBQ chicken, we don't have that. Ok so in the menu it said GRILLED chicken, not BBQ chicken, but it's the only damn chicken thingy that comes with Tempura, you'd think it's easy to understand! So yeah, my fault for not ordering EXACTLY what is written in the menu but how hard is it to be nice about it; if not nice, how about at least civil, and not giving attitude right off the bat!\nI ended up pointing in the menu at what I wanted and got more attitude. \nthey forgot  my tempura sauce also\n.\nI hate giving bad reviews but this place just deserve it ....\n\nThe food was good though.", "author": "Aphrodite L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-05-09", "description": "Overpriced, nasty, old food.\n\nI ordered the ahi tuna from here, not once, but twice.  Both times, the tuna was practically inedible (chewy, slimy).  Apparently someone else had the same experience as he was chewing out the cashier and demanding money back.", "author": "Jason N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-08-06", "description": "How anyone can give the food here anything less than 5 stars is beyond me.\n\nI've eaten at plenty of places at the Westfield food court (which for the most part, is pretty decent, save for a few places which basically serve you heated up/microwaved food and expect you to pay $10 for it). \n\nKichi Grill is always the place I go to. Why? Here you go.\n\n1. FRESH food. None of their food is recycled or heated up. It's always freshly marinated DELICIOUS chicken, tender, and cooked just to the right place so it doesn't lose it's juiciness.\n\n2. You get a healthy serving for what you're paying for. Americans tend to eat too much in general. Kichi overserves (like most places) but not by too much so you're not overeating as most people do in this country.\n\n3. Their teriyake sauce is f-ing perfection. Honestly, I could have three cups of that thing poured over my rice and chicken and veggies and it still wouldn't be enough.\n\nThey charge you about $10 for the chicken bowl which is WELL worth it in my opinion. I've tried other dishes there and it's always fresh. Sure, you pay anywhere from $12-$14 for the dishes, but at least you're getting freshly cut food that is grilled and healthy, unlike some of the other restaurants at the Westfield which overcharge you and the food feels rather flat and recycled.\n\nAs for the service, I've never gotten rude service here...but seriously...who goes to restaurants serving Asian food for the service? No one. Asian restaurants tend to be notoriously known for having sedated service, but if the food is great, who cares?", "author": "Cristian G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-08-25", "description": "Wow.\nI'm stunned.\nI never thought I'd be raving about such an amazing meal from a food court. But seriously? For $10 I had an amazing dinner. Healthy, too!\n\nWhile everything looks great here, I went for the chicken breast bowl ($9.75). It comes with veggies/asian slaw, rice (white or brown), and a perfectly cooked terriyaki chicken breast. SO DELICIOUS.\n\nPlus, they have warm terriyaki sauce off to the side of the registers, perfect for dipping or adding a little extra. Delicious. Not to mention, complimentary cucumber water. Yum.\n\nThe staff here was friendly and helpful and it is delicious. I'd go here for a quick lunch or dinner even if I wasn't shopping in the mall.", "author": "christine c."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-04-19", "description": "Rude!  Now that I got that out, let me tell you why.\n\nOrdered a cali-bowl which came out to $12.  Pretty expensive compared to the other places around.  I asked if they offered a student discount and she replied rather abruptly \"No\" with a look like I shouldn't even ask.  After handing my receipt, she pointed over to the side where I can pick up my order.  So I go over there where several people are standing waiting.  For some reason, my order comes up rather quickly.  You'd think I'd be happy, but no she just announces a cali bowl is in the bag, places it down and walks away.  I don't know if anyone else ordered one so I hesitated, but seeing no takers, I reached over and grabbed it.  There's no soy sauce in it and I don't see anything but squeeze bottles of soy sauce on the side so I catch the cashier's eye and ask for some.  She points to where I'm standing and turns away.  Ok, I see some sauce in little plastic take out cups in an area that I can't reach, so I try to get her attention again to ask.  She walks over and I point to the sauce in take out cups.  She points to empty cups on the side where I can't see because the people waiting for food are standing there, and then walks away again.  So you can't even hand me a pre-filled cup of sauce?\n\nPlenty of better quality food on the other side of the food court, like Coriander, Catch Isle and Buckhorn and guess what?  They offer a student discount and are friendly.  What a concept.\n\nI hate giving bad reviews, but sorry, this place needs to learn some manners.", "author": "Maria S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-07-03", "description": "Guess I've been here a few times before, though I think they changed their name from Mr. Hana, which the receipts still state.  Decent tasting food, especially in a food court, but if they utilized sticky rice, it would immensely aid in the use of chopsticks.\n\nStill, their spicy tuna was very flavorful.", "author": "Garett T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-12-08", "description": "$15 for a beef teriyaki bowl and soda in a food court. Are you f-ing kidding me. \n\nI have no idea what I was thinking; clearly I didn't bother looking at the menu board and the prices. \n\nSure you get a heaping bowl of food but its of mediocre veggies, mushy rice and semi-warm chunks of hard beef. \n\nMajor fail. Head to Sorabol for a more satisfying meal.", "author": "Jonny Bobby G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-08", "description": "Excellent quality Japanese food in the beautiful Westfield Center Food Court, San Francisco. \n\nTeriyaki dishes well prepared. Fresh salads and vegetables, quality meats cooked to perfection. This is what all food courts should strive to serve. \n\nGenerous portions and an extensive variety of main courses to choose from. I have dined at just about every restaurant in the Westfield Center Food Court and all are quite a bit above the average fast food establishment. Kichi just seems to have an edge on the others. The freshness of the salads, tasty soups, and the quality and preparation of the chicken and seafood just makes this fast food outlet a gourmet treat. Great taste and healthy at the same time. \n\nPrices are more than fair for the big portions of gourmet food. Order a combination plate and you definitely won't go away hungry. Great sauce options, too, that allows you to customize the flavor of your entree. The chicken teriyaki/shrimp tempura combo plate is exceptionally good and seems to be the favorite meal on the vast menu. \n\nEverything cooked and prepared to order, guaranteeing freshness. Plenty of seating available and if you are inclined to have dessert there are several great options at nearby stands. Gelato ice cream is one of the favorite choices at the Center, another gourmet treat, and only steps away from Kichi.. \n\nVery clean establishment and good service. Minimal wait even when they are busy. \n\nIf you are looking for quality Japanese food and are downtown in San Francisco this is the place, great food, great price.", "author": "Walt N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-30", "description": "...so I was wandering around this food court one day looking up at all these menus trying to decide what to eat, when all of a sudden.. POOOOF!! .This little Hispanic guy with a tray full of food appeared right in front of me.  \"sample\" he said, and handed me a piece of teriyaki chicken on a toothpick.  That bite sized sample made my mind and I hopped in line.  \n\nI ordered the Teppanyaki Combo which was: Beef, shrimp, and chicken.  The veggies that were served with it were kinda weak and flavorless (maybe it was just decoration) but all the meat was good, even tho I only got 2 shrimps and felt kinda ripped off. Over all it was pretty tasty.\n\nIf I ever come back to this food court, I'll probably be back at Kichi Grill.  The food court in general is pretty nice... for a food court.  Definately an interesting place to people watch.  \n\nThanks sample guy for getting me to go to Kichi Grill instead of somewhere else!  \n\n\nHeads up: Lunchtime in this place gets super crowded. Be prepared to sit next to strangers or walk around for a while looking for a table.", "author": "Tim L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-05-18", "description": "I was hesitant to try this place again because the 1st visit was less than satisfactory.  I got the teri salmon bowl this time. Last time I got the chicken. It was good but nothing extraordinary and kind of on the expensive for mall food - $14.", "author": "Madeline R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-08-20", "description": "For some reason I keep ending up here -- I love the tuna poke bowl but paying $15 for a bowl of rice and just a wee bit of tuna just seems bizarre. It's a huge serving, sure, but it really is mostly rice. That aside, I think the meal is tasty -- two scoops of rice, one scoop of tuna poke, a slice of avocado, some sprouts and seaweed, with a hefty serving of wasabi and ginger.", "author": "Shauna S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-02-03", "description": "3.0 Stars\n\nKichi Grill is located in the far end of the Food Emporium on the basement floor of the Westfield San Francisco Center.  See: http://bit.ly/awx3p8.  This appeared to be the only Japanese option out of all the eateries.  \n\nThey have all the various menu options displayed behind a big transparent glass of some sort.  The items included teriyaki bowls, noodles, and gyoza.  I'm sure there were more, but I can't remember them off the top of my head.  It was great being able to see what the actual dish looked like before ordering it.\n\nIt wasn't too busy on Sunday a little before noon. The cashier seemed a little bored waiting around for someone to come by and order. As other reviewers had mentioned, I guess it can't hurt to smile now and again. :)\n\nSo I decided to go for the Ahi Poke bowl.  It consisted of Ahi Poke (chunks of marinated tuna), seaweed salad, dried seaweed,  spicy cucumber, wasabi, and ginger all placed on a bed of white rice.  There was an option for brown rice with a $0.50 surcharge, but I didn't go for it.\n\nThe dish was OK. Not the best, not the worst.  I was really craving Japanese that day so it did help fix my craving.  The seaweed salad was springy and good.  The tuna itself was fresh, but the marinate was not much more than soy sauce and green onions. Well, nothing a little wasabi can't fix right?  \n\nPortions were decent.   It helped make me comfortably full.  Price-wise I would say it's pretty expensive for a $12 bowl of rice and fish, but what do you expect at a mall eatery.  Overall a decent experience.", "author": "Jason H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-30", "description": "Working nearby, I often just end up at the mall for a quick lunch. It's easy to get burnt out on all the food here, but the white chicken breast teriyaki bowl is probably the best dish in the food court. Nearly $11 for the bowl is a little pricey, hence the 4 star review, but it always fills me up. \n\nThe teriyaki sauce is great. The meat is good quality, something that so many Japanese restaurants around here don't seem to come through on. I've never had to spit out a sketchy piece, which sadly happens all too often anytime I order teriyaki chicken elsewhere.\n\nIf you need a quick meal, or are at the mall, it's tough to go wrong here.", "author": "Mike M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-06-10", "description": "It's food court food. Don't get your hopes up. I suppose it wasn't bad. Not sure why I expected it to be better than it was. But it was ok. Nothing special.", "author": "Elaine T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-10-19", "description": "The worst udon I have ever had. Just because it's in a mall is no excuse, the sushi place in the metreon is baller. California rolls are dry also.", "author": "Ketan A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-07-19", "description": "The service was fantastic. I had the Teppanyaki Combo rice bowl with shrimp tempura. The rice and vegetables complemented the tender chicken and beef. The meal was tasty but it was quite pricey considering the portion.", "author": "Deus D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-11-03", "description": "Whenever I visit the Westfield Center I always eat at Kichi. It is great! I usually get the Chicken Teriyaki Bowl with white meat, a salad and sometimes treat myself to the Fried Tofu. The teriyaki bowls are huge, the salad is always fresh and vibrant, and the tofu is crunchy on the outside and melts in your mouth! There are so many options in the food court and no one is as consistent and delicious as Kichi. The quality is top notch, as is the service.", "author": "Goodman, S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-10-06", "description": "This place is awful and one of the places to avoid at the great food court.  They should be ashamed for calling this Japanese food.  We ordered the poke tuna bowls.  The tuna had no flavor and looked liked it was artificially colored.  They must source this ingredient from the lowest quality provider.  The rest of the side items- seaweed salad, pickled zuchini, ginger, brown rice were tired (not fresh) and/or too salty.  The only good thing was the avocado which was fresh.  The bowl was $13.50...what a ripoff.  Go to Loving Hut or Sorabol if you want to satisfy an Asian food craving.", "author": "Puff G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-05", "description": "I was getting my car windows tinted nearby on a sunny Saturday.  The hunger set in, and I needed to eat fast.\n\nSo...I dropped by Westfields dining area.  Always an entertaining place to dwell.\n\nI decided to try this place...ordered the chicken teriyaki bowl (dark meat).\n\nNot bad...tasty...the portions are huge like others yelpers wrote...fast and efficient service...I enjoyed my meal.\n\nThe tough part was finding a seat.  I must have walked in circles before settling in on a bar stool at this large yogurt eatery.", "author": "Derek N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-08-19", "description": "I go to Westfield many times but rarely eat anything from downstairs in the food court. Went out with my friend and decided to eat dinner as well. I ordered the teriyaki chicken breast and tempura combo. The tempura was yummy. The chicken was dry but I did like the sauce. The miso soup was a bit salty, but my friend liked it. The meal was okay but I might order a different item next time, maybe one without the chicken.", "author": "Jen M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-09-26", "description": "Today I saw an employee of Kichi giving out free samples RE-USE discarded toothpicks for the next batch of samples. He fetched USED toothpicks from the discard bowl and stick them in food which he then gave out to unsuspecting people. Revolting.", "author": "Josh T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-06-03", "description": "I wish Mr Hana was still here. Their chicken teriyaki meat was so tender.\n\nI'm sitting here on my lunch break eating a bowl of spicy chicken breast. It has a good flavorful bite to it and Ivan definitely taste the spicyness. however, I'm only giving 3 stars because when I bit into the chicken, it tasted really dry. I wish it had that succulently tender chicken taste.\n\nMaybe I'll try other things next time.", "author": "Melissa D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-25", "description": "Stopped for a quick bite before we continued on our shopping day..Boy did we hit the jackpot in stopping here! Had to rave about the Cali bowl that had everything you could imagine..Crab, sushi rice, seaweed salad, sprouts, cucumber, avocado, wasabi giner..It was a quasi california roll in a big fat bowl..$11.25 for all this yummy goodness. We also ordered gyoza (good) and the beef platter (that was just OK)..But the Cali bowl is where its at..For a fast food place we spent a cute $37 just for lunch..But it certainly was worth the Cali bowl!!! Will be back when its time for a quick stop before we power up to go shopping again.", "author": "Jennifer A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-13", "description": "Expensive, but they definitely give you a lot of food to eat. I ordered the BBQ chicken and shrimp tempura combo, which also comes with gyoza, rice, and some veggies. Pretty healthy I would think overall, and they even throw in a miso soup. Include a drink, and all this was for $14. My gf paid this much for a bowl of pasta at the italian place a few spots away so I think I definitely got more bang for the buck here.", "author": "Tom I."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-04", "description": "Tempura udon was ftw, very tasty and the noodles did not break at all. Gyoza was alright, yet was bland. Spicy Tuna bowl was a little TOO spicy, couldn't eat a spoonful without a heaping helping of water. Speaking of water, they give free cucumber water :]. A moderate price for Westfield food court.", "author": "Gary W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-08-09", "description": "I come here for the chicken breast bowl, but especially for their miso-ginger dressing that I pour all over everything. An absolutely delicious sauce that is worth the trip alone. I always eat here when I am at Westfield to shop.", "author": "Clair C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-10-25", "description": "Three words: Chicken Teriyaki Bowl. That's all you need to know about Kichi. Doesn't matter whether you view this eatery as basic mall fare, fast food, or fine Japanese cuisine--you're going to love the Teriyaki Bowl. Fresh assortment of veggies, fluffy rice and a huge helping of sizzling grilled chicken...all lightly seasoned and stir-fried to perfection. Beyond delish and incredibly filling. So good I once ate it for lunch 17 days in a row. Thinking I might start another run tomorrow.", "author": "Steven B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-05-28", "description": "The best thing on the menu is the spicy tuna bowl. Enough said.", "author": "Krystel M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-05-09", "description": "The chicken was drenched in sauce which wasn't a huge downfall. I mostly prefer chicken breast, and they had some dark meat. Over all, it wasn't bad, but it wasn't amazing.", "author": "Alex S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-03-14", "description": "Had the chicken teriyaki bowl.... was a bigger bowl than I expected and the food was hot and I enjoyed the taste.  Service was ok... middle of the road I suppose.  I'll probably go back and I got about the same amount of food I've paid 3 or 4 dollars more at other places. Menu is short but its the mall so no big deal there.  But why is steamed rice by itself 2.99?  Back east steamed rice is a dollar to a buck fifty for an ample amount.  But I've noticed that at many places here in Cali prices are a bit higher on stuff like that.", "author": "Sidney I."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-10", "description": "We have ordered the salmon bowl twice. Never have we had such succulent grilled salmon with generous portions of rice and cabbage salad. It was if a tail section (the most moist) was pressure cooked and than finished on the grill. The piece de resistance was the steaming hot terriyaki sauce from the condiment station. Perfect for the fish and rice. The hot sauce was tremendous over the vegetables. Sit down restaurants would charge almost double for this dish. You have got to try this!", "author": "Wally C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-05-24", "description": "Don't go here!!!! I got terrible food poisoning from the spicy tuna rice bowl AND it wasn't even that good. Full on stomach cramps, vomitting, everything - it was the WORST. Was even considering going to the hospital. My boyfriend ate some of the leftovers and got milder food poisoning, so I know it was from the fish.", "author": "Margaux M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-09", "description": "Ordered teriyaki chicken breast, serving was pretty generous, i shared my plate with my sister. it had a butterflied breast, with 2 scoops of white rice. only bad thing was that the salad needed some dressing. The miso soup was ok, kinda too salty. Not too bad for what you pay.", "author": "Ana R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-05-24", "description": "When I went to the Westfield mall yesterday, I was STARVING. So in order to make a proper decision I ran the full food court circle and finally went with Kichi Grill. It looked somewhat appealing and was definitely the lightest/\"healthiest\" option.  \nThe Poke Bowl looked pretty decent since I didn't want to have anything drenched with Teriyaki sauce. I just saw in the previous reviews that these guys offers brown rice substitute, which I totally missed out on....\nAnyways, the bowl is pretty large, so I found the portion fairly generous.  The tuna seemed ok quality, the rice was lukewarm as it is supposed to be, the marinated cucumbers were surprisingly good and well how can you go wrong with shredded seaweed, seaweed salad and pickled ginger. Ohhh what I found rather amusing was the large chunk of avocado on the side, but hey healthy fats - who am I to complain!\nAll in all the dish is decent for a mall food court, especially when you fix it with some soy sauce and wasabi, but the whole thing is expensive! Man - I paid $12.95 for that bowl!", "author": "Sonja S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-08-29", "description": "Lots of food. Pretty good but damn near $30 for 2 plates of mall food court and 1 lemonade.", "author": "Fred F."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-05-14", "description": "This place tastes fresh, but it's pretty tasteless. I've had better pokio at a Safeway, to tel you the truth. And for the price you have to pay,....not really worth it. I also didn't like that they didn't tell me that I had to go to the condiments section...I went and sat down, then realized I didn't have soy sauce.....come one...soy should be standard with poki!", "author": "Nick V."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-11-20", "description": "Really like their unagi rice bowl with vegetables, but it's a bit expensive for lunch.", "author": "Lisey W."}
