{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-01", "description": "I love Kilowatt ...my liver not so much.\n\nI do not come here very often anymore but when I am in the neighborhood I love  taking visiting guests from out of town here...and their response??  Gosh I wish we had one of these back home!\n\nYeah no chit! \n\nGreat beers on tap. Mixed drinks. Cheap pool table.\n\nPatrons are chill\n\nGreat rock and roll vibe with a rowdy juke box \n\nYou can bring in outside food as well ( that's a win, win, win !!!!)", "author": "David G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-21", "description": "It hasn't changed and still has character. It's a great place to meet up and chit chat the night away. Ahhh, I love the Mission bars and suicide girls. Cheers to Dr Winkie! Lol!", "author": "Moneey P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-10-03", "description": "Besides cash needed to order up drinks and maybe renting of the game supplies, I like this divey spot, which is a rarity these days in the Mission.  \n\nIf it is divey, it would be contemporary and not that old school vibe you get. \n\nDarts, pool tables and pinball machines for the most part on entertainment.  Also, TV to watch sports' games.\n\nCasual and chill at its finest.", "author": "Tiffany D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-03", "description": "If there's only one dive bar you visit in the inner Mission, please go to Kilowatt. Best place to drink and go shoot some pool. I used to play in a bar league and this is where we would meet up for some practice.", "author": "Gerard Y."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-08-03", "description": "This place usually has chill bar staff and cheap drinks.\n\nBrought a large group straight in after a BYOB show  around the corner to hang out and celebrate and buy drinks. We brought in a single bag of leftover food and the remaining couple cans of warm leftover beer and set it aside and left it untouched with our jackets for the remainder of the evening. The bar tender was awesome, friendly, and courteous, we spent a couple hours there and bought quite a few beverages, but a dark-haired curly-headed bar back passing by stopped and curtly pointed at our bag asked what was in the bag. Because I wasn't hiding anything I told him \"Leftover food and warm beer\". We were instructed to leave \"immediately\", even after explaining it was from earlier, we had no intention of drinking it, and he could actually take it. He really rudely insisted \"No, out right now\".\n\nThe shade we were thrown killed our night, and we left really bummed. I left the beer they kicked us out over because it was unimportant, and I wanted them to know that.\n\nThe drinks are cheap, and the vibe is kinda cool, but killing our buzz ruined the night. Not really interested in going back.", "author": "Colton R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-05-20", "description": "This place was a decent dive bar on the scale of dive bars found all across SF.  I wasn't carrying cash and I wasn't going to use the ATM since I didn't believe in paying surcharges for accessing my money.  They had a decent amount of beer selections and based on my companions who went with me, they poured their drinks on the heavy alcohol side.  Good value for the money if you like a heavy handed cocktail.\n\nThey have a variety of games like darts and pool but the majority of our group stayed in a booth near the front where the ATM was located.  I chatted with the people lining up which was probably the most entertaining part of my night there.  \n\nWas worth the visit although I'm not a dive bar kind of guy, I did enjoy my stay here.", "author": "Ben H L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-28", "description": "This bar is a good option to go with a group of people, as there is plenty of space and low cash-only prices for drinks, especially beer. There are lots of pool tables available as well, and a semi-dive bar atmosphere", "author": "Clayton B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-04-28", "description": "A bartender physically assaulted me (grabed a cup out of my literal mouth and spilled it on me) at 1:50 am. Proceeded to comment about how I \"have to be at work at Google tomorrow\". If you're into super judgemental and off-putting staff, this place might be for you. \nHonestly, I don't write positive or negative reviews about places often, but this guy was such a complete douche that in felt it was necessary. If you want a dive bar in the area with actual decent people behind the bar, go to Delirium. At least they treat their customers like human beings. The staff at Kilowatt make this place complete garbage.", "author": "Michael J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-06", "description": "Great staff! Great company. Almost feels like family. Tyler the bartender is awesome. Also a plus- they have complimentary popcorn", "author": "Zara I."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-19", "description": "I come here all the time. Great dive bar to shoot some pool, play some darts and even Pacman! Can get pretty crowded on the weekend, but thankfully it's not the tiniest bar in the Mission.\n\nMost drinks are around $5-7 \n\nIn order to get the darts- you must give the bartender $10/your ID that they'll hold onto until you return the darts. Guess someone must have ran away with the darts in the past. Sadly, from the last time I was there, looks like something happened to one of the dart boards so try to get the dart board to the left if you can.", "author": "Arezou A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-22", "description": "Visiting from out of town. Great time here, very eclectic. Cash only though so be ready", "author": "Ed G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-28", "description": "Staff were friendly. Ambience is great. Four stars because the regulars at the pool tables are nothing short of a disgrace to the game - no tact or understanding of billiard fundamentals. The wall also interferes with the game. Stick to drinks and darts.", "author": "Alexander G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-22", "description": "Good place for group hangout. Cheap drinks but they do only take cash. Strictly a beer place so if you want cocktails, look somewhere else.", "author": "Kaya D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-04-17", "description": "This waiter shut off everything my gay friends played at the bar including Ace of Base and Spice Girls. They payed money for these songs at the jukebox and this bartender literally said \"I don't like this gay shit\". Shame on you.", "author": "J C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-10", "description": "This place had fantastic service even when it was really busy. They also returned my wife's iPhone X when she left it there like some class acts. Well done fellas.", "author": "Frank D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-12", "description": "In San Francisco for the fist time and I wanted to watch some football games on Sunday, I came here because a bar down the street was way too crowded and I am very happy it was. The bartender was very attentive and put the Texans game on a convenient screen without me asking just because he saw my hat. I also saw him run out of the bar to chase someone down that forgot their sunglasses! Great people great vibes great bar!", "author": "Paco S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-08", "description": "For my 350th Four Star Review, I wanted to share a cool bar in SF.  We were on a mission to party, meet some chicks, and finish at La Taqueria El Cumbre in the Mission.  After walking around a bit, we decided to drop by Kilowatt located on 16th near Valencia in SF.  BTW, this bar is cash only.\n\nEverything about this bar is chill. The customers are cool, and engaging.  No one tries to slide by you at the bar, order drinks and stay to crowd you out, a la Tasting Kitchen in Venice.  In addition, the bartenders are cool.  They let you have a taste of beer, know their handles, and pour stiff drinks.  Lastly, the ambiance is cool.  There are a couple of pool tables, and darts in rear.  The women are friendly too.  I met Christine from SF, who was a very nice person, that could carry on an intelligent convo.\n\nAll I can say is \"Mission\" accomplished!  We warmed up here, took Christine and her friend to Elbo Room & Asia SF, and got a late lite snack.  I can't wait to return and complete another mission!  LMAO!!!", "author": "Joe P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-03-03", "description": "Typical dive bar in the mission\n\nWith it's eye-catching sign, it's hard to miss this place when walking down one of the busiest streets in the mission!\n\nThe inside is pretty divey, as expected. Packed with people on a saturday night, mostly because of it's location. The booths and chairs feel slimy, and the cups they use to serve the beer look a little disgusting, with a weird \"moldy\" smell.\n\nThe clientele looks like they're ready to party, though. The atmosphere is pretty good--everyone's chatting, and you can feel the energy in the air.\n\nOverall, a good place to go if you're looking for a divey bar", "author": "Henry L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-06", "description": "Honestly, A BANGER. Me n my homegirl always sit in the back by the the crapper and get to scope out all the BADDIES walking in and out of the bathroom. Really great atmosphere, Jared the bartender (I think that's his name) always hooks it up with the $3 olympia's (my GO-TO drink). Sometimes the bouncer Connor forgets my name but I'll let it slide. I also can't forget about the amazing outdoor seating. To the right of the bar there's this SICK alley called Albion, yeah you know what happens on Albion stays on Albion. 10/10 would recommend. I've contemplated buying a hoodie to rep my fave dive bar here in the mission, but they haven't re-uped on size smalls....ANYWAY You'll probably catch me here every friday-sunday. Lightweight low key LIT bar.", "author": "Tess M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-30", "description": "Awesome, friendly place to chill w/the locals (the few that are left)! The entitled and bougie types can step on, we actually wanna have fun here.", "author": "Carol C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-05-01", "description": "Dude bar. San Francisco use to be cool, san francisco use to be cold.\nWomen, we can do better... let this be a sausage fest.", "author": "Jane D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-20", "description": "Let's make this a Packers bar, y'all! It kinda already is but I saw some VERY sad Cowboys fans there last week. Don't yuck my yum, losers! Jk They're humans and I love them.\n\nGreat selection of affordable beers. Staff is really nice. TVs all over the place so any spot is a good spot to catch a game. They also have free hot dogs on Sundays. Free is my favorite word.\n\nThis is a DIVE BAR so it's got that dingy, dark, kinda gross feeling so I feel really clean in comparison. Great for my self esteem and personal hygiene.", "author": "Katey W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-04-08", "description": "Kilowatt isn't my favorite but my husband loves coming here to have some drinks and play some pool. The place is big and the bartenders are nice. The ambience can get a little bit rough sometimes but nothing major. They have two pool tables and lots of places to seat. \n\nKilowatt is close to other bars, and restaurants so it's definitely a place to start and then move forward to another bar, it's also close to bart and located in the middle of everything. Weekends they have a live DJ and they open their back room and you can dance.", "author": "Suzy R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-28", "description": "Great spot and a staple for drinking in the mission.  Bar has it all, pool, darts, classic arcade games.  It's a pretty open space with plenty of seating.  Pool is a big deal here, so come to play...\nWas there on a Monday and had the best bartender I've had in a min.  I believe her name was D and she was everything one would want in a bartender: hot, funny conversation, and remembered all 5 of our drinks with 0 problem.\nCrowd was a decent mix of dudes:girls and vibe was upbeat and relaxed.", "author": "Chris P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-02-24", "description": "Seriously had one the worst experiences here last weekend & I didn't even get to buy a drink... The bouncer was clearly racist and made a \"fresh off the boat\" joke whilst checking our ids. He was adamant that my friend was not 25 and had the audacity to revoke the rest of my groups entry. Which was embarrassing because I was hosting a large group of people from out of state. Way to give them the San Franciscan Hello with a racial remark. By the way, the bouncer is a white guy with dreadlocks... so that explains a lot. \n\nMaybe next time I'll be able experience the inside of the bar & buy a drink. \n\nChoose wisely on whom you hire. Be professional. You're running a business.", "author": "Don S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-05", "description": "We love this bar!\nIt has the Ms. Pac-Man/Galaga arcade for 50 cents a play!!!\nFun, fun, fun!", "author": "JC M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-07-10", "description": "Meh to their drinks. Ordered a kamikaze but it tasted like straight sugar. Ugh what a waste of calories...\n\nDirty tables. Ordered two Moscow mules and they came in two different glasses which means two different sizes. \n\nOnly half of us were carded. The girls that sat down were not carded while the boys that ordered us drinks were. Some more friends came and they were stopped at the door. \n\nToo many inconsistency.", "author": "Serena F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-19", "description": "For a dive bar, this is pretty good.  The drinks are reasonably priced, and they also have free popcorn courtesy of a popcorn machine.  Great service too.", "author": "a f."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-15", "description": "Kilowatt is a rare find: a friendly, downright cheap sports bar inside the city limits. Low price beers and good TVs made this an awesome place to watch the Cubs win game 7 in extra innings. Go Cubs, Go! And Go Kilowatt.", "author": "Bill F."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-09-22", "description": "I've never had a good time here. I asked a bartender if it was cash only and he was all \"YOURE IN THE MISSION ARENT YOU??!!!\" Uhhhhhh it was just a question no need to get all cray. And I ended up withdrawing my life savings to buy shots for everyone so it's not like I wasn't going to spend my money here. Whack whack whack. So many better dive bars in the Mission. I don't even like Casanova but I would go there any day to avoid Kilowatt.", "author": "Tiffany V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-20", "description": "I LOVE this bar! I just recently discovered it but I've already been twice and I'll probably keep coming back here. This bar is conveniently located on 16th St. pretty close to 16th St. Bart in the midst of lots of other bars and clubs. This bar has a more divey feel: there's darts, pool, arcade games and plenty of seating. The first time I came here for darts on a Tuesday evening and it wasn't hard to get a dart board. The second time, I came here to watch the warriors game because all the other bars in the mission were too crowded and this ended up being a great spot to watch! We easily got seats and the drinks were so cheap - $5 for gin and tonics! Yes please! They were playing the game on 4 screens and there was a great vibe! I'll definitely be back again :)\n\nTip: Cash only! But they have an ATM inside so don't fret if you forget.", "author": "Malika R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-16", "description": "My favorite bar in the city, all the bartenders are amazing. Everyone is always super chill, great music and company. Also if you're looking for a challenging pool opponent anyone on the table will teach you a thing or two. Good food next door check this place out if you're in the area. They have like a million great beers on tap.. I may have exaggerated a little lol but it's bomb", "author": "Flower F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-17", "description": "Kilowatt is a local favorite. It's always full of Mission locals during the week and it's a popular destination for locals all over the city. It's a typical dive bar, no frills...which is probably why a lot of people like it. There are also a bunch of other dive bars and amazing restaurants on this street so it's a perfect destination for some bar hopping. \n\nOn the weekends they open the back room and they have dancing and a DJ and it's really fun. People go all out and get down. Good spot to take a date.\n\nOverall, great dive bar option.", "author": "Juliet S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-09", "description": "The bikers and hipsters which fill the space between the cute-dog-picture-covered walls of this fine establishment are going to have a West-Side-Story-esque Sharks and Jets rumble one of these days.\n\nAnd I hope to god I'm there for it... and that I've already give them my $10 and left my ID for one of the two sets of darts.\n\nNote: DO NOT FORGET ID and $10 when you return the darts. the drinks are strong.\n\nfavorite sign above the bar I want to \"borrow\": \"you're in the mission\"", "author": "Mike V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-29", "description": "One of the stalwarts of the Mission 'Dive Bar' scene the Kilowatt has watched as their neighbors have changed names, and styles, over the years.  Their formula is simple Beer, Pool, Sports....I like all 3 so this place is a winner!\nI'll be back soon!", "author": "Jim P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-17", "description": "To the person that just tagged the bartender as racist! He never once said the word 'gay' and in the event that you played the whole ace of base album, it was cut off due to the entire bar complaining about the music. Please be honest in your reviews cause calling out 'racist' is just awful. This bar and bartender are far from that.... I was here the whole time and you guys were just plain rude!", "author": "Rebecca R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-24", "description": "Cheap beers (for SF at least), good vibe, most Portland,Oregon esque bar I've been able to find. A good place to spend your hard earned cash (only)", "author": "Abigail S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-26", "description": "Place was on a street with lots of bars, but this one was bumpin! Loved the pools tables. Vibe was weird though. Everyone was pretty hammered and no one seemed friendly to us strangers lol. But otherwise was a pretty cool place. Clean and very warm inside. Jukebox...good prices.", "author": "Gee R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-30", "description": "So many great memories here, this place is a gem, I've been here a hundred times in the past decade+.  \n\nLike the quintessential Mission dive bar, it's unpretentious, has a few canines at times, serves strong drinks and good beer, and is distinctly lacking in decor.  Bartenders are no nonsense but friendly enough, just be ready to order end don't ask for something fancy or stupid and you'll be alright.  \n\nI love Kilowatt.", "author": "Saminda W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-01-18", "description": "I'm 26 years old. I showed up to this bar at 8:30 pm or so on Saturday night, 1/14. I was not drunk (I had just come from a comedy show) and was only hoping to meet an old friend for a beer before heading home. I had TWO forms of valid identification on me AND one expired ID (that had expired a few months prior). The bartender did not let me in, claiming that I was using someone else's ID (despite having two separate forms of ID that also matched the name on my credit cards).  Yes, my ID photo was taken when I was 17 years old. I still have never had a problem like that before in my life, especially with multiple forms of identification for confirmation. This was a very insulting experience and I will not be coming back.", "author": "Eliot W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-23", "description": "I love this place for its raised darts area in the back -- darts are available from the bar with an ID and a $10 deposit.\n\nThis bar also features my favorite pinball machine of all time - themed after one of the best video games of all time: Rollercoaster Tycoon.", "author": "Jack H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-02-20", "description": "Watch out for racist bouncer. While guy with dreads, he's hard to miss. My friends and I just tried to get in and he says their IDs look like they're 'Fresh off the Boat.' Not okay", "author": "Casey T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-04", "description": "Definitely a solid Mission bar.  So glad that we decided to stop by Kilowatt.\n\nKilowatt is definitely a large bar, with room for pool tables, pinball machines, darts, tables and stools all around.  And on NYE, definitely accommodated a good number of people.  The vibe is very diverse here - you'll get people from different walks of life enjoying themselves on VERY well priced drinks (always a huge plus).  From what I remember, our beers (of which they have a very nice selection) and gin & tonics came out to about $5 each, which really surprised our group.  And the bartenders are super nice! Will definitely be making it back to Kilowatt.", "author": "Cindy L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-28", "description": "Props to my homegirl Jaime H. for finding this little spot for watching Football on Sunday afternoons. They play all the football games, plus there was some baseball action going on this past weekend too. GO GIANTS! \n\nThe drinks were between $4 and 6, they let you bring in outside food and the bartenders and patrons are friendly - even if they are rooting for the opposite team. The overall vibe was fun and positive, we had a blast and were there for awhile.\n\nDive right in, the bar is fun....", "author": "Rebekah T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-30", "description": "CASH ONLY  - ATM is at the front of this bar.\n\none of the few places you can watch sports in the mission. we were trying to watch the Blackhawks Red Wings game, and realized this is a red wings bar (but go Hawks). although we arrived after the game ended, it's still a good tip to know.\n\nthe roller coaster tycoon pinball machine was broken, so they gave us our 75 cents back. that was a nice touch for a busy saturday night.\n\nI had a great time here, and will definitely be back.", "author": "Kailey O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-27", "description": "I came here for a drink with a friend after having dinner at Pakwan, and...I think this may be one of my new favorite bars!\n\nTip: Cash only (as are most places in the Mission) so make sure to bring your dollar bills!\n\nKilowatt is a dive bar but full of many surprises - two of which being darts and erotic photo hunt. This is where I learned to play darts for the first time and it was SO FUN! Specifically, I learned how to play cricket. I can't wait to play it again. They don't charge a fee for playing darts - you just have to give them your ID and a $10 deposit, which you will get back once you return the darts.\n\nThey also have a game machine which consists of an entire erotic section. I love me some good photo hunt, so when my friend said that there was such a thing as erotic photo hunt, I just had to try it for myself. And guess what? The machine at Kilowatt had it. So funny. Definitely a good drinking game. It's all photos from like the '80s so you really don't need to worry about the pictures...although some do get distracting. LOL. And you can pick from males or females. \n\nKilowatt also has pool tables, although we didn't get around to playing pool, and two arcade style game machines as well. I think one was pinball...and not sure what the other was cause I was focused on my dart game (pst...which I won...maybe that's why I had so much fun haha).\n\nLove the mix of entertainment and pretty affordable drinks. Wee!!", "author": "Jennifer T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-07", "description": "One of my favorite things to do is just go across 16th Street between Kilowatt and Gestalt until I get drunk enough to need to grab a burrito off MIssion Street before going home. \n\nSeriously, it's one of my very favorite things in this world.\nI don't know if i'll ever get sick of it.\n\nEven if you're not making a night out of Kilowatt, it's the single best bar to start your night in the Mission. The single best.\n\nIt's a dive bar without any pretenses. It's cash only because duh, you're in the mission. Hence the sign above the bar.\n\nGetting a table with your friends really isn't too difficult and there's pool and pin ball if the people your friends brought along bore you. I can't think of anything not to love about this place.", "author": "K M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-09", "description": "Next to the last stop on our slow, boozy crawl through The Mission.\n\nWhen we walked in, the fun hit us like a slap in the face.\n\nI wish we had shown up earlier!\n\nEven though it was packed in this large space, I managed to wrangle a table and chairs for our group of 8.\n\nWe chilled out to some good music, while we watched people playing pool on the main floor and darts in a small, raised alcove in the back of the bar.\n\nThey have an intense beer selection that could please anyone, and would the cheap prices.\n\nAdd this place to your list of bars to hit up on 16th Street!", "author": "Diana V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-29", "description": "Kilowatt sits on an eccentric corner amongst many other bars with crowds, loud music and near dark alley ways. The street lights on Mission paved a carpet to lead you inside. \n\nOutside are those hanging out, doing drunk people things, smoking a cloud of happiness and the guy who checks your id, seems a little gone. No trouble getting inside.\n\nLoud music, but I love the retro feeling of this bar! There were tables everywhere, crowded and wet. Pool tables were in the back, alongside with a PacMan machine. At the bar, it took about five minutes for us to squeeze and grab the bartenders attentions, but he dove in took our orders and made me happy. I had the stronger vodka cran in a while, it was literally all vodka and a splash a cran for possible the pink color. \n\nIt's cash only but atm outside. They serve about over 50+tap beers and they're only 4$. It's a chill bar to hang out at. The best part is the retro cash register! It was old school and that really completed everything for me. \n\nLast call was exactly at 130am for us on a Saturday night. They're serious about it, closing doors and I barely got out! \n\nGreat place to be. Loud music. Good people. Great bartenders. And pool tables! Parking is a slight bitch, but it's alright. Mission, I take my hat off to you.", "author": "Winnie G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-20", "description": "Great!!! But does not allow dogs anymore. Please note :) I had to find a new place because of the pooch. But it's still a great bar", "author": "Carlee M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-09", "description": "Awesome place. Walked in and was able to get a super fast. Cheap drinks and amazing service. I willl definitely be back!", "author": "Michelle M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-29", "description": "Standard dive bar - Came here to kill some time with friends during happy hour and played a couple rounds of pool. Good draft selection at good prices!", "author": "Hannie E."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-03-16", "description": "Part of me has dreaded writing this review. Kilowatt is, after all, the reason I couldn't stand to look at, or even think about, liquor for a good month, and the reason I didn't visit Mission again for another five. Or, well, I suppose the real reason is that I did a poor job of holding my liquor, but Kilowatt was certainly the enabling factor here!\n\nDropping by with the birthday girl after a dinner at Morac, I was shocked by how insanely packed the place was. There was no seating available, and even standing room was limited - being in a wheelchair, and thus shorter, also proved unfortunate, as many a person ended up tripping over me as they waded their way through the masses. Eventually, as I was feeling inclined to hightail out of there, two booths opened up in the corner.\n\nThe drinks here are inexpensive though, and their shots are actually almost double the standard size. And... that's about all I remember, because once midnight hit, and my sixth or seventh double shot disappeared down my throat, so did a 11 hour chunk of my memory (I kid you not), that involved (from what I could piece together from friends) my disappearance, losing my phone (which I later found was picked up by a crackhead and sold to someone I can only assume was a prostitute), and somehow managing to push my way back to SOMA, almost two miles away, through Mission, in the early hours of the morning.\n\nNow, the low rating has nothing to do with this ridiculous experience, no no. If anything, it's probably one of the best, and scariest, stories of excessive drinking I have. The real reason is simply how obscenely packed this place gets - if not for that, I'd easily give these guys a three. But, as it is, I can't see myself coming back by choice, as I much prefer lounging around somewhere a bit less crowded, with drinks that are a bit fancier.", "author": "Johnny W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-06-04", "description": "The people at the door made racist comments and were extremely rude just because I forgot to leave my bear bottle inside. You just can't have a person with zero manner at such a place.", "author": "Basheer S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-06", "description": "Thank god for Kilowatt.\n\nI've lived in the Mission for over four years and I miss how grungy 16th street bars used to be. Slowly the hipsters, bikers, and neighborhood crew has been displaced by a crowd you'd expect to see in the Marina. (Btw, no offense meant to our city's Marina residents. It's a beautiful neighborhood and has some great local businesses, but I don't necessarily want that \"scene\" everywhere.) Anyway, before I distress too far (too late, right?), I'm thankful that Kilowatt has remained largely the same.\n\nIt's a large bar with a good mix of booths and stand up tables near the entrance, and opens up to a couple pool tables and an elevated dart board area in the back. The drinks are cheap, the bartenders are nice, and the regulars are generally great conversation. They've got an ample amount of televisions, so while this isn't a \"sports bar\", you could definitely watch the game there. They've also got a Naked Photo Hunt console at the far end of the bar, which is the BEST group bar game next to Big Buck Hunter.", "author": "Madhu P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-06-05", "description": "I have never seen such bigotry, misogyny, xenophobia, and hatred at an otherwise \"chill\" place. The bouncer Mike made sneering remarks that I should teach my fiance \"how to be American.\" I calmly said he needs to be more polite to us, but it got worse. \n\nHe then led people standing outside the door to heckle our group, saying \"this is America,\" \"go home,\" etc. One person threated a member of our group, saying \"you don't know what I can do to you. I have a lawyer... I can kill you.\" Several peole tried to grab belongings from a member of our group. Another person standing next to the bouncer said \"take your bitch before I take her instead\" to a female member of our group. People followed us down the street telling us to \"go home.\"\n\nThe bouncer did nothing to control the group harrassment. It is the bouncer's job to keep order at the door, not harass and encourage intimidation of patrons. I'm incredibly disappointed by this hateful, xenophobic behavior tolerated by this business. I hope people will avoid going here while Mike is there.", "author": "Laura G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-03-29", "description": "We couldn't get inside because they don't allow dogs. Then I see here in Yelp that they have a wall with dogs' pics", "author": "Gerson P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-03", "description": "Killowatt is in the heart of the Mission, and offers a HUGE selection of moderately priced drafts (~$4) and pitchers (~$15). The place is a pretty big draw area with its deep seating, pool tables, TVs and music. \n\nIt gets a good crowd going in the evening and is a great stop after a great burrito in the area", "author": "Vince E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-27", "description": "Great bar! \nMy first time here I went to visit with an old friend and it was a fun laid back atmosphere.", "author": "Laurel C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-05", "description": "I was initially going to giordano's to watch the giants play game 6 of the world series, but since my friends and I came late, we couldn't get a table.  We were standing in line for a while when this guy  told us there's some place down the street letting people in.\n\nI went to scope it out and sure enough, everyone was free to come and go in Kilowatt.  Their beer selection was pretty good and the prices could not be beat (I got three beers and it came out to $12).\n\nI was also a fan of the chill atmosphere.  There were people who were bringing in pizza (from next door?) and just eating it and watching the game.  The bartenders were super nice and attentive.  I felt like I was served in a short amount of time even though it was a mad house in there.  \n\nThe other customers also seemed to be very friendly people.  Perhaps it was the mood of the city celebrating Giants in the world series again, but some random stranger bought me a drink (and not in a weird creepy way, but in a friendly way).\n\nWill definitely come back when it's not so packed.", "author": "Carrie L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-09", "description": "Dive bar with open dog policy! All the random nights I've come here, I've always managed to see 1-2 dogs lurking about~ which is the BEST. I also love that they have a wall FULL of dog portraits. \n\nDecent prices for drinks, pool tables, and pac man machine in the back. Only wish that there's more seating when it gets too crowded. \n\nTLDR: such doge, much dive.", "author": "Tiffany S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-12-30", "description": "Sweet  spot mellow vibes..just not really anything special..grab a drink and go place.", "author": "Chandler P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-22", "description": "Sundays are the time to be here! Such a great crowd with understanding bartenders. The patrons are from all over and have their personal alliances to football teams from all over the country. It is a fun time. \n\nFantastic dive bar. Sunday home. Affordable draught beer!\n\nNotes: CASH ONLY. Staff does allow outside food if you purchase drinks from them! There are awesome carryout places nearby.", "author": "Lauren A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-18", "description": "Kilowatt is a pretty neat place if you come here during down time. Great beer selection and billiard & darts available to play. \n\nThings to know:\n1) You need cash - Wells Fargo and Bank of America are on 16th and Mission\n2) $1 to play pool - they to get the pool table closest to the door - the second one is close to the wall so its sometimes hard to play off of it\n3) Bring your food from Patawan and have yourself some dinner and games\n4) Happy hour is from 4-7 pm\n\nI really enjoy this place bc it has a great mixture of locals and people from outside the mission. Place is a little dark but doesn't hurt the place. I recommend this place if you are in this area!", "author": "Pablo P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-19", "description": "nice local atmosphere. Lots of beer option and everyone was pretty laid back.", "author": "Katie R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-09-30", "description": "Came here to hang out with my birthday girl YuJin for her pre-birthday partay and had a blast! I actually didn't shoot any pool because I'm so rusty and I really don't want to get back into it again (addictive personality) but I certainly enjoyed watching others play! \n\nThere were some old schoolers here, and everyone seemed to know each other. Although I was just an observer, many of the players were really friendly and talked to me about their experiences, and who plays what kind of games with what kind of an attitude (sneak-attacks, assholish, cry-baby, brutes, etc.). \n\nI think we were the only three Asian girls here (and one lady plays for the gal's team) so Yuj and I got our fair share of random, Asian-fetishist men using cheeseball lines to talk to us. Okay, that's unfair. Maybe they just thought we'd make good company, who knows. But they weren't \"just being nice\" because they were clearly using the tried-and-true lines used by playas and playa-wannabes alike. Appreciate the courage and gesture, fellas, but I have a man and so does Yuj.\n\nI'd definitely come back to shoot some pool the next time I'm back in the area. If I lived up north, I'd definitely make this a place I come to at least once or twice a month just to see the nice people, drink some beers, and kick some ass. ;) But I have to admit ... I'd most likely catch a ride here with a friend or take a taxi because FINDING PARKING WAS RIDICULOUSLY HARD! This whole area is POPPIN' on weekends so I think we spent a good 30 minutes circling around looking for parking. Ugh.\n\nBut all in all, wonderful bar, and awesome pool hall. Lovely people of Kilowatt -- see you again soon! :)", "author": "Stace K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-06-04", "description": "This place was absolutely terrible. Walked in to watch the hockey game with my wife and immediately was taken back. It was evident that we weren't welcome and we sat right in front of the bartender and got not even an acknowledgement. There was a table of jerks really being nasty. Went to Giordano Bros and had an excellent time. We were the only two Lightning fans with roughly 20 Hawks fans but everyone had a great time. I'll spend my money where it's wanted. Hope your bar goes bankrupt.", "author": "Nate C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-12", "description": "Decent beer selection. Plenty of space. \n\nSince there's a wait at the Monk's Kettle, get over it and hit up Kilowatt.", "author": "Marcus C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-06", "description": "I felt old here LOL.  Drunk 20-year old somethings chatting me up while waiting for my beer.  Good times, brah.\n\nBeer selection, excellent.  \n\nAnd how can one not like the totally cheesy, retro neon sign out front?\n\nThen Slayer came on the jukebox.  My buddy and I just looked at each other, nodded and smiled.\n\nI love me a good dive bar; Kilowatt, I love you.", "author": "Chris B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-02-18", "description": "Kilowatt can suck my taint. Full disclosure, this is based on my personal experience on a single night at this bar, but, regardless, it does not change my opinion that Kilowatt is one giant gooch licker.\n\nI was there on a Saturday night and good God did I want to die from the sweat factor. But my excessive perspiration wasn't even the worst part. Kilowatt has two pool tables that take up a large part of their standing room. I'm all for playing a nice game of pool while I'm drinking but there was practically nowhere else to stand except within a foot of those pool tables. Every step I took, I immediately had to take another because each step landed me directly in the flight path of a different person. I felt like I was constantly in someone's crosshairs and I needed to move quickly lest I be shot. Better yet, I felt like I was playing that hot lava game that kids play where you have to constantly move your feet to avoid the lava melting your feet off. One extremely pleasant (*eye roll*) goth woman elbowed me because I momentarily placed my body in a spot she wanted to stand so that she could hit her cue ball. Look, I get it, you're trying to play pool and I'm in your way, but you have just witnessed me spend the last 20 minutes doing a constant 2-step all around the bar trying to get out of every single person's way. Give me a break.\n\nThe one upside, which turned out to be a double-edged sword, was that the drinks are stroooooong. My dude-bro friend ordered me a vodka cran for my good ol' b-day and I swear that drink was so close to being clear that you would have thought it was straight vodka with an inkling of a splash of something pink. Normally, this is a fantastic thing, but considering I wanted to get out of the Grundle Cave as quickly as possible, twas very hard to chug my very strong drink. Oh woe is me.", "author": "Stephenie S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-17", "description": "Super reasonable prices on beer!  During happy hour (until 7 on Saturday) just about all the pints were $3.50.  They had several craft beer options, including Stone, Bear Republic, New Belgium.\n\nDog friendly.\n\nNo food, but you can bring food in.\n\nTVs for sports.\n\nCash only, so get ready for that annoyance.", "author": "Leslie G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-03-15", "description": "The pool-playing crowd was a bit uninclusive for my tastes. Kinda felt like the regulars were in control of things. Very hipster crowd.\n\nI'd like to come back here on a not Sunday night and give it a better try. For now, I'll keep it in mind.\n\nalso, yay darts!", "author": "Conrad B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-10-14", "description": "Well, this is a straight up dive bar with booths you can chill in.\n\nThe bartenders were nice and it's in a good location in the Mission.\n\nThey had some dark beer I really enjoyed but I forgot the name.", "author": "Marlon T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-29", "description": "I love it here, the doorman on Fridays is super nice. The diverse seating arrangements are awesome, there's booths and tall tables behind the bar seating and what's awesome is that the noise level depends on where you're seated so you can go there for an intimate talk at a booth..or rage it out with cards,dominoes,beers, drinks...\nAs for the entertainment they offer they have 2 pool tables that are usually busy on Sundays during certain times they're $.50. There are also darts and a pinball machine in the back.. \nThey have a great beer selection written out on a blackboard on the wall near the ceiling...you can see a lot of the taps though when at the bar...and so far the service has always been really good :)", "author": "Mar L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-07-15", "description": "Kilowatt is awesome. Cheap, strong drinks, and a friendly bartender. OH and they have PAC MAN. \n\nI wish they had named it \"Gigawatt\" so I could actually have a reason to tell people we're at \"1.21 GIGAWATTS?!?!\" when they call me. Because that's what I say, and it doesn't make any sense. Hooray.", "author": "Emily D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-02-26", "description": "favorite bar in the city hands down!! \n\nThe bartenders are awesome, they don't remember my name yet but I take that as a personal challenge. Free pool on Sundays (shh don't come, we're busy playing), cash only, good beer and cider. AWESOME bloodymary's on Sundays too. Also, I like that I can get trashed, go to Deja Vu for some pizza and bring it back into the bar with no problems. \n\nlove love love this place. douches, please don't come here. kthanks.", "author": "Kati Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-30", "description": "One of my very favorite bars in town.  All the bartenders are more than welcoming.  They even manage to remember my name and drink.  Excellent drink prices. \n\nGreat place to watch a football game, shoot a game of pool or play darts.  Actually, this is one of the few places to play darts where the area is blocked off, preventing drunks from accidentally walking into the path of a flying dart. \n\nDuring daylight hours it is easy to find a seat and the clientele is laid back.  \n\nIt does have the typical problem of being filled with douches after 9pm though.  It seems every bar has that problem lately.", "author": "Towanda S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-07", "description": "So many tattoos, so many beards! This place gets busy!\nThere's some pool tables and darts and a lot of onlookers for those games of skill. Didn't feel that clean here but the Mission's not supposed to be a clean place. My drink was okay.\nSome people were crazy pumped up here. My favorite thing was the elevated area towards the back so you can look out onto the whole scene, very cool.\nCheers to the the guy with the dog tat who got me my vodka and tonic, you're a cool dude!", "author": "Lizzy M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-07", "description": "I love Kilowatt.  Why?  Well, as a bar infamous for Packers fans, where else would you want to watch the 49ers beat the Packers?  The sadness is palpable by the end of the game.  That alone is awesome.  Especially during the playoff game in January, 2014, when one super drunk girl kept yelling at the screen and Skrillex the female was losing it and arguing with Niner fans.  Aside from enjoying watching the hopes and dreams of Packers fans get shattered, there are a variety of reasons I enjoy this place.  \n\n1.  They let you bring in outside food.  If you are ordering drinks, they don't care, and given that the Mission has a killer selection of food, this makes it a great place to watch a game or hang out.  \n2.  Darts AND pool.  Plus they throw a television up in that area for games.\n3.  Televisions EVERYWHERE.  Nothing is worse than being stuck trying to find a screen you can squeeze your way closer to so you can see a game.\n4.  They are the most dog friendly bar in the city.  Any Sunday, you are likely to find a variety of dogs hanging out, some meandering the place by themselves, all super friendly.  If you don't love that, you should ignore all of my reviews, because you have no soul.\n\nIt is cash only, but given how hectic sports bars can be during playoffs and such, that seems like a pretty solid policy.", "author": "Dick S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-07", "description": "Inexpensive drinks, well made drinks, plenty of seating room, and dog friendly? Sounds like the type of bar I'd put myself in with friends!\n\nCame here with some friends the other night, the place was starting to get packed (but still comfortable), we managed to grab drinks quickly, and found an entire hi-top table to sit at. Score!\n\nI liked the decor, it was dimly lit, had a good dive bar feel, and people seemed friendly. They also have tv's all over and a dart board in the back that you can use for free, however you have to put a small deposit of $10 down if you would like to use it. Totally makes sense, considering I've been to other places that have busted darts and then it makes for crooked dart throwing, lol.  I would like to bring my dog in, but would avoid doing so on busy and weekend nights because it gets a bit packed later on. Also as an FYI, it's cash only, so hit up an ATM before you stop inside!", "author": "Akvile D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-28", "description": "This place has a ton of attractive 20 something year olds. So if you're one of them then you should be fine.", "author": "Andrew M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-08", "description": "Chill place. Always one of our stops when we go bar hoping in the mission. Can get really crowded on the weekends, but that's probably because of the free birthday bottle of champagne that they give out. Yay!! Free champagne!", "author": "Cassie M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-05-02", "description": "I gots to give it up for the best pool spot in the Mish. \n\nTwo tables, but two very nice tables for a bar. Too bad the tables attract the \"I'm way better than you at pool\" douche bags like flies to a pile of Oprah's shit (I assume flies like to eat expensive shit). Very common hang out for random dudes who stand around by themselves getting drunk, hitting on uninterested chicks, whooping ass at pool. Shout out to Evy for claiming lesbo status to shake that one guy off. He didn't really care though.\n\nBesides the aforementioned douche baggery, it's got a good pool hall-ish vibe. People are generally pretty good without being phenomenal so you can still compete even if you are just OK. Roll through on a Fri/Sat though and your ass is gonna be watching for a long time before you're up.\n\nAnytime I'm in this neck of the woods with a jonsin' for some pool, Kilowatt pops to mind first. That makes me a fan I'd say. The beer selection is on point too.", "author": "Justin N."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-05-16", "description": "First  time here. Good vibe . N super chill. A little mad that i couldn't  have my service dog inside, kinda unfair ..that is all", "author": "Audrey R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-08", "description": "This is a dog friendly bar! Bartenders are nice. Drinks were cheap!! Went when it was slow and need to charge my phone. The bartender let us charge it behind the counter. Love it here!!", "author": "Christine M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-11-19", "description": "DIVE BAR FOR PEOPLE ... AND DOGS.\n\ncame here with a few friends for SF Giants game #5. Despite the rowdy overpacked bar due to the festivities and excitement, it was such a great atmosphere. wasn't much to see as we were crammed to our tables in the back but TV was visible in all angle, good stuff. Bar serves was fast. Unfortunately NO FOOD but you can bring your own food in. Mission is food haven so all works well. \n\nThe most intersting thing would be dogs. Dogs outside, dogs inside. I felt like \"karma\" was my own dog as she walked around the bar like a regular. This is a bit strange, but i love that about this place. \n\nOH and they server Pear Cider!!!!!!", "author": "Jane A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-01", "description": "What else should I say: it's a great dive bar in Mission. Good selection of beers, well-mixed drinks without being too fancy. Grab a beer and play some pool. That's what a bar should be like.", "author": "Sebastian F."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-10-23", "description": "I'm from Washington state. They wouldn't let me in because they are ignorant of what licenses in other states look like and think if it doesn't look like a California license that it's fake. Please train your staff better.", "author": "Emma Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-02", "description": "Gotta love a good dive bar with plenty of TVs for sports viewing, darts, pool, and tons of seating. We were actually very surprised with the size of the bar, huge on the inside! Cheap, great/friendly crowd, nice beer on tap. CASH ONLY. Definitely will return.", "author": "Wendy K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-04-07", "description": "Things Kilowatt has going for it: good beer selection, cheap.\n\nThings going against it: insanely loud, pounding, unappealing music, uncomfortably crowded despite being a large space.\n\nI only went here once, so it's possible I just caught it on a bad night, but I really had no desire to go back again.", "author": "Stacey L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-23", "description": "I'll try to keep it as short as possible.\n\nSUPER CHEAP BOOZE.\n\nFriendly staff/people.\n\nAlcoholocaust.\n\nI got destroyed.", "author": "Gene P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-28", "description": "Eclectic customers, with or with out pets.  Good choice of brews, friendly staff, pool, darts, games on TVs.  What more could be wanted", "author": "Mike S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-11-21", "description": "I used to really like this place, but it seems that the magic has faded.\n\nI came here on a rainy Saturday night to celebrate my birthday. It was packed, but the five of us managed to find a table near the back. The pool players were really aggressive and almost hit my friends in the head a few times. No one bothered to say sorry, even though we were tucked as far back as we could go. \n\nThe male bartender kind of ignored us for a while, then made our drinks really weak. I drank a Long Island Iced Tea and barely felt anything, even though I have a low tolerance. If I pay $9 for a drink, I want it to wreck me a bit.\n\nThere was also this awful smell all night long, like rotting eggs. It was on and off, but when it was in the air, it was pretty rank. Maybe it was a gas leak? Or the sewer? Needless to say, we decided to bail early and head across the street to find another, less smelly, bar.", "author": "Brandi W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-22", "description": "Its become my Niner bar. I've been here before on a regular bar night and I didn't even realize they had televisions!!! Then one Sunday I walked into Kilowatt looking for a bar not overflowing with Steeler's fans and saw that it had a bunch of dudes looking skyward \n\nNow...I love love love football. I also love love love dudes who love football. There is no better place to get a friendly mix of both on a Sunday. \n\nBartenders are friendly and the crowds are quick to cheer but not arrogant fans, nor is there any drama between fans. I dig it. \n\nCocktail of choice: On a Sunday - Bloody Mary - a nice spicy kick.", "author": "Jay H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-12-19", "description": "While I appreciate the wall of dog photos and the apparent dog-friendliness of this bar, Billy Joel the Dog would never be seen here.\n\nHere are some things I don't appreciate:\n\n1. 2 massive pool tables in the middle of the bar.  Your bar is in the Mission, which has become a hot spot as of late.  Why would you waste valuable real estate in the center of the bar with pool tables?  Sure they are fun if you're in to pool, but pool is a 2 person game.  The other 98% of the people in your bar are crammed against walls because for some reason you are popular and you care more about pool players than the rest of your clientele.\n\n2. Dart platform area- another HUGE waste of space.  Yes, darts are also fun.  But when you are in a location that leads to your bar often being packed (I've only been once, but it was a rainy Friday- I can't begin to imagine how crowded this place would be when it wasn't raining), you can waste this space for sharp objects.  Put some tables up here.  Much better use of space.", "author": "Nora S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-18", "description": "I've been on a streak of going to good bars in the Mission, and this one can definitely be added to the list.  Really roomy, great for happy hour, pinball, a pool table, and darts!  What more can you ask for.  Great place.", "author": "Mel G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-27", "description": "This is one of my go-to bars in the Mission.\nWhy? Cause I remember the name (I suck at names)? Cause I remember the location? Cause it's the first bar I pass by once I get off the bus from my house?\n\nOr maybe just because it's a chill bar, where you can watch the games, play pool, hang out and people watch. Oh and because I have good memories of this bar as I watched 2 Giants World Series (2010) games here. \n\nDrinks are cheap & strong. Bartenders are friendly if you are friendly.\n\nWhatever reason, I like this bar.", "author": "Helen D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-11-20", "description": "I guess there's a reason I don't go out so much anymore.  i am basically becoming an old man.  \n\nWe came on Friday around 11 and it was crazy crowded, to the point that there was really no where to stand.  We tried to stand near both the pool table and the darts, but the serious game players were not having it.  The bar wastes a ton of space on the 2 pool tables and big dart area.  \n\nI left after about 30 min because I was feeling claustrophobic and annoyed.", "author": "Julia D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-07-27", "description": "If you took a dive bar and gave it a bunch of Extenze pills to make it \"bigger\" then you'd get Kilowatt. \n\nTwo or three beers on tap at a regular dive instantly enlarges to about 40 different brew choices here. The usually empty pool table at any other dive somehow has non-stop male on male action on it and I gotta put my name on a board that already has 7 people in front of me just to get to play?\n\nA solid neighborhood bar that's well equipped to handle large and numerous groups. Our group of 5 was comfortable and the  refreshing pitcher of Mothership wit was ($14). And No, I'm not ashamed to say that. \n\nMan, I need to stop watching these late night infomercials. 3.5 stars.", "author": "Earl G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-08-13", "description": "Chill vibe but bartenders have some attitude. They don't really promote dancing like the rest of the bars in the area this is more just stand up and drink or talk. I'd come back for the vibe but that's about it", "author": "Alonzo T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-03", "description": "Pool tables (more than 1), plenty of tables to sit at, good music, friendly faces and cheap strong drinks! Can't ask for anything more!  But it gets crowded on the weekends and the music is loud so it can be super hard to hold a conversation with your friends.\n\nParking bites but this is in the Mission so might as well think you'll have a 20% chance of finding parking here on a Friday or Saturday night beFore you get here and just take BART! Save yourself some gas, go green and save the world from excessive pollution (if you got one of them \"older models\" that's not a \"green\" vehicle)!", "author": "Mercy D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-06-23", "description": "We walked into Kilowatt after leaving Zeitgeist full of cheeseburgers, nicely buzzed and seeking shelter from the cold wind. We were greeted with plenty of space and the cutest bull terrier I've ever seen. We picked a booth and ordered and ordered and ordered drinks to our heart's content. Meanwhile, my ears were treated to \"Steppin' Stone\" from Minor Threat and \"Holiday in Cambodia.\" I'm digging this place like whoa.\n\nAs I walked to the bathroom I discovered two more of the cutest dogs ever (when I go on vacation, I become obsessed with strangers' dogs and fawn over them because I miss mine). Kate's, Golden Gate Park, Zeitgeist and now this place? This has to be the best day ever!\n\nBut wait, it gets better still - I discovered the jukebox was full of gems like old Cure and Maiden. I promptly played \"Hallowed\" to the delight of the entire bar. An hour or so in, we looked up to find the place was packed. And not only had we still not heard the brunt of our awesome songs, crap had been playing for the last 20 minutes. So we decided to head ...somewhere else where we wouldn't have seats but the music would be better. \n\nBut Kilowatt was the perfect segue from Zeitgeist to Elbo Room. And our adventure continued.", "author": "Lauren V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-03", "description": "This is most def a dive.  I have been here a few times and the best times are when I am in a larger group of friends.  There are lots of interesting characters of which most seem to be regulars because they know the bartenders.  I have had interesting conversations with complete strangers.  \n\nThey serve cider... so I am cool with that.  People tend to snub the poor cider. But it is so tasty!\n\nThe people that hang out here are pretty cool... calm... no issues type of crowd. I never feel like fights might break out or anything of the sort. \n\nIt gets crowded and loud later at night, but that just means there are more people for you people watch... one of my favorite sports at bars. ;-)", "author": "Amelia M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-05-18", "description": "Busy! On a Friday night, it's fairly packed and people are not ashamed to push their way through. It's not super comfortable and part of our party left for the bar across the street. The pool tables in the back take up so much room, standing room is a little limited. The bartenders seemed nice but took a long time to get drinks out- they were probably really backed up. I feel like I've been to this bar in a Mission dive crawl before- but those details are foggy, the place does have a familiar feel to it.", "author": "Naomi K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-05", "description": "pool tables, killer happy hour, great beer list, generally uncrowded on weeknights. TVs for sport or political things. cash only.\n\nget a burrito nearby and chill in a booth.", "author": "Miranda E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-18", "description": "I'm loving Kilowatt. I've been here in the evenings a sparodic number of times throughout the years, but recently it's become my favorite happy hour spot in The Mission.\n\nCheap beer, great cheap happy hour specials, laid back vibe. And Kilowatt has pool tables and games! Kilowatt is divey and laid back but not gross, fun without being suffocating. Come one, come all, drink all the beer you can handle.\n\nAfter leaving here, I always feel a little more chill.", "author": "Denise B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-02-11", "description": "To the best of my guesstimation, San Diego and San Francisco share sister communities. For instance:\n\nSan Francisco's Marina=San Diego's Pacific Beach. Nice surroundings, but tons of douche bags that hang/live there.\n\nSan Francisco's Lower Haight=San Diego's Ocean Beach. Ton's of hippies, though the Haight has much more history with the Grateful Dead and all....\n\nSan Francisco's Mission=San Diego's North Park. Hipsters galore and very few places that accept credit cards.\n\nEven though I'm a bit frightened every time I step foot into any bar in the Mission, it's as close to my vibe as I'll ever find in the Bay Area. I'm a sucker for a dark, slightly dirty dive bar... and there's plenty of 'em between Potrero and The Castro. \n\nA telling sign that you're in a legit dive bar is the bathroom. If there's no toilet paper in the stall, you know you're in good hands. Just sayin'. You shouldn't be shittin' in a Mission dive anyway....\n\nThe one thing I always forget about is the lack of credit card swipers in this area of town. Personally, I think it's more progressive to have credit cards, as opposed to cash... but the community of bars in the Mission doesn't care what I think at all. If you don't have greenbacks, you're not getting a drink. It's just the way it is. And even though I never have money with me, I'm OK with it. In fact, there's a sign above the bar here that says:\n\n\"YOU'RE IN THE MISSION... CASH ONLY. ATM UP FRONT.\"\n\nEven though I looked like a total kook because I didn't notice the sign until AFTER I asked if they accepted credit cards... I guess you can't get more direct than that.\n\nFor a dive, it's a big joint. I'd guess you could pack in 200+ people easily. There are a few pool tables, a few booths... and like most of the places in this neighborhood, dogs are welcome inside. I just wish the dog owners would put their pets through obedience school before they unleash them in an environment like a bar. There were some rough pups who really shouldn't have left the back yard... but what are you gonna do?", "author": "Ruggy J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-02-03", "description": "\"You're in the mission... cash only... ATM up front\" reads the sign behind the long wooden bar.\n\nMy mind responded with the following: \"You're just another hipster dive bar in the mission, get over yourself.\"\n\nThis would have been kind of a knee jerk reaction though, as the place really wasn't as pretentious as I was expecting it to be.  I rolled in with a couple of hooligan cohorts, the last of our bar-stops for the night, to grab some late night hooch and kick it.  The scene was dark, dog-friendly, and divey.  The prices were not all that cheap,  but I guess I'm in San Fran, so whatever. \n\nThe tender immediately carded my friends and I, even though none of us look remotely near 21, which was kind of annoying, but again, whatever.  The beer selection is decent, the pac man machine looks well used, and a bike parked up on the mezzanine (and I use that term loosely) was amazingly NOT a fixie, so I guess that they do allow some normies inside.\n\nUs normies enjoyed our Stone Pale Ales and a rousing game of travel pigmania as we helped to keep the two dogs in the bar from viciously attacking each other. It was somewhat surreal at moments.  \n\nAll in all, there really doesn't seem to be anything special about this place. it's kind of a shithole but it's not cheap. There's no real character. It's not all that divey. Again, whatever. \n\n3 stars, I guess.", "author": "Don B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-10-25", "description": "Cool dive bar. Stick with either beer or a simple drink like vodka/tonic.", "author": "Dilly M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-11-13", "description": "Decent bar. \nCool pool tables and dogs are allowed inside!! \nHowever, floors are terribly terribly sticky and the bar is always so packed that it makes me want to not get a drink. \nGood location, decent prices, nice beer selection (all around $5) \n\nCame here with a friend on her birthday, and the bartender gave us a bottle of champagne. How fun!", "author": "Taryn S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-06", "description": "I don't remember the 1st time I was here.  One time I almost don't remember was here was with Rebekah T and Jaime H and some other people I can't remember offhand and apparently I purchased something with flashy colorful lights.  I do remember waking up at home and wondering what the hell it was and where I got it from.  I guess I talked that candy girls ear off before I bought this.\n\nI remember waking up and thinking to myself, \"How the hell did I get home and what the hell is that vibrator doing next to my bed!\"  I was momentarily horrified at the prospect of what I had done until I made some frantic phone calls and the hazy memories started to come back.\n\nWhen you turn it on and spin it by it's lanyard it makes pretty colorful patterns.\n\nIt now hangs from the front of my bass amp whenever I'm playing a show, cycling through it's different colors.  Thanks kilowatt!  Thanks candy girl!\n\nThis place has a great beer selection and alcohol, drink, blah blah blah.  Yeah just come here!  You're smart.  You can at least use a computer or smart phone and do a yelp search, you'll figure it out.  It's worth the visit.", "author": "Theron L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-26", "description": "Kilowatt is -- without a doubt, my favorite bar in all of San Francisco. For those concerned with just the drinks, the beer is great and reasonably priced. An average beer is going to cost you around $5.50, and their selection consist of one some great German beers (most notably the franziskaner on tap). \n\nWhile beer is great, any bar can give you something cold and delicious. The real heart of Kilowatt rest in the billiards department. There are 2 nicely kept bar sized tables that at any point of the day or week will have people slugging it out. It is important to note that the locals that play pool here, which I'd guess makes for about 75% of the players, take their game very seriously. With that said, there are some really good players here that may lay the smack down on someone not so experienced. \n\nIf you are looking for a place to play some competitive pool, Kilowatt is by far the best place to come. The great beer selection, homey dive feeling, rocking jukebox, and friendly locals are what will bring you back for more after you scratch on the 8.\n\nNotes:\nHappy hour typically ends at 7pm. \nSunday is free pool all day.", "author": "Russell S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-23", "description": "LOVE this bar. Good beer with pool and darts, what more do I need for a night out? Only thing a little annoying is that the pool regulars employ \"bar rules\" which apparently does not include teams. Pretty lame since everyone is trying to have a good time. \n\nMinus one star for the cash only.", "author": "Raina B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-11-23", "description": "The aroma of musky beer drenched wood is strong with Kilowatt. As is the whiff of wet dog every once in a while. Or is that just a hippy? I can't tell.\n\nRegardless, any place that allows dog lovers to bring their beloved for a happy pat on the head is A-OK with me. I love Kilowatt for 2 pool tables, pinball machine, dart board, and nominally priced beverages. The crowd is mixed with punk rockers to blazer doners and from my experience, quite friendly. The best thing is Kilowatt is quieter than your typical Mission fare. This is a fantastic place to unwind the night or enjoy a dive bar night out and is conveniently located to the infamous danger dog stand.", "author": "Jason C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-12-14", "description": "Decent drinks, service, ambience, etc. but I have to send a message to the staff for policing the juke box. We put a decent amount of money into the jukebox, queued up a range of stuff and heard none of it. Well, maybe 10 seconds of a few of them before they were skipped via remote by the bartenders. Instead what we got was a force feeding of something that sounded like dream theater taking a mastodon shit on Metallica. We get it. you're dudes who grow long hair, sat through a combined 30 hrs of tattoos, and are attempting to cultivate a pseudo cult classic metal look while surfing above the pop culture flood on top of your soap box. Meanwhile, your rent is paid by folks who just want to get some drinks and not take life so god damn serious for a few hours. Bottom line: don't have a jukebox if you're  just going to veto peoples choices. We can cut out the middle man and I can just pay an extra $5 for my beer.", "author": "Jason T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-22", "description": "There are some master pool players that take residency in this joint. Also a Ms. Pacman game near the darts on the platform. Playing some good garage rock when I was there, and plenty of sitting room. A good, easy going stop.", "author": "Sonya Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-09-14", "description": "Yeah, I can dig it! After a few rough starts years back the last few stops into Kilowatt have made up for it.\n\nEven on the more crowded weekend nights, I've gotten great service from the folks behind the bar. There was one blonde bartender who was especially cool and remembered to come my way whenever my buddy and I needed a drink.\n\nSince the inner Hessian is drawn to the dirty rocker \"theme\" I think Kilowatt will complete my trifecta of bars on this block of 16th Street which includes Dalva and Double Dutch.", "author": "Art O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-11-06", "description": "This is my go-to bar for chillin in the Mission.  Great location and cheap drinks.  They always have some decent beers on tap and it never seems to get too crowded.   \n\nCall it a dive bar if you will, I prefer calling it a dog bar.\n\nI've seriously seen so many cool dogs here, and the walls have photos of dogs.  Dogs make any bar awesome.\n\nOne tip: I lost a bet with my friend and he had one of the bartenders make me \"the worst drink in the world\" which ended up being a gin and malibu.  It was horrendous, so don't order one of those.", "author": "Crandon J."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-12-14", "description": "Damn this bar and their jukebox etiquette. I mean, the bar is ok, but the jukebox!! For serious. Don't come here and plan to listen to the tunes you want, I'll tell you that much. You will pay all the monies, and the bar will skip your songs. And instead play horrible 25 minute long metal epic jams. Ugh. Fundamentally, if you have a jukebox in your bar, which people pay money to play music- they should be entitled to choose and listen to the songs that are played. It's only logical. Instead, the crazy ass bartenders overtake the machine and play whatever the hell horrible music they want. What a waste.", "author": "Sarah G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-08", "description": "We ended up here after our whole party wasn't able to get into Monk's Kettle because they were at capacity.\n\nKilowatt is awesome for large parties because the place is huge!  It could be a warehouse in respect to most places in the city... especially in the Mission.  More divey in comparison to Monk's Kettle, but I can definitely appreciate a good dive bar with the right elements in place!\n\nThe selection wasn't nearly as intriguing as Monk's Kettle, but definitely noteworthy.  I love me some beer and they had about 20 different taps with a good selection including pilsners, IPAs, stouts, and ciders.  I was excited to see they had Franziskaner and they recommended a Downtown Brown for me since I like dark beer.  It was OK, but not as full bodied as I prefer.\n\nPlace is SUPER loud with lots of sports fanatics catching up on the games.  Bartenders are really friendly and it was a good time overall.", "author": "Regina B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-12-23", "description": "MOTHERSHIP WIT ON TAP and DOG PORTRAITS. Mothership Wit is one of my favorite easy-to-drink wheat beers, and they have it on tap here! I could drink this all day because it goes down so smooth and has a lot of strong flavor right up front. The bartender was friendly and fast so thumbs up. Don't forget to tip your bartender!\n\nThis a classic dive so don't mind the sticky floors or tables, but admire the dog portraits! The beer list is chalked up on the wall across the bar (thanks to a tip-off from a regular) so you can see what they have. Very reasonable prices ($4 per pint/$15 per pitcher) for GOOD beer.", "author": "Charles L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-08", "description": "Great dive bar! Darts? Yes, please! Plus, the drinks were relatively cheap too, which is a rarity in this city.", "author": "Audrey A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-08-14", "description": "I have been a 16th street drinker for many years and never popped in here until one day and was shocked.  The place is a lot bigger inside than it looks from the outside.  The beer selection is remarkable (Radeberger and Hoegaarden and Great White everytime) and ever so reasonably priced.  My biggest regret about the Kilowatt was not parking myself inside sooner.", "author": "Sin F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-04-12", "description": "When I first walked up to Kilowatt, there was a huge dog standing in the doorway. I thought to myself \"bouncers have dogs now?\" Turns out that it's just a dog-friendly bar. They run around all over the place in there. \n\nTowards the entrance, you have an assortment of bikers and grungy looking people. The further you walk into the bar, the more hipster people get. Interesting assortment of people, which leads to an interesting assortment of dogs since everyone brings them. It's fun to watch the big pit-bull cross looking thing chase Paris Hilton's Chihuahua around the place. \n\nGetting a seat or a table is hard and if you do, hold on for dear life. You get the vultures standing next to you, just waiting for you to make a wrong move. The beer is cheap, which is nice. Pitchers go for around $18 and they have an fantastic selection of them. \n\n(Note: drinking Fransiskaner after Indian food makes the beer taste like Bananas). \n\nThere are some weird people in there. Some guy in the women's bathroom was getting a little too excited watching my friend wash her hands. But all in all, interesting place.", "author": "Mariko F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-04", "description": "a watering hole\n\nweird people\n\nfun people watching\n\ncheap drinks\n\ncash only\n\ntoo many cougars and loser guys with neck tattoos\n\ntypical SF\n\nis this a haiku?", "author": "Athena S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-11-20", "description": "DON'T COME HERE!!! It's filled with old grumpy men who will physically threaten you over whose turn it is at the pool table. How do I know? Because my friend was grabbed by the throat by a barfly named Sam for that very reason. And what did the bartender do about it? They threatened to kick out my friend because Sam was a 'local'. Last I recall that doesn't make it legal to put your hands on another person. Nothing special about this place to make it worthwhile.", "author": "Aida T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-04-28", "description": "Finally, a bar friendly to the Montreal Canadiens! Invited by a co-worker who ran into some friendly hockey fans when there last time, we decided to check it out...and we were not disappointed. Multiple Habs fans showed up, some even wearing jerseys! By the time the game started, a fair sized group of people had shown up to watch the game.\n\nThe bar itself is very unpretentious, and had a very fine selection of beers that could be purchased by the pitcher. There were a multitude of LCD TVs available, though the one above the bar could be a little bigger ;)\n\nI'd give it 5 stars but they wouldn't put the sound of the game on. The music selection was pretty good, and they have a couple of pool tables in the back. \n\nNote, the bar is very dog friendly, so aside from Hockey I also had the opportunity to watch this woman's chihuahua constantly rail another little dog...not the entertainment I was looking for.\n\nOne final point, they don't serve food and are very receptive of outsiders bringing their own food (as long as you buy drinks of course0.", "author": "Jordan C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-02", "description": "Most pitchers of beer are $15 bucks all the time and the crowd is a mixture of Mission locals (the pool sharks & hipsters) and SF locals as well as some out of towners. It's a good place to hang out people watch, play pool (only if you're good because the guys who play here often are quite good), darts, meet new folks or chat with friends. Great spot to bring people visiting SF. Lots of beer choices on tap and reasonably priced. \n\nI do have to say that it would be great if they accepted credit cards, but their prices are fair so it's a fair trade all in all. Just make sure you have cash if you're going here otherwise you can use their ATM and pay the fee, which is the cost of a beer I rather pay for the beer.", "author": "M R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-08", "description": "Tracey and I actually met here last JUL...\n\nShe'd kick my butt if I didn't give it a good rating.   lol\n\nAll kidding aside, this is a cool neighborhood bar.\n\nCentrally located in the Mission with good beers.\n\nTV's, dart board, and dog-friendly ('nuff said).", "author": "Francis M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-18", "description": "I recently checked this place out during the day, and it holds up as a good bar, day or night. Fancy that. Beers, good amount of TVs, and there were no less than FOUR dogs chillin' in the bar with us on a Sunday afternoon. Cash only (boo).\n\nAs far as night visits, this is a good place for bar games. Pool, darts... I actually learned how to play darts here. Okay, I don't remember how to play darts so I guess I didn't learn so much as drunkenly threw darts at a board here. But fun was had by all (to the best of my recollection).", "author": "Jennifer B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-16", "description": "Best bar in the mission forsure. Love the atmosphere, bartenders and bouncers are super friendly and they make a bomb ass margarita for us tequila lovers :) Definitely go here if you want to have fun and be around good people.", "author": "Lauren B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-05-21", "description": "A fun dive bar that's not too divey, a Mission bar with the right amount of hipster, and a pool joint with a few tables plus darts (in case you do have to wait).  The extensive beer menu is welcomed even if a bit overwhelming for the decision challenged among us.  Always a fun time with a group or even just a few friends.  Bartenders are friendly too.  Just remember to bring cash!  Like most mission bars, this place will refuse your plastic.", "author": "Nakissa G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-10-07", "description": "This bar is about a kilowatt from 4 stars. I guess it just reminds me of every other bar. Nothing too fancy or spectacular about their drinks...a place where locals hang to catch up with their friends...and not too cramped.", "author": "Celia C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-09", "description": "I love this place. When I want to go to a place and have a shot of whiskey and a beer and listen to better juke box music, Kilowatt it is. In the Mission but away from some of the crappier trendy spots. \n\nThey have 2 pool tables, an upper area for darts and a few other seating arrangements through out the bar. If you want a real bar in the mission go to Kilowatt.", "author": "Kate D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-08-17", "description": "Kilowatt is one of the more trustworthy places to have a Manhattan in the Mission.  Slightly watery, but far superior to some of the other dingy, hipster bars on 16th.  \n\nBut HOLY MOLY watch out for pool sticks and stilettos damaging much needed organs and bones.  Kilowatt can be QUITE packed on a Friday/Saturday....and once I get going, I have been known to lose control of my billards and walking skills.  \n\nI should probably stick to flats or kitten heels when coming here....but then I just wouldn't be the sultry shiksa that I am:)", "author": "Joanna M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-02-05", "description": "Kilowatt is another dark and dank bar in The Mission. That would seem just my style but for some reason I've never been too crazy about the place. There are a couple of pool tables but serious money players usually dominate them. Sometimes I've been there and the beer tasted off and some times it's fine which leads me to think they don't clean the lines often enough.\n\nI guess the biggest reason this place isn't in my rotation is because it's just as easy to go to 500 club, Thieves Tavern, or even Dalva and I like those places much better.", "author": "Manny F."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-11-11", "description": "This bar is alright and is a pretty popular neighborhood bar so it obviously gets pretty crowded and cramped on the weekends.  It is also apparently dog friendly as there were at least two large friendly dogs just roaming around inside the entire night.  I'm cool with that, I love dogs. \n\nThey do have a pretty good beer selection and for a good price, but the cleanliness of glasses they are served in can be questionable at times.  Some of the beers I had were served in glasses that didn't seem very clean.  I almost felt like Quentin Tarantino in the beginning of \"Desperado\" when he stops in a bar in Mexico asks for a beer and receives it in a dirty glass, asks the bar tender (Cheech Marin) for a cleaner glass, and then is told by the offended bar tender that it's the cleanest one they have.  Oh well, cheers!", "author": "Erich D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2005-10-31", "description": "Hey yuppie, stop coming here and fucking it up.  If you don't want me to punch you in the jaw or spray you down with beer, then stay away.\r\n\r\nIf you are not a yuppie, then bring down the dog and watch some football.  This is the best punk rock sports bar in the universe.  Peter, you rule.", "author": "Lemmy C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-05-09", "description": "Kilowatt reminds me of The Bitter End, Mission version. \n\nI am a fan of dive bars, it's part of my Midwestern heritage. One of the downsides of dive bars though, are the low ceilings and dank environment. Kilowatt surprises with open space and high ceilings. It makes the bar seem a lot larger than it really is. \n\nOne of my favorite things about dive bars are the games. I like to drink competitively, meaning i like to drink while competing in things like darts, it keeps my attention better than conversation sometimes. The dart boards in the back are well lit and out of the way of the traffic so you don't risk impaling anyone.\n\nDive bars are also known for their cheap beer. Kilowatt does one further by offering a wide variety of cheap beer. Having franziskaner weiss beer on tap will always get you extra points in my book. It was 5 bucks.. my friends got bottles of Bud Light for 3. \n\nThe atmosphere is relaxed and diverse, a wide variety of people.. all friendly and all enjoying themselves, I as well enjoyed the vibe. Just another thing about the Mission that I love!", "author": "Hailey P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-25", "description": "Deep, high-ceilened bar with 2 pool tables. Tons of dog pics on the wall (presumably customers') Very cool dive on a crowded strip. I'd come back", "author": "Michael M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-12-12", "description": "I've been here before thought to myself what a wonder dive. it had all the fixings for a great place to go with friends and get a drink.\n\nWalls covered in random crap? check\nGood selection in beer? check\nAwesome bartenders that look like twin brothers? check\nGreat rock and roll nostalgic jukebox? check\n\nI had a good time and for the most part the people there friendly. I will be back.", "author": "Zachery H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-02-24", "description": "What can I say that hasn't already been said?  Kilowatt's laid back atmosphere, strong drinks, pool and darts, makes for a great place to hang out and throw back a few.\n\nWe came here as the first stop in a long Wednesday night.  Only draw back -- I NEVER carry cash.  It's something that I've had to get used to being in San Francisco so often these days.  The cute bartenders are helpful and I don't think any of us had to wait longer than a few seconds to get drinks at the busy bar.\n\nThe music wasn't bad, loud enough to hear and sing along, but no to the point where we had to yell to keep up a conversation.", "author": "Madison B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-09", "description": "Of all the dive bars in the Mission, I think Kilowatt is my favorite. It's big and roomy inside, has a real long bar with lots of stools, booths and pool. The draft beer selection is comprehensive and quality and bartenders are always on top of it and friendly. Oh, and there always seems to be at least a couple dogs hanging out, too.\n\nI also love Kilowatt's great specials - a daily happy hour with $2.50 pints, $2 wells and $8 pitchers until 7pm, and $1.75 a pint for one kind of draft beer every Monday. Too bad I've sworn to (at least try to) stop going out on school nights.", "author": "Kristina A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-11", "description": "I absolutely love this place! The alcohol is decently priced and they have an amazing selection of beers. It's cash only though so don't forget to hit up the ATM before you head over there. One time I ordered a boddingtons and the bartender said they didn't serve it. I then pointed to it on the drink list and she gave me one for free simply because she didn't see it before. Awesome! What more can I say?", "author": "Zohreh A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-03-23", "description": "I came here on a Friday night and it was packed. Three words: Loud, dark, and crowded. There isn't much space to sit or even hang out. The pool tables must be a draw, because I don't understand the inefficient use of space. It's not a bad place to just get a drink and hang out, but other than that, I don't see the appeal.", "author": "Phan H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-10-18", "description": "Cheap beer, happy hour 4pm-7pm, avg beer is about $3.75, after happy hour it goes up about 75 cents.  Bartender is super cool.  Pool is 50 cents.  Darts are free. When there's a big game on (playoffs or 49ers) they cover the pool tables.", "author": "Nicholas M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-01-23", "description": "Of all the bars that I visited in the Mission District, this one 'felt' the most comfortable. Like every other Mission District bar, they take cash only and have an ATM by the front door. Wide and roomy, Pool tables in back, lots of seating up front, and something I am not used to being from San Diego, there always seemed to be one or two stools open at the bar. Perfect place to grab a beer and groove to the excellent music. \n\nThe open ambiance and cheerful but busy staff made a great first impression. But then I had to order something... Kilowatt has a zillion different beers advertised on the chalkboard across from the bar. But not all the stuff on the board is actually tapped. So don't get your heart set on the non-descript \"Nut Brown\", because they wont tell you which brewery its from, nor is it popular enough to be tapped on the weekends. I settled for Guinness, and was a little horrified at the pour and resulting head. \n\nBottom line: These aren't beer people, but they do dive-bar-in-the-cool-mission-district very well. If you are looking for a pleasant standard quality place to bring your friends and aren't too particular about your drink, this is the place =)\n\nCons: \n- Didn't double pour the Guinness\n- Stinky wet pee all over the bathroom floor and the toilets by 8:30pm.\n- Patrons that look like they are fashion victims - might be a pro if i was out with just the girls as some of those guys were hot, but the jury is still out on this ;D\n\nPros:\n- Plenty of TP in both bathrooms\n- Dogs!!  =D you can bring your best friends of both species\n- One of the bartenders looks like Reed Rothchild from Boogie nights =D", "author": "Irresistable U."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-04-11", "description": "This bar is a long time favorite. The drinks are great and the prices are extremely decent for SF. The bar is dog friendly which is super cool. It's always packed but the crowd is great. If you are in the Mission area, check this bar out!", "author": "Laurie R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-16", "description": "Cheap drinks!  If I ever feel like hitting a bar for some cheap drinks - this is the go to!  No, it isn't fancy, but they have naughty photo hunt and the drinks are strong!  Bring your cash!", "author": "Vanessa L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-03-13", "description": "What a cool place. \n\nWent here on a date. The guy I was with has actually been here a few times and warned about it being a little divey but for me, I love dive bars and this place was definitely right up my alley. \n\nThe atmosphere is awesome. Totally chill, definitely have tons of seating, plus they have 2 dart boards and 2 pool tables. \n\nI have to say that I am impressed with the beer selection. They had Boont beer, which is amazing and for some reason really sparse in the city. They also had Big Daddy, but that one seems to be around the city a little more. I was more excited for Boont. The price is CHEAP too. I love paying under 4 bucks for awesome beer.\n\nThe only drawback is that it is a cash only bar. They do have an ATM in the bar, but I rarely carry cash. Other than that, go, check it out and have a blast. You are definitely in for a treat!", "author": "Diana R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-16", "description": "Yo, not pretentious.  Good drinks.  Cheaper than your middle-class Mission hipster joint.  Big.  Pool table.  Pictures of dogs and motorcycles on the wall, go figure.  \n\nAnd, an odd bit of 'who gives a sh^&', I was able to walk in during the Dyke March and use the bathroom.  It was easier than the lines post-movie at the theater.  Downright weird.  \n\nThis place just has good mojo.  I can't explain it.", "author": "M M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-03-30", "description": "I stopped here last summer for a cold beer before heading back to the office from a jobsite. I found it to be a nice dark and quiet bar that you could just stop in for a pint without the regulars staring you down. \n\nI learned about Kilowatt beause they are an AFM sponsor. I had hoped to run in to my friend Cliff, who's neither white, obnoxious, or a mailman.  \n\nCheers!", "author": "Kevo M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-02-26", "description": "Popped in here last night and wow, this place is timeless...it hasn't changed one bit.  Used to spend a lot of time shooting pool in here a few years ago and it almost felt a little strange stepping back.  Looked at all the pool shooters and it's definitely still shark-infested waters.  Saw some players with their own fancy cues (I have a bunch, but who brings a nice cue into a dive bar anyway...coin op cue balls are way too heavy...like a Buick...I save mine for friend's homes and pool halls)  The signup boards were both about seven or eight names deep...yikes.\n\nAnyway, didn't get on the table this time, but might be back in the near future to play again.  Should be fun to see if anyone good is in there.  Happy to see that it's still dark inside here too...I've always loved the darkness.", "author": "Roy N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-06-04", "description": "Cool, spacious bar in the mission with lots of screens for sports. Sort of so-so on the inside and nothing special, but serves a purpose...and takes dogs!", "author": "Lauren C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-20", "description": "I went here a few months ago and drank so much bourbon that I couldn't drink beer (although I did manage to spill it)... it was awesome. The time after that I drank the Stella deliciously. On one of these times, a homeless person rapped to us outside. \n\nThey were both on weekdays and it wasn't too crowded or weirdly empty. The juke box gets the music on and the bartenders are cool. Actually the bartenders are especially cool because they are quick like magic.\n\nThey don't have any particularly good deals but there prices aren't horrible either.", "author": "Stephen S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-02-20", "description": "So this place is still as crowded as the other times I've been here, but I had to drop a star on this spot because of what happened with the bartender when I first ordered a drink.\n\nI don't know if it was because I was kinda all fancied out due to my attire of the previous spot I was at, but when I ordered my kettle one on the rocks and paid with a 20 gave me change as if I paid with a 10 and walked to the other side of the bar to help and immediately helped another patron.\n\nWhen I moved over to the other side of the bar I had to wait for him to get to me even though I was trying to get his attention, when he finally got to me after helping two others he asked if I was sure, to which I had to insist that I did.  After a couple of going back and forth he finally gave me the correct change.  I still tipped the usual two dollars per drink that I do and walked away, but he seemed shocked that I still tipped him. \n\nAnyway, still a great place with great atmosphere, but you still lose a star.", "author": "Mark L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-04-10", "description": "You have to respect Kilowatt for what it is...a dive bar.  Dive bar means:\n\n- drunk pool games by somewhat homeless, bendover crack showing over 40 year old men.\n- a tireless rotation of AC/DC, Metallica and one Justin Timberlake song in to be hip\n- GREAT selection of beer on tap\n- gum on the bottom of your bar stool\n\nThanks for keeping it real, Kilowatt!", "author": "Kamael S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-26", "description": "Awesome bar! There's pool tables and darts in the back. Fun place to hang out.", "author": "Ruthie S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-12-22", "description": "I've always felt the Kilowatt was one of the best dives in the city.", "author": "Kev M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-12-21", "description": "About three years ago my dad was visiting SF and he wanted to watch our hometown team's football game that day.  I was happy to oblige since he's dad and I thought it could be fun.\n\nI asked my roommate who likes sports where in the Mission he'd recommend to watch the NFL on a nice TV but not too sports bar like and he suggested the Kilowatt.\n\nWe had a good time and it was cool to do something with Dad that he was into.\n\nThen something completely insane happened.  I got really into football later that year.  Like, I was into football when I was 8 or 9 years old, but eventually got into music and art and things like butoh and was just not like the football type anymore, or so I thought.  \n\nI don't really know how it started, I think our team almost went to the Super Bowl that year, but it was crazy, I started showing up at 10am by myself to watch games.  My parents half seriously bought me a jersey for Christmas that year, and I half seriously started wearing it on Sunday mornings to root on my team.\n\nWell, 3 years later, there is nothing half serious about it.  I am really into it.  I don't want to be one of those \"closet jocks\" in the art scene.   No, I am really into it.  I love watching football.  It's become kind of part of who I am.\n\nAnd I love watching football at the Kilowatt; it's is a great pace to watch a game.  Basically it's a mix of people like me, or closet jocks or people who are just people or whatever you want to call them, but overall the meat head factor is decidedly low, which is awesome.  No one team's supporters dominates the overall crowd, so it's a varied scene on Sundays, which is nice.  There are even free hot dogs and coffee.  Like, cheap as free, dude!\n\nThe bartenders are cool.  I mean, I am a usual $2 a drink tipper, so the bartenders are usually cool, but like the guys/gals are cool cool.  All in all, I wonder to myself, would I have rekindled my childhood passion for heroes of the gridiron if it weren't for a place like the Kilowatt?  Perhaps not.\n\nMy experience of the Kilowatt, in a nutshell, is a positive one.  Oh, and I love the sign \"CASH ONLY, You're in the Mission...\"\n\nRight on.", "author": "Ben V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-22", "description": "When all else fails in the Mission, Kilowatt is always there for me. For that, I love you.\n\nYour drinks are cheap and your games are awesome. Even the hipster crowd here seems more laid-back and tolerable than usual. I'd give you 5 stars if you would only take credit cards...\n\nAlso, Asian Antenna Man, I need to buy you a beer next time we cross paths, which shouldn't be too hard considering I see you every visit.", "author": "Leo K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-02-17", "description": "5 stars for a dive bar is kinda crazy, I know.  But really, I can't think of anything bad to say about Kilowatt.  I've had a great time every night I've come here, whether it be for one drink or many.\n\nUntil midnight or so, the crowd is totally manageable-- to the point where you might be able to snag a booth until 10 or 11pm.  The beer selection (bottles and tap) is really stellar.  And the prices are absurd.  Nothing makes me happier than paying $4 for a really really good beer.  Seriously, everytime I do it I look at my partner and say \"I love San Francisco\" (compared to the $6 Bud Lights I was used to buying in NYC, its a really nice change).\n\nAnd Kilowatt is a great reason to love San Francisco.  As they remind you by way of a sign behind the bar-- this is the Mission.  Cash only.", "author": "Kristin P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-04-14", "description": "This bar may look a little rough around the edges at first glance but it's actually really cool. It quickly gets packed but people are generally friendly so it's not a big deal. Drink prices are fair and mixed drinks are poured well. \n\nI really love the darts and 2 pool tables that tempt both casual gamers to hardened regulars who bring thier own gear. \n\nIt is odd that every time I'm in there, I run into a random friend who also doesn't frequent the place...\nCheck it out on a Friday and soak up some SF Mission culture.", "author": "Morgan A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-28", "description": "Solid bar and just love the crowd here, It's indicative of the Mission crowd. \nThey have TV's and a wide variety of alcohol so you won't be disappointed.", "author": "Eric A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-03-28", "description": "Um, $3.50 pints of microbrew... HELL YES! \n\nThe bartender was cute, nice and efficient-. kept us drinking without any major pauses- SCORE. I liked the selection of beer they had on tap- opting for the Mothership Wit with lemon, of course. The reserve bourbons they have available was quite pleasing for a Kentucky whiskey drinker like myself. LOVE the Woodford Reserve, neat. please. \n\nI was here on St Paddy's Day and there was plenty of space. I like that there is seating on the bar, in booths, at tables and the back area with the pool table and some arcade games. The juke box had a very interesting mix of songs that catered to the wide variety of peeps in the place. \n\nA super unpretentious place that made me feel at home with my geek glasses and hobo-beanie on. I definitely DIG this spot.", "author": "Nikki B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-11-01", "description": "My friends came here sometimes but I'm always in no mood to go to the Mission, so one night I came straight here to watch a game (when the Phillies clinched their Division title). I know no one cares but it's a big deal for me :P\nAnyways, I had a good time here, people were cool and the bartender & bar back were friendly. Oh, what's next?? Hit the pool tables when I'm here again!", "author": "Gabriele A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-11-12", "description": "Aside from the friendly bouncer, this place is typical of a crappy mission bar. The tattooed and self loathing bar tenders are happy to make you feel unwelcome and promise to give you terrible service--particularly the tattooed brunette who has a nasty habit of serving drinks after nibbling on a toothpick behind the bar. It's the type of place that you wanna tip a quarter for your drink.", "author": "Leon K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-12-02", "description": "Slowly but surely becoming my favorite Mission bar.  Great beer, great vibe and much to my delight I found I can get my NHL fix here.  \n\nI don't live in the hood (yet) but I love hanging out here.", "author": "Steven R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-05", "description": "Good beer, pool tables, cheap drinks. Pretty dark, but fun.", "author": "Carolina P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-08-09", "description": "The vibe of this bar is pretty different and I must say refreshing.  We came here, lookin to score drinks and play some pool.  That we did.  But it's not that simple, there are things to discuss.\n\nFirst, the scene.  \n\nI saw the first mods I've seen in a long time.  Like, the mods in SLC punk:  skinny dudes with cute suites and ties.  I can dig it.  The two that I saw looked swanky, but confused and like they didn't really have any friends there.  Bummer. \n\nNext, the pool dudes.  Kind of like the dad's of everyone else there, ignoring their annoying drunk kids.  They take pool pretty seriously and are fucking good but are light hearted enough not to make you feel stupid.\n\nNext, the brahs!  Definitely some brodudes chillin in their striped shirts with the sleeves rolled up.  They seem nice enough here.  \n\nNot a lot of mission-core hipsters that I remember (I was pretty blitzed), which can be good or bad depending on what you like and/or who you want to hit on and hang out with.\n\nDrinks are pretty standard price, lots of options on the jukebox, and high ceilings (I like this, I'm weird).  This is a cool bar.  Sorry for judging the patrons so hard, it's all out of love (and having fun people watching and analyzing).  Oh, I forgot about the Hawaiin birthday party.  WEIRD.", "author": "Brian G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-08-21", "description": "50 cent pool games.  Pinball machines.  Dart boards.  Comfy chairs and booths.\n\nHH M-F 4-7, Sat and Sun 1-7.\n\n17 beers on tap.  Three different types of Hef.\n\nDog(s) wander around the bar almost every time I've been there.\n\nCash only, so come prepared.", "author": "Jenny L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-17", "description": "Dude, this is the stereotypical big dive bar in the heart of the Mission. Everyone knows of this place and it's an institution in the Mission district of SF.\n\nDrinks are cheap and poured strong, it's kind of dark and there are tons of TV with people yelling at them during whatever event is being shown. They showed the world series games a few weeks ago, and damn, the place are blowing up. Talk about insanity. Yep, it's that kind of place.\n\nIf you've never been, just go and check it out. Just don't try it on the weekend or any normal party day, as it'll be pack outside the door!", "author": "Erik B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-04-24", "description": "As is the nature between girls, I recently showed my BFF a picture of a dude I was interested in. The exchange went a little something like this:\n\nDevon: So here's the guy. What do you think?\nBFF: He doesn't look like your type.\nDevon: Huh? He's totally my type, I promise!*\nDevon's Brain: Oh fuck, she doesn't think he's cute. Do I go with \"He's just not really photogenic\" or do I play up the \"But he's got a great personality!\" angle?\nBFF: Oh no, I didn't mean it like that. I just mean he doesn't seem like a total metro or a pretentious douche.\n\nFair enough. It's a bit disconcerting when your future maid-of-honor can whittle down your type so unceremoniously but I can't really argue with her surmises. The girl has a point.\n\nKilowatt is like that gentleman...upon first glance, not my type at all. I like to dress up a bit to go out, and I like the other attendees to be sporting polos and designer jeans. And Kilowatt seems like every other psuedo-divey Mission bar. It's a little dingy and rough around the edges, and the patrons often look somewhat disheveled. The bar is big, but it's full of cranky pool players who growl at you when you try to go back to the bathroom. \n\nBut it works.\n\nIt works because they have an excellent beer selection at affordable prices, and the bartenders are awesome at suggesting something new if you're burned out on the same old pint. And despite my criticisms of the crowd, the people are usually friendly and there have definitely been some striped shirt diamonds in the rough. \n\nIt's one of the few bars in the Mission I actually ENJOY going to. In a way, because it's so wrong, it's so right.\n\n*It turns out I was correct and he was my type in that after our first date he faded off into oblivion. While you wonder if my abandonment issues are real or staged, I'm gonna head over to Kilowatt, enjoy a pint of Downtown Brown, and hope that my view of the place isn't clouded by an angry pool player shiving me with his cue.", "author": "Devon S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-17", "description": "Great beer selections.  Minus the blarring loud music that was requested by a bar patron. The nice bartender was so accommodating but she could barely hear incoming orders.", "author": "L T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-16", "description": "As I'm more of a dive-bar kinda gal, I like this spot a lot.\n\nGood prices, good bartenders, pool if you like that kinda thing.\n\nSometimes sports on the TVs if you like that kinda thing.\n\nTables, booths, and usually some good punk choons.\n\nThe ladies room sucks, which is par for the course in dives.\n\nBut they've got plenty of cheap PBRs and whiskey shots, so that's okay with me.\n\nIts becoming our wednesday night ritual, the drinking club at Kilowatt.", "author": "Roachie D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-14", "description": "Tons of beer, pool tables and a short walk from Little Star....", "author": "Alita M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-12", "description": "ive been coming to this bar for quite some time, drinks are relatively cheap and strong and a great beer selection, along with zeitgeist, gesthalt, and dellirium (a spell check is needed haha), my fav. bar in the upper inner mission area\n\nmy friend and i love coming to this bar b/c\n1) we feel like ppl here are always down to talk to each other, ez for us singles to mingle, knowaimsayin??\n\n2) we love that mrs. pacman game in the back, we always play it, try to beat each other's score and a loser either has to buy a drink or does a dare (like hitting up on a group of girls or something like that haha) and we are getting proficiently good at it!\n\nahhh those dots....TO CATCH THEM IS MY REAL TEST, TO EAT THEM IS MY CAUSE, GOTTA CATCH EM ALL!!\n\noverall i always end up having a good time here, thumbs up\n\n4 stars", "author": "Michael K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-04-13", "description": "I like this bar, not so much on a friday or saturday, too crowded for me.\nWent here on a sunday, it was perfect, not too many people, friendly bartender and drunk friends.\nI loved checking out the not so hot pool player with a weird head and fake boobs.\nI wish she would be there every sunday.\n\nAnyway, this is a nice spot with two pool tables and airy atmosphere.\n\nSee you soon.", "author": "cecilia k."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-06-17", "description": "Now this is a true San Francisco dive bar. It's grungy and grimey and drinks are cheap ($5.50 for a Bulleit bourbon rocks). It's a huge bar so plenty of room however in the back three pool tables take up a lot of space. It's actually not a bad place to watch sports as they have tv's everywhere. They also have darts and pinball so plenty of activities to keep you busy. \n\nThis place falls right on the 16th St Mission bar/club scene so if you're bored there's plenty of other options to choose from.", "author": "David C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-01-22", "description": "I came here after one of the 49er games and the bar was probably moderately full. I am giving this place a 1 star review because I sat at the bar like 20 minutes and nobody asked if I wanted anything to drink so I just left. I don't know if it was just the day but it was like the people here were ignoring me they weren't even that busy. I will say the people I talked to were pretty friendly though that were drinking here.", "author": "Nicholas A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-06-26", "description": "Wow.  First time there recently.  After work on a Friday.  Not too crowded.  Room at the bar, pub tables, and booths, too.  That was a nice touch.\n\nSo I see Guinness on tap.  We may have something here.  Then I see the Power's whiskey and I'm thinking \"we have a winner!\"\n\nNow all I have to do is get some darts.  Two boards in the back, with proper lighting and accommodation.\n\nThe bar staff and other folks we met were friendly, too.  Looking forward to stopping in more often.", "author": "Ken B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-06-15", "description": "Thanks to my fellow Yelpers who directed me to this bar when I was in need of a place to watch a hockey game.  Since I don't live in the area, I was relying solely on the reviews here and Kilowatt's website for general information.  However, I'd like to warn people that the bar hours posted on their website differ from the ones that they operate by.  We planned to arrive here when their website said they opened, but ended up having to wait an hour and a half at another bar (which we ended up preferring) before Kilowatt actually opened.\n\nReady to put that minor misunderstanding behind me, we sat at the bar ready to enjoy some beers.  I had no complaints about the quality of the beer or their selection, which was average for the Mission, but the bartender/bar patrons were generally rude and unwelcoming.  I don't need a big hug and smooch when I walk in, but I also don't appreciate when the bartender acts annoyed when I ask two questions, or when a fellow drunk/hockey fan steals at seat at the bar which is most obviously being used.", "author": "Megan B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-27", "description": "Kilowatt is usually the place I'd go to after I've already been to a couple of other bars. This place is a little bit bigger than most bars and has more lighting.. so you don't end up feeling too wasted hah!\n\nI always order long islands here, they're pretty good. But my favorite memory of this place is coming here to relax with my friends after having to scream at each other over the loud music at other bars. Beware, this place will get you in trouble. Every time I've been here I've ended up in a hot mess.\n\nI lost my glasses outside the bar three years ago... I wonder if anyone ever found them? hah..", "author": "Debbie P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-15", "description": "Hands down, my favorite bar in the city. It's in a prime location in the Mission so it's perfect for a pre-dinner drink or as part of a bar crawl - always the first place I think of. The happy hour prices are some of the best I have found. The bartenders are super nice and never skimp on the alcohol. Good for a big group, even when crowded.", "author": "Brittany L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-02-15", "description": "If you can stay away on a Saturday night, it's pretty great. Cheap beers, quick serviec and good atmosphere.\n\nSaturday night, no movey. You can get a drink pretty quick but don't expect to move more than an inch to the right or left. Claustrophobes beware!!!", "author": "Erica E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-11", "description": "great happy hour prices, cash only. it's a dive bar so you should know what to expect,  but yes it's a tad dark and the chairs aren't very comfortable but if you like your beer strong and cheap and before 7pm you should check out kilowatt.", "author": "Misha T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-04-02", "description": "So, I recently went to Safeway to purchase some wine. I have my I.D. at the ready, because you know Safeway pretty much always cards anyone who looks remotely like they are under 40. Well, the checker looks me up and down, and DOES NOT CARD ME. Omigawd, my worst nightmare come true. I'm only 26 - do I really look that old now??\n\nThank god for the Kilowatt bartender who asked to see my I.D. Bless your sweet heart. That was pretty much the highlight of my time here. \n\nOtherwise, Kilowatt is OK. I've spent two evenings here (one on a Saturday, one on a Wednesday), and I'm still not in lurrrrrve with it. I'm not quite sure why. Maybe it's because, as my fabulous friend put it, \"Everyone looks so busted in here.\" Or, maybe it's because we put our name down to play pool, and the stupid guys in there kept trying to put us off from playing our game. When I put up a fight, their excuse was \"You have to understand, we play legit pool here.\" Well what the hell kind of pool do I want to play dumb ass? All was well when we finally played them and took their \"legit pool\" skills and shoved it where the sun don't shine.\n\n5 stars for Marty though!!!", "author": "Ava S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-08-04", "description": "A good friend of mine got kicked out of here years ago, and I think it inappropriately biased me against the bar.  In defense of Kilowatt, my friends was utterly drunk off his ass, and probably deserved to be tossed.\n\nThe first great thing that happened last Friday night at Kilowatt was that I dropped a five in the juke box, and after punching in some numbers, still had 58 credits.  And this isn't one of those irritating MP3/internet boxes where any given song can cost anywhere from one to four credits.  Nope - this juke box has good old fashioned CDs in it: one credit = one song.  So I programmed in about 20 songs and passed the torch to a tablemate, who punched in 20 more and passed the torch again.\n\nThe point of all this, aside from all the awesome free credits, is that any bar is better when you can pick the music . . . ALL NIGHT LONG!\n\nAdd to that, nice divey vibe, unpretentious crowd, dogs, two pool tables, and nice cheap strong drinks . . . did Kilowatt once oust one of my friends?  I seem to have forgotten.", "author": "Joe C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-06-30", "description": "Awesome music, awesome beer, awesome patrons. The \"P-Rock\" in my name exists because of (or perhaps for) places like this.", "author": "Natalye R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-08-05", "description": "It's an \"A-OK\" place to go for a beer or drink. Lots of seating for groups, dark corners for making out, a juke box that is cheap (just like Joe C.), pool tables and two semi-decent ladies stalls.\n\nI had fun here despite that my first 2 drinks took me 10 minutes to order each (when the bartender was helping no one else). The rest of my drinks, I have no idea how long it took because some hottie was getting them for me. (thank you!) Rachel F. is teaching me to accept free drinks and not feel bad. **repeats new mantra: I will be Samantha, I will not be Carrie. I will be Samantha, I will not be Carrie.** \n\nAll in all an A-OK experience and I will easily come back.", "author": "Ali R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-08-05", "description": "This is usually the last choice when I meet up with people in the Mission, but overall, it's solid. It's not classy, it's not fancy. It's a useful bar that serves good beers and strong cocktails, has a pool table, solid wood booths, and has a good jukebox.\n\nThe location can't be beat, two blocks from BART, along the 16th St. corridor.\n\nLadies, this place is crawling with men at happy hour. It may take you awhile to get a drink on a busy night, but that's all right, there are plenty of men on the take in there that you can entertain yourself with.", "author": "Rachel F."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-08-25", "description": "So, I bought two drinks and tipped a dollar. The dough faced attitude-y bar wench said to me \"wow, big spender!\" At that point I offered a five dollar bill for her to make change for a more \"appropriate tip,\" but she protested. \"No, it's ok..\" she said, but I protested in response. \"Obviously it isn't ok.\" I responded. To that she walked away... So fuck her and fuck this bar. I'm sure she's an artist or musician whose career is about to take off. But guess what? I don't give a shit. Sling drinks, lady... And be happy about the change you make.", "author": "Josh L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-03-30", "description": "Kilowatt is nothing like it was back in the good old days of underage drinking and cruising for boys who looked like trouble. For starters, even I got carded here recently, so I'm pretty sure they're no longer letting in 17 year old jailbait with an attraction for all things scruffy. That's ok- I'm legal. Next up is the clientele. Gone are the bikers, bike messengers, leather lesbians, and garden variety punk rock slackers who used to be frequent fliers. Nope- now Kilowatt is kind of like every other bar in the Mission: 50% hipsters, 30% striped shirts and the ladies who love them, and 20% other (mostly comprised of B&Ters, the odd gay guy who got lost on his way to The Stud, and a tourist or two). \n\nWhatever. It's still a bar and they still serve booze and I didn't feel compelled to start a bar fight or spill a drink on anyone or make catty remarks with my nasty girlfriends. Kilowatt is packed on weekend nights, making efficient navigation of the bar impossible. You will lose your friends, you will spill your drink, and you may be knocked around a little in the process. But you'll find your people, there's more booze at the bar, and some of the people you are forced to rub up against will not be bad looking. I would 4-star them for the experience and the memories combined, but I have to take off one star for the overflowing toilets in the ladies' room.", "author": "Autumn K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-07-18", "description": "Kilowatt is slowly becoming my neighborhood bar of choice... the laid back vibe, cheap drinks, great beer selection and rustic ambiance just have a way of making you feel at home. I can't think of anyone who wouldn't be comfortable in here. \n\nThe first time I stepped foot in Kilowatt, Drue C and I were sneaking in to use the potty from the yelp elite event down the street at Double Dutch. On the floor of the bathroom stall was a little balled up pair of panties. We got a huge kick out of that and while we decided I could not review the place until I had been back for a proper drink or three, it was a hilariously funny first impression.\n\nAvoiding the weekend scene here? That would go without saying...", "author": "margot b."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-08-13", "description": "I'm a sucker for any bar that allows dogs - I'm more of a cat person, but anything cute and furry on four legs will get my attention.  Oh yes it will!  Aw, yesh, it will won't it!?  Aw, yesh, you're such a good oh yesh, such a good boy, such a good boy!!!\n\nAhem.  Anyway, luckily I didn't do that while I was at Kilowatt (well, maybe a little), but it definitely gave me a good impression of the place.  It's a good sized bar, fair amount of seating and a couple of pool tables which I noticed are free on Sunday afternoons (or something like that - I think the regular price is $0.50 per game or so).  The drinks can be pretty strong too, also a plus - I think I paid $5 for my bourbon and coke.  Decent beer selection too, and there's a little table outside for those of us who like to ruin our lungs on a regular basis.\n\nBy the time we left it was getting pretty crowded, but I didn't feel claustrophobic at all, mainly because of the seating arrangements and the high ceilings.\n\nCheck out the walls, there's all sorts of interesting stuff hanging up there to keep you thoroughly entertained if you're in need of a distraction for any reason (luckily I didn't that night, but you never know for next time).\n\nAnother reason I need to get out to the Mission more often.", "author": "Sus... B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-19", "description": "What to say about Kilowatt?  It was one of my first Mission Dive bar experiences and it's a true gem.  Between Pool and the associated traditions unique to Kilowatt, pinball, and being dog friendly it's a great spot.  Bartenders are pretty fast and efficient but also manage to be friendly.\n\nPrices seem just a touch high for what you get but are nowhere near unreasonable.  And, like everything else in the Mission they are Cash only.\n\nSo what makes it stand out?  Mostly space, you can move around, stand and mingle, or plop down in a quiet corner at a nice booth.", "author": "David K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-09", "description": "Great place for happy hour and usually you can find a spot to sit.  Kilowatt has the added bonus of Hop Rod Rye on tap, but beware, if you order a pitcher, it's strong.  Try standing up between pints to get a grip on your perfectly divey surroundings.", "author": "Michael M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-10", "description": "I may be slightly biased but my boyfriend and I love this bar. First date was here and we have gone here twice since. We love playing darts, pinball, and pool. And they allow dogs. I love a good dive bar with cheap drinks. This is a great one. Really close to the Bart station too.", "author": "Sarah T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-03-30", "description": "Some things have changed at the Kilowatt; To start with, they appear to have a sober, competent door guy now who checks IDs carefully. Also, gone are 90% the bikers and lesbians, replaced by an odd mix of yuppies, mission hipsters, and generally ordinary folks. It's still an acceptable place for a bottle of beer on a saturday night.\n\nA bottle, specifically, because 1.) You'll have to shove your way through the unwashed masses to get from the bar to your table, and you're gonna spill the first 10% of that pint glass for sure, 2.) I saw them taking new glassware out of the box and putting it on the shelf without rinsing it, and 3.) Pacifico is a buck seventy five for a bottle.", "author": "matthew r."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-09-10", "description": "A dive/sportsbar in the Mission whose name suggests a level of electricity? Hmrph. They do have electricity in the bar, hence the lights, jukebox, and ability to keep things cold. The vibe? Not bad at all, but more 'eclectic' than 'electric'.\n\nI like the fact they have a long bar, tall tables & chairs, and booths. The place boasts multiple pool tables, dartboards & a good jukebox as well. \n\nThe walls host various black & white photographs from past shows (?) with various local bands. I will forever be in love with black & white photography, and am also a huge supporter of local music...so major points to Kilowatt on that end.\n\nAn out-of-town friend and I walked/chatted clear across town to the Mission, and this was the first bar at 10pm on a Saturday night which wasn't obscenely crowded. So...I guess take that for what it's worth as well. \n\nReasonable prices. Stiff Drinks. \n\nThe bartenders are hit & miss. I have been there before when they were more focused on getting drunk themselves and gave poor service...this past weekend they were all about helping and chatting up my date and myself.\n\nI'll be back, when all else fails.\n\nAnd on a final note, don't decide to walk around the city all night after riding 60 miles on a bicycle just hours before. Stupid f****ng idea.", "author": "matt m."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-07-09", "description": "C and I used to come here because it was one of the few Mission bars that allows dogs. We ran with the night here, unless it was a weekend of course, bridge and tunnel folks with whom we do not associate. \n\nWith his faithful border collie camped under his chair, we'd throw back a few strong ones, shoot some rounds of pool, and go outside to smoke. It was one of places to bear witness to the crumbling of our relationship as our lives disintegrated. He had tears in his eyes and I could tell it was over.", "author": "Suzanne R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-01-08", "description": "This is your typical Mission bar.  It's not fancy, can be a bit stinky, has lots of pictures of dogs on the wall.  They have a nice beer selection and have reasonably priced pitchers.  Good, stiff and cheap drinks...just don't ask for a mojito.\n\nRight across the street from the bacon wrapped hot dog cart!", "author": "Luis M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-02-14", "description": "I used to come to this joint all the time, especially back in the day when it was called \"Firehouse 7\", and they had live bands. More recently, I haven't had much cause to make the trek to come here. However, on a recent nite off from Mezzanine, I was out on the town, attempting to track down my ex-girlfriend to maybe hang out.\n\nThat never happened. \n\nHowever, I did run into one of my Mezzanine co-workers, and her very cute friend. So, rather than head over to see Blue Cheer at the Red Devil at my lawyer's invitation, I hung out and grabbed a very cheap beer (yay!) from the bar, which got to me very quickly despite the huge crowd celebrating a birthday. Cool.\n\nBut there were so many people (due to said B-day), we got seperated, and I couldn't even reach the table they were at. So, I decided to kill some time by shooting a little pool, which my regular readers know is one of my fave pastimes.\n\nI eventually was matched up with a cute young lady, who won the previous game. she seemed to be a decent player, but I was feeling good, and thought I'd be able to win in short order.\n\nNope.\n\nI started strong, with several nice shots to open the game, and had a 3 or 4 ball advantage. Then I missed one. She, apparently realizing that this was an actual game, suddenly came alive and starting knocking them in. Even when she finally missed one, I had no shots and wasn't able to finish her off. She proceeded to make a couple difficult--albeit makeable--shots, including a couple tough cuts to leave me with 2 or 3 balls still on the table.\n\n[sigh]\n\nThat being said, I had to admire her sudden skill, so we exchanged pleasantries, but she had to go to do an early meeting at work. So, off she went into the nite.\n\nWhen I sought out my friend from work, she too was gone, along with her hot pal. Damn!\n\nTo top it off, I was too late to catch Blue Cheer. Arrgh.\n\nSo, I went back to my 'hood, and drowned my sorrows at Buckshot.", "author": "ACE A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-05-10", "description": "Dull bulbs. Normally would enjoy such lighting in a dive bar and have in fact in this very same one, as it's a scant three blocks away; watched the Democratic primary here, played pool here often and encountered many an agreeable sort (I especially like the regular who has the antennae). But two burnt-out halfwatts can ruin it for a local sometimes. \n\nNot a great place to pickup - partially to its credit - and the quality of bar tending seems to be wildly bipolar - again, a trait not unshared by its location and general Mission population. Much credit to the lady bartender with dirty blonde hair (at least it is to me in the lighting) and tattoos along her arms as someone I find quite agreeable because I think she laughed pleasantly at a barrage of tongue-in-cheek pickup lines my friend used on her some years ago. \n\nBut this past Thursday night was damn near unforgivable as far as my continued patronage is concerned. Playing pool with a dear friend and his lady Samantha when, following a very understandable practice, one of the staff cleared their unattended drinks from the table. They said as much and were properly, albeit begrudgingly, given new ones. \n\nWhat happened next was beyond silly for people working at a dive bar in the Mission, but I sense Kilowatt is falling off in the way that a business that's been in one place too long, doing the same thing too long, and possibly the owner, but definitely some of the staff are probably pretty tired of it and such an environment, maybe life - and so they lash out. \n\nThe staffer who brought the replacement drinks snidely reproached Samantha for leaving drinks unattended. And would you believe it, she gave him a haughty reply implying her innocence and his negligence. \n\nHe retaliated! \"Your drink was warm, what do you expect?\" \"It was half full and I'd just set it down, are you kidding me?\" Despite verbal indications of optimism (I thought the glass half-empty), Samantha did not foresee shared ground with said disgruntled staffer. \n\nAnd then my friend took his girl's point of view up with one of the lady bartenders - who then proceeded to come over verbally joust, yell even, with her inebriated, upset, and now thoroughly crossed clientele, insulting and lecturing from her faux grunge pedestal.\n\nWhat shite. Bring some joy and personality back into that place please, learn how to mollify mildly upset and drunk customers who are far from rabble-rousers even if they're not entirely in the right, instead of setting them off. Or provide a listless turnstile for fickle drinkers who'll happily slop down a few in a soulless dump because they know they'll never return.", "author": "Max F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-01-05", "description": "Wednesday: January 3, 2006\n7:30pm - 11:35pm\n\nAfter Luis M. and I filled our bellies with sushi, we walked down 16th Street to start our quest for alcohol.  Delirium would have been my first choice, but neither of us has gone to Kilowatt before so we agreed to get a couple of drinks there.  \n\nIt was pretty empty.  There were a couple people at the bar, some playing pool and a few just chilling out outside smoking.  The crowd did pick up a bit at around 9pm, but died down after half an hour or so.  There are two pool tables, two dart boards, two pinball machines (one Terminator) and plenty of space to stand/sit for people watching.  Bathroom was surprisingly clean, but I did ended up with a few bruises on my leg because of this weird structure just outside one of the stalls that I would always bump into.  Oh, I almost forgot.  They allow dogs -- this bar is very dog friendly (framed pictures of doggies on the walls).  As long as the dogs don't come near me, I'm fine.  I was a bit bothered by the wet dog smell though.  \n\nThe bartenders are pretty nice, though the first guy (who's shift ended at 8pm), gave me a dirty look when I asked for a mojito.  The bartender who took over was awesome -- I liked her.  She was on top of things, very energetic and always made sure that we didn't have an empty glass in front of us.  I settled for Anchor Steam/Hoegaarden on tap and rum-coke for Luis.  \n\nAt the end of the night (11:35p)...  the alcohol + water count was as follows:\nLuis M. = 6 rum and coke + 2 glasses of water\nCeleste L. = 2 Anchor Steam + 3 Hoegaarden + 2 glasses of water\n\nGuy #2 met up with us at the bar, so Luis got to meet him before he headed out to catch the BART train home.  We left Kilowatt not long after Luis did and headed out to Delirium for some Coronas.   Will probably go back to Kilowatt again, but I doubt Guy #2 will come along -- he wanted to get out as soon as he got inside. \n\nCeleste L.'s alcohol + water count total after 11:30pm:\n2 Anchor Steam + 3 Hoegaarden + 2 Corona + 2 glasses of water :-)!", "author": "Celeste M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-01-03", "description": "This could have been just another average bar if it weren't for three things:\n\n1) The Nudey Game a.k.a. Erotic Photo Hunt (Best Game EVER!  If you have never played you better get your ass over here--or one of the many bars in the city with this game--you will not be disappointed, I promise...Also just a tip: always choose the 2 person game even if you are playing with a group of people, you get more chances this way)\n\n2) The Jukebox-which played pretty much every song from the Rock Band video game which meant awesome music and a chance to practice my vocals for my next worldwide tour with Eric and the Eskimos (my current jam is \"Suffragette City\"...David Bowie is sexy)\n\n3) $2 special on Sam Adams the night we went\n\nFor these three reasons I will definitely be going back to Kilowatt some time soon...you can find me at the end of the bar, dominating the Nudey Game.", "author": "Katherine C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-03-27", "description": "Kilowatt has a more authentic dive-bar feel than most of the wanna-be dive bars in the Mission.  Maybe it's all the dogs, or the TV's all showing SportsCenter, or all the leather jackets, or the smell of bleach that you can't help but wonder if they had to clean up some blood last night or what.  But there's still a pretty chill atmosphere here.  Not TOO chill, but mellow enough, a nice, \"stick to the business of drinking with your friends\" vibe that is sometimes just perfect.\n\nIt's a big and high ceilinged place, which is kinda nice--still seedy but not quite so dank.  We're almost always able to score a booth up front, provided we lurk in wait for awhile.", "author": "Kevin H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-02-21", "description": "Used to be a favorite, now it's just a memory of what used to turn me on about San Francisco: Hot, young, grungy skaters; pool tables; lots of beer drinkers; great music.  Actually, come to think of it, those things still turn me on, it's just that now, I know how to find them without going to Kilowatt.  So yeah, an old fave always, always have fun here.\n\nNow - I understand the whole house rules with pool, because I'm the first person to call their own slop shots.  However, the doubles rule should be reconsidered.  Maybe just one table devoted to doubles when warranted?  I personally like playing singles better than doubles myself, but just to keep things moving, keep people content. . . ??\n\nDare I mention the free pool here every Sunday, all day?  What the hell!", "author": "Kelly H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-12-18", "description": "I can't believe how many times I have been to this place without having yet reviewed it. \n\nThis is one of my favorite Mission bars but probably because I tend not to come here on a Friday or Saturday night. \n\nPool tables, dart boards, the memories of live music, reasonably priced beer, good eclectic juke box and -  very suprisingly -  no shameful stories out of this place yet. \n\nI know, I know...how is no shameful stories a good thing when we are talking about drinking??? I figure there has to be one place in town that I remain well behaved at, and this one seems to be it...Im holding on to that as long as I can!", "author": "Drue C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-05-21", "description": "Drinks are cheap, bar tenders are nice, pool and darts.\n\nYou can bring your dog, people are friendly here.  It's a huge place on top of all that.  But Friday, and Saturday are pretty packed.\n\nIt's my favorite chill place in the area.\n\nThe only thing is that my friends sometimes like to dance, and in that case we'd prefer somewhere that play music like double dutch or skylark", "author": "Anthonio C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-02-23", "description": "We wandered in from off the street looking for a beer and a chat. Since we hadn't been to this bar before we paused, looking up at the menu, curious at the selection. Let me tell you they had much to choose from!\n\nI overheard what seemed to be a regular \"they have never been to a bar before, look at them, haha.\" I guess I looked fresh faced and young that night. Thank you :)\n\nThe bar was semi-crowded and we were forced to the back near a very popular pin-ball machine. I enjoyed \"The king\" who was in a bean. For some reason this was hilarious to me because it stood out in all its tackiness and I kept looking at it out of the corner of my eye. \n\nOverall, great selection and fast bartender who was happy to serve us right away, even in the crowds.", "author": "Natalie N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-01-10", "description": "This place has a lot of potential. It looks like a cool little pool hall in the Mission with a chalk board full of beers names on the wall. This is also very close to Valencia on 16th, steps away from BART. Nice Nice Nice location. \n\nThe problem is that I don't get the feeling that this place really cares about beer. They have a few decent ones on tap. They had Stone Pale Ale, SpeakEasy Big Daddv IPA, Anchor Steam Christmas, and Sierra Nevada Celebration. (like I said, decent). Do not ask for a recommendation here. You will get a blank look and a guess. \n\nAfter enjoying a big daddy IPA, I decided to fall back on a good old Stone Pale Ale. I am quite sure that is not what I received even though I saw them pull the correct tap. Having been in this situation before and knowing the only way to prove it is to follow the lines in the back room with them and show them. I don't think they are trying to rip anybody off but instead just don't know. The beer I ended up tasted a lot like newcastle. It was not hoppy at all but instead it was sour in the finish. \n\nTo be fair, this place seems like a nice pool hall and for that I am sure it is awesome. If you are looking for a beer bar there are a number of better options in the area.", "author": "Eric G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-09-01", "description": "This is the first bar I ever came to in San Francisco. I had walked 3 miles, almost passed out from a lack of sugar, had a huge burrito and was then ready to drink. They had football on the tv, good drinks, a pool table and dogs running around. I was in love. \n\nIf you come on a week night, their happy hour is also awesome.\n\nI really enjoy this bar because it is long enough that when someone walks in, all eyes aren't on them. Go in the bar, find your niche and do your thing and forget the rest of the world exists. That's why we drink, right?", "author": "Jared S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-02-07", "description": "I love this bar.  It's like 3 blocks away from my house.  Why don't I come here more?  Oh yes, trying to save money and not go out as much.\n\nThat's pretty lame. \n\nOne of the first bars I went to when moving here.  It was my roommates favorite, and luckily we both have similar tastes in bars.  Probably playing some metal - might get a chance at the pool table.  Wide selection of beers for different price ranges.\n\nI miss you, Kilowatt!  I will be back soon!", "author": "Kristina K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-09-07", "description": "fun times. Went here on a thursday night, and was pleasantly surprised. not overly crowded, but a good mix of people. hard to go wrong with the music + cheap beer. + darts and some kick ass pinball, dog friendly, and pool tables. tastyness...\n\n+ 1 for the fact that it was my friends birthday and they gave us a polaroid camera to take pictures with! very rad\n\n-1 cause its called kilowatt instead of jigawatt...", "author": "justen e."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-06-06", "description": "I don't really have many cool descriptive words to toss around about this place.  It's a divey bar, with good beer selection, and two pool tables that have a list a mile long.\n\nI'll often throw my name up on the chalkboards for each pool table, and head across the street to Delirium to grab a drink and a warmup game.  By the time I finish and head back to Kilowatt, I can grab a beer and play a game or two.  After that, it's at least another 40 minute wait before you can play again.\n\nI don't seem to meet too many people, outside of the pool players, who are usually quite good, by the way.  (Pretty much the main thing that keeps me coming back.)  Cheap and varied types of beer is great, the waits kinda suck.  Overall, it's got good pool players, but is just kind of meh otherwise.", "author": "Jesse C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-04-15", "description": "When my heart is set on Zeitgeist but the weather says no, where do I go? \n\nKilowatt. And the reason is proximity, really. I'm not gonna lie. But this place has actually started to grow on me in recent months...\n\nIt's never obnoxiously crowded, but it's always full enough to stimulate good times.\n\nIt draws a good mix of people. Even sports fans, and I love it when they have sports on. Because I hate sports bars, but I wholeheartedly confess to loving sports.\n\nThe service is always good, too. The bartenders are fast and they never mind that I consistently steal olives and cherries from their little thingy on the bar (hey --- it's bold to put it so close to the edge, there...). \n\nAnd this is the one bar in all of SF where I've actually played darts; and I really enjoyed myself while doing so. Before that, I hadn't played darts since the Detroit days.\n\nA sign that I'm really hitting my stride with Kilowatt, I suppose...", "author": "Lisa T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-04-09", "description": "I NEVER run into people I know randomly.  Maybe it's because I'm a hermit.  Maybe it's because I have no friends and hate people.  Okay, that's not really true...I have friends.\n\nIn any case, walking into this place and seeing a buddy I've been meaning to contact along with having a great beer selection, pool, darts, and a nasty ass restroom.  This is the dive bar for me that I will definitely come back to!", "author": "Chris M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-08-21", "description": "I swear every time I stop by to have a drink here, they are always playing horrible music...you know, the scream into the mic, can't understand a damn word, kill your mother/father/significant other, blow your eardrums type of music.  \n\nThey have a good selection of beers, which is why I'm giving it 3 stars.  Other than that, I think they should rename this place to Kill-o-Lot.", "author": "Cyrus R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-23", "description": "This place is fine. They have cheap beer and, from what people keep telling me, a very attractive bartender (I haven't figured out which one it is, though...). They pour some strong drinks, too...if that's what you're into.\nCASH ONLY, don't be a douche.\nI think they should close the pool tables on Friday and Saturday nights, but hey, that's just me.\nWatch out in the ladies room, there is a really tricky step, it's the cause of many bruises.\nThere are often dogs in this bar. So, if you're into that, you'd be into Kilowatt. \nGood place, 4 stars.", "author": "Meghan B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-01-17", "description": "Blarg.\nNow I remember why I never venture out to this part of the Mission.  Of all the bars on this side of the hood, Kilowatt deserves three stars.  The bar is large but too brightly lit for my taste; I really, really, really like dark bars.  The booze seemed cheap but I'm not sure because I didn't purchase my own (hell yes for getting dudes to buy your drinks!), and the bartenders seemed friendly enough.  We went on a Thursday and it was packed, but it was nice.  I'd go back again but would never abandon my Mission Bar for this place.", "author": "Meh M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-02-20", "description": "Overwhelming smell of BO when we walked in but I guess that's what you get when its 10pm on a Saturday night. We were lucky enough to find two bar stools at the bar. The best part were the purse/coat hook under the bar.  The bar tenders were very fast and attentive even with the growing number of barhoppers. There was a wall full wall of framed pictures of dogs....very interesting. The bar was stocked with dark beers...lots of beer I've never even heard of. My boyfriends dream :) there were two pool tables in the middle of the room...I guess if it weren't so packed it would make sense... the crowd of people were hipsters for the most part.... I'd come back for sure if I'm in the area... pretty decent pricing, cool crowd.", "author": "Penelope V."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-12-09", "description": "A good place to hang out and play darts, or just chat, or to drink yourself into a drunken stupor. Its all up to you. \n\nThe drinks aren't too expensive, and its pretty low key. We went here on a Saturday, and it wasn't too crowded, although we might have been there too early for the bar crowd. What can I say - we're getting old and lame (we came here on my birthday, so I have to be at least a little bit reflective).", "author": "Dana L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-02-15", "description": "Great bar, nice bartenders, pool table, $4.50 gin and tonics. All I need", "author": "Marlen K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-27", "description": "I walked into Kilowatt for the first time recently on a Monday night and thought to myself, \"Hell, I should have come into this place sooner.\" Kilowatt is a solid rocker bar that isn't trying to hard to be anything other than a place where you can play Metallica on the jukebox and order booze. Cheap booze. It's not too trendy, not too dark, not too bright, heck not too anything other than a bar. It's almost like what I'd call a \"dive bar lite\".  Kinda think of it as a Lucky 13 that isn't trying quite as hard. And with less Dead Kennedys.\n\nAll in all a great spot for drinks whether you're a local or in the neighborhood.", "author": "Andy A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-11-13", "description": "This place is off the hook!! Walked into a great group of people.  The best part is the cheap booze, but the bonus was the lovely ladies!!", "author": "Jerry K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-06-15", "description": "I must have a pool shark vibe about me.  Every time I go here, older guys always hit on me and/or try to get me to play a game a pool.  Which could be a good thing or a bad thing, depending on who you are.\n\nThought it was simply charming when the delightfully surly bartender snatched the $10 bill out of my hand for my drink.  Easy there, sweetness, it's not a penis and you are not working your second job.  She just needed a hug, I think.", "author": "MakeUp M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-05-29", "description": "The new BF is trying to get me to go to different types of bars and so I got dragged here. I twas like the Hemlock Tavern but in the Mission and bigger. They show sports on the TV's and have two pool tables and darts.\nToo many people in black, too many people at all.", "author": "Kim S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-06-02", "description": "I've only really gone here during the weeknights, so I had no idea that Killowatt got as packed as last night. Apparently it wasn't even so busy. Who knew?\n\nBartenders are so awesome. Talk about a heavy pour and a great deal. Good smiles, all hugs, you get the picture. \n\nIt's a great crowd too. So easy to just sit down at the bar and start chatting with the strangers next to you. I will definitely be back! :)", "author": "Annie T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-10-08", "description": "Came here on the same night as when I went to Double Dutch\nThe bar is huge and we came early on a thursday night.\nThe bartender was cool, she just poured a bunch of pints for my few friend and I. The jukebox sucked. I think by now that big ass bar should already have a \"internet jukebox\"\nA whole lot of heavy metal, which isnt bad, but it (jukebox) just looked old and ravaged and like no employee updated it at all.\n\nIt's obviously a dog friendly bar. My beer didnt quite taste the same as other beers ive had from other bars taps, maybe it wasnt fizzy or cold\nsomething wasnt right. But im sure I'll be back here sooner or later.", "author": "Andrew Z."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-06-11", "description": "I have trouble with crowds, dins, and white belts.\nReally, if not for these frailties O' mine, I might give it five stars.", "author": "Theo R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-09-05", "description": "Friday night plans among girlfriends.\n\nLet's go to 500 club?\nFriend 1: Nah, too scurvy.\nLet's go to Beauty Bar?\nFriend 2: You're kidding me right?\nLet's go to Amnesia?\nFriend 3: Do you have amenisa? You've fucking lost it! There's no way I am stepping one foot into that place.\n-Light goes off.\nDuh, Kilowatt. \nHow many bars does it take to get four girls drunk and happy? One if you're Kilowatt. 3 out of 3 friends agree.", "author": "Vanessa C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-12-20", "description": "Ohhh Kilowatt.  I do miss you.  \nWhen I lived in the city, this was the single bar I went to most often.  Very easy place to walk into, sit at the bar, and have a beer.  No one bothers you unless you want to be bothered. Great juke box, cheap pool tables, darts, and most importantly RACER 5 ON TAP.....oooo baby.  And their location is tough to beat....16th between Valencia and Guerrero...what a great street.  Definitely worth checking out.", "author": "Kyle W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-07-06", "description": "There's nothing special here, you don't want to go here, you probably want to check out some other Mission bar.", "author": "Scott E."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-02-25", "description": "One word: Men. \n\nYes a sea full of them too. We stumbled into this bar that we haven't been to yet. And on a Friday night it was full of people, mostly men...seemed more of a \"regulars\" bar to me. Apparently some men thought we had never gone to a bar before, because of us trying to learn the beer menu (excuuuuuuuuse us!). \n\nA good selection of beers on tap, along with the usual hard alcoholic drinks. The bartender served us right away, and was fairly nice! \n\nWith a bunch of people around you can play pool, darts, or sneak your way to the back for some Pirates of the Carribean pinball. Trust me, you'd be tempted to play...the highest score was like 53 million! \nWe hung out in that corner to veer away from the crowds, under the awesome \"The King\" in the bean decoration (giggles)...you just have to scope it out yourself!  And for the bathroom-it was okay & fairly clean, a lil tiny. \n\nBest of all, it looks like you can bring your dog along. Seemed like a few dogs were running around the night we went! :)", "author": "Catherine O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-02-27", "description": "I really, really like this bar.\n\nOn 16th and Valencia with over half a dozen bars to choose from on any given night of the week, I'll choose this one.  It's probably twice the size of any of the other ones around, it's never retardedly packed and you can usually find a seat, a booth or even a spot at the bar.  It's just a super-chill non-pretentious, laid back place to grab a beer or a cheap stiff drink and play a round of pool.  \n\nIt's usually filled with grungy mission folk good for random and entertaining drunken conversations with strangers.  Go here and you're guaranteed to stumble away satisfied.", "author": "Shayna N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-12-14", "description": "I attempted to go to the Elixir Absinthe party last night, but I couldn't penetrate the mob of boys, so my friends and I decided for a more relaxed evening at Kilowatt.  \n\nIt's your typical dive bar.  Dark.  Cheap drinks.  Red lighting. But what Kilowatt has that many other dive bars lack are the high booths.  They are cozy and private.  Good for drunken intellectual or not so intellectual chats with friends.  \n\nLast night was an exceptionally special night.  For some reason the female bartender was very generous.  My friend went up to get drinks and when she came back she had two drinks on the house.  The bartender thanked my friend for her patience and said the first two drinks were on her.  Cool, but what?  She couldn't have been gone from the table for more than 5 minutes.  Sweet!", "author": "Alexis M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-12-16", "description": "Been here at least a half dozen times, but this was the first time I've been lucid enough to actually remember the name.\n\nIt reminds me of bars I've been to in the midwest and texas.\n\nExcept they serve more than just Bud.\n\nGood beer selection and cheap stiff drinks.", "author": "Rocco B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-18", "description": "Loud and can get crowded, but in a pretty good spot and all kinds of cheap drinks.  Also, Josh rules.", "author": "Byung Ho B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-08-02", "description": "Went over here last night and was pretty impressed.\n\nIt's a beer and liquor bar, with two pool tables, some nice enclosed four person booths, a large jukebox and an astonishing amount of dogs.\n\nThe bar is surprisingly light by San Francisco, industrial in design and can get fairly crowded at times. Still, not bad, but could do with a bigger whiskey collection.", "author": "Iain T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-04-16", "description": "Okay, not quite the kind of place you would normally find me in.  But I liked it either way.\n\nI'm not a fan of the jukebox, since I couldn't find a lot of things that I liked, but I guess it wasn't annoying me either.  I like rock, just can't listen to it for more than like 30 minutes without getting bored or annoyed...lol\n\nI don't drink alcohol no more, so I can't even tell you how the drinks are.  I tell you one thing, they had a wide selection of beers on tap and the young lady with the tats made me one helluva Shirley Temple.\n\nI spent most of my time here talking to a friend and playing Nude Photo Hunt.  Not too bad at all.\n\nThey also have a few pool tables, a pinball machine, two dartboards, and lots of seating and tables.\n\nCool place, I can see myself coming back with the same people I went there with.  \n\nEnjoy..=)", "author": "Mike V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-02-23", "description": "Kilowatt has been a long standing favorite since seeing the leftovers of the Pixies, sans Frank Black & Kim Deal, playing to a packed, rowdy, bike messenger and bike messenger-wannabe crowd. \"I still love you Kim... Le Sigh!\" There were more tat's and black attire than there was beer in the place that night. \n\nThese days \"The Watt\" is a gentrified (I use that loosely) 16th & Mish version of  Zeitgeist. Hoegaarten on tap. Unbeatable featured happy hour beer special (2.50/pint). A crowd that inspires longing for the Grunge band days. If you close your eyes, with a mouthful of porter, you'd swear that you could smell teen spirit. \n\nBonus features besides that healthy beer list: booths, 2 pool tables, and they allow dogs.", "author": "Johnny C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-22", "description": "This place was superb.  The bar staff made my cocktail efficiently but with lots of attention to detail.  I would go here any day.", "author": "Jeff D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-04-16", "description": "I heart dive bars and the Kilowatt has a slightly more upscale dive feel. It doesn't compare to my favorite dive bar in the world, 8ball in Ann Arbor but... This place gets crowded and yes people are drunk and last saturday some chick puked in the bathroom but isn't that what bars are good for. I like the decor, high ceilings, the photographs above the bar. The staff is nice and attractive, which is always good.\nThe best part of all is that they have darts. I have been scouring this city for darts and finally found a bar with some now I just need some people to play with.", "author": "Eryn L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-03-30", "description": "This is pretty much a dive bar-- but its awesome... it's dog friendly, the beers are cheap and they have dartboards!  Im not very good w/ the darts so i have to be careful not to dart-my dog when playing...  \nshe likes to bark at everyone & has a great time eating whatever she can find on the ground...", "author": "Nicole G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-07-31", "description": "It's quite sad but even though I grew up in the Bay Area, my friends and I never kick it SF. Now that I'm older and have realized the graveness of my mistake, I have made an effort to better explore the city of my childhood. \n\nSo on a recent trip back to the Bay, my friends and I accompanied my SF savvy sister and went to the Mission District because in her words, \"The people there are the real SF.\" This was one of the bars we hit.\n\nWe showed up at 10 pm at the place was EMPTY. The only people sitting at the bar were me, my two friends, and my sister. The place was a dive. But a nicely decorated dive bar. The bartenders were nice though and while the drinks were more expensive than Delirium, the bar we just left, the prices were still reasonable. \n\nIn the back, there was a small dance floor. There were about ten people dancing but that small crowd consisted of a gay man wearing a hoody and daisy dukes, three African American people, and a couple of fobby Asian people who couldn't dance. \n\nThe saving grace for this place was the music. There was a DJ who was spinning alot of hip hop and rap but from the past three decades so there was alot of variety.", "author": "Jamie Q."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-08-26", "description": "When my friend and I walked in around 5pm, we were possibly the only girls, that wouldnt be a problem except that all of the guys stared at us with weird looks, like thinking, \" what are you girls thinking coming in here to drink?\" We pushed the uncomfortable feelings aside and got two beers, which were at a good price of $2.75.  There are all sorts of good beers on tap, and I guess you are allowed  to bring your dog in there which would be rad if I owned one.  Instead I got stared at the entire time by a big german shepard maybe wanting my beer? who knows. \nBesides all of that:\nGood beer, good happy hour prices, interesting atmosphere, right next to a rad thrift store...  I will return.", "author": "Sonya D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-18", "description": "Lots of beer options, okay seating on weekdays, not okay seating on weekends (typical Mission bar), cash only (typical Mission bar), 2 pool tables (long lines usually), 2 dartboards, and lots of TVs for sports-lovers like me.", "author": "Charles N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-08-17", "description": "Must love dogs! Fine selection of beer, the sweetest puppies greeting you and a few pool tables? Hard to beat! I will be back! So far, my favorite local bar. I mean, dogs in a bar? Awesome. \nIt can definitely get crowded, as the grouping was piling up a bit after 10 but, suffice to say there are plenty of other bars to wander to down 16th so, after a few rounds and staring contests with a few bored pups, you'll be ready to cross the street and wreck havoc in that direction. All in all, a decent dive-ish bar stop, that makes a unique mark with its animal-loving policies.", "author": "Jessica L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-09-05", "description": "One of my Mission staples. \n\nKilowatt is as unpretentious as Mission Dives get. The bartenders are curt, but not rude (hey, there's a LINE behind you, what do you expect?), drinks are totally reasonable, & it's spacious & not too loud in there.\n\nWhen the plan is the Mission & the conversation steers its way to Kilowatt as a meetup location, I've never once steered it to someplace else. It may not be my all-time favorite Mission haunt, but it's the perfect standby.", "author": "Pete J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-09-28", "description": "I'll keep this short.\nDope as shit. A great place for various creepy, crazy lectures from the sad and the jaded. Most of them start stories or thoughts with the preface of \"you're probably gonna punch me in the face for saying this but...\"\nand then proceed to ramble and never make any face-punch worthy statements.\nOutside is just as fun: this homeless dude offered to recite some poetry for free after I explained that I had no change to spare. He was actually pretty good! Granted I was walking out of a bar at the time.", "author": "JAYCE B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-07-27", "description": "The kilowatt is in my regular bar rotation and there's a lot to like about the place.  It's a pretty big space with booths, tables and the bar area.  You can be amongst the crowd or hole up in a booth or on the little platform area in the back if you want to just be amongst your peeps.  \n\nThere's alot to do at the Kilowatt which is a main part of the appeal for me.  They have a bunch of TVs and take their sports pretty seriously for a mission dive bar.  They have the NFL Sunday ticket and people also go to watch hoops and hockey.  If watching sports isn't your thing, there's a bunch of bar games to keep you occupied.  They have two pool tables and there are lots of good players who frequent the Kilowatt.  The first table is pretty competitive almost any time they're open and the second table is a little mellower for those who aren't quite so serious.  They have 2 dartboards in the back, some pinball and, of course, photohunt.  Or, you cant just hang out and listen to the juke which is excellent.  More Dinosaur Jr. gets played here than any other bar I know.  That scores points with me. :-)\n\nThe crowd is pretty standard for the mission.  There are lots of regulars and alot of the people who work at zeitgeist and other places will also hang out here.  The bartenders are all quite good though I do miss Andy who made the best bloody marys in recorded history.    \n\nAll in all, it has everything I look for in a bar and it's a relaxed and comfortable place.  I can't wait until football season when I pretty much live at the Kilowatt on Sundays.  Good times.", "author": "Zach J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-01-16", "description": "I had forgotten how much I like this bar.  The drinks are reasonably priced - $7 for a rum&coke and an Anchor Steam.   The customers were all friendly and unpretentious.  Plenty of seating and room to move (though it was Tuesday).\n\nBest of all, They have 2 pool tables for only 50 cents a game and a good pool table culture, i.e. no doubles and winner stays.  It attracts some talent, but makes for pretty short waits between games. Last night, I shot for a truly horrid 1 win and 9 losses, even managing to lose to the girl drinking Xanax-coladas and sliding off her stool.  Hooray.\n\nAll in all a great time though.  I met some cool regulars and this place  has way more girls than my other usual pool spot, Molotov's. \n\nAlso, props to the bartender for getting Xanax girl safely to a cab - alone.", "author": "matt c."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-03-03", "description": "Best bar is SF. Here is why:\n\n1. Killer jukebox if you like hard rock and metal. I ran into Matt Pike from High on Fire here. That pretty much says it all.\n\n2. Cheap drinks. I've been here about 500 times, and never realized how cheap it is because I always get wasted. Just recently someone pointed out that you can get like 5 drinks for $20 and I realized why I always get so wasted.\n\n3. Pictures of people's dogs and motorcycles. They're everywhere.\n\n4. Relatively low hipster factor.\n\n5. Some semblance of a hockey theme.\n\nI'm not gonna lie - this probably isn't the best place to try to throw your game around. However, if you want a killer atmosphere for boozin' and rockin' out, look no further.", "author": "Dan M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-02-12", "description": "This place has one of the great jukeboxes in the city, and although I generally have a hard time convincing friends to go here, I end up here every now and then anyway.  \n\nOne time, during a weekday happy hour, I was the only person seated at the bar.  I was killing time before a Nick Cave show at the Warfield, and the bartender started talking about rocknroll music with me.  He told me a story about how he'd worked at the Great American Music Hall years earlier.  Mark Lanegan was scheduled to play there one night, but didn't show up for sound check.  Apparently, he'd been busted just outside the venue trying to purchase contraband from an undercover police officer.  \n\nThat's pretty much the whole story, and at the time I found it fascinating.  \n\nThe same thing could probably happen outside of the Kilowatt, were it a live music venue.  \n\nWhich might be a good thing, depending on what sort of tall tales you're looking for in this, the city of midnight fairy tales.\n\nSort of.", "author": "Gopal R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-12", "description": "When I was finished I walked to Kilowatt, my old dive bar hangout, and had an IPA. The same rock bodied bartendress was there form my early 20s and she told me that recently she had studied dog homiotherapy and I witnessed her take a whining puppy and calm it to sleep, cradled in her arm, while she calmed the happy hour lonely guys to sleep with her beer and lack of pretentiousness. Refreshing in the Mission. In the Mission, pretentiousness and sincerity are at war and both are your key in and key out of a potentially stagnant culture which in its own variety is the antithesis of variety and yet a primordial soup of art and non-yuppie middle class people.\n\nAnd I felt free, and that is almost all that matters in the world.", "author": "Rocker D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2005-09-05", "description": "Free pool Sundays on little bar tables that they just re-felted (is felted a word?). This is a place where either: I've never played on a bar table before and it felt like a toy compared to a 9' table, but man you get a steady stream of players writing their name up on the board and it is a lot of fun. Everyone who plays is super friendly too. I love it.\n\nI also sunk a few bucks into one of their two pinball tables and declare myself the worst pinball player on the planet. Still, a fun bar that allows dogs, external food (have to run across the street for a burger) and did I mention free pool Sundays?", "author": "Jordan M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2006-11-16", "description": "Meh.  \n\nI didn't like it.  Went here with the girls couple nights ago.  The people in here (when I went) were sleazy old males eyeing us up and down.  I felt violated just by sitting there.  The music was loud and horrible.  Maybe if it had a better girl/guy ratio, some better music, and younger people it would have a chance with me.  But it was big and almost empty.  Which means it was boring.  Zzzzzzz.", "author": "Mary R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-07-31", "description": "3.5 stars, rounding up.\r\n\r\nthe missus and i got d-runk here on friday night when we were out celebrating her completion of the bar exam.  good times!  (well, mostly.  i can't say that saturday from 2:30 a.m. to 2:30 p.m. was all that much fun, but that disaster was completely of our own making.)\r\n\r\nanywho, about the bar itself.  they have a pretty nice selection of beers on tap (but did i need to drink 80 oz. of them?  probably not), two pool tables, a couple of dart boards, and a lively, youngish crowd.  it ain't the fanciest, cleanest, brightest, or roomiest place around, but if that's what you're looking for, you probably shouldn't be checking out bars in the mission anyway.", "author": "Jeff W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-01-25", "description": "My boyfriend and I came here last night (Saturday) at about 1:15 am to grab a drink before going home.\n\nIt was packed, but we still managed to get our drinks within 5 minutes. Very nice! My cranberry vodka was quite strong, so that was good.\n\nDecent place, but my boyfriend describes it as an \"institution.\" I felt a bit out of place. A lot of loyal locals come here. Though I do fully enjoy seeing the cute cute healthy doggies. =)", "author": "Angela H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-05-18", "description": "Great bar!\n* The drinks are cheap.\n* They have two dart boards in the back. (with real darts)\n* Pool table.\n* You can bring in your dog.\n* The bar is pretty big and you can usually find a table if you're with a few people.", "author": "Jackie G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-09-14", "description": "As the only bar I know of around town that serves New Belgium Sunshine on tap (the only beer I can find that even compares to Hitachino White Nest Ale), Killowatt automatically rules; however, the reasonably douchey after work crowd tends to slightly sour the delicious taste and pleasant effects of this beer. And nobody fucks with my beer, particularly when I'm drinking good beer instead of swill for once and particularly x 2 when I'm drinking beer that I can't find anywhere, not even the goddamn BevMo!\n\nLuckily, Erotic Photohunt (again, the babes not the dudes) saves the day as do the friendly and fast bartenders. And I'll add an extra star to this review just because a Killowatt bartender once played \"Reign in Blood\" in its entirety.  And that ruled hard; especially because indie rock queen herself, Julie Andrews, was sitting next to me, totally appalled.", "author": "Chloe S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-01-31", "description": "EDITED 2/6/08\n\nI had originally written a long entry chewing out a girl for writing a completely ignorant and false review, and as it turns out, she felt compelled to delete her entire account. My work here is done. \n\nAnd now for my real review:\n\nI like to think that a bar is only as good as its staff and regulars. And the regulars here are nice, loyal, and hilarious. After a while it does feel like a family. The staff is unparalleled in both personality and efficiency. \n\nWatch out for the pool sharks, everyone there plays like they're on the pro circuit, I got my ass handed to me several times by an old but hilarious man named Jack.  Do NOT mess with Jack.\n\nThe men's bathroom is awkward from what I hear, the women's bathroom can be one of those places where you walk in alone and walk out with 8 new best friends who all LOVE your shoes. Last night I had to yell at a dude who thought it was perfectly acceptable to use the women's bathroom, and to be honest that happens here a lot. What the hell dudes? Pee in your designated area!\n\nAaaaaand for the best part, the computer game thingy. I'm part of a small but talented league called the Touchmaster Masters, look for my name in the number 2 spot on the erotic photo hunt scoreboard. That game is addicting. Seriously, we call playing that game 'smoking the crack pipe.'\n\nI don't recommend coming here on a Friday or Saturday, unless you're a crowd person. It's gotten to where it takes ten minutes of \"excuse me\" \"oh sorry\" \"can i get past you?\" to get to the back. \nAnd another tip? If you see a dude carrying a case of beer or empty glasses, get out of the way! He's helping to get you drunk!", "author": "Jb O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-06-24", "description": "Love this place. They've got a chill atmosphere, a huge beer selection, and DARTS! I also love that the darts area is elevated at the back of the place. It allows for uninterrupted, semi-private space that overlooks the rest of the bar. Cash only spot. Playing darts is free, but you need a $10 deposit to borrow the dart set.", "author": "Julie T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-03-05", "description": "Nothing special about this spot. The drinks and staff are fine but never impress. I think they survive by virtue of their location, but there are many better options within a 2-block radius.", "author": "Quinn S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-03-13", "description": "Easily my favorite SF bar. The pool players are generally excellent but not too excellent, not snobby and not territorial. The competitive nature of the two bar tables is exactly what I like. Comfortable places to sit. Good beers on tap. Ms. Pac Man for when there's no Giants game on or while waiting for your turn to beat one of the many fine regulars at a game of house-rules 8-ball. I've hesitated to write a review because it almost seems like a secret that should be kept - the problem is that with 332 reviews and a prime location, it isn't a secret and never will be. The place is usually crowded at night and even during the day the wait for a challenge is at least 4-5 people long, if not more. To me, that's a plus.", "author": "Henry M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-01-09", "description": "What's up Camper, I'm from the \"Look Ma I'm Slumming!\" crowd from North of Market, and I was here last Saturday.  Touche!\n\nIt's decent, but what's up with all the unutilized space in the back?  There were several groups scouting out tables, while they could've easily put up some more tables back there.  Also, the Magnet Bar has more dogs.", "author": "Rego S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-02-21", "description": "The votes have been counted, and the results are in.  The Kilowatt is officially my favorite place.  Congratulations, Kill-a-slut.  You've earned it.  \n\nI think it was the booths that stole my heart away.  Big booths in front  and back.  And pinball.  And the dirty video match game.  I fucking love that shit.  And that one bartender who reminds me of that one guy I used to know.  And enough metal on the jukebox to scare away douchebags who wander in.  \n\nI mean, you're not like a fancy party dress that I can't wait to wear, but more like my favorite pair of jeans that I look hot in, no matter how dirty they are.\n\nAnd as if I needed more proof that this place is awesome, when I stopped in on a random Sunday afternoon I saw no less than THREE of my favorite bartenders in town just hanging out there drinking.  It's my favorite new alone time bar.  I don't know any of the skeezers there yet, and I'm gonna try to keep it that way.  It's a lot funner to hang out if everyone in the bar hasn't seen you totally shitty.\n\nEDIT:  7/11/07\n\nMy love, it grows and grows.  When you're totally pissed off on Sunday afternoon, and don't want to see any of your goddamn friends, but just listen to metal, drink beer, and play the shit out of some pinball, where ya gonna go?  \n\nKILOWATT.  Ghostface Killa was right.  All around the world today, the Kilo IS the measure.", "author": "Coco D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-10-21", "description": "I saw Jawbreaker and Zeni Geva there.  \n\nFastest bar drink order I have received in a long time.  Great lady bartender, packed with a sharp style of gorgeous and stylish body art.   Triple-double tip in a bar with sports.", "author": "Rusty M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-04-10", "description": "I realize the entrance might be a little intimidating if youre not comfortable with the random dogs, bikers, and whoever else that walk in.  But, I thought it was fine.\n\nSo, for the person looking for a non-white person to walk in.. well.. I did yesterday and had a good time.\n\nWe just had a couple drinks, the guy behind the bar was friendly, told me the special, a summer wheat beer, and it was a great deal.\n\nAmbiance is about what youd expect but it was comfortable, easy going, and despite the presence of dogs, no sh*t on the floor!\n\nhaha", "author": "Cyrus S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-10-15", "description": "Killowatt is my first neighborhood bar.  Strolling over for a Stone Pale Ale and shooting pool was always a great place to be.  Definitely a top fav city bar.", "author": "Tiffany P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-02-19", "description": "What do we have here? A dive bar? On 16th and Valencia? With dogs?\n\nOkay, so not the most uncommon thing in the area. In fact, maybe the quantity of these places is a bad thing and is why 16th reminds me more of Rush Street in Chicago than the hispanic grit that the mission is supposed to be know for. But, Kilowatt stands out from most of it's surroundings for me.\n\nThey have a pinball machine, which is an immediate plus, and all the bartenders have seemed to be real people as opposed to the traditional San Francisco fare (e.g., you ponder if they turned in a head shot with their application).\n\nBest of all, it doesn't have a theme. If it's supposed to, they didn't do a very good job of expressing it. Which is awesome. It's just a bar.\n\nDrinks are reasonably priced and everyone seems friendly. The place has a casual haunt, regulars kinda vibe, which is rare in the city. I like it.", "author": "Aiden B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-21", "description": "any place that allows dogs and has TURBONEGRO on the juke box is automatic 5 stars", "author": "Erik L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-02-11", "description": "Cheap drinks, and an ice hockey themed decor.  Of course the boyfriend loves this place.\n\nGood neighborhood bar. Never had a bad time in here.  \n\nDon't wear heels in here, or you'll stand out.  Or be like me and don't care.  I was dressed up to go bar hopping in skinny jeans, heels, and a halter top and everyone looked at me like I was from another country.  But once I got over the stares, and ordered a beer, the stares stopped.  \n\nStill had a good time.  Just don't come overdressed or if you do, ignore the stares and they'll stop.  \n\nBathroom is gross though.  Pee squatting, or pee at home.", "author": "Denise B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-20", "description": "I like Kilowatt because it's a good size, not too small and crowded and never too empty.  It's kind of dark and danky, but the bathrooms are always relatively clean- thumbs up on that one.  There are usually booths open and stools if you don't go on a weekend.  It's a great place to hang out with friends or stare at the TVs, or be weird like that girl I saw yesterday sitting at the dark bar reading a book.", "author": "Skye W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2005-10-21", "description": "I used to go to 'the watt' all the time.  I mean, 6 days a week.  I think that one week I was 86'd two or three times.  Believe that?  I know, stupid.\r\n\r\nAnyway, the drinks are strong and the bar is crowded.  Just typical Mission bar wit some pool tables.\r\n\r\nUsed to be a really big coke bar.  I don't see as many people sniffing the mirror like they used to.  Makes for a more pleasent night.", "author": "Thadd L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-11-19", "description": "Four stars for sheer hipster divey rock and rollin'. I haven't been to the Kilowatt in years, and ended up coming here last Friday night with some co-workers I ran into in the Mission after dinner at Bar Tartine. One of the co-workers was WASTED ASS DRUNK and so I ended up doing a lot more baby sitting and damage control than I wanted to. When I wasn't trying to manage (a.k.a. avoid) a liquor fueled breakdown/TMI confessional, I had a chance to appreciate all the reasons I still love the Kilowatt:\n\n1) Loud, good music\n2) No frills drinking\n3) Cute hipster guys standing in little pods, too shy to talk to the ladies\n4) Dogs wandering around\n5) No one really looks twice, or even once, when people fall down. And many people fall down.\n\nAfter happy hour in the FiDi and dinner at an overpriced restaurant, the Kilowatt was the antidote I needed.", "author": "Angie R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-01-11", "description": "when I was 21 years old I came here several times a week. At that time in my life i was also a borderline alcoholic , and was fond of (gag) whiskey sours. I would wake up in a pool of my own whiskey induced sweat and wanted to commit suicide. I had problems!\n\nI like this place for several reasons:\n\n1. it is a large place, you will never feel claustro.\n2. a great ass jukebox\n3. hot bartenders\n4.touch screen games where I will kick anyones ass in music trivia , just try my ass\n5.pool tables\n\n\nthey also used to have these great condiments for martinis or something called Tamolives which were a strange voodoo hybrid but they sure were pickly tasting goodness.", "author": "Lauren V."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-08-17", "description": "Eh this place is ok. Two pool tables doesn't make it a pool hall. For locals in the area this is a great dive to hang out at I'm sure. It's pretty chill. Never really crowded. It gets two stars because how many places have good beer selections in SF? A lot. 2 pool tables a pinball machine couple dart boards.... eh ok. So nothing really wow's me. Maybe my mind will be changed some time.", "author": "Christopher F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-03-29", "description": "I play darts here. Don't even try to touch my skills. After warming up with a few pints of Boont the domination is unstoppable. To top it off they recently got new dartboards.\n\nGood place to meet up with peoples as tables are usually readily available. A pitcher for each of my friends please barkeep, we don't need no stinkin glasses.\n\nGood beer selection.", "author": "Willie K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-12-15", "description": "One star?  Yes, of course I have an axe to grind.\n\nI live around the corner from this bar, and have been here about 10 times.\n\nWhat's this bar have to offer?  Beer.  Some decent people.  Maybe a game of pool if you're lucky.  That's enough to make me like, even love a bar.  But I don't like or love Kilowatt.\n\nI went in there on Saturday early evening, and this brunette bartender carded my girlfriend and I.  Now my girlfriend is 21, blonde, and younger than her age when she's not wearing makeup, etc.  The bartender went to consult with a co-worker on her ID (which was from Georgia).  No problem.\n\nWhen she came back, she was saying \"oh, I apologize about that, you have to understand that its a $5000 fee if we serve someone under-age, and this ID is kind of beat up.\"  I guess she had also never seen a Georgia ID.  We laughed and said \"No problem, now can we order?\"  Apparently there was a misunderstanding.  She was not going to serve us.  Because of her own ignorance.\n\nSo we went home, got another picture ID and a copy of her birth certificate (hey, we live around the corner).  When we went back, we showed it all to the doorman who promptly let us in (and apparently refused to relay that information to the bartender).  So when I order drinks, we have to show it all to the bartender _again_, who claims that she doesn't even have a doorman (when I point him out to her, she gets bitchy and has a sarcastic-wink-seizure), and refuses to serve us based solely on her desire to prove a point.  Get off your high-horse, power tripping bartender!\n\nI wish I could say that this whole saga was a solitary event in a long love affair with this bar, but its not.  It's indicative of what the bar is like.\n\n(There is one bartender who is a big guy with curly hair, and he is the exception.  He's an awesome guy.)", "author": "Braden T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-04-18", "description": "Okay, I so rarely go to bars that are not located downstairs from where I live. (I live above the broken record, yelp it.) Partially because of laziness and partially because I don't have an adventurous spirit. I went here last night on a birthday trail, and I have to say it was mad fun! Drinks are strong and decently priced plus they gave us a bottle of champagne because it was my friend's birthday. Holla! I had a great time; the people seemed nice enough and the staff was very nice too. If I can get my lazy ass down here again, I'm sure I'll have a great time.", "author": "Jessica R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-04-15", "description": "This was always my favorite dive bar in SF.  Friendly folks, good beer, and not too crusty.  It's a nice mix of people, and I always feel like there is enough room to navigate.  \n\nI returned to SF after 5 years of living elsewhere and the place hadn't changed. I was so relieved.", "author": "Lulu B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-02-09", "description": "This is a very basic joint, just a bar, a handful of good regional micros, and some TV's. \nNo food, but you can run across the street and bring some back. \nI've never seen a band play here, it's just a good place to drop in for a pint or two after/before dinner elsewhere in the Mish.", "author": "Melissa L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-03-26", "description": "I wouldn't really describe this place as \"dingy\" or \"dirty\" like some others. It felt more like a generic sports bar to me, nothing really that interesting. \n\nThree things, however, make me give it 3 stars instead of 2: fairly cheap drinks, pear cider on tap, and lack of pretentious atmosphere. An okay place, but definitely not worth going out of your way for.", "author": "Annee T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-11-14", "description": "Two words: Retarded Crowded\n\nI imagine that means it is a good bar. But I couldn't tell.", "author": "Alexis B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-08", "description": "Everybody know this place but for some reason I'd never been here.  Well, that oversight has been cured and cured good.  Great place, nice bartenders, lots of seating and a good juke box.  Can't wait to go back.", "author": "Corey V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2005-03-24", "description": "Matusis' review says it all. They have two pool tables and some dodgy dart boards. Dive bar with pub games. Nice.", "author": "Bob G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-05-01", "description": "For some reason I had been hesitant to go in here... Don't know. Something about it. Not for the last time in my life I turned out to be wrong.\n\nNice place. Cheap drinks. Bartender was cool. Wasn't too busy (it was Wednesday). Good darts setup and they only charge a deposit! Has a sort of biker bar feel, but mostly it was just a solid place. Thumbs up, I'd go back.", "author": "Matt C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-07-01", "description": "I stumbled in here with some friends to celebrate a birthday, there was a huge crowd outside, and as we entered the bouncer informed us that they were shooting a porno inside, and if we were okay with it we needed to sign waivers. YEAHDUH.  So after the paper work was done...let me just say things got a little rough,  I won't go into the details of the porn, but it was rough.  I was kind of worried about where to sit because I didn't want to sit near where they were filming, kind of icky... It was quite a spectacle (and I was lucky enough to get some pretty interesting pictures on my phone).  But the bar provided free drinks and pizza for as long as they were shooting the film, which was amazing.  It was a bizarre experience, but I'm glad I did it, a great story to tell.  As for the bar, it's a typical San Francisco dive bar with cheap drinks.", "author": "Sarah G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2005-11-03", "description": "You can all stop whining about this great watering hole not having live live music any longer.  The best show of gratitude in the world is when Turbo Negro hung out here after their last show because Peter gave them a big break by letting them play there back in the day when pseudo homo metal wasn't so cool.\nGreat bar to watch all the sports you can handle because they have the hockey & football packages. Mmmmm, packages...", "author": "Colleen B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-03-07", "description": "Hands down my favorite neighborhood bar, and it's definitley better than all the mediocor alternatives accross the street.\n\nThey've got a fucking fantastic beer selection, available by the pitcher, for more than reasonable prices. Even with the wide selection they have available they do a good job at keeping the beer fresh. There's a couple of pool tables, but what really does it for me is the two dart boards in the back (recently replaced)! and usually vacant. \n\nThe bartenders are \"rough & tough\" and don't exactly \"serve you with a smile\" but once you've been in a couple of times you can flag down a bartender & get a drink in your hand faster than you can say \"another one please\".", "author": "Jeff S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-06-07", "description": "I'll always have a soft spot for Kilowatt because it was here where my current man & I had our first \"real\" conversation back when we were just starting to date. Actually, we weren't even dating yet; he was interested, I was skeptical, but he seemed so sure of himself... but I digress. \n\nThe drinks are cheap, it's right around the corner from my place, and on that night when E & I were getting to know each other, I went in wearing my most unflattering pair of jeans and my dad's coat (long story), and no one in the bar seemed to care. Oh and like others have mentioned, there's a pinball machine in the back. It also reminds me of this pub in Bretagne, France that I stumbled into 2 years ago, so an extra star for the nostalgia factor. \n\nMinus one star for the [rock? metal? I don't know!] music. I'm not open-minded when it comes to music, so if it's not on KMEL or KBLX, I don't like it! But that's just me.", "author": "Iris V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-07-30", "description": "Came here last night with G for his friend's Bon Voyage party - Typical dive bar but I think it has its own unique quirks. They had a lot of different beers on tap to choose from but we always stick with Stella. There was a few pool tables and some serious players were on it last night - they were quite into the game and I think we bothered them by bumping into them the whole night but I'm still alive so you know this place isnt' known for their shankings. Cool place overall - I would come here again (Oh and cash only!).", "author": "Kelly T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-08-28", "description": "Kilowatt draws folks from around the City to its flame.  Hipsters, hippies, and yippies expanding their social comfort zone should hit the Kilowatt any night of the week.  The few times I've gone the vibe has been low key, yet cool. Not the euphemistic \"Marina Cool\": cliched over-exposure or the wealth=worth mentality found in slick financial district nightspots. \n\nThe bartenders are attentive and the drinks: strong and cheap.  Extensive seating makes it the perfect spot for a girls' night and the steady pool game makes meeting new people straightforward.", "author": "Amy K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-10-26", "description": "Kilowatt is ELECTRIC!  Sorry...that was corny...and those kinds of jokes don't fly at this place...\nThis place is awesome, I feel like i can go there looking like a complete scrub and still fit in.  It's totally awesome!!  This is da place to be if you want to be around other drunkards and that's what i love about it.  You can get annihilated at this place and it's totally okay to do.  I love the bathroom references to this place too, because it's so true...I mean the bathroom is so small and smelly, but it's totally what gives this place the character it deserves.   The people here are all really chill too which makes for a great drunk atmosphere.  Playing pool here is awesome as well, but everyone is like a freaking pro at this place.  I like to play and bet shots on games even though i suck, but it's still cool.  I recommend this place for drinkers and non snobby people.", "author": "christopher h."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-12-15", "description": "In the middle of our little Mission bar crawl, my friend and I finally found ourselves sipping a tasty happy hour porter at the Kilowatt. I wish I could remember the bartenders name, because I really think you all need him to make you a margarita.", "author": "Mez L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-05-23", "description": "A great bar for a cold Sunday night! \n\nI hate having to pee here!", "author": "Maddy S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-01-25", "description": "The dim lighting, pool table and dart board may deem it to be the average dive bar but it exceeds the average dive with its good vibes and jukebox music, inexpensive drinks, and doggie shrine. I was surprised to see a couple cute dogs when i walked in. The bartenders are really nice and laid back. Just remember to bring cash; most bars in the mission are cash only.", "author": "Katie D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-09-12", "description": "This is hands down one of my favorite bars in San Francisco, and one of the cleanest nicest bars you will find in the \"dive-bar\" category - including the ladies restroom. There is quite a bit of seating here, a dog-friendly policy, two pool tables, two dart boards, pinball and Ms. Pac-Man. The bartenders are cool, friendly and make decent, reasonably priced drinks. Collectively all of this makes the Kilowatt one corner in my own personal heaven.", "author": "J F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-09-14", "description": "totally fun bar to meet up with friends (and possibly surprise your bf with cupcakes on his birfday!) really friendly staff, good seating, music is just right. beer choice for the evening: mothership wit. yum. so the whole purpose of going here was the use the pool tables and darts.. but they were always full. so we are going to have to go back on a non-weekend time for that. the chicks bathroom was clean which is a huge plus. don't like cash only places, but i'll let it slide. pups allowed in bar = awesome.", "author": "Abigail W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-02-01", "description": "Pretty chill place, there were a lot of bums out front but it was pretty late when I decided to wander in. The beer was delicious and reasonably priced everything is listed on a huge blackboard on the wall, nothing over $5 really. The bartenders were hard rock kind of guys but real chill and down to earth.", "author": "Mike S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-12-31", "description": "Besides serving my favorite beer \"Hop Rod Rye\" this review is solely based on the jukebox. You're really making me feel fucking old now. Pavement, Sonic Youth, Melvins, Pixies, Mudhoney? This is 1989 right?\nHas the jukebox been updated in 15 years? Maybe I can bring over my Dinosaur Jr., Replacements, Husker Du CD's. How about some Big Black? Is the new music out there not worthy, or are you guys just lazy?\nAt this time I really don't care. Glen Danzig sounds sweet to me.", "author": "Tim S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-07", "description": "Hipsters everywhere! But lots of fun with the right crowd. Plus they have Czechvar!\n\nAlmost as many hipsters here than your typical American Apparel.", "author": "Rocky K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-20", "description": "One of my favorite bars in the Mission cuz of the cheap drinks! :) It's cash only though and parking is always difficult to find in the Mission :(", "author": "Jess H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-29", "description": "Sarcastic bartenders and cheap beer! If you like pool tables, darts and hard rock this is your place. Can't wait to return.", "author": "Roger H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-20", "description": "Pretty legit bar. Ms. pac man, good beer with a smile and dogs. Also is not usually overcrowded.", "author": "Tamrin H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-01-09", "description": "I love this bar. \n\nWhen I was in Providence I got into the habit of frequenting my local bar every night at the end of the night for a couple of jamesons to bring me down from the 8 24oz. cups of coffee that I had consumed during the day. \n\nThis was the first bar that I went in that I felt comfortable going into alone and rarely got bothered by anyone at all.\n\nI met some of the regulars and found some friends at the same time. It's a great dive bar that reminds me of home (TX). It's chill, non-chalant and I appreciate the we don't give shit and we don't take shit attitude. Now if they could just carry Lone Star......", "author": "Melissa R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-07-16", "description": "Finally, a real dive bar. All metal jukebox, $3.50 pints, darts, pool, and dog friendly on the weekend. This bar is one of the reasons that I moved to the neighborhood. Good for going solo or with friends. Very chill vibe. Did I mention that they always play metal? Awesome.", "author": "dan s."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-09-06", "description": "This bar is okay. Good happy hour prices - $3.25 all beers for the most part. There are a couple pool tables in the back, spacious booths and a long bar. The ambiance is pretty cool, usual stained wood bar but some interesting shwag on the walls.\n\nAgain, a good place to add to the bar crawl. No point staying at one bar for more than a couple of hours (unless you're getting your thang on.)\n\nOh ya, try the RADEBERGER beer. It's the small black tap handle towards the front door end of the bar that has Radeberger in gold cursive. Beer comes in a giant glass stein and is a refreshing golden pilsner.", "author": "Matt S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-11-03", "description": "i definitely bookmarked Kilowatt when i was still drunk.\ni don't remember my night here but my note says \"hot, tarzan, & cherry bomb\"\nsounds like a good time to me!", "author": "Lizzy L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-09-20", "description": "Alcohol. Pool. Pinball. Darts. I spent about an hour here with some friends, so not a lot to go on, but 3 stars thus far. Guinness on tap is a plus for me.", "author": "Ken L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-02-18", "description": "Stop #2 during a 14-hour pub crawl. I remember sports themes, pool tables, and the beers were good and, like everything else in Mission it seems, cheap too.", "author": "Pierre Trudeau I."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-08-15", "description": "#3 on my 5 Best Bloody Mary's List...also a great jukebox and amazing beer on tap selection and some pool tables too! All around good time.", "author": "Josh C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-08-04", "description": "Update: This has become my favorite bar in the Mission, period. The staff are awesome people, and the jukebox is one of the best I've become used to hearing. Another plus is if you're hungry and want some taqueria grub with your beer, don't be afraid to bring it in with you.", "author": "Sean R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-22", "description": "I get so bombed everytime I got here its amazing. Minus one star because I couldnt really tell you anything about the bar.", "author": "Sean K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2005-09-23", "description": "Many years ago, when this place had live music, I boned some guy in the sound booth on a dare.  I think he might have been the soundguy but it was quite some time ago and I really can't even be sure.  Now that sound booth is a vacant outpost which reminds me only of better days.  But no matter, it's still fun to get drunk here.  I secretly hope that someday this place will fill up with dogs, who will then coalesce into an angry, foaming pack of wild, crazy fang.  They will create a doggy Thurnderdome, and instead of a still interesting Mel Gibson and Tina Turner, white-belted hipsters and straight-haired Marina chicks in open-toed shoes will dart around slashing at each other to escape. Oh, a girl can only dream.", "author": "Eggs M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-04-25", "description": "Play some darts, drink some beer, and bring lots of people!", "author": "Liz B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-10-24", "description": "When I pee in urinals, I don't spit in them at the same time, like many guys do, because I am classy, except for here, because here, I spit in urinals, while I pee, and it makes me smile.", "author": "Dave G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-06-17", "description": "Why have I NEVER been here until last week? It's a great place! The beer selection is pretty good (and HUGE), pool tables in the back, games everywhere, and yikes, this place is pretty huge for a dive bar. Loved it! (I love dive bars in general) The bartenders were extra cool, too, and everyone in here was pretty friendly. It's a great place to go with your friends if you're just looking to have lots of fun. Or if you don't want to go to Skylark. Seriously. It's right across the street!", "author": "Caroline L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-04-04", "description": "fun dive in the mission. cute, CUTE boy flirted with me at the bar, but i think his girlfriend was, umm, sitting right next to him. i think he wanted to talk about more than the fernet i was ordering, but i told him he was SOL. that's how i like to roll these days. no more men for me (i'm on sabbatical in every aspect of my life)!\n\ni played the addams family pinball machine and scored 80 million points, but ended up in last place. WTF?!? people have WAY too much time on their hands.", "author": "May T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-07-18", "description": "They have Sunshine Wheat on tap and they don't judge you when you have alcohol induced issues with gravity...Good times!!!", "author": "Todd E."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-02-25", "description": "Really?  I walked in and country music was bouncing off the walls and the place was sparsely occupied by bored 20-30 somethings who seemed to be in a purgatory between hipster and tweaker.", "author": "Christine M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-12-20", "description": "Kilowatt is pretty sweet. Cheap beers from everywhere. Most of it is on tap. Their specials can be great, just keep in mind, it's very divey. Don't take your high maintenance girlfriend or boyfriend there or else they'll just be whiney and lame. There's pool, there are little cocktail tables, it's just your mellow mission bar with a ton of awesome beers to try out.", "author": "Anthony B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-02-08", "description": "Cheap pitchers, 2 pool tables, darts, and doggies!  Not bad.", "author": "Mari C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-10-27", "description": "Please disregard Amanda's review of terrible service; I had a front row seat for this incident and the bartender was actually very patient with this obnoxious drunk. When Amanda first came up to the bar, she turned to my friends, and out of the blue, demanded, \"Are you talking about me???\" She then ordered a round of Red Headed Sluts, not difficult but not exactly a simple mixed drink. She didn't think they tasted right so the bartender remade them. A bit later, Amanda came back to the bar, ordered another round with the caveat \"can you make them right this time?\" At this point, the bartender told Amanda that she'd been making Red Headed Sluts since 1999 (the last time they were popular) and that if she didn't like the drinks, she could take her money elsewhere. We gave the bartender a standing ovation as Amanda exited the bar in a huff.", "author": "Catherine C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-01-29", "description": "Love the Watt! Great dive with great Rock N' Roll attitude! Cheap drinks, pool, pinball, in the middle of 16th street, tons of great grub right out the door!", "author": "Rachel L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-11", "description": "I've been here a few times but never really had any reason to say why I like it or not. But last night I watched the bartender make my margarita in a pint glass, filling it up more than halfway with tequila, triple sec, and something else...then proceeded to squeeze 3 fresh limes and then top it off with a splash of mix. Wasn't expecting such a carefully crafted beverage from a grungy mostly beer and pool mission spot. I dig it.", "author": "Kelly R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-01-16", "description": "I have a friend nicknamed Kilowatt. That's not really relevant to this write-up, and you likely won't find his sort hunching over this bar stool. Kid don't believe in no black or female presidents... no sir. Something about pigment and PMS respectively. Don't hate, don't hate, he'll scream as a mob of motherly oakland types beat him with handbags and pimped-rims. I took him to this bar once, we sort of just sat at the counter exchanging glances with the curiously strong-looking bar waitress, she with the tattooed arse. The latter arousing a synchronized seating adjustment. We didn't have much to say to each other. He went off to the bathroom at one point, dashing back minutes later with manic energy to recount with great pride, \"Dude! That was the shit!\"", "author": "Marc M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-12-10", "description": "If you're out drinking in this area you'd be hard pressed to find a better option within a few blocks.  With a great selection on the jukebox that covers everything from the Reverend Horton Heat, to Johnny Cash, to the Butthole Surfers you know at the very least you're in for a good soundtrack to your evening.  Add to this the decent beer selection and good bar staff and you have the makings for a great night out.", "author": "Joshua W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-11-21", "description": "Great beer selection, decent music playing, a real happy hour and close to some delicious places to eat  -  not too shabby.", "author": "Mike J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-04-19", "description": "mission bars unite!!  \n\nthat's usually how i feel when in this area, because its impossible to stay at any one bar for an extended period of time.  so much to see, so many beers to have, so much puking in the alleyway to do, so many bacon wrapped hot dogs to consume!\n\nI can handle this one for longer.  It gets crowded, yes...but if you score a booth you are golden, or just head back past the bar and hang out by the pool tables or dart boards where there is usually more standing room.  But be honest...booths are always better...especially when its one of the last stops, and personal space isn't as important anymore.", "author": "Lauren F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-11-24", "description": "I had a good time. I guess that's all you can ask from a bar. The bar had plenty of my favorite bar stuff. Pool tables, cheapish drinks,etc.. However it was crowded. Packed house crowded. The atmosphere was good with only a handful of idiots. The pool tables had long lines but I would definitely go back. If you are in the Mish and are wondering where to go, then Kilowatt would be one of the first places I mentioned.", "author": "Greg H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-03-26", "description": "When my friends from out of town wanted to go out in the city but not a place that was pretentious.  I asked my friends that live in the city of a few bars that would be mellow, serve good drinks and we could talk.  Found it in Kilowatt.  We were going to start out there and check out some more bars but as the night went on we decided to stay here for the night and had a great time.  Good waiters, the bartenders were great and the Bar back stepped up and helped out.  Will definitely be going back.  I must say though don't go here if you are looking for anything more than a great dive bar.", "author": "Heather B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2005-01-12", "description": "good trashy place to get trashed. Dogs allowed.", "author": "alec m."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-03-02", "description": "Bartender= Super friendly, Watching hockey games at Kilowatt= Super fun! Go Sharks!", "author": "R G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-11-10", "description": "so many dreams live and die here.\n\nso many friends come and go here.\n\nso many moments to watch and drink here.\n\ngod bless you, Kilowatt.   god bless you.", "author": "C H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-10-09", "description": "A nice spacey dirty bar with both pool and dart tables. They've got nice beers. The music is not my favorite, but after a couple of pitchers with your friends it'll be fine.", "author": "Tamas K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2005-03-28", "description": "My first bar in the bay... Ah it seems like only yesterday I came to visit and got loaded here. Great scrubby little mission bar to drink beer, shoot pool, throw darts, play that fantastic early '90s San Francisco driving game Midtown Madness. Darts are the best here because the board is crap, the darts look like they got stepped on and the scoreboard is nearly impossible to use, but when you're inebriated, who cares?!", "author": "Michael E."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-04-20", "description": "Quite simply, Kilowatt is a good place to get drunk.  This ex-venue consistently has some of the best priced drinks in the city and the bartenders pour them heavy handedly.  I was there just the other night and a strong whiskey & 7-up was only $3.50.  There are plenty of other ways to amuse oneself at Kilowatt too.  There is a good jukebox, a few pool tables, pinball machines, darts, and it never fails that any conversation can suddenly be interrupted by someone wanting to talk about Metallica.  Ya guy, you know who you are.", "author": "Broke-Ass Stuart S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-04-22", "description": "Any bar that proudly wears it's hockey badge on its sleeve is okay by me... (even if it's not the Sharks.... the team that upset their beloved RedWings way back in '94)... TVs, pool tables, great jukebox, good selection of beers and a bunch of Red Wings' banners make for a great drop by in this cool part of the city... just make sure you don't step on a pitbull paw on your way in...", "author": "John M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-02-18", "description": "Kilowatt  is a strange place. From what I hear, it's stuck somewhere between a dive bar and a sports bar -- without being either. The first time I came here, I thought everyone looked familiar (though there WAS a dude I had seen at Zeitgeist earlier). When brought this up to my friend, she said she felt the same. Strange. I like it.", "author": "Amy Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-07-13", "description": "great beer selection. very relaxed with a super sweet jukebox.\n\nladies if you are single beware there were some seriously uncomfortable looking and acting dudes milling about.\n\non the plus side i paid for 3 games of pinball(terminator 3 no less) and i won 3 free games. seriously how sweet is 6 for the price of the 3.arnie is workin hard for the people of  cal e for nya(say it out loud)\n\nthere is pool too, but if you hit me with your pool cue i will not be your friend", "author": "Chris G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-09-16", "description": "Everytime I come to this place (which is often because mi amiga lives across the street) I have a ridiculously fun time.  Cheap, loud, fun. Cute dudes and dogs.", "author": "Rikki D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-11-16", "description": "Although I did not like the crowd, particularly the oddly dressed guy smoking in the doorway leading into the bar, the bar had some promise with cheap drinks and sports memorabilia decorating the walls. I did not stay long enough to comment further, but if I'm in the Mission again, I would give this place a second chance.", "author": "Michael H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-08-10", "description": "Loud, bad music.  Uninteresting.  Pretty disgusting.  Good place to raise a pig.", "author": "Kurosh H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-06-01", "description": "Several grand beers on tap here (Racer 5 and Stone!) for cheap located only 1/2 a block away from the ever-so-trendy Delirium.  Plenty of seating and friendly bartenders; there's darts and a pinball machine, too.  Definitely worth stopping by here before or after a night in the Mission.", "author": "Scott G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-06", "description": "I love this bar. It's super chill and people are really down to earth. I also love how they are so dog friendly (I brought my golden-rottweiler mix one night). People naturally had treats on hand to feed him and the drinks are super cheap compared to say going to a club and drinking. The bathrooms aren't yuck status and there is plenty of space to sit and talk with friends. I'd definitely recommend this place to dog lovers and groups that just want to hang and talk or play pool.", "author": "Alesia T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-08-12", "description": "i love these cash only bars in the mission. you cant beat the prices and great vibe they provide. that describes hundreds in places in SF. \n\nHow does this place stand out?\nchalkboard.\n\nyeah, i said it. this place is cool because it has a giant chalkboard hung high on the ceiling. other than the fact there is a chalkboard, it also has a fine selection of beers listed on the chalkboard.", "author": "Mike K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-03-14", "description": "haha i got hit on by this short dude here once. he gave me his number since i refuse to give my number to any boy who is not paul q. that was the night some drunk ass beezy hit my parked car on 18th and guerrero. i hope karma kicks her butt since some passer-bys saw her running from her broke ass car with the front wheel torn off from hitting my car so hard. \n\nbitch.\n\noh say what, kilowatt? my friends managed to get their jager bombs here that night since they were on a mission (in the mission aha, aha) to get trashed. but i can see how the pool playing can get annoying if this bar was really crowded.", "author": "Melanie C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2005-12-26", "description": "Pretty standard hipster dive bar in the Mission. This place is okay, but I like Dalva & Delirium across the street more.", "author": "Maria D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-21", "description": "When I walked into this joint Muddy Waters was playing, so I was immediately pleased. Kind of a divy/hip feel to it. Shot some pool, drank some beer. Felt very relaxed and at home, didn't really feel like i was in California at all. Could of been somewhere in east coast. Good times though mos def.", "author": "John P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-05-01", "description": "The beer list is good and competatively priced compared to other bars I frequent, and dogs are allowed (and participants seem well socialized and are used to being drunken therapy dogs)... my only complaint being that after happy hour ends the crowd gets a little creepy and the juke box has an over abundance of punk, thrash, and 90's-i-am-in-denial-of-the-world-around-me metal. While I understand the cool factor of having Turbonegro in the juke, I miss the practicality of the Pixies in a bar like Kilowat.", "author": "Caroline C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-09-01", "description": "Amy rocks. She's a ray of sunlight in a hipster part of town", "author": "Big W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-05-26", "description": "This bar is bitchin'.\n\nCheap drinks, pool tables, dart boards, games, sweet selection on the juke b., dingy, dusty, dark..\n\nOh, how I lust dive bars. \n\nI wish they had Pabst on tap.\n\nOtherwise...\nIt's lovely.", "author": "Sheila S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-11-24", "description": "this place is pretty sweet. What really made me love it was the bartender. I was waiting at the bar for like 5 minutes, no big deal, and she told my friend and I that she was sorry for the wait and the drinks were on her. awesome. We ended up loving her and tipping her really well. Her drinks were strong as well, always a plus. Good bartenders like that are hard to come by and Killowatt has atleast one amazing bartender.", "author": "Bobby P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-20", "description": "It's stumbling distance from my bestie's house, they have Hangar 1 lime vodka (my favorite) and a really funny corner booth with a red velvet rope that is reserved for someone (I don't remember who)...that we love to snatch whenever it's available.", "author": "Emily T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-09-03", "description": "I'm way into the animal friendly factor and it's just a cool bar I like it .. I'll go again", "author": "Jill W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-10-27", "description": "Sister bar to Zeitgeist.  What can I say about this place?  A little quieter most of the time, a little more room, different beer selection (last time I was there), and an extra pool table with more room.  Is it a beer garden?  No, so that's a bummer.  Otherwise, a treat.", "author": "Giorgina G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-01-22", "description": "It's Raw. Nobody trying to look pretty here... they just do? (Didn't know where I was going with that, and it's too early in the morning to let myself sound like a dick) What I am trying to say is that it is unpretentious, it is laid back, it is cheap, it is dark, it is a good place to hide from the cops.", "author": "Lee M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2006-12-04", "description": "The one time I was here, big-hair bartender, who knew my friend through dating her roommate, looked at us and said, \"Your drink is free\" pointing to my friend, \"but not hers.\" hers being me! Thanks a lot, chud I don't know!", "author": "Shannon V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-04-12", "description": "Four stars because a glass of Anchor is $3.75 on a lazy/chill Sunday night, unlike some places that start with a B and end in an S and in the middle is LONDIE. Cool atmosphere, albeit dusty.", "author": "Maximillian M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-11-13", "description": "In the nexus of my dining, shopping, and barhopping world - 16th and Valencia - there is Kilowatt. When you need to take it easy, play some pool, hang with your friends, just have a mellow time, Kilowatt is there for you. Everyone is friendly and easygoing. One of my favorite things is that they allow dogs, which to me is evidence of how cool this place is.", "author": "Cyrelle D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-11-11", "description": "Free birthday champagne (ok, cheap sparkling wine) and Polaroids! Darts! Pool! Count me in. Let's hear it for your friendly, dingy Mission bar.", "author": "Aaron L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-10-09", "description": "Divey, grungy, fun place to stumble into after a place like Skylark. Really refreshing, actually! Plus, despite the sloppy state we were in, they still gave us darts! Hahaha, drunks with sharp objects. Swizz. Also some pool tables, stuff drinks, and a chill crowd. Kind of made me wish we'd come earlier, but hey, that's what the next night is for, right?", "author": "Irene F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-11-10", "description": "Although Kilowatt was rather loud, crowded (unexpected because every time I've walked by this bar it's been essentially empty), and playing terrible music, it wins some major points for having a clean ladies' room, cheap drinks ($3.50 for beer and well drinks), it's own ATM  ($1.50 fee), and dogs.", "author": "charlotte c."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-02-08", "description": "Best bloody mary's around ! ! !", "author": "Jade B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-10", "description": "Cool: pinball, pacman, pool tables, relaxed - nothing but sausage in here so that works out great for me!", "author": "Mimi X."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-08-13", "description": "If you go there around 9 pm, you can get a booth, otherwise by 1130 pm it is get mad crowded. It's spacious and there is a lot of interesting stuff on the walls. It's def a good start off place for your mission bar crawl.", "author": "Anita C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-12-04", "description": "This is a pretty good bar.  Not pretentious at all, and generally a pretty good vibe.  It is a good place to go in the mission if you actually want to be able to hear what your friends are saying.  The beer is decent.", "author": "Joanna S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-09-21", "description": "It's div-y and cheap for the area. I like that a lot. Well drinks $4, good pints of beer $3.50ish. The jukebox was mostly loaded with heavy music, but the crowd was a generic mix of people. Not  what you might expect from the multiple Misfits albums on display. I played Johnny Cash and Cheap Trick. We also played pool - it was pretty easy to get a table even though it was a Saturday night. My friend fell in love with a tall Uma Thurman look alike killing it at the pool table in strappy high heels. Oh, and the bartender was a very sweet lgal who - although she accused us of smuggling in nips - didn't get mad when we dropped a glass. :)", "author": "Kathleen D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-06-22", "description": "True dive.....good drinks and unique crowd, but the music tries too hard.  Been here 20 times at least and have yet to recognize 1 song!", "author": "Greg R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-12-19", "description": "This has to be one of my top three bars in the city.  Cheap drinks, an awesome staff and not too many of the young hipsters, Kilowatt is very welcoming and pleasant to hang out in on the weekends when a lot of the other Mission area bars are filled with drunken 21-year-old Irishmen on holiday.  Great beer selection to boot.", "author": "MonkeyPants S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-01-14", "description": "Stopped in this past Saturday night to check it out and I thought it was a pretty nice dive bar (I know oxymoron). Fun atmosphere, they have pool tables and darts. Good place to hang with some friends. No dancing though so we didn't stay long and went up the street to Double Dutch.", "author": "Jenny C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-06-20", "description": "At times this bar reeks of the type of douchebag who is overly infatuated with their new iPhone, but don't let that color your decision to come check it out because for the most part, those people are panned by the door and waitstaff unless they recognize you as a repeat patron.\nThe bartenders are quite adept in realizing who is cheating and ordering drinks for strangers who are cutting in line, and that's pretty cool. There's usually an awesome pinball game in the back, that is rarely played, and the sparce bathroom situation is really democratic for both men and women because everyone is usually cracking jokes if there is a line. If you have a booth and want to go outside to smoke, even if the bar is crowded, nearly everyone recognizes the universal \"covered drink marks my space\" and won't try to steal your seat too, unlike a lot of other bars in the area which also service the increasing bridge-and-tunnel influx.", "author": "Sam A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-03-14", "description": "i love this bar.  jukeboxwise, this is the best place to go if you dont wanna hear a buncha that hipster garbage that seems to be so prevalent these days:  a lot of hard rock/punk/metal, and if it gets slow or quiet, the bartenders are kind enough to put their own personal collections on.  \n\nthere is also something about the atmosphere.  im not talking about the cool-as-shit bartenders that are pretty good about getting to you in a timely manner, or the pool tables that have hosted more than its fair share of drunken dates, or the dartboards, or the pinball machines, or the booth seats, or the HD screens constantly broadcasting espn or FSN bay area... \n\nim talking about the people.  for some reason, entering the Watt is like entering a parallel universe where everyone is up for conversation and is nice to you.  there is just seriously something about this place, i dont know what it is, but i can tell you right now its great enough to lure me out of my neighborhood and trek three districts over to get here.", "author": "Jon H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-03-07", "description": "Short of having an actual Green Bay bar in San Francisco, this is the best place I've found to watch the Packers play on Sundays.  The beer list is extensive, the prices are dirt cheap, there are dogs walking around everywhere, the music is generally good, the bartenders are quick, and they have pinball.  These are the marks of a quality bar.", "author": "Barry Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-08-01", "description": "Sorry I got sloppy last night and fell, sorry for the tequila shot, sorry for the hour it took me to get money out of the ATM. HOWEVER, the bartenders here are ALWAYS great. Carla you literally poured a shot that knocked me on my ass. Next time i will behave. Great scene, not pretentious, pool tables, nice crowd, good vibe. I have always had a great time here and been treated above and beyond well.", "author": "victoria h."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-01-21", "description": "I dig Kilowatt!  It's laid back and full of \"real people\" who just want to hang out and have a beer.  The place is huge with tons of tv's and places to sit.  I wasn't too fond of the bathroom, but it was functional and decent.", "author": "Wella A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-07-22", "description": "I love walls of mirrors.  I don't much love dogs, but it's entertaining to be able to bring them here.  And who doesn't love post-kickballers?", "author": "Nelson A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-11-05", "description": "I enjoy my beer with canine company so I like coming to Kilowatt. There is always at least one dog roaming around. I realize this is not a selling point for some, including my friend who was eying the dogs suspiciously and kept saying \"Isn't that a health code violation?\" Decent beer selections on tap, unpretentious bartenders. Kilowatt  is also a good place to go and watch hockey,  if that kind of thing floats your boat.", "author": "Rebecca H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-10-13", "description": "Speakeasy Ale on tap and cheap pints is the best thing this place has got going for it. Oh yeah, and CAKE in the jukebox.", "author": "Lauren S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-04-04", "description": "Randomly walked into this bar one night.  Sat at the bar, good assortment of beers, I think I had an apple cider.  Cool stop on a MIssion area bar crawl.", "author": "Nicole C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-08-13", "description": "Pitchers of cold beer with two dart boards and Guns and Roses blasting from the speakers.  Couldn't ask for more...", "author": "Mark D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-08-16", "description": "Cheap beer, plus a good selection on tap.  Found a table free without waiting.  Nothing to get excited about, but pretty mellow.  Lots more space than some of the other places on the block.", "author": "Aaron T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-02", "description": "Ahh, dive bar goodness. Somehow I always manage to have a fantastic time here. Part of that is the people I've come with, but Kilowatt has everything you need to make a quality bar experience: a solid beer selection, cheap drinks, and laid-back, unpretentious people. This is a come-as-you-are bar, and I definitely appreciated that after a night in the Marina that quickly brought me back to my days of frat parties. And hey, if you get bored it's not like there's no other bars on 16th...", "author": "Kristen B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2005-07-30", "description": "Usually when I escape from the sweaty pit that is Delerium, I find myself at this somewhat more laid back bar. The jukebox is awesome, and the door guys are really nice (and once kicked out a dude that tried to beat me up at Delerium....what, he started it!)", "author": "Veronica B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-05-17", "description": "A bit too much of a hipster scene for me but a solid bar none the less. I would only give it 3 stars but the terminator pinball in the back tacks on the 4th. I mean you can shoot ping pong balls on the top", "author": "Roxane S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-08-04", "description": "I love this place!  It's grungy, they've got great beer on tap, I mean great, one of the best selections I've found.  When the Seahawks were in the playoffs last year, I'd go here every weekend to watch the game.  It's where all the Seattle fans hung out.  Now that's saying something, the cool Seattle fans.  Not the sports bar geeks but the real, authentic, feel-it-with-your-soul kind of love.  Actually, I'm not even much of a football guy but it was great fun.", "author": "Abendigo R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-11-11", "description": "So, the Kilowatt is responsible for us having Clyde, our dog.  I've always liked the Kilowatt so we went there one night last January for a friend's birthday.  Good people, good music, not pretentious, and the free B-day champagne is a bonus.  Well, that night there was a very well behaved pitbull just cruising around the bar gettin' all sorts of love from anyone who would give it.  We were already thinking about getting a dog, we'd even been to the SPCA a few times to look, but we were a little scared to take the big step of actually getting one.  Well, that dog, I can't remember his name, made up our minds for us.  The next day we went and got Clyde and I can't imagine what it would be like without him.  So, I just wanted to say thank you to that dog, and to the Kilowatt for being so cool as to let a dog wander their bar.", "author": "Jeffrey F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-12-13", "description": "A little on the divey side, Kilowatt is pretty much a standard bar with a pool table.  I do like how they allow dogs in there.", "author": "Tim G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-03-05", "description": "it's roomy, above all else. plenty of space to sit down and lots of pool tables, with relatively high ceilings\n\nthe crowd is a mixed bag as most are in the mission, can't decide if it's trendy or casual but it'll do\n\ncame here for a birthday thing a couple weeks ago, had a great time and was able to hold conversations without yelling, which is always a plus", "author": "Charles C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-08-08", "description": "I just moved right down the street, and I feel like this laid-back spot has a chance to become the place where everybody knows my name.  It has that chill neighborhood vibe going on, and pool tables and dart boards for those who like a little action with their beer (they served good mixed drinks too).  Weekends get a bit crowded, but never overwrought like some other Mission bars, and weeknights are great for a drink with a friend after work.", "author": "Rachel B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-02-09", "description": "Kilowatt rules.  You know why?  Cuz it's a bar -- nothing more, nothing less.  Awesome beer selection, cheap drinks/pitchers ($13 for Trumer Pils on a Saturday night), pool, darts, and a lot of good people chilling.  They keeps it real!  It's a great place to pre-funk before going somewhere else, or totally fine to stay there and get your swerve on until 2am (note: see review on Cable Car Pizza...that was right after Kilowatt).  The men's bathroom is awkward and small, and dirty, but whatever...not going there to hang out.  At least there were paper towels all night.  Thumbs up if you're looking for a bar and a great place to hang out with your peeps.  Not sure about the barking dogs in there last night, but whatever...anything goes.", "author": "Louis M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-04-29", "description": "I'm not positive what it is I love about this bar but the important thing is I love it. I have never had a bad experience here. Even when it's crowded as hell I don't have to wait very long for a drink, the place is not frequented by assholes (huge bonus) and there's a general vibe of joy and good times. What's not to like?", "author": "C P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-12-12", "description": "I like Kilowatt better than almost any bar around 16th Street. I guess because they have good beers and they have booze which is nice. Also I like the wooden booth seats, they're nice and cozy. Also it's a great place to go and play pool! Lots of room! Also, they play pretty rockin' music and they also have darts. Overall, I enjoy the people who hang out there and sure there's hipsters, but really, not as many as in other bars.", "author": "Gina R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-09", "description": "Usually I sneak over here when everyone is hanging out across the street at Gestalt.  I can get a real drink and hear some decent tunes-- like old some Metallica.   I've never had a bad drink here and I feel like the service is pretty quick.", "author": "Jessica T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-11-21", "description": "First place I've found to watch hockey in the city without feeling like a frat-party date rape was lurking just around the bend. Repeat after me aloud \"sports bars\" and feel that shiver that runs down your spine. Yeah, well I don't get that vibe from Kilowatt. Add to that I didn't get run out of the joint for rooting on the Flyers while they were playing the Sharks. Hockey+metal+garage+good beer+good folk=Kilowatt. Thanks to the charmingly raucous Edmonton fan/Hemlock bartender for the recommendation.", "author": "Rob S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-01-07", "description": "This place is the epitome of a great dive bar.  Cheap drinks, a friendly and eclectic clientele, fun bartenders, and it's not too crowded even on a Saturday.  There are TVs and pool tables to keep you entertained too.  Definitely worth a visit, or two, or three....", "author": "Shannon L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-01-26", "description": "I havent been here yet but I cant add it to my list of dog friendly places unless I have a review. Ill edit my star rating and review once I visit the place (this weekend perhaps). Until then 5 stars just for allowing dogs :)", "author": "Brando Calrissian .."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-09-06", "description": "One of my favorite places to get a drink.  Just walk up from the 16th St. Bart Station.  Definitely hockey friendly during the season (especially if yer a Red Wings fan with all the banners around)  and a pretty happening place during the night.   Good service as well.  Jukebox during the day, but at night, they'll tend play stuff on the CD player.", "author": "Richie W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-10-27", "description": "I really like this place-- drinks are cheap ($4 for tap, $7 for my fave mixed drink), dogs are welcome, and outside food (well, leftovers, anyway) is okay, too.  There are two billiards tables and one jukebox, which is unfortunately filled primarily with rock selections.  Oh, there's a change machine, too, that takes $1 and $5 bills (perfect for Muni riders or parking meters).", "author": "Lynn O."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-12-28", "description": "I like it down the street better, at delirium, gestalt or double dutch.  I think it's just not really my style of bar.  I would rather be somewhere packed.", "author": "Matt N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-05-01", "description": "This is hands down my favorite bar in the mission. It's a cool place to just kick it with some friends, play some pool, and drink cheap, good beer. People there are friendly, as are the bartenders. It's defnitely a low-key vibe, not really a \"get wasted/blackout drunk\" kinda place, but I'm sure if you want it to be that kind of night, you could make it that way. I love it more because one of the bartenders gave me a free pitcher for being nice when it was crowded. Every weekend I try to rally the troops to go to Kilowatt. It's that great.", "author": "Lauren K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-05-12", "description": "One of my favorite bars in the city, and definitely of the Mission. Great beer choice (Racer 5 on tap is a rarity), lots of action and a very good jukebox. Plenty of TV's to watch your favorite game while you are waiting for your reservation in one of the many fine local restaurants. I used to go here when it was the \"Firehouse\". Too bad they had to stop live bands from playing there because some of them would wreck the equipment, but, they still have a couple of pinball machines which is another rarity these days.", "author": "Rich M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-08-03", "description": "Four stars for the beer menu and spunky bartendress. One star for the atmosphere and clientele. Three stars for being able to go there with a group and be rowdy, but zero stars for being hit on by really uninteresting, unattractive people. We'll pretend that averages to like, two stars.", "author": "Jordan B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-03-16", "description": "Amazing bar with very friendly staff, dog friendly, reasonable prices, two dart boards two tables and a great", "author": "Mike G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-02-07", "description": "Any place where a man and his best friend can share a pint of suds gets my attention. Five stars just for being dog friendly, minus one for the not so tastey ??? ????? I had, plus one star for having like fifteen more beers to choose from.", "author": "t h."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-05-12", "description": "Our favorite Mission hangout.  Reasonably priced drinks, good pours, and a decent beer-on-tap selection.  Great mix of people, and pool tables are usually available on all but the busiest of nights.  I like the music that is being played on the jukebox.  I've had friends bitch about it, but I like the harder, edgier stuff.", "author": "Scott G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-10-09", "description": "Pretty cheap drinks and cool booths. It's really the booths that do it for me. Perfect for cozying up under the red light and getting to know someone. And then, of course if that doesn't pan out, you can get your hustle on at the pool tables.", "author": "Matt L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-12-18", "description": "I love this place for the atmosphere and beer selection. Unfortunately it often smells bad. I have had some great bartenders and some shitty ones. The only reason for the less than great rating is the one bartender that had to spend 10 minutes smoking outside and then 5 minutes talking to her friends instead of doing her job, which I presume is serving beer. I will happily change my review if circumstances allow it. I think it it is great that you can bring your dog!", "author": "tim s."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-05-17", "description": "A great place to go in the early afternoon, either to watch a game or just hang out and shoot the schtuff. Come eveningtime, it becomes damn near impossible to get around and unless standing next to a pool table with your drink held over your head so some knucklehead doesn't run into it sounds like a blast to you, avoid the 'watt at night.", "author": "Andrew L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-04-18", "description": "Very good selection of beers on tap.  Casual crowd. Small coin-op pool tables are popular though I don't play myself.  Located close to several food options if you happen to get hungry after a few brews.", "author": "Christopher K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-02-25", "description": "I went  to watch the Pats-Jags playoff game and it was a good crowd, and something like $2.50 Racer 5 pints, and some guy was buying drinks for me and the person next to me, and I might have rolled something at the bar.  I've been back a few time since, on weekday nights, and ts been just as fun.   There are usually a few dogs there, and one night me and my friends tried to play darts but the board was warped.  They have 'Return to Cookie Mountain' on the jukebox so I'm happy.  Also good mix of people hangout there.", "author": "Thomas G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-09-02", "description": "A really cool bar, with one of the best jukeboxes in the neighborhood. They got pool, darts, and a really nice atmosphere. Love this place", "author": "Venkat K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-02-24", "description": "Pretty typical mission bar, but nothing special. It smell kinda funny and they let dogs come in. I am not a huge fan, but there is a pool table and the beer isn't too expensive.", "author": "P-nut K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-06-02", "description": "Who knew this place was so cool. Went for the first time last night, totally pleased with the large space, cheap drinks, and chill crowd. Just a few blocks up the street from where I live, this could be my new dive bar of choice. $7 for two gin and tonics? Yeah, I'll be back.", "author": "Jason B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-05-06", "description": "my experience here is summed up by some jerk telling my friend and i 'go get retarded somewhere else'.  and by that he meant 'go back to the marina'.  i dont think jeans and a hoodie makes for a marina outfit - and i dont think people should be so rude.\n\ni also don't think dogs belong in bars. but they did have a good beer selection and the bartenders seemed friendly enough.", "author": "jessie h."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-03-03", "description": "The Kilowatt has 2 pool tables with plenty of playing room.  I hate bars where they have tables, but it's so cramped you feel like an A-hole when you play cuz you're hitting peolple in the back of the head with your stick. I had a great car bomb there. Ambiance is cozy, humble, slightly divvy.  Crowd is nice, young, interesting, and mixed.  In a great location with eats everywhere of every kind right out the door.  Right across from Roxy Theater.", "author": "robin c."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-05-22", "description": "Stumbled upon this place when visiting San Francisco.  I was looking for a taco, but a beer sounded better.  Cheers to afternoon happy hour!", "author": "Maret W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-08-19", "description": "cheap happy hour, no fake tans, no bright white teeth\n\nkind of fun to get wasted next to a dog.", "author": "Cheester O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-07-16", "description": "This place reminds me of Cheers the t.v. show. Everyone there is chill with no worries just drinks n pool. It's for everyone and anyone. Yeah!", "author": "Richard D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-10-05", "description": "ABSOLUTELY TERRIBLE SERVICE! I went here the other Sunday night and the woman bartender could not make a simple mixed drink I had asked her to. When I told her she had made it wrong she gave me a bunch of unnecessary attitude and gave me my money back and told me to \"scram\" out of her bar. When i asked her why, she said \"because my drink is stupid and she doesn't have time for it.\" Sorry, but last time I checked I thought a bartender was suppose to know how to make drinks and serve them to customers ATTITUDE FREE! THIS WAS BY FAR THE WORST EXPERIENCE IN A BAR I'VE EVER HAD! DO NOT GO!", "author": "Amanda L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-21", "description": "The Bar was nice, but the ladies bathrooms were terrific! Very clean and well lit  with a sparkling sink.  Thank you kilowatt for having the nicest bathroom of any dive bars I've been to.", "author": "Hilary P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-01-16", "description": "OMG, it's been years since I've been here but I remember it like it was yesterday. I dated a boy who lived very close to here for a while and this was a typical weekend watering hole for us. I used to be a huge lush and he was a big cokehead...a match made in heaven you could say. Except it was not. Anyway, one night I got so shitfaced I threw up in my drink glass and then ran to the bathroom to continue the dramz. When I came back, homie started cackling like a wildman and had the crazy eye. I was like \"WTF is wrong with you?\" and he told me, \"when you went to the bathroom, I took a drink out of your glass and someone told me you puked in it!\" and then continued the crazy laughter. He practically screamed it to the bar and I know if I just drank someone's puke, I would not make a PSA out of it. As far as the bar goes, I don't remember it because 7  years ago I was too busy puking into glasses and having my ex boyfriend drink it.", "author": "Jade L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-06-20", "description": "its in my hood so stumbling home is easy! great place, hot bartenders, nice pool tables. on sunday night they have free pool so you need to be good in order to actually play more than one game. Gotta love the dive bars...", "author": "Susan M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-11-23", "description": "Good people, plenty of TV's and they have all the sports subscriptions, kickass metal/punk/etc. music, great dogs that are allowed to hang out.", "author": "Danny C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-06-26", "description": "kind of a bright area it seemed like. pool table. maybe more than 1. i was drunk so i dont remember. there were different levels to the place. like how kramer wanted to make his apt. in an episode of seinfeld. they were rude to me at the end of the night when they tried to kick everyone out.", "author": "Victor B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-04-02", "description": "i claim that i got roofied here because i only bought one beer and was wasted halfway through it.  though thinking back, i was probably wasted because i had had 5 drinks prior to kilowatt.  hooray for no roofies and cheap beers, boo for the crowded, blazered bro-y scene.", "author": "Katherine K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2005-05-17", "description": "reclaiming sports from frat boy kakhidom, kilowatt merges punk rock with loving the fuck out of your team!  the bar opens at kickoff during football season, and it's the only place i know of where fully sleeved tattoed guys and gals wear their home team jerseys and watch football games with slayer or metallica ripping through the sound sytem!  add some of andy's great bloody marys to remind you of last night and it is heaven.", "author": "church B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-04-28", "description": "i love this place for the no frills attitude it exudes. the floor is also  perpetually sticky-looking. that's about all i can say for a place i'm generally too wasted to remember much about.", "author": "Angie Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-02-10", "description": "Kilowatt was cool in the begining.  I have to say though my first time there years ago someone threw a cherry bomb in the door and scared us all shitless and it was a while before I went back.  Just because the crowd was kind of rough.  Well it was packed when most places on the street so obviously it has staying power and good for them.  It's a good place for all the reasons people mentioned.", "author": "Misti L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-06-10", "description": "Great place to grab a few drinks, throw some darts, watch a sporting event or 2 on one of the many flat screen tvs or just shoot the shit with some cool cats.  Unlike Molotovs, which admittedly doesn't aspire to be quite the same, Kilowatt manages to be punk without trying too hard.  I think this is due to the fact that the crowd is generally a bit older and doesn't need to try so hard, but also because people here enjoy sports which creates a bit more of a bond amongst the crowd.  The fact that dogs are often cruising around the place is pretty cool, too, but I've also almost killed one or two by stepping on them unintentionally, so if you bring yours along at least let people know it's on the floor lest it be smooshed by a size 12 Doc Martin.", "author": "Travis F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-03-14", "description": "My home away from home.  Actually, just began returning to this watering hole like a prodigal son.  New bartenders now, (ah, the days of Phred, Danielle, Neil, Julie... whereout thou Danielle?  I miss coffee and a pop-tart on Sunday morns' with you!)", "author": "Marcel C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2007-04-07", "description": "Okay, I've passed by this bar at least three hundred times because it's on the way home. I have only one question: has a non-white person EVER gone in this bar? I mean all I see are these scary looking white biker dudes standing outside and sometimes a few skater girls. Do we really need a bar in the Mission where you have to own a Harley to be able to go inside? I would go to this bar to actually check it out, but I'm honestly scared to do so given the clientle. Maybe I am not being fair, but it's pretty odd that the people who frequent this bar are so out there. I would not recommend this place if you are gay or a minority, but I hope I'm wrong.", "author": "Hmmm W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2005-03-31", "description": "die hard redwings bar. enough said.", "author": "Dean E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-12-08", "description": "It's a home away from home...  I love this place.  Everyone that works here rocks!  Fridays can suck when all the marina folk try to slum it in the mission.", "author": "Darcy M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-07-05", "description": "looks like a dive from the outside - wish they weren't closed on the 4th of july.", "author": "Tre S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-11-26", "description": "I love this place! Not only can I get a top shelf cocktail for $4, it's the perfect spot to chill with friends and locals. They have a great jukebox, but even when the music's turned way up you can usually find a spot to hold a conversation and actually hear everyone. The bartenders are no-nonsense, but friendly. They pour a good drink and you can't beat the price. One of my favorite Mission haunts.", "author": "Misha L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-11-15", "description": "Best damned pool bar in the Mission. 2 tables. $0.50 each. Really good people play there though, so be warned. You'll probably get whooped.", "author": "Dan R."}
