{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-27", "description": "I categorize this restaurant as a Chinese restaurant catered to Chinese Americans that came over to the states in the 1950s through 80's \n\nAnother one of my Richmond district spots. You will usually see big groups of 2nd generation Chinese people here . Hence I like to categorize this restaurant as one of the last Gum SAn (golden mountain) restaurants .  Meaning food that was cooked for Chinese Americans with a taste of Cantonese cooking that transformed into Americanized Cantonese food from the 70s-90s\n\nI think the food taste better for dinners especially weds nights opposed to the lunches . \n\nWe usually order the chicken salad , there's two we get the cheaper one it's better.\nThe stuff chicken with sticky rice is good when you have a bunch of people.\nThe steamed salted egg with pork is a hit or miss.\nOh the salt and pepper pork chops are tasty but sometimes they give me salt and pepper spar ribs and they are smaller . And they don't tell you. :(\nThe salt and pepper chicken wings are good as well\nThis place gives you house soup .\nThe chow mein and chow fun are tasty .\n\nServers have been here for ages so  it's good to get to know them .\n\nAlso for big parties I recommend getting a winter melon soup,\n\nThis is one of the last  golden mountain restaurants so enjoy them now because once they're gone this type of food and restaurant will be lost !!!!!!!", "author": "Jenn C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-19", "description": "There were ten of us for a ten course banquet. I wasn't a fan of the ginger crab or the crab and mushroom soup but everyone else raved  about it. The salted crispy chicken was amazing and had msg on the side for those who wanted it. There was a delicious squab lettuce roll, braised beef over baby bok choy (my favorite), a shrimp and scallops dish with mixed vegetables and ginger, and some relatively innocuous noodles at the end. \n\nI'm leaving something out. Oh -- the warm tapioca soup dessert was delicious. \n\nWe also had Peking duck and it was succulent. \n\nService was good. There was no corkage fee for the wine we brought but that might have been an exception. \n\nIt's waaaaaaay out on Geary. Worth a trip.", "author": "Tim P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-26", "description": "This outer Richmond district outpost is almost a non-Yelp venue (local spot, not fancy, and something you don't want to share with non-natives) as it is already packed with the locals who know this place.  This is one of those Chinese family style restaurants that caters to mostly banquets of families and thus rarely if ever do I see non-Asians eating here on their own.  In fact I don't think I've ever paid for a meal here because usually I go here when my mother wants to take my family out to dinner.\n\nWe came here on Christmas Eve and it was packed.  We had reservations so we were able to get our table.  Parking was a little easier because of the holiday, but you often need to parka few blocks away.\n\nWe usually get a nice Westlake soup, their chicken salad, fried spicy chicken, some fish with mixed vegetables, some noodle dish, lettuce cups  and drinks for 11 people and it comes out to around $60.  What a deal!!!", "author": "Erik H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-06", "description": "The 7 Of us had lunch here\nAfter our golf game at Lincoln. We ordered double orders of everything. Started with the chinese chicken salad. It was huge and It was delicious!  It was freshly made and very crispy. I could have just had that\nFor lunch.  Next came the hun Tao Yee foo won Ton. It was big too but i managed to finish my bowl. The won Ton were big and meaty too!  Then came the curry tomato beef geen mein or crispy noodles. My favorite dish of the meal. There was plenty of crispy noodles and I tasted the curry!  It was yummy and it took no time for us all to finish it. Next came the beef chow fun with bean sprouts. It was okay. I like mine wet so it is as tasty but there was leftovers.  All in all, you can't go wrong with this place. Each of us paid $18 for lunch which for the quality of food was okay.", "author": "Donna L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-21", "description": "Kirin has been around for quite some time. My parents used to tell me it was all the rage in the 80s. Flash forward to 2018 weekends nights, this place is still booming. \n\n\nThe lunch menu is a steal. Big portions + soup of the day. The other day I enjoyed Kung Pow Tofu w/ white rice!  So delicious! \n\nSome favorites include: \nSpinach and garlic\nDry sautéed green beans \nAny type of chow fun \nSweet and sour soup\n\nYou honestly have to know what you're ordering to enjoy a meal here. It's under your discretion if you get a mystery meal or want to try something new. You can't go wrong with a classic dish.", "author": "Shannon M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-18", "description": "FAM FAV!!! English translation = Fish salad, fried wonton soup, snow pea sprout leaves (?), giant clam (silver vermicelli noodle).. seafood clay pot.. and peanuts to go they're that good", "author": "Briana W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-04-09", "description": "Reasonably priced Cantonese lunch. Good service, but food was meh.  Possibly we did not order their best dishes, but the dry fried beef chow fun was recommended by the waiter.  We also had wor won ton which was flavorless and shredded chicken chow mein which was good.  We did not like the raw bean sprouts on the chow fun.  And the heavy amount of grease in the bottom of the chow fun platter was not appetizing.  I did notice the \"wok hei\" that another reviewer mentioned, but an appetizing stir fry smell cannot overcome a dish that lacks flavor.\n\nPortions were generous but food was really mediocre.  As other reviewers have noted, the interior is a really tired '80s look and needs a good cleaning.  This restaurant was really popular in the late 80s and early 90s.  It seems stuck in a rut, although the chef from those days has passed away.", "author": "Joanna S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-08-14", "description": "We've been ordering to-go from Kirin for some time now and have always found their dishes to be hearty and the container almost struggling to contain things within, so when we came for an actual sit down dinner, we were definitely a little more than disappointed at what we found.\n\nWe ordered a variety of dishes:\nSticky Rice stuffed in Crispy Chicken - this was literally sticky rice stuffed inside Crispy Chicken SKIN. There was not one piece of chicken meat in this order. For $45, it's definitely a unique twist on a dish but hardly worth the price in my opinion. (3.5/5)\n\nSeafood Stir Fry with Mustard Greens - mustard greens were on point, they were crisp and not too bitter. Seafood (though only shrimp and scallops) were also decent in my opinion, but overall, the plate was small. (4/5)\n\nBlack Bean Cod Filets - WHERE THE FISH? This dish is literally onions and bell peppers sauteed in black bean sauce. (0/5)\n\nBraised Lamb in Clay Pot - decent flavor but many pieces were tendon or tough to chew. (3/5)\n\nPea Sprouts with Dried Scallop - slathered in gravy, my favorite vegetable became almost inedible because of how salty it was. (2/5)\n\nAs an additional note, for a Saturday night, this place was dead. We walked in at 6:30pm, there were 3 tables sat and we left as the only table in the restaurant. Somewhat telling, in my opinion.", "author": "Elaine Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-23", "description": "Chinese chicken salad is the best plate they have.  Winter melon soup is also a good choice. Otherwise yea it's an ok place to eat always busy but you can normally find a spot. Good for a family dinner", "author": "Jonathan W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-02-11", "description": "You will get alot of different Chinese food you wouldn't find anywhere else. It is very Cantonese in style, and I wouldn't way I'm a huge fan. \n- The wonton soup was by far a favorite, the meat inside was really delicious. Everything else that came afterwards... not so much. \n- The butterfly shrimp was bacon wrapped around shrimp, but fried to the point that the bacon tasted like hard cardboard. \n- Fried quail: definitely never had this before. Crispy and tasty, more game-y than chicken and much less meat. \n- Mandarin pork ribs: sounded delicious on the menu, but we hardly touched this. It came out cooked with a bright red-pink sauce, too sweet and tasted a bit floral. It was just really strange tasting.\n- The beef clay pot: expected there to be more taste to this dish, but I guess it was just classic Cantonese style clay pot, in a sort of bland tasting stew (texture was tender, though)\n\nOverall, kind of disappointed. Probably best to go with a large party and order the chicken stuffed with sticky rice (which is $42 and everyone here raves about) in advance", "author": "Ke C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-26", "description": "My family on both sides have been coming here for years.  Kirin is primarily a go to for banquet dinners.  There are some several smaller tables set up along the side.  We typically end up here eating off the banquet menu.  The walnut prawns, roast peking duck, and stuffed tofu are all good.  But the real winner here is the crispy chicken stuffed with sticky rice.  It's like crack!  The skin is so crispy, the sticky rice is sweet but has just the right consistency from being baked.  And it doesn't have any of the IMO gross black mushrooms and dried shrimp like most sticky rice.  Get it!  \n\nService is fair and prices are cheap.  Just writing this review makes me want an order of that chicken.  Who wants to drop an order off in the Peninsula for me?!", "author": "Cat C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-16", "description": "I'm a sucker for Mongolian Beef, even at those food courts at the mall. Kirin is across the street from the divey bar of Tradr Sam's and I may have been known to order $100 worth of Chinese food because of scorpion bowl consumption. But I digress. The Mongolian beef over rice is my favorite and has the perfect amount of spice and sauce. Not too salty or oily and you can add extra meat by $1 increments. It comes with the crispy noodles and if you're feeling really hungry, throw in some of the walnut prawns. Nom.", "author": "Marie C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-21", "description": "I ordered Yang Chow Fried Rice tonight. It was very good, and the price was reasonable ($10.80 including tax). I have ordered here over the years, not a lot, but sometimes. I was moved tonight to see the same faces I saw twenty years ago, when they were younger. Everybody has been there for many, many years, and that is nice.", "author": "Robert H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-02", "description": "Good food but the presentation left a little to be desired. Also the red plastic chopsticks were hard too see on the red tablecloth and were too slippery to grab the mu shu pork or the abalone.", "author": "Brian H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-14", "description": "I like the food at Kirin. My favorite is Fish Salad. Price is reasonable. Service is good!", "author": "Thomas H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-06", "description": "Old-school, authentic Cantonese restaurant that serves Cantonese dishes not found elsewhere.  This place has been around for decades.  I remember going here in the mid-80s and the place still looks the same.  Don't expect a fancy, modern restaurant but do expect good food with top-notch service.  The waiters wear nice vests and actually serve you.  Best service so far for a Cantonese home-style restaurant in the avenues.\n\nFor a Wednesday lunch, we ordered ala carte, family-style, and had:\n\nHung Tu Yee Foo Won Ton Soup - not made in many restaurants as this soup is labor intensive.  The Won Ton is fried first then added to a Westlake style seafood soup that has minced crab, BBQ pork, egg whites, cilantro, etc...\n\nChinese Chicken Salad - lots of fried won ton skins and red ginger.  The waiter will parse out onto small individual dishes rather than deliver to the table and leave.  I guess I am used to serving myself....nice!\n\nSalt & Pepper Fried Fish - large, tasty, slices of fired fish.  The fish was fresh and the fried outer layer did not get soggy over the course of the lunch.\n\nTwice Cooked Pork Belly - another large dish.  Could have benefitted from more fermented red bean curd paste.\n\nDid not order but if you have a large party, we saw old school dishes of Fried Whole Deboned Chicken Stuffed with Sticky Rice, Winter Melon Soup, etc...\n\nGo here for traditional Catonese cuisine with excellent service.  The waiter bagged up our leftovers rather than just bringing us take-out cartons.", "author": "Scott L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-12-23", "description": "Very good Chinese food. The Hung Tao Yee Wonton, Minced Beef and Egg over Rice, Pork Lard with Lettuce over rice, Walnut Prawns, Mao Tao Tofu \"Spicy\", and Clams with Black Bean Sauce are  delicious dishes.", "author": "Edmund L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-02-19", "description": "We attended a lunchtime banquet as part of a group of 14, mostly Asian.  Our first impression was that the place looked a bit tired: duct tape on the door handle; some torn chair upholstery; worn carpet; a restroom cluttered with chairs and equipment.\n\nAnother member of the party, who had recommended the place, took care of the ordering:  about a dozen courses from one of several banquet-menu options (listed prices ranging from $289 to $549 for a party of ten, with larger groups like ours presumably proportional), though there was apparently some room for negotiation over substitutions.  The food was more impressive than the room.  Everything came to the table hot and with good timing, placed efficiently and unobtrusively on a lazy Susan.  Highlights included crab egg drop soup;  chicken salad; shrimp lettuce wraps; sautéed prawns with peapods, sprouts, and mushrooms; salt and pepper chicken; broccoli and mixed vegetables; bok choy; whole crab; whole fish; Mandarin spareribs; wheat noodles with mushrooms.\n\nThe inevitable liter of 7-Up and bottle of Martinelli cider  on the table.  Limited beer selection:  Tsing Tao, Heineken, Bud, Sierra Nevada.  No hard liquor.\n\nWith tax and tip, our party paid $30 per head.\n\nMetered street parking is available on Geary, at $2.25 per hour; meters take credit cards.  Two hour limit, but meters can be fed.  Parking on nearby side streets is free if you can find it, but still subject to a two-hour limit, which I'm told is enforced.  Served by the 38-Geary bus from downtown; nowhere near any BART station.", "author": "Alan F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-05", "description": "Came on a Sunday right at 11:30 and it wasn't open yet even though the sign says it opens at 11:30.  The table was sticky and the seats were old with ripped cushions, and it smelled like cigarettes.  The food was pretty good though, a bit pricy for a neighborhood Chinese restaurant.  We ordered the salt and pepper chicken wings, it was really juicy and cooked just right. The wings were big and meaty.  We also ordered the shrimp fried rice which had tons of large shrimp and it was really good.  The beef chow fun with black bean sauce and green peppers was very tasty, and the asparagus with chicken was excellent.  Forgot to mention that our meal also came with complimentary soup.  It was a seaweed soup which was very tasty.  The only reason I can't give this place 5 stars is because of the sticky table and ripped up seats and bad smell.", "author": "P G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-17", "description": "This review is solely for the Hung Tao Yee Won Ton soup.  I haven't found too many places that make it and am so happy to have found Kirin.  I order it every time I come to SF and it tastes great fresh and reheated for late night snack/breakfast leftovers.  I usually just get it to-go and I haven't had anything else really so I'm not sure how their other food compares.", "author": "Jonathan C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-27", "description": "I've been eating with my family here since birth, and I've really only seen families eating here, too. I've been eating here long enough that I didn't know the name was Kirin... my cousins and I refer to it by hr owner's name, Henry's. Don't come with a small group - go big and go banquet style. \n\nThis is an old-school Chinese restaurant that's been around for ages, so it is crowded on the inside (especially when so many families are eating here) and service can get a little scarce sometimes (but it's usually not bad since there's usually table service with serving food). Try to get ahold of the main guy, Henry, and you'll be well taken care of. \n\nI'll be honest - I have no idea how we go about ordering food here. I think my relatives order ahead of time so we get the banquet style dinner (and a table), but I'm actually not super sure... but I can totally tell you which dishes are best. \n\n1. Fried quail here is the bomb dot com. Always perfectly seasoned and crispy, and always a consistent size. \n\n2. Order ahead and get the off-the-menu stuffed crispy chicken with glutinous rice. It's basically sticky rice inside of the most delicious crispy chicken skin. This is hands down one of my favorite, favorite things to eat, enough that we've started ordering two platters of it every time my family eats here. \n\n3. Lobster noodles here are great - the lobster is a little more seasoning-heavy and greasy than a seafood joint (such as Newport Seafood down in LA), but the noodles here are way better. Trust. \n\n4. With so much heavy food, get a soup, too. The winter melon soup is always good, IMO, and usually comes before the heavier entrees. \n\nOverall, this isn't fine dining, this isn't the best food you'll ever have, but it's homey and it's family style. Bring a (large) group and spend some good time catching up and eating.", "author": "Cat D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-17", "description": "I really like this place.  I've been here plenty of times and never go wrong with it. This is my grandfather's favorite Chinese restaurant in the city, in my opinion its way better and less greasy than anything in Chinatown SF.  It's a ways out of the city proper but the parking is better.  Pretty decent service for a Chinese restaurant as well.  \n\nPretty decent size as well as relatively clean.  Which is always a big plus for me.  I feel like this is a place where I would stop by if I was craving something.  Their jellyfish salad is pretty good as well as their winter melon soup... MMMMM... and you can't forget about the Jalepeno Fried Chicken... the bomb.", "author": "Cliff S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-07-23", "description": "Darn. Right when I found a place that made good chow fun and scrambled eggs I find a roach in the food.\n\nWe ordered take out last night and ate some of the food, but saved the rest. My mom was reaching for leftovers but found a dead roach on the bottom of the container. \n\nNot coming back.", "author": "Guilliana J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-07", "description": "Felt like having some Chinese food on the way home from the North Bay. Took a chance and gave this place a try.\nCrab & Corn soup was delicious with generous amounts of crab. Mu Shu pork was as good as any I've had. The only dish that fell short was the vegetable chow mein. The Veggies were fine but the noodles did not make the grade. Soft and not as tasty as I would like. \nOther dishes looked appealing as I checked out other tables.\nI would return to explore other dishes.", "author": "Ric W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-03-21", "description": "My family had our annual Chinese New Year dinner at Kirin earlier this month. As always, my family selected a set menu for our group of 30.\n\n*Chicken salad\n*Lettuce cup\n*Winter melon soup\n*Peking duck\n*Chicken stuffed with sticky rice\n*Walnut prawns\n*Fish\n*Mushrooms and bok choy\n*Yee mein\n*Taro and tapioca dessert\n\nMy favorite was the peking duck, but only because I love roast duck. The skin wasn't crispy as a peking duck should be. I just enjoyed the meat. Their special winter melon soup was beautifully presented. But taste wise, it was a little bland. The fish was good, but slightly overcooked. Disappointing since this is normally my favorite dish. The rest of the food was pretty average.\n\nI had fun celebrating CNY with my family, but the food was just A-OK.", "author": "Elena N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-11", "description": "The place looks a bit run down but the food is SO good here! It's tasty authentic Chinese food!  I would definitely eat here again and again!", "author": "Donna L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-18", "description": "Had the Giant Clams w/vermicelli, \"Hung To Yee Fu Won Ton (deep fried won ton soup), garlic snow pea sprouts, seafood claypot & their fish salad", "author": "Rowland W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-24", "description": "Super authentic Chinese food, one of the better ones in the city. I would definitely come here more often if it wasn't on the other side of the city. \nThe lobster noodles can not be beat here (believe me I've been trying to find some place closer) \nIf you order at least a day ahead they make the best crispy sticky rice stuffed chicken (best English translation I could come up with)\nWe've never ordered anything on the menu that disappointed. \nThe staff is super nice and hella attentive even when the house is full, pretty much every time I've gone. \nParking can be a pain but worth it.", "author": "Blake R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-08", "description": "Really, really solid food.  I grew up eating Chinese food in the Richmond district and I have eaten at most of them.\n\nMy father and I go out to lunch once a week.  When he asks where I want to do, I often ask to go to the Kirin.\n\nThe food is always tastes great.  We usually get the rice plates, which are reasonably priced and generous portions.  I love the kung pao but I sometimes get other things off the menu, too.  The menu is pretty long and has a lot of choices.  If you ask, they will make sustitutions within reason.  (For example, my dad does not like onions so he gets broccoli instead).\n\nThe service is prompt but I would not exactly characterize the waiters as \"personable.\"  That said, they get the job done.\n\nGreat place for really great Chinese!", "author": "Gary A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-03-25", "description": "Decent but not amazing. Had the family dinner for 6 plus pork hash, a traditional off the menu dish. The Chinese chicken salad was their best dish and the seafood soup with seaweed was good. The pork has was a disappointment with little flavor and poorly prepared. They also charged $10.50 for rice 7 people which is ridiculous and I've never experienced before at any Chinese place in the city.", "author": "Candace S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-08-15", "description": "In a battle for the best chicken salad this place would lose, despite what my friends believe.\n\nThese are the same friends who think that Panda Express is delicious, authentic Chinese food.\n\nCame here with a group of friends because they said I had to, I must, I couldn't miss, this place's chicken salad.\n\nFirst of their \"rainbow chicken salad' should be called \"wonton bits and fried noodles salad.\"\n\nActually there was hardly any chicken or lettuce. So, how this could be a salad I'm not sure.\n\nBut all the tables around us ordered two and three orders of this stuff.\n\nI thought it was very vinegary and bland. \n\nOh, with tons of peanuts.\n\nI guess if I were an elephant I would love this place. \n\nWe also had their winter melon soup, which was just average. It didn't have the nice seafood I'm used to, and instead they went with chicken broth instead of abalone and all that good stuff.\n\nTheir tofu pot and beef stew were also average. The spices weren't memorable, and their beef wasn't super good, but it wasn't bad either. Just average.\n\nIn the end, my friends asked if they could have my chicken salad, so I said \"Sure, knock yourselves out,\" and slid the plate to them.\n\nI was glad to be rid of it, to be honest.", "author": "Jack R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-21", "description": "KIRIN gets a * * * * FOUR STAR rating based solely off of one dish...\n\nThe HUNG TAO YEE FOO WON TON\n\nIt's a fried won ton, but not the typical American perception of fried won ton, it's a full won ton that is lightly fried.  Then it's put into a thicker soup, with real crab meat (not a lot, but enough to give it added flavor).\n\nIt's a \"Must Have\" and \"Go To\" dish to have, I'd say to \"share\" but in truth, one bowl for $7.50 is perfect for one person and once you start sharing, you'll regret giving others some of the Hung Tao Won Ton, and wish you'd ordered your own.\n\nIt's a great dish, rarely found at many restaurants and even if found, isn't often executed and delivered perfectly as they do at Kirin.\n\nEverything else here I've seen and had have been average, nothing awe inspiring, but nothing offensive to complain about either for the most part.\n\nKIRIN also has BELFAST CIDER, those San Francisco Chinese Americans who grew up in the 1970's and 1980's remember going to wedding banquets and seeing the Belfast Cider (used to have a white label over a glass bottle with gold lettering) along with a bottle of 7-Up and also a bottle of some sort of alcohol like Cognac in the middle of the lazy susan turntable at the large tables that seat 10.\n\nThe service here is fast, and typical of Chinese restaurants, sometimes overly friendly other times a bit disinterested, maybe it's cultural as well as linguistic barriers, but regardless, the job gets done and service is really contingent upon person to person and their personalities more so than a blanket statement of the restaurant or the people as a whole.\n\nParking is fairly easy, 'tho meters are $2.00 per hour, so 8 quarters gives you 60 minutes, and if you use nickles and dimes on SF meters it sometimes seems they don't give you the right proportionate amount of time and you might get gipped by the meters.  If you're willing to walk, there is neighborhood non-metered street parking that can be found, especially this far out of the Richmond and away from most of the busy retail areas.", "author": "Rick S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-10-16", "description": "Food was great, but they over charged, and when asked about it, persisted in charging us for the giant salad when we had the little one. We took their word for it, but later realized what had happened. Just a buzzkill.", "author": "Kris F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-06-22", "description": "A neighborhood restaurant that's been around for decades and keeps the locals coming back. A no frill type of Chinese restaurant which means prices are reasonable and portions are huge! Restaurant is pretty small but quite a few large tables - perfect for any of kind of \"celebratory\" Chinese dinner. You can make a reservation as well. \n\nI came for a birthday celebration recently and my friend's dad chose this particular restaurant. They are regulars and really enjoy the food. I wasn't too familiar with this area (Outer Richmond). Parking can be tough so prepare to walk a little unless you get really lucky. \n\nWe had their popular Chinese Chicken Salad which sounded weird at first because first of all, Chinese folks don't really EAT salads.  They like their greens cooked, hot, and saucy. Turns out there actually isn't any lettuce in it (LOL) but there plenty of yummy chicken, wonton strips, peanuts, etc. Almost every table ordered one of these! \n\nOur group also had a crab and corn soup, honey walnut shrimp, snow peas and beef, and lobster YEE MEIN. All the dishes were flavorful, well portioned, and delicious. Lobster was pretty decent size - definitely didn't feel ripped off. \n\nOverall I had a solid experience here and would come again if I was in the area!", "author": "Johanna L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-30", "description": "This is one of the best cantonese Chinese restaurants you'll find in SF. The food is excellent and the service is the good as well. We've been eating here for years. It's the kind of good ol' cantonese food we were raised with. Everything is well prepared and consistent.", "author": "Susan W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-05-19", "description": "It takes a lot for me to write a 1-star review, in this case it's because this restaurant is no longer sweet - it's sour (and it's not just about the pork.)\n\nIt is however about the chicken. \n\nKirin used to be one of our three go-to's in the Outer Richmond.\n\nLast night here's what happened:\n\n1. They asked if we wanted the Cashew Chicken w/Rice (new to me, but the price was right.)\n2. When I got there to pick up my food they said that \"Someone else took it and they'd make a new one.\"\n3. 10 minutes later a new one appeared.\n4. When we opened the bag we found 50% Cashew Chicken and 50% rice - barely enough main dish for two people.\n5. The chicken was a bit tough and fatty.\n6. The cashews were stale.\n7. The carrots were undercooked.\n8. It tasted bland at best and that's being nice about it.\n\nWe will be contacting the restaurant directly about our experience.\n\nSeriously, this was the worst chinese food we've had in years. And now that I noticed their health rating is 84 out of a 100, we won't be back.\n\nCome on Kirin, there are a TON of Chinese Restaurants on Geary and quality counts. \nBack to the Tsing Tao and Hunan Cafe 2 for us!", "author": "Dennis S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-09", "description": "I recently came here for a family dinner and was looking forward to a couple of their signature dishes.  My parents had pre-ordered the menu and most of the dishes were the stereotypical dishes, but the two that I was looking forward to were the winter-melon soup served in a winter-melon and the sticky-rice stuffed in deep fried chicken skin.  I was disappointed by both dishes.\n\nThe winter-melon soup was very bland and the chicken chunks in the broth were severely overcooked.  The melon flesh was very soft and the melon collapsed without the support of the melon flesh as expected..  \n\nThe sticky-rice that was inside the deep fried chicken skin was also very bland and the chicken skin was very crisp.  The pieces of the dish where cut into large non-bite sized pieces, so you could only eat the components of the dish separately without making a mess.  Imagine sticky-rice sandwiched between two very crisp pieces of chicken skin that are not bite-sized.  If you try to take a bite, all the sticky-rice falls out because the chicken skin is still intact and squeezes the sticky rice out.\n\nAll of the other dishes we had were decent, but I doubt I'd be back to this restaurant anytime in the near future.", "author": "Wilson K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-24", "description": "The Chinese food here is downright awesome!! Not only is the food absolutely tasty (their stir fries have a delightful wok hei flavor and their large clam and cellophane noodles have a wonderful fresh seafood flavor), it's quite photogenic too.  Everytime I go here, there's always a large party celebrating an important event like a birthday or the annual extended family get-together. I can definitely see why-outstanding food with your loved ones is always a winning combo!", "author": "P C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-11-10", "description": "Well, I was back again for another party. This time the Peking Duck was on the menu. This was one of the worst Peking Duck I have ever had!! The skin is supposed to be seared til it has a good crunch when you bite it. This was far from that. Instead it was mushy and no texture. The buns were OK though. \n\nOverall, this place is only good for a few items, the Fish Salad, the Oyster OR Squab Lettuce Cups and the Lobster Noodles. The rest of the menu is standard or below standard or way, way, way below standard such as the Peking Duck. If other places can make those few items then I would bet this place won't last too long.\n\nGee, I hope there are no more parties there for a while from anyone I know.", "author": "Rod W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-08", "description": "After visiting this restaurant twice, I can say, it is definitely a great choice on Geary in SF. We've visited this restaurant twice now and the quality of food and friendliness of the staff is great! Sorry in advance.. no pictures because I was hungry and gobbled before it crossed my mind to snap a shot. Typical.\n\nYou gotta get the chicken skin with sticky rice. It's exactly what it's called. Imagine sticky rice, sandwiched within chicken skin. Oh so fatty, and oh so delicious. Apparently it's by ordering ahead only. So if you have a craving for chicken skin and rice, you have to order it 24 hours in advance. It's nice to try, so definitely order that if you get a chance. \n\nFrom the seafood to the soups, all is great. The fried wonton in soup is good too.. and I'm typically not a fan of fried wontons. The honey walnut shrimp is tasty, but they could go a tad lighter on the sauce. Talk about mayo overload. \n\nDinner comes with almond jello or red bean. It's a nice surprise beyond the typical fortune cookies. \n\nCheck this spot out!", "author": "Deanna G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-22", "description": "For the fifth time, took my older son and daughter there for dinner. We always take a lot home for next day lunch or dinner. Menu is extensive. Among other dishes we had mushu pork, wow!! string beans with chicken, war won ton soup ,deep fried prawns wrapped in bacon, white rice and so on. Did not have the lobster with noodles this time, but it is a best buy in our opinion. I am 80 years old and have been abroad to Hong Kong, etc. not to mention all 50 States. I would rate this restaurant and the serving staff( very attentive to their customers ) at least 6 STARS!!!!! It is well worth the drive from Marin County to San Francisco to enjoy this dinning experience!!!!!!\nClifford R. Den Otter", "author": "Clifford D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-04-26", "description": "I've been going here for so many times. all the food that we ordered is always good. Would recommend it for those who wants to eat Chinese food. Love their lighting too.", "author": "Pia O."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-08-20", "description": "Starters: \n\nChow mien was very bland, veggie fried rice was fair. Egg rolls were so so. They do not have scallion pancakes which was disappointing. They do not have anything to drink except sodas. \n\nMain:\n\nTofu dishes were pretty good (we had two of them with mushrooms). They were the highlight. Chicken dish was not good. The pieces of chicken were rank. It looked more like an octopus than chicken. \n\nOverall:\n\nStaff was nice and family friendly hence the two stars. The food was a one star to my taste. It appears as though they just do everything as CHEAP as possible, especially the reject chicken. I would not eat here again. Sorry. I am going out to get ice cream now to cleanse my body.", "author": "Mike N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-26", "description": "Our go to place in San Francisco! Just had our wedding banquet there. All staff were dedicated to our guests. We really appreciated it.", "author": "Jimmy W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-28", "description": "Kirin has very unique Chinese delicacies.  My group ordered:\n\n(1) Eight precious jewels tofu clay pot\n(2) Pan-fried minced \"perpal\" tofu\n(3) Stuffed chicken with sweet rice\n\nThe stuffed chicken was incredible.  My group had never tried the dish before--sticky rice stuffed inside a chicken and sliced into large, bite-sized pieces. The chicken, which was cut and blended in to the sticky rice, was moist and flavorful.  The chicken skin on the outside was crispy and just the right amount of salty.  In addition to the chicken, we ordered a very unique tofu dish, minced \"perpal\" tofu. These were fried tofu pouches containing onion and other spices.  The eight precious jewels tofu clay pot was reliably delicious, as it had multiple types of seafood and mushrooms.  I thought the \"perpal\" tofu was a little too salty, but I really enjoyed the clay pot.\n\nNot only was the food memorable, the service was, too!  After refilling our glasses of water and attending to our table, our waiters hummed their way back to the opposite side of the restaurant.  A couple minutes later, their hums progressed to full-on singing of Chinese opera. Free (unintentional) music!  We had some less pleasant auditory stimulation, too, in the form of the restaurant's telephone ringing off the hook.  This could be a good or bad thing, depending on how you want to look at it. On one hand, the restaurant is popular. On the other hand, the restaurant ambiance is shot because the telephone never stops ringing!\n\nAll in all, a very memorable meal. Next time I'm trying the bitter melon soup, which I hear is a must try item.", "author": "Brittany N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-06", "description": "I've been coming here since I moved to the Outer Richmond district. Now that I am moved away from this area, I still drive back here to eat. I think they have the most tastiest and original Chinese dishes. We especially love their Rainbow Fish salad, winter melon soup, and much more. Though, I think they are a bit pricy. However, it is all worth it. I definitely recommend this place to anyone who wants a taste of original Chinese cuisine.", "author": "Elaine C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-01", "description": "My wife and I had a wonderful meal here. \n\nService was quick. The waiter was helpful and spoke English perfectly. When the soup came, the waiter even filled our bowls with soup, noodles and wontons from the main soup bowl. \nMy water was filled whenever I needed it, without asking. 5 stars for service.\nThe waiter made a point to wish well to every departing diner that he served. I made a point to give him a large tip because I was so happy with the service. \n\nThe wonton soup had the wonderful Chinese soup taste that I grew up with in Brooklyn, NY., It was full of wontons and noodles and I loved sharing it with my wife. Five stars for soup.\n\nThe lunch specials, were all large portions, as I could see from the other tables and most were $7.50.  \n\nWe shared a beef chow fun, lunch special. A big portion and maybe more beef than I have seen at any other Chinese restaurant in the Bay Area. The beef was seasoned and tasted just slightly sweet and had a wonderful beef flavor. The noodles and everything else was also full of wonderful flavor.  All this and only $7.50! (5 stars).\n\nTheir sweet and sour pork was tender and also tasted delicious. Most Bay Area restaurants overcook their pork. This pork was soft and cooked right. The taste was just as I like sweet and sour pork. The portion was large and full of pork. 5 stars.\n\nThis restaurant was more like a neighborhood Chinese restaurant in NYC or Philadelphia than what I have experienced in San Francisco. They were like the old school Chinese restaurants that I grew up with in the 1960's. Their food was great and tasted similar to the Chinese food that I grew up with. \n\nThis place accepts ALL credit cards. \n\nWe had a wonderful dining experience there and we just did not want it to end.  This was Chinese food at its best. \nMy wife and I will be sure to return this wonderful restaurant.", "author": "Steven G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-30", "description": "Kirin, my favorite Chinese to-go place since I work in the neighborhood. Their portions are huge, the complimentary soup is always thirst quenching. It takes less than 10 minutes for the order to be ready for pick-up even during their lunch busy hour. \n\nEating inside, one must try the chicken rainbow salad; filled with shredded chicken, fried wonton slices, and flavorful additions. The salad is my favorite appetizer! Great place with huge portions, delicious flavors!", "author": "Keith L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-15", "description": "I've attended several banquet meals at Kirin, but not for a casual dinner. Recently, the four of us came here on Saturday evening for dinner.  Arriving before 6pm, we noticed that there were many tables reserved for banquets, but we were able to get a table in front of the restaurant.\n\nInstead of ordering a pre-set dinner, we decide to each order one of our favorite dishes.   The dishes were:\n\nDried Bok Choy Soup - a pork based soup with dried bok choy, almond, and pieces of pork.  This complementary broth was tasty and a nice warm starter for our meal. (http://www.yelp.com/biz_photos/kirin-chinese-restaurant-san-francisco?select=FTWLjOb0WL1VftYlRubC6A#FTWLjOb0WL1VftYlRubC6A)\n\nClams in Black Bean Sauce - a generous portion of good-sized clams with some green peppers in a tasty black bean sauce with mince garlic. (http://www.yelp.com/biz_photos/kirin-chinese-restaurant-san-francisco?select=FTWLjOb0WL1VftYlRubC6A#60mMMTNhPaOJGDZ5dwU-2g)\n\nBraised Lamb with Dried Bean Curd - served in a metal bowl, the sauce was tasty, but felt that the portion of lamb in the dish was small. (http://www.yelp.com/biz_photos/kirin-chinese-restaurant-san-francisco?select=FTWLjOb0WL1VftYlRubC6A#827eBpXKu5vXk4BONHKIyQ)\n\nRod Cod Fillet over Greens - Nice large fish fillet served over a bed of baby bok choy.  Fish was moist and perfectly cooked. (http://www.yelp.com/biz_photos/kirin-chinese-restaurant-san-francisco?select=FTWLjOb0WL1VftYlRubC6A#Ijowi2_bb35xqR-YhqPh7w)\n\nSteamed Fresh Catfish with Black Bean - The thick slices of catfish were perfectly cooked and tasty with the black bean sauce.  Can you tell I love black bean and black bean sauce?  (http://www.yelp.com/biz_photos/kirin-chinese-restaurant-san-francisco?select=FTWLjOb0WL1VftYlRubC6A#_XFMFKlPYP6LrfSqUOqRSg)\n\nAlmond Jello with fruit cocktail - complementary dessert, which was not overly sweet.  It was a nice finish to an enjoyable meal.  You had a choice of red bean tapioca as well. (http://www.yelp.com/biz_photos/kirin-chinese-restaurant-san-francisco?select=FTWLjOb0WL1VftYlRubC6A#Y0OLyinBqkYMM3pfBQpp8g)\n\nOverall, food was very good and service was friendly and efficient.  Luckily we able to walk to the restaurant as parking in the area can be challenging.", "author": "Al L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-12", "description": "All the food we ordered was tasty. The large clam with glass noodles was delicious. My friends go there all the time and vouch for the consistency of the food quality.", "author": "Fiona M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-06-08", "description": "This place has very rude service and very bad food disgusting the sign said they were open till 930 I came in at 855 and and they said they were closed", "author": "Tony F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-04-13", "description": "We were driving by this place on Geary on the weekend and decided to stop for a quick dinner. Initially the waiter did not want to give us a table. They only cater for large family groups on the weekends. We were lucky to get a table finally.\nIt looks like a very popular neighborhood place and the food was good. They are popular for their crab dishes and we also ordered a fish fillet dish.\nI would recommend this place if you go with a larger group and people and they also have set menu which might work out economical.", "author": "Raman S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-02", "description": "We got special treatment from the manager. Don't know what our plates are called, we just ate. Our team sponsor ordered the food and I'm not sure if these plates were customize for the team. The plates are huge! Chicken wings are so good I wish I had more but knew they were greasy and we had Hooters the night before. All the food were so delicious especially the shrimp. I didn't want to use my hands to peel off the shell but I'm glad I did cause the shrimp was so good. Different from socal. After we finished the shrimp plate, the waiters brought out a bowl, with hot tea and lemon. Warning!!! It's not meant for drinking it meant for dipping your hands to wash off the seafood smell odor. Great food! Would love to come here with my family.", "author": "Lina L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-10-06", "description": "Came to try out the restaurant. My family and I arrived around noon and the restaurant was super empty. There was one other party here besides us, so we were seated immediately. \n\nThe menu is pretty pricey at first glance. NOT knowing what to get, my family and I just stuck to ordering off of the lunch specials. The dishes are fairly priced, $6.75-~$9.00 per dish. I got the chicken and broccoli chow Mein ($6.95), my sister got the pork fried rice ($6.95), my mom got the shrimp and beef over chow fun ($7.25) and my dad got (I think) the house special noodle soup (?) ($7.95). \n\n1. Chicken and broccoli Chow Mein - Salty!, not enough broccoli. But plenty of chicken, noodles weren't too bad but just a tad greasier than I like. \n\n2. Pork fried rice - very inconsistent dish. Some bites were bland and some were just eating chunks of salt!\n\n3. Egg and beef chow fun - no gravy. It was pretty good, not too oily. Only downside was that the noodles were overall pretty tasteless. Nice amount of eggs and beef was good. \n\n4. House special noodle soup - came out to be seafood soup. Very little noodle to meat ratio. Soup tasted like cabbage soup. Okay overall. \n\nNow on to the worse part of the experience at Kirin....the service SUCKS! The waiters could care less about you! They look bored, they are lazy, and they are very, VERY RUDE. The bald, large waiter couldn't be any more impatient waiting for us to decide what to order after five minutes of sitting down. When our food came, the dishes were dropped off very sloppily and the waiter just walked away. My experience with the staff was awful since I would say 3/4 of the waters we encountered fitted the description I just gave. The other waiter was okay, the guy with the full head of hair deserves the tip, not the other guys. \n\nThe food could be better and the service definitely could be a lot better. \n\nD", "author": "Alex T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-26", "description": "Why We Always Go to Kirin for the Family's Chinese New Year's Banquet*:\n\n1) A towering mound of Chicken Salad filled with pickled ginger, crispy wontons, and cilantro.\n\n2) Flavorful diced chicken in lettuce cups with plum sauce.\n\n3) Comforting winter melon soup served up in a huge husk and artfully carved.\n\n4) The artery clogging favorite: sticky rice covered in fried chicken skin.  (complete with creepy chicken head staring at you!)\n\n5) Duck with greasy skin wrapped up in a soft bun with plum sauce and scallions. \n\n6) Sauteed bok choy and mushrooms (my fave!)\n\n7) Mayo covered prawns with sesame sprinkled walnuts.\n\n8) A steamed fish dish that I had absolutely no room for.\n\n9) A cup full of long noodles for long life!\n\n*Usually in March.  Happy New Year / St. Patrick's Day!\n\n\n40J", "author": "Amy C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-02-10", "description": "The food as a whole is good.  And because of the good food, the waiting staff has developed an entitled status to the point that unless you pre-tip them, they will not provide service to you.  Unless they see or believe that you are \"worthy\" of them to kiss your behind, they won't lift a finger.\n\nManagement has been removed and do not see the real truth of the poor to non existence of customer care and service.\n\nThings won't change for they had not changed their service staff for the past fifteen plus years.", "author": "Dennis Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-25", "description": "Having come here for over 25 years, I felt it was time to write a review on just some of the many items that I have had over time. Kirin has consistently has been a steady and solid performer for small as well as large gatherings of family and friends.\n\nSoup:  Minced beef and parsley. simple and great on a cold evening.  The blend of beef and parsley is perfect as a starter. For those in your party that do not like parsley - ask them to place it on a side dish. winter melon soup is also one of my favorites as well. Either way, you cannot go wrong with these two items.\n\nAppetizer:  Can you say salt and pepper chicken? Perennial favorite hands down. Love the garnish of the diced green peppers and green onions.\n\nBeef Dishes:  Beef with broccoli, Beef with tofu, and Mongolian Beef. One cannot go wrong with any of these beef dishes.\n\nBeef Chow Fun:  As of recently, this dish has come out with a burned \"wok\" flavored taste and for whatever reason - has not been quite what it has used to be.\n\nSteamed Chicken with Ginger and Scallion sauce:  Oh so good and one that we usually order every time.\n\nPeking Duck with Steamed Buns:  One can order this although it is not on the menu if you call in ahead of time.  Just wish that Chinese restaurants in general would bring back those large size steam buns from years ago instead of the tiny \"mussel\" shaped buns that are used now a days.\n\nSalt and Pepper Sole:  Do you get the idea that I like ordering the salt and pepper items?\n\nSeafood:  any of the various steamed seafood dishes that the waiters recommend should you want to try a fish item.\n\nService:  Has always been great and should you go on a regular basis, many of the waiters will recognize you.", "author": "Richard H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-02-28", "description": "This place was super busy on Saturday night. It seemed like everyone ordered a banquet menu. We ordered a $250/table menu. The food was okay. Some of the items were unique from the typical Hong Kong style food.\n\nWhat we had:\n1) Chicken salad - HUGE salad! Wow. I couldn't believe the size of the salad. The salad was okay. Avoid if you do not like rice puffs or wonton skins. The salad had a lot of these.\n\n2) Minced seafood lettuce cups - I couldn't tell that the stuffing was minced seafood. Regardless, I still ate it since I like lettuce cups. Avoid if you don't like the rice puffs.\n\n3) Winter melon soup - This is another HUGE item! I've never seen a winter melon so big before. The soup was really good. It had a lot of flavor from the ham, mushrooms, melon, and the dried seafood.\n\n4) Honey walnut prawns - Okay dish. I just liked the walnuts.\n\n5) Sticky Rice Chicken - This was a cool dish. There was crispy skin from a chicken and underneath had sticky rice. I normally don't like to eat skin, but the crispiness was hard to resist. The sticky rice had some seafood and chicken.\n\n6) Bok Choy with shiitake mushrooms - Typical Chinese dish.\n\n7) Peking Duck with steamed buns - Avoid. The skin from the Peking duck was not crispy. It was a big pile of oil on the dish. In addition, there wasn't any green onions to put in the bun.\n\n8) Steamed Fish - The fish was fresh and not overcooked. Good dish to try.\n\n9) Dessert - Oranges and fortune cookies - I don't really count this as dessert.\n\nParking sucks. Just be at the right place and in the right time to get prime parking.\n\nReservations are highly recommended.", "author": "Jackie S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-10-18", "description": "Very disappointing. They sat us close to the door and had to wear coats to stay warm. Service was slow.  Spring rolls were somewhat tasteless.  Mooshu pork was ok but the rice pancake was dry. The kung pao chicken was boring.  The beef and long beans..... The beef was grissly the beans were ok.  \nEven the tea was off.  I have complained about the lack of good Chinese restaurants in Portland but all of Portland's Chinese places were better than this.", "author": "Bob K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-02-19", "description": "This has to be the most sorry ass hell hole they call restaurant. This is not even close to pathetic chinese cuisine. Went there cause my 2 sis wants to eat there.I don't even know where to start no parking or the food taste like shit or the waiter r stupid.I would think if someone order some appetizer it would be serve 1st and soup then entree. But this place is serving food how the waiters want to.order deep fry squab but who would of ever expect to come out after the 5th entree is serve on the table. Until I ask the waiter that do u guys need to go hunt for the dam bird 1st the stupid waiter reply to me we wanted to wait until u clear couple of dish 1st well if u would take your head out of your ass and serve the dam bird 1st than there would not be any problems.Also my sis order Mongolian beef which her husban likes. To me it look like white ghost food..U know in the early 80s chinese food for white folks. \nI gave a look to my sis DO I LOOK LIKE A WHITE GHOST TO U.The worst of it all was the so call sweet rice chicken ( Law mi Gai ) this look more like sweet rice soup, does not even taste close to any sweet rice chicken. How can something so simple turn oout to be so shitty.\nI don't even want to give review of other dish that we order  JUST put it this way total disgrace \nto Chinese cuisine.", "author": "Tommy M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-05-20", "description": "My grandmother swears by their chinese chicken salad. \n\nThe rest of the food was typical chinese food.... \n\nThey didn't automatically give us a pot of rice, which I thought was weird.  We had to ask for it maybe twice before they gave us rice.", "author": "Kristin H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-28", "description": "I must admit..this place is pretty good. We had low expectations since it wasn't as crowded as the other Chinese restaurants in San Fran on a Saturday night..esp on Memorial Day weekend. It isn't a fancy restaurant - just your normal Chinese restaurant. We were seated right away when we got here.\n\nWe ordered four dishes - sweet and sour pork, garlic pea tips, cod with black bean sauce, and half a chicken. We also had their fish maw and corn soup. All the food were tasty. They served fortune cookie and sweet soup for dessert. Relatively inexpensive Chinese restaurant. Took us by surprise since we wanted something really nice for dinner but everywhere were like a 2 hr wait!", "author": "Susie C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-13", "description": "Fresh. Low on msg. Friendly staff. Clean bathroom. Hard to come by when u go to an authentic Chinese restaurant.", "author": "Karatar A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-02-21", "description": "I don't know what happened to this place, by I used to come here all the time for family dinners. I went here a few days ago for another one and it was awful in terms of cleanliness. There was a lipstick stain on my glass. My napkin was dirty. There was hair in one of my dishes and when I took a noodle dish home, I found a metal piece of some sort. I can't believe they are able to operate under such disgusting conditions. I would not recommend anyone coming here or bringing any guests, especially family. Very embarrassing.", "author": "k h."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-06-30", "description": "Be careful on TOGO orders because they will over-charge you!!\n\nI ordered a hot and sour soup and beef/vegetable noodles- was overcharged and on top of that I found a hair in the hot and sour soup. If the soup was 10/10 I think I would have eaten the hair but it was kind of bland and not so tasty. Noodles were not so bad but didn't really have any vegetables with them.", "author": "RayRay M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-07", "description": "2words LUNCH SPECIAL . When asked what should I order ? What's my fav  dish ? Anything you order will be tasty fresh and filling . \nI worked in the area and frequented this place mannnnnnny times always thought it was funny when you ask them how long the food is going to be they yell through the phone TEN MINUTES!!!!! Love Kirin friendly staff  wonderful food", "author": "Adriana H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-01-27", "description": "Gung Hay Fat Choy! Year 4710 on the Lunar Chinese Calendar. \nYear of the Dragon, my year! \n\nWe came here like we did last year to celebrate Chinese New Year, and since Kirin is famous for its Fish Salad, that is what we ordered, a mountain of Fish salad! It was good! This is a dish that is increasingly hard to find. It is similar to Chinese Chicken Salad, but more refreshing and delicate. \n\nYou have to come here early, otherwise the cramped family style tables get all filled up. We always come at 5:00 pm to insure a table. \n\nOther tips for those who are not Chinese, but eating with them:\n\nThe Chinese aren't big on pubic displays of affection, so the way they (older Chinese) show their love is through food, and lots of it! They usually over order, because it would be super embarrassing for anyone to not be full and satiated! \n\nDo not insult your hosts by not attempting to eat that strange looking dish in front of you! Grin and bear it!\n\nAnd just like Amy Tan's Joy Luck Club taught you, you should politely refuse the first attempted offering from your host, wait for the next attempt, then acquiesce on the second.\n\nAnd when the lazy Susan comes your way, you should only take a little and leave enough for the others, don't hog the dish like a Pig! It isn't your year anyway, yet! \n\nAnd even though the host denigrates themselves to appear humble, you have to heap them with positive praise when they do that, so they can appear even more humble! DO NOT agree with their self-inflicted deprecations, or you will commit a serious Faux Pas! \n\nAll you Yellow Fever white guys dating Chinese girls better do your homework! OR you will hear a lot of Chinese chatter that is surely complaining about your White Devil poor manners! \n\nAs typical, we had a ton of food with many other dishes besides the Fish Salad. Like minced pork lettuce cups. And beef chow fun. and many more. \n\nKirin is also known for its Wintermelon soup, served in the rind. But you need to order this 24 hours ahead, just like you have to at most restaurants for Peking Duck. \n\nLast tip: Fight for the check, but not too hard. And thank your host profusely for the wonderful meal and the great choice of dishes.\n\nAnd don't expect a Red Envelope.", "author": "Wanugee N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-13", "description": "I agree. Customer service is good and professional. What could be another Chinese restaurant in San Francisco has a nice menu with wonton, rice dishes, and noodle plates. We had fried wonton soup, rice noodles with egg and shrimp(eggs were abnormally salty), and beef curry with rice. I like this restaurant on Geary and would come back.", "author": "Denise C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-20", "description": "Our family's go-to joint for large gatherings. Solid all around food. \n\nMongolian Beef, chicken wings, bitter melon soup and tofu and mushrooms in oyster sauce were the standouts last time. The Tomato Beef Chow Mein was a bit too sweet and needed more of that ketchup taste. Oh, and of course, you have to order the Chicken Salad. It's not traditional or anything but it's darn tasty.", "author": "Eric L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-05", "description": "Family favorite place!  A little pricey but really good food.  Try the fried chicken wings and chicken salad.", "author": "Jackie N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-23", "description": "First time there with my family and we a big group.. About 12. Never been there before and was one of the few restaurants that are open at an odd time.. 4ish.. Not quite dinner time but we were hungry. Definitely a good place less the fancy and good eats. Wish that had seat us to use 2 table as it was tight to eat. The only minus.. Food was tasty and great Portions for family style.", "author": "Minna M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-02-06", "description": "This was another Chinese New Year/89th B-Day event and I can honestly say one of THE BEST meals I've had in a long time. \n\nOld school here!\n\nWe're talking about dishes I haven't had in a long time and only at special occasion.\n\nRaw fish salad- WOW what an amazing and refreshing treat before the meal. Light, clean and full of great flavors and textures. \n\nSquab lettuce wraps - some of the best I've had in a while. Squab tasted clean and not gamey wrapped in perfect crispy lettuce. \n\nWinter Melon Soup- I haven't had this dish in years! It was perfectly cooked, melon scraped off the sides, amazingly light broth and bits and pieces of mushroom and chicken. Perfection! \n\nRice stuffed Chicken- Sticky sweet rice stuffed into a crispy de-boned and hollowed out chicken carcass. Words cannot describe how delicious this dish is. \n\nPeking duck with Bao - really do I need to say anymore?\n\nOyster, duck, pork with seaweed and fungus over lettuce - Dried oyster reconstituted with a deep grainy oyster taste, with fatty bits of pork and dark meat of the chicken topped with a xo sauce. Old school yumminess right there! \n\nBoy choy and mushrooms- the mushrooms were meaty and in a great sauce over steamed bok choy. Everything I love in my vegetables! \n\nHoney walnut prawn- yes an americanized dish but yummy and sweet nonetheless. \n\nChow mein - long noodles for long life. Considering my Uncle was turning 89 I can safely assume long lives are genetic in my family case. \n\nGreat meal and I will def be back!", "author": "Jade W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-07-19", "description": "This restaurant is beautiful, located in a nice shopping area right outside of Richmond with a open view of the kitchen it's very nice and clean.  And nice to see what's going on with the food from where we were sitting.  The reason this place only gets 2 stars is though the food is fresh it wasn't so good that I would rush back. Customer service was mediocre and they charge for tea,  which isn't customary for the many Asian restaurants I've been to before, and the .fortune cookies were stale.  :(  Also as we are sitting at our table less than 6 feet from the kitchen they started throwing the kitchen mats out causing dust to fly.  Major turn off.", "author": "Denise W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-03-27", "description": "Can I just say how freaking amazing their salt and pepper chicken wings are? And not to utter blasphemy, but they're almost better than my Chinese mother's! Sorry, mom. \n\nAnyhow, their salt and pepper chicken wings are one of the sole reasons for my pride in my Chinese heritage. The batter is light and utter delectable! And the waiters always manage to bring them out to your table right after they've been cooked and are smoking HOT! So bring eating one, try not to burn your tongue and remember, it's all about blowing. \n\nOn a side note, I'd also recommend their Fuk Kin Fried Rice. \n\nAnd if you plan on making reservations, they're required at least 2 weeks in advance, if not more. You're going to have to compete with those ginormous Asian families for your table.", "author": "Rebecca H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-06-17", "description": "During my visits to Dennys Cafe & Hong Kong Lounge the last time on seperate days... I came back here once again to Geary Street and this time, I went to go explore Kirin Chinese Restaurant... This was another chinese restaurant that, I have been wanting check out as well and another thing was before coming to Kirin Chinese Restaurant, I remember reading a great yelp review from one my yelp buddy Cassie J and that's what made me come to this place... \n\nAs soon as I got inside to kirin Chinese restaurant and when I looked at the menu, many many times in the past I have been eating Mince Beef W/ Raw Egg Over Rice to many timesso then... I wanted to eat something different so what I have ordered was the Steak Cubes W Tender Greens Over Steam Rice whixh I have not eaten in a very very long time and who knows how long...\n\nWhen, I gobbled up the whole Steak Cube & Tender Green Rice Plate and I really liked how the way how Kirin Chinese Restaurant prepared  the Steak Cubes and the Tender Greens for me which both of them had a really great taste!!!", "author": "William B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-11", "description": "All that is missing when I dine at Kirin is my couch and a flat screen smart TV.  I could sit for 24 hours chowing down this tasty food until I pass out in a stupor.\n\nMy bestie - who is Chinese - introduced me to this place.  I was told long ago when I came to SF that the best way to tell if a Chinese restaurant is a good one is to count the number of Chinese people eating in it.  Bingo.\n\nThe salt & pepper chicken wings are my Asian heroin.  I think in a food-off I could polish off maybe 50.  Hot & Sour soup: I could drain a bath tub full of that.  And the beef chow mein with Hong Kong style noodles......I just throw my head into it.\n\nThey are not stingy with the portions either.  Service is typically brisk - I walked in once and the waiter said 'What?' but I am just one lemming in the line and it's about the chow, I'm not dating the staff.\n\nYum - double Yum.", "author": "Casey C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-08-20", "description": "we ordered the 合菜，the food is quite solid, love how they cooked the lobster, quite tender and juicy.", "author": "Vivian Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-07-30", "description": "Food:\nI've been coming here for years.  The food is always better than your typical chinese restaurant.  Nothing too fancy here tho. Like many, I like the chicken salad. If you need to try something new, come here to try the chicken salad. Its really a symphony of flavors and textures. Its cruchy, sweet, savory its just everything. Be ready to drop $30 for that salad. I think its called the rainbow chicken salad. theres a fish version, but i like the chicken version.\n\nAtmosphere/Service:\nNot the most authentic place by some. Some feel that there are not enough chinese people there, or there are too many ABC's (american born chinese) there thus its less authentic.  But im fine with that. I let the food do the talking. Chinese restaurants are not about the service or the atmosphere. Service is a step above most chinese resturants.", "author": "Jason C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-05-06", "description": "I come to dine at this place minimally twice a year.\nFavs: rainbow fish salad (raw fish), \n           boneless, deep fried, stuffed noh mai guy\n           whole wintermelon soup (must order well in advance d/t cooking time)\n           fried wonton soup (lunch menu) but they will accomodate for dinner\n\nrecommend: make reservations as this place can get busy with family banquets\nthe chinese name for this place translates as \"9 Rivers Seafood Restaurant\"\nKow Kong is an area near toisan, chungsan, fatsan, off the pearl river delta in Hoi Nam county, Kwangtung province. That's why this place has a lot of frog and fish specialty dishes.\ni am a descendant from kow kong and my uncle who was raised in KK said the dishes on the menu are legit.\n\n1 quirk: street parking only.... and it's in a residential area off geary blvd!\nso i've elected to take the MUNI #38, exit 25th/26th avenue", "author": "Keikaikaoakua P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-27", "description": "Their rainbow chicken salad is particularly good and their chicken wings are the biggest I've ever seen. I've yet to taste one of their dishes and not like it. And the service is excellent, we've been regulars for years.", "author": "Alyssa L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-27", "description": "When I first heard that we had a way to eat here, (gift certificate,) I thought \"Isn't this that \"lobster noodle\" place? I recall in recent memory walking by here many times and reading this restaurants \"window specials.\" Everything seemed to be $29.99, including one of my favs, Lobster noodles. Actually, my knowledge/experience with Kirin goes \"back in the day.\" Back to a time when I think (correct me if I'm wrong please,) that this was a \"northeast China\" restaurant. You know, northeast China, where the food is hot, spicy, garlicky, thick sauce, kinda  Koreanish.  (Think San Tung.) The name would indicate that, Kirin being tucked away in northeast China, right on the border with Siberian Russia, which it was a part of till Mao snatched it after the war. (Kirin's Russian Orthodox churches are still famous.) I think I remember eating here with a Korean friend many years ago, and I think I recall the food being red,hot, and spicy. At that time we thought Kirin was \"the San Wang of the Richmond.\" So you can imagine my surprise when we entered and we heard all the waiters speaking Cantonese, and a quick look at the wall and window menus, showed us that this has been a Cantonese restaurant for a long time. Further, a quick look at the menu showed us that there were no \"Koreanish\" dishes here, (no Korean writing on the menu next to the descriptions, a giveaway. ) So oh well, no biggie, whatever. Cantonese food is one of our favs, so a quick mindset adjustment, (Winnie was looking forward to \"Cham pon\" (Korean-Chinese spicy seafood soup,) and we were good to go. So menu in hand, \"what are we gonna eat now....\" And then Winnie has a great idea. \"Why don't we order stuff that we don't usually eat? \" Wow! Profound. (Hey why didn't I think of that?) haha.  Expensive food here we come! We had a $60 gift certificate. So what if we go over and pay a bit extra, right? Haha. My lobster noodles, are suddenly \"in da house.\" So we started to order, and the riches flowed; But first, let's establish a rating system. Move over Michelin, (bunch of stuffy ole white guys in starched shirts and tuxedos deciding what we should eat.) We need a \"people's rating system,\" that reflects what real people with real pocketbooks eat. So the time has come for the \"Sushi G Rating System.\" Designed for YOU not Elon Musk. \"Power To The People,\" yelp style! So here goes. Yum-O! (with exclamation) means super good. \"Yum-O\" (no exclamation) means really good. Just \"Yum\" means good, and \"bleh\" means mediocre. Of course \"gag\" means awful. So now, that we are complete with the \"sushi g rating system\". (Wow, another yelp \"trademark\" for me! I'm unstoppable! I just keep pullin dem rabbits out of dem hats! One of the rare times I actually like myself! Haha,) First up, lobster noodles, (mandatory) Yum-O! Then. we had in random order, Deep fried tofu/ fish cake strips with bok choy. (Yum-o!) Chinese Greens with humongous button mushrooms, (Yum-o) Seafood Tofu Clay.Pot, (Yum-O) and Salt and Pepper Fried Squid, (Yum-o). After I asked, they gave us red bean dessert, (hong dao.) I had seen them bring out comp tapioca desserts (white, green,) to other tables after they finished their courses all nite, so after waiting and nothing came (but the bill,) I asked. And yes, they did bring it, but not willingly or happily, and with no comment or apology. We had just spent $75 there, wtf??? So one star off for kinda screwin up on the dessert at least, (and \"profiling\" at the most.) We were the only table that was not \"all Chinese,\" and some had spent far less than us and got it automatically, but one look at us, and \"not for them.\" They probably thought, \"no need, they probably don't even know about this, or that they're supposed to get it.\" Sux. But that did not ruin my evening. As I sat there staring at bae, and then at my big a-- plate of expensive Lobster noodles, and as I thought \"Tell the world that we finally got it all right, I choose you....\" I felt like Jay-Z and Beyoncé.....until I got outside, and....no limo, ...just my old Ford Focus, (with a big a--'ticket on the windshield,) and then I realized, \"nah, it's okay, I am, and always will be, just lil' ole sushi g,....,but this time, with a stomach full of Lobster Noodles.", "author": "George F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-07", "description": "This place is flat out AMAZING. I mean some dishes are oily and could be a bit crispier, but the other stuff.. MUY BUENO!\n\nI recommend the Chinese Chicken Salad. If you have a peanut allergy, ask for it without nuts. You could also try the lettuce cup, lobster noodle, fried squash, the friend salt and pepper chicken, etc. The tofu is great! Maybe try the seafood clay pot.", "author": "Jade F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-08-04", "description": "Great tomato beef chow mein with crispy noodles, which complimented well with the salt & pepper chicken wings.  Portions were large.  Ambiance was fair.  Prices were above average for this type of Chinese food.", "author": "Wally H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-27", "description": "Oh I still love the food here.  DELICIOUS cubed steak.  And it's not really cubed steak (what they call it on their menu).  Still, delicious tender slices of beef cooked with yummy gravy sauce and placed over some thinly sliced tomatoes...that's it, no veggie filler stuff cooked with it.  Their Mandarin pork chops are good too.  That is all for now...", "author": "Emy B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-06-26", "description": "Kirin is so close to my apartment, so every now and then, I come here out of convenience. The dishes I've tried have all been pretty average. However, it looks like the more popular dishes (like the big rainbow raw fish salad) do have a loyal fan base. Too bad the portions for those are ginormous, and I've never had a chance to bring an army here to try them. \n\nIf you do find yourself here, I would recommend the claypot dishes. Don't bother with their wonton soup.", "author": "Jing D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-04-12", "description": "There are so many Chinese restaurants in this City that it's hard to tell what's good, and what isn't.  I divide them into a couple categories:\n\n1. The truly awful ones that serve mostly Americanized-Chinese dishes. Food so bright and shiny you need to wear sunglasses. These have one billion items on their pink paper $5.95 lunch special menus, all Panda Express-y, minimal service, some good, all monster-sized portions, menu items that my Chinese mama has never heard of (what is egg foo young?), though it's still decent and a great value if you are hungryhippo-y.\n\n2.  Chinese restaurants for the locals, with affordable, authentic, solid food.  The majority of the Chinese eateries you'll find in SF, food somewhat shiny, prices ranging from $7.95/entree and up, an endless variety of dishes that are authentic, often filled with crowds of multi-generational Chinese families fighting over checks. Money fight FTW.\n\n3.  The nicer Chinese restaurants, the ones where you go for 10+ course banquet dinners, where they change your plate after every few courses, good service, VERY seafood heavy and an incredible value for the amount of food they give you, moist towelettes are often seen at these restaurants.  As are lobster-catching waiters who present to you live crustaceans for your inspection and approval. \n\n4. Expensive and clean Chinese restaurants that are Yelp- and/or city-guide-famous but that local Chinese don't go to.  I would imagine the food at these places is pretty good, but the lack of bang-for-your-buck deters most local Chinese people from frequenting. Value is a major criterion! Yank Sing is a prime example of this kind of restaurant. \n\nKirin is a solid Type 2 restaurant.  Good pricing, tasty, somewhat shiny food, acceptable service, and pretty authentic.  I came here last Saturday, and we ordered the Golden Crispy Chicken (half a chicken = $10) that comes with the pink and orange shrimp chips that stick to your tongue, the salt and pepper squid, beef and snow peas, and winter melon soup.  The chicken was great, and the skin was fried lovely - you bite and hear the CRISP sound!  Beef and snow peas were blindingly shiny. Awesome. The salt and pepper squid was alright; I've had better ones at dim sum places, but this was still good.  The winter melon soup was so savory and very light - thank you, MSG!  \n\nEverything was oh-so-solid, plus they gave us free dessert - either red bean soup or almond tofu, in addition to the standard fruit and fortune cookies.  Our entrees ranged in price from $7.50 to $9.75.  The service was fine too, though I think we were lucky to get one particularly nice waiter.  He offered us the free dessert and afterward another meaner waiter glanced over at our table and asked another colleague in Chinese: who decided to give them free dessert?!  Other waiter: who do you think?  \n\nHey waiters, heads up that a table of Chinese kids can understand you.  \n\nBut anyway, four very well-deserved stars for this solid Type 2 Chinese restaurant.  Meant to be eaten family-style, come here and enjoy some simple and good Chinese food. Though there wasn't any one dish that was so spectacular that I'd rave about it, everything was very good.  So if you're in the Outer Richmond, check it out.  Hopefully you get the nice waiter, too.", "author": "Vivian C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-01", "description": "Been a long time since I had been here. Still excellent. Kung pao chicken, broccoli beef, and my favorite dry braised green beans!!! We came to go to Zachary's pizza. But they were closed. It was like visiting an old friend. Oh yeah. The pan pacific own tins were amazing!!!", "author": "Mark P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-01-29", "description": "I was just here a week ago for my bro's birthday celebration. The servers were very friendly (more so than regular Chinese restaurants) and attentive. The food, however, got worse (in my opinion).\n\nEverything except the chicken salad was average. Most of the dishes were super salty (although we requested for low sodium) and drenched in sauce.\n\nIf you're looking for a superb Chinese restaurant, I suggest traveling half a dozen blocks down Geary and go to Hong Kong Lounge.", "author": "Jenny T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-02", "description": "Usually come here for large gatherings with my family. The staff here are friendly and the food is always good.", "author": "Sara L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-02-18", "description": "This place is absolutely wonderful. Always top service and huge amounts of food! \nOrder their:\n-Chinese chicken salad (i love the cilantro and the pink ginger, it really gives it an unusual kick!)\n-Lettuce cups (the filling is yummy and they always offer to give you more lettuce)\n-Steak Cubes with big black mushrooms ( the sauce used for the beef is like no other and is really juicy and flavorful. i always order this everytime i go here)\n-Lobster and/or Crab with garlic noodles (i think the salt and pepper King Crab is the best deep friend with garlic noodles. i've never had crab like that and am always sad when they're not in season :[ )\n-Salt and Pepper Chicken Wings ( look no further for chinese chicken wings, kirins will have your mouth watering . these are the bomb).", "author": "Emerald I."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-04-24", "description": "The place was close by my work , so I would go semi often.\nMore than once we were treated a little rude, no biggie , the food was decent & the price pretty well.\n But yesterday , I ordered to go for myself & two other people. They took 20min. to get our order. The chubby faced guy, frowned & said something under his breath ,when we asked for hot sauce & soy sauce (most places just give it without asking)\n Here is the clincher; as I am finishing my meal I find a rather large earwig in my dish\nHow do you post a pic on this thing ? of couse I took one.", "author": "Marcus M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-12-25", "description": "I've never had it before, and was skeptical, but my grandparents knew what they were talking about when they put a piece of the chicken stuffed with sticky rice on my plate. The crispy chicken skin was greasy but so good when you bite through it and into the soft, chewy, sticky rice. The differing textures caught my attention and I realized how delicious it was! I LOVE IT! Chicken sticky rice - you are now on my list of favorite Chinese dishes. I'll have to go to other restaurants and try it.\n\nWe ordered an extremely large amount of food for take out including all the usual dishes: pork spare ribs, mushrooms and bok choy, roast duck, catfish, lettuce cups, shrimp and walnuts, a squash and mushroom soup, and their chinese chicken salad amongst many other dishes that escape my mind. My particular piece of duck wasn't cooked thoroughly and looked a bit bloody near the bone. I found the food ordinary and only found the stuffed chicken worthy of remembering.", "author": "Samantha L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-12-20", "description": "Call me a dissenter, but we didn't love it. It was quite pricey. The kung pao prawns were spicy, though the menu did not prepare us for it. The walnut scallops were yummy, as everything fried is. I'd take Hunan Cafe #2 any day!\nUpdate: the kung pao shrimp was much more yummy the next day.", "author": "Andrew K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-02", "description": "This restaurant is a hidden gem. I was impressed with the service and the high quality of the meals! It was certainly the best Chinese food I have had in a while. I would highly recommend to anyone on this side of the city.", "author": "Dana M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-20", "description": "We used to come here all of the time when we lived 2 blocks away. \n\nIt used to be owned by this family and then they changed management to the chef that used to cook at 8 immortals? My grandma used to frequent that place all of the time and that's how we knew. \n\nFrom here, we used to always get one of the set menu dealios and it was pretty tasty. \n\nPretty good Chinese food, but it can get a little pricy. Best for  large groups or fancy get-togethers. You know, special occasion sorta-deals.", "author": "Alison N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-07-05", "description": "After a so-so Father's Day banquet, I couldn't help but remember my parents' disappointment about the Stuffed Chicken with Sweet Rice (aka Loh Mai Gai - a traditional dish that, like Peking Duck, most restaurants require a day's notice to prepare, except for here). I immediately thought of this place, recalling that they've never eaten here. When going to restaurants, customers are best advised to order their signature dishes. We tried two of the three as our menu consisted of the following: \n\nAppetizer \nRainbow Chicken Salad (signature) - No, this is not the same that you find in most Chinese restaurants and it's definitely not the same as the Costco kit. A mixture of rice noodles, fried shredded wonton skin, marinated/pickled ginger, peanuts, and, of course, shredded chicken meat. The other signature dish that we did NOT order (parents squeamish about raw fish) is their Rainbow Raw Fish Salad as it would have been repetitious. - $18.00 (small - enough to feed a party of six) \nSoup \nDried Bok Choy Soup (Choy Gon Tong) - A clean tasting broth with featuring sun-dried bok choy, almond seeds, and pork meat. The trick to this soup is cleaning the bok choy well, which they certainly did. - complimentary \nEntrees \nSugar Pea Sprouts with Dried Scallop - Sauteed large pea sprouts in a thick sauce filled with shredded dried scallop. This dish was a good pairing with our other entree. Everything was perfectly cooked and seasoned. - $15.75 \nStuffed Chicken with Sweet Rice (signature) - Deep fried chicken skin encases a tasty sticky rice seasoned with preserved pork (lap yuk - think cured ham), diced shitake mushrooms, pork meat, and dried shrimp. The trick is keeping the skin crispy and cooking the rice correctly (not too dry nor mushy). Success. - $33.00 \nDessert \nAlmond Jello with fruit cocktail - This was only okay for me as I like a heavy almond flavor to the jello which was lacking. \nTaro Tapioca - Hot sweet soup option that my parents chose. They finished it so it must have passed their test. - both complimentary, so how can you complain. \n\nWe arrived before 6 pm on a Saturday evening, which seemed like the right time as I found a parking space about a block away (parking can be difficult as this is the Richmond District). The dining room had only three occupied tables when we arrived, but it was mostly filled by the time we left around 7:15 pm. There are more large tables here as it is obviously a banquet destination for many locals. I noticed Jason G's lunch and Steve L's banquet experiences are great references for dining here with friends and family respectively.  As we left the restaurant, my parents kept trying to compare the meal to other places from past dinners. But I think we were in agreement that what they do well here is very good.", "author": "Mike C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-11-08", "description": "This is my 4th time to your restaurant. Why do I give it 1 star after being here several times and even taking pics and promoting your place? Because this time, my chow mien came with a cockroach. Ahhhh... why are you doing this to me! I love your food but not enough to come back after finding a roach.", "author": "KL H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-04-02", "description": "There are a couple of winners.  They include the rainbow fish salad and the sticky rice chicken.\n\nThe rainbow fish salad contains raw filet fish, but when tossed with the other ingredients, you barely can tell.  This dish reminds me of my childhood and of my dad.\n\nKirin makes a memorable sticky rice chicken.  This dish has to be ordered in advance.  This dish alone will fill you up.  It's a whole chicken butterflied and stuffed with sticky rice and other ingredients.  The chicken skin is crisp, and the rice is mixed with the right combination of dried shrimp, chopped mushrooms, and meat.\n\nThe big minus is the difficulty in finding a parking space.  Come and eat early or suffer the consequences.  There is a paid parking lot on 24th & Geary where Patelco C.U. used to stand, so that is an option.", "author": "Shirley N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-05-01", "description": "I came here for the first time this past weekend. My husband's extended family loves coming here and now I know why! The food here is soo good and such great quality! I definitely want to come back here for the same foods we had and some new ones like this chinese chicken salad or the rainbow raw fish salad, mhmm both sound yummy and huge! \n\nWe had the Peking Duck with buns, Crispy Chicken Stuffed with Rice, Winter Melon Soup, Steamed Fish, Stir-Fry Vegetables with Scallops and Broccoli with Beef. I'm sure there was more that I can't remember but all of it was soo soo good. Especially the Peking Duck with buns and the Crispy Chicken Stuffed with Rice. Also the Winter Melon soup was sooo delicious! but that tasted more chicken/pork soup and some winter melon with it since it was super flavourful, either way it was all super delicious. \n\nI would definitely come back here, too bad it's sooo far for us and parking totally sucks. We had to pay metered parking. $2 for 1 hour and we were there for like 3 hours... blah. Only because we had a big communion celebration luncheon going on, so it was worth it for the parking.", "author": "Grace L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-31", "description": "Great spot in the Richmond.  Everything I've ordered has been good - it's a clean, comfortable place with good service.\nThey have one of my absolute favorite dishes: Prawns and scrambled eggs over chow fun (not rice) - delicious!!", "author": "Brian C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-05-08", "description": "We originally wanted to dine at Hong Kong Lounge but since there was a wedding, the restaurant was closed to the public. After walking several blocks to Mayflower and discovering that the wait time was 30 minutes, we were starving and decided to try Kirin. Bad mistake.\n\nThe moment you walk into the restaurant, you can immediately tell that it's not as popular as other chinese restaurants down the street. There were few chinese people, signifying that it's not authentic enough. The entrees were pretty much average for a chinese restaurant - nothing special. We did have Cantonese style lobster (over noodles) and that was pretty decent, but is nothing compared to HK Lounge or Mayflower.", "author": "Kevin L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-08-20", "description": "Service: Grade B+... the server was polite and kind.  They weren't very social\n\nFood: Grade B-... we ordered a few dishes..  The dry fried ribs were tasty and everything else was average.\n\nOverall, OK  to TRY!!", "author": "E T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-09-28", "description": "The price/food quality ratio is very high here. Huge selection of great food...from very ethnic to very basic good Chinese food. I love their chow mein, their rice dishes,...great vegetable dishes. \n\nThe portions are very good. The staff is nice. It is a pretty clean place too. I like the quality of tong kiang better...but the price is so expensive there and the quantity is so small that KIRIN wins hands down!", "author": "David G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-03-31", "description": "Where do i begin. I'll start with the waiter. He comes over to take our order. Barks at us then Burps literally in my friends face then hurries us along. the entire time he's taking our order he's not paying attention to anything we're saying because he's talking to other employees and customers, then asks us twice sometimes 3 times what it was we just ordered. All the while he's making these crude snorting sounds. Disgusting! after out food came out i was pleased. Until i saw a little beedy eyed friend running across my TABLE! YES! a ROACH was on my table. and if you want to see it for yourself you can.\n\n http://www.facebook.com/video/video.php?v=1791013107761\n\nThe most disgusting place i've ever been. This restaurant needs to be shut down until it's had a full health inspection.", "author": "Reuben B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-01-30", "description": "It's one thing to go out and \"grab a drink\" with your nearest and dearest...it's quite another to know you are about to consume large quantities of tropical libations with your fellow safariers.  \n\nThankfully, I had some sense that the night could go downhill quickly on an empty stomach, so our fearless leader and I came here to get takeout.  Standard fare that you would expect, I went with the lemon chicken to go along with the tropical theme, and white rice against my better judgement.  I have been telling myself to eat more brown rice, but that goes right out the window when I'm hungry.\n\nThe food came out quickly, and although we really wanted to eat it out of cartons with chopsticks like you see them do in the movies, I could just see how bad it would have gone with chopsticks and a large bowl full of booze.  And the swordfights that would have ensued with said chopsticks.\n\nMy lemon chicken was mediocre at best, but it got the job done.  It's a cute little place, though, and I wouldn't mind going back in the future and trying another dish.  Although I could definitely see another Trad'r Sams trip immediately afterwards.", "author": "Pam S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-20", "description": "Just look in the window.  95% of the patrons are Chinese in this Chinese restaurant.  So there you go.\n\nTypical menu, but with some specials that shouldn't be missed.  Best part is, most of these are usually special order in other restaurants, but Kirin has these available year round.\n\nJust a couple of my favorites:\n\nChicken stuffed with sticky rice\nSnake soup (OK, this one is a winter special)\n\nOther favorites include:\n\nFried fish - I think these are bait fish?  Fabulously salt and pepper fried with jalapenos.\nWalnut prawns\nFantastic chicken salad\nRoast squab\n\nYummy, yummy, yummy for my tummy!", "author": "Denise M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-02-09", "description": "Sadly we came here for my mom's birthday because I heard it was good...well, it wasn't. Everything was horrible! I can't believe it's because I ordered the wrong thing because it all tasted like shit!!!\n\nSugar Peas Sprout with garlic sauce      13.50  3 stars  the best thing all night but look how much they charge for some fucking pea sprouts, really?\nSalt & Pepper Squid *      10.50  2 stars  ok but nothing special  \nGolden Crispy Chicken    half 11.00  whole 22.00  1 star  this was overcooked and dryer than the mojave desert and had no flavor\nPeking Duck order in advance      30.00  1 star  the duck was old, greasy, and gross\nShredded Chicken Chow Mein       6.95  1 star  thank God there was hot sauce and white pepper at the table\nMandarin Spareribs       10.75  I ordered it but they forgot to cook it, lucky us\n\nI would not go back if they paid me to, it was that bad. How they get any ratings beyond 1 star is beyond me. Then again, my father was a chef & I ran 2 Chinese restaurants.", "author": "May G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-03-20", "description": "1. Food didn't have much flavor.\n2. I don't think the waiter gave me the entire quantity of my leftovers.\n3. Fast service.\n4. Average ambience.\n\nBottom Line: I won't go back and I do not recommend this restaurant.", "author": "John W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-02-20", "description": "It's ok.\n\nOnce you eat Chinese food in Hawaii, nothing will compare.\n\nThey ran out of chow fun so we ate the chow mein, which was really mushroom-y, lemon chicken, which was dry and beef broccoli which was okay, not enough sauce.  \n\nTea was good and so was the service.\n\nBut, I think I'll wait till I go to Hawaii to eat Chinese food.", "author": "Marisa R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-06", "description": "We love Kirins , favorites would include calamari, fried chicken wings,chicken salad noodles & hong to Yee won ton", "author": "Tommy W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-09-01", "description": "Is it me...or do waiters at Chinese restaurants dislike Filipino patrons?\n\nI took my wife's family here for lunch on Labor Day as they were visiting for the day; touring the beautiful City by the Bay on an absolutely gorgeous day. The man who greeted us asked us how many were in our group and rudely showed a corner table with an abrupt \"Here!\" with a tone of disgust. For a party of eight, we were missing a couple of plates and teacups but nothing was offered. We had to grab them from the next table. \n\nHe returns with the menus and dumps them on our table. He won't even bother to say what the lunch special was and abruptly leaves. We check out the Lunch Menu and was pleasantly surprised to see that the majority of the dish where under $8.00. They ranged from $5.50 to $12.00. All agreed that it was a bargain indeed. We ordered some Rice Plates and Noodles, with a couple of Beef Won Ton soup for all. \n\nAfter several minutes, he returns with the soup and starts pouring them in those tiny soup bowls with a ladle. But he's splashing the soup and some are spilled onto the table. I look at his face and they are stone cold. Not even an acknowledgment as he leaves us yet again when he has done his duties. He didn't even bother to wipe the table from the soup spill he created. Nor did he bother to serve the soup and left them as is without saying a word. He's lucky we were hungry, otherwise, I would have dumped the soup on top of his head. I look at my wife, I look at her cousin and we laughed at the absurdity of the service. It's this kind of service that perpetuates the typical rude waiter stereotypes at Chinese restaurants. \n\nThen we received our lunch order and didn't expect a pile of food on a big plate. Boy they were hefty, and they surely didn't skimp on ingredients. You also wouldn't know there was a world-wide rice shortage by the amounts they were serving. Plus, their food was actually good. The seafood was full of seafood just as advertised. You usually get a good dose of vegetables with your seafood when you order them at other restaurants...but not this one.\n\nI had almost forgotten about the bad service we had gotten, and the food almost made up for the experience until I noticed the same waiter serving a group of other patrons. Now this group had arrived at least half an hour after us and the service they received compared to ours was like night and day. He was carefully serving their soup and even placed each bowl in front of every patron. He even managed to crack a smile and speak with them.\n\nThen this got me thinking:\n\n- Do we look like we don't tip?\n- Is it a cultural thing?\n- Or is it because I am not your kind?\n\nI know I am implying a racial undertone here but this is what we experienced and witnessed first hand. It's kinda too bad since we did enjoy their food. I'll give them 2 1/2 stars for now and will give them another chance to improve on our return visit. I would rate their food a 4 but the poor service greatly downgraded their rating. I'll give them another chance and only because the food and tea were really good. \n\nTo be continued?", "author": "John G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-12-21", "description": "We tend to stick to our usual Chinese eateries but every so often my mom like go out and have dinner out of the blue at a new place. You have to think quick on your feet, you pull our your cell phone and fire up the Yelp App which this time, pointed us to Kirin Chinese Restaurant.\n\nUpon walking in you feel like this is a C- Chinese restaurant. \n\nThis is how I grade my Chinese Restaurants:\nA - Think Gary Danko served Chinese food, eloquent, amazing food, and exceptional service.\nB - Think Koi's Palace, not the best, but trying to be Tommy Toy's status (deep down it is just a C grade Chinese Restaurant that cheated on the test) Oh, and they charge an arm and a leg for food and service that is not warranted.\nC - A C restaurant serves decent Chinese food, big portions, decent pricing, still loud, but has a semi-clean bathroom but it still smells nasty.\nD - A HOLE in the WALL, you see swarms of flies buzzing, dirty, grungy, loud.\n\nThere are no F's given because your Chinese mother would not approve and give you a good whacking with the bird feather duster.\n\nParking was a bit difficult during dinner time so we ended up parking a couple blocks away near Presidio Middle School. We were greeted by an elderly hostess who wasn't too friendly but just pointed at a table in the back near the kitchen and threw down the menus. (I hate sitting next to the kitchen where I can watch people prepare my food. I don't mind it at Pluto's because they know you can see them so no funny business.)\n\nWe ordered a bunch of food off their dated sticky menus and waited patiently for our food. The food soon came and everything was soooooo SHINY! like it was gleaming!!! You need sunglasses to eat this food. SHINY = OILY! Everything I ate left an oil slick down my esophagus and no water in the brown frosted plastic cups can flush it down. \n\nOverall my experience at Kirin was not the best but you can see that this restaurant targets the local crowd who are just lazy to cook at home that night. The prices are reasonable for the amount of food but I would have second thoughts coming back to this place.", "author": "Myron J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-19", "description": "This is my go to spot for Chinese food not because it is awesome, I mean I had better but because this place is near my work. I always order their beef and egg chowfun or pineapple chicken fried rice. Their prices are reasonable, and food is good. I have never eaten there, I only call them for takeouts.", "author": "Lubin T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-09", "description": "I love this place its great, staff is friendly and everything taste so yummy in the tummy, its not too expensive but well worth the adventure out to the outer Richmond :) I go all the time with my friends. \nI recommend the clay pot or any of the sea food dishes they are  all amazing", "author": "Veronica V."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-02-09", "description": "Nothing special, but maybe we came on an off night. They were fast to serve us but the food was not that good. I saw many other tables order similar dishes (we ordered from a set menu) and maybe the cook rushed to create large quantities. Would be hesitant to come back.", "author": "Kelly S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-08-18", "description": "Yelp never steers me wrong! Due to the ridiculous dearth of Chinese restaurants in Marin County, we have to venture to SF.  Kirin's location is very conveninent to the Golden Gate Bridge.\n\nI went with my husband, sister and 2 kids.  We had won ton soup, the pea shoots with garlic sauce, 1/2 crispy fried chicken, walnut prawns, eggplant with pork, salt and pepper fish, and the house crispy fried noodles.  Everything was DELICIOUS and served piping hot.  I wanted to get the rice stuffed chicken, but at $33, I had to pass!   My son LOVED the salt and pepper fish - and he generally dislikes Chinese food! \n\nI'd probably give 5 stars but the service was fairly atrocious.  We had to wait FOREVER to order (the restaurant was empty), our food took a long time, we had to ask multiple times for our first glass of water, we had to ask multiple times for forks (for the kids) and for a second glass of water (my son thought the salt/pepper fish was a little spicy).  We then waited forever for the check.... my expectation for service in a Chinese restaurant is generally pretty darn low but this was pretty dismal. \n\nAnyhow - great food, service not significantly worse than any other Chinese restaurant in SF - we'd definitely go back!", "author": "Jen K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-05", "description": "Great place in the Richmond District to eat at. \n\nGet the salad. Chicken or sashimi. But, make sure you order it early. You can't go wrong with the chicken wings either. Crunchy, a bit a tang from the jalepeno peppers. If you know you are going to eat there, call ahead the day before and order the stuffed whole chicken. It's sweet/sticky rice stuffed inside a whole chicken and deep fried. Just get it, trust me.\n\nOur family eats here alot actually and it turns out to be a benefit. The staff and owners remember us and sometimes give us a complimentary dish or something the chef will cook up special that's not on the menu.\n\nStreet parking only and it can be challenging to find. Worth the circling around the blocks though.", "author": "Brian L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-10-09", "description": "My in-laws get take out from here, A LOT.  They also eat here for family dinners, A LOT.  I am talking a few times a week on a regular basis.  You would think they would get tired of their food, but actually it's good Chinese food so we keep going back.  \n\nI recommend the chicken salad over lo mein noodles.  I know, salad at a Chinese restaurant?  This one is good.  You get some greens from the lettuce, protein from the chicken and starch from the noodles.  A perfect meal in one dish.\n\nOther dishes on repeat:  ma po tofu (it's spicy and good ratio of meat to tofu), peking spare ribs/gingo pai got, the chicken wings, and the minced pork with long beans.  If you like chow fun, go during lunch because by dinner time they usually run out. They also make a good honey walnut prawn.  I am one of the few in my family who likes to eat bitter melon.  They make a good bitter melon with chicken or beef.\n\nIf you are looking for a vegetable dish, try the...it's sounds like dao miu in Chinese, I don't know what it is in English.  Ask for it with spicy peppers, it adds a kick to the greens.  \n\nI could seriously review most of the dishes on the menu.  This is a solid consistent Chinese restaurant in the Richmond District.  It might be more pricey than the Chinese take out place on your street, but it's worth it.", "author": "Rowena B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-20", "description": "staff is very customer oriented! super friendly, fast service, and easy going. They always get my order right and never charge me extra if I ask for extra plates. My togo order is always done on time and I never have to wait. the portion is pretty decent for the price you pay. I havent tried anything special here, just the typical pineapple chicken friend rice and chow fun which was decent. \n\n- 1 star, do not order the general chows chicken, deep fried, oily, all batter, and very little pieces of chicken.", "author": "Quyen T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-26", "description": "Fried Chicken Wings are tasty. Hong Kong Style Chow Mein is good too.", "author": "Brian L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-12-01", "description": "A long time family favorite clearly disappointed us.  Far from their usual standards of very good food and friendly service, we were disappointed on Thanksgiving day.  As in past years, we arranged for the family (2 tables) to have dinner.  We had pre ordered the winter melon soup.\n\nUpon our arrival, the restaurant was quiet with few diners.  I slowly ordered food for the two tables I went it over it twice to make sure no confusion.  Due to the dietary likes and dislikes of the attendees, the dishes were different for the two tables.  \nWhy would the waiter be irritated with this arrangement - I don't understand.\n\nFood.  The food was just okay.  Winter melon soup lacked some of the ingredients that we had treasured for many years.  The soup was below par.  Chicken stuffed with sweet rice was equally bland.  Rainbow raw fish salad - wish we could say but it never came.  Shrimp with snow peas - good only if you could find the shrimp - no more than 4 pieces.  So and so on.  Very subpar performance on a night when business was very light.\n\nAside from the missing rainbow raw fish salad and the indifference of the waiter, the staff did mixed up the distinct orders for the two tables.  We had to continuously swap dishes to ensure the correct.", "author": "Bill L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-12-02", "description": "The only thing you need to know about this place is that you have to have to have to always order the RAW FISH SALAD.  According to my father, they don't make it anywhere else in the city, and it's a traditional dish from the village in China that my parents are from.  It's raw fish, spices, crispy won ton chips, and a ton of other things.  I love it so much I order it for take out even though it can be pricy.........(I think a small salad that serves 2 is about $30).............It is worth the cost though as it's amazing and you can't get it anywhere else.", "author": "Denise B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-02-28", "description": "We were back here again, for an extended family get together/Chinese New Year lunch with my father-in-law's side of the family. We had the same banquet menu from my last review, so I have nothing new to add as far as any new dishes. (See previous review for details of the dishes) \n\nI've been here many times since my last review, and will say this, the dishes and their preparations have been consistently good, and the servers were attentive and friendly, as always. Not surprising, since most of the staff, including the chef/owner, has worked together for more than 20 years. \n\nGood thing we planned this banquet at lunch, as we were pretty full after wards. \n\nStill remains a family favorite, and I'm sure we'll be back here again.", "author": "Steve L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-10", "description": "Wow! Very VERY tasty food here. I love taking new people here to see them leave happy with a full tummy. Try it. You will LOVE it. Having some tonight !!!!", "author": "C U."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-04-07", "description": "Where's the meat?!\n\nI had just finished working out after a long day at the office, so I was feeling especially tired and hungry (i.e. grumpy). My husband and I ordered a large bowl of winter melon soup and the stuffed chicken with sweet rice. A whole chicken should be enough for us, right? WRONG.\n\nThe soup wasn't particularly good - it didn't taste fresh, almost as if it had been made a week ago. The broth was a bit too salty and didn't have the lovely winter melon flavor incorporated into it. We then had to wait what seemed like half an hour for the chicken to come out...\n\nThe dish is basically the skin of a whole chicken that has been fried and stuffed with sticky rice...that's it. Initially, we enjoyed the combination of the crispy fried chicken skin with the warm sticky rice (not sweet rice as it's named). Then after about two pieces, we started to wonder about the chicken meat. There wasn't any chicken in the rice - were they going to bring the meat out separately (like they do with Peking duck)? Nope. You never get the chicken meat! How can they charge $30 for a chicken and not give you any of the meat?! It's absurd. I needed protein...just skin and rice did not to cut it for me. They also skimped on the amount of Chinese sausage in the sticky rice - just a few tiny bits instead of whole slices. No meat, bland, and greasy...never again. Such an unsatisfying meal.\n\n[Note: I probably wouldn't have been as disgruntled about the stuffed chicken had it been one of several dishes instead of my main course, but I still think it's a crime to charge $30 for under-seasoned chicken skin and rice.]", "author": "Karin V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-05", "description": "When i lived in the city, this was our go- to chinese restaurant.  \nGreat, authentic chinese food. Very friendly staff.  I think the same staff has \nbeen here a while.  Great for groups.  \nFood is very good. B+\nService is very good A-\nParking is tough \nThe bathrooms could be a little better maintained", "author": "uscot S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-09-17", "description": "This place is good for take-out as the portions are huge! \n\nI just got BBQ pork chow mein and shrimp won ton soup for $12. It could easily feed 2 people. The lunch menu is really cheap.\n\nThe food is nothing spectacular but for the quantity and price, I like it.", "author": "Rachel G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-11", "description": "The best lobster noodles in town!  $19.99 and you get a medium size lobster and noodles!  We had their salt and pepper crabs and salt and pepper prawns.  Their food is very good.", "author": "S C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-15", "description": "I've been to Kirin a few times and was in love with the food the first few times when we ordered dishes a la carte off the menu.  Today, we decided to try one of their set dinners (the one for $248) and I thought the food was very meh.  Although the presentation of the melon soup (supposedly $40 alone) was very dramatic (they cooked the soup in the melon and then carved it down after they served a bowl to everyone), it only tasted okay.  The sticky rice stuffed chicken dish was the worst that I've ever had.  The skin was hard and chewy and the sticky rice was very bland.  The Peking duck looked very unappetizing so I didn't even bother to try it (they didn't even cut the skin off correctly and where was the cucumber and scallions that it's supposed to be served with?).  The only decent dishes tonight were the honey walnut prawns and the steamed fish.\n\nI usually love Kirin but I was pretty disappointed with their food today =(  I guess we'll stick to ordering a la carte next time.  I absolutely love their salt and pepper frog legs (and I don't usually even even frog legs!) and their duck egg and clam dish (not sure what it's called in English but it's basically like salt and pepper clams with the shells on and it has bits of preserved salted duck eggs in it) and the Rainbow Raw Fish Salad (basically small pieces of sashimi fish with fried wonton skins, crispy noodles, preserved ginger)...delish!", "author": "Katelynn L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-30", "description": "Cant go wrong eating our state bird - and I give many thanks for his small bodied sacrifice!  If you roll through the Richmond district in the Yay I suggest eating the Quail, the raw fish salad, and the salted fried pork - makes you wanna say \"Daaaammmmnnnnn son\"  and it ain't even in Ctown (which honestly don't eat in Ctown - go where the locals go!)\n\nI love it long tine.", "author": "Fourty F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-02", "description": "Yummy food. Very courteous service. Will be a regular stop when I make my biweekly visits to this neighborhood.", "author": "Cynthia L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-10-14", "description": "Hit and miss:\nWintermelon soup: ok, unfortunately it has msg and can't be ordered w/o.\nStuffed chicken w/ sticky rice: good; could be tastier w/ a few more ingredients.\nLobster noodles: noodles were tasty; lobster a bit goopy, needs more roasted flavor.\nPeking duck: not that meaty or moist, buns were TERRIBLE, tasted like they were frozen and over-microwaved to the point that they were dry and dense with tough edges.  we all know what  overnuked bread tastes like. ugh.", "author": "Pat W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-05-31", "description": "-yet another Sterling Birthday Dinner tonight!\n\nspectacular Rainbow fish salad\n\nWest Lake Beef Soup\n\nHoney walnut prawns\nGlutinous rice chicken\nChinese broccoli in oyster sauce\nPeking red ribs sweet & sour\nSteamed stuffed tofu\nFried sliced eggplant\nLonglife noodles\nchoice of sweetened red bean or almond gel cubes with fruit cocktail\n\nand our Strawberry pavé layer cake.  (got coffee?)", "author": "Clifford L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-05-07", "description": "Went there after a recommendation.  Totally satisfied.  I've eaten at many chinese restaurants in SF and Kirin rates very highly.  Ordered from the chef's specialties and was not disappointed.\n\nService was pretty good, plenty of waiters ready to help. \n\nI'll be going back there on a regular basis to try some of their other dishes.", "author": "Acura Nsx T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-01-23", "description": "This place is pretty good. We went on a Wednesday night and it wasn't busy at all. Our meal was a little pricey but I think it's beause we ordered a few specialty dishes.\n\nWe ordered the Rainbow Raw Fish Salad which is unique - quite tasty. The Conch (sliced) and Steamed Soft Bean Cake were pretty good. They served us a soup - I only know the Chinese name but it was very flavorful.\n\nWe also ordered the Stuffed Chicken. This was the second time (R and G Lounge) I've had this kind of dish and I think aside from how cool it sounds to stuff and reshape a chicken with rice and skin, it's a bit too bland for my liking. Not dinging the place - just not my kind of dish. I've included a picture of how it looks. It's kinda neat. If you've never tried it, it's worth a try.", "author": "Barney M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-31", "description": "I wanted a Chinese restaurant that was authentic and different from the standard fare.  From the live seafood tanks to the chef's menu full of dishes I had never heard of, this was just the place I had mind.  Also, the friendly waiters and laughing, talking families all around made for a great atmoshpere.\n\nThere were two of us and two kids, so we went ahead and got the special with the chicken salad and winter melon soup with four entrees.  Of course it was way too much, but the salad and soup are Kirin specialties and I wanted to try some new dishes. \n\nThe soup and chicken salad definately lived up to their reputations.  All the entrees were great as well but the standout for me was the pork and oyster clay pot.  It actually had the largest oysters I've ever seen in it, and the whole thing was just the definition of savory.  Great experience!", "author": "Mark W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-06-08", "description": "We decided to try a new chinese restaurant while in the richmond area and this one popped up on yelp as a frontrunner. First impression, it's relatively clean and wide open, doesn't feel cramped at all. Second impression, the host guy was not very friendly. Just grunted and pointed at a table for us to sit out. \n\nThe three of us weren't very hungry and just wanted a snack so we ordered two dishes among the three of us: 1.) spicy salted chicken and 2.) conch with mixed veggies and yellow chives.  It ended up being a lot of food because the portions were pretty large and they give you free house soup and free house dessert (tapioca or almond jello).\n\nThe food was pretty good. The chicken wings were ginormous and very tasty. The conch dish was pretty generous too. A lot of places give you little conch and add in tons of cheap veggies like celery and carrots. This one had a lot of conch and yellow chives and formosa mushrooms.\n\nOverall, the food was above average. I knocked it down a star from a 4 because of the grumpy man in the front.", "author": "Theresa N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-12-09", "description": "Good traditional dishes. I personally like the Rainbow salad. It can get a bit crowded during the busy times and getting in and out of your seat is hard because all the tables are stacked next to each other.", "author": "Beth A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-06-01", "description": "My bf and I ate here a couple months ago and we were extremely disappointed. The wait staff barely paid attention to us and were rather rude. We ordered sweet and sour chicken, Mongolian beef, and steamed rice. Our food took forever to come out and it wasn't all that great. I felt it was a little pricey as well. We're never going back again!", "author": "Fallon P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-11-10", "description": "Excellent food & service.  My family's favorite go to place for good Chinese food, and special family gatherings.\n\nTHEIR UNIQUE MUST HAVES - \nFish Salad\nLettuce Cups\nChicken Sticky Rice\nThere's so many other great dishes here - you can't go wrong with anything.", "author": "Meredith K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-08-31", "description": "I really love the fried chicken here! If you order nothing else, do order the fried chicken. You cannot leave without eating it! The chicken salad was also very good. No, it is not your typical salad, but it is freakin good. The pan fried noodles were also pretty tasty. The service was very attentive and even gave us calamari on the house. \n\nEat it. Love the Fried Chicken. Repeat.", "author": "Jenna s."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-20", "description": "Always the place to visit for Chinese food in the Outer Richmond! Bang for your buck.\n\nRecommendations:\nFried Chicken Wings\nWonton in soup base\nCombination Hong Kong Style Pan Fried Noodles\nBeef Chow Fun", "author": "Carol P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-01-23", "description": "Tried the Hong Tao Yee Won Ton for lunch.  Always on the lookout for a good HTYWT place in the Bay Area.  The soup looked good.  I like the use of real crab in the broth, and the cilantro was a nice touch.  The won ton dumplings were bland and tasteless.  \n\nThe bathroom also smelled, but I guess that's normal for Chinese (non-fusion) food in the City.", "author": "Jason And Monica L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-12", "description": "my favorite neighborhood chinese restaurant! the waiters are always really nice and provide quick service. the food is also very consistent and always leaves me more than satisfied.", "author": "Sabrina L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-27", "description": "I've been going here for years because my uncle had his pharmacy next door.  The food has always been flavorful and they make the best traditional san francisco cantonese food.  The roast duck yee wonton is fantastic and everything i want (shredded roast duck, fried wonton, canned mushrooms and peas in soup).  Savory, flavorful and gives me memories of my childhood.  I also ordered the curry tomato beef pan fried noodles, perfect!!  A lot of places don't make this correctly b/c they're just cantonese restaurants and i think this is also an SF chinatown kind of dish.  The key is to make the tomato beef first and then add the curry.  I ordered to go and they separated my noodles to keep them crispy.  Sweet, curry, savory with a bit of a kick.  When i've been for dinner the fish salad and pressed chicken with sticky rice is a favorite.  Kirin you never let me down.", "author": "Susan Z."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-09-02", "description": "3.25\n\nWent here for a family event.  All of the dishes were decent, but for some reason they weren't all that flavored to me.  Portion sizes are averaged sized, service was ok, and parking was decent (on the street Sunday).  Couldn't comment on the price because this family event was prepaid for...", "author": "Brian Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-09-20", "description": "My family always comes here for Chinese New Year.  I also had both of my daughters' coming out parties here.  The staff is great and always remembers my family.  They're friendly and helpful.  The food is yummy!  The way the melon is cut for the soup is decorative.  Every time I eat here I always have my favorite dishes as I love Kirin's raw fish salad, black bean clams, honey mayonnaise walnut shrimp, and steamed fish.  \nThe parking is atrocious in this neighborhood though so if you have reservations, come earlier for sure to find parking.", "author": "Kekumukula N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-04-06", "description": "Always consistently great food and service!  No complaints at all about Kirin.  My family and I have been coming here for years and years.  I'm not sure what it is about this place, but it seems to be the central hub for Americanized Chinese families seeking a great meal.  While my family is extremely Americanized, Kirin never disappoints on the authenticity of the food.  Definitely one of the best Chinese restaurants in San Francisco.  \n\nOverall, environment is very clean for a Chinese restaurant.  There are about 8-10 round tables for big parties. and the rest are 4 tops.  \n\nFood is top notch here.  \n-  Winter Melon Soup, the melon is carved whole, and the soup is poured into it.  Very flavorful. Great on a cold day. \n- Cubed Steak with Veggies:   The beef is very tender and the sauce makes the meat extra juicy.  \n- Salt and Pepper Chicken Wings: *Licks lip*  Chicken is very meaty, fried to the perfect crisp-ness, and seasonsed perfectly with salt, pepper and garlic.  Definitely a FAVORITE of mine. \n-  Chicken Stuffed with Sticky Rice:  Can't talk about Kirin without talking about the whole chicken.  A meal all within itself.  The sticky rice is so yummy with Chinese sausage, cabbage, mushrooms, and I believe peanuts?  Love the thin layer of crispy skin on top.  Definitely for-go white rice when ordering this dish. \n\nService here is the best.  All of the servers are very attentive, accomodating, and friendly.  This is the best place to come for big family gatherings and holidays.  Customer service at Chinese restaurants is always a hit or miss, more often a MISS for me,  but here at Kirin, it's always a HIT.", "author": "Cass J."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-01-14", "description": "This should be ZERO stars. Found parts of a plastic bag in a spring roll.  I can not recommend eating at or from this restaurant! Yelp recommends not to share photos of personal experiences on the public site, so a picture can be seen on my personal account.", "author": "ben b."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-03-04", "description": "I came here wanting to try the rainbow chicken salad.  Since it was only my boyfriend and I  eating, it would've been ridiculous for us to order the salad because it was $18 for a HUGE plate!!  I plan to come back with a group to try it for sure.\nWe ended up ordering the Fried Flounder and the Chicken with Black Mushrooms and Soft Bean Cake.  Both dishes were kind of tasteless.  I was expecting it to be more flavorful!  Even the complimentary House Soup had more flavor in it!  Hopefully my next experience will be a tastier one.", "author": "jesiree b."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-26", "description": "The food is decent and price is in the range of $6+. The service is good, but when it's busy, good luck. It is clean for a Chinese restaurant as the plates and chopsticks were alright to use. I only go here for lunch and haven't had much to complain about. The portion is good sized and a bit more compared to other restaurants around. Parking maybe a bit of a problem as you need to find a space a few blocks away. Would recommend if your in the Richmond area, looking for good portion Chinese food.", "author": "Scott Y."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-05-19", "description": "OH HECK NO, don't come here if you don't want to get pissed off! We ordered ' (salted egg yolk crab)' that tasted nothing like it. There was no egg yolk crab flavor, instead there was some kind of stinky smell. It's some kind of stinky fish smell (preserved fish paste?). YUCK, the more I eat the that dish, the more upset my stomach felt.\n\nHorrible customer service, especially coming from the FAT waiter. We came here a few times and for some reason, he's always the one to serve us. Boy, he has some serious attitude problem. When we addressed the problem with the 'salted egg yolk crab dish,' he was no help at all. He told us he's sure that is what we ordered. Then, why is it that other customer's 'salted egg yolk crab dish' has a different color and texture from that of ours? \n\nOther dishes were pretty good but I refuse to give them even 3 stars because the crab dish made me feel sick and they have poor customer service. Oh and there was something in my glass of water. Can you say DD (DISTURBINGLY DISGUSTING)? YUCK.", "author": "Forest T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-06-26", "description": "How can one restaurant get such a variety of stars?  Easy.  It depends on who you are.  The five stars are going to come from the second/third generation SF Chinatown customers who know someone who knows someone else, and relatives.  And they are going to get the food, service and respect.  The others are out of luck.  When I or my family comes here, we always see someone ( relative, friend, friend's relative, etc.  I am related to Gary C., his review was 2 weeks ago ) We talk and catch up which always brings a waiter over and he is introduced, and then it goes.  The best is when my mother-in-law does the reservations and ordering.  Never had a bad meal here.", "author": "Michael N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-03-23", "description": "Came here once a few years ago with a coworker. I really didn't see anything special about this place other than the price being $$ and it being surrounded by parking meters so made lunch difficult in paying for parking.", "author": "M C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-03-03", "description": "We were sitting down for dinner when I heard a buzzing sound...I turned around and saw Mr Manager/ Owner SHAVING!  Yes- SHAVING his beard/ mustache at the cash register- in the dining room!  REAL CLASSY guy there!  Nothing tasted right after that...\n\nMost of the food here is comparable to Lucky Fortune down the street, but the prices are a lot higher.  The Lamb Stew was tough to chew and the Steamed Chicken w/ Chinese Sausage was also overcooked.\n\nI would not come back here unless it was to try their Raw Fish Salad.  I heard that that is their specialty and based on the Yelp pictures, it looks good, but I was dining with my kids tonight and they weren't convinced.\n\nFor similar style chinese, I recommend \"Ah Yee Lang Tong\" over on Balboa & 45th.", "author": "Judy K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-03-15", "description": "I came here on a recommendation and it was okay.  The dining staff was very good and attentive, one of the best around.  I thought the dishes were okay but not spectacular.  I wasn't blown away.  For the prices I have gotten better elsewhere.  I was a bit disappointed, but I wouldn't say it was a bad experience, just so so.", "author": "Asana T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-07-05", "description": "I came here with eight older and always feisty Chinese ladies-- and they all enjoyed the meal! The house soup was good-- there was winter melon in it. And the famous chicken salad was refreshing and delicious but definitely overpriced considering that the chicken pieces are miniscule and that the salad is primarily comprised of crunchy rice (?) sticks. We very much enjoyed the chicken with mushrooms and the clams with black bean sauce. The beef dish was tasty and so were the seafood noodles. No complaints. The food was hearty and delicious. Most importantly, the harshest critics-- feisty, brutally honest Chinese grandmoms-- all left full and happy. Whew! What a relief.", "author": "Melissa K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-11-30", "description": "we came here on a saturday night because all the other neighborhood chinese restaurants were full (mayflower, asia pearl etc)   the place was full when we arrived at around 7 and was empty when we left before 10.  there were 5 of us and the meal was cheap and we had tons of leftovers.\n\nwe had the raw fish salad (raw fish, cilantro, fried wonton/noodle things, other crunchy things, pickled ginger).  i was weary of eating raw fish in a chinese restaurant but it wasnt too bad.  im not a fan of fried wonton skin/noodle things.\n\nwe had the winter melon soup which a big steamed wintermelon.  my first bowl was a bit cold, not piping hot but overall it was good.  also kabocha with pork spare ribs - i liked the kabocha pumpkin!  a tchit gua with dried scallop sauce.  the aunties to them to cut the tchit gua thicker but when it came out it was thin.  it was tasty though.  also this chicken dish.  and a salty egg yolk crab.  next time we would go for the normal green onion ginger crab.  the salty egg yolk was almost nonexistent but there was a thick flour coating on the crab.", "author": "claudia y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-09-10", "description": "Irish people love Chinese food.  Why?  Because we have massive families and you can actually take your whole mess o' kids and grandkids to Chinese food without a reservation and get a huge round table at which everyone can be equally scolded and guilted by the patriarch.  \n\nAlso, my grandparents were raised during (aka were defined by, aka couldn't stop talking about, aka were totally scarred by) the Depression, so they weren't going to pay a lot for that muffler.  Kirin is crazy-reasonable, which probably saved us from having our family dinners on the curb in front of a taco truck.\n\nWe started eating at Kirin back when dinosaurs roamed the earth.  Which was about the time we were chased out of our former Chinese place, called Mary's, because my grandfather left a tiny tip and the waiter freaked.  And while I totally agree that the food at Kirin is incredibly tasty and the authenticity deserves mad props, we were really just here because my grandfather could feed all 16 of us for like $40.  So lucky us that the food was excellent as well.  \n\nI still have such a soft spot for this joint and I try to eat here whenever I'm in the neighborhood.  Thanks to the waiters of yesteryear for not yelling at us when they saw that Depression-era tip and just patiently waited for us to get my grandfather outside before we scrambled back with more money.", "author": "Rosie W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-07-30", "description": "Not sure why the city needs a place like this. The food is just ok, the prices are really high, especially for what you get and the service is baffling. You want to root for small places, but these guys seem like they are not even trying. With much better places a block in either direction, I can't say I would try it again.", "author": "Bob R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-10-09", "description": "I walked up to Kirin for lunch with two of my friends yesterday and thought that this restaurant was going to be bad.  I was wrong and my friend Oliver was right. This place is good.\n\nThis place is your typical run of the mill Chinese restaurant but with great service.   A lot of Asian contractors come here for lunch.............so you know what  that means.  It's good, the portions are going to be huge and it's cheap.  The waiter comes out with a plate of napkins and a carafe of ice water.  Kinda caught me off guard.\n\nI looked around and saw a bunch of  food coming out. and it looked fantastic  I don't know why we always order so much food.\n\nChicken Salad.  Looks very bland but tasted surprisingly fresh and flavorful\n\nDry fried chicken wings....Portions are huge.  A little too greasy for me but the flavor was there.  Capitol restaurant in Chinatown is a lot better and it's not even close to San Tung on Irving st. Overall the chicken wings are still good. I just had better.\n\nVegetables with cod fillet....this dish is not that good.  Didn't taste as fresh as it could be.  Will never order this one again.\n\nSteamed pork with salted egg.  I would say one of the best dishes here.  You gotta have rice with this dish.  An oldie but goodie.\n\nPea shoots with garlic.............The portion on this dish were huge and it was one of my favorite dishes.\n\nAll 5 dishes came out to 41 dollars.  \n\nI would come back to try the other items on their menu soon.", "author": "jason g."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-14", "description": "I call this place my soul food fix!! Love the Chinese food here! The salt n pepper pork chops and salt and pepper fish are my favorite go to dishes . The chow fun is delicious as well! This place never let's me down ! The place is really like a family kind of restaurant . Great service and food ! Yum!", "author": "Judy C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-12-17", "description": "KOI Palace was way too busy and the wait was too long, so had to settle for here. It actually wasn't bad. It was crowded with large groups for birthday and just family/friends gathering. Ambiance looked like any other Chinese restaurant and the servers were really nice and quick with everything.\n\nFood!\n*Rainbow Raw Fish Salad- It was a little too sweet for me and the portion was so big!! But for $26.00 for a small, it should be big. It had like fried wonton strips, those fried white noodle looking things, raw yellowtail pieces?. ginger, cilantro, peanut, onion, red pepper. This is really filling so don't eat too much\n*Honey Walnut Prawn- I think I ate like 6 pieces of prawn and probably all the honey walnuts. It's was pretty damn good! Fried shrimp with mayo. Who wouldn't like that?\n*Salt and pepper filet of Sole-This was also good. Didn't look oily at all. You're eating something healthy and bad at the same time so don't feel bad for eating this. Fish-healthy, being fried-bad!\n*Golden Crispy Chicken-I think that was a whole order of chicken (in my pictures) and if it is, they gave a shit load of chicken! I liked the crispy skin of the chicken but the chicken itself was a little dry for my taste.\n*Combo Pan Fried Noodle-Crispy noodle on the outside but inside is soft with the sauce. Loaded with seafood and meat ingredients. Really yummy!\n*Conch sliced with vegetables and yellow chive- I didn't eat this one because I was way too full! But it looked delicious!\n*Complementary Almond tofu with fruit salad-Nice and healthy.\n\nA great place for Chinese dinner but parking sucks at night on weekends.", "author": "Juliane N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-01", "description": "After a long hike and some quality outdoor time, some Chinese food sounded  good.  We were in the neighborhood and yelped this place.  Finding parking was a bit of a chore, but once we finally made it to the front door, we were seated quickly.   \nThe place was pretty full and the menu a little cryptic (when was the last time I ordered something besides mu shu shrimp?  embarrassing!) so we ordered corn soup ...and I don't remember what else we ordered...mostly because we were entertained and distracted by the elvis impersonator singing to a lovely blue haired lady named Grace.  We mentally retraced our steps - had we eaten any mushrooms with our breakfast?  The whole thing was a little surreal.  \n\nThe second time we came was Christmas day, again after trouncing about outside in the wind on the beach.  This time we had the good fortune of meeting up with 4 others so we could get the 6-person meal, with a side of the amazing corn soup.   \n\nThe chicken salad is amazing.    This with the corn soup is the new standard for Chinese dinner for me!  (though I won't completely shun the mu shu)   The other dishes were good, but I think that had we ordered a la carte, we would have chosen a lot more veggies and less breaded and beefy dishes.     For $20 per person, we feasted well and tried some new dishes, though next time we'll probably choose a la carte.", "author": "Maria C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-15", "description": "been coming here for years with family.  lives pretty close by, walking distance.  not the biggest place in the world. so pray that theres no banquets when you go.  there tends to be a lot of parties hosted on saturdays and sundays.  maybe weekdays too? who knows.  the waiters have been there forever since i was a kid.  always recognize the same people.  they know us and joke with us all the time.  great customer service in that aspect for an asian restaurant.  okay so food time.  quail - order in advance, chinese salad - order in advance, chicken skin with rice inside - order in advance, guava soup - order in advance.  okay so now that we got those out of the way, time to order the day of.  salt and pepper chicken wings are moist and hot and crispy and spicy! full of garlic too.  best wings ever.  well besides bon chon.  but those are different.  every other dish is pretty good.  better than average.  nothing superior to other places like noodle dishes and rice dishes.  parking is hard to find.  well easier now that meter is everywhere and everyone is too cheap to pay.  aint nobody got money for that!", "author": "Matthew G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-02-19", "description": "We do the T. family round-up a few times a year. Most recently it was for Chinese New Year and I refuse to get anywhere other than Kirin. If it's not Kirin, I'm not goin'! So I'm a bit of a brat. But my family would never fight me on this because they know as well as I that Kirin has the best Mongolian Beef and Crispy Chicken in town. They can make my fav vege dish of tofu, dried mushroom, and pea-sprouts in gravy like no other, and it's in my hood! Plus, they give you the option of almond jello or red bean soup for dessert!\n\nI almost forgot to mention that it is also clean! That in itself deserves five stars!", "author": "Deanna T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-11-27", "description": "This place is haunted. \n\nWe were sitting at one of the tables by the window (closest to the door), enjoying our salt and peppered squash and kung pao chicken when all of a sudden there was a huge BOOM. We looked over to the other table in the front of the store, the one directly to our left, when we realized that the lazy susan had rolled off the table and on to the floor. And there was no one sitting there.\n\nCreeeepppyyyyyy. \n\nThis was only my first time at Kirin and I only got to taste a few things, so let me tell you about those. They're not kidding when they describe the squash as salt and peppered... at times I felt like I was eating fries from McDonalds. They would have been AWESOME if just a little less salty. The kung pao chicken was pretty average (but then again, we were pretty safe by ordering that) and the pork fried rice was really good. We're talking even-better-two-days-later-for-lunch good. \n\nAnd if you're ever wondering where to buy a vacuum cleaner in the Outer Richmond, check out the men's bathroom at Kirin; they have every brand you can imagine.", "author": "Jared S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-04-29", "description": "The food was exceptional.  No fake scallops here.  Good fish.  Tasty meat.  Duck was awesome.", "author": "STEVE L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-10", "description": "Table for 10 family & cousins to chat & catch up. Still one of the top choices for our group. Ordered the special Yu Sang Salad(Everyone stopped talking until we ate it all). Then we had the juicy & crunchy jow gai yick, and Beef Tomato Curry Chow Mein, and garlic asparagus(Everyone loves garlic). Eclectic lunch but loved it!", "author": "GARY C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-09-11", "description": "Pleasant. Very pleasant.\nWe just had 4 dishes for dinner; stuffed wontons, kung pao prawns, chow mein, and mandarin-style pork spareribs. First 3 were solid, if not remarkable. The spareribs, however, were certified kick-ass. Our servers were all really nice and attentive. We got a ton of food at very reasonable price. Definitely going again.", "author": "Raymond P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-07-01", "description": "When you look into a Chinese restaurant, and see that is is actually full of Chinese people, you know in your heart that the food is good.  With so many mediocre places to nosh in the city, authenticity has taken the front seat in my decision-making-mobile.\n\n   Every visit, I am intrigued by what everyone else seems to be eating.  Yes, most of it is meat, but the way it is presented fascinates me.  On the menu, I see things like squab (please tell me that's not pigeon), sea turtle, conch (shell?), goose feet, and an 88.00 bowl of soup that has to be ordered ahead of time.  None of this applies to me, but it's interesting nonetheless. \n\n   Never once have I been disappointed with the array of vegetarian dishes I have tried at Kirin.  Our server, who is wonderful, impeccable, and on-point every time we go, knew us after our first visit.  We came back the  second time almost a month and a half later, ordering a different dish and he said, \"Oh, you're trying something else?\"\n\n   He truly remembered our faces and what we ate the last time we were there.  I remain very impressed by this.  His genuinity was the most amazing part... he really wanted us to enjoy it as much as the last thing we'd tried.\n\n   I am just waiting for an occasion when I can go with a group and actually get to use the enormous tabletop Lazy Susans.  There's just not enough food to spin around when there's only 2 of you.\n\n   Yum.", "author": "Lea N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-10-08", "description": "Such good Cantonese food. Great prices. Good service. \n\nLobster noodles are bomb! \n\nThis is our favorite local Chinese take-out, eat-in. Always reliable and delicious - and makes me think why I ever bother cooking at all. \n\nI also think it says a lot about a place when the wait staff hasn't changed in years.", "author": "Lily H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-01-04", "description": "+ Garlic pea sprouts. Awesome goodness. First dish to be cleared. \n+ Crab and corn soup. YUM. \n+ Walnut prawns. Nice portion and flavor. \n+ Salt and pepper spareribs. Variety of sizes. \n- Salted fish and tofu clay pot. But only because it wasn't what we ordered and we were too lazy/hungry to send it back. \n- Duck. We left half the plate on the table. \n\nThey did seat us nine with a relatively short notice reservation on NYE. It's pretty pricey for a Chinese restaurant, but sounds like the lunch specials are a better deal.", "author": "Jenny L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-09", "description": "Recently had my birthday dinner here.  And the food was as delicious.  My favorite dish is the Raw Fish Salad, which at $27.00 for a half order feeds 6 people.  On the rare occassion that I am craving this dish. . . they have done a smaller to-go version for $13.00. \nOf course there are other items on the dinner table, chicken, dried fried beans. . .but nothing compares to their chicken salad and raw fish salad. . will make it a point to try other dishes and report back.", "author": "Kea C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-01-25", "description": "We had the salty fish/chicken in clay pot, filet of sole with mixed vegetables, and hot/sour soup.  \n\nThe sole was pretty decent, although it was pretty bland.  The salty fish was very fishy - definitely an acquired taste.  The hot/sour soup was pretty much what you'd expect - a little on the sour side...\n\nInteresting service.  At times it felt like they were trying to make things a little more upscale, but it was all lost in the waiters who spent much of the time staring into space... sorry, it's just the truth.  It took effort to get the bill, but they snatched up the payment in no time.", "author": "Andrew S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-08", "description": "The food is overall good. On days where it is not busy the food comes out quick. However when there are alot of people then then the food comes out pretty slowly. The portions are big as well", "author": "Jeremy H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-10-30", "description": "best place to go to for lunch.  i love their HOUSE SPECIAL fried rice.  it has all kinds of seafood in it with chicken and beef.", "author": "Kurt N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-11-25", "description": "Rainbow Chicken Salad, people!  \n\nIf you come for dinner, I highly recommend getting enough people together for the 6 person combo.  It was just me, girlie, and parents, but we decided to upgrade as the 6 person items looked more appetizing.  All the items in it were outstanding, except for the crab.  Tasted like the poor thing spent its whole life in a fishbowl.\n\nWe've also been here for lunch and passed the crab soup in favor of seafood won ton and Mongolian Beef.  The soup came in a bowl big enough to feed 3 or 4 people, and the beef was served on crispy glass noodles.  I honestly couldn't tell you which was better.\n\nIn summary, it's a lot of delicious food for not a whole lot of money.  I just don't get why they're always trying to push the crab on you.", "author": "John H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-01-15", "description": "At this point in my life I need a lot of Kirin.  This is the best Chinese currently in the City.  Please do not take this statement lightly, I am Chinese and have eaten a lot of Chinese and will continue to do so.  If you have similar tastes in food then you will most definitely agree with me.\n\nHands down they have the BEST Salt&Pepper Spareribs I've ever had.  Lean (a lot Chinese Restaurants spareribs have a lot of fat), salty, garlicky, mildly spicy, deep fried goodness... these spareribs practically melt in your mouth.  If you hate everything else on the menu but love the spareribs as I do then Kirin will be worth it.\n\nSomeone else mentioned the Fish Salad which is very good.  The fish always seems fresh, tender, and the salad adds a refreshing sweet, mildly pickled flavor which makes this a great starter.\n\nClams with garlic.  Simple yet delicious.  A platter of clams is served with little mounds of garlic and green onions in the shell... I'm sure there are some other ingredients but I'm not sure what they are, it's good.\n\nI always order pea sprouts whenever I eat Chinese b/c it just has to be that way.  Remember, if there are tons of Chinese people eating at the Chinese restaurant then you probably want to give it a try.  It gets a little packed and they close at 9.  I actually went there with a large party at 8:50 and they served us without any issues.", "author": "Micah W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-03", "description": "Their chinese dishes were good, nicely decorated and just like any other GOOD chinese restaurant.  What makes this place unique and good is their Stuffed Chicken dish.  I have never eaten that before and it was delicious!  They have got to market that dish because I don't know any other restaurant that can make such a dish an art form!", "author": "Joseph C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-05-14", "description": "Kirin is a solid place to get Cantonese cuisine.  Don't go there if you are looking for \"spicy\" because most Cantonese dishes are more subtle.\n\nWe go there fairly often, whether for large group banquets or just two of us.  Henry, the owner, usually greets you in front.  The waiters are always friendly, especially Sam who, as another reviewer mentioned, speaks English, Cantonese and Spanish.\n\nThe raw fish salad is a Kirin signature dish which is best to order ahead of time by phone if you really want to make sure they have it.  This is a refreshing dish with crunchy textures from crispy noodles and pickled vegetable pieces.\n\nYesterday my wife and son and I had lunch at Kirin.  We ordered the West Lake Beef soup, salt and pepper squid, bitter melon with beef in black bean sauce and Chinese long bean minced with ground pork and mushrooms.  \n\nThe soup is a favorite of my son's.  It has a clear, fresh broth with bits of ground beef and egg whites.  A real comfort food dish.  \n\nKirin's kitchen makes a tasty salt and pepper squid.  Eat it as soon as it is served while the lightly battered squid is still sizzling hot.  And make sure that with each piece of squid you eat a little of the sliced jalapeno and scallion.  Tasty and a little tangy!\n\nIf you have never tried Chinese bitter melon, check it out.  Yes the melon is bitter --but that's OK -- it's not TOO bitter!  And it is a classic Cantonese taste, especially with the black bean sauce.  Kirin also serves the same dish with frog legs instead of beef.  Also very tasty.\n\nMost caucasians probably would overlook the Chinese long bean with mushrooms and pork.  But my Chinese wife spotted it long ago and now it is a favorite of mine.  The beans are cut into pieces about half an inch long and \"chowed\" (stir fried) with the other ingredients.    This bean has a nutty flavor and the texture of the dish is crunchy.\n\nOverall, Kirin is one of most reliable Cantonese restaurants in the Richmond District.  Its menu is vast.  So if you want some advice, ask Henry or Sam for something unusual that you might have overlooked.  There are also the daily \"wo choy\" specials which are often written only in Chinese on the wall.  Ask about those too.  I guarantee  that you will NOT find the usual dishes that non-Chinese people order.\n\nPrices at Kirin are very reasonable. A great place to take out-of-town visitors for a highly varied and tasty meal!  And it's OK to bring your own wine.  The waiters will open it for you and serve in the proper glasses.", "author": "Rich S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-06-30", "description": "They use fresh mushrooms for their black mushrooms and mustard green dish. It's definitely one of the best i've ever had. If you like mushrooms, you've GOT to try the dish here. \n\nPersonally I feel the chicken stuffed with sticky rice is a little overrated. I mean it's good, but wheres the chicken meat? I don't think the layer of chicken skin covering the rice and its presentation as a whole chicken is enough for me to separate it from just regular old sticky rice.", "author": "Will T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-08-19", "description": "I've been here twice with my family to celebrate birthdays. It's one of those pricey places where you can really taste the quality of what you're paying for. \n\nFor the appetizer, we always order this raw fish salad. It's a little sweet and comes with a variation of raw fish, peanuts, and those crispy things. We also order this thing that comes out looking like a whole chicken....but it is actually stuffed with sticky rice. it's so unique...but really good. The lobster was also really meaty...unlike some places that just give you nothing but shells. Even their sliced beef with vegetables was amazing...it was really soft and tender. \n\nThe waiter is really nice to us. He's always helping us taking pictures and cracking jokes with us. Parking on Geary is a little tough too...but it's worth it!", "author": "Allan M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-07-22", "description": "I encouraged my brother to have his daughter's 1 yr bday party gathering here cus of all the positive reviews on Yelp...and the fact that I was also tired of buffets and Moonstar.  This was a gamble since I had never been here before and trusting the reviews of fellow foodies.  He had never tried it before either but decided to go for it.\n\nIn short, IT TURNED OUT FANTASTIC!  The staff was very accommodating the entire evening and the food was every bit as good as other Yelpers have said it was.  The portions were pretty big too!  We got there early to set up balloons and have the cake put in their fridge.  Since we reserved tables, they said it was also ok to bring our own 2 liter soft drinks, etc.  \n\nThe Rainbow Raw Fish Salad was our first course and it impressed my table and the people at surrounding tables as well.  The lemon chicken was very tender...better than I had had in years.  The steamed fish was very fresh and also received compliments all around (our server de-boned it and reassembled the fish afterwards).  The lobster tasted good as well as other dishes.  The squab (raised pigeon or quail...who the hell knows) was VERY tender and probably the best I had ever tasted....and Ive eaten that dish A LOT.\n\nThe only dish we had a problem with was their soup (imitation shark fin I think or something that looked like it).  It was bland/watery and the servers didn't bring out the red vinegar for it which we had to ask for.\n\nOther than that, everything was great.\n\nThanks fellow Yelpers for providing a great location for my niece's bday party!", "author": "Gilbert C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-12-04", "description": "I came here for a family dinner, but when three of us ended up having to go to the hospital for food poisoning, I think i won't be returning here.  I used to think this was an ok place, but certainly not worth the health risks.  Very unsanitary!", "author": "marcus h."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-09-14", "description": "We order over 6 different dishes and all of them were really really good. This the place to go if you like Chinese food.", "author": "Anthony D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-03-22", "description": "Came here on my own, which was probably my first mistake.  This is not a place you come to as a single diner, this is a place you come to with 10 friends.  Service was fine, but the beef stew I had was a little too chewy.  Actually, a lot too chewy.  This was the cheapest beef cut they found, and not much was done to improve the fact the cut was so tough.\n\nNext time I'll come with a bunch of people, and I won't get the beef stew.", "author": "Eric M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-07-16", "description": "Because I live on the East Coast, I've only been to this Asian fusion restaurant once; however, I have to say that it was seriously one of the most memorable meals of my lifetime.\n\nWe went for my sister-in-law's wedding rehearsal dinner, and ordered an array of seafood dishes. One by one the dishes came out, all piping hot, tasty, and lacking that usual Chinese food grease that weighs you down for the next 24 hours. It was good food that you just knew wa good for you too. Not one thing we ordered disappointed us in any way. I can only say that about a handful of restaurants I've been to.\n\nThe seared salt and pepper sea scallops is a life-changing dish. It's seriously that good. I've devoted my life to getting back here one day to eat those succulent, sizzling scallops marinated in warm peppery goodness once again.\n\nThe service was top-notch (although they of course knew we were a special party), and the restaurant is decorated in a spare fashion, but it's in a casual yet classy sort of way. The high ceilings really help the whole dining experience. Amazing food, priced as Chinese food should be priced. Highly, highly recommend.", "author": "Chu C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-29", "description": "Six of us came here for Chinese New Year's eve dinner.  We made our reservation on Friday and they were able to accommodate us on a Sunday with an 8pm reservation.  \n\nWe had the following dishes, and it was more than enough for the 6 of us.  The bill was also reasonable at $16/person including tax and tips.  Service was decent and wait time was short.\n\n-Lobster noodles (fabulous - very very fresh noodles and lobster)\n-Crispy chicken, half size (fabulous - very tasty)\n-Honey walnuts with prawn (this was ok - i've had better elsewhere)\n-Chinese broccoli (fabulous - very very tender!)\n-Mushroom w/bok choy (good - a little dried at the caps, but flavor was good)\n-Fish maw w/crab soup (good)\n\nGood solid, Hong Kong style chinese food.", "author": "Mon L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-01-27", "description": "My family has been going here for a long time now, and when I think of Kirin the only thing that pops into my mind is; SOLID. It's just overall solid Chinese food, nothing is outrageously good and the food is never bad, ever. What I do like about Kirin though is that they remember you from the last time, and the portions they give you regardless if they know you or not are enormous. Sure they're enormous because you're ordering family style, but seriously some family style places don't even give you half as much as Kirin does. \n\nTips and Pointers:\n-Everything on the menu is solid, good, chinese food\n-Seating can be a drag because it's always packed (but that's a good thing right?)\n-Parking is horrendous on Geary, but that's to be expected\n-Prices are cheap, dirt cheap\n\n[APPROVED]", "author": "Eric T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-01-23", "description": "I hear a lot of people tell me that this is one of the more quality Chinese restaurants and I guess it's true.  I didn't really believe it before but I've actually come here on numerous occasions and after thinking about a little bit more, they are indeed pretty good.  Seems the food is not as oily as other places.  The service is outstanding for a Chinese restaurant.  All of the waiters really work as a team and you can see them being extremely organized as they do their thing around the dining room.  \n\nThey have a couple of \"Star\" dishes that many people go there for.  The Rainbow Salad with either Raw Fish or Chicken.  A lot of people come here especially for Chinese New Year's Seventh Day Dinner (Everyone's Birthday) for that.  But any other day, it's definitely popular.  \n\nAnd the Winter Melon Soup where they put the soup in a real Wintermelon is also very popular as you can see on a nightly basis if you eat here often.  This is something you need to pre-order in advance though so if you go and want that, make sure to call at least a day in advance....", "author": "Mark W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-01-05", "description": "The mongolian beef here is ok. The last time I came here I asked them if the rice was in the to go bag and they said yes. I got home and it wasn't there. Service is like any chinese restaurant so none but the food is decent.", "author": "Darius A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-11-18", "description": "BEST SPRIMP WON TON SOUP EVER!\n\nMy sister and I were killing time while my car was at Jiffy Lube, which is across the street, and we decided to grab some lunch here. We shared the Won Ton Soup and an order of Broccoli Beef. Our bill was $14 and we had enough left overs for at least one more meal.\n\nThe soup was amazing. There wasn't too much in it. Just prawns, wontons and some onions. The broth had enough flavor that you could have eaten it alone. The broccoli beef was also good, with big pieces of broccoli.\n\nYou can't beat that price or the portion size. The decor is your average Chinese place but I recommend it if you're in the area.", "author": "Jackie G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-12-25", "description": "Food was terrific and Authentic (right down to the full 1/2 fried chicken with head and jelly fish with beef tendon). This is what Chinese food is all about. Incredible value - definitely order the family meal - we ordered the 4 person meal and it was enough food for 6. Ambience was standard for this kind of restaurant.  I will definitely go back and bring out of town guests.", "author": "Ben T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-04-10", "description": "This place is highly overrated.  My friend and I ordered two seafood dishes.  A special crab dinner, and prawns with salt and pepper. Neither were worth eating.  The complimentary soup was nice, but the service was bad.  They didn't offer us water, and then when we asked the waiter he still would not bring any. I also ordered rice which didn't come till half way through our meal.  \n\nI hope you think about going somewhere else next time you want great Chinese.\n\n4/10/09", "author": "Rob S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-06-04", "description": "Really good food, service is good also. Prices are decent. Many of their specialty dishes are on the high range for Chinese food but well worth it. Most of the staff has a pretty good handle on English and the owner is often at the front, taking reservations and seating people. This place gets very busy on most evenings and I would reccomend reservations if you're going around or on a holiday.\r\n\r\nI've been quite a few times for dinner and once for lunch, most everything was really tasty and their portions are a good size. The dish that is ordered by nearly all the tables is the Rainbow Raw Fish Salad or the chicken version of it. It's a dish comprised of pickled ginger, crunchy bean thread noodles, peanuts, thinly shredded cabbage, bean sprouts, green onions and raw fish or chicken. Very nice light flavor and not too crunchy despite the fried noodles. The other dishes that are popular are the salt and pepper chicken wings, sweet pea sprouts with garlic sauce (really yummy and it's the only all veggie dish that is a chef specialty), clams in black bean sauce, crispy fried whole or half chicken, and any of the whole fish dishes. There are many more popular dishes but this is all I can remember at this point. \r\n\r\nThe day's house soup is automatically served with dinner or lunch. It's usually something very Cantonese like watercress in a pork broth, nothing very heavy. And oranges are served with the delivery of the check along with some fortune cookies. They do offer red bean soup or almond jello (I love almond jello!) but I don't recall if that's on the house or if you're charged for selecting either of those two.\r\n\r\nAll in all I can say that meals here are usually very satisfying and never disappointing.", "author": "cyndi L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-01-06", "description": "Can't give it five stars yet, because I haven't eaten there, just take-out.  A lot of the take-out or delivery places in my 'hood, the outer richmond, give you about half as much food as you'd get if you ate there, but not Kirin.  \n\nThey don't deliver, but if you haul your lazy ass over there and have your ride circle the block, it's faster.  The food was ready ten minutes after I ordered it. \n\nMinus one star for the Mandarin beef.  I ended up eating most of Shannon's salt and pepper cod, which was delicious.  And make sure you ask for rice, or you won't get it.\n\nThe flavors are just right, none of that MSG taste or the excessive thickener in the soups like you sometimes get.  Got some in my fridge, pretty much all the time.", "author": "Jimmy C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-01-10", "description": "I wish I could rate the food here, but the service was so rude that we left before being seated.  Two of us arrived on a Saturday for lunch around 12:30pm. All of the tables were full, but there were only a few parties waiting ahead of us.  It took 10 minutes for someone to greet us at the door.  When they saw that we were a party of 2, they scoffed, and said it would be 45 minutes.  Since we had heard good things about the restaurant, we decided to wait.  After about 20 minutes, we asked them for an update, and to our disgust, we found out that they did not even put us on the list and it was going to be at least an hour.  At that point, we decided to leave.  While we were waiting, another party of 4 received similar treatment.\n\nBottom line, do not go there if you have a party of 4 or less.  They will not be interested in your business.", "author": "Stacy N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-28", "description": "My wife and I had a friend in town visiting for a few days, and we decided to try Kirin, I've eaten here before. Salt & pepper pork chops, prawns with snow peas, Mongolian beef, hot and sour soup, some type of combo fried rice. I love all the salt and pepper dishes, especially pork chops, and Kirin's was excellent. Mongolian beef really good, beef was exceptionally tender, and I like the fact that they only used green onions, rather than a mixture of green and yellow onion. There location is far enough out on Geary that parking was close by and easy. The waiters were pleasant to us, we were about the only non-Asian customers present, but were made to feel welcome.........tasty food and I will come back.", "author": "Bob I."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-09-07", "description": "I have been searching for a new restaurant after my favorite chinese restaurant Dragon House closed.  We decided to try Kirin after reading all the great review at Yelp.  \n\nThe service was great but the food was a little pricey and was just ok.   We will probably give them another try before we write them off.", "author": "L C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-06-11", "description": "We had minced beef & egg white soup,  pea sprout with fish, salt and pepper squid and chow mein here.  The soup was so so- the broth didn't have too much flavor.  The pea sprout with fish was excellent!!  The fish was very fresh and the vegetables were done perfectly!  OMG the Salt and pepper squid was SOOOOO crispy and sinfully good!  I couldn't stop popping one in my mouth!   The squid was super fresh, too.  The chow mein was the thick kind and it was just OK.  Overall it was a very pleasant lunch with great service!", "author": "RW G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-05-06", "description": "I'm a big fan of mapo tofu and Kirin serves a mean dish!  Superman likes to get his whole fish.  The service is excellent and each meal comes with the soup of the day and a dessert of your choice.  Free food!  Yes!  I highly recommend giving this place a spin!\n\nMy fortune:\n\"You will make many changes before setting down happily.\"\n\nSuperman's fortune:\n\"Remember the past to help you in the future.\"", "author": "Christine H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-02-12", "description": "We gathered here for our annual family reunion. Here are tips to save you time: drive a compact car if you have one. Parking is sparse. We were fortunate to find a spot off of Geary. I have not tried this, but if parking is impossible, go towards the left of the restaurant, there is a high school there. That would be your next best bet. It was going to be our life saver if we couldn't find anything remotely close. It's only about 4 blocks from the restaurant anyway. Now, getting to the good stuff! The food was great. Here's what you need to order: chicken salad (yeah it sounds trite, but you won't regret it, this place is known for this salad), chicken lettuce cups, seafood soup with fried wontons, chicken wings (you don't regret it! well you might... :), and the tofu dish with the mushrooms. There were tons of other plates that we ordered, but I couldn't try them all because I was so full! The portions are good too.", "author": "Ally W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-03-01", "description": "I've only eaten here for large banquets, which they apparently do a lot of. Everything is good as you'd expect. One specialty is this raw fish salad (I have no idea what it's called) that comes with fried bits and sashimi-esque raw fish that is quite delicious and unusual, but very refreshing. They also do the deep fried chicken stuffed with sticky rice (i.e. with sticky rice instead of meat, inside fried chicken skin) which is definitely worth trying if you don't mind a little grease. A good place for large groups, good prices.", "author": "Mike L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-06-17", "description": "Mediocre Chinese food for above average prices. Dishes were either way too sweet, way too salty, or totally bland. So many other choices in the area, please go elsewhere. I honestly don't know why people come here.", "author": "David L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-05-19", "description": "if your'e visiting sf, this place is a MUST-TRY.  their menu is very extensive. they do everything from peking duck to beef chowfun (dry or wet).  They're good for big or small parties.  \n\nI especially go for their lunch menu.  Only a few places still do a house(complimentary soup aka lai tong) nowadays and this is one of them.  The portions are more than generous - so come hungry!\n\nif you come for dinner don't forget to order the salt and pepper crab!", "author": "Thomas L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-04", "description": "I am a huge fan of Mongolian beef, and it has taken me a few Chinese restaurants but I finally found one that I enjoy and has a good Mongolian beef. Although it is a tad spicy still the best i've gotten, and if you don't like it as spicy as they make it just tell them to tone down on the chili peppers. Another great item here was the Lemon Chicken. At first my gf started eating the chicken without the lemon sauce and was wondering why it wasn't lemony, and thought we had been given the wrong item. Then she noticed the huge container of lemon sauce to pour all over the chicken and it was GLORIOUS, so don't forget the sauce!", "author": "James H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-02-01", "description": "mmm... i remember coming here when this place first opened. the owner used to be a waiter at this other chinese restaurant called Happy Immortal, but it closed down a long time ago. anyways, this waiter grabbed the cooks and opened up this tasty delight known as Kirin.\n\nthe waiters there are great! they are always very welcoming and greets us by name (i'm not sure if it's like that for everyone... we go there semi-often, usually on special occassions).\n\nthere is one waiter there that goes by the name of Sam. not only does he speak chinese and english fluently, but if you are so inclined, you can also order your food in spanish and he'll be there to take your order without any problems. he's also really funny, if that's what you're looking for in a server to enhance your dining experience.\n\ni would have to say that this place is cleaner than most chinese restaurants, without sacrificing the quality of its food. because we all know that (normally), the dirtier the restaurant is, the better the food because they are too busy making good eats to be worried about a clean bathroom and whatnots. this is what makes Kirin so great!", "author": "Nathan J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-06-13", "description": "The service here is truly the best I've seen in the city. I came here for my graduation celebration dinner and we never had to ask the waiters to do anything for us. The food is always amazing to boot.", "author": "Clarissa S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-10-22", "description": "Fried Chicken Wings are the best I have ever had in a chinese restuarant and the best you'll ever have if you try it!!!", "author": "Cathy N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-05-14", "description": "I've been here over a dozen times.  One of my favorite family style Chinese restaurants in the Richmond.  If you have a large family, you'll know how hard it is to get 2-3 tables for 20 to 30 people.  They rarely overbook so our family always get our tables on time.  The service is better than most busy Chinese restaurant.  We usually order the set meal and add three additional dishes.  They serve tradition Chinese food and Americanize Chinese food, so everyone is always happy.  Btw, the Chinese chicken salad from here is one of the best I've ever had.  I do recommend calling to make reservations as they do get very busy during the weekends and holiday.", "author": "hello k."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-10-29", "description": "My friends had been raving about some rainbow salad so we decided it was time to see just how good it really is.  No doubt - it was YUM and so was everything else we ordered!\n\n- Rainbow chicken salad - Very yum!  It's a sweet, tangy salad.  A large was plenty to feed 8 hungry bodies as an appetizer\n- Lettuce wraps - Mmmm.  Chicken and saugage, side hoisin sauce, all in a cool piece of lettuce.  \n- Wintermelon soup - Perfect for the cool night.  Fresh, not too salty, not too bland.  \n- Chicken wings - Oily, yes.  But delicious!  \n- Beef with Vegi - We picked chinese broccoli.  The beef was sweet and tender, very good.\n- Rice Stuffed Chicken - This was a very new dish for me.  It's a fried chicken stuffed with the sticky rice (usually found in a leaf as a dim sum dish).  It was awesome!  \n- Noodles - The restaurant was kind enough to give us a complimentary bowl of noodles.  I'm not sure what type it was.  All it really had were shitake mushrooms and lemon grass.  It was so simple and so good!  \n- Almond Jello - A perfect way to end the evening.  They asked us if we'd like dessert, and we asked for the almond jello thinking it would be charged.  It ended up being on the house, which made it taste even better.  ;)\n\nThe restaurant itself is clean, which is very important to me.  It's a good size, not a small hole in the wall.  Service is great. \n\nI was quite impressed.  It's not often that I could go to yet another Chinese restaurant and try foods I've never tasted.  The bill came out to a $152 with tax and tip.  Not too shabby for 8 people.  \n\nI'll definitely go back.", "author": "Stella K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-02-01", "description": "I was in the neighborhood and decided to give this place a try. What a mistake. While the service was prompt and friendly the food was awful. The sweet and sour shrimp was disappointing at best. The shrimp tasted like they had been frozen for months and were not properly cleaned. They were limp and covered in soggy batter. The vegetable plate was bland and covered in a thick gloss of flavorlessness. The chicken and corn soup was acceptable. There are so many good places to get Chinese food in San Francisco so you best keep walking down Geary and find another.", "author": "Michelle C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-08-29", "description": "I had high expectations coming into this restaurant. After reading reviews saying that there Stuffed Chicken with Sweet Rice is the dish of choice i decided to bring my sister and grandma to give it try. After dining i have to say i was greatly disappointed. We ordered the Stuffed Chicken, Steamed Catfish, and a Ong-Choy. The stuffed chicken was not what i expected...the skin of the chicken was suppose to be crispy, but instead it was very chewy with a slight crunch. I've only had this dish a few times in other restaurants, and i remember it having much more chicken meat, but for Kirin, it came with an extremely thin layer of meat (almost like if your lucky you'll get a piece with a bit of chicken, otherwise it is just skin), the chewy skin, and the stuffed rice (which was not bad)...but for $33 this stuffed chicken to me was just not worth it. I understand it might have required a lot of work to prepare it, but i am greatly disappointed in this dish. \n\nThe catfish and Ong-Choy was okay. The catfish did not taste fresh, i'm not sure if they gave us a dead fish or maybe it was overcooked, but the texture is just not what i expected. The Ong-Choy i would say is probably the best dish we had. However, these too dishes were very greasy, but i can't complain because that's usually how Chinese cooking is in restaurants. \n\nI don't write many reviews on yelp, but with this restaurant having an average 4 star rating, i just have to inform others if they plan to give this place a try. The dishes are really overpriced, so you guys can make the decision. \n\nIf you want better Chinese food i recommend Hong Kong Lounge which is a few blocks down on Geary, i've never been disappointed dining there. So yall can make the decision about dining at Kirin, but for the price, i'd rather you go to Hong Kong Lounge and get much better food.", "author": "Harrison C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-03-12", "description": "chinese new year's banquet, festival like atmosphere where along side us a six-table family association, packed,; now the food: started off with a signature chinese chicken salad done with elan, afterwards; course after course, beautiful, BUT BLAND, a situation I encountered a few years ago ... as my uncle said, could adding some seasoning killed them?  So this is the go-to spot for beautiful bland chinese food and those of us on a low-salt, heart healthy chinese cuisine diet ... for those raised on MSG, avoid like the plague ... for us foodies:  go elsewhere, hi chloe!", "author": "tim y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-03-07", "description": "so i NEVER review chinese restaurants. they're all the same to me, really. on my last trip home, we were having a family dinner here and i must say, i was sort of impressed. the food was pretty good, the most impressive one being the rainbow fish salad. that shit was HUGE! we ordered the cheapest banquet meal plus 2 more dishes and it was more than enough food for 12 people, although we should have remembered there are people that eat like freakin BIRDS in my family. \n\nwhy the 4 stars? i have never been to a chinese place where the service was seriously on top of their game. serving the salad and soup so the entire plate/bowl was empty and it didn't have to be left on the lazy susan. refilling our tea right after we put the lid up. and the most impressive (to my family at least) was at the end of the meal, the waiter actually stacked ALL of our dishes into one huge leaning tower of dishes without even dropping it. \n\nnow i don't voluntarily go to a chinese restuarant by choice. but if my family wanted to eat here again for sunday dinner, i wouldn't be adverse to it like how i am to eating at best panda, oh EXCUSE ME, it's empero taste now on 40th.\n\nbut yeah, kirin, you're alright.", "author": "Melanie C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-04-19", "description": "I went here with my boyfriend and his family for dinner one night! good atmosphere and i really enjoyed the food! the location is pretty easy to find as well. I can't remember what i had, because the family ordered, but it seemed like authentic chinese food to me. Nothing i've ever tasted before, but definitely tasty and not as oily as some other chinese restaurants i've eaten at. This place also seems like a good restaurant for families.", "author": "Kristine C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-02-16", "description": "Kirin is still a solid standby, but the last visit did find that some of our familiar favorites were a bit wanting in flavor and finish. Then finally the denouement long suffering long life noodles were seriously overcooked, funny tasting and  not appealing - to render any kind of noodle unpalatable for my nomnivorous appetite for all things noodley is rather a sad state of things.", "author": "GIR .."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-06-12", "description": "My aunt had her 81st birthday here. Kinda small place with about 20 tables. Decor is non existent other than afew pictures on the wall but you go here for the food. I gotta say the food was excellent here. It was something like a 9 course meal with the most memorable dish the walnut shrimp and the winter melon soup. These two are a must order if you go here. I was stuff for days . Staff was friendly and more than accommadating. Parking could be tough but its tough everywhere in San Francisco.", "author": "Mister J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-02-04", "description": "as a disclaimer, and to set the background tone - i am a bay area ABC, i do love places such as D&A, VIP, ABC, Lucky Fortune, and Golden Gate Dimsum.  if none of these places mean anything to you, then it won't matter.\n\ni do enjoy the chinese chicken salad.  the winter melon soup is also quite good.  the mushrooms are also pretty good.\n\nthe rest is passable on a semi normal basis.  or maybe its just sub passable, but my younger cousins seem to love this place, thus our family keeps coming back.  it's a fairly ABC/safe/friendly type place.  i wouldn't necessarily bring my in-laws here . . . but it is what it is.  decent chinese food for cheap.", "author": "Jason J."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-08-21", "description": "Kirin was a major let-down for me.  I ordered a beef dish, and some chow mein, both of which were overly greasy.  The beef was rubbery and the noodles were tasteless for the most part.  I'm spoiled by New Oceanic in Livermore though, so that definitely skews my review.  Overall though, the food was palatable and decent for across the street from the ol' apartment.", "author": "Corey D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2005-12-25", "description": "Solid Chinese restaurant.  My favorites here include: fried whole flounder with ginger and garlic sauce (I prefer the sauce on the side), sugar pea sprouts with garlic sauce, mandarin spare ribs (but it can be fatty so I have to weed through the pieces to find the meaty ones)...and for some reason, I really enjoy their almond jello for dessert!  Special dishes (like a couple of the ones listed above) can be pricier ($10-30), but the basics are in the $7 range.", "author": "Joyce L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-07-08", "description": "Clean and friendly Chinese restaurant.  Excellent service compared to other Chinese restaurants I have been to.  My family had the $48 dinner for 4.  Not much of a wait for our food.  The flounder over veggies and mandarin ribs were tasty.  Choice of almond jello or sweet red bean soup for dessert.  Their red bean soup had whole red beans and tapoica.  Definitely not watered down!", "author": "Mick S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-09-19", "description": "Good country style restaurant.  The shrimp are sweet, the prices reasonable, and also a good place for clay pots.", "author": "Kapeli M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-01-23", "description": "I've been to these restaurant too many times to remember, so it's about time that i reviewed it.  We're actually coming here for our Chinese New Year dinner and I'm very excited about it.  \n\nOne disclaimer I have is that my parents know the owners and people that work here so they always treat us well.  But all that means at a Chinese restaurant is they don't charge you for drinks.  The service is still the same.  \n\nOne of my favorite Chinese restaurants in San Francisco.  You must get the Raw Fish salad!  It's one of my favorites on the menu.  There's also a sticky rice that's wrapped in a deep fried chicken skin.  Everything else is really good too.  We always order all sorts of stuff and it's always great quality and you don't feel like you ate a lot of grease or msg at the end of the night.  \n\nCome here and you're getting really authentic Chinese food at a reasonable price.", "author": "Scott L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-04-15", "description": "Living down the block I have eaten take out here many times.  My all time favorite is the mongolian beef over rice is a must.  My sisters love the tomato beef chow mein with extra sauce.  Yummers.", "author": "Allison T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-07-14", "description": "We came earlier this year to eat and get together with some friends and ran into another set of friends dining that same evening with their family. The food is decent, they sort of hurry you along.  I would rather eat at K&L or China First if you made me choose because I don't think the food is that memorable.", "author": "Ry T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-09-19", "description": "edit- this is my favorite Chinese restaurant so far. i may be alittle biased because my mom knows most of the workers... but besides that, they make awesome Chinese food! the dishes are never drowning in oil, and they give you big portions to share family style. i also like how there's never that long of a wait. the prices aren't bad either=)\n\n-------------------\nmmm rainbow fish salad... i can eat plate full of this stuff.. minus the peanuts they put in it. but minus one point for bad parking!! i had to park 6 blocks away, which seems especially long at night time and minus one point for putting us in a corner and forgetting to give us our rice! but add a point for the free soup and red bean dessert. yum.=)", "author": "christy w."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-05", "description": "I usually come here with a group of friends. The have 5 tables than can accommodate a party of 10 and 4 that seat 8 so no waiting here. Food and service is consistantly good. I like the clams in black bean sauce, honey walnut prawns, salt and pepper pork chops etc. Everything is pretty good here and reasonably priced. You can choose your dessert usually almond jello or red bean or oranges along with fortune cookies too.", "author": "bo c."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-06", "description": "it is somewhat Asian fusion. Food was filling, lemon chicken was good, desert was a mix of jello and red bean soup, very interesting, have no complaints :D.", "author": "Jon K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-12-25", "description": "Decent little place, not to pricey. A touch greasy but that is forgiveable. There are other places id rather go. but if I want chinese food and dont want to go far its the spot.", "author": "Tony M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-01-29", "description": "I love their tomato beef fried noodles. Not very many places can get it right. Kirin can. Another favorite is the Mongolian beef. I have traditional Chinese food all the time, but still crave these \"Americanized\" things, and this place does not disappoint. Very consistent.", "author": "ann t."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-02-18", "description": "A pretty solid chinese restaurant for authentic cantonese food.  Its funny, a lot of chinese families come here for big gatherings and you notice that everyone here orders basically the same dishes at every table.  Prices are decently priced and you get qualtiy tasty food for what you pay for.  Reason for the 3 stars is that I really didnt have anything here that shot out as really amazing.  But to be clear, I love coming here everytime I do come.  Just nothing really really amazing.  Just a solid chinese rest. you would expect to find in the richmond district.", "author": "Charles C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-05-26", "description": "Decent Chinese food on Geary, and this place usually doesn't get as crowded as some of the other restaurants nearby....", "author": "J K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-08-25", "description": "So I've been to Kirin many many many times over the years because it's my grandma's favorite place to take the family and well...she floats the bill, so enough said.  \nHenry and the rest of the staff are the best when it comes to service in a chinese restaurant.  They're very attentive, exchange your dirty plate in the middle of the meal with a nice clean one, and the food is very good.  That's the combo that will earn 5 stars! \nSome of the fav's that we get are the chicken salad (I know most reviews talk about the raw fish salad, but the chicken one is just as good!), honey walnut prawns, fried chicken wings, chicken stuffed with sticky rice, crispy chicken, peking duck and lobster.   \nI know these are pretty basic staples of a chinese meal, but they do these dishes really well and consistant!\nOne thing that is a minus, but not on the restaurant, is the parking.  If you're not there early, it can be a little tricky finding parking on the weekends.", "author": "Greg C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-08-05", "description": "This place is an off-shoot of the now closed Happy Immortal restaurant in the outer richmond.  \n\nWe come here for lunch all the time and all the food is great, better than most chinese restaurants, but recently some of the dishes were not edible and they realized it and did nothing.", "author": "kenny l."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-06-16", "description": "everything was so so \nnoodles were bland\nchicken stuffed with rice -- where's the chicken? \nand the raw fish salad? too much japanese ginger \n\nall that for $70? too expensive.", "author": "leslie y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-04-11", "description": "living just a few blocks away, this chinese resto makes for a GREAT place for dinner take-out.  a plus of take-out is that they let you order from the lunch special menu. end result: $6.50 for 3 meals' worth of pineapple fried rice. totally continuing my take-out routine at this lil chinese gem. YUM.", "author": "Meg M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-08-09", "description": "YUMMY!  My favorite Chinese Restaurant.  Everytime I visit Kirin, I've got to have the rainbow raw fish salad, this is a signature dish and you can't find it else where.  The spicy deep fried chicken wings is tasty and the batter is not too thick, just perfect.  The deep fried wonton and deep fried squid is also a good one.  There are so many of my favorite dishes , I just can't name it all.  This place does get crowded on the weekends, so reservation is recommended.", "author": "Sam C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-10-10", "description": "The fried won ton soup is a MUST HAVE for me here. I also like their salt and pepper chicken wings. I usually go elsewhere when I want chinese food. I only come here when i'm craving fried won ton soup!", "author": "Karine L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-11-21", "description": "One of the last traditional family Chinese restaurants in San Francisco!  The place to eat on Chinese New Year!  Fish Salad, Tomato Beef Chow Mein (HK style!), just a couple of consistantly delicious dishes!  Enjoy and Gung Hay Fat Choy Everyone!", "author": "Gary L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-03-04", "description": "so i'm giving it three stars and not four or five because although the food is tasty and it is very very tasty (yummm general chicken over white rice)...the service is BLEH. the servers are sorta rude and short with you, so i've eaten there a few times. but i would definitely recommend take out if you can. so food=tasty and very very worth it, service=wack (except for the manager...the guy in the suit..who's the only nice person in there)", "author": "Sandi V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-10-28", "description": "YUM YUM YUM!!!! my lemon chicken was crispy and moist and lemony and delicious! and it came with a huge container of lemon glaze to pour on top...drrrooolllll...and my bf's mongolian beef was tasty and very spicy! egg rolls were huge and yummy too!", "author": "N. M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-03-30", "description": "Kirin is just like chinese home style cooking.  There has not been a dish that I did not enjoy.  They have been very accommodating for my mother-in-law who needs to watch her sodium intake.  The dishes taste the same if you come with just five or eight banquet tables.  The chef is consistent with the flavoring.  Kirin is very clean including the bathroom.   Our favorite dishes are hung tao won-ton, salt/pepper chicken wings, rainbow chicken salad, and assorted clay pots.", "author": "Arlene L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-05-04", "description": "Pretty decent food for the price they charge.  I've been eating at this restaurant (both in house and take out) for about five years, and the food has been fairly consistent in taste and quality - not terribly exciting, but not inedible either.  The portions are fairly big and the prices are reasonable.  Good place to go if you need cheap eats and refuse to eat at McD's or like establishments.", "author": "J H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-05-15", "description": "Back in the late 80s...yes, the 80s, this place was some place special. Now, it's a dump! I assume this place got new owners.The paint is coming off, the wood is rotting, and you get the since the owners don't really care about what it looks like inside, it all seems patched up. Don't even get me started on the bathrooms! Judging from the tables seating 6 or more, they care more about quantity rather than quality. The service almost looked disgusted to see us. Not sure why. The food is just ok. Nothing special in my book. My girlfriend actually got sick after the meal. This after telling them she was allergic to seafood! They might be using the same pots to cook seafood with regular food without cleaning it first! Dangerous for people with food allergies!! It's sad too. We really used to like going there. Not next time, not ever. Farewell Kirin. I liked you better when you took pride in yourself.", "author": "Joshua B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-12-18", "description": "pretty good food. i didnt think chinese restaurants served raw fish but apparently this one did. i thought it was pretty good, but it was a little pricey. another notable dish was the geoclam with vegetables. personally, i love them. many people who do not like exotic foods might not. i would recommend it if you do. overall, i enjoyed my meal at this restaurant.", "author": "Jimmy N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-04", "description": "I'm a bit hard to please when it comes to Chinese food: I don't care for the traditional fare you often see in American Chinese restaurants, like fried rice, won ton soup, and egg rolls. After reading the reviews of the Kirin on yelp, my daughter and I decided to try the place. The menu focuses on Chinese seafood, and if the entrees don't tip you off, look to the back wall where you will see tanks of live fish and lobster.  I wanted a tofu based dish however, so our very helpful waiter told me to try a dish of fried tofu with fresh mushrooms and Chinese broccoli, which I didn't see on the menu. He also recommended a dish of shrimp and scallops with Chinese long beans. Since it was cold outside, we also ordered winter melon soup, which is made from chicken broth and has bits of chopped pork and winter melon, which has a texture like cooked zucchini but is more flavorful. I couldn't resist this savory soup and ended up having two bowls before our main dishes came.  Our opinions were mixed on the latter. The fried tofu with mushrooms and broccoli was delicious, with the broccoli fried just right, not too raw and coarse or overcooked and soggy. The shrimp and scallops with long beans was salty and the beans tough, as if overcooked or picked past their season. The portions were large, and we received rice and tea as part of the meal. We were also offered dessert,  a choice of fruit with almond gelatin squares, or almond cookies. We declined these because we were so stuffed, but what we saw on the trays looked good. For all this food, we spent $35 plus 20 percent tip, as our waiter was exceptionally pleasant and attentive. I would recommend taking the 38 bus on Geary to get here however, as parking is sparse in this neighborhood, especially on a Sunday evening.", "author": "Eleanor T."}
