{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-03", "description": "There are a lot of Filipinos in the SF Bay Area but it's surprisingly hard to find Filipino restaurants inside the SF city limits (you'd have to venture out to Daly City or along the Peninsula).  I passed by this restaurant on my way to the Westfield mall and decided to give it a try. \n\nThe food and smells remind me of my childhood growing up in the Philippines.  They gave me a few samples and I decided to order their beef tapas with rice and egg.  It was a good plate of food - it really took me back to a lot of my meals in childhood that consisted of some meat with plenty of sauce to be soaked up by the white rice.  I also ordered a \"halo halo\", which is Filipino shaved ice dessert typically with some fruit, ice cream, ube and flan.  \n\nThis is a small family restaurant and the prices are very affordable. They also have Filipino soaps on the TV. I was smiling at the end of this meal - I guess nostalgia comes with age. I'll be coming back to order some of their other dishes.  I'd recommend this place for some quick, cheap Filipino bites.", "author": "Andrew S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-10-23", "description": "1 hour 10minutes for take out?\n\nWhen got there she said needed 50 more minutes plus the 20 took to get there. \n\nWould you wait this long for food?", "author": "Kay G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-13", "description": "The Owner:\nManny salamat for continuing the establishment of Tess to Kusina Ni Tess. Manny such a humbled individual with awesome workers. Great conversation in tagalog although you can hear my english accent I can still have a whole conversation.\n\nThe Food:\nThank God theres filipino food in the area of downtown/tl. I have been going here for the last 2-3  years. I just learned they have a different food menu day to day. Also by going on their renewed website KusinaNiTess.com you can see what they will be serving. You have the two main breakfast dishes silogs tocilog/longsilo. Today I had the bistek na bangus (boneless) mmmm sarap & longsilog. One of my favorite dishes is laing & bopis. Theres is plenty of food and dessert to choose from here. My friends said their Kare Kare was hella good too. I am looking forward to get some Kare Kare from here.\n\nFilipinos:\nA1 Treatment & knowledgeable to help you understand what food they cooked. You wont know how it tastes til you try it. Filipino's from all over come here as well as Filipino Artists, Actors & Actresses, from the Philippines & so forth. Holla at a filipino friend so they can tell you whats really good or you can ask me. Follow hashtag or #A1LifestyleSarap\n#sarapcity (Forever)", "author": "Ryan M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-24", "description": "What, no Kare Kare! \"Only on Friday\" say Manny the counter guy and half of the husband-wife duo behind Kusina Ni Tess. I stood there looking sad until he said, \"No problem, try some other things\". After a few spoonfuls of different treats simmering in warming pans, I went with a slightly spicy pork in coconut milk. It was amazing. Prices are reasonable and the food is home cooked like an Ate would make. Nice folks, great food and easy on the wallet pricing. Winner, winner, Philippine dinner!", "author": "Jeremy R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-05", "description": "Was in town for a conference for a few days and was delighted to find a filipino joint right behind my hotel (Hilton).\n\nMy coworkers and I stopped for lunch on a Tuesday. Place had a large variety to select from, and the sweet ladies behind the counter gave out free samples.\n\nWe were specifically looking for bistek, but they didn't have it. The next best thing was a tocilog plate, which was pretty good.  They're generous with the portion and not skimpy on  the meat. They even have turon (which I came back for 2 days in a row). \n\nIt's open early (7 am), but closes at 5 pm. I don't blame them since it's not in the best area.   Inside seating can get a little cramped.  If I find an excuse to come back, I'd order to go and eat in my room.", "author": "Jay Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-28", "description": "I've never had Filipino food before and thought I'd venture out a bit since there's so much diversity in San Francisco. After reading reviews on Yelp, this seemed like the right place to try and it was only like a 2-minute walk from the Hilton Union Square. \n\nWhen I walked in, I was greeted by Manny. Noticing it was my first time here, he kept asking me to try things. I didn't ask to try anything. He was just clearly proud of his food. He definitely has something to be proud of. There wasn't a single thing I tasted that I wouldn't order a full serving of. I ordered a decent amount of food and a bottled water and my bill was only $11, to top it all off. \n\nI'd highly recommend this place and I hope you get to meet Manny when you walk in. Enjoy!", "author": "Alex B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-12", "description": "Great food at reasonable prices. The budget size option was really nice so we could try multiple things.\nSuper friendly staff!", "author": "Melissa C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-12", "description": "Everybody go: Hotel, motel, holiday inn\nYou see, If you're walking down Ellis street better take a friend\nYour boy likes Filipino food what can I say\nPancit n lumpia even Kare-Kare\nWorkin at KNT is Lola and Lolo no need to pout\nKusina Ni Tess is making food with love to stock the house\n..........................................................................................................\nIf you like my reviews...give me a follow.\n\nSuper cool spot in the Ellis as other's have mentioned best to keep your eyes peeled in this neighborhood but that's any big city location right? \n\nBuffet, Chinese Fast food buffet-style set-up. They have a huge menu that lists all of their items for sale but be WARNED not everything is available that day.  I had my heart set on pork sisig which I love ...but it's only available on Tuesday and Friday's (sad face). \n\nSo I went with (from fave to least fave)\nChicken Adobo - Always a safe choice and a Filipino staple. This was delish\nPork Sinigang- Also very tasty and flavorful\nBeef Stew- Was the least fave and was a little too salty for my liking and I probably wouldn't get again and would replace with Pork Sisig! \n\nSuper friendly service. They have a small , medium and large to-go options which range in price from like $7-$15 I wanna say. \n\nThe venue itself is not that big so the start of the line is near the entrance/exit of the restaurant so it makes things kind of cramped near that area. \n\nSuggestion to the owners would be to list what foods are available and not available THAT DAY so people don't get their hopes up. A small touch but it leaves a positive taste in people's eyes.\n\nAll in all, a solid venue for Filipino home style cooking.", "author": "Rod M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-11", "description": "Best Filipino food in this part of San Francisco\nThey have the soul food of Filipino food here it's cooked with care and love the beef tapas or chicken adobo but the have the SECOND best Lumpia in San Francisco that's definitely five stars man delicious food every bite will excite your taste bud an always get the garlic rice if it's not sold out bomb!!!!! I'll post pictures my next trip if I could give them six starts I would!!!!", "author": "Rolin S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-19", "description": "The food is always excellent, and the people are as friendly as they come.  Of course I'll be returning", "author": "Landon S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-04", "description": "I was really hungry on the 4th of July and happened to find this gem by accident. It was very close to the Hilton was only a couple minutes away walking distance. When you walk in you are greeted by very kind Filipino Lola's and you can see the food right before your eyes. I tried the Loginisa and Spam breakfast and it was delicious!! While I was eating I could not believe how kind the owner was offering this homeless man some food. In the city this was the cleanest bathroom I have used too!! Will be back next time I am in town.", "author": "Sara S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-02", "description": "Excellent adobo chicken\nExcellent sinigang\nExcellent picadillo\nExcellent longsilog\nExcellent sinangag \nThanks yelp grubhub", "author": "Charlene C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-10-02", "description": "I was really disappointed in this place. We won't be ordering here anymore.  My coworkers and I got hungry and ordered delivery.  To my surprised when we finally got it. I received only a quarter of the bangus... not even the bottom where it has the most meat but the upper quarter part of the bangus -____-  All of the pictures show a full fish.. I was soo tempted to call and ask for the other half. What a rip off...", "author": "Melanie G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-31", "description": "Yum yum yum yum yum!!!  I crave my mom's home cooking all the time and Kusina Ni Tess totally hits the spot and satisfies my need for some authentic and delicious Filipino food.\n\nIt's not in the best location (borderline Tenderloin) and it's definitely a little hole in the wall kind of spot, but it's well worth the walk to go grab lunch takeout.  I always over order because all the food makes me so happy that I wish I could eat pounds of it.  I always order breakfast for lunch and then order pork adobo to save and eat for dinner.  Longsilog, garlic rice with an extra fried egg, and a side of lumpia.  Extra vinegar on the side please.  I'm drooling while I type this and now need to plan my next visit. \n\nOverall- great food, prices, and people.", "author": "Jessica F."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-09-06", "description": "The food was not hot due to the door outside left open.  My stomach hurt after eating my breakfast meal along with my pork skewer.  I knew I shouldn't have gotten it because the lady ask me if I can wanted it reheated in the microwave.  2 things possibly = left over food from day(s) before or food came from the refrigerator previously cook.  Not cool either way.  Do not eat here if you want quality Filipino food.  I am not sure why it got high remarks???", "author": "Thomas L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-20", "description": "When I first stepped into the restaurant, I was happily greeted by one of the ladies behind the counter. She was so nice. She asked if it was my first time coming here. Since I said yes, she started explaining some of the dishes and gave me tons of samples. Either she was really enthusiastic about what they serve, or she was hoping that I would buy a lot. Either way, I got samples. That really helped in deciding what I wanted to order. \n\nMost of the things I tried were really good, but I stuck to ordering their most popular items, which were the tapsilog and cornsilog. Both were flavorful but not overly salty. Having a bite of the meat with the garlic rice, and egg was mouth-watering combination. Aside from those two dishes, I got an order of the lumpia. Since they were taken out of the freezer, I'm not sure if they were made in house or not, but they were still tasty. They could use a little more meat inside them though. \n\nWhen I was done ordering, the same lady that gave me samples helped me checkout. Continuing on with the good service, she sent me off with my food while addressing me by name. How nice. That kind of service (plus the good food) would be a reason for me to want to come back to this place.", "author": "Lucinda H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-18", "description": "Ive been here a few times, including yesterday where I had the LAING (pronounced lying) which tara leaves and coconut milk , Sinegang , Binaguongan and beefsteak , which were all delicious ! \nMy tummy said thank you and give me more. They have a nice wide selection of food and a couple of desserts.. \nThe service is great, your basic fun friendly Filipino staff .. \nThey were happy to take our money and I was happy to eat their yummy cuisine ! \nIn the words of The Terminator.. \"I'll be back\"", "author": "David S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-08", "description": "Had my first taste of filipino food here and i do not regret it! It's a small hole in the wall place close to union square but its extremely tasty! Has a homey feel to it and i believe its owned by a family, definitely would come back!", "author": "Michelle H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-30", "description": "This place straight up rocks.  Manny, the owner, is incredibly kind and welcoming.  Inside the restaurant it doesn't feel like 2018 in SF.  Can't believe I've never tried this place.  I got the stewed beef lunch special--it was incredibly tasty, filling, and cheap.  Don't be shook to try Kusina Ni Tess...it's awesome.  There's not much else to say. Try this restaurant.  Great food, great people, and a welcomed respite from the neighborhood.", "author": "Kevin O."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-08-17", "description": "We ordered delivery through DoorDash and I have to say it's very disappointing. First of all the food is overpriced, for the portion that they give, it's way overpriced. I ordered Lechon kawali and it's not even crispy like it's supposed to be, not to mention the \"no sauce\" to go with it. I've had better Filipino food that's reasonably priced.", "author": "Ava M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-18", "description": "We found this on yelp while looking for breakfast options. We were craving for home cooked food. This did not fail! \n\nServing size is big with a huge scoop of garlic rice.\nBansilog and all other silogs can satisfy your Filipino food craving.\n\nService is very good. They were very friendly. \n\nWe got a bit scared when we ate at night time around 6:30 - 7 pm as someone was pushing the door to get in when they already closed for further walkins. The street is not so friendly at night. You may want to visit this place while the sun is out.", "author": "Mae N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-04", "description": "Awesome hole in the wall Filipino cuisine.  Food is authentic Filipino food and very freshly made.  Service was 100% and they answered all our questions.  Highly recommend this place!", "author": "Anna K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-29", "description": "Always my go to authentic Filipino restaurant. Cheap and delicious. Very welcoming employees and everyday is different dishes to choose from.", "author": "Kim D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-09", "description": "Probably the most wholesome place I've been to. Manny is literally the SWEETEST and let us try everything before ordering. Everything is freshly cooked and I highly recommend everything haha. Garlic rice is tender and flavorful. The turon is crisp and chewy. The  pork adobo is literally God sent.", "author": "Lauren A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-28", "description": "What I like about this down home Filipino food spot is that they do not put pork in everything... So many Filipino food places put pork in the Pancit, put pork in the Mongo and often pinakbit, and they don't have enough chicken or vegetarian options. There always is something that I can eat here even though I don't eat pork and beef and get my Filipino food fix.", "author": "Louise K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-14", "description": "If you are looked nag for great Filipino food, this is your place.  This no frills restaurant serves AMAZING fare at a reasonable price.  They serve breakfast all day.  Their cornsilog was amazing!  I was going to take a picture, but ended up eating it all, so no pic for now.  Do not let the bare decor discourage you as it is not the prettiest, but the food is amazing and the service is great.", "author": "Sherry H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-24", "description": "Great place, very friendly, family owned. Loved the food would highly recommend for a quick bite in San Francisco.", "author": "Reid D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-06", "description": "Nestled in the heart of downtown San Francisco is a simple yet delicious place for Authentic Filipino food. Dinuguan, Menudo, Lumpia and for dessert Bibingka was all we could fit in for lunch, or we would have ordered more The owners  treated everyone like family as they entered the door. Typical Filipino hospitality", "author": "Lorelli R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-21", "description": "Outstanding food, quick, friendly service and extremely cost effective considering being in the San Francisco downtown area.  Here on business and you can have breakfast quickly and the food was tasty!", "author": "Fred P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-26", "description": "I found this place via Yelp while up in SF on business and wanted to try Filipino food. Yeah, the neighborhood could be considered sketchy, but once I walked in I was immediately greeted by the super friendly man (Manny?) behind the counter. He quickly began to establish rapport with me, asking my name, if I ever had Filipino food, and when I said no, he proudly began to pull out the plastic spoons and patiently offered me samples of his dishes (in order of the most popular). I stopped eating red meat a year ago, but I threw that out the window here. Food was delicious, and complex in flavor for being seemingly simple. The lady also working was attentive and made me feel welcome.", "author": "J M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-02", "description": "I discovered this restaurant by accident while walking towards Glide Memorial Church in downtown San Francisco. As I strolled passed it, a familiar smell of fried Daing Bangus beckoned me to make a 360 towards the restaurant.  It was early in the morning after all and right on time for breakfast.  I ordered Bangselog of course. Who can resist!  I wasn't disappointed with the fried Bangus.  It was served nice and crispy,  perfectly flavored with vinegar, salt, garlic and black pepper.  It complimented the garlic fried rice, fried egg and beef broth that it came with. It was a generous serving that would satisfy a big eater like me.  I will definitely return to Kusina Ni Tess for more delicious home cooked style Filipino delicacies and the awesome hospitality of the restaurant staff.", "author": "Sergy F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-04-02", "description": "TLDR - cheap, quick, homey, hole-in-the-wall Filipino food\n\n4 stars for the service and prices, but the food itself was at best an average 3 stars for me. \n\nThis was my first time having Filipino food so maybe I'm just not a fan of Filipino food in general. I can't pretend I know what good Filipino food tastes like, so I can't vouch for its authenticity. It tastes very homey though, as if I were eating a home cooked meal with my parents. Filipino food seems to be all about heartiness so don't expect to find anything healthy here. Even any sort of vegetables are scarce, with food centering around meat.\n\nFood is ordered a la carte here, cafeteria style. If you're not familiar with Filipino food, you can just point at whatever looks appealing to you behind the glass. I had no idea what anything was, so I ended up pointing and asking what everything was. The lady helping me asked if it was my first time there, and when I said yes, she was kind enough to give me small samples of her favorite dishes to try.\n\nPrices vary depending on the type of protein/dish, averaging about $6 for small, $10 for medium and $13 for large sizes. Rice is $1.25. You can easily get a pretty filling lunch here for less than $10 with a small entree and rice.\n\nI went with 2 small entrees and no rice:\n\n* KARE KARE ($5.50, small)\nPork (knuckle I think?) in a peanut-based broth. The meat was a tad try, and the small size came with only 1 piece. I was expecting the broth to be thicker, but it was pretty thin and light in flavor. Served with fish paste on the side, which added a lot of saltiness, but I actually liked it without the fish paste\n\n* CHICKEN ADOBO ($5.50, small)\nKind of reminded me of a Chinese chicken dish, but much more acidic. A little heavy on the salt. Chicken was fatty with lots of skin and a little on the dry side", "author": "Jessie L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-15", "description": "While walking down Ellis, I immediately stopped because I smelled an ever so familiar smell that I was hardly expecting that morning.  I followed through the open doors, \"Hi iha, what can I get for you?\"\n\nHer words were so comforting.  Feeling this welcomed made this particular breakfast just like home.  Not Dallas home, no.  It was like the home that takes you outside of these streets of Tenderloin and into a place where no hobo can get you.\n\nI received a plate with the perfect heap of garlic fried rice, proportioned for the carb lover that I am.  Three red sticky links tagged along with sweet flowing juices after snapping into their plump casing.  \n\nThey were so round and vivid, as if I could pop them with my blunt fork.  These were not the kind I buy frozen at the Asian market; The ones that surprise me with gristle and an overwhelmingly pork funk.  These are the longanisa that make you want to slip back into a peaceful and satisfying slumber, forgetting that thing you call \"work\".\n\nI love this kind of breakfast.  Sweet and savory meat with an imperfectly perfect fried egg, just like home.  \n\nGrab a piece of suman or bibingka for an afternoon snack.  It will go great with tea, I promise.", "author": "Sharde A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-14", "description": "So I was at the Hilton and wanted a quick bite, and found that Kusina Ni Tess was right across the street!!  I wanted a quick meal, so I went through Eat24, placed an order for pick-up and waited a bit.  I guess I should have looked at the photos, to better understand that it's essentially a steam plate restaurant so it wasn't necessary to do that.   Anyway - when I got there, they didn't receive the Eat24 order, talked about how they don't get the order, but that it would be on Maria's cell phone, etc etc.  Also more importantly, of the 4 things I ordered and paid for, 2 of the items were not available that day - which, again - had I looked, is totally understandable when knowing it's a steam plate / to go type of place.\n\nRather than go through the process of calling Maria and deal with the order, I showed them my receipt, and then I was able to substitute items to make up the same totals.   The ladies in there were super accommodating and helpful (even though I was a bit disappointed that I cldn't have 2 items I had been craving on my walk over).  Luckily I'm a glutton, and love to eat - so there were plenty of other options.  \n\nWhile not filipina myself, I grew up in Asia, and had home cooking at home often.  I ended up with Chicken Adobo, the mung beans stew (mongo), a stewed pork (i think it was binagoongan) ... and taro leaves in coconut milk - all in small sizes - along in with a side of rice.  so so so yummy.  For ME, everything hit the spot and took me 'home' to my childhood.  I was pleasantly surprised at the flavours and quality.  Perhaps it was because I was hungry, perhaps because it was just that good.  Hard to tell.  \n\nNeighbourhood is a bit sketchy - some might not feel 'comfortable' eating in the restaurant, though there is seating.  I took mine to go and ate in my room - and would likely have preferred to do that, simply because my room was more comfortable.\n\nAnyway - worth a shot.  Definitely don't bother ordering online in advance. There will not be a long wait, as it's pretty much ready to serve - and you never know what will still be available at any given time.\n\nEnjoy!", "author": "Leslie R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-10", "description": "This is the best Filipino food I've ever had ! Amazing flavors and the menu changes up every day. Kusinanitess.com . Great service and sweetest staff. The food is so filling and delicious. I love the Bicol Express pork in coconut sauce ! Always reliable for a great meal with the right price ! You have to visit this hidden Gem", "author": "Michael C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-14", "description": "Outstanding breakfast - lumpiasilog - fried egg, garlic fried rice , plus six lumpia (pork egg rolls)! Manila street food , excellent taste & quality. Very near to union square and across the street from the Hilton", "author": "Lisa B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-23", "description": "So amazing. I was here a few years ago and just came back-- both times the people were so friendly and eagerly had me taste almost everything on the menu before ordering. It was all delicious!! And cheap-- two of us overate for under $20 (they even threw in some soup for free).", "author": "Jared E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-20", "description": "Great place to get some Filipino food in SF. I had breakfast here with my wife and the food was very delicious and was served in a very large portion.", "author": "Cyrus C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-10", "description": "This hole-in-the-wall Filipino food eatery at Tenderloin in San Francisco delivers authentic Filipino comfort food. The ambiance is very casual and reminded me of most local eateries in Manila where you just simply point out the dishes you want to the server behind the counter. The cooking style is very familiar, as if it was something that your mom, aunt or grandma cooked for you.\n\nFor as little as $25 for two people, we were able to share pork BBQ, Kare-Kare (peanut butter based oxtail stew), Sinigang na Baboy (tamarind pork soup) and Lechon Kawali (crispy pork belly) with a serving of white rice.\n\nThe staff are genuinely friendly and helpful. This place is ideal for a quick lunch. It is also a great training ground for your non Filipino spouse, especially if you intend to take them with you on your next visit to the Philippines.", "author": "Reggie M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-20", "description": "Just to let everyone know the business has been sold. Do not order anything on line at this time. I ordered online on their own website, paid by credit card and went to pick up. The staff which was kewl told me the business had been sold. I had to pay for a new order. I don't blame the new owners for the web problems. I found their adobo and lumpia to be good and will be returning.", "author": "Frank A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-14", "description": "How many people does it take to remember the name Kusina Ni Tess? Apparently more than two -_- After failed attempts at searching Ni and Kess, we gave up and searched Filipino in order to navigate to this epitome-of-hole-in-the-walls.\n\nThe hole-in-the-wall-ness has pluses and minuses. The ambiance is simple, modest, and cafeteria-like (yes, think prepared food in metal trays over steamers. And plastic trays.), and it's more of a lunch place because they close at 8pm and run out of stuff at the end of the day: only the food on display + desserts are available. (I guess another minus is the difficult name to remember)\n\nThe trade-off is the authenticity. Well.... to be fair my knowledge of Filipino food doesn't extend far beyond the various Filipino items at my school cafeteria and fusion brunch places that include longaniza sausage. However, I trust from my extensive foodie (wannabe) adventures that I have reasonable judgment of legit good food.\n \nThe lady serving us was friendly and I really appreciate all her patience with our n00biness and indecisiveness. It was nice of her to offer us samples of all the entrees (reminded me of ice cream... why can't all restaurants do this).  We got the LAING (taro leaves and spinach in coconut milk) and PORK STEW with vermicelli and melon. Both were good, with a contrast between the creamy indulgent laing and the simple homemade stew. Also, you feel less guilty than my usual guilt-tripping Filipino feast of abodo and lumpia, seeing that laing consists of good honest vegetables--swimming in coconut milk, but veggies nonetheless. We got a sausage as well: pretty tasty but not mind-blowing (not super enthusiastic how they dipped it in oil before serving)\n\nWe also sampled the PANCIT and GROUND PORK--not bad but rather salty so it's one of those things that you taste good in a sample but may be too much if you got an entire entree of it.\n\nThe HALO HALO is a must-get. We've never had it before but it was a delicious mix of flavors and textures, including soft pudding-like flan, chunky ube, starchy beans, crunchy shaved ice, and chewy jelly--makes pearl milk tea seem a little too basic... Frappucinos like something from the Stone Ages. I liked how it wasn't too sweet so made a satisfying and refreshing dessert.\n\nTotal was ~$20 for 2 people, and that rivals food trucks where you most likely have to eat squatting in windy parking lots. KUSINA NI TESS. Cost-effective Asian comfort food at its finest P:", "author": "Edna C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-03", "description": "I mean...what more can I say about this place except DO NOT ORDER THE LONGSILOG, tocilog or skewers. Just because it's soooooo bomb I don't want them to run out", "author": "Anjoleen S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-21", "description": "Very friendly and kind people!!!! I wish there was a place like this in Cleveland, OH! Everything we had was amazingly delicious!!! We stuffed ourselves and left happy!", "author": "Ann G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-13", "description": "Very friendly staff. Food was very good. Girlfriend is Filipina and was impressed as well. We tried an array of foods: Manoksilog, pork sinigang, ?sauteed taro leaves with coconut milk, and sisig. All were good but we both loved the sinigang and taro leaves. Would recommend.", "author": "Daniel H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-22", "description": "Superb smaller, locally owned Filipino restaurant right on the edge of the tenderloin district, directly behind the hilton union square hotel.\n\nParking? Nope. The hilton across the street has a sizable garage however, and there is a cheaper city owned garage about a block away. Can't really recommend street parking in the tenderloin. It seems safe enough, but the surrounding neighborhood is not for the unwary.\n\nThere is inside seating for a dozen or so people with the usual table/chair combos. The tables are covered with a plastic overlay over the table cloth for easy cleaning. There is a television which is dedicated to Filipino programming.\n\nThis is a smaller ma and pop place. There is a menu you can order off of, and past peak hours some items like lumpia are made when ordered, otherwise it's cafeteria style. That is to say the food is prepared and kept heated in a counter so those of you not familiar with Filipino cuisine (tip: you can never go wrong with Adobo.) can look at what you want prior to saying \"I want two plates of that! No the other one! What's that called? Yeah looks good. What does it come with?\" and so on. There is a soda fountain and a cooler for bottle/canned drinks (not necessarily soda). They have a filling and cheap breakfast-a rice, egg, and meat combo will be eight bucks or so. Ten if you get tea or coffee and/or a sweet. The lunch and dinner combos will be a bit more around ten of fifteen dollars for three items and a drink, a little more for non tilapia seafood. this is more of a bargain then just about any place close by.\n\nThere is no table service-you order, pay, and get your food at the counter, but the little old ladies running the place are very sweet.\n\nIt doesn't look like much from the outside, and that block is pretty much covered with urban grit, but don't be fooled. This is a wonderful family style Filipino restaurant.", "author": "Steven W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-03-02", "description": "Went and had my lunch here before flying back to las vegas. \n\nOrdered cornsilog and lechon kawali. \n\nTypical filipino food nothing too special. Just the prices are a little pricy end up paying 19.85 for cornsilog, lechon kawali and calamansi juice.\n\n$9.00 for cornsilog\n$6.50? Idk forgot for small portion of hard lechon kawali\n$2 for calamansi juice \n\nI don't know but the lechon kawali is kinda over priced.", "author": "Kirt V."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-04-07", "description": "If you are willing to pay almost 17.00 just for a 2 item, then go ahead. Even this Filipino food is ok,\n But the price and the portions may make you lose your appetite. It is set up where you just point to what you like, but they will price you for an A la carte. Which wasn't before. His excuse is because the rent in downtown is so high. Well you're in the wrong business if you can't strategize properly and charge your customers correctly.  Remember, almost 17.00 for a 2 item to go. Adobo, vegetables and rice. 17.00.for one person, to go. If you believe in paying this amount for this kind of set up, go ahead. Customers have been conditioned to think that this should be normal nowadays. I don't think so. SKIP THIS ONE. I will just go to the burger fastfood or pizza plaze or some Chinese fast food in downtown where portions are good and price is reasonable. Stay away from this one. Patronizing this would embolden them to continue with their pricey, small portion set up. WALK AWAY.", "author": "Daisy P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-21", "description": "People were friendly and the place was quite nice. Reminds me of those small cateria in the Philippines. Food was good and has the genuine taste of home", "author": "Erika M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-16", "description": "Ordered the LAING (Taro leaves with coconut milk) and the DINIGUAN (pork blood stew) and it was delicious! Boyfriend got the typical LONGSILOG (marinated pork sausage with garlic friend rice and egg), a true diehard and fan-- haha, friends tried the TOCILOG (marinated pork with garlic friend rice and egg) and the PAKSIW NA TAPA (pork leg, knuckles) and the CHICKEN ADOBO (chicken cooked with soy sauce and vinegar). \n\nWe all left super satisfied and bellies full of delicious food! -- May I add, I've been eating Filipino food all my life, and after 28 years, I think I know what \"authentic\" Filipino food taste like.\n\nThe staff is super friendly and once I started speaking Tagalog, she started called me \"iha\" which means little daughter. \n\nDefinitely a hidden gem inside of civic center. A lot of their food is pre-cooked so you can order and be on your way! Highly recommend if you're looking for authentic Filipino food!", "author": "Shela D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-22", "description": "DOES NOT WORK WITH EAT24!! Knowing that, don't discount this place. I walked across from my room at the Hilton and ordered at the counter. I was bummed they didn't have the lumpia, but the lechon hit the spot and the halo halo made up for my bummed feelings on the lumpia. Do not be swayed by the outside appearance. The ladies that work the counter are so sweet and the food is good.", "author": "Amber R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-05-22", "description": "Dining here is similar to eating at a relatives house, and that's not necessarily a good thing.  The TV was playing a Filipino soap opera, there is a crucifix on the wall, and all my peeps were there speaking Tagalog except when it was my turn to order.  I opted to get something not fried, as the pork Chicahronne (though it looked good).  I was looking for something quick to eat as I was on my way to a meeting.\n\nI looked at their items on the counter and ordered a scoop of rice with one BBQ pork kebab at $2.99-that's a deal.  Just when I thought the woman was going to hand me the meal, to my surprise, she walked over to the microwave to heat up my food... just like at a relatives house, literally.  I assumed the food on the counter was heated from underneath.  I assumed wrong. Because my meal was nuked, the rice wasn't as soft and the meat was a little tough. I was a bit disappointed that it wasn't fresh, but for the price I paid I shouldn't expect much.\n\nI will agree with the other reviews that the food is authentic Filipino cuisine and they offer a decent menu selection.  I do is also believe when the food is served fresh without the microwave, it probably tastes really good, as my BBQ kebab had potential.", "author": "Nova P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-18", "description": "At the office we were launching our product in the Philippines and so, to commemorate the occasion, I decided to host a Filipino breakfast. (Breakfast being my favorite culinary experience when I visited Manila a few months ago!) Given that we are in San Francisco, where there's a thriving Filipino community, I figured it wouldn't be very difficult to find a good place. \n\nYelp was obviously quite helpful in my search progress and soon I stumbled upon Kusina Ni Tess, which coincidentally was not too far away from our office...in the Tenderloin. Being the person who needs to try out a place first before sharing it with others, I headed there during my lunch break. The person behind the counter was Maria and as it turns out she is the owner. We got to chat and soon I realized that I wanted to do business with her: we came up with a breakfast menu that would feed 20 people!\n\nOn the day of the Filipino launch I went over to Kusina Ni Tess shortly after they opened...it was only 7:10am. However, the kitchen was already busy with lots of eggs, sweet pork sausages and rice in need of being fried up! Maria greeted me with a warm smile and shortly after I was out the door, into my taxi and off to the breakfast party...\n\nThanks for catering our breakfast, Maria!", "author": "Uli B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-29", "description": "I found this place on accident trying to find dinner.  The restaurant itself has no bells and whistles, just some tables to eat on and a TV playing Filipino shows.  The staff was very friendly explaining what they had to offer as well as what was planned for the next day's menu.  The food was on par with what I would expect from Filipino food...just like I would have eaten at home or at a party.  The prices were affordable as well.  I ordered one main entrée of pork menudo (with white rice), a side of pork lumpia, and a side of lechon kawali.  More than enough food for one person and could have made two meals out of it if I weren't so hungry.\n\nThe only downside is that even though certain dishes are listed on the menu, it is not offered.  Not a deal breaker though.  The dishes are served cafeteria style, so what ever is there is what they have available.  \n\nI would definitely return for the food!", "author": "Joe N."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-07-06", "description": "We saw a line outside this little hole-in-the-wall and the high yelp reviews and decided to try it. \n\nWe had the beef stew and the coconut jackfruit as they ran out of adobo of any sort. Needless to stay we were pretty disappointed. The food was not that tasty (either quality of meat or flavors) and not that cheap (you can find much better food in this city for $20) to make up for the dirty feeling ambiance. On the plus side, everyone was very friendly and the stew was overall okay.", "author": "Amy D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-17", "description": "Spotted this place while walking around the conference rooms across the street at Hilton... quick cafeteria style restaurant with tasty homemade style Filipino food. Found the best chicharrones in SF so far. The ladies behind the counter were very sweet and kind too.", "author": "Quynh I."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-19", "description": "Authentic filipino food, hella big portions, everything made with lots of love. \n\nFavorites: laing, mongo beans, lechon kawali and chicken adobo.", "author": "Javid S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-26", "description": "I just got off my phone and I was talking to my mother. I missed her Filipino cuisines so I went to check this place out. Sure enough I went there and had a superb grab to go meal! \n\nI had double size garlic rice, two red hot dogs (I never knew there's a red kind of hotdogs too), super juicy forced meat (I don't know how it's called something langoneesa?), and of course, my favorite dish after mechado, the popular pork belly! \n\nThough the rice was a little hard like it was refrigerated then heated up in a microwave, and I think the hotdogs were a little undercooked, I can say that this place isn't that bad!\n\nI only spent $19 for the whole meal and I didn't even finish it and probably saving it up for dinner lol", "author": "Kevin S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-24", "description": "Kusina Ni Tess is across the street from the Hilton and the next block over from Parc55. Despite a couple days of going back and forth repeatedly between the two hotels (to attend a conference) I didn't even see the restaurant. It's this tiny hole-in-the-wall that I only noticed while looking out the window at the Hilton during a break between sessions. But, my god, did I love this place so much that I had lunch here 3 times over a 4-day period. This joint is what I desperately needed after traveling and eating meals of anything but Filipino food.\n\nFirst meal: Lechon kawali (with rice). They offered Mang Tomas to go with it, and which I regret not getting. I got very fatty pieces with very little meat. But they served it hot-hot which I liked. Wasn't totally impressed but I decided to return and give them another try.\n\nSecond meal: Deep fried tilapia (with rice). Now, if you don't know how to eat fish with bones, don't get this because you get the whole she-bang (eyes, tail, and all!). Setting that technicality aside, it was, again, served hot-hot and it hit the spot (especially with the soy sauce).\n\nThird meal: Adobo and mechado (with rice). Solid adobo. Mechado not so good, but decent.\n\nThe two ladies that work the register and counter were super patient. I will be back!!!", "author": "Sheryl D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-20", "description": "Definitely a hole in the wall, so make sure you're okay with that (c'mon, quit being a snob!). I took some yelpers advice and ordered and dined in which resulted in what seemed like a bigger portion of food (compared to a friend of ordered to-go). I had the chicken adobo which was a healthy portion enough for two meals; spot on in terms of saltiness, tender, and fattening haha. Also had a pork and egg dish that I don't remember what it was called, but that too was good. I generally recommend getting the medium or large size and saving the leftovers for future meals, as the small serving size seemed pretty small, so you're not getting as much for your dollar. The sweetest auntie serving food here. Would come again.", "author": "Will H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-10", "description": "Awesome authentic Filipino food in a mom and pop restaurant. Cafeteria style ordering bit the food is fresh and tasty. You can get breakfast all day also.", "author": "Ric B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-03-15", "description": "It was my first time here and I had dinuguan which is one of my favorite Filipino dishes. They reheated the dish in microwave; not how I would prefer for a blood dish as the oil and blood separates because of too much heat. They didn't have a combo option so I had to order and pay for each item individually as opposed to getting some discount for a combo. The dinuguan didn't taste great either.\n\nI also had Turon for dessert but it was served cold. They don't have something to keep things warm. I was expecting it would something special in it like Langka or something. But it was just plain banana and not even very ripe one. Not something I would pay for $1.50\n\nAnd worst of all, I vomitted that night. I knew it was their dish because I didn't eat anything else new other that.\n\nIt was not a good experience and I will not go here again.", "author": "Frances D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-28", "description": "EAT-IN DO NOT TAKE OUT IF YOU CAN HELP IT!!!!! The reason I say this is because the portions are easily 1.5x-2x if you eat in house.\n\nNow on to the food. The first the I came. I got small pork adobo, small dinuguan, small lechon. Total was $21. A bit pricey frankly, but the food itself is very good. The adobo and dinuguan is tender and flavorful. The Lechon is deep fried a second time to warm it up, making it very crispy and flavorful. I took it all home and I really wish I stayed at the restaurant to eat it because like I said... portions.\n\nThe second time I came back, I got a medium size of pork adobo and small lechon plus a scoop of rice. $18. I definitely could have gotten a small adobo instead because the medium was HUGE.  The ladies are very generous with the portions when you eat in and its totally worth it.\n\nOverall, the food is very good. Prices could be a bit cheaper. I've been to much cheaper filipino joints but this is the best the city has in this area.", "author": "edward k."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-27", "description": "I use to come here all the time during my lunch break but for the past couple of years, I haven't had the time to go. My colleagues told me that they have really good Filipino breakfast and if you knew me well then you'd know that I can live off that even though that'll literally be the death of me if I ate it every single day! I called ahead and ordered the Tocilog which is a sweet cured pork with garlic rice and eggs. I had to order an extra egg since the meal only came with one egg. The portion for the price, which was $7+ is pretty decent. I can honestly say that they had one of the best breakfast I've ever had! Trust me when I say that's a good thing coming out of me cuz not many places I can say that are good.  \n\nThey're located across the street from Hilton Hotel (garage side) and it's a hole in the wall spot right before you go into the Tenderloin. They have a few tables inside and many times I've shared my table with strangers who are just trying to eat lunch like me. It's basically a cleaner version of a turo turo that are common in the Philippines. Turo turo means the dishes are behind the counter and you point which dish you want to put onto your plate. \n\nEveryone in the area especially us hoteliers frequent here. It has a homey feeling to it and they even have TFC shown on TV. Many non Filipinos come here as well and the staff always makes sure they're well informed on their menu. They'll see me a lot again cuz that breakfast is bomb!", "author": "Candice J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-10", "description": "We really had no complaints about this place. We went in half an hour before they closed and they still had a lot of really tasty food. Good prices and big proportions. I lived in the Philippines and the flavors of the food here were very authentic. Their halo-halo was delicious. Honestly, felt like I stepped into the Philippines. Staff was friendly. If you don't know Filipino food, this place might be a little strange but just ask and they will explain food to you. Masarap! Babalik kami.", "author": "Mary D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-11-07", "description": "Had a hankering for Filipino food. I got the chicken adobo with rice.. I pretty much got rice with adobo sauce. They gave me a huge portion of rice with tiniest 4 pieces of chicken. If I put them all together it would not even make s whole thigh..\n\nThe flavor was good but the portion is definitely not worth the $7.50 I paid.. I could have gone to the Filipino place on 23rd & Mission Kababayan and got three times more food for the same price.. \n\nBE VERY CAREFUL AS WELL!! I FOUND HAIR IN MY FOOD!!! Ewwwwwww\n\nNot a place I would go back to.. The people that worked there were also nice..", "author": "Ayana K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-26", "description": "Finally, as Fil-Am born and grew up in the Philippines, I know exactly how authentic Filipino food would taste like and this is the place for that. It's a tiny place in downtown San Francisco where surprisingly you would find a Filipino restaurant. It's a bit pricey which completely understandable with the cost of rent in San Francisco. This place is definitely a place to eat for Filipinos visiting SF.", "author": "Lance I."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-07-08", "description": "I ordered halo halo and it came to me with neither a flan nor ice cream. I asked the waiter and he said its really like that and it has no ice cream. I thought there was some other special ingredient at first. I looked at yelp and saw the other pictures and when I asked again the person at the counter and she admitted they ran out of ice cream. Its annoying they chose to serve that at all or did not even warn the customer beforehand.", "author": "Ramon F."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-03-02", "description": "I've been coming to this restaurant for years and I absolutely love their food so much, but my view on this restaurant with how they handle their food has completely changed. I ordered a halohalo and while I was enjoying it, I saw a black thing in it and when I moved it, it was a fly. That is not acceptable. It sucks because their customer service and staff is good, but unfortunately this is not.", "author": "Sharali T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-31", "description": "The food here is awesome . Very authentic and has great flavor and spices that make Filipino food great.  I highly recommend visiting when your in town . I drive 80 miles at least o 've a month yo eat here and take some food home too.", "author": "Armando F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-17", "description": "Awesome, hole-in-the wall philipino food served hot, and authentic. Dirt cheap. Friendly service. Highly recommended.", "author": "Chen-Tan L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-04-15", "description": "Sitting in here watching. Filipino soap opera as I eat.  Very interesting.\n\nOKay I have never had Filipino food so please don't judge this review based on that.  I just wanted.n inexpensive interesting lunch near my hotel ((Wyndham Parc55).  This got great reviews so I came on over and am glad I did.\n\n I'd chacterize this as a mom n pop dive.  Similar to a botequim in Brazil if you've ever been.  Walk-up restaurant with counters stools and 6 tables.  Not pristine --  a little worse for the wear.  Noisy -- fryer vent, TV, ice maker or blender, coolers and talking and street noise too.\n\nI had half a pork roll, garlic rice and a cup of soup with pork and greens in it -- I think she said tamarind soup.  It's not on the chalkboard menu..not the English part anyway.\n\nStyrofoam plates,  cheap pasticware, you get the idea.  \n\nI also had a Filipino root beer in a can, bottled by coca cola and called Sarsi.  It's good -- better than American.  Tastes more like sasparilla.\n\nIf you're looking for anything other than a curious dive you might save this for when you are.  I was hoping for a bit nicer atmosphere but still I'm enjoying hanging out.\n\nFood nothing special to me but good.  I bet Filipinos will disagree with me!", "author": "cc r."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-29", "description": "Tried two different dish samples the cashier offered me.  Went with the beef stew and rice, although both were appealing. Also had the lumpia with sweet and sour sauce.\n\n They were really friendly in here and the food was very filling. After a long day of walking, I'm worried how I will waddle home now. Spent $12 for lunch and would come back.", "author": "Genea S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-27", "description": "Had breakfast here- garlic rice, 3 sausages and egg for $7. Never had this type of breakfast before but was tasty. Id like to try take out dinner there. Was clean and ladies working there were nice.", "author": "Nala P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-28", "description": "My husband and I were looking for a place close to our hotel, and something that was relatively cheap. We got their veggie lumpia, their fried milk fish, and their pork lumpia. The fried fish was by far the best, and was absolutely delicious! Everything was fried fresh for us, and the ladies were extremely helpful. Would definitely recommend!", "author": "Kezia L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-03-13", "description": "Incomplete order and the staff that delivered the food just said my name and left. Didn't give me time to check the food.", "author": "Mickey L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-20", "description": "Had Rice with Tusino, Diniguan, a bowl of Soup and a Lemonade= $14.00??\nThe food was FRESHLY MADE, I could always tell. I guess it was worth it!", "author": "Edwin J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-26", "description": "Super authentic Filipino food, quick and easy service.  The garlic rice is to die for.", "author": "Tom Z."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-01-18", "description": "My first time here. I came for Pancit. They only serve it every other day. I came on a day it wasn't being served. Touran was good though.", "author": "Rosalind P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-29", "description": "Everything was flavorful, staff was super friendly! The only thing I didn't care for were the roasted veggies- they had too much fish sauce. Other than that, next time I'm in the Bay I'm going here again for sure!", "author": "Skylar G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-08", "description": "Omg love this place. Came in because I was told by two co workers and the lady that took my order had a nice smile and she was very friendly. The lumpia was awesome and I had this sausage that was sweet and it was very very good and I had white rice. I'll recommend this place any time to people.  They are open till 8'pm and you can take it to go if you want. But the lady that rings you up is nice so tell her I sent you.  Thank you for making my first impression great", "author": "Rodney J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-17", "description": "Kusina Ni Tess has become my SF go-to for Filipino food that tastes home-cooked. I place orders for parties, pot lucks etc as they're close to my office. Their food is reasonably priced and has the right \"Lola's kitchen\" taste. The owner Maria is wonderful and has become a friend in the neighborhood.", "author": "KJ L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-07-28", "description": "Halo halo is not very good.  It tastes like either the ice is bad/old/rust-tasting.  Entrees are ok, nothing like Pinoy joints in Woodside Queens.  Pretty ok if u have no where else to get rice.", "author": "Charles B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-18", "description": "I'm still a regular after all these years. And yes it's still all good. Maybe even better! Personal favorites: fried eggplant, bbq, corned beef, embotido, daing (veggie?). Very nice staff and service.", "author": "Vol T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-09", "description": "Laing (Tarrow leaves stewed in coconut milk) was delicious. Looked like creamed spinach but tasted like thai curry. Also had delicious pork skewers. The menu shifts daily.\n\nQuick, filling, and everyone was so nice.\n\nI'll be back.", "author": "Katie A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-30", "description": "A bit expensive, but the food is really good. My favorites are the dinuguan and the Laing. Can't go wrong with those two. \n\nPlus, the ladies serving are very helpful and friendly. :)", "author": "Rae C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-10-19", "description": "I really want to experience more of the cuisine but Filipino restaurants are so scarce in the city. Then my friend brought me to Kusina Ni Tess which turned out to be a great introductory place!\n\nKusina Ni Tess is a hole-in-the-wall. Easily missed place with a few tables. All the food was already cooked and kept hot. Normally I'm not a big fan of steam table food, but this was perfect since I was able to study every item. The man behind the counter patiently described the different items and offered me samples. So nice of him!\n\nGarlic Rice: It's not served during lunch. But they had some leftover from breakfast and asked if we mind. We didn't. It was a bit mushy, but still so good! \n\nPork Picadillo: Ground pork with potatoes, carrots, and peas. Simple yet flavorful. It was almost stew-like with all the liquid. So good with rice! My favorite!\n\nPork Adobo: Big chunks of pork stewed together. I wasn't a big fan of this one since the pork had huge pieces of fat on it and wasn't very tender. \n\nTortang Tolang: Fried eggplant or eggplant omelet. Basically it's a cooked eggplant, flattened then dipped in egg and fried. Definitely taste the freshness of the eggplant. Yum! \n\nLaing: Taro leaves cooked in coconut milk. Very fragrant. Laing usually has pork and shrimp in it, but the one here was vegetarian. Rich and heavy, but still tasty! \n\nI can't really comment on the authenticity or quality since I have no comparison. All I know is we were so satisfied and stuffed and even had leftovers to go. Can't wait to try more! =D", "author": "Marti L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-03", "description": "This place doesn't look like much from the outside but it's so good. The women cooking it up in the kitchen know what their doing and they are super nice too. Aces.", "author": "Micaela M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-06-26", "description": "Now, I do not claim to be an expert in Filipino food, but I can say that I've had Pancit and Lumpia many, many times.  So, while walking to our hotel this weekend, we passed this little place, and I said to my hubby that we needed to remember it.\n\nToday I went back, and it did not disappoint.  I ordered exactly what I knew; Pancit and Lumpia.  As a previous reviewer stated, this is a small place and the food has already been cooked and is kept warm for you to point at what you'd like.   It has a rotating daily menu, and you can see that menu on this website by looking at the pictures they have posted.  Service is friendly, and the patrons are....what do ya know....Filipino.  Always a good sign.  Portions are HUGE and prices are low, my food was hot, not luke warm, and although I'm not Filipino, nor have I ever been to the Philippines to visit, I will easily say this is the best food from that country that I have had thus far.  \n\nLarge portion of Pancit + 6 pork lumpia = $9.77 after tax.\n\nSkip the chains and support the small guys.  Definitely worth a visit.", "author": "Britt B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-20", "description": "So, I'm visiting from Texas and peek out my Hotel window from the Hilton Union Square. I spy, \"Kusina Ni Tess, Hmmmm.\" a-yelping I will go. I've been wanting to find an authentic Filipino restaurant to try and this looks tailor-made.\n\nI navigate the sidewalk denizens without issue and enter at Noon on a Tuesday. One man eating, a few more bopping through for plates to go. Overall not busy at all. The owner/partner, I am guessing, greets me with a friendly smile and surmises from my Not-so-San-Fran look that I may need assistance. She proceeds to let me try several items, all of which were tasty flavor explosions. Try that at Chez PooPoos! Yeah, I didn't think so.\n\nI settled on a Pork w/shrimp sauce(?) stew which was awesomely awesome and Laing (Tarrow leaves stewed in coconut milk). Here is a variant that doesn't look as good as Kusina's did [ http://www.filipino-recipes-lutong-pinoy.com/laing-taro-leaves-stewed-in-coconut-milk.html ] The Liang was reminiscent of very mild turnip greens (I don't really care for turnip greens) with a Filipino coconut flair. It was really very good. I ate everything on my plate in no time.\n\nOthers have called this a Mom-n-Pop offering and I can agree with that. It definitely feels like you are sitting in a family kitchen while they cook around you. Overall, that ambiance sets the table perfectly for the food you are going to eat. I have little experience with authentic Filipino food, but I can tell you with a high degree of certainty that this is it! How? Because it tastes just like the Filipino sister of Southern comfort food cooked all day and overflowing with 5-gallon-buckets-of-love. \n\nI had a hard time getting over the $10 limit for Credit Card charges. Yet I am pleasantly full and the Rock concert of flavor lingers like your favorite Pink Floyd song. Awesome food that is easy on the pocketbook in downtown SF!? Whoa.\n\nOne line review: This is relaxed, honest food that you won't regret. \n\nIf I can be motivated to get dressed early I'll go try their breakfast offerings in the morning. Considering the alternative $18 bowl of fruit you can purchase from the Hotel - I may have to upgrade that \"may\" to an \"I will absolutely go...\"", "author": "Clark H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-22", "description": "Delicious! This was my first time trying Filipino cuisine, and despite some initial hesitation, I was very pleasantly surprised. \n\nLooking for an inexpensive lunch, we found this place near our hotel on Yelp and decided to give it a try based on the reviews. However, staring at the menu outside, we had no idea what to order. Just as we were ready to walk away, a passerby on the street stopped us and said we would love it, and recommended that we get the chicken adobo with a bowl of rice and the pork lumpia. \n\nWith guidance like that, we couldn't turn away and boy am I glad we didn't. The chicken adobo was delicious, the pork lumpia was also quite good. The whole meal cost $14 (with 2 cans of pop!) and was more than enough food for the two of us. The atmosphere of the place is on par with your average take out joint, so don't expect much, but if you're looking for some inexpensive and delicious food, give this place a shot.", "author": "Jesse W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-08", "description": "I found this place because it's close to my work and I was looking for something aside from thai or crappy pizza. The woman who was working the counter was super friendly and helpful since I've only had Filipino food a couple of times before. \n\nThe food appeared fresh and it was absolutely delicious: perfectly seasoned and something a little different for my palette. I also appreciate how straight forward the dining experience was: order your dishes to go or to eat in and it's ready.", "author": "Greg Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-14", "description": "As I've stated in other reviews, when in SF, I run to Asian eateries because finding such in Miami can be an exercise in frustration. During a recent stay, I was excited to discover how close my hotel was to a Filipino restaurant. I used to eat Filipino food on a pretty regular basis when I lived in Chicago. Since moving south, I hadn't had any. Any. It had been much too long.\n\nWalking in to KNT, there's not a whole lot to look at. It's a small eatery with a cafeteria-style line on one side, cooler on another, TV playing Filipino soap operas (excellent), and a few tables. This is the sort of joint where you breeze in, breeze out and chow down elsewhere. Since I was by myself, it wasn't an issue getting a table. If you have more than you, yourself and... you (?), however, I'd suggest taking the food to go. You'll be cramped. But you'll also be very satisfied.\n\nBehind the line is your new favorite tito, Manny. He truly is the man. Fun, nice, welcoming, and mean on the grill, he'll gladly show you what's going on food-wise. Realizing that this wasn't my first time at the rodeo, we got down to the business of making me fatter. Having not had some of my favorite food in close to a year and a half, I attacked the menu: longanisa, tocino, garlic rice, pancit, and lumpia. I couldn't stop myself. Manny was pleased that not only did I know the cuisine, I came here to do some damage. It's all about respect. Since I, typically, ate my food with a cold San Miguel, I was at a bit of a loss when it came to choosing a non-alcoholic beverage to pair with my grub. Manny hooked me up. He pointed me in the direction of Sarsi. How had I not had Sarsi before? The coloring of the can reminded me of Pepsi but the taste was closer to a birch beer. It was delicious. I'm a new fan. I need more.\n\nWith this trip's meal sending me into a food coma, I knew good things were to come. If in the area for lunch, stop in, say 'what's up' to Manny and treat yourself to some affordable and delicious Filipino fare. Whether you're a n00b or a vet, I'm sure that you'll enjoy what you eat (here's a clue: make sure that pork is part of the meal).", "author": "Johnny T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-16", "description": "I had the pork adobo with rice. Lots of flavor packed into this dish, very good. Lady serving food was very nice and let me try samples. Reasonable prices.", "author": "Joe H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-19", "description": "Really good food. I've been craving Filipino food for a while and was glad I came here. It is kalenderia style with some short order. I was really pleased with selection of foods. I got sinigang pork and was transported back to the Philippines. It wasn't too sour. I also ordered the Laing was happy with that. My wife got chicken adobo which was tasty as well. Got turon or fried banana. Was pleased with it especially since they added jackfruit in it. Would come back again.", "author": "Max W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-28", "description": "It's a hole in the wall and I usually do take out. My favorite Filipino food in SF. Keep in mind I said SF, everyone always says, Daily City but I'm not in Daily City, I'm in SF. There is a daily menu and I try and go when they're serving afritada. The turon and halo-halo so good and great portions compared to other Filipino restaurants. I grew up in a town that has a military base nearby and this white girl was introduced to every Filipino dish and yes I do eat dinugaun and they have it here. SF is lacking with Filipino food and I'm so happy I can stop bugging my Aunties to make me food.", "author": "Sarah T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-11-27", "description": "Most the food is good got the Longansilog and Tosilog egg was cooked well.  The Garlic fried rice like others have said tasted stale.  Way to hard and dry.  Should have just gotten steam rice instead with the silogs.  Also got my delivery order wrong gave me pork adobo instead of what I ordered chicken adobo.  Would eat here again with a few adjustments on what to order.", "author": "Jay H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-05", "description": "Great filipino cuisine. Simple and delicious! I come and pick up breakfast or lunch here often. Friendly staff", "author": "Maryanne H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-06", "description": "Stayed at a hotel nearby for a conference. Ended up eating here three times. Twice for breakfast. \n\nThe food is very authentic buffet style. For dinner I have had the menudo and the bistek. I came in too late and they were out of chicken adobo.\n\nFor breakfast I have had the tosino and the longanisa combos. They gave me a sample of the adobo squid and I wish I weren't heading home tonight or I would be back for that. It tasted delicious.", "author": "gabriel o."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-12-13", "description": "I was dragged in here many moons ago ...the neighborhood made me feel mildly unsafe...but also told me that I was probably going to eat something good.  And oh yeah..the garlic rice and laing hit the spot and i was a convert!  Having eaten many things on the menu, I have to say the laing (taro leaves cooked on coconut milk) and adobo are my favorite.  The adobo is just a perfect amalgamation of soy sauce, ginger, hint of garlic and the coconut milk just tempers all the spice and works fabulously with the sticky rice served with it.  Add the vegetal and delicious quality of laing and its a fabulous lunch!\n\nOh a word of caution : don't try to go there too much later than 3:30 or so,  I have found them running out of food and if you want the full experience, get there for lunch, preferably with 6-7 people and order a bunch of stuff and eat it all!!!", "author": "Sunay P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-15", "description": "Glad to know a classic style Filipino restaurant exists downtown. Authentically prepared without the fusion hippy crap. Good Filipino soul food. \n\nSinagang pork was tasty but could be more sour but I like everything extra sour. Probably suits most people's palate. Nice, simple, comforting food.  Decent portion and reasonably priced. I really appreciate they left the soft bones in, just like mama prepares it.", "author": "Glenn A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-28", "description": "I've been to Kusina only about three times because I'm almost never in that neighborhood lunchtime.  But it is a wonderful place.  It's inexpensive, crowded, and crudely furnished, but a place for a wonderful lunch experience.  It has two properties I value in an inexpensive restaurant, and which are necessary to make such a place a winner:  Each dish is just a little bit more interesting/exciting than the generic standard for that ethnic dish; and the owner/manager/employees really really care that you ENJOY your meal.  They take the time to explain dishes at the counter, and to give samples.  And they are genuinely nice people!\n\nA few years ago while attending a tech conference in the hotel across the street, my CEO asked for recommendation were to take a couple other high-tech executives.  I explained the nature of the place (styrofoam, linoleum, plastic, just a crowded hole in the wall) but that the food was exciting.  Later I saw them all there, and they were thrilled with the meal.  These were bigwigs with expense accounts who could have gone to a $$$ place rather than a $ place, but they were happy.\n\nThat the owner really CARES that you enjoy your meal is the most important quality of a fine restaurant.  Everything else taught at Cordon bleu or CIA is just technique.", "author": "Steven H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-26", "description": "The fam wanted Filipino food, so I yelped the closet thing to Union Square and found this. The area is a little sketch, street parking only, and place is pretty hole-in-the-wall-ish. My dad is a hard man to please, but holy shit, after we started eating, he was content.\n\nThe food here is pretty legit to homecooking. Good turon, laing (sp?) and by request, they will make fried adobo. Yes, I said it, FRIED adobo.\n\nBoo on them being out of sinigang when we went on a cold and rainy Saturday. And their lumpia isn't handmade. Also, cash only. But it's definitely still worth a visit for some legit food.", "author": "Kris I."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-08", "description": "I returned to Kusina ni Tess last week while I was in town for a conference. Love the food, love the people who cook it! Kusina ni Tess is in an iffy part of town. Sometimes homeless people walk in to beg and the cooks give them a large helping of rice and one of the dishes. So this place is definitely for people who don't care about that. Their food is fresher than food at the Inay restaurant at the Metreon.", "author": "Nat V."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-06-28", "description": "So, here's the thing: Kusina Ni Tess is, technically, open unitl 6:30.  Most of the time.  Maybe.  \n\nBut if you come there at 5:15, the only food available will be a handful of leftover items from lunch, in steam trays.  And no, they won't make anything for you off the menu.  Do NOT attempt to go here for dinner.\n\nI suppose they stay open until 6:30 to sell lumpia; it's certainly not to serve other food.  The place is probably better for lunch.", "author": "Josh B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-06-29", "description": "Place is not in the best or near best area...  I'd say barely decent area.  Never got to taste the food because we Arrived at 7:45am to find the doors locked and the cook inside just ignored us.  Ohh yeah the place is supposed to be open at 7am.  I couldn't be bothered to go back.", "author": "G M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-11", "description": "For $5, you can get a heaping pile of rice with a little tublet of adobo, which comes in chicken, beef, or pork forms. Pork adobo was pretty good with the fatty chunks of pork just melting into the vinegary sauce. Great with a hit of more vinegar even. Beef stew comes with carrots and potatoes, which would have been nice for some contrast. \n\nWe snagged a fried banana and jackfruit roll for a buck something before leaving. Even cold, the sugar crackled coating was tasty.\n\nMenu doesn't have explanations of what things are, but the ladies behind the counter were super friendly about us hemming and hawing about what to get.", "author": "Kevin L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-21", "description": "Absolutely delicious. The sweet manager let us try just about everything before we made a decision (try the blood stew, it's pretty good!) . I ended up with the pork stew, I felt like the adobo was too salty for my taste. I got it with the garlic rice which was perfectly sticky and aromatic but not too strong. Overall, super tasty, inexpensive, and totally worth the wait", "author": "Katherine M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-15", "description": "Seems like Kusina ni Tess has gotten better over the years since I first tried them. They've gone through a couple of updates/renovations (as far as I've noticed). Their space is bigger now, still a small place, but they have more tables and chairs where people can sit. Their food selection also seems to have expanded. I probably go there once every few months and they always have a good variety: laing, adobo, sinigang, corned beef, fried fish, turon, bibingka, kare kare and some others are usually on rotation. Their pork sinigang is so good! Not greasy, well-flavored and has balanced portions of meat and veggies. They now accept credit cards too but I usually pay with cash.", "author": "HM N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-10", "description": "Seriously all their dishes are tasty. I wish there were more filipino places where I live in the eastcoast. I didn't give it five stars because I have had tastier, but if this is all you know of filipino food, it is pretty amazing. Also, the stars don't represent the ambience, it is def not a place to bring anyone  if you are trying to impress them, but otherwise it's fairly clean, but not spotless. Nonetheless the food is just plain good! A plus is they have breakfast silog! Yummm!", "author": "Elyse C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-01-09", "description": "This is one of the better Filipino restaurants in SF. I came here for lunch with my hapa Filipino friend. The food was good. I like how they have bbq sticks, but they only had a few left. The halo halo dessert didn't taste as good as the one I had at another restaurant. Pretty good overall.", "author": "Jennifer T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-10", "description": "In San Francisco for a meeting.  Was craving for some Filipino food.  It's a small lil family owned place.  Ordered sinigang and embutido for dinner.  Sinigang was actually very good and full of flavor.  Not bad for $13 with a coconut drink.  Ordered fish and pansit to go for the kids.  Will definitely come back for more when I'm in the area again.", "author": "Lorie N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-12-21", "description": "Kusina Ni Tess - \"Tess' Kitchen\" - has a prime location near Union Square.  The place ain't posh by any stretch, it has the size of a broom closet and the feel of a chaotic market, the epitome of hole-in-the-wall restaurant.  Nevertheless, you'll find decent lunch options here.  In a nutshell, this place serves good cafeteria-style filipino fare served by a nice and friendly elderly lady who seems to take pride in her work.  Portions are generous and the menu changes daily.  Plus the flavors are fantastic, without the greasy feeling.\n\nFair warning though, do not take clients here, or anyone you're trying to impress.  But if you're looking for a relatively cheap Filipino food in downtown, it turns out that your only bet is the best bet.  Good flavors, good food.  I'll be back.", "author": "Angel S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-05-31", "description": "For some reason everytime I try a filipino restaurant I get disappointed all the time because the food quality is always not that good, this place is pretty much like a carinderia on which I don't mind but food serving is small, ordered lumpia and it was soggy inside. Ordered bangsilog which is combination of Boneless Fried Milkfish, Garlic rice and Egg And i was so disappointed that my rice and fish was COLD, lucky they run out of fried eggs so i got a fresh fried egg! lol everything was on a warmer so u expect food is hot but NOPE!!!! IT WAS COLD! opsss got carried away there since I like to have my food STEAMING HOT! my bf's first time to eat at a Filipino resto but he likes longanisa but he saw the lady put the longanisa on a deep fryer! Now thats weird lol. pasensya na po!", "author": "Stephanie D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-16", "description": "Loved it. I was so excited to find filipino food down the street from where I was staying at Park 55. It was small and homey with TFC on the TV just like home! Very nice people, they gave my non-filipino companion tasters which was nice. They knew that I knew what was up. Haha. It was definitely comforting.", "author": "G. F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-07", "description": "This was my first trip to San Francisco and my first visit to a Filipino restaurant, and I very much enjoyed both.  I arrived about thirty minutes before closing to dine in and was not feeling in any way rushed.  Although I have enjoyed some success cooking a few Filipino dishes at home and have read up some on the cuisine, I still was unfamiliar with many of the courses being served.  The woman working the counter was very patient and explained to me what each of the dishes were and offered the opportunity to try the dishes before ordering - not many places that I have been to allow you to do that.  It was as if I was a guest at the family table.  I passed on that offer all the same and ordered small portions of the bistek, chicken adobo, and an eggplant omelette.  It was all quite flavorful and a nice dinner and experience on my last night in the Bay Area.\n\nThe venue is not fancy and the cuisine is not decorated with any sort of intricate garnish or served on expensive place settings.  If you're a tourist seeking that kind of experience, do your homework and go somewhere else.  For an experience that is more along the lines of filling your plate with good honest Filipino home cooking in a reasonable yet modest setting, I believe that this probably hits pretty close to the mark.  I plan to return on my next stay in SF.  Enjoy!", "author": "Chris C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-17", "description": "A small restaurant selling very authentic Filipino food.  Customers are mostly Filipino, plus perhaps a few adventurous types.  I was part of a group of adventurous eaters, much to my benefit.\n\nI was here a few months ago, so I can't remember all of what I ate, but the bopis (minced pork heart and carrots in a spicy sauce) is great.  The desserts were good, too.\n\nThis is a tiny place.  If it's busy then there may not be a place to sit.  The decor is minimal, and you'll be eating with plastic utensils on paper plates if that kind of thing matters to you.", "author": "Tim B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-05-31", "description": "This place has been open probably since I was in middle school, maybe even longer than that. I must say, it has changed over the years. I recall there didn't used to be a lot of seating, and it used to look more run-down. Now, they've changed the paint job and offer plenty of more seating. That's always a plus. They also have a big menu board now, and I noticed they've added way more options, including a silog section. Apparently they've changed ownership, which probably accounts for the changes I've seen. The staff now are a lot friendlier than before, which I appreciate. The only negative things I have to say are that the prices of the food went up, and therefore, I don't believe it's worth paying for. I also have to add that the quality of the food isn't that great. My issues were that some of the food seemed undercooked, or lacked flavor overall. I just want a Filipino restaurant in the Tenderloin that offers really scrumptious food, that's all :(", "author": "Rachel M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-09-28", "description": "I want to give more stars but I can't. The food is ok but the lady serving was the sweetest Auntie! You kinda feel like you're at a relatives house where there's files and a fax machine behind you! Super kind hospitality though, I think if you're in the area you could Prob grab something here.", "author": "Marie P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-13", "description": "Geez, who knew finding a good place for lunch in San Francisco would be so difficult? I figured the city would be littered with good eats, but I'm beginning to think they're located everywhere except within walking distance of my workplace in Union Square. Sorry, but spending double-digits for lunch in a mall food court is unacceptable, even if people hail the San Francisco Shopping Centre as the best mall food court ever. (Note to self: Before accepting a job offer, consider salary, benefits, and local dining options. I'm kidding... Maybe.) \n\nKusina Ni Tess, I should've known you would be the answer to my stomach's prayers! I walk by this tiny restaurant on my way to work and the delicious smell of homemade Filipino cuisine wafts through the cold morning air. I turn my head and do a double-take every time as if to check out a hot Filipino guy, but better - hot Filipino fooooood!\n\nI finally had a chance to try Kusina Ni Tess. The food is served a la carte and for a mere $7, I got a white rice and my choice of two sides. The woman there was very nice and offered samples of Filipino dishes I haven't tried before. I went for the chicken adobo and laing (taro root leaves, shrimp, pork, and coconut milk) and both really hit the spot. Portions are large enough to feed two people or a light dinner for yourself latter. Gotta love that!\n\nFour stars for this hole-in-the-wall jewel that won't put a dent in your wallet and feeds you a ton of food just like a typical Filipino mom!\n\n(P.S. Kusina Ni Tess is sandwiched between an adult bookstore/videostore and a liquor store. A perfect storm? I'll let you decide!)", "author": "Sylvia D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-12-11", "description": "I was in SF for a couple of days of training and decided to check out this restaurant since it was close to where I was. Plus I really enjoy Filipino food. \n\nIt's a very small location. There are just a handful of places to sit and it's very narrow. I got the sense that most people ordered their food to go. I on the other hand ate there and because it was so small had to share a table with another customer.\n\nWhile it's probably not the freshest Filipino food being sold I couldn't complain because their price was so cheap. They have their food on burners and sitting out kind of like if you were to go to Panda Express. For the price you can't complain. For just a little over $5.00 I was able to order a plate of rice, chicken adobo and a side of soup.\n\nServers were friendly. Not very talkative but they were also somewhat busy. I would definitely go back but I just wish they had more space.", "author": "Yong Jae C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-06", "description": "Went here a couple of months ago when I was visiting SF. It has that hole in the wall feel. Everything is ordered over a buffet style setting, scooped onto a sad paper plate with some plastic utensils on a plastic tray. So why the 4 star review? You can't deny the food here is GOOD. Plus I hate to admit it, but the atmosphere of this place is on par with most Filipino restaurants I've been to (at least on the East Coast).\n\nCame here for breakfast so of course I had to go for the fried garlic rice. Along with that, got the longanissa and corned beef. I think two eggs were supposed to come with each plate but they didn't have enough for both me and my boyfriend, so we got to pick a different side.\n\nI also got the buko pie (coconut pie), which was a bit too much for us after our hearty meal. But still very yummy.\n\nDefinitely a place you'd want to just grab your food and go. Staff is extremely friendly and all the food was SUPER cheap.\n\nPlease come to New York.", "author": "Noelle B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-11", "description": "I'm not too familiar with Filipino food so I never know what to order when I come here, but the staff are super friendly and will let you try anything beforehand and everything I've gotten so far has been delicious!\n\nBig portions, lots of variety, super fast, super friendly, very affordable. I love the mom-and-pop feel. Only downside is the food doesn't seem overly healthy and is a bit fatty.", "author": "Anthony P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-08-18", "description": "My friend and I walked in for Saturday lunch and immediately were offered free-heaping-spoonful-samples of all the delicious food waiting, no -- yearning to be eaten. The server might have thought we were tourists, but I'm totally okay with that if it means more free-heaping-spoonful-samples. We couldn't decide what to have since everything was so unreasonably delicious, but that was no matter; the kind server said he would give us two of our choices and then we should come back another day to round out our desires.\n\nI don't remember the names of the delicious food, but there was one slightly spicy coconut milk and leafy vegetable curry like dish and some scandalously hearty beef stew. Both of these were delicious on top of some garlic rice, and the whole deal was sealed by a cream cheese filled rice cake.\n\nGo for the food, and bask in the kindness of the staff. They really are so wholesome and nice. How nice? The server made sure we knew that if we chose the cheddar rice cake, it was just a few hours older than the cream cheese rice cake, as he only wanted the best.", "author": "David S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-16", "description": "My previous experiences with Filipino food were brief so I was glad to find this place so close to my office.  Though I'm not normally into steam tables/buffets, it was nice in this case to be able to see all the food.  The staff are super friendly and will describe and let you taste all the dishes before you have to make a decision.  Great vibe and experience for a novice to Filipino food.\n\nThe place is divey.  It's very small and cramped and a bit sweaty.  The prices are decent.  Not super cheap but what I would consider good value.  \n\nAnd the food is pretty good too.  It is a bit oily, like most fast food, but it's fine to eat every once in a while.  And it sure doesn't take away from how good it tastes.  Out of all the dishes I tasted I ended up going with the pork soup, and I wasn't disappointed.  I think one dish is enough for lunch.  You can get two dishes if you're hungry.", "author": "Jean K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-09", "description": "First...GREAT SERVICE!  We were able to taste everything that was available. The cook was very friendly and wanted up to try it all. The blood pork was phenomenal. Don't let the word blood deter you. Try it and you will love it. Tastes like great pork roast. It's also gives you a real big city/mom and pop experience.", "author": "Kyle T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-02-06", "description": "One of the worst Filipino restaurants ever!!!!!!! Very unhygienic and disgusting food.", "author": "Leslie M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-08", "description": "Authentic Filipino food. I'm all for local food, local authentic food. My friends and I ate breakfast here, and we were literally blown away & the food filled us up until the afternoon time. They give you large portions with a decent price ($5-7), I ordered the rice, egg, and the tiny sausage-like meat ($5.50). I wish I would have eaten there for lunch/dinner!", "author": "Angie T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-01-23", "description": "Went here since it's the only filipino resto in the city, was craving for kare-kare but was only available on fridays but the pork paksiw & chicken afritada were good...it's a 'carenderia' or hole in the wall type of place which is alright since I miss that kind of ambience just like back in pinas. overall, it's good.", "author": "Lizzy D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-22", "description": "So i have been looking for a great filipino restaurant in SF, well i found it. While yes i am a gringo i have traveled to the Philippines a few times and this place is the real deal. 10 bucks gets you a huge portion of pork adobo ( amazing ) with rice and lumpia.\nFound my new dig!!  ( Cash Only )", "author": "natasha g."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-03-24", "description": "Michelle Obama should launch her crusade against obesity here!  Enormously huge portions, fat intensive mains and enough white rice to feed a bayan.  What a worthwhile indulgence!!!  I find that I can squeeze 3-4 work lunches from only 2 of the 2-item combination plates.\n\nPork Adobo: Tender pieces of well marinated pork belly with the melt in your mouth fat still attached.  You should encourage your server to pour extra of that not-too-vinegary adobo sauce on the rice since such a combination is amazing.  Would have been nice if a few pieces were fried for texture contrast, but still great as is.\n\nPancit: They used the rice vermicelli noodles as opposed to the canton egg noodles.  Packed with flavor.  Great job on making the vegetables (carrots, onions, string beans) a firm, yet not raw texture, and daintily sliced.\n\nCaldereta: Very tender despite being a stew quality cut of beef.  The carrots are just there.  The potatoes seem a bit undercooked.  I used the onion vinegar sauce to add a little personality to this humble dish.\n\nGiniling na Baboy: Reminds me of Indian/Pakistani keema with the peas and diced veggies (carrots, potatoes, green peppers).  Mixes perfectly with the rice as it can disburse evenly on top of the individual grains.\n\nBanana Spring Roll: We've pretty much had this at any Asian restaurant which strives to offer a dessert besides orange slices.  The spin here is a crunchy sugar coating layer on top of the already fried roll skin.  It works, it's tasty.  The banana inside could stand to be a tad fresher though.", "author": "Adam B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-03-04", "description": "alright! my first filipino food.\n\nwe didn't have a clue, and it showed. the lady at the counter was super helpful describing what they had that day. \n\nwe decided on:\n\nkare-kare\nchicken adobo\na sour-ish soup that i don't remember the name of\n\nsuper. delish.\n\nit was $9 and some change for food + drink for one. my filipino colleagues tell me the price is a little high for the quality and surroundings, but hey. SF, right?\n\ni don't live or work in the neighborhood so i don't see myself going back often, but still nice to check another cuisine off the list.", "author": "Shawn C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-21", "description": "Pork BBQ, Turon, Chicharrone all very good.\nThis place is solid! Super Sarap!\nSarap talaga ag mga binibenta nila dito.", "author": "Geordie E."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-09-21", "description": "Yelp hours indicated that this establishment opens at 7 am.. Hours posted by the door indicates the same thing. Got there at 9 as we have a flight to catch, and they were still closed! Door was partly open and when asked, the \"masungit\" or snooty worker replied \"yes, still closed\" without batting an eyelash. Next time, please adhere to the hours you guys post anywhere. I guess, what can you expect it IS a Filipino establishment.", "author": "Kristine T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-05-18", "description": "I love this place! I had to go to the Philippine Consulate yesterday, and since I was starving after, I was pleased to find out that this Filipino restaurant was just a few minutes away from it.\n\nIt's definitely a Mom & Pop kind of restaurant. Small space, but owners were willing to ask people if they'd be willing to share tables with others, which was very nice of them! I ordered Kare-Kare, and I realized how much I missed it! They definitely cooked an authentic Kare-Kare. I also ordered Turon (fried Plaintain) and that was a great move! I only spent $7.20 including taxes, and with that amount of money, I already had a full meal and a dessert. Definitely worth it!\n\nI'm coming back for sure! In fact, I'm already thinking of coming back today if I'm not too lazy to make the 20-minute walk to the restaurant from my work :)", "author": "Rochelle B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-11-10", "description": "Kusina Ni Tess, my first taste of Filipino food in nearly 20 years, damn near knocked me on my ass. Want the short review? Delicious, flavorful, welcoming, and affordable.\n\nWhen going somewhere new, I always ask an employee what they would recommend. I figure if I don't like something a restaurant is enthusiastic about, I'm probably not going to like the rest of their menu.\n\nWhen I asked this question at Kusina Ni Tess, the gentleman's eyes lit up. You could tell he loved making recommendations. He responded by asking if it was my first time with Filipino food, and after confirming so, said he wanted me to try a couple of things. With around a dozen or so items in their food display, I expected he would have me try one of two of his favorites.\n\n\"Do you like noodles? Try these rice noodles!\" He says while handing me a plastic forkful full of a stir-fried rice noodle, jammed with vegetable goodies.\n\nBefore I even have a chance to swallow, a new fork appears in front of me. \"Here, try this beef steak.\" He gives me a decent sized piece of crazy tender beef steak that was dripping with what I can only assume was liquefied happiness.\n\n\"You must try this pork. I think you will enjoy it.\" Another fork enters the arena, this time with a piece of pork cooked in soy sauce and I'm really not sure what else. \"Damn, should I get that instead of the beef steak?\" I ask myself.\n\n\"I want you to try this.\" Yet again, another fork, this time with a large piece of dark meat. Without asking what it is, I eat it up. He said it was a pork blood stew. At this point, I can't tell if he's really just this enthusiastic about his food or thinking it would be funny to fill me up.\n\n\"I don't want you to make your decision before trying this. Do you like corned-beef hash? This is the Filipino version. I enjoy corned-beef hash, and it was obvious this was a version of it. The biggest differences I noticed were the larger than normal potatoes and the higher than normal amount of... I'm not sure what it was. Grease? Oil? Juice? I really have no idea. It was superb.\n\n \"Have you ever had taro leaves?\" Until that time, my only experience with taro had been taro boba smoothies. I tell him this and that I enjoyed it, but essentially that was a no. At this point, he hands me a fork with a bite of a leafy, creamy, mess. Taro leaves cooked in coconut milk. As I learned from the taro smooth, it's a hard flavor to try to describe. With a texture best compared to creamed spinach, there was most definitely though two very distinct flavors to this dish, both the taro and the coconut, with neither overpowering the other too much.\n\n \"You didn't get to try this one yet\". One more fork, one more hunk of meat. This time, it was another piece of pork, pulled from some stew. It was both sweet and sour, and from what I could tell there were different pieces of fruit mixed into the stock.\n\nI began to order, and started off with the rice noodles. Before I could even choose my next item the wonderfully gracious man says something to another employee and then exclaims. \"The pork chops are done now. Please try this one more thing.\" He turns around, grabs a pork chop and cuts off a piece to hand to me with a pair of tons. Hey, look mom, no fork needed! It was one of, if not, these most tender and flavorful pork chop that I've ever had.\n\nAt this point, I imagine my mind was running wild with options. With a gun to my head, I chose the beef steak to go with my rice noodles. Yup, I ordered the very first two items I tried. Additionally, I ordered some white rice and a bbq chicken kabob. The kabob had been staring me down since I arrived, so that was a must. The beef steak was served in a decent sized plastic container with lots of meat, and a good bit of sauce. I seemed to eat the meat out of the container while pouring the outrageous sauce over my rice. Along with all of this they also gave me a cup of beef broth that I sipped throughout the meal. Meat as a drink? OK! All of this food? Just over $11. \"Git outta town, James!\" I will not, because that's what it cost. An absolute steal.\n\nHeads up, it's cash only. With only 4 or 5 tables (all full when I first entered) you should also be prepared to get your food to go. Still, absolutely worth those minor inconveniences. They obviously love what they are doing and are, with good reason, proud of their food. If you are anywhere in the vicinity of this place, it's a must try.", "author": "James D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-19", "description": "Definitely not a place you would expect to find some good food. I had some of their bbq sticks and they were good. Service was fast. \n\nparking sucks as its on the street and if there is no spot, parking garages are next door.", "author": "Roger A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-01-16", "description": "Very hole in the wall place, the menu was a bit confusing and the food was okay. It was all really oily pork stuff.\n\nGiven the location and setting, I thought that it would be cheaper, which it wasn't when you added on the extra cost of rice and all.", "author": "Adelyn Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-19", "description": "Wonderful little restaurant. I came in not knowing anything about Filipino food, and it was probably pretty clear to the woman behind the counter: she offered samples of three different dishes, and I ended up getting a combo plate of two (the pork adobo and one other whose name escapes me). Great food, friendly people, highly recommended.", "author": "Darius K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-26", "description": "A little gem for Filipino food. A favorite dish was the beef stew over rice, very flavorful and hearty, try at least once.", "author": "N A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-05-15", "description": "First time trying Filipino food here! Stumbled upon this place cause I was wandering around Powell st. Yelped the area for some cheap eats and I came across kusina ni Tess. I shared a platter of rice with beef and pork stew. We also got Lumpia and coconut young pie which was delicious! There were chunks of coconut in the pie and the lumpia was crispy. It's best with sweet and sour sauce. They also have banana ketchup. The pork stew was very flavorful while the beef was tender. All in all it was a great meal. The atmosphere may fell like its a hole in the wall but it was cozy and it made the food feel more authentic like home cooking. Great food for a great price.", "author": "Virginia Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-31", "description": "It's a little hole in the wall place that you'd never find, unless you knew where it was or someone told you about it.  It's a pretty small place with about 4-5 tables.  You need to move if someone needs to squeeze into the back area.\n\nThe food was good.  It's Filipino food.  And it's pretty cheap.\nOh yeah, and they give you A LOT of rice.  But hey, it's Filipino food.   No amount of Filipino food can be had without rice.  But man... that was A LOT of rice!!!  The BBQ skewers were very tasty!!  Just like mom makes.\n\nIf you want cheap Filipino food and don't give a rats a** about ambiance (that is, if cheap Costco tables and TFC blaring on the TV), then go for it!", "author": "Marc E."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-02-23", "description": "Was craving Filipino for awhile due to being exposed to it a few weeks prior to coming to Kusina. And when I Yelped for Filipino cuisine places nearby, this place was like the only option.I don't know if it was my initial experience of Filipino food that was utterly too good or every place makes the food differently or what, but my experience here wasn't great at all.\n\nFirst of all, this place is IN THE CUTS. Walking by on this street, which is rarely, I would've never seen this place without any knowledge beforehand that it existed. The store is really small and offers about 3-4 tables to dine at, each with 4 chairs. The set-up seemed a lot similar to a taqueria; with the glass 1/2 window separating customers from the selections of food and the stoves. \n\nBefore even planning a day to come, I researched Kusina's menu and what foods I wanted to eat. I chose a Tuesday because they would have beef steak and pancit. No sisig whatsoever! :[ So i came on a Tuesday around 1:30-2 with a friend to get my craving satisfied. We walked in and perused the selection of foods that were left. No more beef steak. So sad! :[ It was my main reason for going on a Tuesday but the man did say they'd have it again the next day. Only problem was that I wouldn't be coming back. So we ordered ONE order of pancit to share, took the rest of the pork skewers (5), a small order of rice and 2 sodas. It also came with a cup of soup for each of us. Total? 22$. Woow. That blew me away.  But i guess oh wells. I wanted to try it out and now i know.\n\nThe pork skewers were really delicious, yes, but they were very small! Not worth it for what we paid for them. Our pancit was okay, it was so not what I had expected or wanted. It was not the same as the one i had when i first tried it. The first pancit i ever tried had a lemon-y/lime-y flavor to it... The one at Kusina was like just plain white noodles with some vegies and pieces of meat. The soup was alright and tasted a little like hamburgers. Hah, that's probably why I thought it was alright. It looked like miso soup without the tofu and seaweed.\n\nHonestly, I  would not be coming back unless someone convinces me and does a really good job at it. The quality of the food and dining experience in comparison to the price i paid was so not worth it. If you want to come and experience it for yourself, by all means. Don't let my review stop you from trying it out, this is just my personal experience and opinion of it.", "author": "Michael N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-07-24", "description": "I love these lunch dates with my aunt. \n\nShe's been commuting to SF for as long as I can remember and works downtown.  Imagine my delight when she sent me an email and asked me if I wanted to have lunch with her.\n\nShe was so excited to show me this \"hole in the wall\" Filipino restaurant right across the Hilton (on Mason and Taylor st).  Leave it to my aunt to find a place that won't burn a hole in my pocket either.\n\nWalking in, I felt like I was going into somebody's home.  I was warmly greeted with smiles from the staff behind the counter, even the cook deep-frying the Tilapia turned his head to smile.   The TV is tuned into the ubiquitous (amongst Filipinos anyway) TFC which stands for The Filipino Channel.   There are a couple of tables and stools for those who want to eat in. \n\nThe entrees on the steamer trays look so enticing:  chicken adobo, ginisang upo, lumpia, Dinuguan, etc.  \n\nWe were all smiles as we put in our order:  Dinuguan (the famous chocolate meat you keep hearing about, ain't really chocolate!) , Paksiw na Bangus and rice.  For dessert, we each had the $1 Banana Que.  (banana rolled in brown sugar and fried)\n\nDinuguan is a stew usually cooked with pig's entrails simmered in pork's blood, garlic, chili and vinegar.  But here at Kusina ni Tess, it's made with pork's meat.  A little bit on the fatty side and it could be more spicier. \n\nThe Paksiw na Bangus is made with milkfish, garlic, lots of ginger, bittermelon, and thin slices of eggplant.  I don't recall this dish being traditionally made with bittermelon or eggplant, but I guess, it's a good way to get your veggie for the day. \n\nThe food here is definitely worth a try, and most of the entrees come with rice.  (the lady told us we can have extra rice if we need it) Our meal came to a total of $17 and the servings were enough for two people.  \n\nYou can't beat that price for decent Filipino food.", "author": "Janice C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-26", "description": "When you're craving home cookin', and I mean REALLY crave it, you would go to the ends of the Earth to get what you need. But I was definitely happier to find that I could just go the city to get it. Filipino food is non-existent in Sonoma County, so if you're in the mood the easiest (and best) trek is to get here at Kusina Ni Tess. It's a hole-in-the-wall, mom and pop joint and you feel right at home as you walk in. Tito (as I want to call him) will just ask what you want and have you take a seat to immediately enjoy the heavenly food. We ordered the dinuguan and kaldereta with a side of broth and rice (of course!). We just couldn't get enough! I ended up getting food and snacks to go to curb my craving for the next week. I can't wait to come back!", "author": "Gaile G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-12-23", "description": "This is a tiny, divey spot with a some very good food with big flavor.\n\nAlmost all the food here are prepared and so you can look at all the available items and choose what you'd like to have (Turo-Turo).   I had the Pritong Isda (fried fish - Tilapia) and Laing (taro leaves cooked in a thick and savory coconut milk stew) - everything was great.  The fish did need a bit of saltiness so adding some Patis (fish sauce) made it perfect - it had a nice delicate flavor.  The Laing was fantastic - a favorite dish of mine that I rarely have - it had so much flavor and I can tell that some excellent spices were added to make it taste amazing.  While I wouldn't say it was cheap, it was definitely affordable ($9 for two items and rice).\n\nThe place is very small with only 4 tables (1 table for two and 3 tables for four) so I'd suggest not going during peak lunch time hours unless you are planning to take your meal elsewhere...you can also be very friendly and sit next to a stranger if need be.", "author": "Ken G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-24", "description": "The fact that there's a Filipino restaurant a few blocks from the office makes me happy. I tried the sinigang na baboy and it was delicious, almost as good as my lola would make. The (lunch) price is very affordable, $6. It's no frills establishment and the menu selection is decent.  I look forward to repeat visits!", "author": "John M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-25", "description": "I (James) think the reason why Filipino restaurants have not proliferated like Chinese, Thai or other Asian restaurants is that we Filipinos are very picky when it comes to our native cuisine.  If it doesn't taste as Mom cooked it, then it's not the same.\n\nKusina Ni Tess is as close as it gets to Mom's Filipino home cooking.  Yesterday, I tried the Pancit Bihon & Pork Adobo. Both dishes were delicious.  I definitely will be coming back when I yearn for Filipino food but can't visit Mom.  The owner/cook, Manny, is very friendly and will allow you to sample before you order.\n\nFor what this hole in the wall lacks in decor, it's made up by the flavors of the food and the hospitality of the owner.  You definitely get value for your money.  And for those who say a meal is not meal unless you have white steamed rice, I got a big plate of rice when I ordered the adobo.", "author": "James R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-01", "description": "Good Filipino Food...two scoops of rice and you can choose any 2 items you want for under 9 bucks...looks like they made some changes the place is bigger to accomodate more people...i wouldn't mind coming back to eat at this place again...", "author": "Carlo R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-01", "description": "Great inexpensive Filipino food. Its conveniently located in Union Square rught on Ellis Street. If you love Filipino food and love saving money even more this place is for you. We are staying a block away at parc 55 so it was just around the corner so it was perfect.", "author": "Nadieshda L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-03", "description": "Kusina Ni Tess is the best Filipino restaurant in the Bay Area. The food took me to a trip down the memory lane. The girl behind the counter was genuine, also cracked up a few jokes. If you want to know how food taste like in the Philippines this is exactly the place to go. And don't get me started about the price $. Inexpensive, delicious, and authentic. I'll definitely come back to this place.", "author": "Mabs A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-22", "description": "I was born in the Philippines and now reside in NYC. Went on vacation in SF and found this place right in the middle of downtown next to our hotel. I wish I could go back just for this. Amazing, traditional Filipino food and it's cheap, cheap, cheap!", "author": "Kevin O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-19", "description": "So good! Best Filipino food I've had outside of my best friend's house where her mom made it for us!  I'll be back!!", "author": "Candice B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-08-24", "description": "Over price! Ok sana kung masarap at may quality ung food kaso hindi eh... Too much oily pa! Not recommended better eat at south city filipino restaurants! Better and delicious!!!", "author": "Ryan F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-17", "description": "The food was tasty, nice and slow-cooked. We had the adobo (good), the pork stew (our favourite!), the ginger/chicken soup (a little salty but good), the corned beef (fine, did not stand out) and the mango/coconut dessert (good).\n\nThe person at the counter was really nice -- when we told her it was our first time here, she actually gave us little plastic spoons to try some of the dishes. \n\nPrices for the above + 2 sodas (4-5 dishes) was $29, which is a little more than you may expect for a hole-in-the-wall, but would come here again for a fix!", "author": "Yan K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-05", "description": "The beef stew over rice was just amazing. The sauce was so rich and flavorful. Lumpias were really good 'n' crunchy too. Neat little Tenderloin hole-in-the-wall. No krazies outside the premises. I like the owners, as they smile easily. Sarap indeed!", "author": "Derek N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-17", "description": "This is the place to go when you need a Filipino food fix when in the downtown area. They have nice cooks and great service and the food is really good! It helps that it's the only Filipino restaurant nearby. Prices are good too and they are more than willing to accommodate special requests (i.e. some bulalo soup extra or adobo deep fried). \n\nThe only down side, hence only 4 stars instead of 5, is that it's located on the Tenderloin area.", "author": "Jonathan S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-11-14", "description": "Portions are extremely generous and everything we had was super tasty. Just like my grandfather's beloved home cooking. We sampled corned beef, picadillo, bangus (milkfish), crispy Pata (amazing!!!), chorizo, lumpia, blood stew and garlic fried rice. Every time I visit a city, I look for Filipino food and this was hands down the best so far!  Sweet and friendly staff. Don't let the neighborhood or small size fool you!", "author": "Cee A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-16", "description": "Been there several times and the food is delicious. Difficult parking, but loading zones expire at 1pm weekdays, so plenty of street parking after 1pm. Friendly service and recently remodeled with more tables and chairs. We tend to get several dishes and take the leftovers home.", "author": "Leon L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-02", "description": "I've eaten here twice and was great each time.  It is the most tender pork skewers ever.  They cook small batches of food right in the front so you know its fresh when you order it.  I have also eaten chicken and pork adobo, both saucy and peppery vinegary.  The complimentary broth they give you to start is a little bland and strange but Filipino friends say it tastes just right.  Good choice of veggies each time, I've had the bitter melon and the winter melon.  Prices are great and I covet one of those banana egg rolls but have yet to indulge.", "author": "Maya H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-29", "description": "I live in the Chicago suburbs and there's not a lot of Filipino restaurants. This place it's authentic Filipino food turo turo style. I ordered the caldereta, chicken adobo, lumpia and tocino. Everything was just perfect.", "author": "Patrick T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-14", "description": "Been back several times since my first review and it keeps getting better. Great food, great service and despite the awful neighborhood, a really pleasant environment.", "author": "Quinn S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-08-05", "description": "Let's face it, Filipino food is not for the diet and/or health conscious. After eating it I'm usually left craving salad - and I don't even like salad! That being said, I will excuse the predominance of salt and oil in many of the dishes because the food is so tasty. High cholesterol and hypertension? Bring it on!\n \nI took my mom here for lunch while she was visiting. After a weekend of dining at restaurants such as Wayfare Tavern, Bobo's, Izakaya Sozai, Canteen, and Laurel Court (in the Fairmont hotel), I gotta say that this was one of the better (and definitely cheapest!) meals we had.\n \nThe food itself is worthy of 4 stars, but what brings this unassuming hole-in-the-wall to 5-star status is the incredible service. They were all SOOO nice! Though I'm familiar with a few Filipino dishes by no means am I an expert. In fact, most of their stews and other offerings were foreign to me. Not only was the lady behind the counter extremely patient in describing all the dishes to me, she let me sample most of them! I must've tried at least 5 things before ordering.\n\nWe ended up getting rice with 4 items (dinuguan, chicken adobo, bbq chicken kebab, pork picadillo) and beef broth soup (http://www.yelp.com/biz_photos/s6x7VDb6qZ__HV1TjnWzKQ?select=_UQu0_EkMapVmWaKyhokIA). The portions were generous and we took home plenty of leftovers. All the dishes were incredibly flavourful! My favourite was the well-marinated and very tender BBQ CHICKEN (http://www.yelp.com/biz_photos/s6x7VDb6qZ__HV1TjnWzKQ?select=K6hvMnOPgLoOxCHeDRkSYQ). Another great dish was the CHICKEN ADOBO (http://www.yelp.com/biz_photos/s6x7VDb6qZ__HV1TjnWzKQ?select=V5i46q0uLZkzPKkl8sI13g), which was vinegary with lots of tender chicken. The DINUGUAN, a pork blood stew (http://www.yelp.com/biz_photos/s6x7VDb6qZ__HV1TjnWzKQ?select=qyvbG-mXwjzfVgtzbWGPhQ), had a ton of pork - in fact, it was ALL pork. I actually would've liked to see some snout, ears, and intestines. Flavour-wise it was tasty and vinegary but not the best I've had. The PICADILLO (http://www.yelp.com/biz_photos/s6x7VDb6qZ__HV1TjnWzKQ?select=IpXhx2tf21QPFRQbmVOPGw) was an aromatic stew with ground pork, potatoes, onions, peas, and carrots. \n\nAs you can see, all we ordered was meat. (Vegetables don't exactly come to mind when I think of Filipino food...) While we were eating, the chef prepared a fresh batch of vegetables and offered us some on the house! Free food? SCORE! We got about half a serving of tasty eggplant, pumpkin, green beans, and bitter melon sautéed with shrimp paste (I think, http://www.yelp.com/biz_photos/s6x7VDb6qZ__HV1TjnWzKQ?select=ZgebMZj4ih7ppohwK9mp6Q). Like everything else, this was so flavourful, but definitely not as heavy.\n\nAt the end of our meal I realized I forgot to get some LUMPIAS. Being as stuffed as we already were, I didn't want to get a whole order (of 6) so I got a half order for $1.50 (http://www.yelp.com/biz_photos/s6x7VDb6qZ__HV1TjnWzKQ?select=3UJ0ZkOLaachSKOqamv5xA). These were made to order so they're guaranteed to be hot and crispy.\n\nThey must have seen my mom and me eyeing the BIBINGKA sitting on the counter, because they offered us a free sample of that as well! (http://www.yelp.com/biz_photos/s6x7VDb6qZ__HV1TjnWzKQ?select=USTl04_CDuaRz2rgGG0cRQ) It's a rice flour cake with sliced salted eggs wrapped in banana leaf, which imparted a nice aroma to the cake.\n\nI will definitely be back the next time I'm craving Filipino food, especially since I don't have to go all the way to Daly City! Their menu rotates on a daily basis and some things are only available on certain days, so check before you go! (http://www.yelp.com/biz_photos/s6x7VDb6qZ__HV1TjnWzKQ?select=uRD3L1Hj55rM31R9egyioA)", "author": "Steph L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-21", "description": "Legit food. It was a nice break from BK, McD and diner fare.  The lumpia was great. Wish we got there in time for some lechon kawali.  Our fault :(", "author": "Teresa M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-20", "description": "A hole in the wall and best to get it to-go or bring it to eat elsewhere as they only have 4-5 tables. \n\nI've never had \"real\" filipino food as I would think Jollibee doesn't count. I don't recall the name of any dish but everything was delicious. Seems like a family owned place and they welcome you to sample any dish before comitting to it. \n\nThey have those skinny fried pork lumpia but you'll have to order it.", "author": "Maggie C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-13", "description": "is in my neigborehood, i love filipino food and i just found the right place, i have enjoy so far the stuffed fish, lumpias, adobo, cornbeef , embutido, and my favorit babingka. If you want enjoy filipino food here in downtown visit Kusina ni tess, the people that work is very friendly and of course you will enjoy the food. I saw a review that mention they dont take credit card but they do, minimum charge for it is $10.", "author": "Manfredo R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-12", "description": "This was my first Filipino restaurant.  I enjoyed it and will go back.  The staff was very friendly food was tasty and well prepared.  Quiet littlee stop.", "author": "Ben C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-11", "description": "I've never had a chance to eat Filipino food, so this is first time.\n\nThe place is kinda dinky, but that never really puts me off.  I asked the guy behind the counter for a recommendation and I was a little worried he would recommend me something super expensive (I worry about that EVERYWHERE, so I'm not trying to be racist or something), but he let me try this beef steak thing (I think that's what he said it was).  I thought it tasted great, asked him the price and was surprised it would only be $5.50.  Got that, along with an order of lumpia for $9.22.  Not too bad.\n\nSat down with the beef and rice first as I waited for the lumpia.  The sauce was pretty good, if a little oily.  The beef tasted great, but some of the pieces had large chunks of fat on them.  I just left those parts off, and enjoyed the rest.  So so good.  I devoured almost half my plate before my lumpia came in.  They weren't fresh (saw them take them out of a freezer), but they were still yummy.  Probably one of the best $10 I ever spent.....\n\nDon't let the neighborhood or the setting put you off.  It's really good, and it's GREAT bang for the buck.  I'll definitely come here more often to try the other menu items that were unknown to me :).", "author": "Filmer Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-06-22", "description": "I love this spot. Little tuck a way spot with great phillipine cuisine. I love the breakfeast there. Very reasonably priced as well. Can't wait to go back.", "author": "John G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-06-18", "description": "I'll make this quick and delicious. Just like their Crispy Pata. \n\nMy BF is a HUGE cripsy pata fan, and when he found this place, he nearly died and went to heaven. Right near his work! \n\nThe portion was plentiful, hot and juicy and only $12! Can't beat that. It was so much food he had to share it with his co-workers.. Great deal!", "author": "Chi N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-07-17", "description": "Yelp says this place opens on Saturdays.  Their store front says they are open as well with hours posted.  Well... wut happen this pass weekend?  Still haven't been.", "author": "Demanding T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-13", "description": "Great Filipino Food for Lunch Time", "author": "Jonathan M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-05-05", "description": "FOOD:  Authentic?  Yes.  As in, I could've sworn my own Lola was the one stirring up that coconuty-goodness of Laing (taro leaves with coconut milk, and little baby shrimp.)  The pusit (squid), also prepped the way I ate it as a young girl.  The adobo was decent, a little oily for my taste.  But it's too tall an order to top my Mom's, where the chicken gets so tender it falls off the bone, then you toss it on a pan to get a nice mix of tender and crispy.  (Though, Dad, you've somehow tweaked your timpla of adobo and cooking style, that the difference is nearly imperceptible.)  Turon (saba banana with jackfruit wrapped in lumpia wrapper) was pretty good, glad they didn't skimp on the langka, though I prefer less sugar when they fry it up.\n\nSERVICE:  There's a counter up front where you order, then you seat yourself at the line of small tables along the side.  Aaaalmost like a stand at Market-Market, just in the Tenderloin.  The people are friendly, and there's a mix of people eating there.\n\nPRICE:  Great!\n\nSalamat Tita Tess, and I'll be back!", "author": "Hanneke F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-26", "description": "Was there when we ran the SF marathon. Food was great and allowed me to have good old home cooking. Place is small but certainly a bargain. Staff is friendly and courteous. If I ever go back to SF, this is one of those places I certainly left my heart for pinoy cooking.", "author": "Michael A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-04-06", "description": "Im not very experienced with Filipino food, in fact, I generally eat about anything. Literally. So most of my reviews are based upon the people who work there, the people who dine there and if I dig the place.\n\nI give this place 5 stars because the guy (owner?) behind the counter (Manny) rocked out and so did everyone else. He gave me a taste test of nearly every food he had. \n\nThen while waiting, I taught the Spanish speaking guy who works for him how to say in English \"I love you and not a day goes by that I don't think of you\", it was for his gf in Central America, he wanted to impress her with his English.\n\nThe food was great by the way, I ate 2/5 and had to take a food induced nap.", "author": "Fabian O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-11", "description": "They had me at Chicken Tocino =)\n\nSomething is comforting about garlic fried rice in the a.m.. But since I work in the FiDi, the closest I had to my b-fast of champions was JolliBee's (I was desperate).\n\nUNTIL Kusina Ni Tess!!! \n\nThey serve HUGE portions of yummy food for CHEAP!  I mean my $5 chicken tocino order feeds for 2!\n\nUnfortunately they only serve b-fast from 7:30-9:30, but around 9ish they start to run out of bfast stuff.  But have no fear, call them in the early a.m. and they will put your order on the side. So when I come rolling in there late, its waiting for me =)\n\nI've had lunch here, and I was just lost.  Other then sising and b-fast I don't know much about authentic Filipino food.  But the sweet nice ppl there helped me make my choices very wisely.  They didn't mind my gazillion and one questions. and offered me samples and free soup!  \n\nFilipino food tend to run on the more greasy side... so the fav thing I had for lunch that time was the Pork Kebab and this eggplant omelet. \n\nMy all time favorite is still the b-fast... so get your garlic breathe on at 8am in the morning here!", "author": "Deanna T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-06-28", "description": "Eggplant dish is absolutely terrible. The taste is inexplicably sour and there is some unknown substance that might be egg in it. Staff refused to explain what it was and just shouted \"no meat.\" Items on the menu were not available.", "author": "Jenn B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-09-19", "description": "My tummy was so bloated from the meal that I hit food coma immediately after we left. Though my afternoon passed by sluggishly, I was thoroughly satisfied by the food!\n\nI really can't describe the dishes we ordered, much less pronounce it, but try the adobo and the fish! There are plenty of meaty dishes that are all good (The two of us ordered 5-6 dishes and actually ate them all...hence, the food coma). \n\n:) Definitely coming back for kare-kare (supposedly fridays!!)", "author": "Tory L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-21", "description": "Excellent food.  About as close to homemade Filipino food as you can get.  My mom, who is from the Philippines, gives it her seal of approval.  Try the bibingka!", "author": "Kathleen D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-06", "description": "Turon! I always buy at least 4 or 5 to bring some home for my mom. One time they didn't have any left, but the lady was nice enough to make a new batch for me when i promised to buy 6 of them!", "author": "Le T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-30", "description": "Four stars for:\n\n1. Convenience- located in the heart of Downtown San Francisco.\n2. Flavor and quality- not the best Filipino food, but I'd give it a star.\n3. Price- very affordable, the owner would also fry your adobo for free if you ask him nicely!\n4. Selection- wow, on any given day they would have 4-5 dishes like adobo, sinigang, fried fish, asado, menudo, laing etc. available.\n\nOne star negated:\n\n1. Cleanliness!!!!!", "author": "mikhael b."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-01", "description": "My manager took me out to lunch for my birthday, and the place we originally wanted to go to had already closed their lunch service (it was 2PM), so we walked around and decided to come in here. \n\nFirst of all, let me say that this place isn't very clean and only has 4-5 small tables to sit at, but I'm assuming people get their food to go anyway. It reminds me of small family-run restaurants in Hong Kong, where most customers are regulars and don't mind how run-down it is. They had a television on a Filipino channel, so we got to enjoy some kind of Asian telenovela while we ate. The staff was friendly and did their own thing while we poked and peeked around. \n\nI think we had just missed the lunch rush here, so they didn't have any noodles left. White rice it is! Carbs on carbs. We decided to do this family-style, and shared:\nPork Adobo: I've only ever had chicken adobo before, and this was a lot less vinegary and more gravy-y than what I remember. The meat was really tender and flavourful, and there wasn't too much fat attached. It was, however, kind of oily but it wasn't too bad.\nLaing: Probably my favourite part of my meal. This is taro leaves cooked in coconut milk. It tastes like sweet curry, and it melts in your mouth. Because it's veggies, it feels healthy and it's amazing with rice. CARBS ON CARBS.\nBBQ Pork Skewers: Well, I really like barbeque and skewers, so no complaints here. I would've preferred chicken or beef, because I've never really understood what pork tastes like... \nTinapa: The meat on their fried fish was a little on the dry side, and was hard to eat without really getting our hands dirty (damn flimsy plastic forks), but I really liked how they seasoned/marinated it. Not too salty and the skin was very crispy.\nBeef Stew: This was really bland, and I had maybe 30% of mine. I think they were trying to get rid of it, because there were no veggies and no beef, just broth and oil. Nope.\n\nWe each got a huge plate of rice, and the portions were huge for one person. Everything came to $23, which is really cheap for how much food we got! I think this was my first time having an authentic Filipino meal, and I will definitely come by again to try more items.", "author": "Katie M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-02", "description": "The best Filipino food I've ever had to pay for! The selection, which rotates from day to day, is quite diverse and can accommodate a vegetarian satisfactorily, of which I am not. Otherwise, and this is true generally of Filipino cuisine, the meat dishes are the focal points. For sheer variety this place would make me think twice about going home for a Filipino meal. The chicken adobo was flavorful without being overly salty or vinegary, and now that I've discovered that you can request it to be fried, I'll have to try that common variation as well! The laing we ordered didn't contain any shrimp or meat, just the taro leaves and coconut milk, and was delicious just the same, a very comforting food. The dinuguan was, hands down, my favorite part of my meal, and it surprised my companions with its quality, especially after they'd gotten a sample and brief explanation of what it is (pork butt in pork blood). Our meals came with rice and some \"soup\" which was actually just sinigang broth without the bok choy and beef. \n\nThe location is pretty small and its exterior hardly stands out (despite the bright yellow awning), a real hole-in-the-wall place, but none of this should matter given the delicious and authentic food. And the gentleman (who reigns from Bulacan!) who is frequently at the door is genuinely invested in providing a filling meal. My companions are relatively new to Filipino food and loved all of it. In fact, we bartered over who was going to be taking what after we'd stuffed our faces. \n\nI've been searching for quality Filipino spots in the city since moving here, and though this is actually my first stop, it'll probably be the primary one. I've yet to try the rellenong bangus or kare-kare, but will be trying them out soon.", "author": "Jake m."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-11-23", "description": "OMG, I am so happy that I found out that there is this lovely Filipino restaurant down the street.  Garlic Fried rice served as breakfast till 9:30AM, sometimes there are leftovers, under $5. \nThe chef is so friendly and offered me free soup. \nKare Kare, bitter Lemon etc.\n\nWill be back for the Bibinka", "author": "Tigre T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-01-09", "description": "The taro leaves cooked in coconut milk is the best. They taste kind of like spinach, but sweetened from the coconut. The owner (?) guy who always works there is really friendly and nice. Maybe a little 'overly' friendly. But I guess that's not necessarily a bad thing.\n\nI always see Filipino people here, so it's pretty authentic. Although the price is a tad on the authentic side for what it is. Maybe because it's near downtown?\n\nI also ordered the Halo halo, it was kind of interesting. Definitely mix it, I kind of made that mistake of not mixing it...newb me, but Halo halo means Mix Mix It's basically sweet beans, crushed ice, and coconut milk (maybe some other stuff too).", "author": "Xavier G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-22", "description": "It's a hole in the wall with very little seating, but the food is definitely legit! It definitely has a very mom and pop feel to it as the owners are running the place and they seem to have regulars who they know on a personal level. We got here pretty early for lunch, and lingered a little bit longer while the ladies behind the counter fried up some turons.\n\nThis review is based on the food more than anything. I personally did not grow up on Filipino food but my husband says that the food here is as authentic as they come. The actual establishment is a little lacking and could definitely use an upgrade but it did not detract from the experience. I can imagine that the place can get extremely packed during breakfast or lunch hours. It does look like they do a lot more takeaway and catering orders though.\n\nThis place gives you all the rice you can eat, which is great because most of the food they offer pair with rice very well. The sinigang here is delicious, and actually better than what I remember trying in the Philippines. It is sour (as it should be) but it definitely is backed with a lot of flavor from the pork and vegetables in the soup. We also had the Filipino Beef Steak and that was good. I wasn't a big fan of it as it tasted a little sour but my husband loved it. It supposedly tasted like how it traditionally is prepared. The last item we had was giniling which is pork cooked with vegetables and left to steep in its juices. This was really tasty. And it definitely went really well on top of rice. It is a tad greasy but it definitely is quite good. We also had the halo-halo after the meal and it was a little difficult to stir as it was served in a plastic cup. Regardless, it was just okay and I've definitely had better from my local Filipino restaurants.\n\nOverall, I really enjoyed the food. I will definitely be back next time I am in San Francisco!", "author": "Grace P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-07-16", "description": "Just had their loganisa, egg, and sinanag (garlic rice) for breakfast.  It was yummy and their loganisa wasn't too oily which is great!  All-in-all, for a breakfast this yummy at $4.50 it's a great bargain!  And, it was a great way to start off a Friday morning!  \n\nOf course, b/c of the garlic greatness I have to hunt down my toothpaste and toothbrush and brush my teeth before my meetings. :)", "author": "Raymond G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-11-06", "description": "Yum.\n\nMy first hint that this would probably be good was the 10-deep line to get in at lunch time.\n\nMy second was that everybody eating at Tess' was Filipino.\n\nYes, it's a small place.  Yes, it's steam table food.  Yes, it can be crowded.  You consider these to be negative?!\n\nI waited about 10 minutes to order my food.  While I was waiting, I watched them prep fresh dishes and move them to the steam table.  That's a Good Sign(tm).\n\nI grabbed some pork afritada, pancit and dinuguan.  All three were pretty yummy... and the portions were huge.  I washed my meal down with two sodas and still spent less than $12... including the complimentary white rice.\n\nIf you're looking for individual seating here -- give up.  There are three tables set for four-tops.\n\nYou will, however, stand a good chance of grabbing a seat at the communal table in the back.  And you should.  Best seating in the house.\n\nAt the back table, seated with around eight people I'd never met before, I had a really nice lunch and a lot of warm, friendly and fun conversation.\n\nThe food here is very good... but the folks that work here and eat here make the place.\n\nGoing back to try the bangus :)", "author": "Mark B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-05-20", "description": "The lumpia was delicious, and the pork was great. The rice was clumpy. The atmosphere was kind of homely (take that as you will). Oh yeah, banana ketchup!", "author": "Eric L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-08-12", "description": "I don't care much for carbs, especially white rice.  BUT I've been craving KNT's garlic fried rice all day -- outrageously delicious and will protect anyone from vampires.  I stopped by one morning to get Pilipino breakfast - $4!  And I think it took me three days to get through it (GFR reheats very well.)  Must come back here for the kara-kare and of course, a super-sized portion of lumpia.   Saraap!", "author": "Amelyn C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-07", "description": "The guy that works here was so super nice and friendly that my traveling companion, who is a meat and potatoes kind of guy, agreed to eat here after getting to taste some of the food.  The food was amazingly tasty and VERY well priced.  Highly recommended.", "author": "Pat B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-11-12", "description": "Tess's restaurant reminded me of a district called Quiapo in Manila where thousands pay homage to the famous Spanish colonial cathedral. \nPhilippine culture- from high society to panhandlers pass through here to buy fresh sampaguita (jasmine lei) maybe even jackfruit while waiting in horse drawn carriages as they meander through the streets, serenaded by a cacophony of honking horns to ease the bottleneck traffic along. \nSidewalk restaurants flourish here as well along with dozens of street vendors, ,fruits stands, souvenir shops and herbal stores (and the list goes on) . I can easily see Tess's kitchen here-- a little quiapo style restaurant serving authentic PiliPino food and that's Pinoy with a CAPITAL P! \nThe menu changes on a daily basis offering the following: \n\nSINIGANG- Sour soup in tomato/tamarind base fish or pork, \nKARE-KARE- Peanut stew with oxtail with string beans, eggplant,cabbage \nNILAGA- ginger beef broth with beef shank with potatoes and bok-choy \nCRISPY PATA- deep fried ham hocs with vinegar dipping sauce \nLUGAW- Pilipino congee with saffron, ginger and chicken, \nLECHONG KAWALI- crispy roast pork with side sauce, \nTINAPA- Fried marinated fish (in coconut vinegar, loads of garlic and whole peppercorns) and of course the ubiquitous \nADOBO- chicken or pork- braised meat in vinegar, soysauce, garlic and bay leaf. \nDESSERTS: like palitao (flat rice cake dumplings with coconut shavings), puto (steamed rice cake) and halo halo (just get it) \nThe restaurant also serves breakfast with staples like tocino (marinated savory ham), tinapa and longanisa (sausage) \n\nPS- The owners and cooks were always eager to chat up a conversation and introduce you to PINOY cuisine given the generous helpings on the plate! 3.5 STARS place.!", "author": "Arissa C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-17", "description": "My friend and I were looking for something different for lunch. Luckily it showed up on Yelp. For $6 you get filled with rice, a topping of your choice and their soup. The owner was so helpful. He allowed us to try different things until we could make a choice. I ended up with the adobo chicken. My friend got the pork stew thing which also had potatoes and vegetables. I would go for the beef stew next time and their fish. I would try getting it to go since the place is tiny and it can get packed quickly.", "author": "Stephanie Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-10-19", "description": "I finally stopped by Kunisa Ni Tess and I was really impressed by the authentic Filipino cuisine, the friendly staff let me sample a few items before ordering and I ordered the taro leaves in coconut sauce, the adobo chicken, plate of rice and also a free bowl of soup that was included with the meal, I thought the food was excellent! they have a pretty good variety to choose from, the restaurant is very small only had around 4 - 5 small tables.\n\nthe prices are very reasonable, if you want some really good Filipino home style cooking, this is the place to go! I should come here more often, Im glad I found this nice little hole in the wall.", "author": "Mr Bolo B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-01-31", "description": "Kusina Ni Tess is a hole-in-the-wall eatery serving home cooking Filipino food.  Home cooking usually means the food is yummy, just like how your mom cooks it. Unfortunately, the  over oily chicken adobo, bland noodles, and lumpias that I ate were not very good. They tasted exactly like the dishes my mom made--not tasty. \n\nWorse, the portions were very small and the prices were quite high. I am not a big eater. But I were still hungry after I ate two small pieces of chicken (~$3.5), noodles (~$3.5), and six lumpias ($3) and had to eat a burger at Carl's Jr. \n\nSkip it!", "author": "Ed W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-02-15", "description": "I am so sorry.  I am really sorry.  I don't want to do my Filipino peeps any harm.  I will eat in the dingy-est dive in town (even to Pakwan with their basmati-cockrochi rice) but man, it's just not cool when the restaurant fries fish two inches away from you. \n\nI was at Kusina ni Tess with some non-Filipino co-workers (it was their idea, not mine) this afternoon and Tess decides to fry up a boat load of milkfish (bangus). My co-workers didn't complain (I guess they didn't want to offend) but we seriously left the place smelling like Pacific Super.   \n\nThe food was below average - everything was greasy, greasy, greasy(the forks and spoons were still a little greasy from the last patron).  The Chicken adobo - greasy (actually, they should rename this dish to chicken swimming in grease and a little bit of soy sauce). The pork Chop - greasy. The Sinigang -super greasy (little chunks of fat swimming around in your soup). Agh! Why can't Filipinos here cook without so much grease? \n\nJudging by the lunchtime crowd, it is obvious that the Hilton Hotel workers keep this restaurant alive.  If I were Filipino and worked at the Hilton, I would demand for a little bit more quality from Tess.\nI know that most of them don't really have a choice (there really is no other Filipino place around) - but please Hilton workers, next time you are at Tess', tell her to cut the grease a little.", "author": "Clarice V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-10-01", "description": "I am very new in SF and I've been eating non-filipino since a week or so. There are many foods here we dont have back home (Zurich, Switzerland), this week I had from burgers in Cheesecake Factory to Froyos, good dumplings and shumai in china town, corndogs, delicious crabs in fishermans wharf etc. but as a filipino, I was craving for some white rice with \"Ulam\" and so, someone recommended me Kusina Ni Tess which is 2 blocks from my hotel (thank god) and I ran quickly to this place. I had fried embutido and gabi and it was delicious as expected! i kept it simple, big meals like kare-kare or palabok I'll order next time. honestly, I wouldn't know what to decide, because there is alot of choices.", "author": "-ed- G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-06-26", "description": "It's a cramped place nearby a porn store .. seriously. But it's the Tenderloin. \nAnyway, I hate to be so harsh here, but I feel like I've experienced better tasting food & better service at other places (i.e. Irma's in the Mission). This place doesn't seem to have the food I want when I need it.", "author": "Annie D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-11-04", "description": "Good prices for food I always have leftovers. The Owner is very friendly and always gives me samples when I come in. I like this place since it is close to where I reside and I have leftovers that last a day or so:D I am not big on Banana but the dessert banana sugar coated egg roll looking thing is amazing as are the veggie rolls. :D", "author": "Shelley M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-11-09", "description": "I went there for lunch today and I was floored by Manny having set aside a stew called KarKari based on our brief conversation this past Monday.  I also had this with a vegetable dish called Laing.  Laing reminded me of a Thai dish without the spiciness.  It was delicious but it did not compare to the KariKari  The stew dish was very tasty.  It was rich and flavorul.  I felt like I was eating at somebody's home back in the Philippines.\n\nI was so full that I had to take a fried banana dessert to go that I promised my sister to taste.  I know she will be very jealous when she reads this review! :-)\n\nBest to Manny and the restaurant!", "author": "Joe C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-30", "description": "I was craving some Filipino food so I happen to come across this place here on Yelp. I decided to take a chance and try it out. My husband went to pick up the food and it is basically a little hole in the wall. For 4 items he paid around $21. Not bad. Food was oily but what do you expect. Food was tasty though. We do plan on going back and try more dishes.", "author": "Cynthia L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-05-11", "description": "SERIOUS POOR PEOPLE FOOD. \n\n2/11\nthe food here has gotten a lot better in the past few months.  the kare kare is really good.  they actually use oxtail.  they at one time used pork chunks. (what's up with that).  Everything is pretty good and rice is included with no charge. \n\n2010\nBeen craving Filiipino food.    I thought I'd come back and give this Tess another try.    So, much better, but still a bit greasy.   Kare Kare is pretty good,  not generic when this place first opened.   Diniguan sp? is really good.   Everything is much better.   Service is still a bit slow, but oh well.   Now come at least once a week.    \n\nthe service is a bit slow, but call in your order if you can get through.  I actually waited over an hour to talk to someone.  you still have to wait when you get there.  They're very unorganized.   The last day i went there,  there were five people behind the counter.  Three people in line and I waited 15 minutes to get my food.  I over heard someone sitting at one of the tables that she waited over a half an hour to be served. So heads up with the wait.  \n\nmy rating went from 4 stars to 2.\n\n5/10  really wanted filipino food.   went there after work and ordered menudo.   MENUDO????  that was NO menudo. it had hotdogs.  i think this is poor people filipino food from the projects.  The kare-kare the serve is now pork chucks.  \n\nmy new rating went from a 2 to a 1. (somebody shut this place down).", "author": "jeff a."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-10-22", "description": "I went to this place expecting a decent & authentic Filipino lunch at a \"decent\" price based on the reviews I read here. Damn was I led astray! The food was great & they had the whole Pinoy turo-turo experience down when we paid for our food, the lady behind the counter blatantly inflated our bill while shamelessly speaking Tagalog like I wouldn't understand it. 4 entrees & 2 orders of rice cost $38 freaking dollars?? The bill wasn't even itemized at all which made it difficult to figure out what we were being charged for. This is a disgusting practice I would expect in a ghetto area of Manila, not in San Francisco. Don't go here unless you don't care about being scammed. I won't ever be back. Period!!", "author": "Tomas R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-27", "description": "love it! I was in town for a conference @ the Hilton across the street and stumbled upon this fabulous eatery. The place is a bit run down.. okay hole in the wall, but it has a nice homey feel (like I'm in Southeast Asia!) and it's served cafeteria style. It's nothing fancy, but the prices were decent ($7-9). I had the pork adobo (YUMMMM) with white rice, and when I asked them not to give me too many fatty pieces, they were OK about it! And it's true- they do give huge portions, but I am a glutton, and I devoured all of it. They have other options too, such as fried fish, chicken dishes, stews, and if you don't know, you can point or just ask (they will clarify). The cook/server (stocky guy) was so friendly. I went 2 days in a row and he remembered me! They also make/sell some sweets there.", "author": "Graciete L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-10-16", "description": "When I can't make it to either my aunt's house or Daly City for my Pinoy food fix, I come here. The service is wonderful - the owners are very nice and offer taste tests of what's being offered that day. The food is pretty good as well - their lumpia and kare kare are delicious. There's not a lot of room here to have a sit down meal so I suggest getting take out and eating at Yerba Buena Gardens or anywhere outside. You can see me walking around downtown, turon in hand.", "author": "Devy E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-16", "description": "My co-worker and I are doing a pan-Asian lunch tour of San Francisco and today we drew \"Philippines\" from the box of crinkled up post-it notes bearing the names of 12 Asian countries.\n\nWell, San Francisco, despite swimming in Asian Culture is lacking any real consortium of Filipino cuisine. Note to self.\n\nWe found Kusina Ni Tess after some quick Yelping and I would say that most of these reviews are pretty accurate. Very homestyle - Tess was very accomodating and even let me try a few of the dishes before I picked my lunch platter. Noticing my small frame and apprehension to the mongo-load of rice she wanted to dish me, she conceeded to providing a smaller portion. I have never really eaten much Filipino food and found it to be greasy and mysterious, but all around very tasty. I tried the purple string beans with chunks of pork fat paired with a type of creamed spinach in sweet coconut milk. I also had two small bowls of the peppered beef broth which was excellent, but a littly salty. Atmosphere was good, but I had wished it was slightly cleaner. My co-worker had two meat dishes, one chicken curry and the other was an asian style meatloaf. She didn't feel too great afterwards, but I think it was because she ate too much of the fried banana wrapped in lumpia skin for dessert.\n\nAll in all, I liked the experience but will probably not return unless they tidy up a bit. The recipes were good and definitely unique. The flavors reminded me of a blend between southern Chinese cuisine and Indian.", "author": "Nicole S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-06-27", "description": "This place is as good as it gets. The people are VERY friendly and gave us free samples of anything we wanted as it was our first time. The food tasted amazing and there was plenty of it. The corn (like) bread is phenomenal and the Adobo can't be beat. Top 5 cheap eat in the city.", "author": "Ben T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-30", "description": "The nicest, friendliest woman in San Francisco works at Kusina Ni Tess.  I was working late for a conference, and ran out to get some food here before it closed.  I had tried on two prior occasions (one a year ago) to try the food here, and this was my first successful time.  The only Filipino food I was familiar with was adobo and lumpia, so I ordered pork adobo and lumpia.  I asked her what else was good and she started giving me tastes.  Of everything. (there was no one else in the restaurant at the time).  So I can say that: the taro root in coconut milk is something you gotta try; the orange noodles cooked in cream of mushroom soup, mashed tofu and egg are delish; the chicken something and vegetables are good, the lumpia is so good, the stuff with shrimp paste is yummy.  They have BBQ pork on a stick.  Let me be clear:  BBQ. Pork. On a stick. And, she answered every single question (and I asked a lot) about what stuff was.  So:  very good, inexpensive food and service with more than a smile - Kusina Ni Tess is a winner.  Did I mention the BBQ pork on a stick?", "author": "Cookie C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-05-05", "description": "This place is a total hole in a wall establishment with a porn store just doors away. So it ain't got ambiance , who cares. When you need some Lumpia and some  cheap homey food and you're downtown , it's the place to be. Huge portions on steamy fluffy rice.", "author": "Sophia C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-04-28", "description": "I've always passed this place and never had a chance to stop in. How glad I am that I did today. I was feeling a good filipino meal and yelped near Union Square as I was getting into work. All I read were positive and thorough reviews! So, I thought they couldn't fail me! The moment I walked in a welcome greeting came from a friendly man named Manny who asked if this was my first time to visit Kusina Ni Tess. My reply was yes. He then welcome's me and starts off by sending samples my way! I got to try the food before I bought! So I went with the most talked about Laing: Taro leaves marinated in coconut milk. Delicious! As well as the Pork Adobo: A soy sauce and vinegar cooked mixture with pork. Manny then offered to prepare the adobo another way by deep frying the adobo and sampled it for me! He said if you like it prepared this way I will do it for you. But, I preferred the other way. I thought that was extra thoughtful!!! Talk about service. Manny then serves me with the following including a bowl of soup complimentary on the side and free rice refills that I didn't have to go back for with such a generous amount that was served! I had leftovers for my boyfriend to try and he absolutely loved it! Thank you Manny and Tess! I will be back for sure and will bring you business! You all met my delightfullnesss and more!", "author": "Desirea O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-09-18", "description": "I was introduced to this place by my friends that always -I mean always- go there.  It was pretty busy but the hospitality was soo friendly that they made room for the three of us.  The food was just made so everything was nice and fresh.  It' near the TL so don't be expecting any fansy smanshy environment but I do recommend this 'hole in the wall'!", "author": "Maria E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-07-02", "description": "Loganisa breakfast this morning was great and a steal at $4 and they were curious with my request for some fresh garlic for my sucat (vinegar)\n\nThe only complaint about this place I have is they don't serve Leche Flan daily.  Their flan is freaking delicious with just the right consistency.  Bibinka is good too but I just wish they had some pineapple in it.\n\nI need to come back and get some mechado, looks and smells great!", "author": "deryck s."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-10-27", "description": "Tes's Kitchen is definitely a hidden gem on the outskirts of the TL. Having worked in the Union Square area and now downtown, this is the closest you're going to get to authentic Filipino food where you don't have to venture too deep into cracky territory.\n\nChicken and pork adobo, fried tilapia fish, dinaguan (\"chocolate meat\"), calderada (beef, ox-tail), chicken tinola (soup), sinigang na baboy (pork) or isda (fish) to name a few of the main dishes. The menu varies from day to day, but they often have 6-8 mains to choose from. Lumpia is sometimes on the menu, and WE ALL LOVE LUMPIA!! Just today they had freshly made turon (fried wrapped banana, glazed with sticky sugar)....Scrumptious!! You can get a huge plate of rice and a main dish for $6 even. Add turon or lumpia for another $1, or a tall cocounut or cantelope juice for $1-1.50, for a total of less than $9! That's a deal.\n\nAlthough Tes' Kitchen may not have the expansive selection as the more commercial restaurants like Goldilocks (closest one is in the Excelsior District) or your nearby Jolli Bee's (McDonald's of the Philippines), but this place is simple, more local, and in my opinion authentic.\n\nIt's a small hole in the wall, so it doesn't fit many. Customers are your usual nearby workers from adjacent hotels or local community members. Don't expect ambiance either, you can get that in a ritzy hotel restaurant by the Square. But they do speak ENGLISH for all you non-fluent Tagalog speakers like me.\n\nHours?? I don't know, I've only come here for lunch the past few years. Whenever I get that crave, and mom's place is too far for lunch, I come to Auntie Tes'.", "author": "Barbie D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-10-25", "description": "What a surprise! Across the street from the employee entrance to the Hilton I grabbed A BIG breakfast of Giniling, eggs & a HUGE plate of rice for $4! Though breakfast here is only served from 7-9:30am, they had plenty of breakfast & lunch dishes out. (Lunch/dinner will run you about $4-8.) I almost got the longunisa, eggs & garlic fried rice (my own childhood staple with lots of ketchup..) for only $3.50 but I came a little late. Next time I'll try the desserts or grab some halo halo on the way but.... but today, I was stuffed! They also have a list specials that change daily (kare-kare on Fridays) and they cater about 23 different dishes, perfect for potlucks! I was told they were recently under new management. The employees are helpful & kind.... I will definitely come back.", "author": "Eugene G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-03-05", "description": "I worked about 4 blocks away and sometimes I feel like having Filipino food, so what a surprise that I discovered this small gem in the area. I've been there 3 times during already. Had the pork adobo twice and the beef stew over steam rice and was quite pleased.The portions are quite big, they even offered  a bowl of soup too. I don't mind fish being fry right there because you know it is freshly cooked.  I'm trying the fried fish next time. The staff is courteous. Reasonable prices, main dishes are either $6 or $7, but  I rather  eat here than having a burger from Burger King or Carl's Jr. My only complaint is that the volume on the TV way too high. Non Philippine reviewer, but enjoy the cuisine.", "author": "Hum V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-07-25", "description": "This is the real deal!  No pretense (folks have already mentioned the location so I ain't even going there); just good, wholesome, flavorful food served with lots of love.  Just like home.", "author": "Byron J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-08-04", "description": "Swung by around 11am on a Saturday hoping that there would be some brunch-silog, but it was all lunch.  Considering that I didn't have to jump in my car and shoot down to Daly City/San Bruno, it wasn't too bad.  Definitely one of the better Filipino places in the city.  Had a huge serving of rice with dinuguan (if you don't know what that is...better google it) and some chicken.  That with a can of coconut juice...all for $8.50.  Chicken was good, but the diniguan was a little runny and bland for my taste.", "author": "Mark D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-05-25", "description": "Tes's is a hole in a wall canteen.  Not a fancy place, just a take out and a small area to sit down.  Food are average nothing special to stand out.  tried their pansit, just average.", "author": "S S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-10-06", "description": "I've ordered take out twice, and will do so many times again. Everything I've had thus far has been really really good, adobo, lumpia, banana lumpia, taro, you name it.", "author": "Will B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-03-05", "description": "San Francisco, despite it's sizable Filipino population, is quite lacking in good Filipino restaurants.  Every so often you'll find a mom and pop operation somewhere, with mixed results.  I'm glad to report that this place does it quite right.\n\nThe Pros:\nThe Food is great!  They specialize in traditional Filipino family food, they have a menu that rotates, with a set of 5-6 entrees to choose from everyday.  The things to look out for: The bulalo is excellent... and it comes with as much rice and sabaw you want, no extra charge (huge plus!).  The dinaguan is excellent as well (and dinaguan is usually done soooo bad).  And a breakfast of chicken tocino, two eggs over easy and garlic fried rice is why this place is getting a full five stars.  It is crazy delicious.\nThis is the friendliest place I ever been to.   The owner, Manny and his wife run the kitchen and their two young kids are often running around the restaurant somewhere.  Grandma also works in the kitchen.  The have TFC (The Filipino Channel) playing on TV all day.  Manny will make a genuine effort to learn your name the first time you come in, and if you're Filipino, ask you where in the Philippines you're from and generally talk your ear off.  \n\nThe Bad:\nThe food is unapologetically Filipino, and may turn off the random finicky tourist walking in from the Hilton.\nFood is not cooked to order, it's mall food court style.  You can't really do Filipino food any other way though, we're a culture that really likes stew-like things and that takes a while to cook.  They do however cook all day in small batches, it's always pretty much been fresh every time I go, even at closing time.\nAnd that leads to the main bad.  The place closes at 5pm and is completely closed on a Sunday.  That kind of makes it tough for us 9-to-5ers to get here BUT you can call in an order and Manny will have it ready for you to pick up till about 5:30pm.\nThe place is quite small.  It's very clean.  The place kind of smells like fish, but we Filipinos do in general.  Don't laugh.  You know what I mean.\n\nThe Gist:\nTo any Filipino yuppie here in the city, the best way I describe going to this place is like it's a great big hug from you lola, and then she'll feed you and disparage you for being too thin.  And sometimes you just need that.", "author": "John Paul M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-05-06", "description": "This is a little Filipino hole in the wall restaurant with authentic tasting food, cheap too, no frills.  Reminds me of old karinderya near university belt, a bit of nostalgia. Turo turo style, so all the food is there to be seen and you get to decide based on how it looks.  Rice is plentiful, with clear broth for the asking. Then there's dessert of turon and bibingka-togo as we could no longer eat them on the spot.  Seating is limited, but lucky for us we got there at 1pm.  I would go there again when I go to the city.", "author": "maria j."}
