{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-18", "description": "We never ever let any Restauranteur or their Staff know who we are we critic them for good or bad. With 20,0000 food last mile deliveries we know when a restaurant has our taste buds in an uproar La Fonda Restaurant on Irving Street In the City is Worthy of Great Mention.\nI had been DeliverIng all day and wanted to eat really good home cooking food and I send one of my assistants to find me a home cooking style restaurant and the ones that I like to eat from where 45 and one 2 hours away. I was not so sure of the food. When I tasted the Taco de Carnitas.\nWOW MY TASTEBUDS HAD FABULOUS  TIME SAVOURING THIS DELICIOUS TACO AND IT BROUGHT ME BACK HOME TO GREMAS COOKING .", "author": "Yisel D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-08-26", "description": "I've come here a few times! It is the first time that at any Damn Taqueria that they \"share\" chips!\nI PAID SEPARATELY WHY IN THE WORLD WOULD I SHARE CHIPS WITH THE OTHER PERSON. They paid and ordered separately?!? INSANE!!\nCashier and cook were rude as fuck about it!!!\nAnd they gave the other person \"dirty ice\" didn't even want to give a cup with us like other places they give it to you without an issue!!!\nHORRIBLE SERVICE!!!!", "author": "Susanyelli Z."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-06-24", "description": "The staff are polite and the place is very relaxed and casual, the menu is average and the food is average as well. They offer chicken, steak, BBQ pork, shrimp, and vegetarian options. The main issue was that the meat came out dry both for my BBQ pork, my cousin's chicken, and her husband's steak. \nThe price here is average at about 8-10$ a dish and the food being average quality comes out about even.", "author": "Anthony S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-07-17", "description": "The Burrito here was mediocre at best. It was definitely a nice size for the cost, but the flavor was lacking and it just Didn't taste fresh. I just stopped in really quickly after I finish the work out because I was starving however I was greatly disappointed.", "author": "Ty S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-05-05", "description": "I will give it two stars because the Salas bar was good.\nThe meat was so tough it was like leather.   \nThe older lady taking the order was rude.  \nKeep walking if you end up out front of this place.", "author": "Lance S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-31", "description": "I feel I owe this place a review, seeing as I come here so frequently. What makes them so reliable, is there are a variety of dishes I like to order: veggie burrito, chicken quesadilla, super taco, panuchos and more. They have a self serve salsa bar, the green salsa being my favorite. They are consistent too, every once and a while they miss the mark, however, I never hold it against them.", "author": "Heather S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-01", "description": "The woman taking orders was SO rude. She was acting like I was crazy for ordering one of the burritos without rice. Then, she asked if I'd like mild or spicy and when I said spicy she looked doubtful. My boyfriend, who is clearly Hispanic ordered spicy also. When our food arrived I was surprised that the hot sauce on mine was sweet, so I tried his, which was actually spicy... this is incredibly demeaning and totally rude!", "author": "Kailey W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-22", "description": "Love this place. Order ahead of time. Love service and they are always suppper sweet.", "author": "Ivan M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-06-30", "description": "Good place but waste of time... if your listing says open at 10,,,, don't open at 10:30!", "author": "George C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-05-18", "description": "I ordered a super burrito with al pastor as my meat choice, I was surprised at the price as the burrito should be 7.75 but came out to 9$\nWhen I look at the receipt they had a surcharge for al pastor... it was only .50, but it shouldn't be there at all, the menu says al pastor is one of my meat choices, not one of my meat choices but with a hidden add on fee. \n\nI wonder how many other things have their secret add ons and how many of us are over paying in small increments.", "author": "Greg F."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-09-13", "description": "They're food is mediocre, by all means overpriced, and the staff are rude as fuck. They look at you like they literally hold deep contempt for you for being there. I don't know what they're problem is. They gave me shit for taking too much complimentary salsa after I spent my money there several times. They can burn in hell forever. Thanks.", "author": "Andrew L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-03-07", "description": "Gave this two stars for the green salsa, everything else deserves a one star rating. The meat is flavorless, chewy and fatty. It's like they choose the worst meat to cook and drop it into burritos. I've tried this place 4 times hoping I would find something that I would like. I really gave this spot a chance since it would be nice to have an awesome Mexican food spot in the neighborhood but this place disappointed me every time. Underdogs tacos and burritos are a million times better than this place... This place is in a prime location it's unfortunate that it has terrible food.", "author": "Steven C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-08-07", "description": "Went here around 9:30pm. Ordered the Azteca Burrito, which was alright. Took a long time for the food to come out. Meat was a bit tough, but I really liked the salsa bar. We asked an employee if she could refill the water jug because the water ran out, but she never did. All the tables were also dirty with dishes.", "author": "Amy T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-07-17", "description": "This place has the world smallest burritos in California!\nThey should start weighing out there meat because it's not Worth the money they charge! That's the last time I go get a burrito from this place!!!!!", "author": "E M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-11", "description": "Not once they did their orders right, every time I order jalapeños with my meals to go.  NONE WHATSOEVER!  Even when I tip them for my take outs, you only tip when you dine in.  \n\nEither they have some kind of language barrier, or they only listen with the big tipper! \n\nIf you must go, you better check your orders before you leave.", "author": "DAVID T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-24", "description": "Authentic Mexican, clean, always super friendly staff. My go-to spot for a breakfast burrito, and they never cap breakfast time!", "author": "Jessica R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-05-27", "description": "Rudest front end folks I have seen in some time. First of all, I asked for brown rice. The cashier looked at me as if I was from another planet. She thought about what I asked for a moment, and responded with a disgusted face, as if I asked for poison. Then, instead of taking the order, she opened the cashier and started doing accounting with another colleague, all the while I stood there blabbing off what I wanted in my bowl. She dismissing may looked to another woman and said, can you help him, which she started counting another fistful of cash.. Then the other woman began with an indifferent face and continued with the service massacre.. Couldn't take it anymore... Left, when another customer just jumped in front started talking to all of them in Spanish.. Wasn't sure what he was saying, but he sounded pissed off.. Either ways, won't be checking out this joint any time soon...", "author": "Bayabil G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-18", "description": "La Fonda provided a great Mexican food options at affordable costs like a big size quesadilla for $6.50.  I was in a time crunch and near the Inner sunset, and thought that A few tacos would suffice. Instead looking over the menu I chose the Al Pastor quesadilla that comes with guacamole and sour cream.\n\nThe restaurant has a few tables downstairs and about 5 tables upstairs, and they have good tomatillo salsa as well as a solid chipotle salsa at the bar.  The decor is simple, but I like the orange cream colored walls as it reminds me of a traditional color for churches and government buildings in small towns in Mexico.  So aside from the childhood memories, this place does make tasty Al Pastor.  They also give you a generous amount of chips for free with your meal.\n\nThe food is 3.5/4 and the prices are totally 5 star for food in SF", "author": "Marlon T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-05-15", "description": "I used to like this place, would occasionally stroll in and get huevos rancheros. Yesterday I asked for them over medium and the lady cook slapped them on the grill. In 2 seconds, the dish was ready. The eggs were raw, the white part was completely swirling around.\n\nWhen I went up to ask her to redo them she gave me a dirty look and said \"you wanted over medium\", she didn't even look at them to see what was going on...Then she rolled her eyes.\n\nWhen I said thank you to her for redoing them when they were ready, she ignored me. They were cooked so well I couldn't eat them. It was as though she did on purpose to be passive aggressive. At this point I gave up, had my beer and ate the chips. \n\nThe women who work there are rude, unprofessional, and act like they work in a brothel, belching music at the top of their lungs. I really wish the cook didn't take the request so personally, it wasn't my fault the eggs were uncooked.  \n\nAlso, the place was much dirtier than I remember. I almost slipped twice when I got up. :(\n\nDon't go there, there are so many other places around 9th, save the Mexican for one of the many, many good places in SF.", "author": "Larissa M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-01-01", "description": "Chicken taco was oily and the carne asada in the carne asada taco seemed spoiled - would not recommend this place.", "author": "Praveen S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-29", "description": "Food is good. The people who work there seem to have an attitude and somewhat of bad manners. Music is always too loud and the tables are always dirty with plates", "author": "Carol G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-02-10", "description": "Worst Mexican in SF. Tortilla was hard, meat had chunks of grease, tomatoes in salsa where old and chips were stale. This place is disgusting!", "author": "Hannah C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-05", "description": "I'm not Mexican so I can not how close it is to the real thing but I had an Al Pastor (BBQ pork) burrito and it was great. Will have to try the other stuff. BU so far so good.... Cheap too", "author": "Leung T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-04-20", "description": "The meat was dry and lacking in seasoning. The rice was decent. The chips tasted like they came out of a bag. The flan was probably the most disappointing. It was firm and stuck to the fork. Flan should be custardy and creamy. If you're short on time then this would do but if you have other options I would advise you to go to a different place.", "author": "Isabel T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-04-14", "description": "This place had apathetic customer service, and food that was extremely disappointing. On top of that, there were dirty trays and dishes everywhere. When I went to grab a fork, I picked up three before I found one without a dry piece of food stuck to it. If you want to try this place anyways, take my advice: don't.", "author": "Emma M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-27", "description": "Excellent food that is fast and friendly.\nI eat here probably 3 times a week. Tasty every time and friendly staff as well.\nI prefer this place to other taquerias in the neighborhood.", "author": "Justin A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-03-10", "description": "Food is ok. Carne asada no good. Pollo is the only good meat in my opinion. Enchilada sauce has too much cinnamon. Don't get wet style burrito. \n\nThe cashier isn't very friendly. One of the Mexican women working to cook the meat and make the plates is very friendly. The other larger woman is very UNFRIENDLY.   \n\nI think overall I'd check out other places.", "author": "T L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-03-02", "description": "The burrito is okay here, but the service is below average to me. The lady at the cashier looks so mean, don't even smile or say \"hi\". I will not recommended. Rather go to the one a block away or the one on \"Burrito Express\"", "author": "Jasper K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-05-14", "description": "Let's start with the facts.\n\nPros:  Clean, modern, great prices.\n\nCons: salsa isn't great \n\nFive of us entered this establishment to get burritos. Tart by tart was closed and gordos is a shameful experience. So why not try the new spot? \n\nThe main issue I have is the rationing of salsa. You are only given two thin small plastic cups for salsa.\n \nThe burrito itself wasn't that bad and I would dare to say actually decent. Better then gordos for sure but for us in the sunset. We are faced with no real options unfortunately.", "author": "Nathan A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-11", "description": "La Fonda is one of MY FAVORITE Mexican food restaurants in the city/ever.\nI order the Tofu Ranchero, at least 3 times a week, and it is .. the bomb.\nThey serve Vegan and Vegetarian friendly dishes, which isn't that easy to find .. and they are absolutely delish! The salsa is bomb and they have all the tortilla options available. :)", "author": "Michelean W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-18", "description": "Food is exactly what one would expect and it is reasonably priced. I also hella dig the interior, which is painted in varying shades of orange and yellow - it contrasts nicely with the bleak sunset weather outside. Definitely not a place hipsters would like though, so if you are a farmer that lives in Hayes Valley (or some such level of ridiculous / wealth) this is not a place you'd like!!", "author": "Robert W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-08-07", "description": "I had the smothered aztec burrito. It was a large portion, but the taste was marginal. The food came out quick. It comes with free chips, but no refills and the salsa is just ok. There is nowhere to put your dirty dishes so people just leave them at the tables and you have to move them yourself.", "author": "Tonni R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-26", "description": "Tacos are on the expensive side, but decent. I recommend the cochinita pibil tacos. I also recommend the huarache with chicken mole.\n\nThe agua de Jamaica was very refreshing!", "author": "Jose H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-06-04", "description": "Asked them to take the Guac off my burrito because they hadn't folded it yet and it was just scooped on top. Lady told me 'sorry it was already made'. Would have taken one second to scoop off they just scooped on it. They refused and I had to deal with it. Burrito didn't taste it hat good anyways. Had to throw 3/4 of it away. I regret tipping.", "author": "Oretola T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-02-12", "description": "Tasty food, excellent selection, reasonable prices, and fast, friendly service.\nAte here for a quick lunch. Ordered the super veggie burrito.", "author": "Jules M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-03-21", "description": "I usually hate the idea of giving a small business a bad wrap but for the sake of Inner Sunset community, I feel it is my duty to stop patrons from experiencing what I feel is the worst customer service in the Inner Sunset and maybe all of San Francisco.  The food isn't so bad but the women behind the counter are so mean and nasty I cant force myself to enter anymore.   I've given it a shot a few times and every time my experience has varied from the staff ignoring me to the staff seemingly laughing at me for what I ordered (whatever I was hungry).  Another time the woman behind the counter yelled at me \"Hello?? Is anybody home?\"    Lots of great fast eats in the Inner Sunset to choose from, just don't go here.", "author": "Katie R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-08-02", "description": "Rude rude and rude. Food was good but I got turned off with the customer service the cashier provided. I understand that she was pregnant but still no excuse. If my son wasn't hungry I would of asked for my money back and went elsewhere.", "author": "Dave R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-27", "description": "Their milanesa tortas are the main reason I come here.\n\nIt's a fairly small establishment with an upstairs place to sit if you need a bit more room. Small beer selection from $3-3.50.\n\nPeople that work here are nice enough. Decent music most of the time. \n\nBig windows! Sometimes they leave them open and you can grab a table next to them.\n\nChomps!", "author": "Eric D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-06-22", "description": "I recently ordered the Chile Relleno plate. It was tasty yet the large pepper was tough and it was difficult to chew. I did like the filling, rice and beans and the green salsa and chips were good. The corn tortillas were small, and bland. I have ordered the chicken burritos before. They are o.k. but bland. The chicken tostada salad was bland, Maybe they just need things spicier and things would be better.", "author": "Donna C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-03-21", "description": "This wasn't disastrous, food was edible - not great, but the staff was pretty rude. They two behind the counter were laughing back and forth at me while preparing my order. I had heard about this before I first went from friends in the neighborhood, but I was still pretty surprised when it happened. I've been there twice and both times the staff was being snarky. It was bizarre. Just go to Crepevine or Plutos if you're hungry and right there. And Gordo Taqueria is right around the corner if you need Mexican.", "author": "Dylan D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-07-17", "description": "I don't have high expectations when it comes to mexican food. All I ask is a well stuffed burrito filled with flavorful tender cuts of meat, seasoned rice and all the typical fresh fixings. In my mind, that shouldn't be too hard to pull off especially when you consider how easy it is to marinate the meat and slow cooking it to perfection. \n\nWell La Fonda clearly missed that mark. Everything was bland and lacked seasoning especially the meat. The only thing that helped add any level of flavors were from the salsa. Perhaps my taste buds were off but then again everyone at my table, 5 other people agreed it lacked flavors, we all can't be wrong.\n\nOverall Thoughts\n\nTruly a lackluster place for burritos but at least the price point is fare", "author": "Eddie W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-02-12", "description": "The food here is bland.\n\nThe customer service is not great.\n\nThe dining area is tiny and there is often nowhere to sit.\n\nThe only reason, I believe, this place has decent reviews is because of the convenience of the location and the fact that there isn't another decent Mexican place in the Inner Sunset.", "author": "Nic Y."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-01-18", "description": "no.  \n\ni should've listened to my inner voice.  \ni was across the street getting a turkish wrap, and was also craving a burrito.  since this place was located right across the street, i went ahead and ventured in.\n\nfirst of all, the lady working the counter gave me a weird/bad vibe. it felt rushed and she didn't seem polite at all.  after interacting with her i felt like i should've just walked out the door.  she was unpleasant to deal with.  when a white couple walked into this place after us, she was more warm towards them.  i'm not going to say she's a racist or something, maybe she knew them as regulars or something.\n\nanyways, i got the aztecia.  which is a wet burrito and when i asked for more sauce containers, she said it'll cost 50 cents each.  really now?  this is the first place i've been where they charge extra for those tiny sauce containers.  that's pretty stingy if you ask me.\n\nwhen we got the food, we took it back home. \nthe burrito was dry on the inside, the meat was kinda lacking flavor,  but i guess that's why they made it a wet burrito, so it could kinda mask the bland meat.\n\nthe worst thing is that, after eating this, my stomach felt weird a few hours later.  it wasn't as bad a food poisoning, but i highly question their cleanliness or quality of meat they used in the burrito.  \n\ni will never come back and will try and recommend people to find mexican food elsewhere.", "author": "Jeff K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-01-22", "description": "I have so much catching up to do! I went to SF several months ago but I've been so busy ugh haha just kidding I'm not such a basic sorostitute. \n\nThe burritos here are aight. Nothing truly special about em. Sorry that's all I got it.", "author": "Jerry B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-01-05", "description": "the portions are pretty small. I got a regular burrito that looked like a baby burrito. the burrito was as thin as a 8oz can of soda and the length was about 7 to 8 inches. very little ingredients. there was maybe 5 pieces of meat in the burrito, mainly refried beans.\nBeen here several times, and each time is getting worse, not coming back anymore.\nThe cashier was more into playing games or being on her cell phone that helping patrons.", "author": "Jim S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-08", "description": "Okay, La Fonda is not the most amazing Mexican in SF. But it is seriously solid, and it's the best budget Mexican in the Inner Sunset. I have had many many meals here. Burritos are well balanced, and they have a good mix of less standard dishes (get the Sopes and Panuchos!). Plus the ladies that run the place are super nice. And the salsa bar! OMG, half the time I came it was so I could load up on the salsas and pickled jalapenos.\n\nSo, if you're in the hood and don't feel like waiting for a table at Nopalitos, go here. Don't go to that revolting excuse for a restaurant Gordo. And that booth in Tart to Tart, wow, some of the blandest Mexican ever. You gotta satisfy that craving at La Fonda.", "author": "Aaron G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-27", "description": "Are you from this neighborhood?\nSomewhat... What are you looking for?\nThe cheapest burrito around.\n\nGood prices and a good tasting veggie burrito!", "author": "Nathan P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-09-23", "description": "Side of meat. Lots of food. Was nothing to write home about, but also didn't hate it.", "author": "Andrew K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-07-05", "description": "Nothing special... thought it would be more authentic when i stopped by to eat there... \nbut more like a Chipotle fast food style... the salsa station and food station didn't look that clean not sure how fresh ingredients are. Staff wasn't particularly friendly or helpful. Got a chicken burrito - got it \"spicy\" but not spicy at all... hardly any flavor in chicken so i had to add bunch of salsa. I didn't want to finish it was not that good...\n\nNot impressed not going back.", "author": "jess c."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-02-17", "description": "I came here for dinner and ordered the super burrito with carnitas. It was pretty standard, so it was pretty good. The carnitas was perfectly cooked, but the tortilla ended up being drenched in its juices. It was a pretty cold night, so I wanted a Mexican chocolate, but they didn't make any that day. :(\n\nThe upstairs seating was very cute, and the workers were friendly.", "author": "Rachel H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-05-10", "description": "Decent little Mexican place in an area not known for its Mexican cuisine. I'm glad you're open when you are...coming home late from work this is my go to.  The pastor tacos are rico. I assume most people don't eat anything other than burritos here....I suggest trying everything but the burritos.", "author": "Matthew F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-05", "description": "Mmmm Mexican food. \n\nI ordered a burrito with carnitas, beans, rice, guac, sour cream, lettuce. I forget the name of it. It was a little pricey, around $10. Free chips which was awesome and fresh salsal (mild, medium, hot) available to serve yourself. We grabbed to go cups for the salsa and went on our way. \n\nMy burrito was very yummy. Huge might I add. My complaint was the sauce. It was a weird sweet flavor that just didn't pair well with the burrito.The guac and sour cream was also put on the outside of my burrito which I wasnt a fan of.", "author": "Laura G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-07-05", "description": "Went in for an early lunch on Saturday. \nWe ordered a torta and the huevos rancheros. The woman who took my order corrected my pronunciation of conchita pibil, which I guess was super nice of her. Then she asked if we wanted cheese on the huevos rancheros. Yup, sounds good thanks.  Beans? Black. Torta spicy or mild? Spicy please. Really? You bet.\n\nShe handed me my charge slip to sign. I put in the total without the tip as I always put that in the jar, which she saw me do. Just saying.  \n\nWent upstairs to eat our complimentary chips and salsa and do the crossword puzzle while waiting. Then we looked down and saw that our order was up, so the kid went down to collect it. She had some discussion while I was trying to figure out a crossword clue. Then she lugged the tray up the steep stairs. Thank you kid;  my knees are not so good anymore.\n\nWell? It was ok. The conchita pibil was really good, but for me a torta needs more than meat on an untoasted cold bun. I am looking at pictures of other people's tortas and that is not what we got;  no lettuce, no cheese, no tomato, no avocado. Kid reported that she had to ask for them to please give us jalapenos and was told they were 'too spicy.' She said she had to insist, and in the end got them on the side, so we put them in the torta ourselves. That was weird. I kind of wish she had insisted on all of the vegetables and a toasted bun too, but I guess after the difficulty getting jalapenos she gave up. \n\nThe huevos rancheros were fine, with a tiny sprinkling of cheese. I put the stellar green salsa all over them and that green salsa could make a shoe taste amazing. \n\nYes, I actually do think I'd go back and just be really really clear about how I want everything prepared. I kind of think the problem was that it was a Saturday and early, as all of the ingredients were really good, just not put together well.", "author": "El B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-09", "description": "I was impressed with La Fonda. I got a chorizo taco and an huevos a la mexicana. Both of these dishes filled me up easily. The prices here are also very reasonable. I would say it's a great value for the amount of food you get and the great taste. They also have a salsa bar with three or four salsas to choose from.", "author": "Lynn T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-09-21", "description": "Do you like bland food? Love sub-par service? Cold pre-made food? Being charged 25 cents per salsa cup (the small thimbles that most eateries give you 20 of) if you go over the two that comes with your order? THEN THIS IS THE PLACE FOR YOU!!! Go to the Mexican stand in Tart to Tart - that lady is super nice and the food kicks this places ass.", "author": "Cat S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-08-21", "description": "So disappointed- they charged me for guacamole and sour cream and I got home and there was none. The quesadilla lacked CHEESE. I just don't like the vibe of the place, not very friendly, not well kept, and now food is just sub-par - good bye.", "author": "Claudia V."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-02-18", "description": "I went here for lunch and orderd the Azteca Burrito with chicken and black beans. The burrito was huge and covered in sauce. The grilled chicken was good. The rice was slightly over cooked. I liked the salsa bar. The salsas seemed very fresh.\n\nSeating is a little cramped. Water is self served. You order at the counter and pick up your food when your order is ready.", "author": "Alexander L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-29", "description": "This is our go to Mexican place in the Inner Sunset. Solid food, good service.", "author": "Susan B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-18", "description": "Good neighborhood Mexican restaurant. Everything is always fresh and the staff are friendly and efficient.  I have to admit they have drastically reduced their portion size recently. Maybe they have done this to avoid raising prices, but the servings are pretty skimpy now.", "author": "Faye M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-11-06", "description": "One word: BLAND\n\nI've had La Fonda a few times in the past and never cared for the food. But today I decided to try it again since it has been over a year and I live really close to the restaurant. And once again I'm disappointed. Seems like they never use salt for anything. The steak was bland & so was the rice leaving me a tasteless burrito that I needed to smother with hot sauce.\n\nI won't be back!!! I've gave this place to many chances and I can get a burrito somewhere else that's also fairly close.", "author": "Nicole V."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-01-31", "description": "If i can give this place a 0 star I would.....  #1 Rude owner And staff. #2 nasty food. Doesn't aim to please the customer any way around. And i am a real honest reviewer..... So take my word. Yuck!!!!!", "author": "Lisa N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-02-23", "description": "Lately I have noticed that if you don't tip, or if you do tip but they don't see, your burrito sucks. ( very think extra tortilla hanging off) and they jip you on chips ( two separate orders, still one tiny bowl of seriously 7 chips) Am I really controlling the outcome of my food based on whether you SEE my tip?!\n\nThey still haven't improved their attitude ( not friendly at all) and don't even say thanks when you do tip. Knowledge on customer service = zero.\n\nI've decided this place isn't worth it, the atmosphere isn't welcoming so enjoying your food is tough.", "author": "Anna B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-01-14", "description": "Giving two stars solely based on quality of food. Portions good - got a super burrito, but just tasted very, very ok - for 8 bucks.... there are better options for a few extra dollars around Irving.", "author": "Henry H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-02-26", "description": "Two out of our three orders were wrong. My burrito was ice cold. Tortillas were barely cooked. The flavors were all around terrible. Poor excuse for a Mexican restaurant. Don't even bother...", "author": "Rob M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-04-12", "description": "Found a really big, sharp chicken bone (see pic) in my burrito a couple bites in. Was a little nervous to eat the rest so I just showed the woman at the counter the bone and asked for a refund. She refused, said I can have something else. I explained I didn't want more food from here just a refund but she said no refund. Will never come back completely unacceptable. Not to mention dangerous.", "author": "Kelsey C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-05-02", "description": "Like other people have noted here, they are very cheap with the chips, and they are not generous with the portions if you don't tip, and they do this really annoying thing where they throw your burrito in the microwave and nuke it for a minute on the plate or in the container to make it hot.  One time I hadn't known that they did that and I almost burned myself picking up the plate!\n  I told the waitress about it once and she gave me an annoyed look.  Tell them not to do that with your food and see how they react.  :)\n\nThe good:   The sauces are very nice, and the azteca burrito is great for the price. I absolutely love the tomato salsa with the cilantro and onion!   And the tomatillo salsa is very nice too.\n\n A tip to the cashier:  I think she could use a little bit of an attitude adjustment, because she doesn't seem to really care. But on the whole I have overlooked all that for that tasty burrito!  Mmm mmm!", "author": "Sarah L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-01", "description": "Stopped by here looking for a quick bite to eat late at night and I was super surprised that I liked it. I love Mexican food and usually trek over to the mission to get my fix. I would give this a four star rating for Mexican food in the sunset. It's a little pricey and they skimp a bit on the meat fillings but overall the taste is good. I also love a decent salsa bar and their pico de gallo was pretty tasty. Chips were ok but I think they buy them from elsewhere.", "author": "Alice H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-26", "description": "I'm along time  local of this hood and have worked in the restaurant industry nearby. Inner sunset doesn't have great Mexican. Sorry folks. Taco shop at underdogs is probably the best, which is a bit sad since it's a sports bar. But the bad reviews here are un-justified. I've eaten here tons of times over my years in the hood. It's not the best in town by a long shot but it's good. A tiny bit hit and miss but pretty darn solid. The panuchos and sopes are great. Burritos are big. You won't be disappointed if you just want some simple California taqueria fare.", "author": "Art V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-05", "description": "Even when there are a lot of people lined up I know I'm going to get my food hot and fast. I usually get my good to go, but even when I dine in alone it's a good experience.\n\nThe prices here are not bad, and I always feel like I'm getting a good deal. When I dine here alone I never tip and the staff has never mistreated me or my food.", "author": "Coltin C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-02-18", "description": "I was looking for a Mexican restaurant on Irving St and we decided to give this place a try. While I respect this restaurant for having a number of vegetarian selections, including burritos with tofu, I wasn't happy with what I chose. I ordered the Chile Relleno burrito. It was really greasy! It also seemed to have too much cheese and not much flavor. I included a pic where you can see all the oil coming out...\nMy friend got a basic chicken burrito which he found dry and somewhat bland. \nIn addition, they have an upstairs eating area which is cool. But it overlooks the grill and there was a ton of dust on top of the grill machine! They should really clean it up.", "author": "Greg C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-11", "description": "I tried La Fonda for the first time last night and loved it. I'm not vegetarian, but I saw that they had 5 types of vegetarian burritos so I ordered the steamed broccoli burrito and it was delicious (steamed broccoli, cheese, rice, beans). Their salsas are also great, and my burrito came out quickly. I would definitely go back.", "author": "Brooke R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-04-29", "description": "In the Inner Sunset I can't think of another place that serves better Mexican food than La Fonda.  I've only eaten here twice, both recently, but I've enjoyed my meals here.  The staff is nice, the restaurant is clean, the portions are filling and the food is very good.\n\nA big bowl of complimentary chips come with each meal and you can help yourself at the iced down salsa bar which features two types of red sauce, a tomatillo sauce (my favorite), whole jalapenos, chopped onion and chopped cilantro.\n\nOn my first visit I had an enchilada plate with chorizo (http://www.yelp.com/biz_photos/GPK6hwD_EGKCRVD1cWESig?select=w_ny-F33_YCddhpWBQL5fQ).  They offer you a choice of beans and I chose the black beans which is my default choice.  The enchiladas here are not rolled but are actually just meat inside a tortilla folded over like a taco and smothered in cheese and enchilada sauce.  The chorizo was very good with just a tad of kick.  I prefer more spice and found one of the red sauces in the salsa bar perfect for developing a little moisture on my forehead.  A small side of fresh, chunky guacamole is served on the side.  The guac here combines ripe avocado with chunks of fresh tomatoes and chopped onions.  It, too, was very good.\n\nOn my second visit I decided to try La Fonda's version of a wet burrito.  More often than not I tend to like my Mexican food smothered in cheese or smothered in sauce so whenever I dine in the chances are fairly high that I will order something smothered in cheese or sauce.  In this case my Azteca Burrito was smothered with both (http://www.yelp.com/biz_photos/GPK6hwD_EGKCRVD1cWESig?select=JwWhOT74QTXoIYrC81Cslg).  I ordered it with broiled steak and whole black beans.  The steak is precooked, chopped and reheated on the grill upon ordering.  The preparation time was very fast even with a steady flow of customers coming in.  The modified enchilada sauce had some nice spice to it and the burrito was overstuffed and wrapped up plump.\n\nFor hydration La Fonda carries many of your favorite beers and they have several varieties of agua frescas.  For me though I like that they have Mexican Coke and several varieties of Jarritos Mexican soda.\n\nFor excellent Mexican food you can find me somewhere in the Mission, but if I'm in the Inner Sunset and I feel like having above average Mexican food then La Fonda is my preferred choice.", "author": "Wilhelm Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-19", "description": "This is one of the better taquerias in the city, and compares well with Cancun, Farolito, El Toro, etc down in the Mission.\n\nI think they favor a slightly different style than those other places, and that may be some kind of regional thing.  They have a few items on the menu which seem sort of exotic in comparison to the standard carne asada/carnitas/pollo asado burrito lineup.  \n\nI like the alambre, which is bacon, grilled peppers and onions served with tortillas.\n\nThe seating can be a bit cramped during peak hours, which are typically 6-7pm.\n\nIt looks like a few princesses below have given them some bad reviews for the service, but I've never had a problem here.  It's an order-and-pickup-at-the-counter sort of place, so I'm not really sure what the problem could be, except that maybe some people expect a counter person to kiss their ass a little bit while they deliberate over whether or not to get that burrito wrapped in a plain or spinach tortilla.", "author": "Gopal R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-07", "description": "Pretty good and fast burritos.  They are super friendly and the burritos are large!  They have a salsa bar for dripping onto your awesome burrito.  The amount of chips provided is on the light side.  The plates are good too.", "author": "Ryan I."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-11-05", "description": "I have come to eat here quite a few times always hoping that they will have better customer service. I have yet to be treated well by the staff here. They are always rude and in a hurry to get me out the door. I have never had this sort of experience at any other restaurant. Their food is fine, but the bad attitude keeps me away.", "author": "Todd A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-06-04", "description": "Well... I had a bite.\n\nMy friend ordered a burrito and got some guac on the side.\n\n- Sorry ya'll, that ain't no god damn guac. Ya... its got avocado and tomato and onion.... but way to bland. I am a mexican... you gotta make me proud.\n+/- Burrito was okay too.... just okay. Kinda soggy.\n\nThats all I can remember.....I am still on the hunt for a good mexican place in SF. Since I come from the east bay, I have a feeling it's impossible to find the place that has the best tacos. Only thing my bf has found is a taco truck at his work downtown.", "author": "Julia D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-10-26", "description": "The service is incredibly slow and the quality of the food does not make up for it. The burrito was wrapped in such a rush that it completely fell apart. Have given the place a few tries but it's been pretty much the same every time. Definitely not coming back again.", "author": "Eric J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-06-07", "description": "BOOM! \n\nSensational burrito from the first taste to the last bite \n\n(well, it was for me- I could only finish half of it the \"Azteca\"-it's huge!)\n\nReally fresh ingredients, super-tasty burritos and probably the hottest and best homemade salsa on their salsa bar. \n\nThey also give you a generous side of warm, homemade tortilla chips\n\n(because you might have a tiny space in your pinkie to pack them away after eating the burrito)\n\nDelish!", "author": "Jennifer O."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-02-26", "description": "The customer service is neither good nor bad, the food lacks freshness, The taste is OK..I was wondering,while giving my order, if the cleaning is on fleek thought?? maybe the price is interesting but I prefer to pay more for a better food quality... I hope that the comments will help them to get better, but until then, I'm getting my tacos somewhere else..", "author": "Ka L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-28", "description": "Nice spot in the Sunset for Mexican/Cuban food. \n\nQuick and Great Service. \n\nFood was good overall. \n\nNothing to write home about but i would definitely grab a bite from here again. \n\nI had the Torta Cubana and was impressed with my order.", "author": "Matthew M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-29", "description": "4 stars- not becasue of ambiamce or the interior. It is the food!! It's amazing!!\n\nI'm typically not a big fan of mexican food, but I found a place that I actually crave. I always get the super shrimp burritto, its so delish. get it to go..", "author": "Muneera M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-08-21", "description": "Used to really like this place.   Came in for my usual burrito and the woman at the cash register started talking with her coworker about another order. Then she took my$20 and kept talking, not knowing that she placed my money into the register and was retrieving my change and placed a $10 bill on top of the money tray. When she stopped talking, she looked at me and said 'u gave me $10, right? I said , 'no' I gave u $20.  I think this is a 'scam'.  I looked at her and said it again and she  insisted that I gave her $10.  I let her keep the $10 telling her that maybe she shouldn't be talking while taking my order . I won't be coming back.", "author": "Teresa J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-08-29", "description": "Taken off 1 Star cos they're terribly Stingy with Chips & Salsa - I asked for some extra Chips & containers for Salsa & they looked at me as if I was asking them if I could draw blood!!! \n\nSeriously, what's their problem?! \n\nMy favourite Mexican spot in the Sunset District (Inner & Outer) they are perfect to satisfy any Mexican craving! Eat in or get it as a take away. Their super burritos are SUPER delicious! Add grilled mushrooms.. sooo good. Their quesadillas are also v nice.. Their Menu has  a wide variety of items which is nice apart from all of the usual staples - burritos tacos quesadillas nachos etc. Salsa bar and chips are delicious. Food is consistent and I come here on a regular basis for take-aways and I even prefer them to some of the places I have tried in the Mission. Its slightly more pricey but worth it and you can trust the food is good and not dodgy. They accept credit cards which is convenient as well. They are open late and I don't recommend bringing children - shouting children no good. This also probably isnt the place for ppl who are super particular cos everything is ready-made such as meat/rice/beans & they just put ig together for you.", "author": "Julian I."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-01-02", "description": "I stopped eating here months ago because I got sick two times in a row after having their tacos. The line at Gordos was slow so I figured I'd give La Fonda another shot. I asked for chilli verde on my burrito the girl at the counter snaps at me rudely saying they don't have it. I get a carne asada super burrito. A quarter of the way through eating it I open it up because I'm consuming nothing but mushy rice. The \"Super Burrito\" barely has any freaking meat I take it to the counter and let them know I won't be eating it that I literally opened it up to see if they put meat in it and they look at me stupidly no apologize or anything \"we only put a spoonful in.\" I was freaking hungry and did not pay for a tortilla and mushy rice. An $8+ burrito should include more than a spoonful of meat end of story. Really disappointing would like my money back.\n\nI'm editing this to let you guys know the quarter of \"burrito\" that I did eat made me sick. I use to love this place in college too bad it's no longer even edible.", "author": "Marisa M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-12-02", "description": "After living in Inner Sunset for over a year, I finally gave La Fonda a try.  The place doesn't look to big from the outside, but surprisingly, there is a second story with a good amount of seating, inside.  The menu is pretty standard for a Mexican restaurant and the prices are pretty fair.  It's not as cheap as some other Mexican restaurants, but it's by no means pricey.  \n\nMy boyfriend and I ordered a couple things to share:\n-Chips (free): nothing special, but I still liked them.\n\n-Super carne asada burrito (about $7.50):pretty large for one person to finish unless you're really hungry.  You get your choice of meat and beans.  It wasn't as hot as I would have liked, but it was fine.  The portion of meat was very fair, but the flavor of it was just okay.  \n\n-Special item (I think it was called cachula or something?) ($3.95): this was pretty interesting.  It was some spicy pork and pink onions sandwiched between two thick corn tortilla type pieces.  (I know that description wasn't that great, but it tasted pretty good).  I've never had this anywhere else before, but it was one of the specials, on a printed sign by the cash register.  My boyfriend really enjoyed the pork and we both thought it tasted good.  The weird thing is that we both had two intensely spicy bites from the dish- but the rest was only mildly spicy.\n\nOverall, the restaurant was really clean and the service was fine.  They call the name of the dish/item out when it's ready, so make sure that you're listening.  I'll probably be back at some point to try out other dishes.  \n\nNotes:\n-It seems like they do a lot of to-go business.\n-Self-serve salsa bar (3 types of salsa, onions, cilantro and peppers).\n-Self-serve water station.", "author": "Samantha L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-12-28", "description": "Had a negative experience .\n\nThe burrito was cold .  Three employees paid no attention to he during the ordering process. They assumed it was to go . They never asked , if it was for here . Think it's rude for the employees to be chit chatting while the customer is ordering . I did switch to spanish and was better able to communicate . \n\nI would not. Return ever", "author": "cole g."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-04-19", "description": "Disclaimer: I mainly come here for the breakfast burritos and huevos rancheros which are served all day.\n\nThe portions are usually more than enough, and the ingredients are tastier than Chipotle in my opinion. It's nice to have the option of Mexican food in the Sunset, where more restaurants tend to be Asian or Italian. \n\nOrders come with complementary chips and salsa, and the service is friendly but efficient. I'm used to not spending a lot of time here because I generally take advantage of the calling in and picking up my order. I have eaten here once with some co-workers in the upstairs area after a happy hour, so it's a good option for groups who need a clean space. It's not meant to be a particularly dine-y place, but I like it here and I'll keep coming back for the breakfast food.", "author": "Alice H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-10", "description": "- Azteca carnitas burrito was a beauty. Next time I'll get mas queso. \n- prices about the same as other taquerias in Sunset, especially for how much you get\n- clean\n- fast (they need to be - they're busy)\n- glad my daughter didn't see the free nachos or she wouldn't have eaten her beans\n- eating by an open window is almost as nice as eating outside", "author": "Scott J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-03-27", "description": "Restaurant is clean and welcoming, just like the neighborhood it's in. The staff are attentive and that's about it. I ordered a couple salsa selections with some old-ish chips, and huevos rancheros, which turned out to be delicious. Wasn't too sure what to do with my plates so I just left them on the upper level. Place looked good for small groups in the upstairs area and small tables downstairs. \nYou get your own water in plastic cups. Horchata was grainy and thick, if that's the kind you like.", "author": "Emma G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-10-17", "description": "I already had pizza at the Arizmendi bakery so wasn't super Hungry and my friends wanted to get Mexican. I got something \"small\", a fish taco and a flan. It was good, the salsa was fresh and the flan was alright.", "author": "Eleonora B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-11-20", "description": "Alright,  La Fonda the line in the sand has been drawn. Adios. I will not return and patronize this establishment again. \n\nFirst off, the food is just mediocre.   There is no excuse for sub-par Mexican food in San Francisco  but for some reason the inner sunset is the exception to rule.\n\nAnyways, I guess what really upsets me is the salsa policy. You are only given 2 togo containers to package your salsa. Is it wrong that I want a third?  Am I being excessive?\n\nThe only reason I want three containers is because the salsa I want you to add to my burrito is not behind the counter.  I like the green kind because it offers the most flavor. The \"hot\" is never spicy or hot enough. The mild is rather bland. Whats the deal? There is no other place in city that is this chincy with the salsa.", "author": "Joey L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-08-11", "description": "I don't think I'll be back. I have now ordered from her twice. Both times I called in the order and picked up. Both times I ordered a grilled chicken super burrito, it comes with sour cream, guacamole and cheese. Both times I was charged for a super burrito both times I got a regular burrito without sour cream, nor cheese, nor guacamole. So annoying. Maybe they do that because I'm picking up and I won't realize it until I'm long gone and  I won't complain? I don't know but I can't go back and find out. Plus the flavor is just blah. No thank you.", "author": "Rachel D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-08-21", "description": "The food is pretty good but-- Why is the staff so rude?  I consider myself a regular at this place because I love Mexican food and, unfortunately, this is one of the only taquerias in the Inner Sunset.  The workers are consistently annoyed, apathetic and just don't care what anyone thinks about their eye rolling, rude behavior.\n\nTonight I went in for a quesadilla and left with a WTF sour taste in my mouth.  Even though the staff is rude, they do offer free chips and 2 small salsa cups with each order. But tonight the lady declared that I could only have 1 cup because the price of tomatoes has gone up.  What?. \n\n I just spent $10.00 on a quesadilla (I was charged extra for wanting guac and sour cream w/ the meat and cheese).   I was there 3 days ago and received 2 cups... for the past 7 years, I have received 2 cups.  So why is it different tonight?  Because the rude person working the register made a decision that the price of tomatoes are too high to give me another teaspoon without charging me extra.  She said it with a straight face-- even though she recognized me from the many other times I'd been there. She knew that I knew better but she looked right thru me.   WTF?\n\nThis may sound like I'm being picky but it is part of the larger problem-- The staff at this place is so rude.  So off-putting.  So angry at you for wanting to patronize the establishment.  How dare I voluntarily pay $10.00 for a basic quesadilla and expect to receive the same chips and salsa that is routine.  How dare i?\n\nPlease-- will someone open up a new taqueria in the Inner Sunset? Please?  This place obviously doesn't want to be in business anymore.  \n\nAnd if the price of salsa is too high to offer it gratis to your customers anymore then please put up a sign to tell us about the policy change.  But if you can't afford the price of salsa maybe it is time to get out of the Mexican food business.  That may be best, all things considered.", "author": "Niki G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-11-24", "description": "Prices have sure gone up since the summer. An Azteca burrito (which is the only thing I get from here, I did get tamales once but I'd rather stick to this) would cost about $6 something a couple months ago but now it's $8!!!!\n\nI can only come here with a coupon, if I don't, I would feel jipped.\n\nInstead of costing around $10 for 2 burritos, 2 drinks & complimentary chips & salsa, it's closer to $13.", "author": "Kylie L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-30", "description": "Best burrito in SF\n\nFirstly, let me say how rare it is to find a place which includes a full (mini) basket of free chips with a burrito... This alone puts it above most Mexican restaurants and taquerias in the city. Next, the salsa that also comes for free in a mini salsa bar is both flavorful and fresh! I had as my main entree the super vegetarian burrito which (at the time of this writing) was under $6 and it's medium size was a good value for what you're getting. The refried beans had flavor and seemed like they cared about vegetarian needs. They also had a large menu of other vegetable burritos which made me want to come back and try those. So far it's the best burrito I've had inside of SF, which for a good city is seriously lacking in Mexican excellence in is food. Normally I have to drive outside of the city to Alameda to find a really great burrito. This is a good local place.", "author": "Curtis M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-09", "description": "I am quite picky when it comes to Mexican food but for Inner Sunset, this place does it! Plus, you get complimentary chips and salsa, so you can't beat that. Note: the salsa could be more spicy, don't get your hopes up.\n\nThe burritos are large and taste really good... I really like the Alambre (skirt steak, cheese, onions, bell pepers with 3 tortillas), which for $5.50 fills you entirely! You can order for take-out; I prefer to take my food and eat upstairs.", "author": "Marissa P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-04-01", "description": "Average is the only way to describe this place, not impressive. I came here after craving some Mexican and being around the area at the time. The place had a decent amount of seating and appears good from the outside. To start of I decided to order a shrimp quesadilla and super burrito with carnitas. The quesadilla was for my gf and she said it was not too bad and was happy with the available option of a wheat tortilla. For me on the other hand I did not enjoy my burrito and finished about half of it before throwing it away. A big deal breaker for me is fat in my meat, I had to spit out the meat 2 times in a span of three bites due to large chunks of fat in my burrito, this is not only disgusting but ruins your appetite since your analyzing every bite from that moment on to check out if there is fat or not. I was pretty upset with the flavor as well, no savoriness or flavor in the meat, when I added salsa to it that was about all I tasted aside from the black bean, bland and gross. The chips were good and thankfully provided me some satisfaction along with the salsas. \nI don't recommend this spot, there are dozens of different Mexican places you can check out that are much better.", "author": "Josue V."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-12-03", "description": "My first visit and I have mixed feelings already. To me, the test of a good Mexican place is the mole. Unfortunately, the legendary sauce here is just not up to par.\n\nWhy oh why?! Not that it's bad mole. I would say it's just ok. It needs more spices, more chocolate, it needs something. Its taste was just too bland, which makes me wonder how that happens since mole had all that chile and nut goodness, not to mention the chocolate. \n\nThere was some light at the end of this tunnel, though. The chicken the mole covered was delicious - tender and juicy. The sopas were also pretty yummy. And my hubby's cochinita pork was delish. The salsas are fresh and the horchata was pleasant.\n\nOverall, ok experience. I would eat here again, but I would skip the mole.", "author": "Yelena K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-07-08", "description": "Stopped in for a quick lunch -- food came out quickly and tasted pretty good. I had the Azteca burrito with carnitas and refried beans.\n\nThe person taking our order wasn't terribly friendly and seemed annoyed that we wanted to order. I asked for spicy but the burrito wasn't spicy at all.\n\nAlthough it's a small restaurant, they have an upstairs with more tables.", "author": "Allen W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-28", "description": "Delicious variety of fresh salsas. Homemade chips that weren't too salty. The chicken fajita burrito was excellent. Extremely delicious value play", "author": "Scott T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-04-04", "description": "Food was alright, I could have easily given this place 3 stars but the women working the counter was beyond rude. She never told me my total just stuck her hand out to receive my payment. I asked her for a cup for water and she just shoves an empty cup in my face and doesn't even tell me where I can get water from. \n\nThe ambiance is that of any other small taqueria.  The upstairs seating is muggy and hot, a lot of the tables were off balance which made for an irritating and unpleasant dining experience.", "author": "Angelica  C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-02-01", "description": "I hope the owner of La Fonda reads this. I'm a Sunset local who has been eating here since they opened. The first few years I would have rated it 5 stars, but in the last couple of years it seems the ownership have shown a total lack of interest in keeping this restaurant successful.\n\nI usually order the cochinita super burrito, with chips and salsa on the side, and a Mexican coke. Then I liked to sit outside on sunny days and enjoy the people walking by as I ate. There was also a really sweet lady that use to work behind the counter, I think she lived on 8th Ave., the same block that I did at the time. She would always smile and chat a little, and I felt welcome like there was a true neighborhood vibe about this place.\n\nSo here's my experience in the last couple years:\n\nNo more chairs and tables outside, I guess the city didn't want them on the sidewalk anymore, but I wonder why the owners did not apply for a parklet seeing as this would be a great benefit to their customers? Many cafes, restaurants, etc., have been putting them in all over the city, and the program is great! \n\nAfter many years the nice lady that worked the counter is not there anymore, and the new ones are not friendly at all, some even have a grumpy attitude like they are doing you a favor to take your order. Maybe they don't get paid as well anymore, but I always tip them no matter what.\n\nThe decor of the place is badly in need of maintenance, the planter outside is beat, the window frames and walls are damaged, and need painted, hardwood floors need refinished, lights are out and dirty, and the whole place needs a deep cleaning and degreasing. It just looks grubby and not kept up like a food serving establishment should be.\n\nLastly, and most importantly, the food. I have noticed a sharp decrease in portion size on my super burrito, I don't know if that is the person making it, or the owner has told them to take it down a couple notches to save money? Also the chip portions are now smaller too. I used to walk out of here stuffed, sometimes couldn't even finish and would save some for later, but not anymore. I felt like the super burrito has become the normal burrito and was missing the extras that I payed for.\n\nWake up La Fonda, don't let things slide much further, it's obvious. I won't be going back until I notice some changes for the better.", "author": "Aaron C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-07-29", "description": "Food is very mediocre, but what really brings this place down is the service.  The counter staff is not friendly and routinely gets my order wrong - virtually every time.  It's very possible the issue is that they are understaffed on weekdays so it's understandable that the counter staff would be grumpy and inattentive (they're ringing up and assembling orders AND cooking simultaneously in most cases).  They never seem to have anyone busing tables either, so if you eat in you are dodging spilled salsa and old plates that haven't been cleared away.  \n\nHoping things improve so I can write a positive updated review!", "author": "Jill H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-06", "description": "I really like this place.  The empanadas are wonderful.  Staff are helpful and friendly.  A cut above the standard burrito place.", "author": "Sam M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-01-09", "description": "Nachos and traditional burrito were ok\n\nCramped seating and the service attitude is only so so. \n\nPrice was moderate.\n\nWishing we would have found something better...", "author": "Patrick S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-21", "description": "Best al pastor in the neighborhood. The ladies who own the place can be a little standoffish, but you get used to it. Free chips/salsa, which differs from Gordo down the street. Solid spot.", "author": "Alex S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-12-17", "description": "The background: Mexican food restaurant that's not quite a fast food type joint, but not quite a sit down restaurant. Has a standard Mexican menu (buritos, fajitas, tacos, nachos, enchiladas, etc) and reasonably priced. \n\nThe details: The food was well OK ... unfortunately somewhat bland, nothing special or mouthwatering. I got a burito and the carne asada was ok, the rice beans size ok. I can't say terrible things about them or terribly great. Although, I would prefer eating a burito bowl at chipotle, but sometimes you just are in the neighborhood wishing for carne asada. \n\nFYI - there's seating upstairs, but you'll be forced to carry your burito, chips, and drink up the stairs on a tray so be careful... my burito almost went flying because the staircase is narrower and steeper than most.  Also - if you're on the journey to find Orange Bang in the city - this place will not have it! \n\nThe verdict: It's good for hey it's lunch time I'm hungry and it's right by work or school. I wouldn't NOT come here again, but I wouldn't go out of my way to come here.", "author": "Christine B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-06-05", "description": "Dirty tables and sticky walls. \n\nWon't be back.  I DONT like La Fonda's Beef! It tastes frozen and old. \n\nYou have to pay 1$ for a soda refill?? REALLY? My first cup was ALL ICE!! \n\n\nTHE FEMALE WORKERS NEED TO WORK ON PEOPLE SKILLS! so rude.", "author": "Andrew V."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-03-23", "description": "Not sure if its intentional or not, but La Fonda feels a lot like a wannabe Papa Lote - the bright colors, the fonts on the menu board, even the weirdly long and totally unpractical layout for a dine-in restaurant.  When it comes to food though, La Fonda and Papa Lote are miles apart... \n\nFIrst the good.  The chips are very good - deep fried but not too oily and not too thick or thin.  The red salsa was also excellent, some sort of smoked tomato salsa with tanginess and a kick.  The chilaquiles we had were overall OK but had a fantastic red sauce (different from the red salsa) - would love to see if they make that themselves of buy it from the outside.  FInally, the chile relleno was pretty tasty - nothing too unique, just an overload of cheese and pepper, but tasty nonetheless. \n\nAnd now for the bad.  The shrimp fajitas were pretty throughly terrible, with under-cooked shrimp (too crunchy and fishy) and that lacked any flavor - I feel like they should have either made them much richer (with butter/oil) or spicier (garlic or chipotle or even just salt/pepper), but apparently they chose neither.  In both dishes we ordered the rice and pinto beans were both also very bland, which pretty much seals the deal on this place - a burrito place with bad rice and beans is like watch that can't keep time, all style and no substance.  \n\nAll in all a star for the salsa and chips, a second for the awesome chilaquiles red sauce...and that's it.", "author": "Rosers M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-01-13", "description": "There is no reason to go back here. I went while watching the NIner's game next door at Yancy's to get something to hold me over until dinner. Ended up paying $7 for nachos that were essentially just chips and beans, with small traces of cheese and guacamole. REALLY?! How hard is it to screw up nachos?! \n\nMy husband got a Torta and was also underwhelmed. Food was bland and nothing to write home about. WIshing we had grabbed pizza instead from next door.\n\nSave yourself from the mistake and go somewhere else.", "author": "Kate V."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-05-18", "description": "Dirty tables. Screaming babies. Apathetic employees.\n\nThe food is top drawer, though. Really cheap, and they have crispy shells, shredded lettuce, shredded chicken, and big tomato slices. I'm used to \"Mission Mexican\" in SF, which seems to focus on authentic tacos with uncooked corn tortillas, cilantro, and white onion. That's why I like La Fonda -- I like the gluttonous touches of Americanized food. It doesn't hurt that they serve free chips with a salsa bar. \n\nThey also have horchata drinks that are kind of amazing. I'm told they come in three flavors, lime, watermelon and cinnamon, though I've only ever seen the watermelon and cinnamon. I've tried both, and the cinnamon is too sweet for me. The watermelon is fabulous.", "author": "David S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-02-25", "description": "Great Mexican food on Irving street? Is that like saying republicans in San Francisco (FiDi and Marina excluded)?\n\nI was helping my buddy put together some IKEA furniture (woohoo?) and we went to grab some food down the street. \n\nLa fonda mexican grill was bright and colorful inside. It was even...dare I say...clean.\n\nI don't mean to hate, but most Mexican places with killer food are notthe cleanest places on the planet. \n\nI really liked their space. They had 10 or so seats downstairs and an upstairs area. \n\nI had the Azteca burrito which was 6.20 but they had a 4.95 one.\n\nThe azteca burrito, which is essentially a wet burrito was INSANELY good. \n\nI am definitely taking the N back to this place. \n\nKudos!\n\nI mean...felicidades!", "author": "Carlos A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-04", "description": "Decent Mexican food at decent prices. There's lots of kids here. They are actually really nice and helpful.", "author": "Genevieve B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-02", "description": "I normally go to Gordos (nearby) but was suggested to try this place. Got the steak super burrito. It was great and I will definitely be back.", "author": "James P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-07-02", "description": "Terrible food. I can't believe I made the mistake of coming here twice. Food has no flavor, meat is dry, and it reminds me of food I ate at my college dining room.", "author": "John C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-11", "description": "One of the best Mexican food around, I always get their tacos and they are delicious and hot. Highly recommended if you're in the area.", "author": "Zade T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-04-04", "description": "Good food but the service was horrible!! My son requested a side of scrambled eggs and the cashier said that couldn't be done. They had at least three items on the menu that came with eggs and she couldn't figure out how to charge for 2? Just overall not very friendly.", "author": "Erika E."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-05-09", "description": "Went to a school event that this place catered... Can't remember the last time that I've been so sick from a meal!!! I had so much bloating and stomach cramps for 2 days after eating food from La Fonda. Don't put yourself through it!", "author": "EmyMig L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-05-09", "description": "Horrible service! The cashier/counter person didn't crack a smile.\n\nI just spent $9+ on a burrito and I was given 2 (2 oz) plastic containers for the salsa bar. I asked the woman at the counter for a 3rd container and she gave me a dirty look, so I told her it was for onions (as if it mattered what it was for). So, rather than giving me the container to help myself, she turned to her salsa bar behind the counter to fill it herself. She treated me like I was going to steal extra salsa - REALLY? Then she said that orders only come with 2 containers - for next time. I told I'm not coming back next time because she was so rude. She just shrugged and turned away.\n\nAs for the food: my burrito was mediocre tasting and it was supposed to be \"super\" but it was so small and I couldn't find the guacamole. There are so many better places to get a good burrito in SF. There's no room for the rude service. I'm never going back even if the food was free. If I could give NO STARS, I would !!", "author": "Charlene S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-02-11", "description": "I've gone here a few times over the past year. The service is always great, very friendly and on top of it. The food is also always great. \n\nI love the fact that they open up the entire store front window in good weather, nothing like sitting inside, but also outside at the same time on those rare sunny days. \n\nHorchata here is wonderful!", "author": "Meghan L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-15", "description": "This is by far the best option in the neighborhood for cheap mexican food.  The burritos are decent, the tortas aren't bad, and they serve their breakfast options all day which is always nice to see.  Don't expect to be blown away, but if you're looking for a quick burrito in the Inner Sunset, this is where you need to be.  Just don't get the nachos, they're the only things I had here that I was really disappointed with.", "author": "Joshua W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-22", "description": "Our favorite dish here (me and my husband) are the tamales. Definitely. \n\nNo, it's not the best mexican restaurant ever. But it's pretty good, and consistently delicious. The salsa bar is yummy and the chips are fresh. I've been here several times and each time I come, the food is tasty. I never walk away hungry. \n\nIt beats trekking all the way to the mission and given the lack of latin options on the West side of town, La Fonda hits the spot for me. \n\nAny place that makes fresh chips and salsa is always a bonus for me.", "author": "Joanne D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-01-03", "description": "Steak quesadilla delicious. Last time I told them no green onion and chives and what do I get? chives and green onions. Blah! \n\nChips are dry. Sauce is self served. I always wanted to sit on the 2nd lfoor, maybe next time.", "author": "Jess W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-24", "description": "I love La Fonda.  I eat here at least 2x a week.  The beans are vegetarian, most everything is made in house, the food is clean and good.  They are super nice to me, and I'm a total pain in the butt.  I modify my burrito all the time and they are always accommodating and friendly.  They always use fresh ingredients.  Seriously the best burrito place in the inner sunset hands down, everyone I bring here always loves it.", "author": "K S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-25", "description": "Food was on point, nothing to complain about. Hidden gem, make sure to grab a bite if you're in the area. Great prices, hole in the wall Mexican spot.", "author": "Saul L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-11", "description": "La Fonda was a staple for me when I first moved to The City.....I lived on 11th and Irving, and just happened upon this place.....Since that day, I have eaten there about 20 times during my year in San Francisco!\n\nThe shrimp quesadilla is, hands down, the best I've ever tasted!....And, I grew up in Southern California!\n\nThe atmosphere is nice, and the staff VERY friendly!\n\nI can't wait to visit San Francisco again, so I can go to La Fonda!", "author": "T. G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-11-11", "description": "Quick, fresh, cheap for a burrito the size of a lady's foot (weird analogy...Err I mean about 7 inches long, 3 inches wide) with a side of chips and help yourself to the very good salsa bar. It's average though because it just didnt taste like much beyond olive oil. Which is delicious.why did it taste like evoo? They must cook their default rice in it to keep the vegans happy (that's pronounced \"vedge-uhns\") \nThat may also be my fault because I only had the veggie burrito with pinto beans rice guac cheese crema and lettuce. It was only $5.70! That's a deal when in SF.", "author": "Libra J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-11-18", "description": "[M]ona: 4 Stars\n[W]ayne: 3 Stars\nAverage: 3.5 Stars\n\n+ Big portions\n+ Super Filling\n+ Accepts Credit Cards\n+ Coupons\n\n- Super tiny bathroom\n\n[M] I've been here a couple of times but my most recent visit was with Wayne and my buddy Kylie L. La Fonda is a cozy restaurant but with not many tables and seatings available. Fortunately, there are 2 floors. You can choose to either sit on the upper level and enjoy the view on how they prepare your meal from above, sit on the main level which you will most likely be bumping elbows with one another, or the outdoor seatings where you can enjoy the sun a little bit. We usually sit on the upper floor.\n\nI love the burritos here. They come in large portions that is made big enough 2 people to share. I decided to get my own this time and ordered my usual Azteca Burrito. It is an enormous wet burrito which includes meat, rice, guacamole, sour cream, beans (I usually hold off on that), and fresh salsa, You also get tortilla chips on the side with your choice of salsa, and jalapeño peppers. Wayne had something similar to mine except it didn't have the sauce on top. Both burritos were very satisfying and flavorful. \n\n[W] The pork in my burrito was a bit on the dry side.\n\n[M] I also had a horchata drink which comes in 3 flavors: watermelon, lime, and cinnamon. The cinnamon is my favorite and I have to order it every time. Kylie on the other hand likes their fruity ones like watermelon. Other than horchatas, they also have Mexican soda here too! Wayne tried the orange flavored one and it just tasted like normal orange soda to me...\n\nBig Portions + big flavor = 4 stars. We will be back again!", "author": "Mona C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-10-28", "description": "I had food here yesterday and the food was ok.\n\nI decided to eat here again today, but what a mistake that was. The service (a girl named \"Laura\") was extremely rude. I've never experienced anything like it. I decided to leave without placing an order and she was happy with the outcome.\n\nI went to the shawarma-place on the opposite side of the road, where I was welcomed with a big smile. What a difference.\n\nMaybe this is her way of punishing her employer?\n\nIn either case: I'm never coming back.\n\nWho knows what they'll do to their customers.", "author": "Peter T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-02-23", "description": "Blandest burrito ever.\n\nImagine a present day rest home and the residents are gearing up for a rowdy burrito night. They tremble in anticipation -  or meds - or any number of maladies as they are wheeled into the dining hall. The al pastor burritos come out completely void of any spice and the pork itself is a boring shade of gray. After the first bite the rest of the meal goes down mechanically - no joy, but just as a means of getting sustenance. Plates go back more than half full and even the salsa bar cannot save them.\n\nThe end. \n\nI am not in a rest home yet, but that is what went through my mind during lunch today. Expectations were fairly low, the staff was nice and friendly, the place clean, but I will not be back.", "author": "Easwud C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-27", "description": "Tasty empanadas and fajita. A walk in taqueria as there is very little street parking availabe on Irving Street near Golden Gate Park 9th Ave. Few tables so recommend coming during non-rush lunch hours 230-230pm.", "author": "Clifford W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-02-10", "description": "I dunno how this place has so many stars.. \n\nBefore moving to the city I just assumed all food in sf had to be at least decent. But this place is expensive (for mexican food) and definitely below average. \n\nMy friend and I got a burrito here and I think any other mexican food would taste better and be better priced.", "author": "Devin B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-03-30", "description": "Terrible food and extremely bad service. They gave me wrong food and when I complained, instead of offering to correct it, they made faces. \nIf order the steak fajitas or any other, it will be full of rice and beans and couple of small pieces of meat.", "author": "George S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-02", "description": "Decent burrito. I recommend the broccoli. Seems fresh. Great salsa bar. OK service.", "author": "Grey Z."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-05-02", "description": "The food here is extremely mediocre.  It's hard not to be a snob about Mexican dishes in California.  So like I said; mediocre.  \n\nThe service is prompt, and the staff are friendly.  I shall return, and you will get off Yelp and go NOW!", "author": "Jonathan B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-05", "description": "Really awesome al pastor burrito.  I actually am disappointed I didn't find this place sooner as I've had to resort to Gordo's Greed shack (charging for chips??) complete with mediocre food and crappy attitudes at any of their locations.   Convenient burrito places are kind of hard to come buy in the Sunset , especially as you get into the outer - so it's good to have options.  Maybe the super burrito here might be a bit pricier but you'll get chips with it, a burrito that is memorable, and little to no attitude from the employees.", "author": "Fritz S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-04-05", "description": "Mediocre Mexican food.  Nothing worth coming back for.  Price is irvingesque.  Had the camarones tacos for $3.80.  Dem Wer purty small shrimps.  Worth $2.00 instead... I wouldn't come back unless uber hungry for Mexican.  Sorry but Gordos is just as average.", "author": "Joel M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-06", "description": "I am going to miss this place.  Just moved out of my place around the corner from here but made sure that my last meal as a resident of the area was from here...helped that I was buying lunch for my movers and wanted something fast and cheap.\n\nIt's tasty Mexican food in an unpretentious setting, what more do you want?  This is probably the only place in that neighborhood (which is chock full of great restaurants) that I ate at every week.  Enough said.", "author": "Alan S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-08", "description": "My friend and I go here after yoga almost every time. Yeah, it might defeat the purpose, but who cares when you're eating a really delicious fresh super burrito? It might not be in the Mission, but it's still epic.", "author": "Matt L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-07-29", "description": "The only thing scarier than a Richmond burrito is a Sunset burrito... As divorced from US-Mex cuisine as Panda Express from Chinese food. I came in with low expectations and even those weren't met. Ordered a burrito al pastor and ended up with something 75% rice 25% sweet citrusy mess. Pineapple? Orange juice? Whatever was used to marinade the pork was very overused. Of course, zero char, zero meat flavor. At least the pork wasn't rock hard/paper dry. The only reason why I won't give it one star is that the food still isn't as bad as Chipotle.", "author": "Perci N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-10", "description": "I love their broccoli burrito and their salsa bar. Very tasty, very filling, very cool!", "author": "Veg V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-03", "description": "So many mexican places in SF but La Fonda is the place you gotta try.\nBest thing to do : order a super burritto and go have a beer to the bar next door which allows you to bring your food in.\n\n//La Fonda est le restaurant mexicain à essayer à SF.\nBon plan : commandez un super burritto et mangez le au bar d'à côté où ils autorisent les plats à emporter.", "author": "Mark B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-08-26", "description": "Ordered two super burritos with steak and a super nacho with al pastor (bbq pork). Everything is lacking flavor...we ordered the dishes mild, but they don't even taste hot at all. We had to drown our food with the salsa to at least make it taste spicy. The person that made my nachos forgot to include the meat, so I went back and complained. The lady at the register called for the person who made the nachos but her shift ended and she was going out the door and didn't bother to reply to her question. So instead of trusting me about this issue the lady asks some other person to get approval to add the meat. Look at the plate of nachos! There was no meat on it at all and I ordered the items less than 5 minutes ago. Do they think I ate all the meat with the sauce and went back to lie about receiving the meat?! Instead of apologizing the lady blames the employee that made it and scoops some, lukewarm pre-cooked meat from a bucket. This is going to be the last time my friends and I go back to this place. This is the worst experience and the food is definitely not worth the price. It doesn't even match the quality of...Chipotle. Stay away from this place! They don't appreciate your business, and the food lacks flavor and everything is overpriced.", "author": "Mike W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-08-14", "description": "Food was mushy. Salsa was all gone. Service was crap. Attitude much? I'm still on a hunt for a good Mexican place.", "author": "Wendy C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-28", "description": "I eat here pretty often, always ordering the same type of taco, yet the cashier Laura never remembers me.  I don't come for the service ~ it's inexpensive, fresh and good.  if you don't like Laura, do to Tart to Tart ( which has a Mexican section now and very nice people!)", "author": "Kay C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-04", "description": "My new favorite! I am glad I walked off 9th Ave and found this gem less than a block down Irving. The burritos and tacos are very reasonably priced and taste great. The women at the counter are nice and friendly and always offer free chips & cups for the salsa bar. The dining area downstairs is very small but they have an upstairs as well. There have always been people eating here, but it has never been packed and I have never had to wait more than 5 minutes to get my order. The food is fresh and made to order. 5 stars all around!", "author": "Venus S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-06-03", "description": "While the inside is very clean, the menu is creative and varied, and the workers are really patient with picky customers...I REALLY do not recommend the food.\n\nThe Carne Asada Steak in my burrito was SO bland. It was like eating cardboard. It was like an adventure trying to excavate the tiny pieces of steak hidden in my burrito, except you aren't victorious in the end. The orange rice was really soggy and sweet (??), the \"guacamole\" was absolute watered down crap (and they charge $1.80 for 2 ounces of it. wtf), the sour cream looked and tasted off.\n\nFree chips which were crunchy and fresh, but the three salsas at the salsa bar tasted funky to me. \n\nWHACK", "author": "Jessica C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-27", "description": "Their Super Tacos really are super; I couldn't even fold it, they were so packed (with rice, beans, salsa, guacamole, and sour cream)!\n\nOne Super Taco and one Regular Taco (meat+salsa) was the perfect meal. Maybe not for a football player but I'm 5'5 and 120lbs., it was perfect for me!\n\nThey offer complimentary chips with your order, salsa and water is self-served. Three types of salsa, I have no idea what kinds but one is green.\n\nThey offer seating downstairs and upstairs; downstairs offer a few tables and also tall tables with bar stools for a quick solo meal.\n\nI had a regular chorizo taco and a super pollo taco-- YUM.\n\nLast but not least-- staff, nice. You'll hear their chatter in Spanish while you eat. Nice folks and they move fast! I had paid, turned around to put things down on one of the tall tables and as soon as I turned back around my tacos were plated, plattered, and ready for me to inhale-- I was starving. Perfect place to go if you're starving, it was so fast!", "author": "Tammy H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-12-18", "description": "I've been coming here to buy food for the last two Thursday evenings, and the same woman at the counter has been taking my order. She has been very rude to me for no good reason, and she acts like she doesn't want me in the restaurant. She's a Latina with her foot right up her but in other words. And I'm not coming back here anymore because of her. Thank god this isn't the best burrito place in town. I guess I'll go back to Gordo Taqueria around the corner where the people are friendly. I'm sure she'd like that very much.", "author": "Alex W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-03-13", "description": "I ate here yesterday.  About 30 minutes later I started feeling bloated.  2 hours later I started getting a stomach ache.  What ensued was one of the worst nights of my life.  After vomiting every 30 minutes from midnight through 6 am, then every hour until noon, followed by every 2 hours until 4 pm I am now physically and mentally exhausted.  It was *definitely* the cochinita de pibil (or possibly the accompanying sour-cream-like sauce).  100% certain of that.  Anyhow, my body is wrecked, I had to miss a day of work, and I'm still feeling sick to the point where all I can keep down is tea.  I did not tip at the time because I never tip for counter service, unless the food is excellent and prepared quickly (neither was the case).  After reading on Yelp how at least one regular customer seems to think that the service/quality is related to the tip I'm not surprised, for all I know my meal was prepared by Typhoid Mary.", "author": "Charles W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-09-16", "description": "No flavor, no seasoning, huge super burrito with NO flavor, soggy beef that tasted boiled, gross and terrible. I work near by and walk by this place several times a week, wished I had kept walking!!!!!!!", "author": "Tina A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-06-05", "description": "This might not be a big deal with some customers but, I ordered a mushroom quesadilla with sour cream and guacamole (to go). They forgot to add the guacamole and sour cream. So I headed 2 miles back to have them correct my order. There were probably 2 customers ahead of me.  I told the staff they forgot to add the sour cream and guac and the lady told me I did not pay for it. I know I did because I come there once a week and order the same thing. She then told me there was sour cream in the quesadilla and I showed her there was not. She refused to add it. The staff at La Fonda were rude! I have been a loyal customer here for about a year but not any more.", "author": "Cup C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-10-15", "description": "Got the burrito. Reheated meat, stale chips, and flies every where. Not coming back here again. The salsa was the only good thing too bad the chips tasted like they were sitting out since last month.", "author": "Tiger T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-16", "description": "Delicious! I stopped in with my family when touring downtown SF, and stumbled into this spot. We were pleasantly surprised by the quality and taste of the food, and the cozy seating upstairs. Staff was brief by friendly, and the pricing seemed to be reasonable for the area. I got the chicken burrito, and it was very filling.", "author": "Jesse T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-25", "description": "Apprently I go here 3 times a week now....\n\nI only get the rice bean and cheese, no salsa...and its amazing!\n\nNot the cheapest burrito, but its worth it.   Gotta love the salsa bar for pairing with the free chips...Im obsessed with the light green stuff.   \n\nSuper warm upstairs if you plan on enjoying your burrito on a cold day", "author": "Cassie B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-06-03", "description": "I've been here at least a half a dozen times so I can tell you from my experience that it has slipped over time. This is a classic example of what happens when the quality of food a restaurant prepares and serves deteriorates. The food has gone from very good to nothing to write home about. \n\nNot too long ago I had dinner here and was disappointed all around. The food was just okay, the staff members were shouting and the radio was blaring. This doesn't add up to a nice dining experience. On my last visit, literally and figuratively, I realized while eating my burrito that it didn't taste like... anything.  \n\nOn the positive side of the ledger, on a sunny day the light pours into the restaurant, making the seats near the large open window warm and inviting. The sidewalk tables are pleasant, too.", "author": "Michael J."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-06-06", "description": "I've really tried to give La Fonda a chance over the course of the past year and a half, and it's just awful. The most bland mexican food you can ever get. I ordered a street taco, which was almost $3, and the tortilla was wet and slippery and kind of raw. Like they had just put it on the grill, or even a microwave, for literally 2 seconds. \n\nThis store also plays 2 different radios at the same time, loudly, and is really anxiety inducing. The service is bad, $1 for refills. Over priced crappy bland food. I wish this neighborhood had a good mexican food restaurant. Gordos isn't really any better.", "author": "Catface G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-19", "description": "I live in the neighborhood and this is the best mexican place around, reallu nice, taty and fresh food,  good and fasr service. I don't know why is so underrated.  Loved it.", "author": "Amy S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-02-19", "description": "I come here often usually over the top service but today by far is the worst service I've even gotten from this place. Who ever rang me up was rude as hell (I've never seen her here before). I won't be coming here during this time anymore.", "author": "Ocho B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-12-03", "description": "Yes.\n\nI've never had anything bad from here, seriously. Just thinking about this place makes me want to go so I'll be brief. I usually go with a burrito, they have a few self-serve salsas to choose from, and their prices are decent. There's a second floor too so seating isn't really a problem. Excellent. Okay, go!", "author": "Barrett I."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-18", "description": "They've been around now for a while.  First, the place itself is tight.  And on a warmish day, it gets really hot inside.  I hope they make enough money to expand (or move to a little bigger space but stay in the neighborhood).  This time I opted for a taco al pastor, guacamole, and a cheese handmade corn quesadilla.  I've never even seen a taco al pastor so I can't say whether it was \"correct\" or not but it was very tasty, reminded me of the tacos we got down on the beach in Mexico, simple but tasty.  I could have put some of the salsas I took but I liked it as it was (don't need to scorch my tastebuds with hot sauce in order to eat it, was good as it was).  But it didn't look like the meat was sliced off one of those rotating meat skewers, looked like chopped pork.  I'm going to go back for more soon.  The guacamole was fine, lots of tomatoes in it which I'm not used to (seems like all the Mexican places are doing different things to \"extend\" their guacamole, some are chopping up lots of ciilantro and parsley, some are putting lots of onions and other stuff in there, once place overdid it with too much lemon) but we did eat it all.  And I loved the corn tortilla quesadiilas--nice taste and texture (better then the regular wheat ques you get at other taquerias).  Their fish tacos are just ok, I'll haul down to Rubio's when I have a fish taco jones (love their Mahi Mahi tacos)--but La Fonda's are about on a par with Pacific Catch over on 9th-Lincoln and not so expensive.  It is a different taste from your average taqueria, just wish the place were a bit bigger and didn't get so bleeding hot on warm days.  Oh, yea, and I don't care that they only give you a handful of chips, I don't come here to fill up on chips, I come for the real food.  I will need to attempt to get up earlier so I can taste their breakfast fare or else ask them if they serve breakfast all day long.  Oh, yea again, I trucked over to Church St. to try La Castillito's tacos al pastor and although they were good, I like La Fonda's a little bit better--less \"sweet\" (I'm not into sweet tasting foods).  I just wish they'd put shredded cabbage on it cause I love shredded cabbage.", "author": "Kai T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-10-09", "description": "One day a starving redhead - aka \"Red\" got off the N and scanned Ninth and Irving for possible eating options. \n\nStomach growling, \"Red\" walked up to the entrance of La Fonda.\n\nShe went inside. \n\nSkimming the menu quickly, she decided she'd order the tofu burrito with extra guacomole. The clerk at the front smiled and nodded approvingly. \n\nIn about 5 minutes the burrito was wrapped and glistening in foil. \n\nIt was ready to roll.\n\n\"Red\" grabbed the burrito and headed out. \n\nBefore she had taken two steps she began to smell wafts of warmed rice and sniffed the silver burrito lump. She promised her stomach that they would be home soon, but her stomach had it's own agenda.\n\nIt grumbled. It tightened. And kept on nagging. \"Come on....puh-lease... just one small bite.\" Despite attempts to ignore her badgering stomach, she couldn't.  She unwrapped a corner of the tightly bound bundle and took one little nibble.\n\nIt was delicious. Warm tofu in a sweet red sauce, wrapped in flavored rice, with cheese, guacomole and lettuce. Taste explosion. She folded down the tinfoil and put the burrito back in it's bag. But it kept on calling her name.\n\n\"Ohhhhhhhhhhh Reeeeeedddddddddddd. You know you want me. Come on now...just one little bite. Lil nibble never hurt no one.\"\n\nHer stomach began to squirm at the incessant burrito taunting. But she just pulled her belt tighter and kept on walking. Burrito still in the bag. But the burrito taunts got louder and louder, as did her stomach, struggling to move beneath her tightened jeans.\n\nShe stopped and looked at the burrito hard. \"Fine! Just one more bite\"\n\nThe tortilla puckered in delight.\n\nAnd she took one bite. Bigger than before. She could taste the melted cheese and it danced in her mouth. Her eyelashes fluttered and her stomach squealed in delight. \"Oooooooo  just one more bite. Come on now...You can save the rest for America's Next Top Model tonight\" It made sense. She took one slightly bigger bite - this time she could taste the guacamole. The burrito grinned. Red was his. All his. \n\n \nShe'd only walked a block now, but already there was guacomole all over her face, the red sauce dribbled down her left cheek. People on the street stared at her in both disgust and bewilderemet. Who was this red-headed burrito possessed fiend?\n\nBut the foil covered burrito kept on working it's tofu voodoo..\n\nAs she neared the corner - she took one more huge bite - only to realize that she was chewing on hard aluminum. The metallic taste sent shivers down her spine.\n\nLa Fonda's tofu burrito was gone. \n\nThe sky darkened, and clasping the empty bag in her hands - she felt ashamed yet relieved. \n\nThe burrito was no more. \n\nBut deep within the echoes of her gurgling stomach...she knew that her sordid burrito trysts with La Fonda had only just begun...\n\nTO BE CONTINUED...\n\nPLEASE NOTE -   La Fonda is no Papalote. It's no El Metate. But their tofu burrito can definitely still hold it's own in the burrito ring)", "author": "Jessica T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-03-28", "description": "Really not much of a reason to go here when you have Gordo's close by and if you want a nice sit down restaurant, Nopalito. La Fonda has pretty mediocre food. Its pretty bland and just a lot of cheese and fat. The burrito also always gets soggy from the bean juice and grease and falls apart. The service is pretty bad, they're always rushing you, being dismissive and rude. The restaurant itself is pretty crummy, cramped and kind of dirty. There's just so many better places out there that are more impressive.", "author": "Dexter H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-07-06", "description": "Let me get straight to the point- NO CHEESE! Came here for a bite to eat and ordered enchiladas and a two tamales. The chicken enchiladas didn't even have any cheese in them or on them. I was expecting cheese because usually enchiladas are cheesy goodness but nope not here. Also the tamales we got were super dry. Basically, really unhappy with what I ordered.", "author": "Ranna K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-11-17", "description": "With this tough economy and diners being more selective about the value of eating out, you would expect restaurants to make an extraordinary effort to cater to the dwindling throng.  Many restaurants are offering coupons or other gimmicks to lure customers.  These restaurants are probably on the verge as really successful ones don't need to do this.   La Fonda offers coupons, but their attitude indicates indifference to its customers.\n\nIt is been awhile since I came here, probably since my first review which I gave it two stars.  Last night we decided to eat here again for two reasons.  First, we had some coupons to use and secondly we were in the neighborhood.\n\nThere were 3 persons working there, a female cashier, a female preparer, and a male in the back.  The cashier seemed very friendly and attentive. It wasn't very busy. It looked like they added additional items to their menu. The condiments were full and it seemed relatively clean.  However, they let the once beautiful oak floors turn grimy.  All of the polyurethane was worn out and the oak color was turning black.  It looked gross.\n\nWe ordered a super beef burrito ($8) and a chili relleno dinner ($9).  The portions were huge and we took them upstairs to eat.  I cut into my burrito and took a bite and it was cold!  The cook did not bother to heat it up, just slap it together, rolled it up and flopped it on the plate.  I don't mean it was lukewarm - it was cold.  I could not distinguish what was in the burrito - it looked like a bunch of mushy tasteless glop.   My companion said her dinner was \"okay\" as she is not very critical.  The chips that came with our meals were leathery and I nearly cracked my filling eating it. \n\nThere was another Mexican restaurant near 6th/Irving that use to serve cold burritos also.  It has shrunk to a shell of its former self with much of its space occupied by a middle eastern restaurant.  La Fonda is heading in the same direction.\n\nLa Fonda has not taken any progressive steps to improve themselves and the quality of food has certainly gone downhill.  Maybe that are confident that their customers don't care about the slop they serve and feel they have a monopoly in the area.  Certainly, I don't want to go back here again, no matter how many coupons they offer.  If anyone can recommend a better place in the area, I'd like to know.  Maybe we should go back to the dreaded Chevy's again!", "author": "Robert J."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-04-14", "description": "Wow, Yelpers, thanks for the letdown.\n\nCarne asada burrito w rice, guacamole, lettuce, and salsa for $8.49 and it was ASTOUNDINGLY small. No flavors stood out and I couldn't even taste the \"spicy\" salsa.\n\nThe only reason they don't get 1 star is the place was clean and the service was friendly. Color me disappointed.", "author": "Tobias P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-01-24", "description": "La Fonda is not the best thing that has ever happened to me.\n\nI'm always down for Mexican food but these dishes are a bit bland and there really isn't anything special about their menu. Just an average Mexican restaurant that serves what you would expect. But thankfully they have a salsa bar to spice up your meal. \n\nHowever, the restaurant is clean, brightly decorated and is a nice place to sit inside or outside on a nice sunny afternoon. It's also inexpensive with generous portions. \n\nLa Fonda is alright. It's hard to love a place like this when there's an abundance of amazing Mexican restaurants all over the city.", "author": "Denise S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-20", "description": "Not just a greasy cuchara burrito shop. The seasonings and salsas have hints of regional flavor. Try the Azteca burrito!", "author": "Stephen S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-03-11", "description": "Cochinita Burrito ALL DAY.\n\n\nThis ain't your average burrito spot. High Quality products and they have a dish with Bacon...what more do you need to know.\n\nSkip Gordos because they are OVER RATED", "author": "Mike F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-08-07", "description": "so I do think burritos here may be a step (or a half-step) above those from gordos, but gordos has got the better price. still need to try other items from the menu but yes, the burritos are pretty good. I've lived in a few different neighborhoods in the city (never the mission) and have always had trouble finding good Mexican food without having to trek to the mission to get it. glad this place is here. \n\nside note: there's some flavor tinting the tortilla chips that they throw in the bag with the burrito that I'm not feelin. don't like them at all.", "author": "Georgia W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-15", "description": "My personal favorite Mexican in the Sunset. \n\nTheir cochinita pibil is awesome, especially when served in their panuchos, which were something new to me. Take two small thick corn tortillas, add cochinita pibil, pickled onions, and a habanero sauce in between like it was a sandwich, and you've got a really tasty dish. Next time I go back, I'll ask for three of them and I'll be even happier than I was than when I ate the standard serviing of two.\n\nThe other dish I've had was a regular mole burrito, with pinto beans, rice, and hot sauce. Mole was dark and rich, and better than most mole I've had (and that's a lot), however I think I prefer L'Avenida's mole just a tiny bit more on account of it being a bit lighter and less rich.\n\nComparing L'Avenida to La Fonda on points other than the mole, I give L'Avenida points for being a hole in the wall, for the fact that you get better service when you can order in Spanish, which is always something I love as an indicator that you're about to eat really good food. Salsa is a toss up between the two with both being good in my book. Those points aside, La Fonda edges out L'Avenida by a hair in my book on account of the much bigger menu and the fact that I can actually fit my legs under the tables. \n\nBut that said, I'll be happy eating at either and after just moving to the Sunset, I'm sure I'll be eating at one or the other basically every week.", "author": "Chris S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-17", "description": "La Fonda has probably the best Al Pastor I have ever had...it's a good hidden gem there. However I hope you like your service with a scowl! Literally the surliest Mexican ladies I have ever encountered....we found a coupon in the mail for this place and when I put it on the counter she literally did the deep sigh and rolled her eyes...hey lady don't put out coupons if you don't want people to use them! Rant ended. I haven't tried anything else here but the Al Pastor is legit.", "author": "Elizabeth P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-11", "description": "I'm surprised I haven't written up about La Fonda...\n\nSo, basically this place is fairly good. Portions are just about right, and I love their burritos. I usually get their azeteca burritos with either pork or beef. Horchata is served fresh here as well. They might not have a lot of chips for you, but if you eat a lot, you can always get some more later.\n\nThey seem to be adding new items to their menus now. I just had a pork empanada, and it was GOOD. I'll definitely try their other stuff, since I've almost always had just a burrito. Great place, even if it's in the Sunset.", "author": "Clinton L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-01-17", "description": "The decor is cute and friendly. \nIt's down the street from my house and they open a lot later than most places around the Sunset.\nIt's not as authentic as the taquerias in the Mission but I love any place with a salsa bar! \nJALAPENO EATING CONTEST ANYONE?\nVeggie burrito with no sour cream and no cheese!\nOh and if you're vegan, avoid the spinach tortilla, it has whey in it.", "author": "Justine L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-30", "description": "Saw the sign for barbacoa on saturday and sundays and followed my nose in. Rich and spicy, hunks of tender lamb. Slow cooked and succulent nestled in two corn tortillas with pickled onions and salsa. Excellent taco, well-priced at $3.50. Also tried the panucho, two crispy corn shells with barbacoa pibil, spicy pork, laid inbetween. Best panucho i've had in san francisco. Service was crisp and friendly and the restaurant appeared very clean. Huge menu offering a variety of meats and sauces. The chips are fresh and crispy and are offered along with three salsas, a green tomatillo, spicy roasted red and pico de gallo. Jicama  and cilantro are available at the salsa table as well. Follow your nose, fresh tasty mexican in the sunset.", "author": "Kelly K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-02-12", "description": "After running in the park with my gigantic dog and normal sized boyfriend, we decided (the humans at least) that we wanted brunch.  But we wanted it now, we wanted to sit in the sun and we needed a place that wasn't ridiculously crazy so that the dog could chill out.  We also didn't want to walk or run back to our 'hood and get cleaned up.  We just wanted food now.\n\nSo, we were meandering up Irving and faced with the typical choices of bagel shop where we could eat and walk, the crepe place that's super crowded and coffee shops - which don't have full breakfasts, we happened upon la Fonda.  We've walked by plenty of times, but on this particular morning, the sun was just warm enough and there were open outdoor tables.  Perfect!\n\nI sat down on a broken chair (they were all broken - I think from sun damage), but surprisingly it was fine.  My boyfriend went inside to order for us, while I settled in with the pooch.  He picked up huevos rancheros (his fave) and I got an egg scramble.  Both were fine.  Not exceptional or outstanding or bad for that matter, just fine.  It filled my belly, tasted fresh and allowed us a relaxing and quiet (except for all the people that stop to chat with and about the dog) meal.  \n\nSo, I haven't been for burritos, dinner, etc.  But to grab a quick bite without having to wait - this is a decent option.", "author": "Mac M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-04-27", "description": "All of my shrimp had not been cleaned; the thin black line of poop was in each of them. Disgusting!!!", "author": "Sabrina S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-02-27", "description": "As far as Mexican food in the Inner Sunset goes, this place isn't too bad. The great thing about La Fonda; they offer more then just burritos and tacos, so do yourself a favor and try their other items out. Give their Sopes, Chorizo, Chile Relleno, and Huarache's a try. They're tasty and filling. Another positive; you can have all the free salsa you want and don't have to go through that guilt of having to ask for more prepackaged salsa cups. \n\nLa Fonda isn't as authentically tasting as it comes, but it will give you that fix if you can't make it to the mission. They used to have Posole during the weekends, and for some reason they stopped. Which is really upsetting considering that was my favorite item on their menu. \n\nThey've also got really good Horchata and aqua frescas so do get some of those beverages when you eat there!", "author": "Junia I."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-04-26", "description": "The super tacos are my favorite with a little mix-n-match on the meat.\n\nThey are pretty good about letting you get creative on your order, like mix-n-match the meat, or sub out items.\n\nIt can get a bit crowded at lunch and dinner, so go early.\n\nMy only complaint is that it is getting a little worn down from use and harsh cleaning solvents.  The paint around the place and on the tables is getting stickier with each visit.\n\nOh, and people with strollers...maybe you can leave them outside? Pretty please? One stroller in there and it's like a Coachella concert trying to get around the place.", "author": "Tristan D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-02", "description": "So many choices\nAnd tasty combinations\nLa Fondarrito\n==========\n\nI wish that I lived closer to La Fonda so I could go more often. They have so many different types of meats that all taste so good...\n\nThis is one of my (several) places of choice after a weekend jog in the park.  Viva La Fonda.", "author": "Jin D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-02-12", "description": "Pro's:\n\n- quick & friendly service\n- accept credit/debit\n- centrally located in the inner sunset\n- open semi late\n\nCon's\n\n- food is bland and not very tasty\n- meat in my burritos has always been dry\n- just an average Mexican restaurant\n- prices are a little higher than other comparable restaurants\n\nIf it wasn't for the food quality being low, I would come back because the place seems pretty clean and the ladies working behind the counter are always friendly.", "author": "R A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-28", "description": "I debate over La Fonda or the Mexican restaurant on Irving when I am feeling a craving for a tasty burrito. La Fonda always wins!\n\n+The food is totally on par with the price. Delicious salsa bar, chips! I have tried many a burrito, salad and the huevos rancheros. None have ever disappointed. I usually have left overs too because the portions are pretty large :)\n\n+On a sunny day they open the windows and it is really awesome to sit inside.\n\nYUM!", "author": "Jess T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-28", "description": "I have to say that I was pleasantly surprised on my first visit to La Fonda. I have passed this place many times on my drives up and down Irving and not too long ago I decided to give it a shot. I was with my girlfriend and came in around 9:00 pm on a Sunday night.\n\nThe restaurant itself was very quaint, and it even had an upstairs area for dining. Although the downstairs (where the counter and \"kitchen\" is) was a bit cramped, the food that the two women made that night was really solid. I ordered a steak fajita burrito and my girlfriend ordered flautas. \n\nOur food was out within ten minutes (there was probably 3 or 4 other couples in there) and the portions that they gave were generous. Our meals combined were less than $20 including a drink and we both really enjoyed our food. The burrito I had was larger than I expected it would be, and my girlfriend's food filled up her entire plate. We were both full by the end of dinner. \n\nin addition to the food and overall good aesthetics of the restaurant, they had a small salsa bar at the end of the counter in which you could fill up a little cup full of any of the different salsas they offered. It was a nice touch to a restaurant that uses their limited space nicely.\n\nOverall I would definitely recommend this place to anyone in the Sunset who is craving Mexican food. The people running the restaurant were friendly, the food was really good, and the price was right for the amount of food that we got. I will definitely be coming back to La Fonda's in the future.", "author": "Sean B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-03-25", "description": "Pretty good but not great. As others mentioned, Mexican places in this area are few and far between, so sometimes it just hits the spot. Staff could be more friendly.", "author": "Lauren C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-07-16", "description": "When I lived in the Sunset this was the taqueria I would go to every week.  Yup, EVERY week.  For an entire year.  And NEVER got sick of it!\n\nThey offer authentic Mexican food and it's very obvious once you get a bite of it.  The owner, when I met him over a year ago, told me that he was from Mexico and he took pride in the making of every entree.  I was sooo happy to have a really good taqueria in the neighborhood it was hard to not go there every week.  Especially for their salsa, incredibly fresh and with wonderful seasoning.  \n\nMy favorites are their super veggie burrito and their cheese enchilladas.  Abso-f**n-lute-ly delicious!", "author": "Swetha G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-12", "description": "I love burritos and La Fonda is my favorite local stop.  The hot salsa rocks and the service is usually warm and friendly.  \n\nAlso, if you like 80's music, they have a great mix that always has one or two surprises.", "author": "jon c."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-03-26", "description": "I've had the burritos at La Fonda's on a few occasions, although I am much more of a taco person.\n\nThey are average, maybe even moderately good. Don't expect a hugely memorable experience, but the prices are fairly decent and the food isn't bad.\n\nDon't cross town to eat here, but if you are in the neighborhood, I wouldn't necessarily advise against it.\n\nPlus 1 star for my being able to call this place \"La Fowwwwwnda\"", "author": "Sara D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-02-08", "description": "Above average burrito (the world needs more mexican joints that serve tofu swimming in ranchero sauce)\n\n+\n\nBelow average prices (less than $6)\n\n=\n\nYay! I'm a fan.", "author": "Jason B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-06-18", "description": "This is my Favorite restaurant in the city. I eat here maybe 3-5 times a week on average. Nothing beats the veggie burrito chips and salsa for $3.80 which is what i get about 95% of the time. The other 5 belongs to the chile relleno burrito which is a premium item at over $5.00, but it's perfect if you're in the mood for cheese. I would also recommend the rice pudding if that's your thing. \n\nThe employees, the music, the brightly colored walls, and the natural light coming from the sunroof and the large window in the front all present a very cheerful atmosphere.\n\nThe only complaint I have about the place is that regardless of the fact that I'm in there almost daily and I\"ve so rarely varied from my staple order for the past 2 years they still ask me what I want to order. Also, the ice dispenser breaks down every once in a while, not really a big deal though.", "author": "Zach K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-01-15", "description": "I decided to test out the La Fonda, initially very suspicious of any Mexican restaurant outside of the Mission district. I am a fan of Balazo, \"hey, what the heck?\" \n\nWhen I came in, I was pleased to see the Latino staff, that was the first good sign. Also, the menu offered lots of Mexican specialties that are often left off most Mexican-American restaurants such as sopes and huaraches. As a vegetarian, one of the first things I notice is how well the restaurant caters to the non-flesh eaters. It looks like they had several burrito options, and one included this strange tomatoey tofu. The gracious attendant gave me a sample, which was for the best, because I would not have been happy had the tofu made its way into my burro. \n\nI went with the super veggie burrito and sope without meat. They were both tasty, standard Mexican fare. Pleasing to the taste buds, but nothing to get excited about. I think next time I have the hankering for Mexican food, I will stick with the places I know to be delicious (Pancho Villa, Balazo, Picante, and anything in Fruitvale).", "author": "Daniel M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-07-22", "description": "Don't ever come here!!! I'm trying to save everyone from experiencing what happened to me. I had the 'Azteca Nachos' last night for dinner. 30 minutes after my stomach starts hurting. About two hours later, at home, it gets gradually worse to the point that I'm just laying on my bed clutching my side. Later on in the night I finally just puked, it was all the nachos and that crap swimming in my toilet. Soon as I puke I feel instantly better. Don't ever go here. It's horrible.", "author": "Luis R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-06-15", "description": "Horrible place. It was the blandest burrito I have ever eaten. The quesadilla was nothing more than greasy oil. Avoid at all costs.", "author": "D V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-06", "description": "I am writing a review for this mexican restaurant as I want them to know their burritos are great! and the drinks esp the lemonade is mouth watering. The ladies are nice. The only thing I would mention to them is their space is a little crowded which does not give  you a lot of privacy if you are with someone even by yourself:)", "author": "Rup B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-08-01", "description": "I just had a mushroom empenada from here and it was the best thing I've ever had from this restaurant! Delicious - do try!!\n\nI've had their nachos, veggie super burrito, tacos - the standard, which are pretty standard taste wise too. But the empenadas blow everything else out of the water!", "author": "Twinstar G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-06-15", "description": "My best friend and I were spending the day near Golden Gate Park and decided to pick a random joint to grab some dinner. We ended up at La Fonda. Let's just get to the review.\n\nThe Good:\n\nThe food was decent and they had a fairly nice selection. The restaurant, while small, was kept up well. I had the shrimp and barbacoa tacos and some nachos. The barbacoa was nice but the shrimp and nachos were sub-par. \n\nThe Bad:\n\nTHE STAFF! Holy crap. The lady taking our order was rude and didn't appear to be listening half of the time. I think we had to repeat my friend's order twice. Their way of serving food is poorly thought out as well. They just hand you a tray and don't tell you that they will just call out your dish so that you can walk back up to pick it up. Kinda confusing but okay. Also, no free refills. REALLY!? Very rarely do you find a place that will charge for refills anymore and to me, that's just a joke. They lost a star solely on that little tidbit. \n\nConclusion:\n\nNormally I would give this place another shot! Occasionally you get a bad dish or you have to go a few times to find the real gems at a restaurant, but this place wont get that opportunity. Unless they have a serious talk with their staff and get with the times on their drink policies (which, in my mind, is just a form of fleecing), you wont see me back there.", "author": "Jonathan R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-10-20", "description": "the yelp-generated message next to the two stars i give this place sum up my feelings perfectly: meh, i've experienced better.\n\nI love Mexican food, and I love it spicy. I used to work near La Fonda and my coworkers raved about it, but aside from the size of the burritos (they are huge!) I found it to be nothing special. The burrito itself didn't have much flavor, and while i of course utilized the salsa bar, I didn't find it to help all that much.  and what mexican restaurant doesn't provide cholula/tapatio?! \n\nOverall: I've definitely had way better, and paid much less. i'd go again if i absolutely craved mexican food and this was the ONLY option", "author": "Laura C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-05-02", "description": "If they can't get the rice and beans right, what's the use.horrible, just Filler, No Pop, No Wow.", "author": "Dan B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-01-29", "description": "I like to go here because it's close and the food is pretty good. The prices aren't terribly high, but  a bit higher than what I would like to pay for Mexican food that, to me, isn't anything special. \n\nWe usually get take out here and when you order, it's not like Gordo's where you say what you want and they make it on the spot. They write it all down and then make it. \n\nThe ambiance is nice though. You have the downstairs and upstairs to eat and on a sunny day, i recommend sitting right next to their window. It makes you feel very warm and joyful eating by the window with a few of your close friends and family. \n\nThey actually have quite a variety on their menu. It includes burritos, tacos, nachos, sandwiches, plates, etc. I usually get their burritos are the portions are pretty big. If you finish one regular burrito you'll be stuffed. There's a good variety of meats, but the meats aren't anything special. I also thing their burritos are a bit dry, where Gordo's is juicier. For good burritos though, you'll probably have to go to the mission. A good thing about La Fonda is that they usually give you a complimentary bad of tortilla chips and they have a salsa bar where you pick your own salsa. I don't recommend that dark red one though. \n\nI'd check this place out if you wanted to try a Mexican restaurant with some variety in their menus and want a nice pleasant setting to set in while eating.", "author": "robin w."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-01-05", "description": "Updated:\n\nStill one of the only local taquerias and I'm kind of stuck here. I really HATE the way they take their orders and more than once have had problems both with their accuracy and with mixing them up.\n\nI get it...prices have increased...I get it...I get it...reminding me of that every time isn't changing whether I order or not. I'm already there, you had me at \"burrito.\" However, you are now becoming VERY expensive, not just expensive. And no need to keep telling me that you can't print a simple piece of paper with your menu on it...I'll just crane my neck, squinting and trying to figure out your menu with my guests while you stare at me.\n\nAnd for that, you are losing my business. I will go out of my way to Zapata at this point.\n\n==\n\nIt's local, and they give me coupons. It's expensive and inconsistent with portion sizes.\n\nI go here frequently, typically just getting a taco or burrito. Occasionally I go with the family or a group of friends.\n\nThe way they take their orders is different than the other places because they write each order down on a separate slip of paper. If I order one or two items, no problem. Any time I order more than 4, there's ALWAYS at least one crossed-up item. Like cheese put on the no-cheese thing, or spicy versus mild...so on. It's damn annoying and I usually order a couple of things at a time just to avoid this.\n\nI'll keep going back for one-off stuff. MUCH better than the place around the corner.", "author": "Scot B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-26", "description": "I will Yelp this in Haiku:\n\nHad a burrito\nChorizo with salsa bar\nGood-bye to Gordo's", "author": "Tash T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-07-01", "description": "OK! Don't tell the burrito, the quesadilla and the nachos, but I've found a new love - TACOS!\n\nLately, I've been heading here regularly, especially:\n1. After my runs to get a meal that has a fair share of proteins, fiber and of course, carbs\n2. After my mind decides it does not want to cook or eat home made food anymore \n3. After a hangover... or two... or three.. eh! it WAS Pride, mmm kay! \n4. With $5 in my pocket, I want a meal fit for a queen... king, I mean!\n\nAnd it's tacos all the way, baby!\n1. Regular Taco ($2.30) is as simple as it sounds. Taco with your choice of meat served with onions, cilantro (yum!) and salsa. Simple and tasty and not greasy or creamy at all\n2. Super Taco ($3.60) is an amped up version of the regular taco served with sour cream, guacamole and shredded cabbage. Mind you, it WILL get messy! But you will be filled with just one.\n3. Azteca Taco ($3.05) is again simple with grilled pork and grilled onions. More on the spicy side and little bit more oily than its brothers above.\n4. Vegetarian Taco ($2.80) is all of the above minus the chicken, the pig or the cow.\n\nAnd not to put the burrito down completely! Their ham and scrambled egg burrito is still great anytime of the day. Simple, filling, tasty, warm and filled with the goodness of protein and carbs.\n\n... and for my next book... the secret affair of lazy, hungover super-athletes with tacos!", "author": "Amit S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-03-18", "description": "At first I was not impressed with this place, but as in baseball it's the three strikes method.... and this place survived on strike two.\n\nI have been there several times in the last month or two and while the burritos are not as good as Gordo's, I will say the panuchos and empanadas are quite impressive.  They do take a nice smattering of your own hand on the salt front, but otherwise they are spot on.  The pickled onions are also spiked with habeneros so be aware if you do not like heat...\n\nAll in all i seem to like this place more each and every time i go", "author": "frizzle-fry e."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-09-16", "description": "Another good taqueria in the Inner Sunset. Everything I've eaten here is good, and the staff are always very polite and friendly. Tacos, burritos, quesadilla are all delicious, and the best item is available on weekends: \"Barbacoa\" - Barbecue lamb! The dinner plate comes with tortillas, rice, and a bowl of really good soup. Top of the line salsa!", "author": "James P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-09-07", "description": "For Inner Sunset mexican food, these guys are the best of the three in the area. \n\nThere's L'avenida a block down, and Gordo's around the corner on 9th. \n\nL'avenida used to be my favorite because it was easy to hop off the street car and easy to hop back on on my way home. But it seems that Lavash took over their old space and now L'avenida is really small and the quality of their meat has gone down hill. Gordo's has never been a favorite of mine, they just slop their burritos together in front of you with few choices for ingredients", "author": "Leo V."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-07-15", "description": "A very bland chicken burrito indeed.  Also quite soggy.  Not sure how this place has so many stars.", "author": "Audrey K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-04-02", "description": "My boyfriend and I both had the Azteca Burrito with Chicken Mole.  They were filling and delicious.  We were sold.  \n\nBUT... Cut to 4 hours later.  I was woken up in the middle of the night by terrible (we're talking TERRIBLE) acid reflux.  My stomach was killing me, my throat was burning, and I couldn't go back to sleep until several hours later when the pain subsided.  Keep in mind, my stomach is made out of steel.  I rarely ever experience heartburn or acid reflux.  The only time I have stomach aches like that is when I have a few too many whiskey sours (it happens.). \n\nAnyway, I'm going to give La Fonda another try, albeit I'm terrified.  Next time I'm going to go with something less intense.  Maybe a sope, or something.  \n\nThe final verdict:  avoid Azteca burritos, but don't avoid La Fonda altogether.", "author": "Nina B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-29", "description": "I really like their Torta Milanese from their special's menu. The beef is tender and breaded, sooo tasty.  Hot chips and  fresh salsa are included (I like the salsa verde). Great value choice.", "author": "Akshay K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-02-09", "description": "Ordered torta, carne asada. It's was good.\n\nI've been there a few times and order the same thing however I gave it this rating because I have noticed that the place is dirty and it always looks like this. The servers are ambivalent- that with the grimy feel haven't given me a reason to want to go back.", "author": "Marisa E."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-08-02", "description": "One star because I like the food. No more stars because 90% of the times I've been here the staff have been very rude. So rude, in fact, that I am writing this review. And I never write reviews. I am a kind and non-malicious person but the service today was just over the top nasty. They wouldn't even give me a bag for my burrito...wtf? I'll be getting burritos from gordos down the street from now on.", "author": "Emily C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-02-12", "description": "Really good burritos. Like super good. They were plump (that's what she said). Filled with meat (haha that's what she said, sorry I'm on a roll) and rice and beans. \n\nIt's a clean place with seating. The portions are huge. And you can't beat the chips and salsa. \n\nI want to go back and try the Chicken Mole.", "author": "Melissa T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-13", "description": "Food is really good but the women who work up front are not friendly at all. I'm a regular there and I've never seen them crack a smile...always makes me feel uncomfortable. Otherwise food is always fantastic.", "author": "S C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-08-23", "description": "Classic comfort food!  Having lived in the Sunset for over a year, I found myself frequenting this joint quite often. This was my first taqueria experience in the city and although it may not be 100% authentic, it certainly is delicious. Maybe I'm just a tad biased, but I really do love it and it is one of my favorite places to eat. It's a great place to get a good quality meal for just a few bucks. I find it pleasant to sit upstairs when it's cold and rainy outside (as you may have learned in 2nd grade science class, heat rises) - It sure does make for a cozy meal. The veggie burrito is my favorite thing on the menu...fancy that. I have also had the torta and a mushroom quesadilla, which were both equally pleasing. I have been satisfied with just about everything I have ordered here. Unfortunately since I have moved to Oakland, I haven't been in as much, but whenever I find myself in the Sunset and I have the chance, you better believe I am there eating. \n\nKeep your eye open because they have a coupon in the monthly  Value-Paks that go out: Buy one burrito and a drink, get a 2nd burrito of equal or lesser value free. Sweet!", "author": "Amber Y."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-02-02", "description": "Cochinita Pibil takes like 4 hrs of cooking time, plus the prep, plus the shopping (most safeways dont carry fresh banana leaves).  So when i order it its kind of like buying time. After trying it at LF, i'm forced to say that those are 4 hours of my life i wish i spent slowly roasting a perfectly seasoned cut of pork in a banana leaf, instead of buying them for eleven sixty three, or whatever it is, more than a mile away from Mission. One of those cases where you really get what you paid for :( Also arguably the coolest thing about this place is the 2nd level, but it seemed like all the steam from the kitchen and some weird funky smells just drifted up and congregated up there (i mean i was pretty normal at ground level, but upstairs was hot and kinda stinky)", "author": "Oleg H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-02-02", "description": "I applaud La Fonda for trying to create a restaurant with cheap Mexican menu that has more style. It's clean and not sloppy. It's located on Irving. I generally like their burritos because I can eat it without gagging. The menu is simple.", "author": "Denise C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-01-17", "description": "La Fonda makes some good beans and rice. That's about all we usually eat there so I cannot speak for the meat dishes. The people who work there are really nice.", "author": "Flora O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-16", "description": "I've never had a bad meal at La Fonda.  Great Mole, lovely Cochinita Pibil, Fresh Chips, and the Lamb!  It seems that recently (or maybe not so recently) they began serving lamb on the weekends - have it on a simple taco without the accessories for it is marvelous.", "author": "A B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-01-15", "description": "Quick, tasty food, and very affordable. For the price, it is hearty food with fresh ingredients served by enthusiastic Latin people. The food may not be the best, neither going for the most authentic crown. However the peppy colors on the walls, the smiling Latin family like staff behind the counter, and their earnest effort in serving you warm enchiladas or empanadas with horchata makes me go there again and again.", "author": "Parin K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-03-01", "description": "I had always passed this place but never felt compelled to try it. But since I had my doggie with me last night and couldn't bring him into a normal restaurant, we decided to eat here b/c they have tables out front. My friend got us 2 super tacos- Grilled Chicken and Chicken Mole. Both were good, but the Mole one was definitely better. It tasted like chocolate chicken yummy! There isn't anything exciting about the food here, but it's pretty cheap and does it's job by feeding you. But mainly, the outdoor tables in front are a huge perk!", "author": "Sonya D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-09-17", "description": "It's been a while since I've eaten here, and since I was in the neighborhood I stopped by for dinner last night.  I don't think I've hade a less tasty meal anywhere else in San Francisco. It wasn't gross, it's just nearly devoid of flavor and moisture.", "author": "Daniel H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-07-09", "description": "This place is alright, def not memorable. The burrito is hella average. There is no legitamate salsa to speak of in this venue, and the super burrito is just eh with out. All the stars are for the employees. Real sweet people. \n\nI remember walking by and they were closing and they still let me order last minute  , with a smile. Grateful for customers...what a concept!\n\nSo if you need to hit a burrito, this is the 2nd best choice. ( The other is across the street, can't remember the name). \n\nHit a different neighborhood altogether if you are looking for dece mexican food.", "author": "Taj A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-01-29", "description": "As far as the inner sunset goes, I think this is one of the better Mexican places in the area.  The other is Gordo's but that's another block away and thus another 90 seconds of walking before getting my burrito.  And when I have a burrito craving, 90 seconds is an eternity.  They have a good selection of meat and beans, and they just seem cleaner and less lardy than other burrito joints (which I know for many burrito aficionados may be a con.. but I'm trying to watch my figure here).  \n\nP.S. the burrito azteca is good for two meals and it's covered with the enchilada sauce which i love.", "author": "William S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-22", "description": "I come here a lot. I'm partial to the quesadilla with chorizo, the hot red salsa, and green tomatillo salsa. And the always friendly staff. Decent burritos and nachos also. I feel like some things are much better on the menu than others; the mole chicken is good, but it's always hard for me to finish. They give you a lot of options for your choice of meat, if you're a met eater. I can't even remember them all, but I think it's steak, chorizo, grilled chicken, mole chicken, carnitas, and more.", "author": "Ken L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-04-16", "description": "The food is nothing to write Guadalajara about.  Maybe Tijuana.  But definitely not Guadalajara.\n\nBut what they lack in salt and flavor, they make up in the best Salsa Verde this side of San Diego and stupid Marina girls doing the walk of shame.  \n\nPlus, all the pickled Jalapenos you can eat.  And if you know me at all,  then you know there are two things I love - pickles and stupid Marina girls doing the walk of shame.\n\nI actually don't love stupid Marina girls doing the walk of shame and was about 10 seconds from turning around and sticking a fork through her yellow Steve Madden leather moccasins.\n\nHer \"bro-date\" was already hitting the brew at 10am, as she droned on about how \"gross\" and \"bad for you\" cheese was.\n\nThat's when I took a big bite of my burrito, and let the cheese sort of hang out of my mouth for a minute as I winked at him.  He liked it.\n\nCome to the dark side, popped collar boy.  Come to the dark side.\n\nThe girls might be a little bigger, but they clean their plates, if you know what I mean.\n\nAnd I am almost positive you have no idea.", "author": "Rachel G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-10-29", "description": "A-okay.  That's about the quickest summary I can give you about this sometimes-really-delicious, sometimes disappointing Mexican joint.  \n\nSo I'll just start out with the Good: Veggie Options & Portions.  The Tofu Ranchero just hits The Spot (sometimes). The mix of rice, tofu, refried beans and salsa just makes the stomach sing. Surprisingly delicious (when they choose to make it right).  The portions are pretty big--you'll probably have enough left over for a snack later on that night.   \n\nThe Bad: Service, Salsa Bar, Food. You just never know what to expect. The cashiers either greet you like you're the one they've been waiting for all their lives or like you're the thing the cat dragged in. The Salsa Bar is okay, but really, what would I know?  I've avoided it since I saw people using their bare hands to scoop out salsa. The Food is just inconsistent.  It can be the best thing you've eaten since forever or the most disappointing fare you've put 10 bucks down for in awhile.  \n\nThe Ugly:  Okay... this would be exaggerating.  Nothing is that bad here, but it definitely rounds out the review, don't you think?\n\nAll in all, come here with your expectations low and you'll be just fine. Heck, who knows, you might just be stopping by on a good day.", "author": "Daisy T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-05-18", "description": "Currently my favorite place to get a burrito.\n\n(This review is strictly on a burrito bias)\n\nHere are the reasons why:\n1. I live in Inner Sunset, so this is the perfect burrito pit stop for me on the way to my house.\n2. They always have coupons in the neighborhood Valpak offering X amount of $ off any single item, and even buy one burrito get the second one free.\n3. Most importantly, the burritos taste amazing, the meat is well seasoned and grilled in front of you, also the combination of the ingredients is always perfect, the right amount of rice, beans meat, cheese and salsa.\n4. Salsa bar, I think there are five different salsas to pick from, and I still can't decide on a favorite.\n5. Free chips with all orders.\n6. Horchata is perfect, not too sweet but enough flavor to devour a cup in 3 mins.\n\nI have tried several of their burritos, including the vegetarian burrito, theaztec wet burrito, and my favorite just the regular burrito with spicy salsa.\nThe ladies who work there are always smiley and are friendly.\n\nOverall, if you are looking for a local burrito spot in the Sunset this is the one!  It blows Gordo's out of the water.", "author": "Jaclyn O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-09-20", "description": "people are retarded when they think that its a \"burrito joint\". Somehow all americans think that Mexican food is all burritos. Its not. \n\nIn Mexico, we dont even have burritos... anywhere. A burrito is like a made up American thing. Just like chilli and all those other nasty fake mexican meals. So calling this place \"inauthentic\" or a \"burrito joint\" is ignorant and stupid.\n\nAs a Mexican i can actually say that this place is as authentic as it can get in the US. The sopes are amazing, the huaraches are delicious and the salsas actually taste like something. Of course they make them a little light tasting but thats only because Americans cant handle the spicyness and complain too much.\n\nThe molletes are done different then they are done in mexico but still, they are incredibly delicious. Their veggies are fresh and their aguas frescas taste home made and not like canned juices.\n\nGordos is a mexican fast food place that scores a 1 compared to la fonda. which BTW. its LAH PHONe DAH. not law fawnduh. it doesnt even SOUND like lawfawnduh. \n\nof course its hard to find real mexican food here cuz well.. there isnt. you want mexican food. real mexican food? GO TO MEXICO. no jodas.\n\nthis place is amazing and it has become my usual \"after the doctor visit\" food place. \n\nque pinche burrito joint ni que pinche burrito joint. pinches pendejos. FTP.", "author": "Bella G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-08-12", "description": "Lafawnduh?\n\nSit outside at one of the two tables if the weather's sunny.\n\nIf you're trying to *not* get fat, order the salmon taco because it's hella small and not fried.  Also had a lime aquas fresacas and it was light & refreshing.  I had no hangover, but would have guzzled a few if I'd had one.\n\nDate had a super burrito.  It kept him full from 12noon until now (9:15pm) but it wasn't the best burrito ever.  It kind of was just like, a burrito, ya know?\n\nHave you ever been to a burrito place and watched someone load up on the salsa minicups con lids?  Like, load up on an abnormal amount of salsa?  Lafawnduh is totally onto this.  They keep their lids out but the cups are behind the counter for loss prevention.", "author": "Megan G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-06-02", "description": "It's not authentic Mexican food, but it will do the job of satisfying hunger or an immediate Mexican food craving. They have a lot of vegetarian options, which I like.", "author": "Gloria B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-11-18", "description": "It took me a few visits to get into the rhythm of La Fonda.\n\nFor example - if you want cheese on your burrito, you have to buy a super burrito - you can't add cheese a la carte.  And if cheese is all you want - you have to have them subtract out everything else, which tends to freak them out.\n\nBut heck, it's their rule not mine.\n\nFortunately the food's good.   Not great but good.\n\nI agree with others - the grilled chicken burrito is their best. \n\nI wish there was a 3.5 on Yelp... because La Fonda is better than a 3 - but not yet a 4.", "author": "Rick C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-05-12", "description": "Get the Azteca Burrito!  Seriously, just do it.  It's amazing!!!  The sauce is a perfect combination of sweet and flavorful.  Plus, It's piled high with guacamole,  melted cheese and sour cream.  How do you go wrong with that?!  \n\nI made the mistake of getting the super pollo burrito and although it was delicious, I ended up scooping up all the cheesy & saucy goodness from my bf's Azteca plate and piling it atop of my burrito.  This was by far the best burrito I've ever had (aka stolen bites of).  And believe me, I've eaten a lot of burritos.\n\nRight off the N Judah line and within 2 blocks of GG Park, the location is perfect.  The restaurant itself was clean and colorful and had plenty of room with an upstairs section.\n\nCarne Asada Azteca burrito, I'm coming back for YOU!", "author": "Lauren C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-05-09", "description": "Decent veggie burrito.  Their menu had a lot of other interesting items that I might go back for (Mexican sandwiches, ect).\n\nService was A-OK.  \n\nI appreciate the eco-friendly utensils.", "author": "Don B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-08-23", "description": "When I'm in the mood for some Mexican during lunch time, I head on over to La Fonda (Lawfawnduh...She's uh... she's got sandy blonde hair. She's uh... pretty good looking face, but I'm just getting really... just kinda TO'd because... I mean she hasn't even sent me a full body shot yet.)\n\nThey offer really large portions which can be great for sharing (when you don't feel like heading back to work in a food induced coma).  Can't go wrong with the nachos or the burritos.  Their chips and salsa are also surprisingly good!", "author": "Christy L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-06-12", "description": "I love this place! Tasty everything, super friendly service, nice restaurant with sidewalk tables and upstairs people watching tables. The only thing you have to watch out for is the huge portions. Oh and you probably won't be able to get a big crowd in here, it's a pretty small place.\n\nTo set your expectations: this is a pickup counter place. No waiters.", "author": "Andrew M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-05-16", "description": "Great burritos, and authentic mexican food\nservice cholarific, shitty and rude - these ladies never smile\nGordo's much better", "author": "Pug P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-10-14", "description": "This place is good, but not great. Its good for a casual breakfast or lunch if your looking for some decent Americanized Mexican food this is definitely the place. I got the Fajita Quesadilla with steak which I did enjoyed but the Horchata I ordered was way too sweet but the ambiance is nice. I guess my big thing with this place was there was no one thing that stood out, that set it apart from all the other Mexican places. Maybe only that it was the best Mexican place around that area other than Gordos. I'll definitely come back just to try some other food and give this place a chance to raise in my ratings.", "author": "Anna B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-11-19", "description": "When I moved to San Francisco, the foggy side of the city, I thought my days of having a great neighborhood taqueria nearby were gone. To my surprise, the Inner Sunset has La Fonda!\n\nEverything I've had here is good -- flavorful and fresh. I am currently infatuated with their sopes...not the greasy, dense cakes you find everywhere else, but fresh, fluffy, corn-flavorful cakes that complement the savory meat topping of your choice.\n\nThere's room to sit and comfortably enjoy your food and best of all, everyone who works here is so friendly and nice, reflecting the sunny decor!", "author": "Moni K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-11-25", "description": "I love this place for it's good basic Mexican dishes, friendly service, cheerful setting, and good prices. Plus, we can walk there. With too many disappointing Mexican-type places (sorry Eldos) in the neighborhood, La Fonda is a respite delight.", "author": "Sunset G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-01-30", "description": "I was born in San Francisco and apart from a few years in Europe and college in the five and dime and North Carolina I've lived here most of my life and most of that time, apart from a year or so in the Mission and a year or so in the Haight, has been spent in the Inner Sunset or close by. \n\nI don't say that to start one of those lame native vs. newcomer arguments, I know plenty of natives who got the hell out of SF the first chance they got  and never looked back and plenty of people who have moved here and made SF their home. I just want to give a little background when I make this statement: Between surly service and bad food, Gordo Taqueria, to paraphrase Bart Simpson, manages to both suck and blow.\n\nFortunately for those of us who dwell in the IS there is La Fonda. Sarang D. mentioned the alambre and I must concur by all means try the alambre, motherfuckers. Carne asada, cheese and, wait for it, BACON! All in one magical, delicious, peta-nightmare of a dish. Great tacos too, I prefer the al pastor.  They even have a good tofu burrito (so I've been told by a veggie friend, I wouldn't eat tofu with Nelson W's mouth!). The people behind the counter are friendly as well.", "author": "Philip G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-10-15", "description": "I feel like these days, bacon has a bad rep. I blame this on the North Beach dieters, Pilates loons, and health club nincompoops around the world. It's a little known fact that bacon is the greatest and most delicious meat in the universe. \n\nThe number one reason for its greatness is its versatility. You can have 2 strips of crispy bacon with your eggs in the morning, chopped up in a nice albeit womanly salad, wrapped around a scallop and eaten while on ecstasy, or, the way La Fonda does it--layed across onions, peppers, and meat, and wrapped in a flour tortilla--the wonder that is \"The Alambre\". \n\nIf you question the authenticity of this dish, then you my friend, have obviously never been to Mexico, where they kill and eat pigs on a daily basis and have no running water or electricity. I believe the main character in Desperado, the cinematic authority on Mexico, ate an Alambre whilst killing, playing guitar, and talking to Steve Buscemi. But, I digress. La Fonda is the go-to spot in the Sunset for hearty Mexican food. Just ask the guy from Desperado.", "author": "Steven H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-02-18", "description": "Lo Siento La Fonda....La Comida es no bueno.  \n\n1. Food was bland, no spices, no flavor. \"Spanish rice\" tasted like white rice and i had to load it up with salt.  \n\n2. The lady said there were 4 tortillas in the box.  There was one. And it was so big I could have sewed it into a flour corset.  What good does this do for fajita tacos? \n\n3. I ordered it for takeout. There was no napkins, no plastic silverware, nada. \n\n4. Since there is no online menu, they will tell you on the phone that the fajitas come with guacamole and sour cream. Let me clarify: It comes with one ounce of guacamole and once ounce of watery substance that may imitate sour cream.", "author": "Courtney M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-07-17", "description": "My top two reasons I am glad that I stopped being a vegetarian:\n1. bacon (duh hickey)\n2. The grilled chicken burrito at La Fonda\n \nI usually think chicken is the most boring of meats, but not the char grilled chicken from La Fonda. I also have some lingering fears from being a vegetarian that I am going to bite into some unidentified meaty object when eating something that has a lot of chopped up stuff inside, but I have never had that traumatic experience with La Fonda. They also have great chips and some of the best salsa which is my number one requirement for any taqueria or Mexican restaurant for that matter. Thumbs up kiddos!", "author": "Carly S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-08-25", "description": "Your go to place for a quick and cheap burrito. Order, pay, and your burrito is pretty much ready! I had a chicken burrito with black beans on a spinach wrap (loved that I got a choice for the wrap). Your order comes with a bag of chips and there is a salsa bar for your choice of salsa. In and out in a jiffy, but you get what you pay for. I felt the burrito was A-okay at most. Service was definitely fast and efficient if you are on a time crunch.", "author": "Tracy T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-14", "description": "Love La Fonda! Great selection of fresh authentic dishes. I love that you can choose from various types of beans, chicken, and other condiments, which means you can be as healthy or indulgent as you would like! Super fast service. Always great when you have a craving for Mexican food! My only suggestion would be to add margaritas to their menu, in addition to their selection of beer and wine. Oh, and gotta love the salsa bar...who doesn't love a good salsa bar?", "author": "Bridget B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-18", "description": "I was craving mexican food the other day. It is my favorite! I didn't want to travel far from my house and had walked by this place often in the mornings to get coffee. So I headed out my door and walked the 6 blocks. \nWhen I walked in I realized it was not my first time eating here. I ate here years ago with an old friend. I remember sitting upstairs and thinking what a cool neighborhood.... now i live here.... odd side note... no back to the review. \nI kept it simple. I got a chicken burrito. Even better they had an option for a whole wheat tortilla. The burrito was A-OK!! not the best but certainly not a disappointment. I saw someone next to me eating eggs, black beans and rice. Next time i think I will try that.", "author": "Wes P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-07-13", "description": "The first two times I went here I was hungover and craving salt and grease. So I loved their breakfast items. Since then, I've come to realize that a LOT of their food is over salted. The breakfast has some potential, but I'm not sold on the rest of the menu. I had a decent veggie burrito, nothing special, but decent. I also had a chicken burrito and about 2/3 of the chicken was inedible. Waaaay too fatty and poorly cut and cooked. Tried the chicken again and the same thing. Their salsa is good though...\n\nThere's not much for Mexican in the Inner Sunset, but I'd say try something else.", "author": "Morgan A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-10-06", "description": "Blah .... I may be spoiled by mission taquerias or my (Mexican)  Sis in law great  cooking , however, this is not good mex food, I mean ,is good if you are really hungry, but is not some place you crave....sorry", "author": "Karen P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-03-07", "description": "After years of being duly unimpressed with both Gordo's and L'Avenida, I am very happy to have La Fonda in the neighborhood.  \n\nFirst and foremost, the food is pretty good.  The meats are moist and flavorful, they don't skimp on the portions and everything tastes really fresh.  Other reasons for celebration: thick crunchy chips, tasty salsa bar, friendly staff, reasonable prices and a clean well-lit space.\n\nMy usual order: A refreshing strawberry agua fresca and a super taco con carnitas, SPICY!", "author": "Emily L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-10-20", "description": "Best place for Mexican food in the inner sunset.  No big accomplishment, but worthwhile nevertheless.  The chorizo and scrambled egg breakfast burrito is among the best I've had -- ideal to placate a hangover or just get your day started.  The portion is enough to satisfy your hunger but not so big that it'll put you out.  The standard burritos are also solid, with a large selection of meats to choose from.\n\nI'm not as enthusiastic about their chilaquiles, as they're prepared in a runny style.  I much prefer the way Papalote makes chilaquiles -- more dense, melted cheese, pico de gallo on the side.", "author": "Leon R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-12-22", "description": "Santa Mara, Madre de Dios, ruega por nosotros pecadores, ahora y en la hora de nuestra muerte!!!\n\nSNAP!\nwow I think I was just speaking in tongue there.. excuse me phew...I'm ok,  just think I had a religious experience at La Fonda after eating a burrito.  Am I in the Sunset district? What is going on here?  \nEl Senor es contigo.", "author": "G L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-05-06", "description": "Went with a group of women who recommended the place. Our server was rude and had the personality of a flea. There was no substitution for the ground beef in the tostada even though we were willing to pay extra for the Carne Asada (steak). I had the chicken tostada and had diarrhea for a week after. \nI would never return nor recommend to anyone!!!", "author": "Gail W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-08-01", "description": "What? I haven't reviewed La Fonda yet?? Incredible!\n\nI really only have one thing to mention; Tofu Ranchero. Get it in a burrito, or in a Flour Tostada (aka a taco salad), or on some Sopes... so tomatoey and delicious!\n\nThe staff at this restaurant are super nice, and very accommodating to special requests and substitutions, and despite the recent price increase, I think I get more for my money here than at other spots in the neighborhood.", "author": "Vanessa R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-04-18", "description": "Just moved to the Sunset, trying to explore burritos around my new hood.  \nDamn what a letdown.  I ordered a carne asada super burrito and it was in the 8 dollar range already so immediate I'm thinking this better be good.  \n\nI see them cooking my meat on the grill and I think to myself \"that can't be my portion of carne, that's a kids size portion.\"  There is nothing super about the burrito.  LAME.  PLAIN.  And they are ripping you off with their SUPER SMALL portions of mean.  \n\nI paid attention to them cooking after I noticed my order, and all the meat portions are extremely small.  I said something to the cashier who was nice and she just asked me of I wanted extra meat.  I didn't ask if she was going to charge me, I guess if she was going to give it to me free this place would have gotten 3 stars, but I doubt that, given that their were 10 people in line behind me and I'm sure they would all ask for the same thing.  I just said no.  No mo biznezz from me!\n\nThis place pisses me off and I've only been here once.  Unfortunately I can't recommend a better place in the area ATM, but I was definitely LET DOWN here.\n\nOh and to the people who gave this place glowing reviews, lay off the pot/booze and you'll get your tastebuds back.", "author": "jack s."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-02-02", "description": "One star because the food is actually quite good.  Negative five stars for service.  Never returning.  I ordered an Azteca burrito and didn't realize that it would come in a box due to the sauce on top (call me an idiot, but at least I'm honest).  I asked the ladies working there twice, VERY nicely, if it was the Azteca... and received an impatient \"yes\" followed by a \"chingas!\" to the other lady.  At first I thought it was a racist remark given that I'm Asian, but I couldn't yell back since I didn't know what it meant.  Looked it up when I got home... Obviously I won't be returning because I shouldn't have to be cursed at when clarifying that I got the right food and not stealing somebody else's.  Too bad, because it was good enough to frequent a couple times a year.  On second thought, not a big loss.", "author": "Rob L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-08-28", "description": "OK food. I DO NOT recommend bringing a stroller here. It's too small and you will need some help carrying it up the steep stairs if you choose to eat there. Bathroom is strangly located by the cook area and the sink is not even inside the bathroom! If your a single dude trying to grab some quick Mexican food this is for you, if your a family with a baby this is NOT for you. You will become flustered fast!", "author": "Trish B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-02-20", "description": "Great Mexican food at an even better price.  I had a huge salad with steak for like $6 and it was soooo good.  \n\nAll the food we ordered looked and tasted fresh and wonderful!\n\nPlus it's hard to find good cheap Mexican food in the sunset.", "author": "Megan L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-03-22", "description": "Being only about 1 block away from my parent's house, I find myself getting take-out lunch here several times a month. With two little ones in tow, it makes lunchtime easy when visiting the grandparents. \n\nThe service is hit-or-miss but the food is pretty consistent. My parents like their chicken and veggie burritos, my husband really likes their carnitas, I like their chicken tacos & super nachos (oink oink), and my daughter loves the side order of pinto beans and rice. Good food & good prices.", "author": "Lizelle G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-03-18", "description": "As far as burritos go this one was nothing special.  But really, what other choice do I have in the Inner Sunset?  If La Fonda has the highest rated for Mexican food in the Inner Sunset I don't even want to think about trying the other places.\n\nI'm sure I'll be back though.", "author": "Jeff S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-01-23", "description": "The first time I went in the middle of the afternoon, I got a steak burrito and some other things for the family. My baby and I both gobbled the burrito down--almost fighting for it! But the tamale dinner was just average--the pork better than the chicken, I think--but don't waste your appetite. Another visit I got some tacos for the family. The tacos are ok, but way too simple. I ordered some other steak-type taco, and it was essentially just meat and corn tortilla. (Anyway, nothing beats a La Taqueria taco!). When I asked the woman at the counter questions about the taco and the menu, she was short and pretty rude. There was still a good half hour or more until closing when I left, and maybe she had a long day, but I don't think that should be a reason for her rudeness.  I wouldn't return even for the free salsa.", "author": "Cara K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-02-18", "description": "Extremely mediocre. Is that an oxymoron?\n\nFood was really just.. so.. whatever.. I've already forgotten about it.\n\nThe service was very fast and friendly, the place was clean and bright, and the prices were quite good. \n\nAnd yet... there's just something kinda depressing about mediocre Mexican food.", "author": "Laura P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-02-21", "description": "I've been coming to this place on and off for years and unfortunately the quality has gone downhill recently. This is the the 3rd or 4th time where I've gotten a super burrito from this place that consisted almost entirely of beans and rice. I'm not sure if they are trying to save money or what but its been enough to inspire me to write a review.. which i dont do very often.", "author": "Nick O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-04-15", "description": "I'm no burrito expert, but I do know that La Fonda's veggie super burritos (without beans and lettuce) are the bomb. Get one with a spinach wrap--the green tortilla makes a nice contrast with the red salsa & rice. \n\nThe fresh limeade is also really yummy on a hot day.", "author": "Liz L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-05-16", "description": "Yay for decent Mexican food! I was just craving a veggie burrito, and this totally satisfied my craving as a burrito with the standard ingredients, including rice, beans (your choice), cheese, lettuce, tomato, sour cream, and guacamole. It was only $5.25, and you could choose if you wanted a regular tortilla or a spinach one. They also give you chips, and there are a number of salsas you could have. They take cards, and they are SUPER fast. I was in and out in maybe 3 minutes. It was just what I wanted!", "author": "Sara W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-10-27", "description": "Clean... yet not too gringo... a rare, and very pleasing combination! Their giant burritos run from $4 to about $7, and they're packed with really fresh/great tasting ingredients. My only complaint is the carrots and peas that they mix in with the rice. I just don't dig that stuff, but it wasn't too bad... so no big whoop.\n\nOne bit of advice - don't sit upstairs, unless you're a cold blooded lizard type of creature. It gets so GD hot up there.", "author": "Alex C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-06-16", "description": "Wavers around okay and passable, the Peter of Fondas.\n\nHaven't returned in awhile, apparently I'm not really fonda it.", "author": "GIR .."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-07-22", "description": "I wish I could give this place 5 stars.... but a burrito is something so easy and simple to make, yet they messed up on mine :[ I would have to say though, they make your food in a blink of an eye, it's crazy amazing fast. But maybe that's when mistakes happen. I ordered a super burrito which comes with all the fixings of guac, sour cream, beans, etc. But tell me why I didn't have that in my burrito? I was upset but again, maybe because they were working too fast... I'm hesitant to, but I may give this place another try just because it's so close to where I live.", "author": "Eugenia G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-10-06", "description": "Who says you have to go to the Mission to get a good burrito?  or quesadilla?  or salsa?  I LOVE the salsa bar, which I don't say about most places.  Perfectly spicey and yet also accessible to my friend with the wimpy mouth.  The place is cheery on those cold, foggy days when only a little bit of sunny south of the border food will make things better.\nPlus I don't have to take 2 trains to get there!", "author": "Suzanne G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-06-03", "description": "Yup, this place is Da Bomb.\n\nMakin me hungry already.\n\nHomemade tortillas and excellent salsa.\n\nFriendly service and clean restaurant.\n\nYes, the Sunset DOES have decent Mexican food after all.", "author": "Indigo M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2005-11-17", "description": "Decent to good veggie burrito. Tasty spinach tortillas and good salsa.", "author": "Miriam W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-02-27", "description": "I'd been living in the Inner Sunset for almost six months, when I finally stumbled into this taqueria. You see, I'd lost my taste for Mexican food for about five years after eating nothing but for far too long. It was pure burrito burnout. And then along came a great recommendation to try the tacos at Taqueria San Jose (in the Mission), and my love for corn tortillas and pollo asada was rebord. \n\nSo I finally tried La Fonda and discovered a much better than average taqueria. The first thing you notice is that the place is very clean and the folks at the counter are really nice. I've only had the chicken tacos, and since I'm a taco purist, I just get the base model version with the tortilla, meat and salsa. Oh man, at only about $2.50, you get a heaping, and I mean heapin, mound of fresh chicken and tasty hot salsa. They prepare everything right in front of you. The prices are fare, the horchata is delicious and the chips are free. \n\nI highly recommend this place and I've been going about once a week for the last month.", "author": "Brandon B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-05-09", "description": "Excellent burritos, conveniently (or inconveniently, depending on how you look at it) located across the street from where I work out.  Sort of negates the whole gym-going experience to plow through a super burrito immediately after class but I figure, at least I worked out first, right?", "author": "Amanda B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-02-19", "description": "Really good burrito for $5!  (I had spicy pork/refried/green tortilla)\r\nJust a walk-in walk-out type place, has a few chairs/tables.", "author": "Wesley W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-10-13", "description": "I have to say that this is one of my favorite taco places in the city. Tacos do not come in just one style (just go to D.F.) and there will be the range in terms of variety and style.  While most  places try and emulate style of little side of the road taco stands, La Fonda does not.  Rather, it is more like the tacos you get in chi-chi Mexico City taquerias that are frequented by fresas, but in a good way.\n\nWhile most places have to stick to the one or two meats that they do best, la fonda has a wide variety that are all very flavorful, and not over the top.  They don't do anything perfect, but they do most very well.  It is one of the few places that I don't really use the salsa, because I usually order the cochinita or the mole, and I want to enjoy the flavor of the meat itself.  On the tacos it is especially nice because they use very good tortillas. Also, they make the best sopes I have had in a long time.\n\nDon't get me wrong, there are great places in the Mission, but La Fonda does what it is trying to do as well as anywhere in the city.\n\nAs a final word, La Fonda stands out in terms of its service.  The people that work there seem genuinely nice, and that combined with how pleasant the space is makes it a really nice eat-in experience.", "author": "Nicholas E."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-03-10", "description": "My Fiesty Fiesta friends and I recently came to this place with the burrito eater himself (google him.)  This is one of his top rated burrito...the super burrito.  Unfortunately, I ordered before him, as did a few of my other friends and missed the memo.  Apparently you MUST order the super burrito GRILLED AND IN FOIL.  My burrito (with Carnitas) was sloppy, wet, and actually kinda cold.  I think the foil and grilled-ness would've taken care of these problems.  My friends who ordered AFTER the burrito eater benefited from his vast experiences and ordered the right way.  They LOVED their burritos.\n\nAnother note, we sat upstairs (there is very little seatng in this place) and right above the kitchen.  We were inhaling smoke for a good hour and reeked afterwards.  Next time, order GRILLED AND FOILED and sit upstairs but AWAY from the kitchen.", "author": "Angela S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-09-25", "description": "I haven't decided if it's a solid 4 or a 3.5. Don't get me wrong: I love the food and have been back many times. Plus they're the only Mexican restaurant that serves beefy nachos in this 'hood. I think that the food is \"typical\", but they do a good typical. Great staff and consistent quality.\n\nTimes visited: 10+", "author": "Amy L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-02-02", "description": "I don't come to the Sunset very often so when we ventured out to a bar to watch the Superbowl, It was sheer fate that brought La Fonda and I together. \n\nIt went something like this: \n\n~Drinking starts at 11:30am on the dot. \n~Drinking continues. \n~Watching of the Superbowl. \n~So excited when I think the Cardinals are going to win. \n~Drinking continues. \n~Steelers score in the last 2 minutes of the game and are now surely to win. \n~Throwing of bar peanuts and snack mix at the TV. \n~ Bartender that was our friend is now in fact angry. \n~We stumble out dejected, drunk and starving. \n~ LA FONDA! \n~Ordering of Carnitas Super Burrito to ensue. \n~Pure orgasmic pleasure. \n\nP.S. Does anyone else think of Napolean Dynamite when they see/hear of this place? HA", "author": "Julia N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-01-21", "description": "Great chicken mole!\n\nThe only thing I have tried so far is the chicken mole super burrito... and it is downright heavenly.  This is the best chicken mole I've had in a long time. \n\nI haven't ventured into trying anything else on their menu because I tend to order the chicken mole super burrito over and over again.  If you're a fan of chicken mole, this is your place!\n\nNearby Gordo and L'Avenida are okay in comparison but they just don't have the variety and that extra \"something something\" that La Fonda has.  Quite frankly, I find the burritos at Gordo and L'Avenida to be palatable but blase.", "author": "Lori R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-04-03", "description": "They forgot my order!!!!\nIt's cold and raining outside, and it's around three thirty in the afternoon. There is one other customer inside and he already has his burrito, so I'm the only one there.\nI ordered a super nacho and take a seat, waiting and waiting.\nFive minutes, ten minutes, and after about twenty minutes the lady come with the nachos and said to me \"Sorry we forgot your nacho in the microwave\". Duh????\nWanna gave them one star but that's the only time I went there, so two star for now and I'll try again another time.", "author": "toto h."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-10-08", "description": "'Hot salsa' about as spicy as hospital tapioca; Music from the soundtrack of \"Diez cosas que odio de ti.\" \n\nThree stars because: 1) They didn't poison me or spit in my food; 2) It's cheap; and 3) It's not really below average (and that doesn't speak well for Mexican food around here).  Why can't Taqueria Can Cun or El Farolito move out here?", "author": "Phil K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-10-18", "description": "Good Burritos found in the Inner Sunset! Seriously, this place is pretty good. Although the burritos aren't A+ worthy they are a good neighborhood treat. The prices are very reasonable, $3.80 for a veggie burrito with chips. The atmosphere is pretty cool too. It has brightly colored walls, nice paintings, a cool second level, and hip latino music always playing.\n\nThe people are friendly, and its a place for a reliably good burrito. Maybe not worth going across town for, but good for us Inner Sunsetites.", "author": "Alex O."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-08-03", "description": "When you're craving Mexican food and in the Inner Sunset, you basically have two options: La Fonda or Gordos. There are die-hard fans of both. Personally, I don't think either are as good as the places you'll find in the Mission. But hey, that's across town and sometimes us Sunset-dwellers get burrito cravings but don't have time to hoof it over there. \n\nSo which to go to? I'm a La Fonda fan... it seems less authentic than Gordos, but in a healthier way. This is the type of place where you can choose your tortilla (spinach, sun-dried tomato, etc...) But the quality of the ingredients is better, and you can still get out of there for very little money. When I'm feeling indulgent, I ask them to add shrimp to a steak super burrito. Mmmmm. \n\nMy favorite burrito in the city though is still the super veggie at Tacqueria Cancun. The fresh chunks of avocado area sooo good there.", "author": "Shoshana D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-06-11", "description": "Burritos burritos burritos oh my.  Yummy variety, tofu ranchero, meat, beans and cheese.  They roll 'em up fast and they roll 'em up good.  The line moves at lightning pace until you've dropped 5 bucks on a kickass meat-filled tortilla cylinder.  \nThe nachos my friend got were average.  All others (4 in total) in my party (it WAS quite the party actually) raved over their respective tubes o' goodness.  \nHow many Mexican spots are there in the Inner Sunset?  I don't know, I just moved here, but they'll have to cook it up pretty BUENO to beat La Fonda.", "author": "Eric S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-05-05", "description": "You know, this place isn't that bad. The little loft is cute. But I don't know, I just feel like I was over charged for the the quality of food I got. Don't get me wrong, it was good, but our order came to almost $20 for a quesadilla, burrito, and spanish rice, and it was more of a fast-food sit down restaurant. One plus is that they serve different kinds of meat (ex. three different types of chicken). That was awesome. \n\nI wouldn't really travel out of my way to come to this place though.", "author": "Catherine H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-30", "description": "Every neighborhood needs selection, especially the Inner Sunset.  You have a great selection of bars and cafes, novelty shops, and even bakeries.  Until La Fonda arrived, you had one choice: Gordo's.  Now don't get me wrong, Gordo's is tasty.  I had been going there since high school.  I was partial to it, I admit.  Then one evening after a few drinks at Yancy's, me and my friend realized we were in the mood for a burrito, but didn't want to walk those one and half blocks to Gordo's.  And so we discovered La Fonda.\n\nThe selection of meats and tortillas is much better here.  All the meats have more flavor, and even without the spicy salsa, you can feel the burn, if that is what you're into (which I am).  \n\nThe staff are super friendly, and are happy to tweak your burrito in anyway.  There is always seating, either upstairs or downstairs.  They also have a great selection of fresh salsas and jalapenos.  It's like a salsa bar, actually.    \n\nThis is the place to go if you happen to be outside of the Mission and are craving the tasty goodness.", "author": "Adam E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-06-18", "description": "A fortunate find in the Sunset...great Mexican food at unbeatable prices.  We had the mollettes, a sandwich of chorizo, on a large roll with melted cheese and pico de gallo with refried beans on the side---for $3.20!  Great chips and a decent salsa bar.", "author": "Joc V."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-08-09", "description": "I wandering into La Fonda on a bank run.  Sat down with some of their chips and a super burrito.  Fairly ordinary burrito, but I really enjoyed the salsa bar with the bowl of warm chips they gave me.  Next time, more chips, less burrito!", "author": "Bill H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-05-08", "description": "Good, cheap, and filling. You can eat for under $10. You can get breakfast for dinner here, just order off of the eggs menu. There is a cute little seating area upstairs. The salsa bar has one type of chunky salsa that tastes like it has tomatoes and cooked onions in it (slightly sweet, also spicy) which I liked alot. The place was colorful, not too noisy, definitely not chic. You bus your own meal on a plastic tray. Kinda like a school cafeteria.", "author": "John S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-06-03", "description": "Worst Mexican food that I've eaten. I ordered a cuban torta and while the cook is making it I notice a red sausage or something like that. Once I received my food, I found that it was extremly big. I took a bite out of the torta and oh man what a nasty taste. The meat is supposed to be very thin, mine was really thick and chewy. A few more things that I did not like was the cheese they used. It's supposed to be mexican cheese not chedder. Taking a closer look at the sandwich i noticed the \"red sausage\" and took a bite of it, it was a damn hotdog frank, I've never eaten a cuban torta with a hotdog frank in it. My partner ordered a quesadilla and it was also the worst tasting quesadilla EVER.... We should of kept the original place we were going too \"Gordos\" instead of this disgusting place. Plus most of the food is re microwaved. I also went to grab some more soda and they wanted to charge 1.00 for refill when they already charge 1.75 for a medium cup. I was going to pay 1.00 for the refill and they advised me they cannot take credit card for under 5.00. I didn't have any cash on me either. What a cheap ass the owner is. OK, thats it. :P", "author": "Luis L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-03-18", "description": "YES!  Finally, a burrito oasis in the inner sunset!\r\nI've had the Chicken Tinga, Cochinita Pibil, Carne Asada, and Pollo Asado.  And I must say, they are all quite awesome.  The Cochinita is not a common taco/burrito meat around, and is quite tasty stewed pork, marinated with agave, banana leaf, and some other stuff I can't remember.  The Carne Asada is seared on the griddle just before wrapping, and is quite flavorful.  The Pollo Asado is VERY well marinated and grilled.  Very tasty!  They melt their cheese when they steam the tortilla, and you get to choose between white, wheat, spinach, and tomato tortillas.  Free chips and salsa as usual, and their pico has some nice roasted tomatoes or chipotle action going on.  Very spicy...just how I like it.  Good salsa verde too.\r\n\r\nOwner/manager is nice and friendly.  and gives you lots of chips... more than I want tempting me, but still, he's generous.\r\n\r\nIf it were ~$5 a burrito, I would give this place 5 stars.  But it's ~$6.50 inc tax, so I have to give it 4 stars.", "author": "Fong L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-11-10", "description": "So I read on Yelp that this place wasn't too bad and decided to try it last Friday evening! I decided to try it instead of going with my usual Gordo's order. I went in, ordered the Super Nachos and a Corona, and then was told my bill was over $13. As I was paying it, I realized that was pretty steep, considering the nachos were a little over $6 and the beer was $3. I asked the woman why it was so expensive and she looked at me like I was a cheapskate. Another man came over and gave me the same look. Finally they called the person who I assume was the manager over, and he printed the receipt and looked at me like I was crazy. As I took a look at the receipt I realized the woman charged me for two beers. The manager refunded my money, but acted as though I didn't fairly deserve it. The first back thing to happen in the place.\n\nThen my food was horrible. The beans were bad. The chicken gross. They heated up the sour cream. The guacamole was disgusting. The only redeeming factor was my beer. I would not recommend going to this place! Go around the corner to Gordos were the food is good and they don't try and rip you off!", "author": "Rebecca D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-01-14", "description": "I have been going to La Fonda for years, since high school. I am 28 at the end of the month. I always recommended their food to friends and out-of-towners, sometimes even took my clients for a quick lunch there. Today when i walked in, i order a usual super carne asada burrito. Four more people filed in after i ordered... probably 5 minutes after, all four were served, i sat down patiently for about 25 minutes then i noticed a man who literally came in 5 minutes ago, received his wet burrito,  ( during this time, another man told them he was lactose and tolerant so asked them to not put cheese and sour cream and had them remake his burrito, this same man received his burrito while i already payed and was waiting about 10 minutes) i walked up, noticed, and asked \"you haven't even started on my burrito have you?) In which they replied give us 2 minutes, after two minutes they gave another person the same order, another wet burrito, i demanded my money back, and returned the coka cola. I will never again eat-out at this place, they just lost A LOT of my business.", "author": "Mikhail S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-06-20", "description": "They deserve 2 stars for cleanliness, friendliness, tortilla selection, and acceptance of credit cards (a rarity among SF burrito places).\n\nWhen it comes to the actual food, however, La Fonda doesn't deliver the goods.  Bland describes it best, followed by inauthentic.  The meat lacks flavor and the rice is dotted with--wtf?!--peas and carrots.  While the burritos are cheap and generously proportioned, they just don't taste very good.\n\nI've given this spot a few chances but, I won't be back.  There's too much good Mexican food elsewhere.", "author": "Karin H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-03-08", "description": "HORRIBLE  i been here twice. ..\nFIRST TIME:  so so...\n\nSECOND TIME: i went with 2 people, they forgot the WHIP CREAM in our burritos!!!  and the nachos with disgusting!!!  \n\nI like Mexican food, but i rather sell my soul and go to some \"franchisee\" place like Rubios and Baja Fresh than eat crappppy food from this place.", "author": "Mike L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-07-17", "description": "I was reading reviews for the Gordo's nearby and I took fellow Yelper's advice. They said La Fonda's was much better. \n\nThe staff were not so polite and nice like how yall described them as. Maybe because I was younger than their usual costumers, don't discriminate. Sheesh. I did not get any thank you or you're welcome during my whole time here. They talk really loud, having their own conversation about who knows what. \n\nI ordered enchiladas and my friend ordered steak quesilladas and strawberry aguas fresca. The enchiladas were ok, not what I expected. It wasn't that wet and smooth, but whatever. My friend's  aguas fresca was disappointing. The melon aguas fresca at Ocean Taqueria are much better. I would not come back again.\n\nThe two stars are for their cleanliness and salsa bar.", "author": "Winnie L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-08-10", "description": "la fonda wasn't great nor bad.\n\nthe have a small salsa bar, but no pickled carrots?\n\nthe burrito was plentiful, and it wasn't too pricy... but i feel as thought there weren't as many flavors as there should have been (to be a 4-5 star establishment).\n\nif you're in the area, hit it up. you always want to have burrito joint tick marks on your belt, and it's not bad.", "author": "Ameer N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-05-12", "description": "Good tacos for being in the Sunset.  Filetito asado was tender and tasty.  Al pastor was sweet - I'm not use to pineapples in tacos.", "author": "Elsie D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-04-06", "description": "Today, I had a late lunch with my boyfriend and best friend at La Fonda. Over lunch, we pondered why \"American\" food in any place but America does not taste so sweet. Finally, the conversation rolled around to what people are looking for when they eat \"American\" food in, say, France, or England, or wherever.\nThen, we thought of La Fonda. We're pretty sure this isn't what a Mexican eats in Mexico (though it may have some/many of the same ingredients,) and we're pretty sure that we don't think it's \"proper Mexican (with a capital 'M') food,\" but we do think it's delicious.\nIt hits the carby, proteiny, dairy, cheap, delicious spot. Honestly! For $5.90, I get more food than I can scarf down, and it tastes great! Nicely prepared, everything I want when I am looking for \"Mexican\" food, not Mexican food. Do you catch my drift?", "author": "Colleen M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-10-06", "description": "I dont hate this place, i just think there are better places...I'd only go here if i had a intense craving for mexican, and had no other place to eat in the area.....I had the Salmon burrito which was interesting... i mean it was flavorful but it wasnt amazing....it was probably just shy of good, so it was pretty good, but its not somewhere id bring someone i cared about...\n\ni dont mean to bad mouth them, but i am just not a fan...downright sucks compared to la corneta or ocean taqueria", "author": "Calvinn W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-05-12", "description": "Pretty good. It is quick, and their selection of Fresh salsa is nice. I seem to get lunch here pretty often.", "author": "Kris J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-05-04", "description": "Usually I try to avoid getting mexican round my hood so I can save this delicacy for when I'm in the mission and/or with my latino bf.  dont' want to over dosed on it, okay?  But when i'm home and i'm craving something tasty, filling, fresh and affordable, there's no other place than La Fonda.  I just know it.  Larry knows it.  there's no second guessing, La Fonda fits the bill.\n\nLove, love, love the super taco.  For $3.60 (I think) I can get a mound of goodness that fills me up.  rice, beans, cochinita pibil, guac, cheese and sour cream topped with cilantro=delicious.  their salsas are freshly delicious too.  \n\nThe super chicken mole burrito and was not to disappoint either.  A bigger meal for a bigger appetite.  Yum.  Go larry!", "author": "Elle N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-04-23", "description": "Ok, I admit that I turned my nose up at the thought of a different Mexican restaurant residing in the place where my beloved Pancho's one stood.  So I walked by it for a good 6 months or so with out ever stepping foot inside.  Then one of my roommates dragged me inside and demanded I try their nachos.  \n\nShe is EVIL I tell you EVIL.\n\nSo good.  So very awesomely good.  The azteca nachos are so fricken good I eat the whole damn order by myself. Plus they have the best lime fresca I\"ve had in awhile!  Annnnd you can buy a half pint of their mild salsa (the yummy pico de guio kind).  \n\nI admit I haven't really tried anything else due to my strange need to just stick with one dish per restaurant (I'm a freak, I know).  But I'm trying to adventure out.  The next time (aka tonight) I go to La Fonda's I want to try a taco or burrito or SOME thing different.  I've heard good things from all of my roommates so I'm ready to step outside my boundaries!\n\nClearly I take food way to seriously....", "author": "Heather H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-11-05", "description": "I was so bummed this wasn't that good.  I LOVE mex.  \n\nThe enchilada sauce was sweet.  I had to drench it in hot sauce.  The nachos were just okay.  The taco with filet was just okay.  At least the refried beans were good.  \n\nService is wonderful but DAMN I want some good mex food!!  If anyone can tell me of one remotely close to Inner Sunset, please do.  Thanks.", "author": "Staci M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-04-22", "description": "This is just so freaking awesome to have right around the corner from my house... nice to not have to go over to the mission on a lazy Sunday for some Mexican. \n\nGreat salsa bar, pickled jalapeos \nQuick pretty authentic food\nAll the meat choices you can think of... and some you dont want to... \n\nLuckily I was able to visit with my little brother from Southern California... and both he and I have fairly established taste in the realm of taquerias and salsa bars... and both walked away not only full, but impressed with the selection and execution.", "author": "Jordan Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-11", "description": "I went to La Fonda on empty.  I ordered a chicken burrito with black beans, spicy salsa on a wheat tortilla.  I love that you have the option to choose a tortilla.  I ordered to go and was very very satisfied by both portion and flavor.  The salsa bar was flavorful and delicious. I will for sure be visiting again soon.", "author": "Andrew Christian C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-09-02", "description": "I really, really want to like this place. I tried it tonight for the third time and again came away disappointed. The corn tortillas of my enchilada were dry and crunchy around the edges, the tortilla chips somewhat stale and chewy. The chicken was ok, as were the beans and rice. Maybe it's just been too hot and their product is getting older faster than expected?? \n\nAnd - the woman ringing the sale has the prices memorized plus tax so beware if you're paying cash. She failed to ring up my cash sale, so I didn't tip given that she'd already gotten $9.58 out of me. Just to be sure I waited around to see if she would ring it up, but no, next customer in paid with a credit card, which of course she had to ring up. So pay by cc when visiting this place to ensure the owner is getting his or her fair due.", "author": "sherri s."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-01-25", "description": "La Fonda is my go-to burrito place. Their food is as good as it gets for a burrito shop and the staff is incredibly sweet.\n\nIt isn't easy to find burrito shops that offer sliced avocado, which I prefer over guacamole (my girlfriend wants me to mention that their guac is amazing). I usually go with a bean, rice, cheese and sliced avocado burrito on a whole wheat tortilla. Heaven is the next 15-20 minutes.\n\nForget Gordo's. La Fonda blows them away with better ingredients, better selection and better service.", "author": "Todd M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-03-07", "description": "Very Nice place!  What impresses me most?  How Friendly they are!  Most burrito places just don't smile or act friendly to you...but here, what I feel like a customer!\n\nBurritos are cheap and done well.  Only 4 because they do not grill the tortilla.  Still, it is now the best in the sunset!", "author": "Sir Paul L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-09-19", "description": "This place makes some seriously fresh and tastey Mexican dishes!", "author": "hayley t."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-27", "description": "This restaurant is pretty close to where I live and one of the better places to grab a burrito. The ingredients are fresh, the service is fast and the prices are pretty cheap. I also love that they have a good selection of salsas, something that's needed in a Mexican restaurant.", "author": "Terry K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-09-06", "description": "This is the best taco joint in the Inner Sunset. \r\nI eat there once a month.\r\nTry a chicken burrito drowning in mole sauce.", "author": "Joe C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-05-08", "description": "This was the WORST burrito I ever had.  The guacamole tasted like face scrub, and their secret ingredient is obviously water, because my burrito was sloppy and wet.\n\nBarf.", "author": "Andy G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-07-07", "description": "Good mexican food close to home. I really like the empanadas and the chicken torta. Generous portions. They charge for guacamole which at this point is to be expected but a bummer nevertheless.", "author": "Katrice S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-04-09", "description": "i wanted to try something different i mean other then gordos, the burrito was good nothing special... but i'll come back and give it another try, it's really hard to get parking so be prep. lolz", "author": "jonathan h."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-03-28", "description": "You can basically make your own burrito as big as your head.  First you pick the style, then the wrap and finally the meat.  Within 5 you are good to go.  Go to the salsa and pickle bar.  Great price!", "author": "Megan P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-22", "description": "I have been on a hunt for sopes in the city since I moved here, and must say La Fonda's were quite tasty. Tasted very fresh and hand made, and the salsas were good as well. If you need a quick, tasty mexican dish on Irving, I would definitely go here.", "author": "Clay T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2005-08-01", "description": "Best chips in town!  Yummy and good-sized veggie taco for $2.80.  Friendly service; tip them well!", "author": "George K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-04-27", "description": "The Miraloma and Ocean taquerias have proven that west-siders can enjoy quality burritos without an obligatory pilgrimage to the Mission.  So you'd think that Inner Sunset, the mecca of the eclectic palate, would have a great offering as well (beyond Gordo, which is a chain).  I was hoping La Fonda would be that place, but, while the balcony seating is fun and all, the food just doesn't go for broke like a classic taqueria must.  And the portions are pretty skimpy.  Granted, we had the chicken fajitas, and to be fair you really must judge Mexican on the burrito standard (or, if you're really anal, the carnitas burrito standard).  I'd like to try some of the more interesting meat types like Tinga or Azteca before I really pass judgment...but with all the delicious smells in the Inner Sunset, it's sort of hard to follow your nose back to a place like La Fonda, if you know what I mean.", "author": "Wes M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-04-25", "description": "Good prices, good food and friendly service.  Also, the burritos are HUGE!!!  Definitely more than enough for one person, that or you'll start having to buy larger jeans.  Awesome.  Although I do have to admit that every time I hear the name of this place I think of Napoleon Dynamite.", "author": "Kate B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-02-23", "description": "I  do like the La Fonda, not only because it was the girlfriend's name in Napoleon Dynamite, but also the staff is really really sweet.  The burritos are big and juicy, my biggest problem is that they put lettuce in them.  I luckily remembered to have them leave it out the last time I dined there, however, if you forget, the re-heating of you second half, also known as dinner #2 gets a little weird w/ hot lettuce.  They also have my new #1 criterion for a rocking burrito place, salsa bar.  This is a good one too, nice spicy salsas and a big fresh bowl of cilantro with my name all over it!", "author": "Brye L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-11-08", "description": "overall a pretty solid place, but I have to admit i come here for the two-for one burrito deal. i was raised on southern california's version of burritos, and SF's style cannot compete with. But not bad for sf burritos.", "author": "Katie S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-11-08", "description": "I haven't been here in years, but I remember their burritos were good! I like how the place has a lot of room to sit. I believe there is a upstairs where you can dine. Pretty neat! This reminds me... I should come back for a burrito sometime soon!", "author": "Edgar G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-05-16", "description": "If you can help it, venture outside the Inner Sunset for mexican food. But if you can't, La Fonda will probably do. I got the super veggie burrito which was fine, nothing spectacular but not terrible either. On the plus side, it was super cheap", "author": "Aubree S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2005-09-14", "description": "I am a semi fan of this place.  I'm not a huge Gordo fan and L'Avendia is not on my top ten either.The tofu burrito gets a thumbs up from my veggie roomie who doesn't eat tofu!  The Cochinita Pibil is good and I highly recommend it.  They have a Spicy Chicken Burrito too...mmm...yummy.  It's only two blocks away from my house!!  The owner is super nice, too.", "author": "Jay H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-09-13", "description": "Dammit, they raised their prices...The portion size and flavor of the veggie burrito is good...but what was really their draw before was a decent burrito at a good price.", "author": "Liza W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-11-09", "description": "Really like the tofu taco. Tasty and healthy, i.e. not oily or salty. Mmmm.... getting hungry just thinking about it...", "author": "Yvonne C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-06-10", "description": "You can't beat the prices.  The corn tortillas are tasty and there are several vegetarian options (including a decent tofu taco).  The service leaves a little something to be desired, but you can't ask for very much with a $3 taco, or a $4 huarache...  The \"salsa bar\" is also lacking....  stay away from the red salsas, but do try the tomatillo.  It's deliciously tart and just enough heat to lend a little bit of kick.", "author": "vicarious c."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-17", "description": "I went there last night with a friend and ordered the Super Veggie burrito and the cinnamon horchata.  This order came with complementary chips and salsa.  The burrito was decent but everything had the same texture so it tasted kind of mushy.  The portion was great though and I saved 1/2 for lunch the next day.  The horchata, however, was amazing and not too sweet which is my pet peeve!  Yum!! Definitely a must order.  The chips and salsa were definitely disappointing.  The chips were not really good at all and there were only like 3 salsa options, each of which was really watery.  The tomatillo salsa was good but I tend to like salsas that are on the more chunky side.  I'd definitely come back because the price is good and the staff is nice, but its not a place that I would go out of my way to go eat at.", "author": "Andrea F."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-02-09", "description": "Twice I've ordered the Azteca burrito, no beans and no guacamole (allergy) and twice when I get it home it has guacamole on it so twice they've offered me a store credit. However, once bitten, twice shy so just try PAYING ATTENTION and keep the credit.", "author": "Nikke G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-04-28", "description": "Met up with some friends to grab dinner here prior to trivia night in the neighborhood. The entire menu looked great but I ended up going with the Veggie Burritto which consists of beans (you choose b/w refried, black, and pinto - I went with refried, yum!), rice (spanish rice! not nasty white steamed rice like Chipotle), salsa, and cheese. I asked them to add guacamole into the burrito. It was delicious! Unlike a lot of burrito places, the portion size was filling, yet manageable. I tried out the milder side salsa as well as the salsa verde and both were delicious - the verde was a bit spicier than the red salsa I got. They also give you a side of tortilla chips with your meal. Definitely worth a try and satisfied a recent craving I've been having for some quality mexican food.", "author": "Megan B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-07-22", "description": "Not sure what happened to this place but a couple years ago it was good. Just stopped in and got a pork burrito that fell apart in seconds. Ended up eating it with a fork. The pork was alright but lacking in that it was just a pile of spilled burrito ingrediants rather than an actual burrito.", "author": "Colin F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-11-04", "description": "Staff isn't very friendly even though I'm always really nice and tip. Sad face. They seemed to get a little friendlier when they realized I spoke Spanish, though. Annoying. But they do have those little mini tacos that you get on taco trucks. Not as good, but they CAN suppress my cravings for a little while when I can't make it downtown.", "author": "Melissa C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-01-15", "description": "This is the most cursed taco shop in all of  San Francisco.  That's why it gets 4 orange stars.  There is bad juju on this spot because a restaurant starts and closes up here almost every month.   I think this used to be an old Indian tomb or DMV or something.  Then it was an Italian place.  Then it was a California place.  Apparently the spirits are happy with this taco/burrito place.  It's clean, nicely painted and the tacos are good.  They also have good mole.  It's always nice to see the little touches that make these places stand out.  Here it's the cochinita pibil (pork with spicy sauce).  My buddy from South Dakota likes it, only because he likes to say \"cochinita pibil\"  over and over, along with \"horchata.\"", "author": "ed y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-11-18", "description": "I love the Aztec burrito. It's big, messy, and hit you in all the write places. If you're not going to get that, then I recommend going to Gordo a block away because everything else seem a little overprice.", "author": "Nam T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-11-19", "description": "Eat here at least once/wk. Neighborhood favorite b/c it's cheap, tastes good (for nocal), and the service is friendly and quick. Typically get a super veggie burrito on a tomato or spinach tortilla sin lechuga (avoid drippage). And a regular taco. I'd recommend over Gordo's and L'Avenida, both of which I've been to a number of times.", "author": "Ben L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-03-19", "description": "Cheap, fast and delicious! I love the tacos and the salsa bar.", "author": "Elizabeth H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-02-07", "description": "I usually don't come here because I've had bad experiences in the past.  Tonight that has been confirmed.  They messed up my to go order, but I'm ok with that, they forgot guacamole.  I figured it out when I got home and promptly went back.  They looked uninterested and gave me a tiny side of guac.  I asked for a little more and they wanted to charge me $1.50.  I couldn't believe it, awful customer service with no apology.  This is why my business goes to Gordo's.", "author": "Jesse S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-12-29", "description": "La Fonda is pretty good. Look for the coupons to get a two for one in the monthly \"value pack\" that arrives in the mail.", "author": "Jonathan F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-12-09", "description": "It's pretty obvious from the minute you walk into this place that it's not going to be authentic, so you can't really knock it for that. It's too clean, and they were playing Modest Mouse. The tofu taco is pretty tasty even though it is way too full and soggy to pick up. I've also had the veggie super burrito which was just ok. Not too bad for the sunset.", "author": "Jessica S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-02-06", "description": "I think La Fonda has finally broken the curse of 712 Irving St.  Over the past 4 years there have been at least 3 previous restaurants that have had to shut down, but La Fonda keeps going.  The Azteca burrito will satisfy even the heartiest appetite.  The corn quesadilla with beans/rice extra is a full Mexican meal for only $4.29...you just can't beat that!", "author": "Kelan T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2007-10-14", "description": "I've been here on 4 different occasions and ordered a different dish each time.  And every time I was completely disappointed.  The food was greasier than the average Mexican food, and it didn't even taste that good...not worth it. Go to Gordo's around the block instead. They are fast, pleasant, and best of all, all of their food is delicious!!!", "author": "Rosie S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-06-18", "description": "Not the best burrito places you will meat. They aren't that big, but are not that bad. I would have loved the place more if they had hot sauce bottles around on tables or if they tin foiled their burritos. It would have made it easier to hold since I would rather prefer to eat it while holding it rather than using forks or knives.", "author": "Sonlay V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-01-24", "description": "I see everybody here talking about the tacos and burritos, which are decent enough (esp. for the Sunset) with fresh ingredients, but y'all gringos are missing out on the other half of the menu. Seriously, has nobody else tried the alambre? Try the alambre, motherfuckers!!!", "author": "Sarang D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-07-05", "description": "I do love enchiladas.   Particularly with mole.  The chicken was a little tough, but it might have been because they were take away and had to be taken away and carried for a bit.  The salsa is pretty good, if a bit watery, but REALLY I JUST LOVE ENCHILADAS.", "author": "diana s."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-12-13", "description": "Good prices and good food.  So far it's been better than L'Avenida up the street.  La Fonda is not as good as the burrito places of the Mission, but since we can walk there it gets and extra star.", "author": "Jeffrey F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-08", "description": "cochinita pibil plate.  good stuff.  \ni like the feel of this place, and that it's open til 10.  \n\ndo it.", "author": "aaron p."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-08-19", "description": "Not bad. A little light on the non-meats variety, but that's not their focus. Love the name... It reminds me of Napoleon Dynamite's brother's girlfriend. So they get a plus star for that alone!", "author": "Laura B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-10-09", "description": "First, what's the point of posting a menu if the prices are rediculously out of sync with reality. The restaurant curiously has no printed menus to take for reference.  The currently posted online menus (at allmenus,com and campusfood.com) I could find both listed a regular burrito at $4.95 yet in reality they're 26% more than that - $6.25.  And as far as the quality of the food, I continue to be seriously curious how anybody can rate this place as good!  This time I tried their chicken mole and have to say it was a laughable attempt at this dish.  Saying the flavor was one-dimensional would be a overly generous.  So, I'll try to remember to read my own reviews next time I get desperate for Mexican in my neighborhood and avoid this place.  After a few tries over a number of years I can say with confidence that they are a sad excuse for Mexican food.", "author": "j d."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-14", "description": "Big fan of the beef super burrito and the chicken super tacos. The salsa is pretty good and the staff is friendly. This place is really close to my house so it is my usual spot for fast Mexican. However, be warned that the Mexican sandwich is not for to-go. By the time I got it home the bread was a soggy mess. Ew. Another time I ordered fajitas to-go and they forgot my tortillas! I had some extras in the fridge so it wasn't that big of a disaster, but it was a little disheartening. Despite these two minor setbacks, I really enjoy La Fonda.", "author": "Juls M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2005-07-26", "description": "it's easy to walk by and not even notice the newest mexican restaurant in the inner sunset with all the construction going on, but after one bite of this heaven in a tortilla, all i could think was \"WHERE HAVE YOU BEEN ALL MY LIFE?!\" i love their azteca burrito (rice, beans, meat topped with enchilada sauce, sour cream, guac, salsa and melted cheese) with the cochinita pibil pork with a hint of banana leaf. this place beats l'avenida any day, but that's another story. i'm just happy i don't have to go all the way to the mission to get a decent burrito.\r\n\r\nupdate: i went here again and had their flautas. i think the chefs had no idea what they were doing and were probably not the regular chefs because i watched one of them trying to fry an egg. she ended up throwing away like 10!!! also their salsa is watered down! what happened?!!! the last experience was not tasty so i had to take away two stars. DEMOTED!", "author": "Tin-Tin E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-09-10", "description": "This spot gets one extra star for being in the Inner Sunset.  When I lived there it was great to have an alternative to Gordo (blech).  If you get a burrito, make sure you get the flour tortilla.  The others don't soften up and makes the burrito somewhat chewy.", "author": "Paul W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-02-01", "description": "Yummy burritos and tacos.   I make a habit of every burrito place I go that I get a carne asada on my first time there.  It is my favorite meat and it makes for good comparison.  This place scores high on that count.  La Fonda's burritos are good sized (either one huge lunch or I cut in half and save for a light dinner later) and good priced.  The meat is high quality, I've never noticed any gristle or yuck to it and it had lots of flavor.  I've noticed a trend towards sauce-y burritos-- not a bad thing, just that the meat/gauc/sour cream/salsa combo here makes a nice mixed up combination that soaks into the rice and tortilla a lot.   Sometimes when I get it to-go they throw chips in the bag, sometimes not.  But their thick and crispy tortilla chips are yummy so make sure to get some.", "author": "Shelley M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-03-25", "description": "Given that it's in the sunset, it's not bad. Compare the Mexican food in the mission, it doesnt' stand a chance. I had a burrito here this afternoon after reading all the Yelp reviews, and I wasn't all that impressed with it. But the food was filling and overally got the job done.", "author": "Srinivas R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-07-16", "description": "The inner sunset isn't exactly known for it's Mexican food, but this is the best that it gets in the foggy side of the city. Great homemade chips, a wide variety of salsas at the bar, and the food is cooked while you wait. I mostly grab my stuff to go while I'm on the way home from work, but if you're ever in the area, skip Gordo's and try this place out.", "author": "Tim T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-11-29", "description": "Great Mexican food in the Sunset/Irving district.  I had the Cochinita Pibil dinner plate which came with salad, beans, tortillas and chips and it reminded me of the Pibil that I had when I was in the Yucatan.  Throw in some Jamaica, and the bill was still under $10!  Fresh made salsa to boot...", "author": "Mark D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-09-11", "description": "They serve a fairly decent veggie burrito here, definitely better than Gordo in my opinion. Especially because of the tortilla chips that come with it...those are really good. I don't much like the salsa they use, so I just do without. Good service too!", "author": "Barbs J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-08-29", "description": "Not bad for a burrito joint in Sunset. Fast service. Good tasting chips and salsa. Clean atmosphere. The agua fresca es muy delicioso. Down side? Very, very poorly wrapped burrito (it doesn't stay rolled). Unfortunate, really. But still worth a try if you need a burrito fix and can't be bothered to bike, bus, or bring your booty over to the Mission.", "author": "Chung N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-03-29", "description": "Today, me and the bf decided to go to Irving St. & spontaneously pick a restaurant to eat at.  It was between CrepeVine & La Fonda, so we went with this one.  We both got shrimp super burritos for $7 bucks! Pretty good prices considering most taquerias charge extra for seafood. The burrito: huge, although I didn't like how they didn't come wrapped in foil which is how I'm used to eating one. The shrimp was really fresh, rice had peas & carrots in it, which was unusual to me. Now, I know that burritos aren't authentic Mexican but I felt like I was eating at Chevy's or something. Pluses: Unlike Taqueria's let's say in the Mission, the food wasn't as heavy.  Ooh & their fresh strawberry juice was the besssst! Overall, food was ok, prices were reasonable,  just a new place to try out.", "author": "Kristine R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-12-04", "description": "The minute my eyes glanced over the menu I couldn't help repeating to my boyfriend \"wow -this place is cheap\". After living in Russian Hill for the past year any quick bites under $5 is a deal. For breakfast I got a huge plate of rancheros huevos and he got a breakfast burrito all for under $10. The food was fresh and delicious, and the service was quick.  Their salsas are also really good.   I will definately visit this place again.", "author": "Kat F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-03-05", "description": "i love la fonda. it might sound ghetto-fabulous, but in actuality, it's just fabulous. it is the best place to get a burrito in the inner sunset, hands down. be warned that their burritos are big, so you need to welcome the inevitable food coma that follows.\n\nthey have really great carnitas and chicken mole that even my boyfriend (a self-described \"beaner\") loves. they also make the best breakfast burrito (try the chorizo and mushroom), have a variety of choices for your tortilla wrapper (spinach, sun-dried tomato, flour, wheat), have delicious agua frescas (sandia and fresa are my faves), free chips w/ the meal (which deserves a \"yay!\" since some burrito places make you actually pay for the chips - poo on that), beer, and a fresh salsa/pepper bar (please don't sing that quiznos rat song about pepper bars). super sweet folks work the counter and custom make your burrito exactly to your liking.", "author": "Veronica Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-07-24", "description": "This place is sooo good and so filling. For a local sunset place, and not a neighborhood gordo's this place makes burritos covered in enchilada sauce. That is one of the best things i have ever tasted. Which reminds me I haven't visited  them in a while. Price wise not at all expensive. Quality wise....yuummmmooooo", "author": "yana Z."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-03-19", "description": "I'm particular about the burritos I like, and this place was just not the right fit. Why is there lettuce in my burrito? I just don't know. It wasn't even warm. If I were to do it again, maybe a more specific order would produce a more enjoyable burrito. The pork looks tasty though.", "author": "Faye P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-05-20", "description": "Had a burrito here after Bay to Breakers. Very tasty, good salsa and reasonably priced. What more can you ask for from a burrito?!", "author": "Jan Michael K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-02-03", "description": "I'm really not a fan so far, although to be fair, i've only been here once. I ordered the Super Chicken Burrito w/ the sauce on top (forget the official name). The sauce tasted a little \"off\", maybe they added too much nutmeg? But the one thing that is completely in-excusable to me was the guacamole. I ordered a large side/appetizer portion, and it was completely inedible. NEVER have the bf and i left guacamole behind, but it was so watered down and tasteless that we couldn't even force ourselves to like it. Too, we didn't feel so good when we got home. I've definitely had better!", "author": "Sandra D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-05-13", "description": "Great safe and clean Mexican food in the inner Sunset. A little more pricey than other locations in the Castro, Noe Valley or Diamond Heights but, hey, none of those places are close to this one so you deal with it.", "author": "Alden C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-02-27", "description": "i used to live in the mission.  when i lived there i ate a lot of burritos.  then i moved to the inner sunset and i didn't eat any burritos for a while.  when i was ready to start eating burritos again i found la fonda.  it easily destroys any other burrito shop in the sunset and can even hold it down vs. some the mission's finest.  for real.  \ntry the chicken mole or al pastor burritos.", "author": "Andrew F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-08-14", "description": "pro: quesadillas packed with grilled chicken and guacamole\ncon: spicy sauce\n\npro:  chicken enchilladas with verde sauce, rice and black beans\ncon:  spicy sauce\n\npro:  fresh baked chips\ncon: spicy sauce\n\npro:  great service \ncon: spicy sauce", "author": "Grace C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-11-11", "description": "They must have a beer license, but no rita's were in site.  Darn!  \nI had the Paradise salad, add chicken and I was impressed!  For a salad that is :-)..it was fresh, the chicken has a smoked grill taste. I tasted my friends dishes and frankly, I'd rather go to chipotle for a burrito. It was not good.  My friend had a humungous omelette with potatoes super drenched in oil..too greasy!\n\nI asked if requested would they make an egg white omelette. The reply was no.  That sucks.  \nThe chips were cold too, but they were ok.  \nI would not come out of my way to come here, but if I had to I'd get the salad again!  Now I know what cojita cheese tastes like..yum!", "author": "Bella G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-01-06", "description": "FRESH! \n+'s \nGreat for vegetarians! \nSalsa bar excellent. \nChips great. \nBurritos made with your choice of tortilla (spinach, wheat, etc.) \nAmbiance is a bright colorful mix. \n\n-\nNot open late night!", "author": "Juhi D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-03-21", "description": "Clean and comfortable. The chipotle salsa is spicy and tasty. My burrito was good, but I didn't like what I ordered. I ordered the Azteca burrito with marinated pork. There was a taste of cinnamon to it that I didn't like; I'm not sure if that was the \"Azteca\" or the \"marinated pork\". I should have stuck with my old fave carnitas.", "author": "Rob T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-08-20", "description": "The food here is solidly good--not earth-shattering, but very good, especially considering the good price. The chips were warm and crunchy, the staff was nice, and the place was clean.", "author": "Ramon E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-11-02", "description": "I love La Fonda, the staff is nice and you get your food really fast!", "author": "T C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-01-07", "description": "So my first (and subsequently only) time dining at La Fonda was a very disappointing experience. I ordered a vegetarian burrito, and it literally tasted like nothing. It was so bland, that I had to make dinner for myself when I got home. I sparred myself the calories. Next time I will go down the street to Gordos.", "author": "erin s."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-02-21", "description": "Pretty good, I have had better. I like the location but other than that it is just an irving streamlined version of a real taco shop.", "author": "Ryan O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-05-29", "description": "I didn't think nor-cal's non-tex-mex tipo de burritos could be so darn savory. I sit upstairs with my ole homie matty p when I visit the bay and wharf down the best breakfast burrito's you could ever imagine possible. You'll get so full that you'll forget your hangover from the night before at gnancy's.", "author": "Brian M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-06-30", "description": "The interior was nice. The food was not. Yet another reason for me to stay on my block and eat Gordos, and for that I am sad.", "author": "James J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-08-20", "description": "I like going here with friends for drinks and getting a few side dishes with the drinks.  Their guacamole is fresh and yummy.  They have a tasty choco cake, a great ceviche, and these little quesadillas in a crunchy empanada casing.  My meat eating friends like the skirt steak and the lamb.  I like the shrimp and chicken tamale.  Finally, they have a great deal on flights of tequilla and rum so if you're in the mood for some hard a, go there!", "author": "Annie F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-04-05", "description": "Not bad for Mexican food in the Sunset, really. Definitely better than La Avenida (not hard) and often better than Gordo's. Although Gordo's quesadillas are MUCH MUCH better than La Fonda's. In fact, do NOT order La Fonda's quesadillas. Cheese never quite melted all the way through and tortillas not grilled long enough.  \n\nCarnitas are actually quite good too, not too dry or fatty. I even tried the very un-Mexican \"wet\" style burrito (Azteca?) with enchilada sauce.  Sauce was okay but a bit too sweet for my taste but again pretty decent size for the price.  Doesn't hurt if you use one of the \"buy one get one free burrito\" coupons that come in ValuPak coupon package. \n\nPluses:\nFood seems fresher than Gordo's on Ninth Avenue.  \n\nLarger portions than Gordo's.\n\nMore choices on the  menu (not just burritos and tacos) than the other local Mexican taquerias.\n\nBreakfast burritos available.\n\nMinuses:\nService can be hit or miss. You HAVE to watch your order being prepared because they often get it wrong...even the simplest of orders. And god help you if you call your order in...you're liable to get a cheeseburger instead of the burrito you ordered.\n\nCashiers not always the friendliest...esp. the women..not sure why.", "author": "rosie t."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-06-19", "description": "Absolutely Love this Place!\n\nThere food is authentic and delicious! What more could you ask for.  When I say authentic, it means it is not greasy or piled with cheese, cream or anything else that ruins great flavor (unless of course that is what you want then they will add it).The service is quick and great, they are all so sweet and friendly.\nLove th chips and the salsa bar, definitely some the best !", "author": "Lissi A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-07-24", "description": "I used to eat at Gordos all the time not knowing La Fonda was right around the corner.  For me, it's hard to Fuck up a burrito, but once I saw La Fonda and ate there, I knew Gordos had been doing just that.  After eating a gazillion burritos at countless Mexican places over the last fifteen years, I can say that La Fondas rad as hell... and cheap too.  I can bust out of there with a belly full of veggie burrito for under five bucks.  Five stars.", "author": "David V."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2005-08-06", "description": "Not completely foul, but if you want nothing more than a delicious burrito... this isn't the place. I wasn't a fan.", "author": "Alexis T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-12-30", "description": "Best mexican in inner sunset. I should qualify that by saying my pronouncement comes  solely from the super burrito al pastor. Gordo's and l'Avenida were not as good as La Fonda which beat them by far in the al pastor super burrito category.", "author": "Snora E."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-01-18", "description": "The employees are really nice. Decent meals. Serving size is a little too big. The meat is no good.", "author": "Al A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-05-05", "description": "Pretty standard slightly upscale burrito.  It costs $7-8.  There's Gordo's right around the corner, but I'm not feeling Gordo's, never have.  So there you have it.", "author": "Martine D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-03-16", "description": "i hate gordo's and am suspicious of l'avenida due to yelp reviews, but ventured into la fonda after reading emily's review.  mmmm, am i glad that i did!!  the sunset does have passable mexican after all!!  first of all, their chips were some of the best i've ever had.  also, their super veggie burrito was really fresh, big, cheap, and good.  i'm definitely coming back here (maybe for dinner tonight :) ).", "author": "Roshni R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-09-09", "description": "this place is very nice.  i have a friend who lives in the neighborhood, and this has become a part of our regular dining rotation.  i particularly like their corn tortillas, which are thick and fresh, with a hint of a smoky flavor.  the menu strikes a good balance between heavy and non-heavy items.  the burritos have a nice heft to them, while the tacos are light and tender.  the nachos are covered in gooey beans and cheese, while the aguas frescas are light and not too sweet (jamaica is my favorite of their flavors!).  prices are a little higher than in the mission, but it's still a cheap dinner in this neighborhood.  i also like that they heat everything on the griddle instead of the steam table.", "author": "emmie k."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-02-21", "description": "Ahhhhhh yummmmy cheap vegetarian Mexican food... what more can I ask?  Oh, I know... how about NOT charging me for the sour cream that I ask for on the side?!!  Aside from this minor gripe, I have nothing negative to say about this cute little authentic-looking Mexi place so close to my house.  Clean and colorful interior (with high ceilings so you don't go out smelling like Taco Bell, THANK GOD!) and quick friendly service, and the food... well the tofu taco that I ordered was very delicious, with the tofu being just the right texture (very firm) and perfectly seasoned without being too salty.  And the black beans were scrumptious as well.  So yes, a simple but wonderfully delicious $2.20 taco is going to entice me to come back to this place, in spite of the stinginess with the sour cream.  My next target will be trying their \"Tofu Ranchero\" burrito... should be interesting.  Also, I'm sure the restaurant owners did not intend this when they named their business, but I can't help but crack up every time I'm reminded of how much this restaurant almost shares the same name as a Napoleon Dynamite character. LOL", "author": "Catherine C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-02-12", "description": "So, I've had their burritos and their tamale dinners. Not a fan of hte burritos, kinda bland. The tamales, however, were really good! Now, I do want to mention to the foodies out there that they do microwave already refirgerated tamales, but from how long tamales take to make from my understanding, I don't blame them. The microwaving didn't seem to detract from the flavor at all and there were no hot and cold patches. The portions were huge with 2 tamales, full helping of rice and beans and a small salad. Yum!", "author": "Jennifer D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-01-21", "description": "Great food, great prices, great spot. Their tofu ranchero burritos are so good!", "author": "Maximilian M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-01-16", "description": "as I was walking to gordo's, I passed la fonda and realized I'd never given it a try.  a good friend of mine recommended it a while back, so I figured why not.  their menu is big and offers a lot of different things you can't get at most taquerias, and they have a little salsa bar which is always fun.  my super chicken burrito was sooo disappointing!  it was made so small that the tortilla was rolled in itself, resulting in a big glob of tortilla in every bite.  the proportions of the fillings were insane: 80% chicken, overpowering the flavors of everything else; in fact I can't even remember tasting guacamole.  maybe one day I'll go back and try different things on the menu.  but as far as a take-out burrito from the sunset goes, I'll stick to gordo's.", "author": "Jen P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-10-09", "description": "i tried the spicy/ tinga chicken burrito, it's kinda bland. i like the chip, and salsa has distinct roasted flavor. the place is quiet small but nice and clean, that's one point. i found that burrito at burrito express in outer sunset are tastier (but i don't like the place).", "author": "Suki S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-04-12", "description": "I've tried them 3 times now, but I keep coming to the same conclusion: They are really, really, really bad.  If you own El Farolito and you are reading this, please open up a store in the inner sunset.", "author": "Brandyn B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-02-11", "description": "this is a chron pick, and after two picks, delete.  nicely redone spot with alot of up but the food and service will have the out of business sign sooner than later ... hard working staff but lack of coordination, ordered special, staff:  what is the special? helpful, real nice, butt, lack of confidence shows ... food arrived in timely manner, but cold ...  next time i come here i will order burrito from gordo, buy beverage from fonda and utilize their cozy upstairs hide-away for secret rendevouzs ...", "author": "tim y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-08", "description": "went here last night with a couple of girlfriends. we were no less than wasted, but I thought this place was pretty darn good, intoxication aside. we ordered two tacos, an empanada and nachos. total was $18 I think, which is pretty good. I ate the empanada and it was tasty. grilled poblano peppers with some sort of cheese. nachos were plentiful and covered in guacamole. I can't wait to come back when whiskey isn't coming out of my pores and I don't have such bad munchies. that will be the ultimate test.", "author": "Cathleen M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-08-13", "description": "I am so fond of La Fonda that Chipotle has some serious competition for my $$$. Burritos are good sized (meaning large), fresh and of course filling", "author": "Che G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-02-19", "description": "i took my friend out here last night for her 26th birthday! woo! and for the most part we had a good time. the food was affordable, the atmosphere was pretty nice for a taqueria, and our steak quesadilla was damn good! we also got a chicken burrito which i think was okay but could have been made better just by heating it up a little. i would definitely go there again, but this time i think i'll try something meatless and have them heat my burrito up a bit. overall if you like tasty, fast, and inexpensive, this is the place to go!", "author": "Melissa A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-06-05", "description": "nice  selection of  tasty eats...    it has become my favorite   'food log'  stop, since the other local fav  has  not been doing it for me since it under went changes.", "author": "dan s."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-01-03", "description": "there are 2 better burrito places within a block.  Even when ordered spicy, the heat is lacking.", "author": "Klite A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-02-03", "description": "To sum this place up I would say this joint is always consistent when it comes to great service and their bomb burritos which are always on the grande side and loaded with fresh veggies...yumm:)  Oh yeah did I forget to mention this place does NOT break your bank account.", "author": "Kellie R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-07-23", "description": "they have some of the best spicy chicken burritos that you can get...it is definitely their best one!! they make a perfect size burrito and they are always friendly!!", "author": "J C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-07-17", "description": "pretty good burritos and always a deal when you bring in a valpak coupon! buy one get one free, how could you go wrong?!", "author": "Lisa M."}
