{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-11", "description": "This is definitely the best taqueria in the Bayview, and I feel it rivals some of the best in the Mission as well.  I work just down the street, and have turned this into one of my more frequented lunch spots.  The food is awesome (and consistent), and the staff are always friendly.  I've also never had an incorrect order here, which is nice!  All of the meats are juicy and flavorful, and the shrimp are always cooked perfectly.  The nachos, salads, and any of the shrimp dishes are particular favorites.  I am, indeed, aware that nachos aren't exactly a Mexican creation, but who the Hell cares?  They are awesome!", "author": "Evan M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-17", "description": "My husband seemed to think the food was amazing. Not exactly my thing, but he loved it. It has a sweet familial vibe. I liked my green chili cheese enchiladas.", "author": "Camille L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-28", "description": "Clean, friendly, quality and value.   My first time to the neighborhood taqueria and was very impressed.  Got the vegetarian super burrito with black beans and chips and salsa. A surplus of food bursting with flavor.  Chips were fresh, but not greasy.   Salsa was green, mild and not too spicy.  The friendly staff greeted me with a smile, warm and welcoming. All for $8.75. A memorable, delicious, celebratory cheat lunch meal from my normal intermittent fasting routine.", "author": "Gavin M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-18", "description": "Experience from 8/17/2017\n\nLa Laguna Taqueria is awesome and the guy at the register is very friendly. It is good to have a taqueria in the neighborhood. This is because for anyone craving for burritos, nachos, quesadillas or tacos, La Laguna Taqueria got you covered.\n\nI have been meaning to order a burrito from here. So I finally did. I came in for a burrito and ordered one with shredded chicken, rice, beans and cheese. The portion size of the burrito is quite generous. A large tortilla means more room for any extra ingredients I choose. This is something I really like. This meal portion sizing is good enough to satisfy my large lunch craving. I will have to come in, order and try other items from the menu.\n\nSpacious facility, good food and good service.\n\nWork nearby? This is it. It's one of the eateries to eat at.\n\nI am impressed with how friendly the guy was. Service was relatively quick, I didn't have to wait very long either. Just for this alone, props and bonus points so I will be back.\n\nOverall, positive experience here.", "author": "Bennett W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-21", "description": "The day after Donald Trump's presidential inauguration, a number of protests throughout various parts of the United States including the Bay Area and intermittent rain here in San Francisco, January 21st was not the best day to go out. \n\nEven with the ongoing events and stormy weather, those do not stop me from craving a burrito.   \n\nFor my craving, I need to travel to the Bayview/Hunter's point area to a spacious taqueria which is very quiet and a neighborhood that does not have a lot of activities. With the rainy elements, many people like to stay home. Not me. \n\nFor lunch, I had the grilled steak Super burrito for $8.75. The meat was cut into cubes and not too burnt. And you get a huge chunk fit into that large flour tortilla, along with the other fresh key ingredients. I also ordered a $5.00 bottle of Speakeasy \"Big Daddy\" IPA. This is the first taqueria that sells the San Francisco micro-brew. It is definitely a difference maker. \n\nThe family working there and cooked my meal were very nice to Joe Cool.  \n\nBayview/Hunter's point area may not be a safe area. But I definitely feel welcomed here.", "author": "Matt G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-05", "description": "Spotted this place while waiting for my passport appointment at USPS. Great service accompanied by delicious VEGGIE tacos and yummy salsa.", "author": "Ashley F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-10", "description": "Wonderful food and great service. One of the best restaurants in the neighborhood. I highly recommend the tacos and burritos.", "author": "Asa H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-11-30", "description": "I ordered a burrito supreme with carnitas. It had a different taste to the meat or rice. I couldn't tell. I ate the whole burrito. Two hours later I got food poisoning and starting to vomit for 12 hours straight. I know for a fact it was this burrito because I had only made food and ate it with my daughter and nobody was sick from my food. I will never eat here again!", "author": "David C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-08", "description": "This place is fantastic. I work in the immediate area, and am pretty sick of most of he food options in the area by now. This place has stayed in the running for every day go-to, though. \n\nI like the quesadillas, and the carnitas torta is glorious.", "author": "JT R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-11-06", "description": "La Laguna is a no-frills taqueria. The carne asada burrito was definitely huge, but it was nothing fancy. The meat was kind of chewy and was a little overcooked, but the guacamole was fresh.", "author": "Casey S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-22", "description": "The owner Ray is amazing! Very nice, fast paces, and consistent! Restaurant offers food for every life style. Thanks and don't forget to grab your chips!", "author": "Tippy T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-02-06", "description": "I am Mexican and I know I can cook better thab this place. If you're not trying to drive for decent Mexican food though, this is the a spot for you.", "author": "Jesus C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-06-06", "description": "An okay place in an.... okay part of town.\n\nI stopped by, absolutely starving and this seemed to be promising. It was clean and spacious and there was tons of street parking all around. I ordered the super salad, which is literally an unwrapped burrito. A giant bed of lettuce and slices of tomatoes, a generous portion of dry carne asada, and a way too gigantic dollop of sour cream and sprinkles of cheese on top. Healthy salad negated. Still, a gigantic portion that filled me up and fueled me for the rest of the day. \n\nI'd come back only for $1 Taco Tuesdays!", "author": "Sally C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-01-24", "description": "OK food. However, if I'm paying $19.74 for 2 so-called super steak quesadillas, I expect enough pico de gallo, sour cream & guacamole for the entire quesadilla. To be honest, I believe that they intentionally give incredibly small portions so that folks pay for extras, but two teaspoons each isn't nearly enough.", "author": "Amoura B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-08", "description": "La Laguna has very good Mexican food, nice staff, and always has soccer on the TV set.  I've been coming here for years, and the owner has always made us feel right at home.  I suggest that you stop by a Taco Tuesday, $1 tacos while supplies last.  \nThis place is in the industrial section of San Francisco, so don't expect the decor to be up to high standard.  Overall, the food is very good and the spicy salsa with chips always comes thru!", "author": "Marlon T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-11", "description": "Came on a Friday when they had a tent set up outside of Speakeasy Ales & Lagers.\n\n* Carnitas - 4 stars\npic: http://www.yelp.com/biz_photos/la-laguna-taqueria-san-francisco?select=8NN94dS_H-cor1or9M4kTw#8NN94dS_H-cor1or9M4kTw\nVery salty shredded meat, more crisped texture than other places where it's more tender/moist. You normally get two tacos for $5, but I offered to pay $3 for a single and they let me do that. The meat comes on two soft and tasty tortillas. And the red salsa was chunky, legit spicy, and tasted great with the carnitas, onions, and cilantro.", "author": "Ziyan C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-27", "description": "I ordered the chicken fajitas and my friend ordered the carnitas. Both dishes were delicious. The chicken was moist, crispy and well-seasoned, as were the carnitas. Chips and guac were solid. The restaurant was clean and sunny.  Would definitely come back.", "author": "Portia M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-27", "description": "$8.65 for a Carne Asada burrito especial ... Right price for this side of the bridge.  \n\nSolid ass burrito (I actually ate twice off it and I'm 6'3\" 215) \n\nGood flavor, good meat not fatty, could use some char for me but well cooked, good green salsa (I never did ask if he had red which I prefer)\n\nCool dude at the register good service (there was only one other person in there)", "author": "Matthew B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-01", "description": "I got a basic street taco, topped with cilantro, onion and their green salsa over carnitas. The salsa has a good medium spice and they were frickin delicious! Yum, I'll definitely be back for taco Tuesday. Hands down one of the better tacos in the city.", "author": "Brooke B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-10", "description": "Came here for their burrito and their Tuesday Tacos. Their service is slow. Waited for a long time for a burrito when there was no one in line. Waited 10 minutes for a few tacos when there were only 3 people in line. \n\nThe food is OK, but there isn't much choice out here at all.", "author": "M C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-09", "description": "The food is delicious and the tacos are so good\n\nThe carrnitas  super burrito is awesome. Taco Tuesdays phenomenal.", "author": "Angel D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-12-13", "description": "La Laguna's draw is taco tuesday (1), large dining room, flatscreen tuned to Cnn, free chips & salsa when dining in.\n\neats: beef burrito (5.65)\n-standard rice, beans, and salsa adequate.\n-beef dry, overfried, chewy, almost not fresh. (tasted like day leftovers)\n2.5 stars\n\nfrijoles refritos:\n-gringos and amigos present\n-pricing average for s.f., not cheap, not too pricey.\n-parking so so\n-other meats may be better, didn't see meat listing.\n-very efficient ordering system, friendly service.", "author": "Victor G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-20", "description": "My family has lived in the Bayview for over 20 years. I myself have my own little family now and we checked out La Laguna about a month ago and were really happy with the taste of the food. \nOur first time here we originally wanted to dine in but we were pressed for time. It was a Saturday and getting close to noon and the place was pretty empty. We asked the lady of we could just take it to go and she was super friendly and packed it up for us. \nWe ordered 4 burritos and all were very tasteful and had a good amount of meat inside!!!! The the carne asada was seasoned well and not too salty, we also liked that there wasn't too much fat on the meat! I've been to places where there was hardly any meat but huge chunks of fat!! This place definitely didn't do that. \nThe second time, I ordered for pickup and we got the same thing and again it was quality food....\nWe again ordered for pick up and food was always ready in the amount of time given!! \nNow......\nToday(being our 4th time) I asked Jessica (the super nice cashier) if they offered a \"super super burrito\"..... She looked at me with a little grin and said No but she can ask the cook..... She goes and asked Antonio (the guy cook that's only there early in the day) if he could do it.... She came back and told me that he was willing to try!!!!!\nSo here's how it went down,\nI ordered a \"super super steak and prawn burrito\" meaning they used two tortillas lengthwise and of course made two super burritos into one. \nANTONIO nailed it!!!! My husband was beyond happy with his gigantic burrito!!!! Again, the flavor was there, the portion of meat and prawns were good and the green salsa is to die for!!! It is our favorite salsa from any taqueria... They also have a red salsa that is pretty tasty too!! \nTo wrap this up, this is probably now our favorite taqueria in the Bayview! They also have online ordering and are available on eat 24 which is pretty cool if you need your food delivered!!! \nThank you Jessica for always having outstanding customer service and of course Antonio for creating this monster burrito for my Hubby!!! \nI'm sure we will return soon and will probably try something new off the menu!!!", "author": "Siai M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-03-23", "description": "I just had the Super Chicken Quesadilla-- $8 something. Reasonable because the portions are pretty big. It was super cheesy, not something I prefer because the grease from the cheese makes for a very soggy quesadilla in my opinion, I had to eat with a fork and spoon--uhh no not again. Also, the chicken seems to be boiled---meh, not a fan. I would just go here on Taco Tuesday. \nTheir tacos are pretty good", "author": "Myra H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-11-09", "description": "Poor food service,paid 12 bucks for a burrito that tasted like something from Taco Bell,I mean for 12 dollars u think I should have got chips with that,but no I didn't ,seemed like the owner is only concerned about taking people's money and ripping them off.", "author": "John P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-19", "description": "I came in on a Saturday afternoon after running some errands.  The place was practically empty and Jurassic Park was on the TV.  \n\nI intended to go with something small, but I wanted it all so I ended up with the super quesadilla. It was bigger than I intended, but it let me have the filling options I so wanted. BEST quesadilla EVER! I ate the entire thing - stuffing myself beyond my intention, but I couldn't stop.  It was that good.\n\nI also ordered an horchata.  It was smooth and velvety - best horchata I've had in a while and I do love me my horchata.\n\nThe person working the counter (I'll assume was the owner) was pleasant and helped me make the toughest decision of the meal - carnitas or chile verde.  I ended up with both and they were both amazing.  That's how I ended up eating too much - again just couldn't stop and don't regret a minute of it.  He did not steer me wrong with that decision and was very accommodating.  After reading the reviews I'm glad to hear they do get the business they deserve.  I was worried since it was so quiet while I was there that they weren't getting the business they deserve.  \n\nIf you want great food and pleasant service from good people - come here.", "author": "Pamela M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-05", "description": "Great burritos! I love the super vegetarian burrito. My go to spot in SF during lunch. Great customer service. Lots of options. \nParking is my one complaint!", "author": "Kaylin R S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-26", "description": "This is definitely a gem in this neighborhood. The food is great and the people are friendly. Burritos look exactly how they are pictured and will fill most people up.\n\nYou should check out their Taco Tuesdays, where they offer $1 tacos with your choice of meat. \n\nThe only thing that I have to complain about is their beef which is more salty than what I would like. Additionally, this place is on the pricier side.\n\n4/5!", "author": "Perry N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-29", "description": "We've come by for both the Taco Tuesdays and normal days.  \nJust a heads up that it's packed on Tuesdays so be prepared for a 5min wait, but it's worth it.\n\nThe burritos are massive and come with authentic Mexican salsas and sides.  \n\nBasically anytime we come here, we leave both full and happy!", "author": "Chris M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-23", "description": "Burritos are good! Fast, easy and friendly service. \n\nShredded chicken is delicious! Get it on a taco our burrito and you won't regret!", "author": "Dan R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-07", "description": "I've been searching for a long time for the best carnitas in the city - these were the first that really wowed me. Deliciously crunchy. Can't wait to come back next Tuesday!", "author": "D L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-03", "description": "the best super quesadilla i've ever had. and i told him so. really nice guy. i wish they served chicken like this in the mission. it was juicy and shredded perfectly. i just don't know of any place quite this good.", "author": "john b."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-12", "description": "Very friendly. Always willing to make it extra spicy for you. Been coming here for years the owner is an awesome man", "author": "Stacy M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-05", "description": "Taco Tuesdays are a great value.  You can also get a breakfast burrito for $3.50 that is a bit smaller but won't bust your belt or your wallet.  I have had a pretty good chicken quesadilla there.  They have a super hot red salsa there that you can special request.  The only item I can't recommend is the nachos.  Squirt cheese?  Really?  At a Mexican restaurant?  Not exaclty an authentic mexican tradition.  \nAlso - a cooler filled with sugary strawberry and pineapple Fanta!", "author": "Ken P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-07", "description": "Ordered for a pickup. The person helping me was really helpful. When I came to pick up my food, was completely empty. Their place was extremely clean and huge tho. Very good burrito :D", "author": "Daniel D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-20", "description": "I love the tacos, the quesadillas, the burritos, oh and the nachos!!! try the nachos.\n\nRenato (the owner) is super friendly, he knows your tastes and can give you very good recommendations based on it. They used to customize my child's plate, as a regular customer they had made a meal for him anytime I needed it. I think this place is great, they cater too!  \n\nThough on the downside the place might need a bit of aesthetical touches and maybe upgrades but the food is good! It has a large space, often seen people rent it out on sundays for parties (usually closed on sundays!) They could use nicer tables :) but other than that I give it 5 stars on their food.\n\nEnjoy....", "author": "Maria G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-02-27", "description": "I come to this taqueria quite frequently, once or twice a week. Especially on Taco Tuesday! Can't beat it!\n\nThey have extremely friendly service and it definitely shows that they appreciate repeat business. \n\nThe food is good, it's not the best taqueria on the planet but I am in no way complaining. I usually get my orders to go and bring them back to work to eat. \n\nI usually order a Super Chicken Burrito or the Chicken / Carne Asada tacos on tuesday. \n\nThe Super tacos are good too.\n\nAll in all, a very friendly taqueria. I enjoy giving them my business.", "author": "Aaron A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-30", "description": "The chicken burritos are amazing. \n\nThis place is pretty simple, the interior is very low on frills. Plus, it's pretty much not close to anything cool. I'm in the area every once in awhile for work, and I always make sure to stop by La Laguna. The owner works there quite a bit, so sometimes I BS with him. He's very passionate about making good food  and growing his business. \n\nNow, back to the burrito.... The chicken is awesomely marinated and the cilantro salsa must be sprinkled with crack. It is so good! The cilantro is what makes it. \n\nIt's been many years since i first came here and still I judge every burrito I've ever had to the ones from here.", "author": "Billy G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-08-10", "description": "Went because of all the good reviews.\n- Food was just ok.  Nothing special.\n- Prices a little on the high side for a no-frills taco place that smells like disinfectant.  Not too high - just 15-20% up.\n- Extra cheap in everything they provide you (besides the extremely low lighting, disinfectant smelling dining room): 1 napkin - no others in sight and the counter-woman grimaces when you ask for another, chips cost extra - ok but then they shouldn't be stalish and give you just a little skimpy portion of salsa.", "author": "Ric S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-10", "description": "Customer service is top notch and so is the speed at which your food comes out even when the place is packed. You can smell the food from across the street. The burritos are large, juicy, and delicious. Please try this place and love it", "author": "James I."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-01", "description": "This place was super clean and the guy who helped me was super nice. I had a super chicken quesadilla and a large horchata. They have the best homemade horchata", "author": "Angelica R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-03", "description": "Tasty taco Tuesday is what will keep you coming back every Tuesday. Its the remaining menu choices that lead you to questioning why is it Thursday, Friday, or even Saturday that im here trying something new. \nLets be completely honest, i only work just around the corner from this place, lucky me....\nIts often the familiarity of the place and down to earth service that picks me up on my afternoon slump. Seriously, if great Mexican food and gracious service dont make you happy, then your living in the wrong city.\n\nP.S. Be nice, engage in conversation, but if its busy keep it moving along, the owner would much appreciate a smooth afternoon rush. (you can always call ahead)", "author": "Devin M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-16", "description": "We love the Taco Tuesdays because the price is so low - $1 tacos.  All meat flavors are delicious.  The tacos are very small though, so if you normally eat 2-3 tacos at a taco truck, you should order 1 or 2 more if you don't want to be hungry afterward.  Alternatively, you could forget about the $1 tacos and eat the delicious carnitas burrito at regular price.  Then you'll want to take half home because it is so filling.", "author": "Julie C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-10", "description": "Went today for the first time. Been living in D10 for three years and have never tried it. First test is always the chips. Fresh! Yay! Salsa had some heat and tasted freshly made. Ordered enchiladas for lunch and they were excellent. Its my new lunch spot! Nice people running the place. Nothing fancy, just great food!", "author": "Earl T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-10-10", "description": "The only thing that I like from this place is the chile verde. I've had their shrimp dishes and burritos but I've had better. Every time I've gone there they are out of something. It's best to go earlier in the day to make sure they have what you want. \n\nThe owner is super nice and service is great when he's there.", "author": "Liliana C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-25", "description": "It was excellent!!! My boss and I were looking for lunch this afternoon and not familiar with the area and stopped in at La Laguna for a quick bite. The place was ok we thought and ordered two carnitas burritos and chips. Wow!!! Was it good!!! Don't remember how many times we said to each other \"this is sooo good!\" Lots of tasty fresh meat unlike others we've had...and avocado (no extra charge)!!! This is the place! Bueno! Mucho gracias!", "author": "Lorina H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-08", "description": "Yum! I love that I can order via Yelp now. If you go on Tuesday, definitely order ahead. My only gripe is that veggie tacos (bean) are the same price as meat tacos.", "author": "Anna R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-28", "description": "I've been travelling to San Fran quite a bit over the past year, and I can honestly say that I go to La Laguna at least twice a week when I am there.  The food is good, cheap and quick.  The owner greets us with a smile every time and seems to remember us even if it's been months since our last visit.  Tasty Taco Tuesday is a must, but I always try to go another day of the week as well so I don't force myself to get the $1 tacos.  My usual meats are Chorizo, Lengua, and Al Pastor.  The Chile Verde is delicious, but FYI, they don't offer that on Tuesdays.  A bonus for this place?  Lots of free parking in the lot across the street. No driving around looking for a spot and then having to pay a quarter for 6 or 8 minute increments.\n\nOh, and don't forget your Mexican Coke.", "author": "Sean C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-20", "description": "Just moved to the neighborhood and was starving after the movers left. So stopped here for a quick bite. Had their Lengua platter and my wife had the fish tacos. Both were great. Will definitely come back again.", "author": "Faiz S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-07-14", "description": "Food is good and tasty. But it is expensive. $10 bucks burrito...too much. There no free chips either.", "author": "Will H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-03-31", "description": "Food is okay, but they're cheapskates. They charge extra for a miniscule amount of tortilla chips that most tacquerias include for free. I ordered and paid the price for a super burrito and found that they did not even put any sour cream in it, so basically, I was given a regular burrito, but charged for a super. They raised the prices for their small Tuesday Tacos from a buck to $1.50.  Have not come back, and don't plan on ever doing so again.", "author": "Pablo J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-04", "description": "I've been eating here for ten years, and every time (which is many) the food is DELICIOUS!  The owner is great, as is his crew, and the cheese green chile enchiladas are amazing.  Ask for extra salsa por la mesa, cause you're going to want it!\nYUM!", "author": "kristin h."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-09-22", "description": "Great cheap eats if you happen to be in the neighborhood. I gotta say it beats Subway and Walgreen's snacks (those are the other viable options available within a 1-block radius).\n\nI ordered a vegetarian burrito, which was filling! Beans, rice, tomato, lettuce, cheese, crema. All that for around $6. One thing, ask for extra hot sauce if you like spicy. I asked for hot sauce and it was barely noticeable.", "author": "Alyssa G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-06-13", "description": "*3.5 Stars*  I went there for a quick bite and discovered this mom and pop taqueria that I've been meaning to try.  The person taking my order was super nice and recommended the burrito since it was my first time.  So I ordered the super burrito with al pastor.  The burrito wasn't as big as some other places I've been and cost about $7 and some change.  As for the taste, the al pastor was ok.  A little spicy and the texture was like ground beef.  Overall, it was ok but I'd be willing to come back to try the seafood items and the tacos.", "author": "Kai K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-19", "description": "I work in Potrero Hill and stumbled upon this place on accident. I was pleasantly surprised at how good the food was! I ordered Enchiladas to go (same as the picture) and it was REALLY good! The rice and beans are cooked just right, portions are good and the prices are reasonable. \n\nI'd recommend this place to anyone in the area and don't mind the drive down the hill for some lunch here.", "author": "Sara M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-02", "description": "Great food worth every penny. I go at least once a week for lunch. try the \"juicy\" chicken in either a super burrito or a super quesadilla. The owner is usually behind the counter and is very friendly and the orders come out fast.", "author": "Elias O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-23", "description": "Taco Tuesday = $1 tacos! The Al Pastor and Carnitas were my favorites. Probably came here a dozen times or so in the past few months, tried them all except the chile verde, they were always out. Awesome little tacos with onions, cilantro, radish and lime. Mexican sodas and beers in the fridge. Good stuff if you're in the area looking for a quick lunch.", "author": "Kelly T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-05-19", "description": "Found out about this place from an India Basin local and stopped by for a quick dinner.\n\nWent with a super quesadilla with chorizo. I know \"chorizo\" doesn't mean \"greasy\" in Spanish, but that's what it was - greasy. Don't get me wrong... Depending on how you like your chorizo and food in general, greasy isn't necessarily a bad thing. I had a meeting presentation right afterward so my only concern was that I'd be burping up grease all night.\n\nOh well, greasy in, greasy out, right? Es hora de ir al cuarto de baño. ¡Adiós!", "author": "Sylvia D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-29", "description": "Come here on Tuesday for $1 tacos!!! Great place for lunch", "author": "Rena T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-20", "description": "I'm still looking for the Lagoon in Bayview/Hunter's Point...  Are they talking about India Basin?  Sounds \"fishy\".  \n\nI'm gonna be completely forthcoming.  I've only had their quesadillas, and they've only been at places outside of the business.  They were REALLY REALLY good!  Not just stuffed with queso, but also surprisingly stuffed with Carne.  Lots and lots of pollo.  And both times I had them, they were super super delicioso.  They are pretty close to mi casa, and they are on my normal bike route, so I'm going to have to stop and eat there sometime soon.  Maybe I'll never have anything else on the menu.  But that wouldn't be very Yelp-adventurous of me, now would it?  Needless to say, if those quesadillas were the only thing I ever had from The Lagoon, I'd be satisfied with them forever.  Super good.  I'm curious to try the tacos, since they are actually a taqueria, not a quesadillaria.  Soon and very soon.", "author": "Joshua K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-19", "description": "So far my experience with La Laguna has been very positive. If you can find a place where the food tastes good, the restaurant is clean and the prices are reasonable, it's truly a gem. \n\nI think this was the best Mexican food I've had on the Third Street Corridors so far and will definitely be back.", "author": "Jay S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-11-17", "description": "Two words: Taco Tuesday!\n\nI don't know about you but it's so hard to find a place that still sells yummy tacos for $1...but this place has them on Tuesdays!\n\nI used to go random days of the weeks and wonder what to get but it's now a tradition at work to get tacos on Tuesdays; specially because it is the closest taqueria around work. \n\nI have tried Al Pastor, Carne Asada, Carnitas, and Grilled Chicken.\n\nThe service here is so so...the man in the front who is usually there is always very nice and knows what I like. However, the ladies sometimes are not so nice. And if you want grilled chicken make sure you tell them you want it GRILLED or else they give you the one in tomato sauce. Also, if you like spicy...make sure to tell them!\n\n\nSee you next Tuesday!", "author": "Belem R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-28", "description": "Surprise and delight, this place out in Bayview has some of the best, softest, most toothsome tortillas I've had in San Francisco yet. The chicken and beef are a bit dry and unremarkable, but the carnitas and the fish are delicious. Salsas and vegetables are very fresh.", "author": "Cecilia L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-13", "description": "Good breakfast burrito. It was tasty and pretty inexpensive. It is nice to have someplace open for breakfast in the neighbourhood.", "author": "Ddc C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-23", "description": "This place is in point. The carne asada burrito loaded is heaven wrapped in a tortilla. Everything here is authentic old school Mexican food.", "author": "Marwan S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-09-05", "description": "Breakfast burrito review only:  So I got the bacon version here to try our the breakfast burrito here.  I have to say that it's pretty greasy and that the bacon was a bit rubbery. However, there were no potatoes in it which in this case was a +1.  The tortilla was also grilled/toasted so it was nice and slightly crunchy/crispy on the outside which I like, but not over done where it crunches and breaks apart on each bite.  It was pretty decent, but I'll have to come in and try the regular fare another time...", "author": "Gene X."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-10-11", "description": "Mexican food is not something I usually crave for. However, one day lady week I decided to walk here from my nearby workplace because I did not feel like driving off somewhere for lunch. It was my second time here.\n\nI ordered the two enchilada plate, one with chicken and one with beef.  It was okay though I felt the meat could have been less dry. They charged 50 cents for chips to be included, that was a slight bummer. I would have imagined chips should be included, but I could be wrong about that.\n\nThe place is clean, and I give them a thumbs up for providing a boost to this depressed neighborhood.", "author": "H K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-22", "description": "Loved the al pastor and carnitas tacos. Lots of spicy and crispy pork wrapped in two tortillas with salsa, onions and cilantro for $1.85. The fish taco was a bit bland. The burrito was hefty and stuffed with that al pastor spicy pork. Thought the tacos were a bargain, same for the burrito. See for yourself!", "author": "Kelly K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-09-26", "description": "1st try: Very bad.  2nd: not any better 3rd: HORRIBLE!! (now you're asking why do you go back??... - well there not much here in the hood.  I kept thinking maybe it's me?... ).  Service is terrible - the food is worse!  Very greasy, terrible flavor.  AVOID!!!  They screwed up my order, never gave me a receipt...and when I asked for one it was a huge problem.  It's not even that cheaP!  \n\nPrefiero la trocka k queda pegada con el post office.  Any reviews on that?  This place is terrible.", "author": "Ian J. S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-23", "description": "Delicious, clean, inexpensive (particularly on $1 Taco Tuesdays).", "author": "Ted L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-25", "description": "I was in he area for a work training, and wondering in on my lunch break. Very friendly folks who work here! \nI had the Enchilada Lunch Plate, with bean and rice. \nThe portion was huge, and the food was good. Nothing out of this world, but I did only order a cheese enchilada after all. \nLarge menu of salads and other items not typically seen in most taquerias. Also had some tasty looking breakfast items plenty of seating and clean dinning room. \nShould I find myself back over in this neck of the woods for work, I will stop back in for another good meal.", "author": "Kelle K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-03-25", "description": "I was looking for a lunch spot that was close by to City College on Evans. So I knew I could rely on Yelp to guide me to the perfect place. \nHmmm. What could be better than Mexican food for a quick bite. \n\nI wasn't really sure what to expect since no picture was available of the location and I wasn't sure if I should expect a small to-go spot. It was perfect! I walked in and notice plenty of space for dining in. The menu was also rather extensive with plenty of options even for the pickiest eater. I went for the Super Quesadilla with Carne Asada. It was delicious plus sour cream and guacamole are on the side which was great. They are also generous with portion size. \n\nI can't wait to come back. Note to self: remember to take camera for pictures. :)", "author": "Norma Denisse S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-12-08", "description": "Had a really yummy to go carne asada burrito from la laguna. I was hungry and I gobbled it up with only three words utterred and two napkin breaks! Minus 1 star for the 50 cent chips. They would have been the perfect (FREE) complement to the juicy burrito!\n\nI will be participating in taco tuesdays soon!", "author": "Valerie A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-07", "description": "I live a few blocks away, so I come here pretty often. The food is always good and the $1 tacos on Tuesday are a great deal. I also highly recommend their fish burritos. Best Taqueria I've been to outside of the Mission. Since it's in the Bayview area, it's never crowded, which i like.", "author": "Adam K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-13", "description": "In the days when my job actually permitted me to take a lunchbreak, I used to frequent La Laguna, going back to when it was called El Norteno.\n  \nAfter a long layoff, I stopped by the other day and remembered why I was such a loyal fan:  The proprietor Rico recognized me and somehow recalled that I loved their chile rellenos, and told me I was in luck:  It was today's special, and they had one left.   When the plate arrived, it was both beautiful and delicious.  At most Mexican restaurants, a \"plato\" just means some rice and beans, maybe some shredded lettuce and salsa.  At La Laguna, it's done right: Good rice and beans, some fresh radish and guacamole, pickled carrots and a wedge of lime.  I'm not a foodie, but it really contributes to the experience, and I appreciate that the commitment to getting those little things right.\n\nIf you're working in Dogpatch, this is a five-minute drive or ten-minute bike ride.  Well worth it.  Superior food, friendly spot.", "author": "Matt M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-07-07", "description": "I used to work in this neighbourhood and about the only mourning I have done is losing the opportunity to eat lunch here. This place has set the bar for Torta's. Everywhere else I compare to La Laguna and thus far, no one has come even close. The rest of the food is awesome as well and these people do not skimp on proportions. Prices are excellent even if on a tight budget.\n\nSeriously, I live  and work in Oakland and if I did not have to BART and then Muni light rail to La Laguna, I would still be going there. Not that I haven't thought about it.", "author": "Robert A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-08-15", "description": "Taco Tuesdays here are the best!! All tacos for $1 each! I highly recommend the carnitas and carne asada tacos, but the chicken ones are just as great! I've also tried the tortas and they are delicious! I have not tried the burritos or the plate options yet, but if they are anything like the tacos and tortas....i know they will be amazing!!", "author": "Jones E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-07-14", "description": "I really like this place. Tons of seating and a good assortment of menu items. The people there are really friendly and the crowd is your average blue collar/ construction guys.\n\nMy favorite: Enchiladas verdes, the verde sauce is bright, flavorful, hot but not a mouth-burner. Chicken was tender and delicious.\n\nLeast favorite: the breakfast burrito. Kind of bland, and no potato! You gotta have potatoes in breakfast burritos right?", "author": "Liz D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-15", "description": "I ordered a bunch of burritos for work, chicken, beef, steak..... all delicious!", "author": "Rpm R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-04-21", "description": "Close to Dogpatch, the main PO on Evans and the Walgreens in Bayview Plaza SO... today my errands included a visit for a vegetarian burrito. Very impressed for a first time visit. \n\nThey had wheat tortillas which were REALLY wheat not just white with some bran tossed in. I ordered the 'Super' with pinto beans (also veggie - I checked) and it came with nice accoutrements including cilantro and guac. I have to say I was pretty certain the guac was fresh but it could have also been out of bag. \n\nNice size overall, although you do pay extra for chips which seemed to catch another customer off guard but was fine for me and my bulging exterior. \n\nTotal came to $6.50'ish and I was really glad to sink my teeth into a delicious burrito without having to venture into the Mission.", "author": "Miel H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-08-20", "description": "We do our laundry across the street, Ive glanced at this place before until we went in and to my surprise they have burritos mojados (wet burritos) which I love and hadnt  found a place in the city that  made them just right. We were greeted nicely by the owner and the waitress. Well when I finally took a bite I was amazed and in heaven  even my hubby was too!!! Will go again anytime maybe on taco tuesday!!!", "author": "Jahaira B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-06-20", "description": "Bad experience. I would NOT recommend this place. I was looking for some quick grub and found this place. The name made it sound pretty authentic, which is what I was looking for. I looked at the menu and ordered a super Tongue burrito, which the menu said came with cheese, sour cream and guacamole; A THREE MUST HAVES for my burritos. I paid and sat down at a table and 5 minutes later my burrito arrived in a dine-in basket. NO CHIPS, NO SALSA, just a burrito wrapped in foil and a napkin. I had to go back up to the counter to ask for a straw for my drink and ask for salsa for my burrito. First Bite; I realized they gave me whole beans not refried. I asked about it and the lady said they ran out of refried. Its ok, I can live with it. a few more bites into the burrito that I realized they didn't put any cheese, cream or guacamole in it. I went back up to the counter and asked if they forgot to add some ingredients. She said once again that they had ran out of guacamole and cream and cheese . She said it so care-free. I got a regular burrito for the price of a Super. I didn't feel like arguing or making a big deal out of it so I just finished the rest of my plain expensive burrito and will never come again. Oh and I didn't Tip. Shame on me.", "author": "Dave R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-06-25", "description": "I just went in here to get an horchata since it's across the street from my job. Everyone in this joint is super friendly which is totally random for a taqueria. The customers or \"regulars\" as they were introduced by the guy behind the counter were super friendly and gave me many recommendations. The space is huge which is not what I expected from the outside. The horchata was good though just a tad watery for my taste...but I will definitely be back to eat.  I noticed on the menu they have salads. But not your regular taco shack salads that are just open tacos with a bit more lettuce, like a real salad. I'm gonna have to check that out. Another \"random\" of this place that I am already a fan of.\nNice to know there is a place like this in the city.", "author": "Jocelyn J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-02-16", "description": "Okay, it was 1.00 tuesday and didnt want to deal with Popeye's or Kentucky so I went to get taco's! OMG the best little tacos for a buck you could have imagine!\nI called the location to let him know just how \"tasty\" his tacos are!\nRecommended and will go back anyday just not Tuesday!", "author": "Paula J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-26", "description": "So I ordered the Dos Enchilada/Taco combo and I must confess that is was Great Great Great Great Great!!! Carnitas are OFF DA HOOK OMgoodness!!! Rice is muy bueno tambien!!  My only complaint is my black beans could've cooked for about 30 more minutes but other than that!?! Scrumpdillydeeliscous!! =)", "author": "Kim S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-05-23", "description": "I stopped by this little unassuming spot and order a supper burrito.  Odered the Chille Verde meat in it and it is the best Chilli Verde that I have ever tasted.  Since then I have been eating there weekly.  Friendly service and it is quick and easy.  Co workers that I have taken there since are glad I have shown them this spot.", "author": "Dennis B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-12-05", "description": "This place rocks. From the brightly colored (canary yellow) building, to the friendliness of the cashier, to the carne asada itself. So good. Not so good that I get a boner, but good enough that I come here about twice a week. Normally I don't like chicken enchiladas, something about the sauce just doesn't do it for me but this place does it and does it right. And the super taco meal...yeahsun, that's the yummi eats right there. Sadly, the burritos aren't up to par, which is surprising, so this place can't be the Best of the Best (Pop it Tommy, pop iiiiit!) but still ranks up there.\n\nNot sure about the previous reviewers comment regarding the service, as the main cashier is one of the friendliest people I've met. Every time I go there he's joking around with people and everyone's having a good time. In fact, people often sit at the area adjacent to the cashier just so they can talk with him while eating. It's possible that he wasn't there on the day the previous reviewer came by.", "author": "Sol V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-07-29", "description": "I love this place!!!!  Been coming here for years and even though I don't live in SF anymore, I come here weekly for my burrito fix.  Always delicious and worth the drive.  Can't say enough good things about the food - tortas are huge and awesome, dinner combos give you enough of everything (and its delicious!) and my favorite - the super burritos, which depending on your appetite, can be enough for two meals.\n\nLa Laguna has my heart - never go anywhere else now!  \n\nRay (the owner) - keep up the awesome cooking :)", "author": "Cri S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-04-17", "description": "Oh boy when I'm close to home and hungry for some tacos or anything Mexican La Laguna is the spot. \n\nI've been in a few times and love the tacos and Burritos.  I really love the combo meals like my favorite 2 tacos , rice and beans.  La Laguna kind of reminds me of Poncho Villa in flavor. \n\nMy only complaint might be that they are slow sometimes but I think its because they cook it all up when you order it like certain grilled items or even the big dinner and lunch plates they have but either fast or slow the food is still really good. So next time you're in the hood stop and check them out you won't regret it.", "author": "Karim R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-09-03", "description": "My five stars are mostly for the super pollo asado nachos, since they're the only thing I get consistently there.  I was recommended to go to the Little Chihuahua (TLC for short, though ironically it seems they didn't really provide that in their prep of the nachos) in Noe Valley for nachos because I was house/dog sitting in the neighborhood.  I should've driven the extra ten minutes to go to La Laguna.  Lots of not-stale chips made (or at least fried) in house, lots of moist well-spiced chicken, cheesy sauce (at TLC it was white, maybe Jack, and looked like it was nuked).  My chips from TLC may have soaked up moisture from being in the container for a while but the still looked like they came from Costco.  Enough sour cream and guac too.  It's worth heading to that side of town if you're close enough, like when you're visiting Flora Grubb or on your way to/from a game at Candlestick.  I've also had burritos and a couple of their plates, and they've all been excellent.  Someone else had the camarones plate and raved about it for days.\n\nThere's a reason Speakeasy gets their Friday happy hours catered by them!  Find out for yourself!", "author": "Benita E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-16", "description": "Taco Tuesdays = $1 tacos. They also serve beer there so you can get smashed in between classes at CCSF.", "author": "Kendog .."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-07-06", "description": "Decent burrito joint in the Bayview right off the T line. Had the vegetarian burrito which was pretty good, but on the downside, they didn't have a choice on tortilla type, and they only take cash. I've had better, and I've had worse.\n\nOpen for breakfast and lunch only.", "author": "Jason B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-26", "description": "i had a burrito mojado and ate the entire thing. the al pastor was tasty but not too greasy, which i dislike.", "author": "Ameer N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-05-20", "description": "I work at the Community College nearby, this is our fav spot for lunch when craving tacos or burritos. Tacos are really good, meat is tender and juicy.", "author": "Janel H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-13", "description": "Really yummy taqueria.  My wife just loves the super veggie nachos - two kinds of cheese!  I had the super veggie burrito the other night, and it was good but not great.  Tonight I tried the super quesadilla with pinto beans and mushrooms.  Seriously delicious.\n\nHighly recommended, but there are a few places in the mission that beat it.  4.5 stars.", "author": "Jeff W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-03-24", "description": "I can only speak for the carnitas taco that I had and it was really good. They actually FRY the meat and it was super crunchy and delicious! I got the super taco which came with rice and beans and lettuce and all that. It was like a platter and only for $5. Very good stuff.", "author": "Jen D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-04-09", "description": "Ehhh.... not so great... I used to eat here more frequently as I work near here, but the more I ate it, the worse it has seemed to get.  The biggest upside is taco Tuesdays which has tacos for 1 dollar a piece....", "author": "Naka H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-06-10", "description": "Pretty good chicken burrito! But the chicken was so spicy! May be they drowned it in some hot sauce or something, but it just ruined the flavor! The lady was kind of rude in the front and she did not know english that well. I do not know why but I wanted to order another burrito and they were like no I can not make you another burrito?! Why!?", "author": "Janet Z."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-07-07", "description": "This place is not bad. I got me a fajita super burrito and it was quite good. I like my food. The steak is pretty good and tasteful. Gf orfered super nacho and she said it was alrite. The cheese on top wasnt melting. They just springle. Overall, it was good. $20 for both of us.", "author": "Win S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-06-17", "description": "La Laguna is just your run of the mill Mexican food. I got the chile verde torta. The sandwich was huge!!!!!  A little too much fat in the chile verde but other than that it was good. I had a Mexican coke with that also, always a plus. The green salsa with the chips was extremely spicy and I had a burnt tongue while I ate my sandwich. The service was quick for the lunch crowd and the bathroom was clean. One thing I didn't like was the .50 cent charge for chips. I know the price of corn is going up but if I buy two meals, chips should be included, just as they do at most other taquerias. Overall not bad, definitely another lunch spot to hit up.", "author": "D J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-09-21", "description": "This place is great... This guy name Ray... He's hella koo... Great food... Go there every morning/ lunch to get some food... The food is always made fast and fresh and always given to me the way i ordered it...", "author": "Peter L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-01-02", "description": "I was starting to get concerned about how long I was waiting for my food to arrive, considering that it wasn't busy at all.  It seemed as if the cook, who I could see from my seat, was only cooking one order at a time, and there were two orders before mine. When my food finally did come, I was relieved to find that it was one of the best super quesadillas I've had in a very long time. I'm still stuffed, and I'm typing this eight hours later.  A bonus was the cleanliness of the place, bathroom included.", "author": "Nathan W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-03-04", "description": "A friend and I were in the area getting a new window put in my truck and we walked the two blocks and found this place. We both had breakfast burrittos and they were really good. We are going to go back some other day and get lunch. If the lunch is as good as the breakfast I will have scored a new favorite place.", "author": "Baron S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-09-17", "description": "I go there on Tasty Taco Tuesdays ($1 each) because it's the best deal in the city!  I should mention that their pollo and carnitas are outstanding.", "author": "MIchael R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-09-21", "description": "the price for the burrito was average and normally places I've been to give you a complementary bag of chips and they didn't give me any!", "author": "Jack L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-04-30", "description": "Tasty super veggie and carnitas burritos that are a weekly staple for our family.  Call and it's ready in 10 minutes- great to have in our neighborhood.", "author": "S J."}
