{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-24", "description": "Yum! \n\nI found this place randomly through Yelp and absolutely love it. Delicious food, and friendly owner/staff. It's a small casual place that looks randomly placed on the block. Don't let that fool you, the food is superb and great portions for the price.", "author": "Lexy C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-31", "description": "This is a great place for delivery. The people are friendly and delivery is lightening fast. I love their pho and their garlic noodles are the best! Rival restaurants have health scores around the high 79's to low 80's, which is just plain unacceptable. \n\nThe most important thing I look for In a restaurant is their CCSF Health Department Health Score. I find that restaurants with a rating below 90 are inconsistent, one day good, the next bad. The chance of getting food poisoning also spikes once the rating drops below my red line number of 90, especially when seafood is on the menu. I make a small exception for Laksa. I love the food from the pho, to the rice plates and the garlic noodle dishes. Their imperial rolls are fantastic and the size of all the dishes is generous. The quality of the food and the friendliness of the staff keep me ordering despite the health score.", "author": "Peter M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-11", "description": "Affordable, not too busy, pretty good Vietnamese food. Great dinner option!\n\nTHE WAIT: None on a Friday night around 8pm. \n\nTHE COST: About $20 all told for my split of dinner. Super affordable!\n\nTHE SERVICE: Very friendly. They don't serve alcohol and when we wanted to order us, they suggested the corner store and a paper bag! Loved that.\n\nMUST-HAVES: Imperial Roll!\n\nTHE FOOD:\n\nAPPETIZERS\n* Imperial Roll ($8.50) - 4.5 stars\nLove the extra layers of crisp. This was great!\n\nPHO\n* Pho Ga, chicken ($11.25) - 4 stars\nGood comfort chicken pho, satisfied my craving!\n\nGARLIC NOODLES\n* Five Spice Chicken + Garlic Noodle ($11) - 3.5 stars\nGood, but for all the hype a bit of a let-down. Chicken was packed with flavor, had a good char. Garlic noodle could have been even more spicy & garlic-y, and was cooked a little too soft.", "author": "Ziyan C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-26", "description": "Good delivery places for pho. Their delivery service is good and friendly. The food is above average but maybe cuz of delivery, I need to reheat my soup after I got the food. But still recommend if you want to have an ordered pho", "author": "Patricia L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-03-13", "description": "Laska is plain Jane, mediocre. If you can't trek to the TL, Richmond, or Sunset for legit Vietnamese food (or East Man Jose followed by a T&A \"coffee\" run), it will do in a pinch. \n\nPlan A for lunch was a fail so Laksa came up on Yelp as the closest place to grab some food.  \n\nThe name is misleading as Laska doesn't serve Laksa, a Malaysian curry coconut soup. Laksa serves basic Vietnamese pho, vermicelli bowls, rice plates, and their signature garlic noodles. Unfortunately, you won't find other Vietnamese restaurant staples like bun bo hue, bun rieu, banh xeo, or che here. Everything is fairly priced for SF standards ($13.50 and under) but the portions are small. If you're hangry, you will need to order a side of spring rolls to be satiated. \n\nI remember when they first opened a year and ago, I called to inquire if they used msg and they said, they did but it looks like they no longer do (per sign). Seems fitting for the demographics. \n\nSince it's their signature item, I ordered the Garlic Noodles w/ charbroiled pork ($11): http://bit.ly/2Gq1DlC. The garlic noodles were meh - they were neither garlicky nor buttery, and had no chew to it. Stick with Perilla, PPQ, or Thanh Long for garlic noodles. \n\nThe charbroiled pork had good lemongrass flavor but was sliced thin so you don't get very much of it. Three broccoli florets rounded out the meal, though it looked like it was just placed there to cover the negative space and make the plate look more \"complete\".  \n\nService was cordial and prompt. \n\nClean, minimalist dining area. \n\nWhile I'm unlikely to return (just not my style of Vietnamese food), if I lived in the area and was in desperate need of Vietnamese food, Laksa would be an ok option. Convenience wins sometimes.", "author": "Cherylynn N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-09-15", "description": "It's alright. The foot is decent and the prices are reasonable. The combo pho is good not great, I felt the broth could use more depth. Spring rolls were good. Service was a little cheeky. Seating was quick as the place was relatively empty when we went.", "author": "Mikey J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-03-16", "description": "A bare bones Vietnamese joint on a semi-residential block.  Not as bustling as the restaurants close to the BART stations, which helps add to the ambiance.  Food was just ok though.\n\nBeef Combo Pho: So I appreciated that the combo consisted of my top three: eye round, brisket and meatball.  I didn't even see the chewy tripe or slimy tendon on the menu.  Minor qualm was that the eye round was mixed into the broth (becoming well done) instead of presented in a rare pile on top (which enables you to eat it rare or medium rare, if you like).  But the big disappointment was the broth.  It tasted more salty than anything else.  Didn't have that umami richness and herbal bouquet that other joints have (e.g Bodega Bistro).  I mean, it was still pho, so it was an enjoyable meal overall.\n\nGarlic Noodles: Ordered a side of garlic noodles since they seemed quite popular on Yelp.  Can't say I was fan.  They just didn't seem garlicky enough.  Nothing like An The Go.", "author": "Adam B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-16", "description": "This is one of the best pho in san francisco,chicken noodle is my favorite .my friends try shrimp Roll with peanut sauce very tasty.we Love here.", "author": "Joe H M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-07-02", "description": "Food: I got the vegetable combo pho, which tasted delicious, but I felt like it lacked the amount of vegetables that were in the soup as compared to the amount of broth. I even ordered a side of rice and was still hungry after finishing my meal. The food did taste great though!\n\nAmbience: the restaurant has a simple and cheap feel to it. It was small and cozy, but not very comfortable. There was no effort put into making the place look very inviting or pleasing. The wooden, small chairs and tables weren't the most comfortable. \n\nCustomer service: we went there about an hour before closing time and the workers seemed to be rushed. They set up our table in a very careless, unattractive manner and forgot my side order - I had to remind them about it to receive it. I don't think I saw anybody smile. They all looked like they could care less about their customer and just wanted to wrap up and go home. \n\nPrice: price was pretty good and decent, as compared to most restaurants in the city that overcharge for nearly everything. \n\nI may come back here because the food really was tasty, but only if I'm too lazy to wait at another restaurant for a spot or to even look for one open, since I know there are better pho spots around town with more pros and less cons than Laksa.", "author": "Anna A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-06-04", "description": "Is it just me or is this place really overrated? It was a lazy Sunday for my friends and we were just chilling in the apartment and found this place on Yelp. We were astonished by how great the garlic noodles looked in the photos. Thus, we decided to have it delivered because why not. \n\nI ordered the Five Spice Chicken with Garlic Noodles and Imperial Rolls. When I hear Five Spice Chicken, I expect flavorful and chicken with a kick of spiciness to it. Sadly, it did not taste how I imagined. It was basic. The garlic noodles were a huge disappointment too. They were not garlicky at all and were severely dried. The more bites I took, the more bland they tasted. If I don't need gum after eating garlic noodles, then you know that there wasn't enough garlic in it! When it came to the imperial rolls (which by the way are not so imperial like), I was not surprised that they were also plain. Without the dipping sauce, the rolls were whatever. \n\nI give Laksa 3 stars because it's not horrible, potions are okay, but it's not a place I would brag to anyone about in the SF area.", "author": "Monica C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-08", "description": "This place was solid - good food, fast service, and a pleasant, casual atmosphere.  A good place to get your Vietnamese fix in a nicer-than-your-typical-hole-in-the-wall setting.\n\nI had the garlic noodles with imperial rolls and chicken.  I loved the imperial rolls and noodles - they were very flavorful.  I was not as impressed with the chicken, and found it average.  My husband really enjoyed his pork chop with vermicelli noodles and imperial rolls.\n\nThe service was fast, though not particularly friendly.  While the waiter (owner?) spent a lot of time chatting with other guests, he barely bothered checking on us.  His question about how we liked our meal was perfunctory, and he didn't even wait for a response.  \n\nThe space is modern and clean, and while casual, slightly nicer that many other low-key Vietnamese spots.\n\nOverall, a good spot for a tasty, casual dinner in the Mission without a wait.", "author": "Barnali D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-22", "description": "Came here on a Friday night around 7PM with my friends (4 of us total). I ordered the Beef Brisket Pho, and my friends ordered the Beef Brisket Pho, Pho Ga, and Beef Combo Pho. The restaurant wasn't crowded, despite it being a Friday night; I thought that was a little bit suspicious, but Laksa ended up hitting the spot.\n\nThe experience was really great overall. The staff there was super nice and our food came out quickly. When we were leaving, my friend left her wallet on the table and the waiter chased us down after half a block to return it--so nice! \n\nI really enjoyed my pho, I thought the flavor was pretty good and there was SO much deliciousness for only around $11. I rated this four stars because the flavor of the broth, although good, was a little mediocre. I found myself adding a lot of plum sauce and chili powder to liven it up. Don't know if we will be back, but definitely enjoyed our experience here!", "author": "Jamie J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-10", "description": "Delicious Vietnamese food. The Garlic noodles are the best in the area and the pho ga is tasty. Good price and value. Great service staff. This the place for Vietnamese in the heart of the Mission.", "author": "Juan V."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-10-11", "description": "Food is mediocre and overpriced. Nothing too special.", "author": "Suzy Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-27", "description": "Garlic noodle and charboiled pork was bomb. \nImperial rolls are always a good appetizer. \nPho was okay...\nBut service was great, even helped me find parking after I was driving around for 25 minutes (screw you SF parking). Parking here is impossible so avoid if you can.", "author": "Raquel Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-17", "description": "Very friendly, nice staff awaits you at Laksa on Guerrero and 22nd streets!\nWe regularly have been going to Laksa since they opened a few years ago and food and service consistently very good!!\nWe've tried everything from deep fried roll appetizers, Thai iced tea, Pho soups to desserts and all very good food!  \nWe recently had Pho Ga (soup with shredded chicken) and chicken curry with egg noodles and both fresh and delicious!!\nThey do a lot of to-go orders and they also offer free local delivery too!\nParking can be a challenge during peak times but no worse than parking in other neighborhoods.", "author": "Steve F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-02", "description": "My husband and I were looking for Vietnamese vermicelli, specifically he wanted \"bun thit nuong\" which is the pork version of this dish. We looked for places in our neighborhood and saw this place had pretty good reviews with good prices.\n\nThey have a lot of seating inside and a few tables outside. We opted for outside because it was a nice and warm night. We both got the vermicelli noodles, I got it with 5 spice chicken and he got it with pork. We got it with the imperial rolls to give those a try as well.\n\nImperial rolls: Not your typical spring roll, thick and heavy and meaty. I thought it was delicious. Maybe could be served with a spicy sweet chili sauce but I still gobbled it up with the sauces they. Warm and crunchy to balance out the cold noodle dish.\n\nVermicelli with 5 spice chicken: Amazing! Fresh tasting and delicious. Good balance of veggies and noodles and the meat was tasty.\n\nFood: 5 stars, and water was delicious \nService: Fantastic \nPrices: Very reasonable!! can make this a regular thing for sure\n\nWe will be back. Great neighborhood!! Loved the outdoor seating.", "author": "Alyssa A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-18", "description": "Laksa is a cozy, unassuming place that serves some decent Vietnamese food.\n\nI had the Pho Ga (Chicken Noodle Soup) and the Garlic noodles with Imperial rolls and five spice chicken. I also had the sour plum soda.\n\nThe Pho Ga was pretty tasty with a good broth and great noodle consistency. The garlic noodles on the other hand were super dry and chewy. The chicken was perfectly cooked and seasoned and the sour plum soda was tangy and authentic. The imperial rolls were nice and crunchy and freshly made too!\n\nOverall, I liked the meal at Laksa, although service was quite slow and I wished that the garlic noodles were better.", "author": "Neivin M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-22", "description": "We had a delicious meal here with friends. The service was excellent. Clean, fresh and no MSG (which is really rare in SF!) Loved the five spice chicken pho and papaya salad with tofu. Would highly recommend- this is one of our new favorites!", "author": "Stanley I."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-25", "description": "Let me first say OMG! The food here is so good! The pho is on point, garlic noodle was so flavorful. I recommend this place.", "author": "Kevin D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-08-01", "description": "Very very bad service I drive 20 min to get to this place and the lady at this place treated me so bad I had to live hungry and with a very bad service don't cam to this place if you don't want to be treat like no  body very rude lady she was mad face", "author": "Irving E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-13", "description": "4.25 stars \n\nA friend of mine and I visited Laksa separately in the same week and had two different reactions. His gripe -- that it wasn't \"authentic.\" My tastebuds only understood that the food was delicious & I came back for more just a few days later! \n\nI've yet to try their pho because I keep fiendin' for their buttery garlic noodle plates, served in ample portions with imperial rolls (yup, also good) & choice of protein. The first time I ordered shrimp, the second time beef, both had a nice grilled flavor. \n\nLaksa is on my short list of go-tos when I'm craving Vietnamese food; tasty, consistently well made food served in a casual environment, I'll take that over an arbitrary definition of \"authentic\" any day!", "author": "Fancypants X."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-02-20", "description": "Ordered beef combo pho, but was disappointed with what I got. My noodles felt a little uncooked and weren't as soft as they should be. Boyfriend's rare beef pho was already well done when he got it. Staff was friendly, and service was fast. Might come again to try garlic noodles, but never for pho!", "author": "Annie K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-22", "description": "First time here, very impressed. We had the 5spicy chicken pho. The chicken was on point juicy, tender and full of flavor! Jenny and bill had excellent service, he explained on how they got the chicken that way. We will definitely be back soon.", "author": "Angelina G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-23", "description": "Situated a street over from the strip of cute shops. We came here craving Vietnamese. It's a super small restaurant with really nice attentative staff. The loss of a star was because my fork handle was super sticky and I had just washed my hands so I knew it wasn't me. Lol. However the food was great. I ordered the five spice chicken and garlic noodles with a fried egg roll. It hit the spot. The chicken skin was crispy and delish. The garlic noodles were perfect. And my friend got pho with five spice chicken. The chicken came on the side. We both enjoyed our meals.", "author": "Kat K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-24", "description": "This review is based on the delivery order via Postmate. The Yelp app didn't work.\n\nI ordered the Grilled shrimp and imperial roll with garlic noodle and the Curry broth chicken noodle soup. The food were almost perfect. The least favorite item is the chicken in the curry broth - took 1/2 a star out.\n\nI will definitely order with them again.", "author": "anita s."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-09-03", "description": "Came with friends to get some pho, and this was probably the worse I've ever tried. The soup had absolutely no flavors and tasted like water. We had to make our own sauce by adding in a bunch of limes, hot sauce and hoisin sauce to make it better. Even then it was bland. It's likely that they did not make the broth with meat in it. Also, there's not a lot of options for meat such as tendon and tripe, and they have just the basics. I also tried the Imperial Roll vermicelli with chicken, which was better than pho. The chicken was nice and crispy on the outside and tender on the inside. The service is also bad. They gave us withered basil, and when we asked for more they said they ran out. Then, then shouldn't have served us leftover, withered basil in the first place. They also don't give you cilantro or raw onions until you ask for it, and they seemed super hesitant to serve it. I don't recommend this place, or at least not the pho noodles.", "author": "Brenda Jiwon L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-10-15", "description": "I can only speak to my delivery experience but they didn't follow my instructions with regards to ingredients to leave out, and did not provide cutlery. But at least it was delivered on time.", "author": "June O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-16", "description": "Love this place, very good customer service! The boss is very nice too!! Love garlic noodle and rolls here, will definitely come again!!", "author": "Xiaojun H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-20", "description": "Excellent food, great prices, and amazing service. Garlic noodles with pork is one of my favorite dishes. Hard to find homemade feel like Laksa delivers.", "author": "Ramz A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-19", "description": "I got delivery, ordering the curry-coconut chicken soup and it was really far above expectations.  The chicken slices seemed to be marinated or nicely seasoned and very tender, much more flavorful and delicate than the kind of dry, bland, dense chunks of chicken breast we grow accustomed to in many Asian chicken soups.  The broth was satisfying and spicy but not at all *too* spicy (perfect for my chest/throat cold).  \n\nI also go the papaya salad with beef which was less dressed/less limey than I'd expected (from Thai som tam)but a good size and toothsome.  \n\nLooking forward to exploring more of the menu, as I sense this is no generic VN operation but cares about quality and has a unique food aesthetic.", "author": "bentropy f."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-06", "description": "Delicious! The food was very fresh and feels good in your tummy! The way the prepare the chicken for pho is so yummy! Also, loved the garlic noodles with chicken curry! Delicious!\nSpring rolls were like standard spring rolls. However, the peanut sauce was especially  delicious!", "author": "Tina M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-16", "description": "Excellent food. It was my first time to eat here and I figure out that I'd like to come back next time. 5 stars worth it.", "author": "EDwin N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-19", "description": "Laksa, is a block away from CCSF- Mission Campus. I am always craving for Vietnamese Garlic Noodles. To really spice up this review, please try their imperial rolls, and five spice chicken that comes with garlic noodles. This dish is not excessively salty nor greasy. I must say, the food at Laksa is more than stellar if you want authentic Vietnamese cusine. Genuinely tasty!", "author": "Teresa C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-01-03", "description": "Ordered their garlic noodles with beef through UberEats the other day. So-so. The beef is okay, though scarce, but the noodles really could use more butter and garlic. \n\nOne and done.", "author": "Paulina F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-16", "description": "Though I don't live in San Fransisco, I'd go here to have their five spice chicken garlic noodles. It's buttery and has a garlic taste but not too much to leave a lingering garlic breath. The chicken is juicy and tender while the skin is crunchy which is surprising compared to most Vietnamese restaurants where the chicken is inevitably dry. \n\nTHE NAME LAKSA IS A VIETNAMESE HERB NOT TO BE CONFUSED WITH THE MALAYSIAN COCONUT NOODLE AS THEY DO NOT SERVE THAT. This is a Vietnamese place! \n\nTheir spring rolls and imperial rolls are the best to have for a quick appetizer before your main dish comes and the wait is not long at all. \n\nThe service is fast and inviting. Don't hesitate to ask for anything extra as they only give sprouts, basil, lime and mint with a pho order. They are busy around 7-8 on weekends but the wait for a table is quick. \n\nI would come back to this place to get the garlic noodles as they're the best on the menu. I notice they also have many regulars which makes the place good for conversation if you return. Overall, a good place to enjoy Vietnamese cuisine and have a good time with friends or family~", "author": "Jasmine C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-19", "description": "This is my favorite neighborhood pho spot! I've come here with friends before a night out and during illness to help me recover. Every time I'm here it hits the spot.\n\nThe pho is served in a large bowl filled with noodles and all the fillings. They even do me the favor of steaming my bean sprouts whenever I ask. I always order the combination with all the meats, and they never disappoint with the amount of food served. \n\nThe 5-spice chicken is also especially delicious. My boyfriend had this one time with the garlic noodles and I'm still crave it from time to time. The meat is uniquely flavored and battered in such an appealing manner - I've never had anything like it before.\n\nAnyhow, as long as I live in this neighborhood I'll be coming back to Laksa. The place is no-frills and you get exactly what you want from this pho experience and friendly service.", "author": "Jenny D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-10-13", "description": "Simple Vietnamese food, maybe will try the pho next time (vermicelli salad was good, just not my dish)", "author": "Maggie S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-05", "description": "I hesitated writing this because each time I go there it get busier and busier. They've been open a year and the prices have already risen once, although still very reasonable. I want to keep it a secret, but I can't be selfish. Best pork chop in SF. Great Imperial roll. Awesome and tasty ph. The Garlic noodles are heaven. The most expensive combo plate on the menu is like $12 for the Imperial Roll, garlic noodles and 2 pork chops. Can't beat it, and the older guy that works there is very friendly and funny. He loves to make his customers smile :)\n\nI'm a regular, and you'll see me there with friends or alone in the window seat with a pork chop on my plate and a smile on my face.", "author": "Gio D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-12", "description": "Great place for dinner. The staff is super friendly and came up to us multiple times checking in. They were very accommodating when I decided to change my order last minute. \n\nFood Order: Seasoned Veggie Vermicelli\n+ Good portion and tasted great", "author": "Isaac A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-11-05", "description": "Great casual Vietnamese spot\n\nGarlic noodles. 5 spice chicken. Lemongrass pork yum. \n\nThe fried imperial rolls were really crispy and kind of burned. So hard to tell flavor. Not sure I'd get it again since it was all burn, not too much else. \n\nHaven't tried their pho but I would definitely get the garlic noodles and pork and chicken again.", "author": "Traci H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-09", "description": "I came to Laksa on a saturday morning around 11:30 for lunch. There was no wait and the service was fast. Portions were huge!! My friend and I each got an entree which came with some veggies, protein, and carbs. The protein is pretty much the same across the whole menu but you get to chose which type of carb (rice, vermicelli noodles, or garlic noodles) I'm lactose intolerant and garlic noodles are normally filled with butter so I went with the vermicelli noodles with imperial rolls. \n\nThe other reviews were on point! the imperial rolls were delicious. I think this place is on par with sunflower and mal, although I'm not a vietnamese food connoisseur :P I liked both and Laksa is very reasonably priced. I'd come back if I were in the area.", "author": "Annie Z."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-07-28", "description": "Great food (imperial rolls were A+) but extremely mediocre service. They're constantly rushing their customers (we were asked to order within 20 seconds of sitting down) and were extremely rude when we asked any questions about the food.", "author": "Sandesh K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-22", "description": "First time trying this place, my friend recommended for me! Very nice boss,food was so good~ I love their garlic noodles with pork, will definitely come again! Highly recommend for this area:)", "author": "Iam H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-25", "description": "Great vermicelli at this location. Their five spice chicken is better than Perilla. Their pho though is not as good as Miss Saigon. Cleaner than Miss Saigon. Very friendly owner.", "author": "Thomas C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-11", "description": "Of nearly 70 items on their menu only three reach $12.50.\nFor the price I don't know how anyone can beat their quality and freshness. The space is quaint yet not quite a hole in the wall. Service is always good and a chilled bottle of fresh water will be placed on your table upon arrival. \n\nAt $9.25 their Five Spice Chicken Vermicelli is very good. And at $1 per Prawn I add five of them to this wonderful mix of texture and flavors. \n\nAt $11.00 their Garlic Noodles with Charbroiled Shrimp arrives with a bit of broccoli and something like an egg roll. Their shrimp couldn't be prepared more perfectly. \n\nKudos to Laksa's Art of Vietnamese Food, I'll be back.", "author": "Caesar A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-19", "description": "This is the best Vietnamese food around! Everyone here (most of all Jenny) is really nice. I've tried the chicken and garlic noodle, the beef combo pho, and various Vermicelli -- all are astounding. The noodles, fresh made house sauces, and rolls make this one of my favorite spots for satisfying and refreshing meal. You will never go wrong!", "author": "Jon T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-06-28", "description": "Got the beef pho via Uber Eats and it was acceptable but nothing special. It was literally just broth, noodles, and beef, no onions or anything else in there. It satisfied the craving, but just barely.\n\nThe pork spring rolls were pretty delicious, but there was no peanut sauce, which seemed like a shame. More of a failure of eating via delivery though than the restaurant itself, so take that how you will.", "author": "Megan B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-08-27", "description": "Interesting to see a Vietnamese restaurant run by those that don't speak Vietnamese - had to try it out. I ordered the Five Spicy Chicken Pho with a fried egg. The chicken itself was amazing, easily one of the more tastiest chickens I've had period. The broth wasn't that flavorful and could use more seasoning though: star anise, cinnamon, fish sauce.", "author": "Nicholas N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-06-06", "description": "I really wanted to love this place - both because it's a few blocks from my apartment and it's a small business! But the food isn't good...at all. I hurts me to write that since I want to see more pho spots thriving in the mission but the fresh rolls, tofu pho, pho ga and bun thit nuong were all disappointing. The tofu pho had a few chunks of carrots floating around. The pork in the bun left a film in my mouth. Sad to say I won't be back. Thrilled to say I'll always have Mau!\n\nOn a positive note, the service is wonderful. Our waiter was so friendly and chatty. But service without the delicious food just won't cut it.", "author": "Stephanie C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-02-08", "description": "I've been here twice and the first time was great! Since I had returned from Vietnam and very excited to have a Vietnamese coffee. The old man was great! Very polite and accommodating and we talked about coffee! \n\nMy second time this week I was not impressed at all! Actually disappointed that the lady completely ignored me, I sat and watched her deliver a Vietnamese coffee to lady at a table but then when she made my coffee she told me \" your coffee is done\" it was obvious I need to get up from the table and get it.  To be honest I felt very uncomfortable as if I was a burden to be in the restaurant.   I order food which looked nothing like the menu, I kept looking for the cucumber and mint, which wasn't in the dish but should have. Food was great. I will not go back due to service.  While I ate my food she seemed irritated but I kept seeing her hugging an old lady and just sweet to other guests. I'm wondering the whole time should I even ask for a ice water or should I just go.   I also kept thinking go to a different restaurant and get a cucumber salad and add to this dish.    \n\nI should not feel uncomfortable in a restaurant that I am ordering food and spending money.   The restaurant was not busy only 3 singles the entire time and they did not all sit at the same time - the restaurant was empty.", "author": "Linette H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-06-09", "description": "Average. They don't actually serve laksa. No complexity of flavors. Part Vietnamese part any old plain Asian. Feels like a Westerners version of simple ordinary Asian out of the box.", "author": "Chris D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-05-18", "description": "Not my favorite but it gets the job done when you're in need of a warm bowl of pho.  Really laid-back and casual atmosphere with friendly service.  The broth seems very clean and light but I do wish it was a bit richer in flavor.\n\nGarlic noodles are also a favorite here.  They were alright.\n\nFor the area, this is probably the most affordable Vietnamese option and for convenience, I will definitely still come to Laksa but it's not my favorite Vietnamese restaurant by far.", "author": "Jess Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-06-10", "description": "The pho broth is subpar, a little watered down than the other broths in the city. Service is a bit slow, but I won't hold it against them. \n\nWe ordered the rare beef and brisket pho as well as the five spicy chicken pho. The rare beef tasted fresh and was of good quality. The five spice chicken has all the right flavors and was cooked perfectly, but the broth is where lives are changed and careers are made. Fell short. The five spice chicken pho came with the beef broth, so beware if you're not a red meat eater and looking for a chicken broth. Wasn't a problem for me. My biggest gripe is the lack of depth of flavor and saltiness of the broth, although I get how some folks might prefer this. \n\nFrom other reviews it seems like the garlic noodles are the bread and butter of this place, so I'll have to come to return.", "author": "Anthony G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-07-10", "description": "This food location is by Dolores Park and Mission St, where there's a lot to do and eat. My friends and I decided to give this place a go on cold evening, when we thought Pho would be best enjoyed. I ordered the Beef Pho and felt disappointed. The broth lacked seasoning, which was a major downer. Although I tried to season it myself with soy sauce and the other condiments offered, it still wasn't up to par. At the end of the meal, I was not pleased with the fact that the bill was higher than I was willing to pay. I wouldn't go back here, but at least I can say I tried and gave it a shot.", "author": "Joseph A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-22", "description": "I  am dating my friend for lunch here, they make papaya salad with pork very taste. We will come back and try different thing.", "author": "Julio S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-16", "description": "this is the best place i ever been, food is good, service is good, i travel all the way to CA, and this is the most recommmed place, next time i will be sure be back", "author": "Wilson T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-09-24", "description": "When is a Perilla not quite a Perilla? I guess when it's a Laksa. This is a modern Vietnamese spot in the Mission on Guerrero right off 22nd, and if you didn't look at the sign, you'd swear you were at another Perilla, the city's more established Vietnamese mini-chain of currently three locations, all of which serve my favorite rendition of Five-Spice Chicken with Garlic Noodles. The secret to their allure is that they infuse their noodles with butter like Paula Deen on a racist-rant shoot-up, and for some reason, the poultry is plump and juicy while the skin is just slightly crisped. It's quite a feat they manage at all their locations.\n\nSure enough, Laksa offers Five-Spice Chicken and Garlic Noodles for $9, a full $2 cheaper than Perilla, so I decided to go for it. Even though the execution looked quite similar with the chicken thigh meat pounded to an inch of its former life with the skin intact and crisped. The buttery garlic noodles were there though in a bit more paltry serving, and even the broccoli florets made a cameo appearance (photo: http://bit.ly/2cMtKLV). However, it wasn't the same. The flavor wasn't quite at the same level and the edge of decadence didn't feel as evident for better or worse. OK, worse. It was decent enough though and hardly the cause for complaint.\n\nBefore I ate the chicken though, I ordered the $6.75 Fresh Spring Rolls, which I thought were a bit middling as well. I chose the grilled pork and I liked how you could see the grill marks through the translucent rice paper, but the rest of it was a bit by-the-numbers with the vermicelli noodles a bit limp and the lettuce a tad wilted (photo: http://bit.ly/2cS4aaj). The portion was certainly enough for two people, but Jamie W. wasn't with me so devoured it I did. There are a lot more garlic noodle and rice plates as well as pho of which I saw hefty bowls pass by me. I may have to come back and try their $9.25 Pho Ga sometime and see if it compares to Turtle Tower.\n\nFOOD - 3 stars...solid executions of tried-and-true Vietnamese dishes but still middling in satisfaction\nAMBIANCE - 3.5 stars...nice open space in the Mission\nSERVICE - 3.5 stars...certainly friendly and accommodating enough\nTOTAL - 3 stars...still prefer Perilla but I'm not dismissing it either", "author": "Ed U."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-08", "description": "I love Laksa, we always order delivery to Noe Valley. We need more places like Laksa. Great food, made with care.\nThanks!", "author": "Julio S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-22", "description": "Laksa is a good example of simple but delicious. The owners Jenny and Bill always take care of us. Everything is good but some of my favorites are the Sautéed string beans-very flavorful and garlicky\nGarlic noodles w/ any meat- charred bbq meats are cooked to perfection and has really good charred flavor to top it off. The garlic noodles are cooked perfectly with great flavor.\n5 spice chicken- hands down best I've ever had anywhere, ppq or Ben tre can't compare. Always juicy and tender with crispy skin to top it off\nThis is my favorite Vietnamese spot in the city.\nTalk to Bill and Jenny, they're always accommodating and will customize your order if you ask as well.", "author": "Mike C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-22", "description": "Just stop by and tried, food are delicious, and boss so friendly, will definitely come again! Love Vietnamese good!", "author": "Wayne C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-12-23", "description": "I was not feeling very good and I thought to come to Laksa for some Pho.  I was greeted by a less than smiley woman for a first. As soon as I walked in the music was blaring and I asked her kindly if she wouldn't mind turning it down a notch. She seemed annoyed.  Not at all friendly as she dropped the menu down. After ordering she seemed annoyed when I asked her if she had any tea. I couldn't hear her when she told me what type of tea it was so I asked her to repeat what she said. Man, for some reason she just gave me the vibes! I received my pho and ate quietly. I almost thought of getting my pho to go because I felt such negative energy in there!!!  I had no idea what the hell the deal was with her. Anyway I was ready to pay up and get the heck out of there. I had to look for her in the kitchen to tell her I was ready to leave. She never asked me how the food was, like she did the other customers. She left me with the bill and walked away back to the kitchen and said nothing! I didn't bother giving not a penny tip. She was a complete dick. Never again.\n   She's still at it again. My response: Well then that was easy because if I was going to tip you, you definitely would never be one of them. I have a list of things in which showed disrespect and rudeness on your part.  I did nothing more than come in to get a bite to eat. I was never rude to you and said thank you many times. I think you may have confused the word respect because asking or requesting something from a waiter or waitress is not a bad thing nor is it unheard of. You had every opportunity to say no for whatever reason. It is you who should take responsibility for saying yes and then taking out your irritation for your own decision on me. If you didn't like your decision that is your fault. I have been in Hospitality for over 15 years and you need to grow up.", "author": "Pamela A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-09-11", "description": "Not bad but over rated. I would Dai is a 3.5 stars. The pho soup is no flavor. Spring roll is not bad but also nothing special. The fried tofu on the papaya salad was good.\nCold rice noodle is ok but also no different from a $5 Vietnamnese  mom and pap shop. Service was nice but not well organized. The table next to us arrived before us and still don't get food when we left the store.", "author": "Anya C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-19", "description": "Really good crispy 5 spice chicken with garlic noodles. Only wish the noodles were a tad more garlicky. Tried some rare beef pho and unfortunately that was just not that great. Kinda small bowl, and the broth wasn't quite there for me. A bit on the sweeter, side but also just kinda flat in flavor. Beef was just ok too. however, will definitely come back for their garlic noodles, and service was great!", "author": "Vivian D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-02", "description": "The chicken curry with garlic noodle is the bomb!! The staff is super friendly and this place is a great choice to sit down or to go!!! Always get the imperial rolls!!", "author": "Jason J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-09-03", "description": "Location - great\n\nService - excellent \n\nCleanliness - excellent \n\nPrice - excellent \n\nFood - average to below average.\n\nCame here to eat with girlfriend. I got the bun bo hue(?) and she got this shrimp noodle thing. My beef wasn't very flavorful, but I didn't mind for what I was paying. The girlfriend though found some uncooked shrimp in her noodles which was not okay. That bummed us out because we really wanted to make this a regular spot due to the location, but having uncooked/possibly spoiled ingredients is not okay to serve to your customers.", "author": "Zhi L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-04", "description": "This place is probably great, but Yelp dropped the ball here: the hours listed are wrong! Yelp get your act together!", "author": "David P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-12-03", "description": "Asked the lady owner what their specialty was at the checkout counter. Wasn't sure if she heard me after no response, so I politely repeated my question. She says in the midst condescending way for me to wait after she's done inputting some request. \n\nWalked out because I'm paying for food and service not to made to feel stupid. First time, never coming back. Places like this don't need customers. Would it hurt to be courteous?", "author": "Lily A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-27", "description": "They didn't mention anywhere that I need to put a note requiring chopsticks so my food came without chopsticks (I ordered a delivery) and when I called them and complained they asked me to go and get chopsticks (like really?? If that's the case why did I order food delivery at the first place?) Then they hung up on me. Yes they hung up on me. Their attitude is so good, seriously", "author": "Olivia W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-04-28", "description": "Wow, the manager had the courage to tell me I left too little tip. I usually leave a good tip when I get outstanding service, but when someone doesn't even come to the table and ask about how we are doing and refuses to give us more bean sprouts. This kind of service dose the deserve a tip. To have the nerve to tell me I had left too little tip is unacceptable.", "author": "Andre U."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-19", "description": "Vermicelli with imperial rolls and shrimp\nFive spice chicken pho\nSeafood pho\nVietnamese iced coffee\n\nEverything was really good and the owner/waiter was very nice and helpful and funny!\n\nArrived at 1:30 pm, on a Saturday and there were a couple of empty tables  so we were served right away. The food is coooked fresh to order so there is a bit of wait.", "author": "Foodlover B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-01-26", "description": "Not a fan, not a fan at all. Was excited to try Laksa after working out and ready for some good food. Convinced my work out buddies to come with me. We tried the spring rolls which were ok, green beans , 5 spice chicken with garlic noodles, and pho. \n\nSadly the only thing we kind of enjoyed was the green beans and garlic noodles. The chicken was extremely poor quality and bland. \n\nService was just as terrible. We had asked for fried egg on our garlic noodles multiple times at least 3 times and they ended up bringing it out when we were going to ask for our check. It wasn't busy at all so not sure what the reason was. A quick \"sorry it's going to take long\" would have been nice. \n\nPoor attempt at a eatery. Curious to see how they do with some many great options in the area it's not somewhere I would go again.", "author": "Hetal P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-03", "description": "Legit solid pho. This bone broth warms the belly for sure during chilly winter days without having to trek out to the Richmond/Sunset/Tenderloin.", "author": "Judy L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-01-31", "description": "I was disappointed by the quality of the food here. The servers were nice enough and the speed of service was fine as well. The garlic noodles were bland and the papaya salad was too sweet. The pork chops were the only decent thing I had. I wouldn't go out of my way to come here to eat lunch. The prices were reasonable, but not worth the quality of the food.", "author": "Lynn T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-26", "description": "Food is good, but I expected a Laksa section  which I couldn't find one. The closest thing was curry. You'll see rice plates, noodle plates and pho though!", "author": "Kevin L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-22", "description": "Pho is bland.\nRice plate is decent\nVermicelli bowl is decent\nImperial roll is good\nFresh Roll is good\nAmazing Five-Spice Chicken and Garlic Noodles.\n\nFor the foods alone, I'd rate it 3 stars because most of the Vietnamese signature dishes are just decent to below average. But I will rate it 4 stars for the prices & services.", "author": "Phuong P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-05-03", "description": "Ridiculous!! First they run out of the soup I want then when she does bring out my 2nd option it's the wrong noodle. When I tell her about it, she takes it and throws it away. So freaking wasteful. I would have been fine with her just switching out the noodles. Don't freaking throw the entire food away. There are so many hungry people here in SF .", "author": "Rachelle L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-26", "description": "Wow!  This place was great.  Between my wife and I and the kids, we had the BBQ pork, Five Spice Chicken, BBQ Beef, garlic noodles, Pho, and Viet coffee.\nThe restaurant was super clean and the owners were very friendly and prompt with service. \nI think out of all the things we had, the 5 spice chicken was our favorite.\nId definitely come back.\n\nSteve", "author": "Steve M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-15", "description": "I love finding good places to eat in SF where you can always get seated immediately! It feels like such a rarity. On top of that the owners at Laksa are also always extremely friendly and nice, and the food itself is reasonably priced, well portioned and tasty! It might not be the best pho I've ever had but it definitely satisfies a craving. Their garlic noodles and vermicelli noodle bowls are really delicious as well!", "author": "Stephany L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-10", "description": "The pho is good, the broth is good but lacks as much flavour as other phos.    The imperial rolls are great, very flavourful and the chicken is great.  And the delivery service is very good. I was very impressed by that.", "author": "Tara K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-14", "description": "My go-to work from home / home sick lunch order. It's packaged perfectly so nothing gets soggy. It's enough for 2 meals! Love the 5 spice chicken!", "author": "Jessica C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-03-02", "description": "Let me just start by saying that I'm very easy to satisfy when it comes to food (I'm not picky at all), and I've never thought I would give any bad reviews to any restaurants (my tolerant level is very high), until today.\n\nIt was my first time visiting this place, and I ordered the beef combo pho at lunch, and it was by far the most disappointing pho I have ever had in my life. The soup was this muddy gray-color water that looked like dish water, and barely had any flavor (you could tell that it was not made with real broth because there was no oil or fat in the soup at all), and the noodle had no flavor whatsoever. The only thing that had a bit of flavor was that two slices of beef... The whole thing was so disappointing that I tried to wash my mouth with Gatorade after I got back to my car...\n\nThe service was just as good as the food. The hostess did not seem friendly at all,  didnt even point me to any table to sit so I had to seat myself, didnt bring me the menu until I had to walk up to her and ordered it there, and when she brought me my food, she looked very pissed for no reason and sorta banged the bowl on the table... \n\nBut nonetheless, I still paid my meal and gave her a tip, but I don't think I will ever go back, or recommend anyone going there.", "author": "Simon T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-01", "description": "The foods are very good.  Garlic noodles & papaya salad are my favorite. It's very clean. Owner is so nice.  I love it here.", "author": "John P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-02", "description": "Great food and service. The garlic noodles are super fresh and garlicky and the Vietnamese coffee is made fresh to order. The pho taste clean and hits the spot. The restaurant is super clean and simple. Also, the staff is super nice and friendly.", "author": "Daniel K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-21", "description": "I went here for the first time and left disappointed in the service I received. First off, on Yelp it states that the restaurant closes at 9:30, but they said that they close at 9. Then, the cashier Jenny said that they had closed the kitchen down before 9. Not only that, but then Jenny asked if I could order fast and I was able to get the food, but if they truly close at 9:00, then how would they manage to still make my food?", "author": "Neena T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-18", "description": "I used to live around here and lament the fact that there was no affordable pho nearby. So imagine my excitement when Laksa opened!!! (Actually, I was more frustrated, because by this time I had moved a mile away.) The second closest place to the 24th/Valencia area is Mau -- which is more overpriced. \n\nEven though pho is on the menu, the highlight at Laksa = the garlic noodles. If you like your noodles chewy and with substance (and lots of garlic), don't hesitate to get a plate of these. My dinner buddy said it was like \"garlic bread in noodle form.\" YUM! \n\nI got my garlic noodles with the imperial rolls and pork on the side. I highly recommend the imperial rolls as well -- they're not very big for the value, but they're crunchy and savory in all the right ways. My friend got the veggie plate, which left a lot more to be desired... It was just steamed veggies (cabbage, and a few slices of carrots/mushrooms) lacking in flavor. So I'd conclude that the meat plates beat out the veggie plates. \n\nThe staff was super friendly and offered us all hot water since it was freezing outside. They also dealt with our crazy-loud party of 7 while still being very gracious. We appreciate it! \n\nI still prefer Tu Lan (6th/Market) for their extra huge portions for the price, but if I'm in the area I'll definitely be back for the garlic noodles. Delish!\n\nNote: Parking here is atrocious, as is all Mission parking (especially on a weeknight around dinner time). I'd recommend being ready to a) circle for half an hour, b) park far away and walk 15-20 mins to the restaurant, or c) just take the BART!", "author": "Christine L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-05", "description": "I have the Five Spice Chicken with garlic noodle. It is really delicious. Chicken skin is crispy, meat is tender and juicy. Must try.\nFriendly service. Will recommend to my friends and come back to try other dishes on the menu.", "author": "Danny L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-03-27", "description": "How did this place get 4 star?  I don't get it!\n\nAfter we got seated, My grandson dropped his fork and I asked for another fork.....the rude lady gave me a opened plastic fork that was by the cashier which was greasy.  Why was it so greasy?  Do they reuse plastic fork?  I wanted regular fork but I guess the rude lady was too lazy.  I had my grandson use my fork since I can use chopstick.\n\nWe ordered pho and a rice plate.  The pho broth was so salty that even my 6 year old grandson couldn't eat.  It was salty and taste horrible.  I almost gagged.  We ate half the rice plate since we were so hungry but could not finish because this also was bad.\n\nThis is one of worst Vietnamese restaurant I ever had.  I will not be returning and I don't recommend.", "author": "M H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-06", "description": "Been wanting to check this place out since it opened! 6pm on a Saturday. Not many people there but around 6:30 it was packed and pretty loud from the table of 8 and their kids next to us.\n\nTheir menu is extensive but I pretty much knew what I wanted. I got the veggie pho and my BF got the chicken curry pho. The bowls are stupid big and best to just share one. Impossible to finish one all to yourself! I saw every single table get the imperial rolls/spring rolls so definitely trying that out next time. \n\nThe curry is amazing. Super heavy and rich though so if you want something light I would not get this. It was the opposite of my veggie pho. I love that they have soft tofu. My BF only likes to go to Mau for pho but they don't have seafood pho and their veggie pho has fried tofu that I hate so I'm pumped about Laksa! The chicken here is advertised as free range chicken but my BF left his untouched. \n\nThe inside of this place isn't that cute like the outside would make you believe. Looks like a typical pho place and I can tell they were understaffed during the dinner rush. They were preparing never ending to go orders and I saw people waiting for a while despite numerous empty tables. They just didn't have a chance to clean any of them while preparing the take out orders. Would choose this place over Mau anytime. OH and the best part is that it's BYOB. Saw a table next to us buy beer across the street to drink inside. Sweet!", "author": "Tiffany V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-07", "description": "This would have been a 5 Star review if my Bun had come with more than just lettuce, noodles and peanuts. That was super disappointing. The chicken pho and beef rice plate were great, though!", "author": "Jacynth R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-04", "description": "A coworker was leaving and we needed to find a place close by to work... she picked vietnamese food, I didn't want to keep going to the same place we've been going to so I decided to YELP something and this one popped up - there were a few choices I gave to my coworkers and she picked this one - \n\nWe went there around the time they opened and a lot of empty tables. Parking kinda sucks around in the area so I wasn't too happy about that. \n\nWe ordered a pork spring roll, and shrimp papaya salad for appetizers and pho for 3 of us, and another coworker ordered GARLIC NOODLES - she was thoroughly impressed, I wouldn't say it's the BEST I've ever eaten, but it's pretty close. \n\nWe requested a few plates of the bean sprouts, at first, i think they were hesitant, but 3 of us had soups and we like bean sprouts!! \n\nAll in all, we enjoyed it, it was just a little pricey, if you compare it to the other pho restaurants. I thought the pho soup was good since it was light, but my other coworker said it was too bland. \n\nI would come back and try the other items on the menu.", "author": "Eugenia W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-06", "description": "So happy this place opened up only a few blocks away from us. (and even happier that they are open on Sundays).\n\nSimple menu, and they do everything as you'd expect. Very quick if you are in a rush or want to use Eat24.\n\nThe chicken, garlic noodles, pho and rolls are all delicious but simple. definitely caters to the new San Francisco crowd and the milder palate.\n\nIf you are looking for pho like you'd get in hanoi you might be disappointed (three stars), but if you are looking for a subdued version of the items you WANT to love at other Vietnamese places, Laksa is your spot. (four stars)", "author": "Mike V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-05", "description": "Pretty good standard Vietnamese fare.  Nothing too exciting.  Really good 5 spice chicken.  No laksa on the menu which drew us in.  Great service, owner is best friendly.", "author": "Reggie G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-22", "description": "Very good customer service! And they offer a decent price on food! Quality is worth it!", "author": "Rebecca W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-01", "description": "The GF and I came here 30 minutes prior to closing.  We were greeted, and immediately seated at a table.  At many Vietnamese restaurants I have been to, the menus are vast, and feel cheap and dirty.  Laksa's menus are short, simple, and have a finesse about them.  \n\nI ordered the curry chicken vermicelli, and the GF got the shrimp and imperial roll garlic noodles.  Food came out quickly and we dug in.  The curry broth hit the spot.  It was spicy, flavorful, and kept me wanting more.  The imperial rolls were rolled tightly, and had a great crispiness.  The noodles were good and did not seem to have that much oil in it.  \n\nService is quick, and the staff are friendly.  The prices are about the same as Perilla.  I enjoyed the imperial rolls here more.  I would definitely come back.", "author": "Victor L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-05-21", "description": "Meh - really bland broth in the five spice chicken pho. The cabbage salad didn't really wow us either. Overall did not satisfy our Vietnamese craving one bit.\n\nAnd no, this place does not serve Laksa.....", "author": "Bhavnak K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-18", "description": "This is a casual and affordable Vietnamese place, nothing fancy, but we really enjoyed the food. It was quite empty on a Monday evening. I'll definitely come here again.", "author": "Marta F."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-06-21", "description": "Horrible service. Saw a waiter spit in food of customer. The customer was unreasonable but spitting in food is ten times worse.", "author": "Brian Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-08", "description": "Why We're Glad Laksa is Finally Open:\n\n1) Friendly, laid back mom & pop vibe.\n\n2) Nice makeover of the former cafe space. Simple and clean with lots of pretty orchids.\n\n3) A brisk take out business. (Thank gawd because we've had one too many Vietnamese delivery fails.)\n\n4) Solid and reasonably priced eats - insanely hard to find in the Mission these days! \n\nThe Chicken Curry had great flavor and went well with the garlic noodles. Though the sauce and potatoes probably would have benefitted from a bit more cooking time. The Five Spice Chicken Vermicelli Bowl was a good rendition of a staple. We'll def-pho-nitely be back to try the other dishes.\n\nWelcome to the 'hood Laksa!\n\n(This yelp is dedicated to my Better Half, the Grand Poobah of yelp enablers. XO)", "author": "Amy C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-09", "description": "Little overpriced for pho, but when you come get pho in gentrified Mission what else can you expect? The chicken pho is super good. We sat down, ordered, and within a few minutes our plates were on the table. I finished it so fast even the owner was surprised. That's how good it is !", "author": "Antonella H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-03-04", "description": "We order the Pho Ga and Five Spicy Chicken Pho. This might be the worst chicken (Ga) pho I have ever had... You pretty much just get the last pieces of chicken that they couldn't use for any of their other chicken dishes and it was an incredibly small portion as well...   \n\nThe reason I gave the extra star was surprisingly the five spicy chicken pho was completely different and actually tasted pretty good. You actually get real chicken for the soup and 1 piece in this soup was more than all you got in the pho ga soup. As you get about 6-7 piece of chicken that didn't taste like rubbery/fatty chicken.\n\nIf this place used the same chicken for their regular chicken soup as their spicy chicken pho then I would definably double their star rating.", "author": "richard j."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-10-05", "description": "The food was very bland to me, obviously it's not authentic Vietnamese but I gave it the benefit of the doubt. After a few bites I couldn't bear to eat anymore I just wasn't feeling their cuisine. My daughter got chicken vermicelli noodles turned out the chicken wasn't cooked all the way. Obviously I'll never be coming back to this place, if you're looking for something more authentic this is not the place to eat but if you're in the mood for just eating well to each it's own.", "author": "Just Eat K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-12-04", "description": "3.5 Surprisingly good beef combo pho. I love the soup base. Didn't taste much msg. The beef balls weren't bad (always a struggle to find the right beefy balls) The plum soda was gross. I think they forgot to add syrup or sugar....", "author": "Ann L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-14", "description": "Grand opening restaurant and Laksa is already bustling. Walking by one evening, and I just want to give a try since this place is new to the neighborhood. This place is beyond. Authentic tasting and much better than most of the Vietnamese food I have had in the bay area. Good flavors. \n\nThe restaurant is very clean and simple. The owner and staff are very friendly.  I asked about the young coconut juice with pulp but did not order. The owner offered one to me on the house just to celebrate their first day of opening. GREAT. MANY THANKS.\n\nI LOVE garlic noodles. The beef garlic noodle is unexpectedly good. If you are looking for some warm hearty noodle dishes, definitely give this place a try. \nI will definitely go back to this place.", "author": "Kevi O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-03", "description": "Laksa continues to impress with good Garlic Noodle and Chicken, but I am no longer as impressed by the Pho as I used to be. Their Garlic Noodle is incredibly tasty, and is the dish I recommend to everyone trying out this location. The chicken is juicy, and the sauce pairs well, but it's the noodle itself that blew me away.\n\nI still have the Pho from time to time, but I feel like their broth can be improved. At first I enjoyed the lighter flavor, but now it feels too bland. The rare beef is great, especially if you order on the side, but I feel like there's always a lack of noodles.\n\nTheir imperial rolls are nice, albeit a bit expensive.\n\nLaksa is significantly cleaner than the typical Pho location, so that's a huge plus. Garlic noodles still makes it worth visiting.", "author": "Ben Z."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-02-06", "description": "Okay, so the Pho is delicious! The three stars is for the service. It is locally owned and very mom & pop. I ordered the vegetable pho and it was so tasty that my friends preferred it over their beef pho. There's not really an ambiance in the place and the service is lacking (I.e. we asked for more garnishes for our pho and the lady went in and out of the kitchen seemingly doing nothing and took a while to bring it out) but the food is good. I'd go again for the quick and cheap pho. Bill was under $40 for three people.", "author": "Jes Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-24", "description": "The chicken is delicious.  More words here to bring it to review length.  Many many more words. How many does Yelp need?", "author": "Mandy H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-22", "description": "Great service, delicious food! We had the garlic noodles, five spice chicken, beef, imperial rolls and Arnold Palmer.", "author": "Ro N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-12-05", "description": "Ordered the imperial roll and pork rice dish. Was so-so, halfway through eating it, found a hair in the rice - promptly stopped eating. The papaya salad is bland, the spring rolls are bland,the Vietnamese coffee was so-so. Service was supremely slow. Not sure why this place is rated so highly. Also the guy preparing the food wasn't wearing gloves.", "author": "Kay I."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-16", "description": "I had the chicken pho. Twas delish. I ordered through yelp with no issues. The toppings were fresh and the broth had good flavor. Parking can be a challenge so leave time if meeting people.", "author": "Gabriela H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-15", "description": "This is a great spot for Vietnamese fix! The staff is super friendly and service is great! Great for to go and sit down. You can never go wrong with the rice plates & pho!", "author": "Kristine C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-14", "description": "Great place if you are looking for something delicious, fast and easy. I've never had to wait for a table and the service is very prompt. I personally recommend the imperial rolls and the pork.", "author": "Kelsey H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-01-23", "description": "I got all excited cause I saw the sign for \"Laksa\"! I'm thinking OMG a laksa place finally opened! It's so difficult to find a good Malaysian laksa, oh joy!\n\nNOPE!!! It's not a laksa noodle house. It's vietnamese pho and noodles. Please see definition for laksa below. It's like putting \"Pasta\" on your building but only serving Pho. Also like putting hamburgers on your building but only serving sandwiches.\n\nNo idea why a vietnamese pho place decided that Laksa was what they would call their restaurant. There is not a single thing on their menu that says Laksa.\n\nhttps://en.wikipedia.org/wiki/Laksa", "author": "Purple Lotus x."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-31", "description": "Yay! A new pho place in the Mission district that is affordable, great tasting, and clean! The owners are kind hearted, hard working, and eager to create an establishment that is \"part of the neighborhood\". This place encapsulates \"mom & pop\" vibes which makes dining here even better. \n\nMy friend and I had the beef combo pho, 5 spice chicken pho, and the garlic noodles. The chicken & beef broths were flavorful without being too salty. Which is great because I hate feeling like I need to chug a gallon of water after my meal. The 5 spice chicken is juicy and pan fried to perfection! It comes on the side so it doesn't get soggy in the broth. \n\nI'm usually not a fan of garlic noodles because the ones I've had in the past at other places have been overcooked, soggy, and greasy. But the sign outside said \"best garlic noodles\" so I figured it would be a sin if I didn't try. I'm so glad I did because it was SO GOOD. Can't wait to come back again!", "author": "Erica L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-11-15", "description": "Craving for pho and came across this one since we were in the area at the time, we did order online through yelp. No problem with that, opening it in the house and very disappointing few chicken chunks of pho (we ordered chicken pho and beef combo, also thai tea and rolls- forgot what kind of roll but there's nothing to be excited about) yes! very FEW chunks of chicken meat I was like is this a kids meal?! I order take out a lot and i dont think the amount of meat is unacceptable also the thai is like watered down sure ice melted but would still be sweet and good but this one is no go for me. Very disappointed. should've taken a picture but too hungry to do so.", "author": "Chey I."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-22", "description": "This place is amazingly good!! Their customer service is great and they're all super friendly. 10/10 would recommend eating here!!! I've found my new go to place to eat their five spice chicken is to die for, along with their Thai Iced Tea without the milk, I know it doesn't sound normal but try it, you will love it!!!", "author": "Samantha W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-22", "description": "This place has amazing pho and their imperials rolls are a must try!! I get it everytime I come here. Their portion sizes are also pretty generous.\n\nDefinitely give this place a try if you're craving some Vietnamese food!!", "author": "Raymond W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-07-13", "description": "The broth was almost like water in its consistency but did have a slight taste to it. The noodles looked like they were just placed in there because most of it was still in a square-like shape when the bowl was served. I also had to let the noodles sit in the broth for a little bit because it didn't have any taste to it. I also thought they could've included 1 or 2 more pieces of brisket in the bowl. Service was friendly though and I'll be back to try out their garlic noodles since their sign outside say it's the best.", "author": "Gerard Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-29", "description": "I've since come here over 20 times either when alone, feeling sick, or with a group! I pretty much always get vegetable pho now because it has mushrooms and is better than most veggie phos. Otherwise I get pho ga. Often we split spring rolls. Everyone is so friendly and I continue to be thankful to have this place in the neighborhood.", "author": "Dana H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-07", "description": "We adore this place! A fun family owned  vibe, fast, clean, fresh and not over priced. We go or order weekly. I rate a restaurant by many things but the ultimate is how my tummy feels an hour later and it loves this clean tasty food. Garlic noodles!!!", "author": "Sion S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-22", "description": "Best place to eat! Different than your average Vietnamese restaurants, owner is really funny and entertaining.", "author": "Brandon W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-23", "description": "My new FAVORITE! This place is going to be a habit. I had the Curry Chicken Pho. It was amazing. Babe had the Curry Chicken with Garlic Noodle. The garlic noodle are the best I've had in a minute. Garlic fresh chopped and plentiful. We also split the Imperial Roll. \n\nIt's just a classic Vietnamese menu. Just done a bit tastier. Pair that with a super friendly & attentive staff. I love this place.", "author": "Jessey A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-17", "description": "This will now be my weekly staple. It's fresh great good. Other places are hoppy greasy and over seasoned. I love that not only is this place really good at what they do but they deliver!!!! I am the luckiest girl ever!!", "author": "Angela C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-04", "description": "They have the best imperial rolls!   The place feels a bit like a family diner; very attentive and prompt service.", "author": "Judy H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-24", "description": "Love this new spot in the neighborhood.\nGreat 5 spice chicken, garlic noodle and pork chop.\nThey are super friendly, nice and clean. \nA nice alternative to Mau since they can sometimes be crowded. Great prices too super cheap & large portions.", "author": "Kristy H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-11-28", "description": "Really low quality garbage. Sloppy. Soggy imperial rolls. Flavorless broth even after adding lots of basil, lime and jalapeños. Add ons are way overpriced for what you get lol. Rare meat is half inedible because you can't cook 50% gristle in lukewarm pho broth. No other place gives you uncooked gristle.\n\nService was nice, but get your shit together guys!", "author": "Ian S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-11-10", "description": "I wanted something vegan or vegetarian, yet sadly there was neither choices on the menu. Its menu is laden with dead animal and animal byproducts. Even if it offered a veg dish, I wouldn't eat it here. The cross contamination from the dead animal corpses and the stench of death was overpoweringly pervasive. I walked out in disgust. Most Vietnamese places offer at minimum a good vegetarian option, such as soup, even in the tl. Smdh.", "author": "Gemma S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-07", "description": "The people are super friendly and the garlic noodles are the best. They do carry out and they don't break the bank, about $10-15 for dinner. I had leftovers for lunch the next day.", "author": "Ezra T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-10", "description": "Curry chicken vermicelli and Thai ice tea!! My all time favorite ;P. Never disappoint me. Give it a try if you like Curry. The restaurant is clean and staffs are very friendly. Price is reasonable.", "author": "Queenie M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-12-04", "description": "I really wanted to like this family operated restaurant as the Mission could really use decent Vietnamese. Unfortunately, Laksa doesn't fill the void. \n\nOverall, the food is barely ok--the pho (meat and broth), BBQ pork chop. The only highlight was the garlic noodles.  \n\nThe service was nice but inexperienced and unorganized. It's unlikely I'll go back. I rather drive to Daly City.", "author": "Jenny L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-01-14", "description": "Mediocre. Fast delivery but poor food and portions. \nOrdered five spice chicken  with garlic noodles, sautéed green beans and lemonade. \n\n-Chicken was really bland, almost al chewy with tendons. \n-noodles were bland, could probably make them better at home \n-portion of green beans was skimpy, less than half the container. Great flavoring though! \n-lemonade tastes like a melted lime popsicle.", "author": "Mandy F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-10", "description": "Love this place~ Great service! Very clean place! Love their rolls and vermicelli, must try~  their thai ice tea is also good! Affordable price!", "author": "Pauline P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-23", "description": "I work next door to Laksa and I always get the 5 spice chicken pho. It's amazing, the portions are huge. It's a all day process for me to finish it! All the workers are so sweet and very attentive.", "author": "Lisa C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-03", "description": "Owners and staff are great, good for kids and food is simple and delicious. My kids love the garlicky string beans and garlic noodles.", "author": "Ian W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-18", "description": "Finally tried their garlic noodles and it was yummy!! I ordered the five spice chicken with imperial rolls and garlic noodles and it was more than enough for one person! Left overs are for dinner. Will definitely order the garlic noodles again!", "author": "Neni E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-19", "description": "came here with a large group. Wonderful service! Super friendly! Food was delicious! Will be coming back here for sure!", "author": "Katrina M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-24", "description": "I'm so happy to have a good Vietnamese in Mission/Noe. The brisket pho and five spice anything is delicious here.", "author": "Sarah C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-19", "description": "Great lunch spot for take out or dine in. Their egg rolls are crispy and they give lots of meat for your order. Garlic noodles were on the lighter side but you don't end up feeling weighed down after.", "author": "Julie L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-08-12", "description": "The service and the atmosphere is nice but the food could be much better. \nThis place reminds me a little of Chubby Noodles. \n\nOur table ordered the Stay Beef Pho and Garlic Noodle plate with five spice chicken. Both dishes had okay presentation but the flavors were lacking. Only the five spice chicken was worth it as it was juicy and flavorful. However, the garlic noodle and the stay beef broth was bland and lack flavor depth. There is potential but I would not return to this place if nothing changes.", "author": "WQ C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-01", "description": "Love this spot for a quick, casual bite! Food is stellar and the service is fantastic! Nicest people who operate it...", "author": "Scott H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-09-17", "description": "I wanted to like it, but literally nothing I had here was that great. \n\nFresh spring rolls (pork): 2.5 stars - underseasoned pork, not enough meat, too much noodles. \n\nGarlic noodles with five spice chicken: 3 stars - noodles were ok. Pretty fragrant, garlicky, but nothing special. Five spice chicken was under seasoned and over cooked. Crispy skin, but the meat was tough. \n\nFive spice chicken vermicelli: 3 stars - fresh, crisp lettuce, but the five spice chicken was meh. Nothing compared to Ben Tre! \n\nOverall left feeling pretty disappointed. The staff was very nice and friendly, though. \n\nUnfortunately I'll be returning to my usual go-to Vietnamese in the Mission, Mau.", "author": "Michelle K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-03", "description": "Went with the beef combo pho and imperial rolls. The rolls tasted great and fresh, but the pho was meh. Definitely have had better.", "author": "Alex L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-09-04", "description": "The people are super nice! It's small, but we've never had an issue getting a seat. The pho is pretty good, but the rare steak is pretty much well done toast by the time it hits the table. Come to think of it, the meatballs are kinda cruddy and the brisket is total junk. If you like pho with all the tendony goodness, not here. The quality of the food overall stands out, in spite of the disappointing pho. Just need to upgrade that pho situation... I'll send an update when I try that papaya salad.", "author": "Micah B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-06", "description": "Finally an affordable, yet legit food in the Baja Noe area. Authentic-enuff, unpretentious Vietnamese food, for the Mission area. Finally something that isn't too sissified for the mainly non-Asian clientele.\n\nI can say that because I am of the Far East Asian descent. Thumbs up. I will def be back! Btw, I ordered the garlic beef noodle with imperial rolls. Will try the pho next time.", "author": "Jerry P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-02", "description": "Their garlic noodles and charbroiled pork are a delicious and priced pretty well. The people their are quite nice. They even gave us a free Thai tea as we go there quite regularly.", "author": "Irene N."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-09-11", "description": "I went here based off a recommendation from a colleague -- to put it short, they failed to meet expectations. When we entered the restaurant, it took them at least 10 minutes to address us and seat us, the waiters seemed to just be using their phones and really seemed to not want to be there. We had to speak up and ask them directly to seat us. The person that took our order seemed upset and spoke to us in a very hostile manner, it was unpleasant to say the least -- on top of that, we had to explicitly ask for water. The service was terribly slow; it took more than half an hour for our food to come. There were multiple bugs that were flying around and crawling around our table which made things worse. Although the food was not bad, the service here and environment was horrible! Not impressed at ALL.", "author": "Peter W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-17", "description": "Went in when they first opened and got something -- thought it was pretty so-so.  When my girlfriend wanted Vietnamese a few months later, we ordered delivery... They seem to have figure out the problem, and everything was delicious.  I find the restaurant itself a little uncomfortable, but everything I have eaten has been quite good (with the exception of the curry chicken which was kind of unsatisfying).  The side of garlic noodles is a perfect complement to pretty much everything else", "author": "Warty B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-10-24", "description": "Mediocre Pho joint. The pho special lacks tendon and tripe. Broth was lacking. Seems like it mostly caters to white people and hipsters who find tendon and tripe unusual. Not authentic at all.... You can tell by the misuse of the name Laksa, which is originally a Chinese Malaysian curry noodle dish.", "author": "Alex Z."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-04-13", "description": "Came here craving garlic noodles. Ordered the charbroiled pork chops with garlic noodles, served with a few broccoli stems. Meat was a bit chewy and fatty. Noodles were cooked perfectly but a bit bland. Server was helpful and efficient. Dining area was clean and lots of available tables. Maybe I'm a stickler, but I've had better noodles from a food truck. Didn't satisfy my craving.", "author": "Mary C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-19", "description": "This place is great spot if you like vietnamese garlic noodles bbq plates. Their vietnamese fried eggroll is super flavorful and fried to prefection. My favorite dishes are probably the beef papyay and bbq pork shrimp with garlic noodles plate. The staff here are super friendly and the owners are very nice. I highly suggest you to come before or after lunch hours if you don't want to wait too long. Did i mention the price is very resonable and the portion is big too! Yay!", "author": "Aylee G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-25", "description": "Garlic noodles is the best idea in the world. They really hit a savory spot when you need all that garlicky flavor. It tastes like it sounds. And they fry their meat to a thin crispy layer of breading, which is amazing.\n\nThe combo pho is also awesome. It has a fresh taste because it's not too greasy. Somehow their pho noodles taste a little bouncy and good.\n\nI admit that I order delivery from Laksa and I can't stop.", "author": "Jack H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-24", "description": "Love it! Found out that this place just opened on Yelp. I had the chicken pho, and thought the broth, noodles, and chicken were the best in the area. Better than Mau. Thai ice tea was great too. The place is very clean and the owner will make you laugh. Highly recommended.", "author": "Moshe B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-06", "description": "Great new spot in the Mission with cool mix-and-match options (like curry broth, egg noodles, and the usual assortment of beef + rice noodles options).  \n\nOwners could not be sweeter.  Perfect for a cheap dinner or a hungover Saturday afternoon.", "author": "Malachi Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-29", "description": "A great new addition to the neighborhood! My bf and I ordered take-out, so I can't comment on the service (although the staff were SUPER friendly when we picked up our order).\n\nFOOD:\n* The beef pho was flavorful and tasty (perfect hangover cure). The broth wasn't super hot when we picked up our order, but that was probably our fault. While not on par with other Viet restaurants in the area, the pho was still pretty good.\n\n* Imperial rolls - delicious. Can't go wrong with fried pork egg rolls.\n\n* Five-spice chicken - the chicken was tender and flavorful, but I still prefer Mau's version for the crispy skin and sauce. The garlic noodles were also yummy, but could have been more garlicky IMO.\n\nStill overall, great place for some quick and tasty Vietnamese food that couldn't be any closer!", "author": "Vivian H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-29", "description": "THE BEST!!! The best Vietnamese food I have ever had! I would eat here every day. I can't wait to come back.", "author": "Chris D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-01", "description": "Ordered this for lunch a couple of days ago it was one of the few places offering lunch delivery. Had the five spice chicken rice plate  papaya salad  and fried green beans . Will definitely order again - everything was delicious and the papaya salad with shaved so fine that it looked white instead of green. This made for a much better chewing experience and I highly recommend ordering from here so you can try that at least once.", "author": "Amy T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-19", "description": "Fantastic.  Driving on Guerrero a few weeks ago I saw this newly opened Vietnamese place and made it a point to return for lunch.  I ordered the imperial rolls/bbq pock vermicelli bowl - this is the item by which I judge my Vietnamese lunch spot by - it was delicious and authentic.  While Laksa is clearly a family owned and operated restaurant there is definitely a professional chef in the kitchen.    \n\nI am always happy to find authentic, unpretentious, small family restaurants.  Laksa made it a happy day today.  I'm looking forward to eating here again and updating my review.", "author": "Beautiful B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-06", "description": "We got there right when it opened, the server was very nice and was up to some light conversation. First up was the papaya salad, it was way bigger than expected, and very tasty. The Pork spring rolls were very good as well. I ordered the five spice chicken with vermicelli and it was a huge portion. The chicken was nice and crispy, good flavor. My mom ordered the garlic noodles with curry chicken. My mom literally doesn't eat rice or noodles and she said it was for me. She tried them just for taste and was hooked, I have never seen her eat so many noodles! All in all a great new restaurant!!", "author": "Taylor H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-07-24", "description": "Ordered delivery today\n\nTook a little over an hour\n\nOrdered \nChicken pho with thin egg noodles - they called and told me they ran out of egg noodles at 2:30pm. So We got rice noodles which we don't prefer... The broth  did not taste like pho broth at all. I was looking forward to flavorful pho broth. \n\nGrilled shrimp with garlic noodles- I enjoyed this hence the 2 stars, garlic noodles were good and the shrimp had flavor. \n\n5 spice chicken with imperial rolls and garlic noodles- chicken was bland and imperial rolls were burned but garlic noodles were good \n\nShrimp spring rolls- the shrimp spring rolls themselves were good (except I saw some old looking bean sprouts) but the peanut sauce they gave me was RANCID! The peanut sauce is what makes the roll good. So I could not eat these. Will see if I have some hoisin sauce and peanut butter etc to make it myself... Really disappointed that they would give me old rancid food .\n\n\nBut for Vietnamese delivery which is rare it's not bad. I'll just stick to the garlic noodles", "author": "Karen K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-19", "description": "I went to Dolores park and got hungry. I yelped places around because I was craving noodles. Laksa was a short 13 minute walk from the park. I got the shrimp garlic noodles with imperial rolls and it was amazing. The noodles were thick and full of flavor! The service was fast and easy. The interior was clean and spacious. Overall a great experience! 10/10 recommend~", "author": "Angelica P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-16", "description": "Their 5-spice chicken with garlic noodle is the bomb!!! Even the 5-spice chicken pho was delicious. Great option for a rainy day, but their garlic noodle is by far my favorite! Parking is a bit tough, but they also have delivery take-out options if you just need to find a tasty meal for dinner and don't feel like cooking.", "author": "Janice C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-14", "description": "Finally, a nice Vietnamese restaurant just around my neighborhood! I'm a big fan of Vietnamese food, but there aren't many near the place I live. That is, until Laksa opened a few days ago.\n\nThe restaurant is nice, simple, and clean. \n\nThe price point is reasonable and similar to most of the Vietnamese restaurants in the city. \n\nThe portion is very generous. The first time I tried the garlic noodle and five spice chicken. Both were really tasty and could easily be my favorites. Though I plan to try more dishes the next time I'm here. \n\nOverall, I'm excited about this place. I've added it to my own food map and will definitely visit here on a regular basis.", "author": "Angela Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-09-10", "description": "Decent five spice chicken.\n\nPleasant staff.\n\nClean bathroom.", "author": "Inigo M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-10-12", "description": "Average vietnamese food, had a bowl of rare beef pho ad fried spring rolls.  Good service, but unfortunately just average when compared to other Vietnamese restaurants in SF.  There wasn't even any sliced onions in my pho.  Pretty plain jane.\n\nStaff told me they named it after the Vietnamese Coriander leaf called \"laksa\".  After looking it up, that's only part of it's formal name, daun laksa.  In Vietnamese it's called rau răm.  Hope no Malays get offended, there is no authentic laksa on the menu as others have stated.", "author": "Kevin H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-05", "description": "We love Laksa and eat there 1-2 times a week (we both eat there and take out). It's the perfect spot to get good affordable food. The owners are incredibly nice and always greet us with a smile. We've ordered just about everything on the menu and everything is tasty. Laksa is the perfect addition to the neighborhood allowing for a place that is more on the affordable side.", "author": "F J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-19", "description": "This place is Vietnamese, even though the name is Malay, and serves phô and bùn and rice plates.  We wandered in for a late lunch.  It was a hot day, so I got a salted plum soda, and we split the papaya salad with tofu and bùn with grilled shrimp and imperial rolls.  Everything was pretty good.  The imperial rolls were crispy with rice wrappers not egg, and the plum soda properly salty and sweet.   Good solid spot for lunch.", "author": "Nicole B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-10", "description": "I found this place right by my house in noe valley and was seriously a hidden gem. You have to try the 5 spice chicken with the garlic noodles super good the staff is also very nice as well gives me a home welcoming feeling and the music is great.", "author": "Frank L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-06-09", "description": "First I am Vietnamese and I have tasted homemade Viet food and I have ate at a lot of Vietnamese restaurants. \n\nService: The as we entered no one had sat us down. There were only 3-4 people at that time eating. But no waiters. The dish cleaner had to sit us down. Then when the waiters came out, they noticed us and gave us the menu. I noticed that for a Vietnamese restaurant, none of them spoke Viet. They ARE nice but they were slow and also on their phones a majority of the time. \n\nFood: Food was sub-par. Compared to other Vietnamese restaurants, it lacked taste. The garlic noodle was bland. The beef was chewy. The pork was the best out of the food in a bad way. We didn't get the pho but realized it wasn't worth trying. \n\nFind a better place.", "author": "John P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-25", "description": "TL;DR The best pho place in the mission; visited 3 times now since the grand opening. The staff is really responsive and friendly and make you want to come back all the time. Which is easy, given that I love pho and live in the mission and it's the best place that's nearby.\n\nLonger / honest feedback:\n\n1. Their broth is really good. By the end of your meal when the broth is losing heat, you don't see egregious fat separation (which you find in bad pho).\n\n2. Their noodles are really good too. Springy and fresh tasting vs lesser places where it might fall apart quickly.\n\n3. Portion sizes are what you'd expect. I always ask for extra noodles / perhaps extra meat depending on how I'm feeling, and it's probably the same as an \"extra large\" at a lot of places. They don't have an explicit \"large vs normal\" sizing on the menu, so if you're a big eater be sure to ask for extras. Or you can also ask for more after you finish what's in the bowl; service here is great.\n\n4. Their 3-color drink (Chè) is great! Minor nitpick is it'd be easier to drink with a thick boba straw (vs the normal plastic straw they provide) -- alternatively if the ice were crushed to small pieces then I could easily use my spoon to scoop the yummy things at the bottom. I love that every pho place does it a little differently: if you're curious their \"3 colors\" seem to be a white coconut milk + clear jelly + other stuff layer, red bean, and green (mung) bean.\n\n5. I really wish they had a tendon option for their pho. Tendon is one of my favorite parts and they just don't offer it. Which is fine considering they get everything else right, but maybe someday they'll have it! :D", "author": "Sam L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-10-20", "description": "The 2 stars is mostly for the bad customer service. My mother and I came in today around 1pm to have some pho. We walked in and the waitress signaled with a finger and a grunt to a table. The place was fairly empty, with only about 1-2 other customers  and after being ignored for about 20 minutes the waitress came. I tried being as kind as possible and kept our order simple. She wordlessly took our order and went to the back. When she came back (not even a few seconds later after we ordered) I asked if it would be too late to change 1 of the orders to which she rolled her eyes. She came back with our pho, again, without a word just nasty looks. The pho was average, a bit bland but fresh. After we finished, I went to go pay and still decided to leave a tip despite the bad service. She yanked the money out of my hand and tossed it under the desk without looking at me. I thanked her for the meal as I was leaving and she didn't even bother to look our way. Overall, I don't think we'll be returning.", "author": "Rubii N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-05-28", "description": "Had the coconut curry noodles. They were meh. I wouldn't have finished them if I hadn't skipped dinner the evening before. Definitely enjoyed Mau much more.", "author": "Risako O."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-03-20", "description": "A little pho place that opened up closer to 24th is a godsend on rainy nights but unfortunately laksa is just okay. The broth is thin but the noodles are decent and service is excellent. I would come back just for the five spice chicken though which was good. Maybe garlic noodles next time.", "author": "Rohan D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-09", "description": "The look and feel of Laksa is very chic and modern. The customer service is excellent and the owner makes sure every customer is treated equal. The food was great and you can't beat the price. It's a must eat! Enjoy!", "author": "Saea E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-15", "description": "I live around the corner from this spot. Love it! Great addition to the neighborhood for affordable food. I always go for the Pho. But have had other dishes that have also been great.", "author": "Brian S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-23", "description": "We were seated quickly on a Saturday night. Good customer service and the food was delicious. Definitely recommend the imperial roll and chicken garlic noodles. Great size plate and tastes amazing.", "author": "Michelle H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-09", "description": "Been there quite a few times.  The garlic green beans and the char broiled beef with garlic noodles are a must have.  Frankly i would have given 5 stars if not for the fact that when i paid in cash I didn't get my change back, which was like a 25% tip for them.  Tacky.  I will be back and deduct it from my next tip.", "author": "Tony V."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-02-04", "description": "Meat was mostly fat :(\nGood sized portions though and not expensive\n\nUpdate: downing to one star, massive stomachache :(", "author": "B H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-10-28", "description": "I had the combo beef pho plus a side of imperial rolls and it was just ok.  The broth was seasoned just right but all the beef they added (steak, brisket and meatballs) were just too bland -- had to dip them in soy sauce just to have some flavor.  Their pho bowls are huge so I reckon it could be split for 2 people.  The imperial rolls were just average as well but I appreciate the fact that they weren't greasy.", "author": "Janis P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-10", "description": "Order take out via delivery and am always satisfied. Love their garlic noodles, 5 spice chicken, pork and imperial rolls. Always timely and food is delicious.", "author": "Demetri A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-06", "description": "Laksa has been a fantastic addition to the neighborhood. A quick, affordable, and delicious meal with great service. They make you feel like family when you eat in at their restaurant. Favorites are: garlic noodles, imperial rolls, shrimp, thai ice tea.", "author": "Erica B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-20", "description": "After reading the reviews I was excited to receive my delivery for myself and a child I was caring for. As we sat down to eat within 2 minutes our food was cold and I had to reheat it. \n\nThe loft is only 15 minutes away from the restaurant. I don't believe food that was \"hot\" can get cold so easily. \n\nLuckily the child was engaged in an activity that she did not realize I had to reheat it.\n\nI gave the food an extra star because of the flavor and delivery time (45-50 min). Maybe it would of been hotter if we went into the restaurant.", "author": "Kristen S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-10-29", "description": "I tried this place a few months ago when they first opened in my neighborhood. Their garlic noodles were ok, but all the other dishes were greasy and tasteless. We decided to give it another go now, after seeing some positive reviews. It was about 8:30pm on a Sunday night. They are supposed to close at 9:30. We tried calling to order pickup, but they didn't answer. So we walked over there to see maybe they were too busy to answer the phone. They were not busy at all. They had only one or two tables occupied. But they had a sign at the door saying that they closed early because they ran out of ingredients. Seriously? Well at least they could have answered their phone to let us know this so that we would not waste our time. I doubt that I will try going there again.", "author": "J S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-04", "description": "The garlic noods are my favorite. All the noods here are pretty good. I usually order takeout but the crowds in the restaurant aren't too bad.", "author": "Jaden M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-23", "description": "Laksa is my go to in this neighborhood. Fast, friendly service with great flavorful food. Decent pricing for the area. I always get their garlic noodles with beef, and beef fresh spring rolls.", "author": "G S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-09", "description": "I've only had food delivered.  It usually arrives earlier than expected, is fresh, tastes good! Nice portions, reasonable prices!", "author": "Monte C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-04", "description": "New and outstanding! \nMy boyfriend and I stopped by to have lunch and we were satisfied. We ordered the Imperial rolls, and Fresh spring rolls, they both were extremely fresh and delicious. Pork Vermicelli was also succulent and outstanding. The ambiance and the service were great. It was lunch time so there were plenty of parking spot. Definitely I'm coming back!", "author": "Ginna R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-10-01", "description": "I got the beef pho and it wasn't bad but there wasn't anything spectacular about it either. The noodles and broth were alright but the beef was lacking flavor. Aside from that, there wasn't much else there - no diced spring onions, no parsley, no chilli flakes and no slice of lime. There were bean sprouts because I forgot to tell them to not put any in (I hate bean sprouts). All in all, the food wasn't bad for the price and it was served soon after ordering so it gets three stars.", "author": "Adam F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-04", "description": "Love the beef pho soooo much. First time try it, but will next! \nFive-spice chicken is also my favourite. Really really flavorful!\nOverall, love the tasty Vietnamese food!", "author": "Lawrence S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-09-10", "description": "Very average pho. As a pho-natic it's all about the broth. That being said, it was a very salty and not very flavorful. Also real skimpy on meat. Had the beef combo and there was no tripe or tendon.", "author": "Robert P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-07-17", "description": "Ordered delivery via Eat24 from here yesterday.  I really wanted like this place, as pho delivery options in SF are scarce.  Unfortunately, I will have to echo the opinion of the other yelpers.  The pho broth was like water, it had zero depth and I had to dump in all the sauces/condiments just to give this some flavor.", "author": "Clarissa P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-09-04", "description": "Nice place. Good food. Friendly service. I'm slightly confused about the name \"Laksa\" since there's no laksa on the menu", "author": "Robert K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-03", "description": "Ordered beef pho, the soup tasted so good! Out of my expectation!", "author": "S K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-21", "description": "I love this place. The pho vegetarian soup is the best I have ever tasted. They are not stingy with the vegetables like some places and the food just tastes clean. Also a plus that it's so affordable for a decent meal especially in SF. Been here a few times and also ordered online, the staff are great & attentive.", "author": "Maria W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-08-28", "description": "First, the name of the restaurant is misleading. Laksa is one of the national Malaysian/Singaporean soup noodle dish and this restaurant is neither and serves only Vietnamese food.  \n\nMy instinct tells me that whomever opened this restaurant has no idea what the name really means and if he/she was Vietnamese, they would know that Laksa is not even a Vietnamese dish.\n\nSuspicion aside, I decided to give it a try.  Name is afterall just a name.  So, the pho is only OK and may satisfy neighborhood patrons who do not want to travel out of the neighborhood.  But, definitely not a restaurant to go to, if you are a foodie.", "author": "Mit T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-03", "description": "Pho was good and warm, and the broth isn't too salty. The spring rolls are a little noodle heavy and protein light. Prices are good!", "author": "Maureen L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-11-25", "description": "The rating of this place really confused me.. Originally my girlfriend and I went inside to eat in -- but the smell in there was terrible, like wet dog and feet... so my girlfriend and I decided to try taking it to go instead (we were really craving pho). Much to our disappointment, the repugnant smell is in the food too, with no good flavor to boot.. quite unfortunate. I wish it was just bland, but it was worse than that.", "author": "Ian B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-09", "description": "I never though I'd be leaving 5 stars for a Vietnamese restaurant but this place deserves it. Prices are very reasonable and the food was delicious. The portion sizes are perfect. The environment is modern.  I had the garlic noodle with five spice chicken. Will definitely be coming back to try other items.\n\nThis was the second day they they are open.", "author": "Vance K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-10", "description": "We went to Laksa yesterday and it was really a good experience. I ordered veg garlic noodles and they came with a side off silver noodles in bed of veggies. The garlic noodles were really nice as well.", "author": "Rohit N."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-11-08", "description": "I ordered this delivery with postmates, and it was some of the worst pho I have had in a really long time. There was no depth of flavor in the broth and it had an even sour taste that was really unenjoyable. I also love to put chili oil in my pho which they claim to not have. The meet quality also seemed very low. I will say the noodles were fresh and cooked perfectly, but the noodles are the least of my pho concerns.", "author": "Kessa P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-10-09", "description": "I order delivery from here, and repeatedly do so because it's fast, convenient and they open all day (so I don't have to worry about closures btn 3-5pm).  I've tried most items on the menu and it's all okay!  Garlic noodles are probably the most repeated order for us, generally we get it with the chicken.  The pork and beef often times are too charred.  Papaya salad, their take is a finely shredded green papaya and the dressing tastes like a simple fish sauce / sugar mixture. Curry chicken noodles, I find the soup to be too soupy and comes with too little chicken.  Imperial rolls have taro in it, which I like!  I have yet to try the pho, but probably will go to the restaurant for that instead of delivery.", "author": "Ames L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-19", "description": "This is a solid place to get Pho.  There's never been a wait and the tables are clean.  It's a pretty large portion at a fair price even for SF and the service is good.  I've gotten lucky finding street parking nearby.  I've definitely decided to make this my go-to place for pho in the city.", "author": "george c."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-15", "description": "Awesome place!!! Such friendly staff! :) Jenny, the owner is easy going and has a great presence. The food is great too!", "author": "Ryan H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-12", "description": "Total thumbs up.  I had the garlic noodles with pork & imperial roll, and it was delicious.  I also sampled my friend's shrimp w/garlic noodles (yummy) and my husband's bun (not bad).  The noodles were flavorful and not overly greasy like they can be at other places.  And great prices for the neighborhood.  We will be back!", "author": "Melinda C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-14", "description": "Went to Laksa for lunch with my coworkers. Had the five spice chicken with garlic noodles. It was very tasty. Sautéed string bean is good as well. Reasonable price in the area. Service is good.", "author": "Kenny K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-14", "description": "I came here with some friends. We had two orders of garlic noodles and spring rolls . Yummy! They were extremely garlic-y, which I loved, but I would have liked it a little saltier. The beef and chicken were delicious!\n\nOverall, I really enjoyed Laksa.", "author": "Lili L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-17", "description": "wow!  so excited to see this space finally open!  stopped in for lunch and it was great!  a perfect addition to the neighborhood, very reasonable prices, great choice of dishes and the staff is super nice!   had the garlic noodles/five spice chicken and the garlic noodles/shrimp.....both had great flavor!   can't wait to go back!  glad they chose this location!", "author": "Ken B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-09-08", "description": "I really don't get all the hype here. I had the pho and it was the blandest pho broth I've ever had -- virtually flavorless. They didn't give much beef either. The service was fine, everything else was okay -- but man, the pho was BORING.", "author": "Mortimer G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-30", "description": "I've only ordered delivery from them but they won't disappoint. Pretty fast delivery and food is still warm. The pho and spring rolls are my go to. Great service and fast.", "author": "Gia C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-30", "description": "I love this place. The garlic noodles with pork is amazing. I live up the street and have ordered from here about 5 times so far. Every time has been great. This place doesn't try to be fancy or trendy. Just good food at reasonable prices", "author": "Jordan B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-24", "description": "Finally, some decent Vietnamese cuisine in this part of town without Valencia Street pricing.", "author": "Ken C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-22", "description": "The five spice chicken is out of this world.  The beef pho portion was kind of small. I ate here 3 times and the food here hasn't disappointed me once.", "author": "Dennis T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-20", "description": "Gluten free pho! All but two of the pho options are gluten free and celiac safe. Lots of gluten free appetizers. Great service.", "author": "Kelly G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-14", "description": "Delicious garlic noodles, great pork chop, super nice guy behind the counter!", "author": "Nonada R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-06", "description": "A great addition to the neighborhood and very reasonably priced.  The lemongrass pork and beef are both solid.  The garlic noodles could use a bit more oomph (I'm not looking for Perilla levels of garlic, but a bit more would be nice).  I'll be going here for takeout regularly.", "author": "David G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-02-10", "description": "Meatballs in the pho were the best I've ever had but the broth didn't have tons of dimension. Still solid pho though.", "author": "Erin W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-20", "description": "Bomb ass garlic noodles and the service was quick and friendly. Pork chops are hella good!", "author": "Lester I."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-26", "description": "Ordered for take-out. Green beans were deliiicious. Service and processes were clumsy and disorganized.", "author": "Rumana H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-03-05", "description": "Ordered the Pho Ga so you don't have to. The Imperial Roll was good but pass on the Pho Ga", "author": "William J."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-01-31", "description": "So sad this is bad review, as this was my place to go for cheap good food. Unfortunately, and yes I should have written this a few months ago, I decided to stop going there. Reason you ask? Well, I am a dog lover. But the owner, decided to go pet a random dog outside the restaurant, which is fine. She then came back in, and started to put out more non covered with paper  chopsticks on the tables, WITHOUT WASHING HER HANDS. Now that is just plain disgusting. Totally lost my appetite there and then.You ask why did I not say something to her? Well, it is not my job to tell her to ways her hands when handling people's utensils. If she is like that how is the rest of the restaurant. And when we used to go with my bf, they would only remember him, because of his weight, really calling him fat and saying that is why they remember us??? He is not over weight. And then when I went to pick up food (way before not washing of hands incident), from eat 24 and getting mad that, saying they never got the other, but they acknowledge it on the app. So I had to wait another 25 minutes for me food. Which they handed in a rough manner. I let that good, but if you are not clean I am not coming back.", "author": "Sheyla A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-07-31", "description": "Um went is this place called laksa when there isn't a single laksa dish on the menu?! \n\nI was so excited. I come from the land of laksa (Malaysia) and thought finally someone opened a laksa place. This is a Vietnamese pho joint. Nothing wrong with Vietnamese pho. Just don't call there place laksa unless you actually serve laksa.", "author": "Yen P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-20", "description": "Great food - huge pho fan. \nFriendly service - the owners are super sweet and funny. \nVery affordable - great value in an area where there are very few cheap options.", "author": "Chris H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-01-23", "description": "I was excited to see a Vietnamese place open in our neighborhood (although the name \"Laksa\" is misleading).  I like to support neighborhood spots, but unfortunately our meal was not good and we will not be going back.  The pho broth was flavorless and the noddles were overcooked.  We also ordered the side dish of vegetables and it was 90% cabbage with a few carrots and chunks of tofu.  Imperial rolls were meh.  There's much better Vietnamese food in the city.", "author": "Kim M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-19", "description": "I had pho that's a lot less greasy and less sweet than other places, which I like a lot. The egg rolls were also very good especially wrapped with lettuce. I will definitely go back to try their garlic noodles and other food and drinks.", "author": "Jane X."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-18", "description": "Had my dinner at around 6. Not too crowded but people start coming in at 6:30. I had pork chops garlic noodle, imperial rolls, green beans, and thai ice tea. Amazingly delicious. Garlic noodles are not too buttery or oily. The size of the garlic noodles and pork chops are huge. The price is considered cheap compared to other places. I would definitely come back and recommend this place to friends and family.  You should give this place a try if you're around the area. Yumm!!!", "author": "Lan L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-19", "description": "Finally, a neighborhood restaurant with great food, great prices, and friendly staff. The garlic noodles and shrimp are perfection. Pho on a cold day? Yes, please. You get a massive bowl that's filling and yummy, not to mention cheap. We love Laksa!", "author": "Rob R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-11-05", "description": "Worst place ever.  Took 90 minutes to get our food and the Pho was ice cold.  Go someplace else.", "author": "Pamela G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-08-28", "description": "This was good pho but I was a little surprised by the high rating. I thought it was solid but nothing incredible. I got the chicken curry pho and spring rolls, maybe I'll have to try something different next time!", "author": "Rohan S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-07-11", "description": "UPDATED sept 7 i'm so glad I came back. The food was delicious and this time I ate at the restaurant. So glad it's in the neighborhood.", "author": "JEFF B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-12", "description": "i really like this place. fast delivery and the food is good too. the staff is friendly.", "author": "Vicky L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-09-23", "description": "The Pho broth was bland, and lacked animal fat that one ordinarliy finds in broths. The spring rolls were mediocre and contained way to many rice noodles.", "author": "Siren S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-07", "description": "So glad to have great Pho in the neighborhood.  Had the Rare Beef Pho which was fantastic.  The Imperial Rolls were also delicious.  Food was ready quickly and everything was inexpensive by Mission standards.", "author": "brian m."}
