{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-28", "description": "The food itself is a 3.5-4 stars. The service brings it to a 5 star. I am always nervous eating at Mediterranean/Egyptian places knowing that the food can be either good or bad/disappointing. The food was good, but I know there is better elsewhere. The mezze platter was good and could tell the different dips were made there. The pomegranate lemonade was refreshing and nice. The tajine was okay, but reminded me of Hong Kong baked rice with pork and tomatoes hmmmmm. Palmyra on Haight seems to be a similar restaurant with different atmosphere.", "author": "Wesley K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-03", "description": "yo mediterranean at the lounge? LA\nyo mediterranean at the brrr? YA\nyo mediterranean at the club? LY\nyo mediterranean at dinner? ok!\nyo mediterranean SALMON WRAP? de\nyo mediterranean TANTUNI? li\nyo mediterranean KOFTE WRAP? ve\nyo mediterranean hit the spot? ry!", "author": "Dan B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-08", "description": "This is a hidden gem and I considered hiding my review but they earned it. Parking is a bit tricky, but if you drive around a bit you'll find a spot. \n\nThe dining aesthetic is warm and cozy, very welcoming. We dined on a Wednesday night and they weren't slammed so we got very attentive service. I can imagine they get packed on the weekends, as many people stopped in to pick up takeout. \n\nWe started with the Baba Ghanouj which had a perfect smoky eggplant flavor with olive oil and lemon juice layered in. For my entree, I went with the beef kebab and my friends both ordered the lamb having had it before and raved about it. My beef was cooked perfectly and the rice was delicious. We closed up with baklava (of course) and that was also delicious. \n\nNormally I'm a lush at dinner time but they had this amazing lemonade with pomegranate and I could stop asking for refills. \n\nThe service throughout our meal was attentive and courteous. We'll definitely be back to eat at Layaly!", "author": "Bianca B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-04", "description": "We enjoyed our visit during the hot weekend. The waitress was very helpful and our little boys enjoyed the Kofta Sliders. The got the Mezza platter and had lots of good selection. The dinner was nice and we enjoyed our meal. The place is decorated very nice and the service was great. Thank you", "author": "Sid H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-26", "description": "Know what? I've never had a bad meal here. And I've eaten here nearly a half dozen times over the better part of a decade. For consistency alone, I think that's an incredible feat.\n\nNot that consistency is everything. After all--you can be consistently bad right? Layalay, however, is consistently good. Maybe not phenomenal, blow-your-mind, but definitely good. I don't think they're trying to be SF's hottest new spot. On the contrary, this is a cozy, well-kept, and nice little neighborhood spot in Outer Richmond. \n\nLet's talk about a few of those things that are good then. You go with the basics, and you're not going to go wrong. The mezza platter ($15) to begin is a great option. One big platter of tzatztiki, hummus, baba ganoush, shawarma, dolmas, and loads of warm pita. It's an instant win. And, it occurs to me, could either be a meal in itself. Or, this would be a great spot for a first date you're looking to impress. You go in, grab some wine and share this appetizer, chat, fall in love, and come back on your anniversaries. It's a great plan.\n\nMoving on from your fictional first date and back to the reality of the food, I think the Layaly mixed grill plate is as solid of a choice as you're going to find. You get a few different meats (from land and sea) that were grilled, rice, and a salad. No frills, but those herbs infuse the proteins with subtle flavor you won't find elsewhere on the globe. \n\nI recently tried a couple different tagines, and am happy to report they're hearty and well-made. My latest was a sirloin/cream tagine, and it was described as \"sorta like beef strogonaff\" which, on a rainy night, is exactly what you want. Served with rice, it was piping hot, rich, and it left me warmed and stuffed.\n\nI think(?) they changed ownership sometime in the last 6-8 years, but I didn't notice much change besides staff. There used to be a server we fondly referred to as \"Demi\" for her likeness to the actress (Moore, not Lovato) but she disappeared long ago. Happily, the newer staff is just as warm and welcoming.\n\nHonestly, I cherish neighborhood spots like this. It's never crowded, never a scene, but still nice, unique, warm, and just a short walk away.", "author": "Jeffrey S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-03", "description": "Came in on a Wednesday evening and it wasn't too crowded. My friends and I were seated right away. The inside of the restaurant was very nice. It was very dim, but it seemed to lean more on the extravagant side. I ordered the steak wrap, which was very fulfilling. The food and service here is great. My server was very kind.", "author": "Maggie T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-12", "description": "Great food, friendly staff and fair price. Best place to try middle eastern food. Recommend for sure", "author": "Als A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-20", "description": "Braised lamb shank was large and tasty.  Hayduri (the yogurt dip) was also quite good.  The rest of the mezze plate was OK.", "author": "Sarah S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-10", "description": "Premium food. Tabouleh is made a la minute. Very delicious  I had a falafel wrap and feta + olives side. It is so worth to try the place is cozy and Mediterranean style", "author": "Anuta B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-22", "description": "Came here with a few friends and wanted to try something new. This place is clean and welcoming. Ambiance is relaxing. Food is delicious, loved the borek rolls and hummus plater for appetizers and the mix grill kabobs were amazing! Also enjoyed the pomegranate lemonade it was so good! Will definitely recommend to friends and family and we will return for sure!", "author": "RamonaEliza D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-30", "description": "Great service, which is not to be taken for granted in this city. Food was delicious and freshly made. the modest Middle Eastern beer selection was a refreshing change of taste. Highly recommended for dates or group dining", "author": "Joe U."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-18", "description": "Right smack dab across the street from Hard Knox southern food is Layaly.\n\nYelp gives this cute little Mediterranean restaurant four stars ( and it really does deserve it). From the atmosphere, to the wonderful service, and the good food. Layaly is a nice gem.\n\nWe had the mezza platter to start with: Hummus, baba ghanouj, tabouli, falafel,  borek and warm pita. All were very good...but the Borek (Fried filo dough stuffed with feta cheese and parsley) was like Lebanese crack...omg.\n\nFor our mains we had the: Kofte Kebab which was a mixture of ground beef and lamb, onions and fresh herbs. served with rice and vegetables. Really tender and flavorful Kebabs with fluffy light rice. \n\nLamb Kebab Entrée marinated tender cubes of lamb skewered with onions and peppers. served with rice and vegetables. Very tender and sucullent lamb with not too much fat and cooked to perfection.\n\nDajaj chicken sautéed with onions, peppers, mushrooms and garlic in a tomato white wine sauce. served with rice. This Tajine ( think wonderful stew) was intensly arromatic and rich. The mushrooms and chicken were out of this world. Generous portion as well.\n\nWe took home two dishes for two family members that were revolting about dinning out (typical). They had the Falafel Wrap:  falafels with hummus, lettuce, tomatoes, pickles and tahini. This was the best Falafel sandwhich I have every tasted...so yummy and flavorful. They both had french fries with them  seasoned sumac.....they are the best. Crispy fries with that amazing sumac flavor. Only other place I know that does this is in Las vegas.\n\nPrices for dinning out are really reasonable. \n\nService was just fantastic. The wonderful lady that helped us always refilled our water, was super pleasant, and just super cool.\n\nOnly thing I didnt like, and it is petty, was one of the owners just hanging out playing on his cell phone.\n\nI would highly recommend checking this place out/", "author": "David G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-30", "description": "Their falafel wrap and salad are outstanding! Absolutely love the flavor, atmosphere and service.", "author": "A M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-10", "description": "Absolutely delicious. We are from France and love the Mediterranean food. Layaly is the real deal.", "author": "julien b."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-03", "description": "My girlfriends and I came here to celebrate a birthday on a Wed evening. The place was quite empty. But it was good for us because we got almost an undivided attention from the waitress. All the dishes that we ordered were very tasty and the portions were quite generous. We would definitely go back again. Hopefully business would be picked up more. I will hate to see this restaurant closes.\n\nWe ordered the following. \n-Mezza Platter: a good sampler platter of appetizers. Hummus was delicious and the pita bread was served warm. The portion was very generous.\n- Stuffed Eggplant\n- Steak Wrap\n- Dajaj\n- Baklava: not very sweet which was what we like", "author": "Lily L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-29", "description": "Came here for an early dinner and had a great meal! We were seated promptly and had good service for our entire meal. We started with the baba ghanoush which was awesome and came with a hefty basket of warm pita! For our entrees, my boyfriend got the bazinjan and I got the pomegranate chicken. Not only were both dishes tasty, but the portions were huge!! We left the restaurant feeling full and satisfies. Overall, great meal, good service, and I would definitely return!", "author": "Rachel D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-23", "description": "Beautiful, romantic, and lovely!\n\nThis place has the best Mediterranean food. I'd suggest coming here. It's super romantic to take a date or it's just great food to eat any day of the night. \n\nDine in or take out. Whichever you do this place will not disappoint. The appetizers are amazing. I'd suggest if you haven't came here yet to try the appetizer plate. You get an assortment of every appetizer. All of the food is just so great here I can't even describe. \n\nI've had all of the appetizers and a salad. Next time I will definitely order the salmon plate. Honestly you can't go wrong with anything here. The mulled wine was decent but not my favorite though. \n\nLast, the service was great! Our waitress was extremely attentive and ready to help whenever. She was also very friendly as well.\n\nThis is such a nice place I think I'll take my parents here next time they're in town.", "author": "Lori R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-15", "description": "Ordered a Kofte Wrap with fries to go. \n\nWrap was very well balanced and made good left overs as well! \n\nCan't wait to try an eat-in order!", "author": "Wendi A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-07", "description": "Had dinner here tonight with Family. Firstly, have to say that the restaurant is small, but a nice small with \nAn Ambience that was welcoming, comfortable and inviting. Cozy decor. \n\nSecondly, the waitress was very pleasant and attentive. This is what made her so amazing since she seem to be the only one on the floor working. She took our orders, seated others, brought us our food, took care of takeout orders, cleared tables and took care of the check! Talk about multi-tasking. All with a smile. \n\nThe food: \nI had the salmon wrap. It came with a choice of salad or fries. Opted for fries which were really tasty with just a hint of salt. The salmon wrap was delicious too. My niece had the chicken kebab (I sampled it and it was moist and tender and delicately spiced). Brother had shrimp kebab and his wife had the shrimp tajine.  We shared a pistachio ice cream and chocolate cake for dessert. Both were sweet- but just right. \n\nI will be back!", "author": "William Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-17", "description": "Kind of a hole-in-the-wall toward the end of the restaurant row along Clement Street.\n\nThe service is always very helpful and friendly and it is quiet enough to have a conversation.\n\nMy father really likes the lamb shank and the tagine.  He lives about four blocks away and this is one of his \"go to\" choices when I see him.  I usually get the wraps which are \"good but not great.\"  We both like the mezze plate, which is a selection of several different appetizers.  It is big enough (for us) to be lunch for two.\n\nThey have a number of beers from different Middle Eastern countries, none of which are that exciting (think mass produced enough to make it to California).\n\nThere is a completely different menu for Sunday brunch which we do not care for (my father and I) but the owner, Omar, told us that, if we asked, they can make any of the \"normal\" menu items on Sundays.", "author": "Gary A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-08", "description": "The roommate isn't a huge fan of Mediterranean food. So when he's on a diet or working in SJ, I tend to take advantage and order what I want for delivery. Last August 2013, he was on a diet, so I ordered from Layaly via Eat24.\n\n*Mezza platter ($14): hummus, baba ghanouji, tabouli, falafel, borek and haydari, served with pita\n*Spinach salad (no feta) $9: baby spinach, tomatoes, mandarins tossed in a tahini citrus dressing\n*Layala mix grill (one person) $20: kofte, chicken, beef, lamb and shrimp skewers, served with rice and arugula salad\n*Hummus (free with any order of $35 or more, normally $6.50): blend of garbanzo with tahini, lemon juice, olive oil and garlic, served with pita\n\nThe spinach salad was the roommate's pick. Not worth $9 without the feta. They should have made it bigger for us since we didn't want the cheese. Also, it had dried cranberries and olives. These were never mentioned in the description and the roommate hates olives.\n\nThe rest of the dishes were my choices. The mezza platter was a great way to sample a bunch of apps. I love hummus, tabouli and falafel especially, so I really enjoyed this. The mixed grill was the same. I was able to sample all their meats which was great! They were all flavorful and tender.\n\nGlad there's a Mediterranean restaurant with combo plates that deliver. Perfect for my lazy days when I'm on my own!", "author": "Elena N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-08", "description": "Hidden gem of goodness. We started with the assortment of dips and dolmas accompanied by warm bread. Everything was super yummy the Haydari was smooth and oh so good. We shared the Greek salad which was a good size and prepared perfectly. I had the salmon wrap for dinner which was juicy and cooked to perfection with thin fries that were very tasty. My husband had the falafel wrap and declared it to be the best he's had so far.", "author": "Elizabeth S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-20", "description": "Excellent food!  Lentil soup (with a lemon slice on the side to squeeze on top!) was amazing!  Got the sample plate to share and basically licked the plate clean.  \nSaw that they serve brunch on Sundays, which is amazing because hardly anyplace I the outer Richmond serves brunch- excited to try it out!", "author": "Dangerous T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-21", "description": "What a gem of a Greek restaurant! Their Mezzanine platter is huge, delicious, and priced well! That could be your entire meal! We also loved the chicken kebabs, which were spiced perfectly and had a beautiful aroma. Will definitely return!", "author": "Danielle M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-05", "description": "Omg so amazing one of my favorite restaurants  food is to die for !! I love the hummus and pita and lamb with salad and rice", "author": "Makaila L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-06-28", "description": "Just ordered takeout from here.\nFood is pretty good. Baklava portion is small. \n\nBut I nearly broke my tooth on the olive in my Greek salad. They were not pitted ahead of time. \nMy boyfriends wrap is also pretty bland. For $40 it did not measure up.", "author": "Larissa S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-25", "description": "This place has the best food my wife and I have ever had delivered. Ingredients all fresh, price for a steak wrap, pistachio salad ( which was huge, included pita and hummus) and vegetable wrap was very reasonable. It was to much food for two of us. Food was delivered fast. Also got fries with both our wraps. After we finished eating my wife said to make sure to bookmark this place. Guess we have a new favorite delivery. Will probably go to restaurant soon. Love the food.", "author": "David M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-08-23", "description": "I fancy Layaly but the last time I was here was a year ago and things have definitely changed.\n\n1. They are no longer open for lunch which means no more $7 lunch deals.\n2. I ordered my favorite dish - the lamb skewers. THUMBS DOWN. A year ago, their lamb skewers were flavorful and succulent, whereas last night, they were tough and hard. They used to present the skewers on the plate beautifully, while they just place it very lackluster on the plate now.\n3. Staff were nice but seemed unorganized and most orders seemed in disarray.\n\nI'll think twice before I come here again.", "author": "Mabel Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-17", "description": "*Dined in 5/14/16*\n\nI have grown up in the Richmond my whole life, but I don't know when Layal was established there. Even if I knew, it has only been in the past year have I grown to enjoy Mediterranean food. It's been my go-to when I want to eat generally healthy. \n\nIt's the night before Bay to Breakers and the hubby and I didn't want to eat anything to heavy before our race so I Yelp'd around the area and came upon Layal. I recall walking by it a few times, and one time even looking at the menu but always disregarded it. This time, I checked out the photos and it was an easy decision. [Note: This is a good sign because my husband knows I can be indecisive, and then i get hangry.] I called in to ask about the wait time for 2 and the girl who picked up the phone said there wasn't any wait but she'll put her name down since it looked like people were slowly trickling in. We weren't too far away so it worked out. \n\nWhen we arrived, there were a few parties sitting down, with much of the tables open. They sat us down and served us water immediately. On it! We took some time to glance over the menu and started off with the hummus, since everyone on here raved about it :) It was a good thing we ordered an appetizer because the kitchen was kind of slow and they were short a server. Jessica was able to get it done though, so helpful! For our entrees, we ended up ordering the Kofte Kebab (mixture of ground lamb and beef with onions and herbs, served with rice and salad) and the Bazinjan Tajine (sirloin sautéed in a spicy garlic tomato sauce, with eggplant, onions, and bell peppers, served with a side of rice).\n\nThe hummus was excellent! So smooth and creamy with the perfect amount of flavoring. The drizzle of the olive oil on top was the perfect addition. The pita bread was so fresh and soft!! You really can't yourself from eating it. Since we had to wait a bit for our order to come out, I asked for extra bread to pass the time, and again, it came out piping hot!\n\nMy kofte kebab was delicious! When you cut the meat into bite size pieces, it may appear tough or dry, when you eat it, it's tender and juicy. They know how to do it right! I didn't want the rice and asked for extra salad, and they delivered. Half my plate was covered with fresh arugula with a sprinkle of salt. The tzatziki sauce that came with it was BOMB! Yelpers mentioned that as well. The meat was good and flavorful so I didn't really feel the need to dip too much in it. But I typically don't drench things in sauce or dressing, less is more. Hubbs enjoyed his bazinjan, it is a bit on the spicy side but the amount of spice was good enough where you can still savor and enjoy the flavors of the dish. However, to avoid any upset stomachs, we felt that he best not finish it, since he had to run in 12 hours. Lucky for him, he got to help me with my kofte. \n\nAt the end of the meal, Jessica brought us a baklava for dessert since we had to wait for our meal. What a nice gal! It was good, but it might have given me an allergic reaction. I don't have any known allergies but when I got home, I got a little itchy and was getting red dots on my body. Don't know if it was the baklava cause it has pistachios (something I'm used to eating) or the meal itself. Whatever it is, I'm willing to go back and test it out. It's that good!\n\nSo glad I discovered this quiet, cozy, almost hole-in-the-wall restaurant in the neighborhood. Can't wait to try the other items on the menu. Hopefully next time, the service will be a bit faster too.", "author": "Jenny C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-10", "description": "I came here with my fiancé on a Sunday evening after a nice walk. The restaurant had lots of tables available and we could choose where to sit.\n\nWe ordered A LOT of food, but everything was delicious. We had the mezza-platter for appetizer (which is a nice option if you want to try several of the appetizers. Although, it comes with lots of pitta and spreads - like humus -, and only 2 units of the other stuff), the pomegranate chicken (which comes with rice), kafta, and lamb. \n\nEverything was quite delicious, especially the kafta and the lamb (which was so tender you could cut it with a fork!).\n\nIt's a great place to eat, even though it's not the cheapest.", "author": "Andréia S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-07", "description": "The options for Mediterranean food are pretty far and few between in this neighborhood- unless you want to go upscale and splash out some cash at Aziza. \n\nI have dined in Layaly a few times - looks like a great space to host s party- and ordered delivery from them a few more. The salmon is delicious and the appetizer platter delivers all the best Med cuisine faves, from baba ganoush to hummus. Healthy dishes on the menu make it a good go to without the guilt.", "author": "Carole B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-10", "description": "Every time I eat here I feel like I'm being taken on a fabulous trip to the Mediterranean!  \n\nMy favorite dish has to be the Tantouni, which is one of their Tajines.   It is Sirloin sauteed in a white wine cream sauce with onion, bell pepper and mushrooms.  However, I prefer mine without the bell peppers. It's almost like the Mediterranean version of Beef Stroganoff, but over rice.  YUM!\n\nTheir meza platter is another great item to try.  It has a little of every appetizer (Hummus, baba ghanouj, tabouli, falafel, borek and haydari).   And if all else fails, you can't go wrong with kebabs. \n\nThe ambiance is very pleasant, and the staff is very friendly.  As well as they have a nice wine selection.\n\nHowever, if your feeling tired or lazy, you can always just order this great food to you.  They deliver!", "author": "Rose Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-07", "description": "Overall: 8/10 \n\nNice ambience, a bit busy but very nice waiting staff. The server was very attentive and welcoming\n\nWe started off with an appetizer;\n\nFalafel: Firm yet crisp. Spicy and good if eaten with mint leaves. Good for the price (4 for $5)\n\nFor the dinner:\n\nSalmon Wrap: Crunchy wrap with flavorful salmon. Solid and delicious especially for its price.\n\nShrimp Tajine: Very buttery, smooth tomato sauce. Very good if poured on the rice it comes with. Shrimp a bit spicy but good.\n\nShrimp Kabob: Good portion. Does not have a smoky flavor. \n\nChicken Kabob: Flavorful, Smooth and delicious. Mint sauce on side compliments it. Rice was a standout, light yet filling.\n\nAfter we had desserts:\n\nPistachio Ice Cream: Creamy and whole pistachios were nice touch. \n\nChocolate Cake: More mousse and frosting then cake. The only dish that did not live up to our expectations but it did not negatively impact the experience. \n\nMint Tea (forgot the name of it): Clean and refreshing. Good for drinking throughout the meal.\n\nVery good first time experience. The highlight was the waitress. Will go back soon!", "author": "Guilliana J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-21", "description": "YES. SO GOOD. \n\nService is awesome, food is AWESOME. Parking is a freaking nightmare, but if you can snag a spot, it's just delicious.", "author": "Barbara S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-15", "description": "The absolute best restaurant in SF. Period. End of story. \n\nI would come here close to once a week, and I have never eaten something that wasn't amazing. Their hummus is unbelievable (and coming from an Israeli, that's a huge compliment)! Their falafel salad is another great choice as is their salmon and any of their kabobs. \n\nGreat for dinner and lunch, and always wonderful service. We actually ate here so much we become friends with the waitress. (Jessica rules!)\n\nOverall, go here, you won't regret it.", "author": "Simon A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-06", "description": "I love coming here.  The food is really fresh and very tasty.  The owner takes a lot of care to deliver very high quality menu.  I had guests from Jerusalem and they were very happy.  We will go back soon.", "author": "Abraham T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-03-30", "description": "This is a solid Mediterranean place in the Outer Richmond. I came here for dinner with a friend, and I got the chicken kabob entree which came with rice and side arugula salad. The chicken was flavored nicely, but I really enjoyed putting the tzatziki sauce on it. The portions are huge! I recommend getting different entrees and sharing. The hummus with pita is also good here. I don't think I would come here unless I was in the area, but it's definitely a recommendation if you want a good meal in the Outer Richmond.", "author": "Steph V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-01", "description": "Great food and hospitality \nThis is my second time to visit and I fell in love with their Lamb Shank and Bamya (okra).", "author": "Fouad A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-22", "description": "The food here is great, the decor is cozy and the service is good.  We came here for dinner and tried the mixed grill and eggplant Tagine.  Both were well flavored and very tasty.  \n\nThe ambiance is cozy too, it's a small space but does not feel too crowded.  Our server was really sweet too and gave us some baklava because she said she was really busy and did not give us as much attention as she would like.  I was very content with the service.  Definitely a new fave in this neighborhood.", "author": "Samantha S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-26", "description": "Groupon can be such a dicey proposition. You never know if you're being lured to a place everyone hates and getting ensnared in a meal best described as tragic, or you're about to discover a hidden gem that you would have never found on your own. Thank goodness Yelp can help you sift through the weeds to figure out your odds for culinary satisfaction. Jamie W. and I just happened to be in the mood for something new last Friday, and I saw the Groupon for Layaly in my inbox. Since Mediterranean is one of our preferred cuisines in eating healthier, I decided to go for the 57%-off deal where we could share an appetizer and dessert and each of us gets an entree for $29. We got lucky because it was really good food properly executed in a relaxing atmosphere.\n\nBut first we had to take the 38 Geary from its starting point at Main and Howard. We were already a bit apoplectic by the time we got to the Outer Richmond, but fortunately our window-side table was awaiting us. We started with their extremely creamy Hummus with warm, grilled pita wedges (normally $6.50 - see photo). Absolutely no complaints with that modest starter as it was exactly what we wanted before the magilla of entrees - the Layaly Mix Grill for Two (normally $34) - which consisted of a huge platter of kabobs, two scoops of rice and a cup of tzatziki sauce. Kofte (minced lamb), chicken, beef, lamb, and shrimp, all grilled nicely with alternating cherry tomatoes, bell peppers and red onions (see photo). A skewer of each kind for both of us, so we were headed for a carnivorous coma.\n\nAll the meats were tender and moist but with a nice char. Genuinely satisfying. For dessert, we were given the choice of a Pistachio Ice Cream or their house-made Baklava. There was no contest there, and they cut the flaky slab of gooey goodness in half for our respective indulgence (see photo). Service was quite friendly and attentive even as the dining room started to get more crowded. We were happy to receive the Groupon discount, but their more important goal was achieved. We plan on making a return visit sometime and paying the regular prices for their food. Sure, there are lots of Mediterranean places closer to home, but hey, the after-dinner stroll down Clement was nice and leisurely.\n\nFOOD - 4 stars...nothing that creative here, but they can certainly know how to make hummus and kabobs\nAMBIANCE -3.5 stars...just a nice neighborhood spot with few frills but enough ethnic flavor to make you aware you're not at a Subway\nSERVICE - 4 stars...thoughtful and handled our Groupon with grace\nTOTAL - 4 stars...far-flung Mediterranean for sure, but take a Valium for your ride on the 38 and you'll be just fine", "author": "Ed U."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-15", "description": "This place was pretty good! Didn't blow my mind (YET), but really glad to have it in the hood. I think I just have to eat more of the menu items, is all! \n\nThe hummus was very creamy and flavorful. My kebab was great. Now I have to try everything else!", "author": "Nami S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-03", "description": "Only 4 this time since while I am happy they are getting more business, I think their kitchen is too busy.  Should hire more people.\n\nFriendly wait staff, though.", "author": "Ai S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-08", "description": "Every time I'm craving a falafel wrap and some hummus, this is my go-to.\n\nLively music, low lighting and tasteful decor make this restaurant as pleasing to the eyes and ears as its food is to the tongue.\n\nFriendly servers and hostesses, and impeccable food. Parking is a hassle but it's worth it!", "author": "Morgan B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-12", "description": "I cannot believe Layaly ever existed!!! Thank God I finally discovered it! We ordered the mezza platter, feta cheese with olives, mixed grill and eggplant sandwich with fries. A big order but wow was it great! The food was delivered earlier than expected and very warm.  I strongly suggest to everyone on Yelp to eat at Layaly; you will not be dissapointed!", "author": "Noor S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-30", "description": "Great food here on Clement. Love the Greek salad, kofte kebab (lamb, beef and spice mix), and mezze platter. Service is friendly but slow, as they're usually inundated with to go orders and have only one server. This is why I give it 4 stars and not 5.\n\nOnly 15 tables or so. Great gem. Treat yourself. :)", "author": "Bing B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-04-23", "description": "Not worth the $. Food was lukewarm and fries were actually soggy and cold. The sad part is I placed an order for pickup, they had me wait because it wasn't ready and it was STILL cold based on a 3min walk home. I got the kofta kebab wrap, meat was ok flavored but the bread was too thin and crispy. Also got the chicken kebab dinner- for $15.00 I expect more food and flavored rice. Instead I got a small arugula salad with too much salad dressing, and a scoop of plain rice with some chicken skewers. \nI paid $28 for the whole meal but it should have been no more than $15 for what I got. Not going back!", "author": "S K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-01-02", "description": "Ordered from this place once before and they got my order wrong.  On top of that what I did get was so bitter and salty it was not edible.  Thought I would give them another try with something else and same thing, it tastes like they spilled salt in the food.  So salty it's not edible.  Won't be eating here again.", "author": "Shyam B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-09", "description": "Layaly is EVERYTHING you would expect from a neighborhood restaurant: Quaint, Delicious Food and Friendly Service!\n\nMy friends started off our Sunday with dim sim and went onto munch on silvanas (Filipino macarons) and sip on red velvet lattes. Being fatasses, we decide to end with dinner at Layaly because my friend had a Scoutmob - 50% off up to $15 deal. \n\nBe forewarned that parking in the area is a complete nightmare. There is a parking lot a block away for $6/hour. \n\nOn Sunday 9.4.11, my friend and I came in a little after 6 PM and Layaly was empty except for one couple. We were seated promptly (without reservations) while we waited for two of other friends to arrive.\n\nF O O D\n*MEZZA PLATTER: w/ Hummus, Baba Ghanouj, Haydari, Tabouli, Falafel and Borek ($15) - 4 STARS\nhttp://www.yelp.com/biz_photos/9KeTKDuHdLMhRFku0HAIxw?select=l-aiPHAOl0jH77o_FAB4zw\nWe liked and devoured everything on the platter except the tabouli (parsley salad). The hummus and haydari (yogurt sauce) was amazingly rich and creamy. The baba ghanouj (mashed eggplant) was smooth yet still had some texture to it. The falafel had a nice crunchy exterior with a soft center and the borek (fillo stuffed with feta) was like a savory cheese egg roll. \n\nIt was served with warm pita bread which was perfect for sopping up all the yummy hummus, haydari and baba ghanouj.\n\n*LAYALY MIXED GRILL w/ Kofte, Chicken, Beef, Lamb, and Shrimp ($34 for 2 people) - 4 STARS\nhttp://www.yelp.com/biz_photos/9KeTKDuHdLMhRFku0HAIxw?select=xiCzw2TLqT2ga_WNAQreGQ\nEverything on the plate was packed with flavor and deliciously mouth-watering. The kofte (beef and lamb) was rich and juicy with a subtle gaminess. The beef and lamb were tender and filled with garlicky spices. The shrimp was nicely tender. The chicken, being white pieces was surprisingly very tender and moist. The accompanying yogurt sauce help cut through some of the richness while adding a tangy creaminess. I absolutely loved the rice pilaf as it had great texture and flavor. \n\nPortion sizes were very generous and the Layaly Mixed Grill could easily feed 3 people. \n\nS E R V I C E\nOur waitress was very approachable and friendly but spread thin because she was the only one in the front of the house. In the beginning, she was attentive but as it got busy, it was hard for her to keep up. They really need to hire additional help especially during peak hours on the weekends. Nonetheless, she did a great job making sure we were ok and that our water glasses were filled.\n\nMy only gripe is our entrees took a while to arrive. \n\nA M B I A N C E / D E C O R\nCasual, yet very warm and cozy. The mellow yellow walls and the red wooden furnishings created a very welcoming and charming feel to Layaly. There's also a back patio for hookah. \n\nP A R K I N G\nAs previously stated, street parking in the area is a NIGHTMARE. Your best bet is looking for parking a block away on California. There is a parking lot a block away for $6/hour.\n\nWith the Scoutmob deal, we each paid $21 (including tax and gratuity) which was very affordable. They even have $7 lunch specials offered every day. \n\nOther Note(s):\nWe noticed A LOT of people coming into Layaly wanting to do hookah but they didn't offer it on the Sunday we were there, so I highly recommend calling ahead of time to make sure it's being offered that night. \n\nDid you know that Mediterranean food is THE healthiest ethnic cuisine according to CNN? There goes another reason to check out Layaly. Sorry, spanakopita does NOT count.", "author": "Cherylynn N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-29", "description": "Great food. Always great service. I've had almost everything on the menu and I have been so happy with each meal. They have a $7 wine glass special and sometimes they have belly dancers come during dinner.", "author": "Nikki M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-12", "description": "Delightful food and plentiful. For a couple from Brooklyn, where good Middle Eastern fare is a given, we were surprised and pleased with every bite. The felafel with feta inside was surprise, and the lentil soup was an excellent antidote to the chilly winds blowing outside. This unpretentious restaurant is airy and the woman who served us couldn't have been more friendly. I'd go back, for sure.", "author": "daniel w."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-19", "description": "Good food and good service!!!\n\nWe enjoy this neighborhood restaurant.  It has the best waitresses and manager Jessica - knowledgeable, polite, professional, and efficient.  They know the menu in the back of their head.  We eat in or do take-outs twice monthly.  We like the hummus, dolma, salmon wrap, steak wrap, tarjines especially the sabanihk, salmon dinner, and lamb shank dinner.  They have recently raised the prices ($1-$3) and took out the sabanikh tarjine.", "author": "G D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-23", "description": "Deeeeelicious! Arrived super fast, food was fresh and very tasty. Falafel was not overly greasy, hummus was fresh, pita was fluffy, and flavors were on point. Will definitely order again. Only downside: a little pricey for takeout.", "author": "Kelly B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-14", "description": "2nd visit. Just as good. This is now a destination place for hubby & I.  Yelp wants me to say more (word count) or they won't post this review. Hopefully I've typed enough now.", "author": "Kim G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-30", "description": "I order from here at least once a week. They have great selection of food for great prices and now they deliver  ALCOHOL! I mean what more can you ask for? Great food with wine and beer delivered to your door steps. Highly recommend their tajiens and mixed grill.", "author": "Yazan Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-23", "description": "We came here for our anniversary dinner. We had reservations at Aziza, but left because we didnt like their overpriced menu and small selection and how we were seated and treated. So we ordered Mezza platter and Layaly Mix Grill. All were delicious. Would highly recommend.", "author": "Veronica F."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-05-08", "description": "Found this place after a long workday, had a great meal with the chicken kebab dinner. Next time ordered takeout brought it home and my daughter loved the chicken. Had been our favorite place for almost a year. The last four or five times (we ordered delivery) we noticed a change in their chicken. The plate comes with 4 skewers arugula salad and rice. Yummy, until some of the chicken pieces were not chewable. First time I thought maybe a mistake, second time I'm wondering why the change. By the fourth or fifth time my daughter no longer liked it, I was just annoyed by it. Unfortunately we will not be eating their food anymore there was a time when this was our favorite place.", "author": "Jonathan P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-10-23", "description": "Ordered delivery from here, it arrived cold and my steak wasn't cooked enough I had asked for medium to well done as a result I didn't have the steak so just had rice and salad. Was disappointed. My partner had the chicken and it was lovely.", "author": "Sinead M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-15", "description": "First and foremost an excellent restaurant serves excellent food. This place not only meets this expectation but surpasses it with comfortable seating, relaxing ambience and gentle music to make you feel somewhere far away in the Mediterranean.", "author": "Omran I."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-14", "description": "I was initially lured here by an online deal and was very happy to discover one of my favorite places for Mediterranean food in the city.\n\nI wanted to be able to try a healthy variety of their offerings to fully determine which of their dishes I might later come back to try again and everything was SO good that the MEZZA PLATTER and LAYALY MIXED GRILL PLATE ended up being my go-to for every follow up visit. Everything was well seasoned and the meats were tender and juicy. I always ask for extra yogurt sauce because I am ADDICTED to that stuff. I could use it as a dip for everything.\n\nI still recall how the first time I went, 3 of us dove into our meal completely famished and we still weren't able to finish everything because though everything was good, the portions were also extremely generous. \n\nI wish they were closer, because I would definitely make this my go-to when I start counting calories and choosing protein over carb again in a few days.", "author": "Asha S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-12-20", "description": "I order only through grub hub. They used to be great, the food was always prompt, and hot. We live about 15 blocks from Layaly, and lately we've been experiencing 2 hour waits for simple chicken wraps. They consistently over promise and under deliver on their wait times. Today, I waited 1 hour and 45 minutes, ( 25 minutes past when they said they would deliver ) and the food arrived cold. Like really cold. For $40 I got cold food and an almost 2 hour wait. I've been patient because I like their food, but now the food quality appears to be suffering as well. \n\nI complained to grub hub and got $5 off my next meal. Lame. Probably won't be ordering from here again.", "author": "cherie g."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-12-02", "description": "Have wanted to eat here for a long time. I am usually in the area only at lunchtime when they are closed. So met a friend for dinner last night. The Meza Platter appetizer was worthy. The salmon and stuffed eggplant entrees were average and seemed to have little if any Mediterranean nuance. The most noteworthy aspect of this experience was that the temperature inside was only slightly warmer than the 50-55 degree F outside. The few customers in there were wearing big coats and hats. The waitress was in a hoodie. When asked about the temperature she indifferently remarked that the restaurant did not have a heater. When probed further, she pointed to a small portable space heater elsewhere in the room next to a table with the only other customers. Should have walked out right then. Ordered and stayed but really regret it. Really tacky.", "author": "Noel S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-08-01", "description": "Maybe i got them on a bad day? But man, the hummus was way off as was the babaganoush.  Not sire if I will try again, seems like two dishes they should be able to get right.", "author": "Rex L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-01-31", "description": "Gf got the Chicken Wraps was great price $12,  good amount of fries(good seasoning) decent sized sandwich. I got the tabbouleh... I wanted something light,  $7 it was nothing but parsley, and very faint amount of Bulgur wheat... OK,  everyone does tabbouleh a little different,  but I got it in a pint container that was 3/4 of the way full... So basically a cup of chopped (well seasoned)  parsley for $7...guess you have to make up some food cost somewhere... Won't be getting that again.", "author": "Nicholas P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-22", "description": "I really like Layaly. I've been there for brunch, take-out, and dinner. I enjoy their shakshuka and turkish coffee. Service was very warm and kind.", "author": "Ryan Y."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-10-15", "description": "Ordered from GrubHub at 8:45 tonight and was told the food would be ready between 10:15 and 10:25. A long time to wait but with a long night of work ahead it seemed worth it to have something reasonably healthy. \n\nI get an e-mail at 10:05 that Anton is on his way with my food. Awesome. I only live 11 blocks away. \n\n45 minutes go by and there is no sign of Anton. I get in touch with GrubHub and find out that my food was delivered to the wrong place. Super confusing since neither my doorbell nor my phone rang. My apartment is also easy to find and I've never had any issues with delivery in the past. And really, who accepts food they didn't order? This guy didn't even bother to get in touch with me when the recipients seemed confused? I'm sure you can just chalk it up to laziness at the end of the shift. \n\nNow I'm deliriously hungry, have wasted so much time and energy, and still have a ton of work left to do on an empty stomach. To top it all off it's too late to order from anywhere else. \n\nThanks for ruining my night.", "author": "Caitlin N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-05", "description": "After reading some reviews, I was reluctant to dine here.. But I'm glad I did because my veggie kabob was delicious!  I don't even like mushrooms, but the ones they grilled had a nice, meaty texture.\n\nService was friendly and, at least the time I dined here, atmosphere was calm and quiet.  The prices are reasonable too.", "author": "Vira P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-13", "description": "This is one of my favorite restaurants in the city. I've eaten here, or delivery from here, many times and have been consistently delighted. Their babaganouj, stuffed eggplant, and mixed kabob are all very yummy! \n\nMaybe the best part of the dining experience at Layaly is their perfect napkin hats. Go ahead, you can wear the hat. I did. \n\nI am sad that according to some reviews they have not always provided the best service. I've personally never experienced any off-putting behavior from the staff.\n\nAnyway, I haven't written many Yelp reviews, but I thought I'd write one for Layaly after being so happy with them :D", "author": "Rae B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-08", "description": "This is the second time I have been here. And last Friday was with 3 friends and my bf and we all had wonderful meal! I ordered chicken wrap with salad on side and the the first time I was here I ordered the lamb chops. \nEveryone ordered different things and had a great experiences.\nThe service is great, the price is reasonable and the place is super clean!! \nWe are going to go back and all my friends are raving about it!!", "author": "Ty N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-15", "description": "I love it when online deals stretch my boundaries and bring me all the way to Outer Richmond - I hardly come out this way but I know the restaurants out here are yum too!  \n\nWe had:\n\n* Mezza Platter (Hummus, Baba Ghanouj, Haydari, Tabouli, Falafel and Borek with lots of grilled pita to pile on your mezza - mmm, it was hard not to totally devour everything and it was a lot! My fave was the falafel, baba ghnaouj and borek)\n* Layaly Mixed Grill Plate (Kofte, Chicken, Beef, Lamb, Shrimp, Zucchini and rice - this was a generous grill plate, I was rather full from the mezza platter, but I enjoyed the chicken and zucchini very much, flavorful, tender, filling, it is going to be good as leftovers tonight too)\n*  Baklava (sweet, crispy, I could only have a bite because I was so full, but will enjoy it as leftovers tonight as well)\n*  Glass of Zinfandel from Lodi (nice combination with my meal)\n\nOur waitress was super friendly and she took the time to explain everything on the menu, the origins of the dishes, the pricing on our receipt after the online deal was calculated.  Really really lovely dining experience all around.  I would definitely be back.  Nice find!", "author": "Maile N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-25", "description": "Layaly is my favorite spot in the Richmond. My biggest problem when I come here is its hard to decide what to get. Every one of the appetizers sounds delicious, but my favorites are the borek (filo dough with feta and a yummy dipping sauce) and dolmas. I love the pomegranate chicken tajine, unique sweet flavor, and I think the kofte kebab is my favorite entre (it's a combination of beef and lamb). Their wine selection is great and they always have a house wine for $5. They also have wraps which look really good! It's a great place to have a date night :)", "author": "Kylie B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-23", "description": "// O C C A S I O N\nMe and my boyfriend went on a Tuesday evening, the place was pretty empty and it was our first time, but we weren't disappointed!\n\n// F O O D:\n- Hummus appetizer comes with an ample amount and pita, good for two. The pita is toasted well, soft on the inside and slightly crispy on the outside. Be careful, their olive isn't pitted!\n- We ordered the lamb kebob, and the bazinjan tajines. The lamb is succulent and mint sauce goes nicely. If you like the sweet-garlic taste and eggplant, definitely try the latter!\n\n// S E R V I C E:\n- There was only two other tables taken during our visit. And one waitress. The food took a little longer than liked but she was lovely, and was worth the wait!\n\n// O T H E R:\n- Clean, classy environment! \n- Simple and cute presentation of food.\n*Check to see if the ScoutMob 50% offer is still available iPhone users!", "author": "Steffie H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-29", "description": "Ordered delivery and everything was fantastic. Quick delivery time and everything was fresh and tasted great. The falafel wrap and lentil soup were both were so good I wanted more. Although a bit pricier than other locations, the quality shows. I was so tired of getting mediocre Mediterranean, Layaly was a nice change! Good stuff.", "author": "Nathan L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-31", "description": "Best mezza platter I've ever had. You really have to love how soft the pita is, first of all. It's a perfect complement to each of the \"dips\" on the platter. The hummus is amazingly creamy. The haydari is perfect - like a yogurt/cheese hybrid. The baba ganouj was delicious and a little smoky in flavor. Tabouli served as a nice garnish but was a little too tart to eat on its own.\nAs for the entrees, I would suggest trying the mix grill. The steak and the lamb were a little tough to eat but all the meats (shrimp, lamb, shicken, steak, kofte) were well seasoned. The arugula salad on the side was really tart but we cooled that down with the leftover haydari.\nThe braised lamb shank could have been a little less bland but it could not have been tenderer. Unfortunately, the couscous that comes with it was dry, so dry. You really have to combine the grain with the meat juice to make it edible. \nThe baklava at the end of the meal was definitely good, but a little too over-honeyed for my taste. Still crispy and exactly what I'd expect, though.\nGood service for the first half of the meal anyway (when it's not busy).", "author": "Ruobin W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-09-30", "description": "Ordered delivery from there the first time the other day. Food came fast enough and it was mediocre. The most disappointing thing was after stressing I have a severe dairy allergy numerous times, one of the dish was smothered with cheese and the salad came with ranch dressing. Of course that went right into the garbage. I'll just assume whoever got my order was in a bad mood and wanted diarrhea to befall upon me all night and not because they didn't know what dairy means... \n\nNot ordering from there again.", "author": "Aubrey Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-26", "description": "Bravo! This is by far the best Med food I've been able to find in SF. The lamb kebabs had me falling on the floor. So so good. and this was delivered! I'm totally making the effort to eat here in person very soon!", "author": "Peter R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-20", "description": "This is seriously the best middle Eastern food I have ever had. Everything I've ordered is amazing, especially the stuffed falafel salad.", "author": "John F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-04", "description": "I'm not usually a huge fan of Mediterranean/Greek food. It can get kind of bland in my opinion. Layaly has turned me into a believer! After a late lunch here, I have bookmarked it for the future cravings I'm sure to have. \n\nThe Mezza Platter was a good amount of food and came with a heaping pile of toasty warm pita points. The Kofte Wrap was also above par thanks to a thin pita wrap that was grilled to provide a nice crunch. The side of fries were cripsy and seasoned to perfection. Opa!", "author": "Rachel Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-19", "description": "Ate here for the second time yesterday with my coworker.\nA dazzling lady with perfectly painted on eyeliner takes our order.\nA bathroom in Inner Richmond that isn't the pits. \n\nAffordable wraps with full flavor and the perfect sauce. I'm picky as hell, \"extra this, put this on the side, oh and x, y, z\"\n\nThe lady nailed it, my coworker not so much but who even cares about him (haha) mine was astonishingly delicious and a good deal, making it even better.\n\nOur order took a while and there were only a few people in there so make sure to only come during off hours for the best service. (I've never done grubHub, so sounds like you'll have to get off your bottom and just walk over.)", "author": "Alice .."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-03-27", "description": "We love middle eastern food but haven't yet found anywhere in SF that has \"scratched that itch\". We had really high hopes for this place having travelled there specifically. I'm afraid it disappointed a little. Service started off well & became slow, they forgot our appetizer & brought entres after a long wait, they then basically told us we had 15mins to eat our appetizers. It was fairly stressful dining in the end to be frank. On the plus side the food was pretty good & in generous portions, though the hummus was a little creamy for our tastes. We ended up boxing much of it up (aware that we were getting evicted at 9pm!) & took a baclava to share at home, but unfortunately it was minuscule.", "author": "Fi M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-29", "description": "Had a dine-in experience here and it was great food! No wait for a seat either in the evening. I normally get kabobs when ordering Mediterranean food. Although our meal did include the mixed grill kabobs, that turned out not to be the highlight of the meal. Deciding to try something new, we went with a couple of tajines (clay pot) and they come with a side of rice. And it turned out to be a nice surprise. Here's the lowdown:\n\nDajaj tajine (Chicken, onion and mushroom in a tomato broth) - Delicious and best dish of night\nTantouni tajine (Beef in a creamy white sauce) - Great flavor and beef was really tender. Second best dish of night\nBazinjan tajine (Beef and eggplant in spicy tomato sauce) - A little spicy but good. Beef was also very tender\nMixed Grill (Beef, chicken, shrimp, lamb) - Didn't get much lamb in this entree and meat was a bit charred. Yogurt dipping  sauce was good. Ok dish.\n\nGood experience and would love to come back to try more of the tajines...", "author": "Ali F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-23", "description": "I've been to my share of mediterranean restaurants in the bay area, and this one is top notch. Very few places in the city compare! \n\nFrom the housemade tea, hummus, and tabouli, to the warm and scrumptious wraps, I highly recommend Layaly. They have great delivery service as well.", "author": "Kathryn D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-11-16", "description": "I got this delivered. I pondered the whole time if I should order a Diet Coke with it and then eventually went with no. If I would have ordered the Diet Coke, it would have been the best part of the meal, hands down.\n\nThe lentil soup was decent, but I wouldn't order it again. The falafel and borek were equally chewy and tasteless. I was so excited for the chicken wrap, and it tasted like something I'd order at an airport kiosk. The chicken was dry and the tzatziki sauce was watery and gross. \n\nThere was a house salad and that was good. Too bad it was only one corner of my plate.\n\nEw.", "author": "Sam D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-01-11", "description": "Extremely disappointing. Overpriced. Lied to me about the amount of food we were getting. Extremely rude girl on the phone when I called back to ask why my order seemed smaller than it was. With all the amazing places to eat in this neighborhood, why do I have to settle for poor communication, rude staff, small portions and exorbitant prices? \n\nNever eating here again.", "author": "Susie C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-11", "description": "We love the mezza platter here. The usual suspects (tabbouleh, hummus, tsatziki, baba ghanoush, falafel) plus these egg roll type things that seem a little out of place, but are fried and crispy so I'll take them.\n\nWe've had some hiccups with delivery, but they are usually fast and efficient.", "author": "Alex L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-21", "description": "We stopped by Layaly a couple days ago and were really impressed with the awesome Mediterranean cuisine they are cooking here. \n\nMy boyfriend and I started with the hummus and pita appetizer, which was really filling and delicious. The pita is warm, and the hummus creamy- just how I like it!\n\nMy boyfriend ordered the Beyti for his entree, and though I didn't get to try it he said that it was really yummy. The way that it is cut makes it almost look like an appetizer, so perhaps if you want to eat something lighter this is a good option. \n\nI ordered the pomegranate chicken tagine. I'm grateful that the waitress gave me a heads up about this dish - the sauce it is cooked in is a pomegranate molasses, which is very tart. Once you know this, it's easier to taste the nuanced flavors of the tart sauce, savory chicken and onion, and earthy mushrooms over rice. A dollop of tzatziki rounds out the flavors as well. The portion was big enough that I had leftovers to take home.\n\nThe waitress was truly kind and wonderful, especially because we came in 30 minutes before closing. We will definitely come back to try more of the yummy Mediterranean dishes at Layaly!", "author": "Liz G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-03", "description": "Decided to go to here for dinner with the fam.  The service was great.  We ordered the combonation kabob plate and eggplant tangine.  Both were delicious and very flavorful.  The server mentioned they were going to serve brunch soon so looking forward to trying their food again.", "author": "Mariam A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-02-23", "description": "I can't comment on the quality of the food, but I can comment on the quality of the SERVICE ... VERY BAD ....\n\nI ordered food at 6:19 pm.  I know this because I ordered online through GrubHub.com (a product I've used successfully, without incident for years).  When the order was processed, I was notified via text & email (at 6:20pm) that my order would be delivered to me between 7:30-7:40pm.  \n\nAt 8:20pm, my order had NOT BEEN DELIVERED.  I decided to cancel my order because Layaly had failed to deliver on the small, typical 1 person meal I ordered.  #COMPLETE_FAIL  (There were no special changes to the order. This was a standard 1 person order off their menu (1 dinner, 1 lentil soup, 1 hummus)).\n\nSo, 2 hours after ordering I have NO FOOD and will now eat something crappy for dinner.  #VERY_DISAPPOINTED #TOTALLY_SCREWED_UP_EVENING\n\nGrubHub, at 8:59pm, was able to confirm that after 30+ minutes of trying to contact the restaurant, they were able to CANCEL my order.  Now, 6 minutes after my order has been officially cancelled (and 2 hours and 47 minutes after I clicked the order button), I am posting to the Internet that Layaly's service was VERY BELOW AVERAGE tonight.", "author": "M S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-10", "description": "We love Layaly. Freshly cooked and tasty food, the lamb and Kofte dishes are amazing.", "author": "Kate M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-02", "description": "YUM!\n\nI LOVE that there is Kibbeh on the menu.  These were delicious but could have been a bit crispier.  However, not many places have KIbbeh and it is one of my favorite dishes. \n\nI also got chicken kabobs which were good. Chicken was well cooked and flavorful.  Rice was as well.  I didn't care for the salad served with both dishes. \n\nNest time I am in the neighborhood I will be back.", "author": "Katharine A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-10-21", "description": "We ordered Babaganoush, Hummus and a vegetarian Tajine. All three were okay and well presented but they were missing a certain Je ne sais quois. It was edible but left no impression on me.\n\n The service was friendly and the place was pretty clean. It's the first place I've seen that charges for extra pitas.", "author": "Ravi C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-23", "description": "Not bad for a dinner break food joint, it was intense. I never had food so good and so price worthy.  The food was really real meaning I actually felt like I was in some kind of Mediterranean city eating the food. It sure beats all the Chinese Islamic food in my town. Come here early to eat otherwise you would be waiting your head off. Aside from other parts of SF which have the super elite food this is a good alternative.", "author": "Michael W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-09-07", "description": "Rice has orzo in it and they have no gluten free rice options. \n\nAppetizers were bland and dry. Kofta Kabob was good enough- only because it had a char flavor and enough salt\n\nCucumber slices were good. \n\nService was feisty and rude.\n\nThis place should be 3.5 stars (or less) not 4.", "author": "S...... p."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-07", "description": "This place has great food, great ambiance, and great service.\nI neglected to get the name of our server when my boyfriend and I went in for dinner the other night but she was so attentive, nice, and accommodating that it really just made the night go that much more smoothly. \nWe had gone in with a Groupon deal and the server was very nice about it and didn't give us attitude about it like I've heard other restaurants and their servers would. She clearly stated what the deal included and was humble enough at the end to offer to change the standard 18% tip that was usually included with it. I declined.\nBut about our food.. birthday boy ordered the mixed grill, I got the braised lamb shank, and we had the hummus with steak to start. I have to say, that hummus was the best I've ever had. The lemon that they added in it really offset the fatty meaty steak perfectly. That plus fresh soft pita, is heaven. Boyfriend's dish was good; he kept expecting it to be dry and overcooked, because it looked it, but it wasn't. Everything was done right. Same goes for my lamb. It fell right off the bone into the scrumptious broth that I kept ladling over the accompanying fluffy couscous. YUM+ME! :P\nI also have to add that we weren't feeling very well (but I had to take him out for dinner on his special day!) but we both ate a lot. That's saying something.\nBottom line: This wasn't our first time there and it will definitely not be our last.", "author": "Karen C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-17", "description": "Got take out from here for the first time. Owner was very friendly. The kabobs were excellent especially the chicken and shrimp.\n\nOnly drawback was that the hummus was a little bland. \n\nThe yogurt dip with dill, etc will make me come back for more.", "author": "Igor K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-01-29", "description": "The food was alright.  Dinner entrees are pricey for what you get.  The lamb kabob was really tough and chewy; sea bass tasted frozen and dry even under layers of too much sauce.  Love their mint tea and crab cake appetizer tho.\n\n**Please read the fine print before purchasing a Groupon for this place.  Tax and tip are NOT included.  They automatically charge you 18% gratuity, but service was good, so I didn't argue with that.  \n\nThe only thing that felt weird for us was that they charge you tax based on the pre-discounted amount.  So instead of charging tax on the $32 I paid to Groupon, they charge tax on the total $54 of what the food was worth on their menu.  (If I buy a pair of jeans onsale for $20, do I pay tax for $20 or the original $60?)  Overall you end up paying close to $50 for the Groupon deal, depending on what you order - which isn't much of a bargain.  \n\nI'll stick with their regular menu next time.  Their stewed dishes (not included with Groupon) are way better anyway.", "author": "Kris L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-11-24", "description": "First 15 minutes we just sit on the table remaining looking around. Next 15 minutes waiter talked to us and got our order. Next 45 minutes, we waited for out food. Mixed grill for two and an appetizer. I bet it would taste good if they did not burn it. It literally was like a charcoal. It was a big disappointment. Never again", "author": "Hasan Y."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-10-07", "description": "Food was OK, service was not.\n\nI went here last Saturday with a friend, drawn in by the good Yelp reviews. The waitress was friendly enough, but completely messed up our order--blamed me for the mixup--and almost gave our lentil soup to another table (which might have been understandable, if there were more than two tables.)\n\nWe ordered a lentil soup, one chicken wrap with no tomatoes, and one falafel wrap. After 15 minutes we got the soup (barely!) and after another 20 minutes, we got two falafel wraps. I was so hungry that I just ate it anyway.\n\nThe wraps were OK, but nothing out of the ordinary. Certainly not worth waiting almost 40 minutes. You'd do better at a hole in the wall shawarma joint.\n\nThe waitress was nice enough to give us complimentary baklava for the mixup, but I won't be coming here again.", "author": "Aaron E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-04", "description": "I'm reviewing Layaly for their Groupon, since I've purchased it three times now!! \n\nThis place is great, and I would pay full price any time. They're right by my house, so my partner and I go here for a great date night. We always come home happy and full, with dessert in hand to enjoy later. \n\nWhen I've come here, I never need to make a reservation, but I could see them getting filled up on the weekends. I always get the Mezza platter, which comes with dolmas, falafel, yogurt dip, pita, eggplant spread, and fried cheese triangles. Half the things on the plate, we both can't eat, so we usually just bring it home for friends, but we love ordering it anyway. The food is always prepared fresh, and never seems frozen...waitstaff is amazingly kind, and very attentive. \n\nMains for us are usually lamb and grilled salmon over rice. Always steaming hot, and aromatic. I love that the veggies served with it are well-seasoned, and only JUST cooked.\n\nPrices are really reasonable, and the groupon comes with dessert (baklava) that you won't even be hungry enough to eat! The wine list is pretty expansive, and they do takeout/delivery if you're not up for leaving home to get delicious food. \n\nCome on a Friday or Saturday to see their beautiful belly dancer! She's very sweet. :3", "author": "Charlene S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-06-16", "description": "Had lunch here after a few hours of plein air painting a Baker Beach.  \nWe had the Mezza Platter ($14), Feta and Olives ($3) and Lentil Soup ($4). They had wine by-the-glass and they had happy hour house wine for $5 per glass.\nPrices were reasonable, food was good, service was good, wine list was OK.\nIf we are in the area, we would go back.", "author": "Carol H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-18", "description": "I went with my brother and mom on a Groupon deal that included 1 appetizer, 2 entrees, and dessert. \n\nIt was all really delicious and the portions were generous. \n\nWe ordered the Mezza Platter to start and then the chilean sea bass and the mixed grill. My brother ordered some sort of lamb soup in a clay pot and said it was good. \n\nThe waitress was really nice and attentive and advised us to order the sea bass early since it takes longer to cook. \n\nA really nice restaurant and would consider coming back if I'm in the area and want Mediterranean food.", "author": "Alison N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-07-03", "description": "Mezza platter, delicious! The falafel was soooooooooo good even though it wasn't chickpeas, it's garbanzo beans, it's fried and not greasy! You get 4 dips, the veggie looking one, eggplant, hummus, and yogurt and unlimited pita bread. \n\nI ordered the layaly mix grilled which came with beef, ckn, lamb, and shrimp skewers on top of this tortilla wrap and had grilled veggies. OMG it's hecka good, ordered for two was $32, but it's decently priced bc you also get two scoop of rice and the skewers were almost 2 of each kind. \n\nThe beer was good too, they had two that was good, one was Almaza and forgot the other one. \n\nOverall the service was nice, refilled water and what not. The only thing that sucks is parking. It's SF, what do you expect right?", "author": "Minerva L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-04-26", "description": "I have eaten at this great restaurant before, hence I had no problem requesting delivery.  Sadly, the food took more than an hour to arrive, it was ice cold and very disappointing.  I ordered the chicken skewers served with rice and arugula salad.  Normally the salad has a fabulous dressing with feta cheese.  The arugula salad was only a sea of greens, the chicken was very bland (in the past it had onions and other veggies on the skewer, but this time only chicken) and the rice had absolutely no flavor.  I also ordered the hummus with pita.  The pita was ice cold and actually tasted stale.  One piece was rock hard and went in the trash.  Not sure what's up and generally I like to give the benefit of the doubt, but I know I will only eat there in person if I go again, as it was a waste of $30 with a tip for cold and terrible food delivered.  \n\nI hate giving bad reviews, especially to restaurants that are usually fantastic!  Not sure what happened tonight. . .", "author": "Bev T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-02-04", "description": "We got a Groupon for this restaurant after reading the reviews.  Unfortunately it didn't live up to its billing for us.  The meal started off well and the service was excellent from our waitress all evening.  \n\nMy review takes into account the prices which are fairly steep (you'll pay about $46 even with a Groupon not including drinks or extras) so expectations are for it to live up to other options.\n\nThe appetizer was very good which was a hummus with Sirloin dish though the meat had a bit of grizzle the dish was quite savory which left us with high expectations.\n\nWe ordered the mixed grill plate and Sea Bass.  The mixed grill was fairly bland and the meat contained so much grizzle couldn't eat that part.  We felt it lacked any real flavor or spices though I'm comparing it to those I've had in the South of France while the Sea Bass was indeed pretty good.\n\nThe Baklava was so so.  \n\nSo for us the food 2 stars\nThe service 4\nThe decor 2 1/2\nThe value 1", "author": "Tom L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-29", "description": "Being lazy, I decided to order in via Eat24hours.com and found Layaly which is just down the street from the house.  \n\nI ordered an falafel wrap with green salad and lentil soup.  The food came within 45 minutes of ordering so I was pleased.  The wrap was quite large but, OMG, it was sooooo good.  The lentil soup was something I could eat every day.  \n\nEverything was tasty, fresh and totally affordable.  I could barely finish it but I didn't want to save it and have hard wrap the next day so took my time and ate it all up!  I was full but not stuffed, which is a good sign.  \n\nI have to try the other things on the menu and will do next time I am lazy and wanting Mediterranean food.\n\nYum Yum!!", "author": "Janette F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-22", "description": "Wonderful, flavorful Mediterranean food with great service. My mom and I split the mezza platter which was great- hummus, baba ganouj, falafel, borek, tabouli, and we substituted the haydari (or something like that) with the dolma. It came with a lot of  warm and soft pita bread. \nMy mom ordered the kofte wrap and it came with a salad. The kofte meat was definitely the highlight of the wrap. \nI ordered the tantouri tajine- sirloin in a white wine cream sauce with peppers, mushrooms, and onions. It was some of the best meat I've ever eaten. I don't know how they get the sirloin so soft but it was amazing. Really great spices. And it's served in a cute clay pot and comes with rice. \nThe service was also great. The waitress with the pink hair was super nice and helpful. The food came promptly and was served with a smile. \nI'll definitely be returning here soon.", "author": "Jenn A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-02-07", "description": "I'm so sad writing this review.  This place has so much potential to be a great Mediterranean restaraunt.  The ambience is relaxing and welcoming the decor of the restaurant is appealing and there is a wide variety of dishes listed on the menu . . . . . they don't just focus on falafels.  \n\nI went to Layaly last night with two of my girl friends.  We showed up around 7:45pm and there were about five other parties eating.  We placed our food order around 8pm and then told the waitress we needed a little more time to decide on a bottle of vino . . . . . . at 8:30 she returned to take our order and we didn't get our Pinot till about 9pm.  The wine was good but seriously I was worrying about driving at that time because I thought the place closed at 9:30.  At this time there was only one other party in the restaurant waiting for their food . . . . . the other tables had their checks.\n\nWe got our appetizers (Greek shrimp and Dolmas) at 9pm.  The Dolmas of course were cold . . . . so was the shrimp!  The plates were good, but not fantastic and let me emphasize the shrimp was COLD.  We finally received our entrees around 9:30pm and we were starving, we got the Musaka, and the Beef, Chicken and Lamb Kebabs . . . . . . They were all COLD.  The Kebabs were charred, I know they cooked them on a grill of some sort why didn't they bring them out then!?  The Kebabs at least weren't ground up meat it was all sliced but I hate cold food I feel like I'm eating left overs.  This restaurant NEEDS TO INVEST IN A FOOD WARMER or bring the food out right after it is cooked instead of making you wait 1.5 hours for it.  Again at this time there was only one other table of three people in the place . . . . ?  And I didn't see any to-go orders go out so I have no idea why it took so long.\n\nSo much potential, the menu and decor are both appealing, the ambience is great . . . . but you need to wait forever to get your food and when it comes out it's COLD.  Also, there was no soap in the bathroom so bring your hand sanitizer for the chef if you go =/", "author": "Erin B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-01-05", "description": "As i am eating cold mediocre falafel i write this review.\n\n\nIt is 9:15pm and we literally ordered dinner TWO HOURS ago at 7:10 pm and it just came to our door. \n\nNot only is the food cold but it is pretty bland and dry.\n\n\nIt ruined our evening- waiting for two hours for some shitty food. Wish i went to hayes and kebab.\n\nAnd the delivery guy was not even apologetic. Del hositizee yahmar", "author": "Kasie S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-09-01", "description": "I religiously consult yelp when choosing a new restaurant and it's about time I write a review! \n\nI came with a friend and we ordered the hummus appetizer, which was less garlicky than you might find a store-bought hummus but that I loved, and came with a good amount of pita. Halfway through our meal the waiter even came over and asked us if we wanted more pita. Not gonna lie, as poor teenagers, we were worried it was going to cost us extra but it ended up being free! \n\nMy friend ordered a sirloin tajine without either of us knowing what a tajine is. She ended up enjoying it as the beef was really tender and even the rice tasted good on its own. \n\nI ordered the falafel wrap with fries, my go-to at Mediterranean places when I'm not looking to drop more than $10, but it was so underwhelming. In the past month I've eaten falafel wraps at 3 different places and this was definitely my least favorite - it was just bland. Also, the fries I had were SO salty that even when I wiped them with my napkin I still didn't want to eat them, like how do you mess up fries?!\n\nFood eh, service eh. Overall, I would not make a return trip. Not worth the splurge. (yes, $$ restaurants are a splurge for me haha)", "author": "Sarah S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-02-15", "description": "Since I I have started working in the area, the mezze platter at Layaly has been an almost weekly staple of my lunch hours.  The Tabouli is fantastic... lots of parsley and minimal grain, the way tabouli should be!  I LOVE the Baba Ghanouj and eat it sans bread by the forkful... those two dishes alone make a pretty fierce lunch that will keep me coming back again and again.  However, in addition, I have enjoyed the tajine plates, kabobs, and salads as well and have not been disappointed... though, in the end, I mostly go back to the tasty variety of the mezze platter.  The service is always friendly and warm, though the kitchen can definitely move at its own pace at times (meaning, don't expect to pop in and out for a 20 minute lunch), and if you need a caffeine jolt to make it through the rest of your workday, take a moment for the delicious coffee.\n\nIf you're in the Richmond, this is a solid restaurant for a midday or evening bite!", "author": "Kathryn E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-26", "description": "Amazing amazing amazing. So nice I said it thrice. This place is awesome. Favorites: mezza platter, any type of kebob platter, pita & hummus.", "author": "Nick S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-04-08", "description": "I have to read things more carefully.  When it said \"Grilled\", everything was grilled!  My bass was grilled to perfection, but it was still grilled.  Everything seems to be  blackened.  Grilled would not be my choice.  My friend had the kebab.  It was okay.  The grilled veggie was my favorite, melts in your mouth.  We ordered the baba ghanouj.  It tasted burnt to me, but I was told it was suppose to taste like that.  It was explained that it was \"smoked.\"  I still taste burnt.  We had the Groupon for $29-one appetizer (crab cake) and two entrees and one dessert-Baklava-it needs some more pistachio or nuts.  We still had to pay $24 extra, 18% tips added whether you like service or not.  Tax and whatever extra you ordered.  If we didn't have the groupon, we would have paid $84 for two and we didn't even drink.", "author": "Helen L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-12", "description": "Mezza app platter was excellent with a lovely presentation.", "author": "Roger Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-25", "description": "Best Greek/Mediterranean food I've found in the city. The chicken and falafel wraps are delicious, along with their hummus and pita. I usually do takeout -partly because I live down the street and partly because sometimes it smells like cleaning products in there. But hey, at least they are cleaning! As far as food and customer service, I have only good things to say!", "author": "Karina N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-02-16", "description": "Went here on a Groupon recently with some friends. The food, for the most part, was just mediocre. Our waitress was very nice (hence the extra star), but overall it was disappointing. The musaka (which was recommended, so two of us ordered it) was especially bland. And although the mezza platter was good (not great), you don't get much for the $14. I don't think any of us will be returning. \n\np.s. As other Groupon users have noted, an 18% tip was added onto the bill, but for us it was clearly listed, so no accidental double-tipping.", "author": "jane b."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-04-09", "description": "Be aware that the pomegranate chicken can be very heavy on balsamic vinegar. Overall, I would give this place 3 stars.", "author": "Michael L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-04", "description": "I came into this place with average expectations, and they were well met and more. I walked in and was greeted warmly by the hostest and a very relaxed atmosphere. We were quickly served and I greedily dove into my dish. \"WOW, THIS IS EXCEPTIONAL!\" I remarked. I ordered the chicken kabob and when I bit into it, my mouth exploded with flavor. I went to Layaly, and I fell in love. 10/10, I recommend this place to anyone, come here for a great chicken kabob and a very relaxed atmosphere!", "author": "Elias B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-30", "description": "A and I came here for a late lunch on Saturday.  There was only one other table occupied.\n\nI ordered the Beef Kabob plate and A ordered the Kefte plate.  Each dish costs $8 and they were the perfect portion size.  They come with salad, a scoop of rice, and two kabobs.\n\nQuick, cheap, and delicious. \n\nI want to come back and try dinner.\n\nOh, and try their Pomegranate Lemonade.  Yum.", "author": "Kris L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-09", "description": "WOW!! Ive been looking for a good mediterranean restaurant for a while. Finally I found Layaly. They serve really delicious  food. \n\nI went there with three friends in a thursday night.  the waitress was really helpful and she suggested the mix kabob and it was GREAT. I highly recommend this place.", "author": "Haitham A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-05-09", "description": "Only ever came in for lunch, the specials are a reasonable value with salad or fries.  Usually do the falafel wrap, some cacik and feta and olives on the side.  Have always wanted to try one  of the tajine entrees.\n\nService is friendly and with a smile.  Everything is neat and clean, which at some other places is taken for granted.\n\nNever found it too busy, and that was usually lunch on weekends.", "author": "Ken B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-12-14", "description": "Have ordered through GrubHub a number of times and things were great until the last few times.  The chicken was delivered completely raw.  Not only is this dangerous, it's pretty disgusting to bite into raw chicken.   I called the first time it happened and spoke to a girl who was very apologetic and told me that they were training cooks and would refund my money.  Two days later, i was refunded, but only $10!  For a $40 meal that was ruined, to refund me only 1/4 of the price was pretty petty.  \n\nOrdered again tonight and while one meal was fine, the other had raw chicken again.   They need to either hire more or better cooks.  At some point someone is going to get sick from thier food if it is not cooked properly.   I contacted GrubHub to let them deal with the restaurant this time.  Not sure I'll order again.", "author": "Christiane G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-03-22", "description": "[M]ona: 3.5 Stars\n[W]ayne: 3.5 Stars\nAverage: 3.5 Stars\n\n+ Reasonable Prices\n+ Filling\n+ Good Portions\n+ Accepts Credit Cards\n\n- Slow Service\n- Dark\n \n[W] We came here because Mona had a restaurant.com certificate from here and it was a great deal. If you come here, I suggest just to stick with the appetizers because you get a lot of different choices to choose from and it's kind of inexpensive to try out many things. So tonight we had nothing BUT appetizers and man, I think we had a little too much haha.\n \n[M] We ordered the Borek (\"fried fillo dough stuffed with feta cheese and parsley\") http://www.yelp.com/biz_photos/9KeTKDuHdLMhRFku0HAIxw?select=NXVBpB01xZBkdoZOYuGYpQ, Cacik (\"Yogurt English cucumber, garlic, mint\") http://www.yelp.com/biz_photos/9KeTKDuHdLMhRFku0HAIxw?select=pbLNNiUlk5C8gIIun2FOPQ, Falafel (\"garbanzo with herbs and spices, fried served with tahini\") http://www.yelp.com/biz_photos/9KeTKDuHdLMhRFku0HAIxw?select=oCZIOGfyYBySHDEsocekpA, Garlic Fries http://www.yelp.com/biz_photos/9KeTKDuHdLMhRFku0HAIxw?select=Tx34Ian7ImSDpfxoOupb_w, Mezza Platter (\"hummus, baba ghanouj, haydari, tabouli, falafel, and borek\") http://www.yelp.com/biz_photos/9KeTKDuHdLMhRFku0HAIxw?select=HfDL2S2ZVOI7jwyYWkMJ1Q and a side of rice http://www.yelp.com/biz_photos/9KeTKDuHdLMhRFku0HAIxw?select=QTDSx9QtiSg9PvJ7aL_6vw.\n\n[W] I personally didn't like the Cacik because the dip was wayyyyy to sour for me. Mona liked it on the other hand. It looked like some sort of thicker dip but it just had a little too much lemon or lime juice in it. \n\nMy 2nd suggestion is that if you get the Mezza Platter, DO NOT get the Falafels also. The platter already has the falafels and the 2 on the platter was already enough for me and Mona. \n\n[M] The Falafels tasted good at first but it was too fried for us. The insides were tasty but weren't really enjoyable because it's like eating something really burnt and crispy on the outside. \n\n[W] The other dish that was really good was their Rice haha. You're probably saying Rice? How can that be any good? But yea, trust me, IT WAS GOOOOOD. You really have to taste it to understand me. \n \nThe nice thing about this restaurant was that everything comes with some sort of dipping sauce which makes a big difference because if it didn't, I think everything would be extremely dry. \n\nThe only thing that bothered me was that the host was more attentive to his customers in their little secret back room. I guess this place has a hooka lounge in the back because people were walking out of nowhere from the back of the restaurant. That was kind of weird in my opinion because we're sitting in a restaurant and here comes some stoned people walking out of nowhere. I think they should have another entrance for those folks. That lead to another problem which was not being attentive to your other paying guests i.e. US. \n \nWe were done eating for a while and nobody was on the dining floor to assist us. So we just had wait until someone came out of the hooka room I guess. I guess that service could've been better. Oh well.  3.5 Stars.", "author": "Mona C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-06", "description": "I always give people/businesses a chance to redeem themselves before making any harsh judgments, and I must say that Layaly went above and beyond in making up for a crappy delivery experience with them.  Last night, it was raining and they were slammed & apparently dealing with some employee issues, so my grubhub order came an hour after the ETA and was cold and missing items.  I called about it this morning and was pleasantly surprised when I got a call back.  Not only did I receive an apology, but also a free delivery of lots of delicious food AND a bottle of wine.  I hadn't experienced this level of customer service, well, ever.  I think my faith in humanity might even be somewhat restored.  \nAlso, their food is great!!  Thanks Layaly!!!", "author": "Nicki L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-30", "description": "We came here well on a double date because 1) the bf didn't want to eat any more asian food (weird i know) and 2) he was working so we needed to eat somewhere on the Richmond side of stuff. \n\nI ordered the lamb and the boy ordered the salmon kebobs. It was REALLY good. Lamb was so tender and delicious. The salmon was delicious as well, very well cooked and portions are really big, but oh so good.\n\nOverall, we had great service, and a wonderful time with friends.", "author": "Nina Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-07-23", "description": "My boyfriend wanted to come here after driving past this place a lot. Took us a while to figure out where it was... because he had an idea of where this place was but not exactly sure. We almost gave up looking for it but I told him to try one more block and we found it! \n\nWe came here for lunch and my boyfriend wanted the baba ghanouj while i wanted hummus. So we ended up ordering the Mezza Platter as an appetizer. We were amazed by how much they gave us and it came with a basket of flat bread. I didnt want baba ghanouj because i didnt like eggplants, but it was actually really good. My fav was the hummus and baba ghanouj. The haydari was ok... the mint made me think of toothpaste... and the tabouli had parsley in it which I dislike. The falafel was yummy though and so was the borek.\n\nI ordered the Falafel Wrap and it was sooo yummy. it was a little dry but not too bad. It has hummus inside but it was even better when I added more hummus (from the platter) and baba ghanouj. I ordered fries with this and was amazed how well the fries were cooked. The outside was crispy but the inside was really really soft.\n\nMy boyfriend had the sauteed chicken. I took a bit of it and the chicken was cooked really well, but I think it should have more flavor (or maybe i didnt eat enough of it.) My boyfriend enjoyed it though, he finished the whole thing.\n\nThis place is really good. Definitely will come back.", "author": "Alicia W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-13", "description": "I usually don't like Mediterranean food, but today I was feeling adventurous and decided to order some food from this place. For my surprise it was delicious. Loved it!", "author": "Ana Carolina J."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-10-15", "description": "Have ordered from here in the past and liked it. Tonight delivery took almost 2 hrs. They called and said the driver had just left and would be here in 10-15, then called 15 minutes later to say the driver was another 10-15 out. I was calling to cancel the order when he called. I excitedly dug into my food and found a chunk of beef in my mixed grilled vegetables.", "author": "Kathryn H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-20", "description": "I love this place. They deliver, and the food is always awesome! Huge portions. The mezze platter and the chicken kabob plate is enough for two for sure! I love the bubaganoush! The chicken is grilled perfect.", "author": "Alicia S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-30", "description": "Service was outstanding.  One waitress doing EVERYTHING for the whole restaurant.  Came in on a Thursday and place was packed with patrons.  More and more people filtered in but the wait was negligible.  We had reservations and were seated right away.  \n\nAs full as the restaurant seemed, nonetheless, the waitress was extremely efficient and remembered to follow through on every request.\n\nFood was GREAT.  We enjoyed the Rack Of Lamb, Beef Kebab, Chilean Bass Entree, and Grilled Shrimp Entree.  Food was outstanding although the portions for the bass was a bit small.\n\nFor appetizers, we had the Hummus Billahm and the Crab Cake.  The hummus dish was really tasty.  I would order that one again.  However, the crab cakes came as two patties and did not stand out an anything extraordinary.  That dish felt overpriced and not worth it.  \n\nI would come again to this restaurant.", "author": "Victor T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-03-24", "description": "This is my absolute fav Mediterranean restaurant in the city! I don't even care that I have to circle around the neighborhood for parking. It's that good. I love their Mezza Platter as it has an array of different treats, like hummus and taboulah. Forget about the rest of their menu! Well, their Mixed Grill is amazing! Oh, and not to mention their desserts! Drools. \n\nDid I mention that their portions are typical American? As in ginormous? After a Bikram Yoga Seacliff class, two girls can fill up on the Mezza Platter!!! \n\nThis place is soooo good that I have converted my \"hard-to-please\" friend who has a strong preference to frequent Chinese restaurants only! That is all! Just go to Layaly's already!  \n\nAnd the cherry on top is that they have excellent service! My water glass was always full. :)", "author": "Mabel Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-12", "description": "Everything we had was delicious. Everything. My friends said it was the best Mediterranean food they had ever eaten and I have to agree. So many layers of flavor with plenty of garlic and lemon and olive oil in all the right places. And to think most of their entrees are only $8. You can't go wrong with this restaurant. Service was friendly and attentive. I will definitely be back.", "author": "Melissa H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-10-13", "description": "Had a wrap, very bland. This is food court food, nothing great.  Actually, I had better tasting food at the Stonestown food court. Will not return.", "author": "AL H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-17", "description": "This place has a nice atmosphere, I definitely recommend this pace for lunch and dinner. The food is really good and fresh, also the prices are not bad. I ordered the chicken kebab plate and baba ganoush, both were great! I can't wait to come back! Go here and give it a try!", "author": "Tom T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-11-01", "description": "UNDER NEW OWNERS!\n\nService is enthusiastic and very good. But the food has slipped a little, not quite as exciting as our first visit in Feb 2010, and the portions have been reduced a little. Kebabs (we tried three different ones) were a little overcooked this time, although the cubes are good-sized.\n\nMezza platter was good, but the borek is not as interesting as before and tabouleh was good, but did not excite us the way it did back in February. The baba ghanoush (eggplant), kefir cheese, and hummus are still excellent, however, and the pita triangles are soft and warm.\n\nAfter our first visit we ranked them ahead of Oasis in Pleasanton, a similar restaurant (although the menus are quite different). Now - they are a tad below Oasis, although still very good.", "author": "Jean K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-28", "description": "AMAZING!!! Breaks my heart to not see this place more busy! Usually the only people in the restaurant. The portions are big! The quality and taste of this food is out of this world! My favorite is the Mezza Platter. I hope this place never goes out of business or I will cry because it's hard enough to find an outstanding, thirst craving Mediterranean food as is. Favorites: Tzatziki dip, dolmas and the spanakopita egg rolls. The chicken wrap and chicken kabob plate.", "author": "brook f."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-12-27", "description": "My friend knows the owners and have been here a few times for the meza platter and some delicious wine\n\nI've Ordered:\n+Baba ghanoush is made VERY well\n-Ahi Tuna salad \n-Vegetable kebob\n-Meza platter\n\nThe restaurant is very clean and the owners are very sweet and sincere.I would have given this place 5 stars, however when I placed the order to go it was a different experience. It says on the website it will arrive in about 45 minutes or so.........but it took over an hour and when the food arrived it was cold. When my friend called to check up on the order to make sure it was fulfilled (we ordered it online) the lady on the phone gave my friend an irritated attitude. \n\nConclusion: This restaurant makes their food with love and passion. However, don't order it togo unless you like eating cold food.", "author": "Julia D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-07-08", "description": "This is my second time here.  The first time I came, I had the lamb shank which was very good.  I was very disappointed the second time I came here and had the lamb kabobs which was so tough I could barely chew it.   I thought I was going to choke.  Lastly, we ordered the baklava for dessert and all we got was these two tiny little sliver pieces.  Boy do they skimp.  I doubt I'll be coming back.", "author": "Terry S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-06-10", "description": "3.5 stars * My friends decided to make a dinner date at Layaly at 8pm Monday. Not know what type of food this place served, and doing what must of us do, I YELPed it. Mediterranean... I was never a big fan on Mediterranean. I always found it bland and empty. However given a 4 stars and knowing mediterranean food is one of the healthiest diets around (watching what I eat lately). I wanted to give it a taste. 8pm this place was quiet. Then again aren't most place quiet around this lower Clement?\n\n\nFriend 1- Beyti ground sirloin, and lamb, wrapped in lavash bread, tomato sauce   $13\n\nLooked like stuffed meat wrapped like a burrito and cut in half, topped with tomato sauce. Tomato sauce was good. The meat wasn't too greasy. Mouth size. Good.\n\nFriend 2-Layaly Mix Grill kofte, chicken, beef, lamb and shrimp $24\n (he would get this...) \n\nMe- Kofte Kebab ground beef and lamb (4), onions, and fresh herbs   14\n\nVery simple ground beef and lamb kebab. I couldnt tell visually which kebab was beef or lamb. Came with a side of wild rice. It was delicious better than I expected. Right texture and flavor of the meat, with the dipping sauce BOMB!\n\nMezza platter hummus, baba ghanouj, haydari, tabouli, falafel, and borek   14\n\nA MUST TRY. Hummus was my favorite. Just the right amount of salt. Baba ghanuj didn't have much flavor, haydari was good and creamy, and the borek was not memorable to me and looked like a skinny a fried egg roll. \n\nI have to give this place 3.5 stars\n\n3.5 stars- Nice place you can take a date here. Food was higher than my expectations, flavoruful, variety on the meun., and the dished come out  like works of art. HOOKA!\n\n-1.5 stars- Service and food was little slow. A group after us got their food before us?!, little on the pricey side for what you get in portions.\n \n\nI'D come back best Mediterranean I had by far... BTW its also a Hooka restaurant. Though I didnt smoke the hooka, when I go back for hooka i'll updated.\nCheers!", "author": "Brent W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-12-28", "description": "My God. I love this place. There is absolutely NO REASON AT ALL why this restaurant isn't packed to the gills every night. The food and service here is simply top-notch. We get the mezza platter every time and it never fails to amaze us how delicious everything on it is. My personal favorite dish is the braised lamb shank. It is absurd how satisfying and wonderful this meal is. \n\nBottom line: stop reading these reviews and just eat here already!", "author": "Raymond P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-14", "description": "A couple of nights ago, I was very tired so we decided to order in. We picked Layaly. This was the first time ordering from there and I must say it was a great find. the food was good, we had the chicken wrap and kebab and off course Baklava. Everything was made to perfection. The service was great also. the food was delivered in record time. I especially liked the fact the food was still warm and in tact when it arrived. Sean the  Driver was very nice and pleasant, this being our first time ordering from Layaly, he actually spent time telling me about the food. Next time I will order is recommendation of Fatoush salad and the side of vegetable. Thank you Sean.", "author": "Timothy R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-05", "description": "The Skinny:\n\nReally great food\ngreat presentation\ngreat service - our waitress was very friendly and warm\nRestaurant plays nice cultural music (for example, not a fan of listening to rap music at a Thai restaurant)\nSeating was comfortable - Monday night was quiet, we had the place to ourselves\n\nDetails:\n\nWe got the mezza plate which has all the usual middle eastern suspects on it - hummus, tabouli, falafel, tzatziki, etc - all yummy\n\nI had lentil soup which was delicious and a Greek salad which was good (light - not oily)\n\nInteresting note: they have nightly specials for only $10 which, last night were two choices: pomegranate chicken with rice and a steak special with veggies and rice. My picky gf liked the chicken.\n\nWe intend to return. Grab the restaurant.com coupon before you go for your first time.", "author": "Chris G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-02-06", "description": "Please update your timings on yelp. Drove all the way at 4 PM and you guys were closed", "author": "Neha M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-16", "description": "Awesome place for Arabic food . Coming from Arabic background , I find the food could be better that what I have eaten back home ... It's really a place worth to be visited", "author": "Yousef A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-16", "description": "I ordered from here again and was very pleased. Got the Mezza platter and it is the best spreads I've ever had! Everything was great and I asked for no cheese and they totally omitted it. Yay!", "author": "S. M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-05-07", "description": "Dropped by for lunch while shopping in the neighborhood. The place was virtually empty 1pm on a Sunday. Ordered one of the \"lunch specials\"--lamb kabob, rice and salad, and a Lebanese beer that I'm fond of. I asked for the lamb as rare as you can get it--just sear the outside.\n\nThe waitress/hostess (there seemed to be only 3 people working in the restaurant) was super attentive and very friendly. The lamb was deliciously seasoned, but cooked medium well, and there were only 4 tiny 1\" square morsels matched with 4 slices of grilled sweet pepper total--split across 2 skewers. The rice was unseasoned (albeit a dozen or so grains were yellow as if they'd been scented with some sort of stock.) The salad was well turned out with unusual greens and a tasty dressing. \n\nThe caveat? $11 for that plate. Seriously overpriced. Will risk a dinner visit for comparison purposes, but unless you've got money to burn, or are trapped in the Richmond and can't hit up say... La Mediteranee, not recommended.", "author": "Ninotchka D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-12-31", "description": "I've been here a couple of times with my girlfriend, and it is a solid restaurant.\n\nThe exterior is a a bit nondescript, but the interior is quite nice. It is very clean, fairly simple, but nice.\n\nMy girlfriend loves the salmon, and I'm a huge fan of the kofte. If you're not sure what you want, there is a mixed grill plate that comes with several different kinds of meat. That plate is served with rice.\n\nIn addition to the rice plates, they do also have wraps and tajines. This is definitely not a cheap place to eat a quick dinner, and it isn't exactly high class dining, but it is a solidly middle dining experience. Definitely a good place to eat and worth a try if you're looking to try something new. It also makes for a great date spot.", "author": "Tonichi L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-11-16", "description": "Turkeyhopper.\n\nLunch was nothing to complain or rave about. Wrap featured plenty of grilled chicken, veggies, hummus (on request) and a side salad, but it was nothing I'll remember a few weeks from now.\n\nTurkish coffee finish was a good call.\n\nPrices are as you'd expect in a sit down restaurant. Ten bucks for the wrap. Service was as kind as before, perhaps a little forgetful on the water and napkins.\n\nMost memorable will be the conversation.\n\nThe Tablehopper (you don't subscribe? fix that: www.tablehopper.com/) recently returned from Turkey with plenty of recommendations on things to do and places to eat. Very timely. I'm going shortly.\n\nDinner is still recommended. As is the Tablehopper.", "author": "Jason B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-03-20", "description": "So sad to hear that they no longer have hookah but that was obviously to accommodate the SF ban.\n\nIn any case, the service is awesome! And food was super tasty. I ordered the kofte kebabs which came with a rice pelof and grilled veggies and my friend ordered the lamb with couscous. The lamb was especially flavorful. Also, we ordered individual glasses of wine and they gave us our second glass for only a penny! I've been here before but it has been a while. Their food has always been good but I think it has gotten even better! Definitely coming back :)", "author": "Alex M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-04-22", "description": "Come here only if you have hours to wait!  Don't come if you are starving, you won't get your food quick.\n\nFoods ok, I tried the hummus with steak (the best of the entire meal), Greek shrimp, mixed grills, pomegranate chicken, and a few other.  I agree with some other reviews, the kabobs are slightly too burnt.  \n\nServices - they do have enough servers to manage in house customers, but the kitchen does not have the capacity for  in-house guest + to-go orders.  It took a loooong time for food to come out!!!", "author": "Jen C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-20", "description": "First impressions are important, and Layaly did come to the forefront as a pleasant and tasty experience worth doing again. We had lunch - falafel salad and chicken kabobs. Both were tasty, although I would go a little lighter on the craisins in the salad. Falafels were light and tasty, as well as the chicken. I saw several delicious-looking plates come out, so I will definitely go back to try them.\n\nService was pleasant and relaxed, but efficient. Layaly really is a neighborhood gem, and a great food adventure as well.", "author": "P C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-09-02", "description": "I got tricked to come here by their deal on Scoutmob - 50% off up to $15 but what they don't tell you is that's only valid for dinner. Had I known, I would've much rather went to Gordo's or the new Russian place near by today. \n\nThe restaurant was completely empty, during lunch on Friday which seems reasonable as I don't see too much demand for sit-down lunches in the Outer Richmond. The food still took ~15 minutes to come which tells me it's made fresh but also that I might've not made it back home on time for my meeting.\n\nI got the kofte wrap and dolmas, both were pretty good and the wrap came with a salad. I have nothing bad to say but also nothing wow'ed me there.", "author": "Tatyana K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-10-04", "description": "I ordered delivery tonight at 7:12pm and it arrived at my door @ 8:33pm. Now, I completely understand a busy Friday nights but come on now. I called 3 times about it and to say the guy on the other end was aloof is being kind. Shockingly bad phone manner and the 4th time I called they did not answer the phone at all--really, they did not answer the phone! This was the 4th time I have ordered because the food is solid for delivery but the poor customer service tonight has cost them a customer.", "author": "Corey T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-13", "description": "We've eaten lunch here two days in a row now :) The service is great - friendly and hospitable, water glasses never empty. The atmosphere is classy and elegant. The food is delicious! The chicken kabob is the best ever - large chunks of all white meat chicken, perfectly marinated in something delicious, cooked until a bit crispy outside and juicy and tender on the inside. Yum and so flavorful!\n\nThe labneh was AMAZING. The hummus and Tabouli were great, and the pita was just right - soft, fresh, and warm.\n\nThe portions could stand to be bigger, but everything was delicious and the staff/owners were great. Definitely recommend.", "author": "Ashley S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-29", "description": "Bummed to pay this place a visit only to find out that due to some sort of city ordinance, they no longer serve Hookah here. :(\n\nBut if you can ignore the fact that the Hookah attraction has closed, you'll still come to find that they have delicious food. The dips on the Mezza Platter were zesty and creamy, the Felafel were hot and crunchy, and the lamb was flavorful and tender. \n\nA great place to go for reasonably priced and delicious Greek cuisine. Zeus would be proud.", "author": "Jeffrey J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-04-03", "description": "Came here by accident, which was probably a good thing to begin with. I was drawn in by their \"$7 lunch special.\" I thought, what a deal! The last time I had Med. food, it cost me my current paycheck, and the paycheck after.\n\nI didn't expect much quality or quantity wise due to the price, but I was pleasantly surprised. I got the sauteed chicken plate and it came with a nice helping of rice and chicken. It was tomato based and had a lot of nice flavor... And it filled me up!\n\nThe staff is very friendly and attentive, another bonus. I wouldn't come here all the time because parking sucks, but if I'm ever in the neighborhood for lunch, this is definitely a place I'd wanna go to.", "author": "Sara K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-12-23", "description": "Here we are . . . December rolls around again and it's time to celebrate Sis' s birthday.  What will we be eating? . . . Thai again?  Oh no!  She searches through Yelp and chooses Layaly.  Why?  She loves lamb and she already knew what she wanted to order even before arriving at the restaurant!  . . .  The Mix Grill???!!!  It was an excellent choice and Layaly did not disappoint.\n\nCalling to make the reservations, a delightful lady with such a personable and soothing voice quickly answers the phone and takes down our info.  We're off to a good start!\n\nIt was a Tuesday night and we had great parking karma, finding a space less than half a block away.  Layaly is a quaint and comfy place and we were seated quickly.\n\nThe meal:\n\n*  Hummus - A very generous serving, presented as a mound with a beautiful swirl like a huge frozen yogurt, and topped with an olive.  The hummus was smooth and the tartness was perfect!  The server even gave us an extra serving of pita bread!  Nice!\n\n*  The Layaly Mix Grill - What a meal!  Sis and Mom ordered this for two, which is a better value.  Each person gets a kofte (ground beef and lamb), chicken, beef, lamb, and shrimp kebab with onions and peppers, along with a hefty serving of rice and grilled vegetables.  OMG!  Who can eat all of that?!!!  Well, Sis did! . . . That shows how good it was!  Mom didn't have quite as big an appetite and had to bring her leftovers home . . . and given an extra serving of the cucumber yogurt sauce.  Thank you!\n\nI sampled a piece of each of the different kebabs and found the chicken, beef, lamb, and shrimp all to be tasty, tender, and juicy.  Delicious!\n\n*  Kofte Kebab -  My order which is a mixture of ground beef and lamb with onions and herbs, along with bell peppers.  You also get a serving of rice and grilled vegetables.  I found this a little drier than expected but I found the meat to be tasty with the slight gaminess of the lamb.  Dipped in the yogurt sauce and it was yummy!\n\nLayaly's menu is quite extensive and includes other entrees such as fish, shrimp, various lamb dishes, eggplant, and musaka.  They also offer various wraps, tajines, appetizers, and soups and salads.\n\nThank you Layaly for the delicious meal, excellent service, and enjoyable birthday celebration!  We will meet again!", "author": "Karen L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-11-21", "description": "The food and the service are both fantastic. Two of us had the meze platter which we thought was excellent. The baba ganoug smokey and creamy, the tabouli full of good fresh Italian parsley, and the huumus perfectly spiced with garlic. This was accompanied by some excellent soft, warm pita.\nWe then had the mixed grill for two and the flavors were wonderful, each different for the chicken, shrimp, lamb and beef. We are big eaters and could not finish everything.\nWe had five glasses of wine and felt the price for everything was very fair.", "author": "ted t."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-28", "description": "Ordered delivery from Layaly for the first time on a whim thru eat24 and I have to say we enjoyed The Best dinner tonight! Delivery was faster than expected and the food was so good and fresh. Their prices are steep but I'd definitely order again.. maybe with fewer choices to lower the tab, but the quality is worth it. Very good food, not one miss.", "author": "Christina B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-05-23", "description": "Randomly chose this place for our girls night out and glad we did. The food was really good and it wasn't loud or crowded even though it was a Friday night, so it was great for us to catch up with one another. The service was very friendly and when asked if it was enough food, she was honest and even told us not to order more.\n\n- Ahi Tuna Salad: excellent! light and the citrus dressing was good\n- Layaly Mix Grill: kofte, chicken, beef, lamb and shrimp were all good and flavorful. beef and lamb were my fav's\n- Salmon: tender with a nice crust", "author": "Linda C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-09-05", "description": "My wife and I need to thank GroupOn for bringing us to this excellent Mediterranean restaurant. \n\nMy recommendations below are based on our picks during our visit: \n\nAppetizer\nHummus w/Sirloin-(Delightful appetizier to begin the feast) \n\nEntrees-\nLamb Kabob (Generous portion size which may be good for 2 people) \nMixed Grill ( Again-generous portion that provides a sampling of all the great meats they have to offer) \n\nDessert-\nBaklava (Not the best I've had but fairly average for what it is) \n\nWish we could have hit the place for lunch as opposed to dinner. The generous portion sizes along with the excellent service was one for the books.", "author": "Sanju R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-10-31", "description": "Great food!\nThe meze platter. Lamb in every possible configuration. Veggie stew stuff. Yum. I'm hungry just imagining these dishes....\n\nAnd because this place is typically (surprisingly!) empty, they offer great service by default.\n\nMy boyfriend and I went three times and had the same waiter/owner, who delivered a special brand of comedic entertainment. This guy should do stand up too.\n\nI've heard the city has shut down the hookah bar in back but for a time that was also great entertainment.\n\nWe've been more recently and there's a new waitress working. She made a few mix ups with our meal (for a larger group), but the personalized service, excellent recommendations from the house, and low key atmosphere make this our go to place for a chill  'date night' in the Richmond.", "author": "Ek M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-30", "description": "Fortunate to have the new Sunday brunch. Great reviews all around our table. Especially the potatoes! Excellent Arabic Coffee as usual. And extra pleasant experience due to graceful, friendly server. Second time there. Definitely will be going back to this fine little spot in the Richmond.", "author": "Peter H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-06-20", "description": "Just got Layaly delivered for the first time.  Admittedly the food is good, but the portions are TINY for the price.  Seriously, the Mezza plate is itty bitty.  You can get 50% more of the same dish at Park Gyros for half the price, and that is not at all an exaggeration.  I can always eat the PG leftovers for lunch the next day, but definitely not going to have anything left over from Layaly.\n\nSadface.  The food is really good...just not worth the much higher price.", "author": "Dale M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-05", "description": "This is for delivery since we haven't actually made it out there yet. The wraps are super tasty and huge (it usually provides two meals for me). I love their Layaly Mix Grill and hands down, their hummus is trully coveted in this household. Oh yes, and of course the dolmas. So while I haven't tried just everything yet, I can't wait to because it's all been quite tasty.", "author": "Shauna S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-05", "description": "I had passed by a million times and finally tried it out. Really good! Grilled mix plate was awesome.  Perfect for 2 to share with the Meze sampler.  Romantic inside, friendly cool hostess. Price is right and I noticed on grubhub they even deliver!", "author": "Chelsey G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-06-12", "description": "Great falafel! Definitely use the Scout Mob deal, it's crazy cheap then. Love this place.", "author": "Malkov D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-05", "description": "One of the better Mediterranean places in the city. Flavorful & accommodating with substitutions to make entree on the healthier side. Chicken kabob dish and hummus is great!", "author": "Lina G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-07", "description": "Great place. Came here with the whole family and also do take out. Good kebabs (had lamb and chicken), mezza platter and drinks. Good size portions and friendly service.", "author": "Jason O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-09-23", "description": "One of the best Middle Eastern Restaurants in town.\n\nI went there twice and we got to try a big selection of their food.\nTry the crab cakes, they are different then any crab cake you've ever had!Delicious!\nMy husband had the Lamb, it was beyond delicious!We loved it!\nI have the Chilean Seabass, one of the best seafood dishes i ever tasted.The sauce the chef makes is perfect!\n\nAlso the presentation of the food is superb!\nIt's a little quiet place on Clement, so if you want good middle Eastern food, and a cozy environment, you need to visit Layali!", "author": "Catherine K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-02-02", "description": "READ THIS BEFORE YOU BUY THE GROUPON!\nscenario: 2 people, for dinner at 5 when they open, in an empty place.\n\nThis place gouges you  with a mandatory 18% tip on your bill because you are a groupon customer!!! The waitress factored in the tip including the tax!!! and said that it was on the fine print of the groupon description. I ordered a separate dish to go and her calculations came to around $100 for a $29 groupon + $14 takeout. Being so shocked, I paid it and checked the \"fine print\" later.  What a shyster. All I can surmise is that the restaurant is so chintzy that it acts in bad faith to recoup the money back that they lost from the goupon deal. \n\nI would NEVER EVER GO BACK NOR RECOMMEND THAT ANYONE GO THIS AWFUL PLACE!\n\nbtw, groupon says that they will respond back within 24 hrs when you call or write. It's been a week and half now and no resolution there. Thanks for nothing groupon!", "author": "kim y."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-09-05", "description": "This was quite a disappointment. I've had Mediterranean food before and it was great. While the appetizer sampler was good. The main entree beef kabob was TERRIBLE. Very bland and very tough to eat. It was quite a let down, my boyfriend never had Mediterranean food before and now he never wants to eat it again! This place ruined it for him", "author": "Krystal M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-03", "description": "For $20, you can get a really good, decent meal.  The kebobs might not look like it's much meat, but towards the middle of my meal, I could barely finish my first kebob. \n\nClean, bright and warming.  Excellent dishes and made me a fan of Mediterranean food!", "author": "Nancy S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-10-05", "description": "You know what?  This place is good.  Really good.  Doesn't really look like your neighborhood 'comfort' food place, so you never see this place packed.  Too bad.  It's really good stuff!\n\nWe shared the Mezza Platter that came with hummus, falafal, baba ganush (sp?) tabouli, and other tasty treats.  Comes with a big bowl of flat bread.\n\nFor entrees, hubby and I shared the Mixed Grill for two.  Wow.  Two skewers each of their kebobs - chicken, lamb, beef, shrimp, and kofta (mix of lamb and beef).  Comes with two 'scoops' of rice and a special yogurt sauce.  Everything was cooked perfectly.  All the meat was tender, and went perfect with the sauce.  We brought half of it home.\n\nApparently, we had order the same thing, about 3 years ago, but I totally forgot how good it was.  Or maybe it's better now?  I can't imagine not coming back to this place in three years if it was this good.  Anyway...\n\nMy parents ordered the rack of lamb (i think it came with 4 or 5 chops!) and the braised lamb shank.  Delicous!  The lamb shank was soooo flavorful, and fall off the bone tender.  Dad loved it.  The rack of lamb also looked amazing.  I'm surprised it came with that many chops.  Usually you only get two.  \n\nDinner for 4, plus drinks, $110.  Not bad!  Plus leftovers for 2 people.  Can't beat that.\n\nDon't know why we waited so long to eat here again, but it's a new neighborhood favorite.", "author": "Denise M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-23", "description": "We had a groupon which was a great deal. We sprung for the Mezza Player Appetizer ($5 extra with the groupon- but worth it to try everything) which was promptly brought out to us. Our server explained what everything was which was helpful. We both had the mixed grill which was also delicious. But the best part was dessert. We chose the baklava which was amazing. By far one of the best baklavas from a restaurant I have had. I highly recommend this restaurant! Enjoy!", "author": "Kaitlin M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-09", "description": "Delish! I ordered an entree, side and appetizer and it was more than enough for 3-4 people. Decent price and prompt delivery! They must be reading the yelp feedback. Will definitely order again for my hummus, baba ghanoush  and Adana kebab fix.", "author": "Jessica E."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-09-21", "description": "I wish I could give them a higher rating, because the food was delicious.  The Mezza Platter was great to share with so many different but excellent flavors. I really enjoyed my kofte wrap.  Unfortunately my enjoyment was very reluctant as they took over an hour and 45 minutes to deliver my food! This is after they had quoted me with an hour maximum delivery time.  If they had just been honest with how long it would take, I would have waited to order from them on a day they were less busy and ordered something quicker.  I understand that sometimes delivery will take a while, but I can't stand when restaurants aren't honest about how long it will actually take.", "author": "Ryan C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-12", "description": "The hummus is a tasteless paste. The grilled items & tagine are good, but the food is inconsistent: some orders are fantastic, and some tough & flavorless.", "author": "Akasha A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-07", "description": "Happy Day! Darius and I went to Layaly Mediterranean grill after reading the Yelp reviews and the two dishes we shared were definitely good but not great. I should have stuck with my plan to have a wrap as they seem to get good reviews. The restaurant  is easy to find and it was easy to find a place to park. I thought our waitress was wonderful--and the service time was pretty good. The place was fairly empty for 5PM on Saturday. I live in Los Gatos so want to experiment with the hundreds of good restaurants in SF but I definitely recommend you try Layaly if you like Mediterranean food.", "author": "Patrice W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-02-17", "description": "This place is awesome! I highly recommend:\nLentil soup- soooo yummy \nMezza platter- delicious and huge \nFatoush\nChicken kebab\nThe fries are a MUST!! \n\nCheck was about $50 before tip which was great considering the quality and quantity. We were only two people so we had plenty of leftovers for lunch the next day =)\n\nNice decor and great back room. Unfortunately they do not have hookah anymore!", "author": "Dana S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-08", "description": "This is one of my go to spots in my hood when I feel like a glass of wine, greek salad and some smokey baba ganoush. Servers are always friendly and usually a little slow. Place is always clean, they have an ok wine selection and decent menu pricing. They never rush you so it's a nice spot to chat with friends. Love the Mediterranean platter and greek salad, have never tried an entree.", "author": "Cec D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-05-09", "description": "This is for their DELIVERY service:  Layaly = \"Late Always\"\n\nNearly two hours (despite on-line order which said 50 minutes), stone cold upon arrival (cold shrimp, yuck)...  So, we sent it back. \n\nAll this after several calls to the restaurant where we were assured it was \"on it's way.\" Since we live 5 minutes away, when another 20-30 minutes passed, we knew something was amiss. Furthermore, the woman we spoke with was of absolutely no help - even after 3 calls, she had absolutely no empathy and continued to lie and say it was \"almost there\"... it wasn't.\n\nTo top it off, because we sent it back, we are now having to contact the online order company (Open Dining) in an attempt to get the credit card charge reversed.\n\nWhile we've had good food from Layaly in the past, their delivery service is HORRIBLE and although this is the first time I've Yelped it, this was not an isolated incident. To varying degrees, this has happened two or three times before.", "author": "Walter A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-03-03", "description": "This place is good but I feel they would do much better if they became a reasonable dinner option in terms of cost. I walk  by daily and rarely see more than two tables seated and frequently none at all. Perhaps they have a later crowd.\n\nThe hummus is great.\n\nDinner for 2 including tip $50...I can get better food with larger portions down town for $18 for 2", "author": "John D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-07-18", "description": "Delivery was fast and food was good, although not scrumptious.  Perhaps I didn't order well, as the lavash-wrapped lamb dish wasn't covered in sauce as I'd been expecting and seemed a bit dry to me.  I'd order from them again, but would read the menu item description more closely first...", "author": "Jan C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-13", "description": "Terrific Mediterranean Grill with freshly prepared and healthy dishes. \nThis place has some of the best grilled vegetables I have ever tasted! \nGreat, great, great choice if you want light, satisfying, and delicious dining!\n\nThey offer lots of choices of appetizers, salads, soups, and entrees along with sandwiches during lunch. \n\nTheir recipes for their dips and marinades all taste so original, with superior care and attention paid to the quality of preparation and service. \n\nYou just gotta try their flavorful rice pudding for dessert!", "author": "Richard T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-07-27", "description": "Great food, great consistency, great service. I always order the lamb kebab here, in one form or another, and it's always been good. \n\nThe Layaly salad is refreshing, I order that with lamb too. \n\nI've only eaten in once, the service was great. Most times, I do take-out, service was equally great. \n\nIt's been my go-to place for dinner for the past half a year or so when I was too tired to cook or go out, and they've never disappointed.", "author": "Evelyn C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-26", "description": "A heartfelt thank you to Jessika, who served us, Sauri and Jose who cooked, and anyone else who was involved in making our nearly 3 hours of culinary delight as good as it was.  I was very impressed with the attractive plating and appearance of the food itself, it conveys the message of creativity and carefulness in preparation which indicates you folks love what you do!  In turn, the food tasted very good as evidenced by the nearly licked clean plates.  The chocolate cake was delicious and the cardimon laced coffee was a lovely surprise!  Thank you for making our evening such a delight!!!", "author": "Marian B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-29", "description": "I came here after I read the reviews , I love the Jordan food they have here, it was a great to taste the flavors they have here", "author": "Seaera T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-03-26", "description": "I'm only go here for the hookah since its the damn best damn hookah lounge I've been around the Bay Area. I recommend not to order food their if you are trying to save money. They only give you small amount of chicken kaboob and it taste too plain. \n\n       Both hookah and service is god damn great! The dude come by and ask if the hookah need cleaning or more coals. They clean their hookah daily and take care of them. There a backyroom with a roof tent cover over the room from the harsh element. After 9pm or 10pm when they stop serving food, you can smoke in the restaurant.\n   \n*They don't serve hookah anymore since the stupid law in SF took effect.", "author": "Richard C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-02-26", "description": "Last night my boyfriend and relatives came to this spot to check out the Hookah flavors that his sister so raved about as well as the food.\nI enjoyed the appetizers here..your best bet is the MEZA platter and ask for extra pita bread. the baba ganouj from what my sister tells me is also good. I love the back patio deck setting for the open air Hookah. The chocolate mint and kiwi strawberry was pretty surprising. I'm no hookah expert and last night was my first time, it was different and pleasant. I would definitely come back, their service was really good, price is reasonable, although portions are a bit small. the place is new so we got there a bit to early to sit in the back area where hookah was available. The back area opens at 8pm and if your coming in,... suggest you call ahead of time to find out. I will definitely come back with my fam here.", "author": "Ateh M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-27", "description": "We discovered Layaly a few years ago, and it never disappoints. We've been back several times, and they also deliver to a wide area (for free).\n\nStart with the hummus and warm pita. It's creamy and not overpowering, and all too easy to eat too much before your meal arrives. The borek is also a good starter.\n\nThere are so many good entrees to choose from. I recommend the Beyti, the Chilean sea bass or the Kofte kebab. \n\nGood value for the price.", "author": "Monarch B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-30", "description": "My friends and I came here for the hookah bar. We initially planned on having dinner here but the menu looked pricey. The place was supposed to close at 10 and we got there at 9:50. The guy set us up and told us they usually let the customers stay 10:30 to 11:00 at the latest. He was very friendly and checked up on us regularly. We ordered sex on the beach which was very fruity but I liked it a lot. \n\nThe only thing keeping me from giving that last star is the favoritism. We arrived first and the group of attractive ladies got theirs set up first and he even gave them some cool thing to make bubbles! I was jealous. Anyway, it was only $15 for four of us. I'm not sure what the rate is based on though.", "author": "Tiffany P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-19", "description": "Mediterranean food is the best. Ordered delivery not expecting a lot and was blown away, time to go in for a real meal!", "author": "Mark C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-02-12", "description": "My boyfriend and I came here for dinner last week with a Groupon offer which was an appetizer, 2 entrees and a dessert.\nWe ordered hummus with sirloin (appetizer) and it was amazing. I wish I had it for my entree!\nOur entrees: salmon (for me) and lamb shank (for my bf). His was amazing, mine was not. Hardly any veggies and the salmon was DRY. \nDessert was baklava. It was good, but I love anything sweet.\nPrices weren't too bad and it's a perfect place for a date. My bf said their lunch is great. I would give this place another try, just don't get the salmon unless you want to massage your throat to swallow it down.", "author": "Christina R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-03", "description": "big fan of this place! been here twice now and definitely still recommend.\n\nlentil soup - 3/5 stars\nsirloin hummus - 4/5 stars probably would have just gotten the regular hummus as it's a lot extra for just some beef on top\nchicken skewer - 5/5 stars the meat was heated to perfection\nokra clay - 4/5 don't think the menu says but it also includes beef", "author": "Janet Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-22", "description": "Went back. Every single thing I had complained about was fixed. Fast service, warmer (we sat right next to the fire place), tip not added on automatically. Food was great. I'd go back, let that be the tie  breaker and the deciding visit.", "author": "Sarah D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-06-10", "description": "The chicken kebab was probably the best I have ever had and for 7 dollars.......Wow!!!\n\nThe appetizer platter for 14 dollars was a little steep considering you only get 4 side dishes to go along with your pita bread.  I would probably just get the hummus by itself the next time.  \nThe pita bread came out warm and fresh and the hummus and was great.  The portions are a little small.  You will finish the whole thing and probably be still a little hungry after.\n\nMy other two friends had the salmon and it didn't taste as fresh as it should.  Overall, I would definitely come back for the kebabs!!!", "author": "jason g."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-02-02", "description": "Food is serviceable.  Nothing too amazing but decent and at a good price.  If you eat in they also have some decent wines.\n\nDefinitely a good option in this neighborhood for a quick meal.  We always try to order without rice and they always fail to meet the request.  Not easy if you're trying to eat paleo which Mediterranean usually offers.", "author": "Jeff S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-05", "description": "I don't know why this place is always so empty. The menu's a little dull on first glance, but the food is always very good and very nicely presented. Just get the greek salad or a kebab and you'll be surprised at how good they can be. The service is usually excellent and friendly as well. \n\nReally, my only complaint about Layaly is that - despite the warm, inviting atmosphere - it can feel pretty lonely in there some nights. So go eat there already!", "author": "Charles B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-12-14", "description": "Been meaning to try Layaly for a very long time.  Husband and I finally stopped in for lunch earlier this week.  Our meal was okay but at this point, I am not sure we will be back.  \n\nWe ordered the olives and feta, the kofta kebab, and my husband had the kofta wrap.  First of all, I wished the olives came before our meal rather than with our meal.  But then, they weren't very exciting anyway--the feta tasted a bit strange to me (I just visited Greece recently and had A LOT of feta and it was so much better than this).  And not to be nitpicky, but the olives tasted like the ones I buy in Costco in bulk and sit in my fridge for several months,  \n\nAs for our actual lunches, they were fine.  We both thought the meat was pretty good.  And service was fine as well.  But overall, we both agreed that if we are the mood for Mediteranean flavors, we would much rather go to Troya on Clement.  Oh well, glad we at least tried...", "author": "Yvette H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-15", "description": "Wooooow, the best middle eastern place in town, their kobabs are so good, and the have delicious appetizers,  dont forget to taste the freshly made desert (baklava ), definitely coming back again and again", "author": "Will H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-27", "description": "Got the mezza platter which was excellent, the lamb shank was great (beware, the portion was massive, and I didn't even come close to finishing it). My friends got the Dhanie and Dajaj tajines which I would highly recommend as well. The prices were quite reasonable as well - would definitely go back", "author": "Karthik K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-19", "description": "Groupon was a good deal. Hummus with kabob for appetizer (yum.) stewed lamb (double yum.) lamb kabobs (okay). No sea bass? Bummer! Will call ahead next time. Waitress/Hostess super nice about the Groupon. Groupon works funny so at the end of the night, we paid about $20 bucks for taxation on the total, which means the 1 appetizer, 2 entrees, and dessert (baklava, btw, was amazing) (Groupon $30) was $50.", "author": "Vicki T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-03-20", "description": "We had a terrible experience. We spent over $30 on two main dishes and one appetizer and there was hardly any food. The smallest portion sizes that I have ever seen. We had to get a second dinner somewhere else because we were so hungry. STAY AWAY FROM THIS RIPOFF!", "author": "Olivia D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-10", "description": "Went to see a friend belly dance.  Two of us split a bottle of wine, lamb chops and mixed grill for one.  Meats came with rice and small salad on the plate.  Definitely enough food. Both chops and mixed grill items were very good, tender and juicy.  Service was fine.  Parking in the area is a challenge, although the waitress told us about an evening lot close by.   I'd call and find out about the lot.  I found a parking spot 4-5 blocks away.", "author": "Linda S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-08-09", "description": "Went there was my wife last weekend because we had a Groupon. What a find?!! the place was very nice and the food with really good. I had the Mix Grill and my wife had the Chilean Sea Bass both were really good! Definitely going back agin, even though it's a little far from where we live!", "author": "Bassam M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-03-21", "description": "Solid three and a half stars. I ordered food on Seamless. It said an estimated 15-20 minutes. I took a shower and headed over. Probably got there 25 minutes after placing my order and I still had to wait another five minutes. There were guests inside the place, so I'm not that pressed about it.  The lady with blonde bangs was super nice to me and I appreciated that. \n\nThe food was delicious. I got some lamb dish and it was so good and filling. It came with couscous and I wish I had more of whatever sauce the lamb covered in. I've never had Mediterranean food before so I can't really judge it against other Mediterranean restaurants, but the food was so good that I will definitely go back and try something else.", "author": "k h."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-12-11", "description": "Yeah, it's a real wonder this place limps along as badly as it does. The location is prime, but it just doesn't seem to pull in the customers like Hard Knox and Sakura across the street. \n\nThe mezza platter, mixed grill, seabass, sides -- all excellent. It's not just your typical near/middle eastern fare well executed, either. A lot of thought and effort goes into the seasoning and preparation producing vivid flavors and a quality presentation. The grills and kebabs are just great -- strong flavors and aromas, and nothing is overcooked (and that includes the chicken). \n\nWith so many crap \"Mediterranean\" places in the Richmond/Sunset -- Al Masri, El Mansour etc. -- this place really stands out for its quality and value. Now if only people would give it a chance. They even have Almaza, for god sakes! Go!", "author": "Wally N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-09-01", "description": "Good hummus and falafels. Lentil soup was really bland. Chicken wrap wasn't great - could have made it at home. Good ambiance - sat on some cushions which was cozy. Service was friendly but slow.", "author": "NS P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-03-19", "description": "**OVERALL RATING:  4 STARS ****\n\nSo the other evening, on a quest to find parking on Clement, as we circled the block 5-6....7 times...we had \"thought\" we were aiming to go to the Indian place across the street (but we'd been there many times before and already knew what to expect).   Finally, the parking goddess bestowed on us a great spot...as we're exiting my lovely auto, we spied \"Layaly\" from across the street with it's \"Under New Management\" sign...I had been to Layaly maybe 2 years ago and had enjoyed the meal...but frankly hadn't gone back because I have alot of other great places to go for Middle Eastern food and the parking stinks! \n\nAnywho...our group opted to go to Layaly...there were only a few tables occupied as we entered...very nice decor, banquettes on both walls, lots of tables and chairs but not so jammed in you have no privacy while dining...the kitchen is in the back corner (you can only see part of the kitchen but definitely hear the sizzle  = )    The man who greeted us was very friendly and seated us immediately.  Here's what we ordered:\n\n2 Al Hamra's (Lebanese beer) for my friends and a glass of Estancia Zin for moi.    The beer was tasty, the wine was ok...and not a very generous pour at that...My friend, after Beer # 1, wanted to switch, the very kind waitress said the other beer choices, my friend selected, they were out of it!!!  (They only have 4-5 beers to choose from as it is, so they definitely have to at least stock what's advertised)\n\nFor appetizers, we selected:  \n\nHaydari:  yummy garlicky yogurt dip*****10 STARS\nHummus*****5 STARS!! Creamy dreamy!!\nDolma    3.5 STARS (a bit soggy)\nFalafel:  ******5 STARS\n\nA Greek pita bread was served with these appetizers, warmed up, it's a bit thinner than Arabic pita and it was very good!! And plentiful!\n\nFor entrees:\n\nMixed Grill for me (Shrimp/Chicken/Lamb/Kofte  kebabs) interesting presentation, came with rice (very very small portion)  the meat was tasty...well spiced, the lamb was a bit chewy but the rest was quite good...I sensed it wasn't QUITE as hot (temp wise) as I would like...if you think of Chevy's fajitas, etc...where the meat arrives at the table just scorching hot...that's what Iike) It also came with grilled veggies...the tomatoes/onions/peppers...very tasty!\n\nMy friends both had Chicken kebabs...said the chicken was really good/tasty, but they too remarked on it not being super, just off the grill hot! Also lamented the rice portion was too small.\n\nFor dessert, I had the Kunefe (10 stars!!!! so DEE-LISH)\nMy companions ordered a plate of baklava to share and felt it\nwas a very small portion and not the freshest...not horrible or stale, just not that super fresh baklava that you expect and look forward to.\n\nAll in all, I would give Layaly 4 STARS!!!  It's a light/airy space (with a GREAT hookah back patio that stays open til 12-1am with tables/chairs/music/video screen)  a  young energy, comfy seating...\nArabic music playing in the dining room was really really good...not too loud but loud enough to hear it and appreciate it, totally matches the decor/energy.\n\nThings to work on:\n\n-  Keeping good inventory of beers offered\n-  Slightly more generous wine by the glass pours \n-  Getting the food to the table, SUPER hot\n-  Make the rice portions a bit larger...not enormous but enough to satisfy a very hungry person and/or to accompany the leftover kebabs(And at those prices)\n-  work on having MORE dessert selections and whatever you offer, make it super fresh/generous.\n\nIt's a new venture for the owners, only operating since October 2009...so perhaps they are still finding their way....definitely will go back again to see if they can earn the 5th STAR!!  = )", "author": "Karen S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-21", "description": "Awesome Lunch & Dinner. Delivery is fast and efficient. They've only messed up my order once. The owner handled it personally, delivered the correct item himself & let me keep the extra entree! Tre the meza sampler and the prawns are amaze-balls! Great Groupon too!", "author": "nic c."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-08-03", "description": "My husband and I had dinner here using Groupon. All in all, the food was delicious. We ordered the mixed platter, sea bass and one if the appetizers with hummus, which were quite good. We also enjoyed the ambiance and atmosphere there. The customer service was proper. However, a couple of things:\n\n1) No customer likes it when the tip is automatically added to the bill (18%). At least, we were satisfied with the service and had read this from previous customers' reviews, so we knew what to expect.\n\n2) the entrees came out sort if cold...\n\n3) the food is overpriced...$4 for an inch size square baklava. The tea was $3.50 as well.\n\nNote: they made a mistake and brought us somebody else's appetizer. They took it back, but after I mentioned I had already tried it, they let us have it...thank you, very nice of you!\n\nOur bill for 2 with the automatic tip and tax came to $50 with Groupon. I only had tea out of Groupon selection. Quite pricey, considering we had a Groupon..\n\nWould recommend this place, since the food was good and it is important. Be ready for a high bill though!", "author": "Mary E."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-03-07", "description": "I was a loyal Layaly customer for years. Just tried again under the new management and was unfortunately disappointed with some of the changes.\n\nI have always ordered the meza platter and it was delicious. The new version is lacking punch - and especially missing the Squash Dip and Red Ezme and Tabouli components. The Bourek which were a new addition were too chewy (maybe lost their heat in transport). The falafel were ok. It all tasted pretty one dimensional in comparison to the original meza platter. The portion was distinctly smaller (especially since there were fewer items) and only $1 cheaper than the original version.\n\nThe Layaly salad was also altered and not improved upon. First,  when composing salads you want all the components (minus the lettuce) to be about the same size. In the new Layaly salad, there were 6 inch long ribbons of carrot (bad idea), and 1/4-inch diced cucumbers (way way too small) and mixed leaf salad that was ok but none of it worked together as a salad. The original Layaly salad had mint, parsley and scallions, and smaller crisp pita - no carrots - it just had a brightness and textural combination that worked. The dressing is the same (thankfully), but it was more a green salad than anything remotely Mediterranean. \n\nJust kind of bummed out about the changes and not sure this will merit another trip across town - which by the way I am willing to do for epic food.\nMaybe the hookah is the \"hook\" now", "author": "Mariangela S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-03-14", "description": "I liked the food. The guy was nice. The place was neat. Everything was clean.  The girl was strange though. I bet she's somehow related to the owner though..or else she would've been fired already! She's gotta be the slooooooowest waitress/table setter/server I've ever seen! It's like she's so concerned with the way she looks while doing everything...it's unbelievable.  \n\nWell, it doesn't matter I guess cuz the rating isn't about her...it's about the food and overall feel.  I just had to comment about her because she was kind of annoying me...just floating around me so slowly while i'm eating, it was damn distracting, like watching a sloth move.  I wanted to pull out my whip and start whipping her to speed things up.  But more realistically, I wanted to just grab everything from her and do it at my lightning speed so that the whole tormentingly slow scene was over with already! so that I could enjoy my meal without feeling weird about a slow moving sloth slugging about.\n\ndid i mention the food was good though? yea, it was.", "author": "Tu L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-01", "description": "Got the moussaka- everything's homemade inside the dish and it was delicious! Also good to note- Layaly's moussaka is vegetarian! To make it perfect, it could've had a little more spice, in my opinion.", "author": "Haley P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-03-15", "description": "I loved the food, and the atmosphere.. even the timing being served was a well above the norm, considering the food is really at a nice deal.   Maybe I was really tired, but what I might have as the greatest gripe is the darn darn DARN menu.   Its night, the light is kind of low, you are tired, you weary, you get your glass of water and then you get presented with a menu.  My gosh.. this menu, which is written in a font next to impossible to read, plus its very hard to understand.    I couldn't tell where one meal ended and where the next meal began.  I saw $13 but never been there before, i couldn't tell if you got this giant spread of everything in one platter or what.    So after the explanation, the waitress was so kind, and helped me not feel like a total rube.   \n\n-so the appetizers come flying in, then also the main course.   Tasting away.. the food is delicious.   Rice, veggies, and I had this lovely trout.. it was indeed spectacular, with lovely color and taste.   Like I said, thirteen bucks later.. awesome deal. \n\nIll be back here.", "author": "Tito Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-04-03", "description": "I'm not a hookah smoker, so I can't comment on the quality of their hookah, but I will say that I like this place. Good staff and great food, especially the Baba Ghanoush...yummm keeps me coming back.\n\nAnyways, here is how I sum up my 5 stars.\n+1 good food\n+1 great staff\n+1 clean\n+1 hardly ever crowded\n+1 I'm coming here even though the parking is a pain, so this place must be good.", "author": "Narina A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-12-23", "description": "$7 Lunch Special due to new management!\n\nMy co-workers and I came here for lunch and we all had the lunch special. The choice was between chicken kebab or stuffed eggplant. I ordered the chicken kebab. We also ordered the pita and hummus as an appetizer. The hummus was delicious! It was creamy with a dash or oil and seasoning. The food came relatively after we finished our appetizer. The chicken kebab entree came with rice, salad with goat cheese, and yogurt dipping sauce for the chicken. It was yummy and I would come back for the daily lunch special! If I come next time, I want to try the falael balls.", "author": "Jennifer D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-23", "description": "Good food and good people (this is what my 7 year old daughter wrote).  Consistent food and service.  Always easy to get a table.  Friendly staff. A go to neighborhood place for our family.", "author": "Jenny R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-03-19", "description": "Layaly's fairly clean, presentable, and the staff's super friendly.  The food's served on the plate in an aesthetically pleasing way, but, alas, like the food itself, it's nothing to write home about.  The Arabic coffee comes in a tiny cup and is more of a Turkish coffee.  Overall, proportions aren't to American diner standards, but in its defense, this isn't that sort of establishment.  \n\nThis is definitely a good place to stop by when you're in the mood  for a light meal while spending time with friends.", "author": "Sam W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-01-04", "description": "I was told by the ownership that it is under new management as of three months ago, and I am not sure how relevant the rest of the reviews here on Yelp are (anymore, at least), so here is my experience with the place as-of one day ago.\n\nI called at around 3PM to check if they were serving hookah and inquired about the flavors.  The person on the other end of the phone was very polite and even asked in how long they can expect me so that they can get a new batch of coals ready.\n\nThe front of the restaurant is mostly reserved for sit-down dining, and is very cozy and quaint, with the back dedicated to hookah (although I am sure they still bring food back there).  The back is fully enclosed, but is still outside (basically a deck with a roof and walls).  However, because they have a patio heater, it never got too cold.\n\nThe hookah I ordered (peach) was brought out very quickly.  It was well packed and had a good flavor to it.  There was no shortage of coals as the owner was bringing by more every 10-15 minutes and checked to make sure it was heating right.  \n\nIn addition, we had two glasses of Arabic tea which complimented the hookah and helped keep us warm.\n\nThere is a screen on the wall with a projector hooked up to a broadcast of football (soccer) games, as well as an XBox 360 (which patrons are allowed to play).  If you go there with four or more guests, you can ask for a deck of cards to play Tarneeb (a popular Arabic card game). \n\nOverall, I am glad this place exists.  If I still lived two blocks away, I would frequent it almost daily.", "author": "Serge S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-08", "description": "I enjoy the food at this neighborhood restaurant.  I have tried many different Middle Eastern food and the Kofta @ this place is the best.  It is tasty and juicy as well. The steak and lamp kebab are very good as well.  I also enjoy the eggplant Hummus.  Some reviewers complain the price is a bit higher than average.  But I will argue that the food is of better quality at this place. \n\nIn summary, good food, always has open table means I will go back for sure.", "author": "Benjamin H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-03-06", "description": "Good food and wine, but bad costumer service. The waitress push us out if the place", "author": "Irving S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-10-20", "description": "My friend had a flyer that advertised their $7 lunch special so we gave it a go. We ordered 2 of the kofta kabobs (beef & lamb), stuffed eggplant, 2 chicken kabobs (surprisingly really juicy!), sauteed chicken (my friend's like this one although I thought it was OK). The portions were smaller than I expected but the food is filling enough since it came with fluffy pita and a delicious side of salad. \n\nThe price especially high for the portions on our mezza platter, which was an appetizer sampler, as well as high for the side of hummus and baba ganoush that we got. I didn't get to try everything since we did family style among 6 of us but what I did try was good. \n\nI'm glad they deliver since parking is such a pain in the city but I think I'd just stick to the lunch specials since they're more reasonable.", "author": "Sabrina L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-06-05", "description": "Do not use a groupon here.\n\nEverything was cool except they charged tips for a party of two.  We were going to pay at least 18%, but it was an insult to charge insinuating that people who use\n\nGroupon\n\nare cheap and won't tip.\n\nThat's almost never happened to me.\n\nThe mousakka was good.\n\nThe desert was too small even for a nice restaurant.", "author": "Ron A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-26", "description": "Love this place. A true life-saver for nights when nothing but a Mezza plate will do. Free delivery PLUS 20% off if you order from the webpage. Delicious. The chicken soup is really unique too- great shreaded chicken and warm broth. Love, love, love", "author": "Jenni D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-01", "description": "We stopped for dinner here last night because we were in the neighborhood and drove by. It looked nice from the outside so we decided to try it. What a wonderful place. We were greeted with real warmth and treated superbly by the waitress. The food and ambience are perfect for a quiet dinner. I had the lamb shank, it was excellent (and huge!). The chicken kabobs were also delicious, as were all the side dishes. And the prices are very reasonable. We'll definitely be back.", "author": "Howard B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-11-29", "description": "I love that this thing was listed under the category of 'hookah bars'.  doesn't smell like one, and every time i've been here, i've never seen anyone bust out a hookah.  But what do I know?  \n\nI know this!\nIt's meh/A-ok.  But not 'meh' enough for me to say, don't go.  If you're coming out of your neighborhood to get Mediterranean, or you've got no experience with Mediterranean, come here once, but find a place that tops this, which I'm sure SF has.  Excellent Mediterranean food is worth finding.  \n\nHOWEVER, if you live in the neighborhood and want to eat something with lots of vegetably goodness and not a lot of fat sliding all over your plate, here is the spot.  Portions are not so huge that you leave this place feeling like an insta-self-made-type-ii-diabetic. \n\nAtmosphere is ok, nothing amazing.  Beer selection totally totally totally meh.  However red wine selection decent and not a complete rip off.  So there you have it.", "author": "betty b."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-07", "description": "Thanks to Groupon, we tried Layaly & loved it.\nThe food was 5-star, though we were annoyed when the service lapsed for 35+ mins. while the chefs frantically filled a HUGE take-out order.\nNevertheless, when the grilled rack of lamb (4 delicious lamb chops, medium done) was served, they were downright heavenly in taste and tenderness.  My friend's mixed grill was excellent as well.  \nWe had wanted the Chilean sea bass, but they were out.  We were told that they sometimes run out on a Monday evening.\nWe also had the very satisfying shrimp appetizer and house-made baklava.\nYes, we'd go again.", "author": "Vera P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-12-10", "description": "Hands down the best Mediterranean food I've had. Everything I've tried is delicious! the chicken kabobs are juicy and tender, made to perfection. The staff is super friendly, they make you feel right at home. I love this place!", "author": "Yael T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-14", "description": "I'm updating my review. I love this place. It's great for dates and bringing friends to. \nThe server with the bright and cool hair recognizes us now and is always friendly. Amazes me how they usually only have one server for the entire restaurant so it makes sense that it gets slower when they're busy -but coming from the service industry myself, can completely understand. \nWe always start with the mezza platter - I swear they have the best baba ganouj.\nTheir pita can be a hit or miss though. Sometimes it's a little hard and crunchy, and other times it's soft and chewy and delicious. It really depends what day of its cycle you get it on.\nMy entrees change with my mood. Sometimes the Tuna Salad is what I crave and it's so good. Perfectly seared Ahi with yummy greens, mini mandarins and cranberries. \nOr the Tajines are perfect for a cold, rainy or foggy San Francisco day. Sort of like a tomato stew with whatever protein/veggie combination you can think of. \nBaklava is delicious and they have a good wine selection - although I'd love to see more \"Mediterranean\" wine choices. My philosophy is, \"when in Rome\" so I love to try wines from where my food was inspired from.\nThey've started making unique cocktail drinks from wine and sake. They are worth a try and are very yummy. I got the Ginger Panda (a little different name and inspriation for a Mediterranean restaurant) but it was very good.\n\nLike I said, we love coming here and will for a long time to come!", "author": "Natasha V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-24", "description": "Came here on whim one day, and to be honest with you, that was a damn good whim. \n\nExcellent service, we had no idea what we were ordering, and the waitress clearly noticed this. She walked us through the menu and offered suggestions, which i might add were amazing suggestions that we loved.\n\n\nOrder:\n- Mezza Plate (A+)\n- Some other assorted Mediterranean dishes (B)\n\nI wish I could remember the names of what we ordered after the mezza plate, but i suppose that's how good the Mezza Plate actually was. It could very well be their signature dish, that's how its represented in my mind at least. \n\nI will definitely be back, I will definitely be ordering the Mezza plate again, and I will definitely remember what i order so i can update this post. \n\n[APPROVED]", "author": "Eric T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-07-16", "description": "We have ordered delivery a few times here and the food (kabobs, lentil soup, hummus) are pretty good.  The kabobs especially, but their consistency needs some work.  I have received delicious soft pita one delivery and hard obviously microwaved crunchy pita on another delivery.  I have received a full container of soup on one delivery and half a container of soup on another.  And when I mentioned this problem to the woman who took my next order she didn't apologize and provide exceptional customer service by saying she would ensure I received a full portion . . . instead she made excuses  . . . not what a customer is asking for.  Customer service 101.\n\nLayaly . . . I cant recommend you to people because I don't know if you are having a good day or bad day.\n\nWork on your customer service and consistency.", "author": "vanessa f."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-08-03", "description": "This place is awesome, Mohammed Awesome (our waiter). \n\nWe went in for hookah last night around 10 and stayed until past 11 (although they're supposed to close around then) there was still another group smoking too, and they let everyone stay.  \n\nWe got the guava and mint hookah (thanks to other yelpers who recommended it) and it was gooooood.  The mint was refreshing while there was a light taste of guava in it.\n\nThis afternoon we decided to get food here since we loved the hookah so much.  We got Kibbeh, Pita and Hummus, Dolma, Falafel and a beef and lamb kebab.  Very good.  Ahh soooo good. Our waiter was really really nice and attentive too.  He remembered us from the previous night so he told us to check out the back hookah room after our meal.  So we did and it's pretty sweet back there.  \n\nMohammed Awesome was also there chit chattin it up.\n\nLayaly is great, the food and the ambiance.  But, what really makes this place memorable is the staff.  They are friendly and personable.  I would go it just to kick it with them!\n\nI will be back, for sure!", "author": "Marisa R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-04-03", "description": "Absolutely some of the best Mediterranean food I've ever had in my life!\n5 stars for the food & service. We were fortunate enough to stumble upon this place after visiting China Beach & were blown away with how tasty everything was! We live in the East Bay, so it's a bit of a trek into the City, but after only 3 days we already have plans to return.", "author": "AirhornAnnie B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-09-12", "description": "I've been on a Mediterranean food kick lately and my fiancee realized this and bought the Groupon for Layaly. Its really close to where we live which was great. We went kind of early for dinner on a weekday which was nice cause we were seated right away and got parking right out front. The food was delicious and our waitress was super nice and patient with us when we couldn't pull up the code for the Groupon right away. We ordered the Mezza platter even though we had to pay full price cause it was excluded in the Groupon... everything was soooo good. We ordered two different fish dishes which were good, but when I go back, I will probably go with the falafel wrap. All in all, great experience and will definitely return.", "author": "Becky J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-11-25", "description": "I live nearby and wanted to try for a while...  the girlfriend and I know nothing about Mediterranean food so we were always hesitant, but we finally went in yesterday.\n\nIt was empty, but then again, it was 3.30pm on a Tuesday. The server was nice enough to explain the food.\nThe only thing in the menu that looked familiar was fried calamari; I wanted to order it, but he told us they discontinued it because it was not popular. Well, good thing because they now have a shrimp appetizer instead with a white wine sauce and some other herbs and feta cheeze and it was excellent!\n\nThen we got what I believe is typical Mediterranean food: a chicken kebab plate and a shrimp on a stick plate also. Both very good. It comes with a little yummy salad and some rice; we usually frown upon any rice that is not Thai jasmine rice, but this was really good.\n\nI tried some Turkish coffee at the end, which I have never had before. It's good, but strong (even though I like strong coffee) and they were nice enough to give me a cup of extra hot water and an extra cup so I could let my girlfriend try a little.\n\nI wouldn't say it's cheap, but prices are more than fair for that amount and quality of food. They told us they have a Hookah lounge in the back but we didn't have time to check it out... oh well, I guess we're just gonna have to come back then!", "author": "Vithiet L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-11-08", "description": "The food here is fantastic and the prices are reasonable. I've had two different servers and both were so hospitable and friendly. I really enjoyed the chicken kebab and the chicken wrap. The meat was tender and juicy, but very flavorful. I also loved their yogurt. They are open for lunch and the lunch prices are a great deal.", "author": "Natalie S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-06-14", "description": "We crashed this spot on Saturday night around 11 pm - my friend Amr called ahead.  My crew of 10+ people... Mohammed - the owner? Was nice enough to keep the place open after hours for us.  People had some Sheesha, coffee and I had tea - which was ok.\n\nThe Amr Diab blasted, the board and card games came out and the conversation flowed - we brought the baklava and it was nice and chill.\n\nOne thing that would have been nice is if the coals were taken care of more on the Sheesha.. some of my friends were disappointed in the fact the coals would go cold...and not be noticed.\n\nStill mad props for the hook up!", "author": "Alicia A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-07-07", "description": "I was amazed to find such appetizing mediterranean food way deep into the avenues.  This place was a shocker to me for many reasons.  For example, the food is excellent and reasonably priced. And, the place is never busy, at least the couple of times I have gone there. \n\nThe quality and freshness of the food is made clear with each bite. I've tried a lot of Meza platters and this one is by far the best!  Other favorites from my group are the chicken kebab, lamb kebab, and my favorite is the eggplant dish, its vegetarian. \nThere are a limited selection of desserts, but they're all tasty, however some being better than others, namely the chocolate cake, mmm good.  My only disappointment was the last time I was there I had the turkish coffee and it tasted watered down and not very good.  Although, the time before I had it it was good.  I highly recommend this  place.", "author": "Molly M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-28", "description": "Excellent hummus, fantastic lamb, and some little slow-cooked beef stew stuff was also good (don't remember the name, it's in the bottom middle of the menu).", "author": "Frankie S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-11-11", "description": "Quickie review after the change in ownership: same food, same menu for now, but about a 1/3 more food. Figuring its about $15+ for a kebob plate, that's a welcome change.\n\nAnd they deliver now! Whoo! Meat on sticks to my door!", "author": "Stacy J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-19", "description": "Hubby and I just moved to the Parkside and found an awesome Mediterranean place that delivers! Enjoyed the mixed grill plate for two, as well as dolmas, feta and olives, delicious baba ghanouj, and yummy cacik which is a yogurt cucumber sauce. My husband loved the warm pita bread (I'm gluten-free)... All delicious! Delivery was earlier than quoted on Grubhub.com and courteous as well. A bit on the pricey side for delivery but worth it. Just looked them up and found out they are a hookah lounge too! Planning to eat and hookah in person soon!", "author": "Rosie S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-09-20", "description": "We came here after being swooned in by their $7 lunch special, and left feeling that it was an okay experience. Not something we will be back to, but one that we were happy we tried once.\n\nIn terms of the food, we ordered the chicken wrap and the chicken kebab. The chicken wrap was very dry. Still decent, but clearly the weakest aspect of the meal. The chicken kebab on the other hand was great. It was juicy with a wonderful mix of spices. The meal was complimented with fries, rice, and a salad that came between the two entrees. The fries and salad were good, but the rice was a little overcooked.\n\nAs for the location, it was a little dirty inside, but nothing serious. The service was great though.\n\nAll in all, the place was a-ok. Its very pricey for a dinner option, but a decent one for lunch to try something different from other restaurants in the immediate vicinity.", "author": "Sami R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-04-13", "description": "judging from the other reviews I may have just got them on a bad night, either that or they don't put in much effort for delivery orders. Out of three things on order, everything was overcooked, the lamb was practically charcoal and even the tuna for the tuna salad that they had attempted to braise, was instead dry and overcooked.", "author": "Dov B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-06-17", "description": "WHY IS YELP DELETING ALLLLLLLLLLLLL MY REVIEWS?! WTF IS THIS BULLSHT!?\n\nSOME GREAT MEDITERRANEAN FOOD!!!!!! The food was sooooo goooodddd. I had the lamb kebob, and the lamb was cooked JUST HOW I WANTED IT TO BE COOKED! I also got some fries, yea i kno thats not the best thing to get but the fries were sooo fuckin good. Perfectly seasoned and the lamb kebob just got better. I was hoping the hookah wouldn't be shitty like A LOT of hookah bars in the city AND IT WASN'T! They really catered to my specific taste of hookah and how i liek to enjoy it. Also, its not some worker setting up the hookah, its the owners and they set it up SOOOO GOOOODDD. I will definately come back for hookah. It may not be a strict hookah lounge, but the set up is so much better than a lot of hookah lounges in the city. Also, some of the best arabic/turksih coffee in the city!!!!!!! Just becareful not to burn your tounge and spill ur coffee all over ur nice shirt XD", "author": "Hubert L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-04", "description": "I came here for a friend's birthday dinner last week. We were expecting to have a fun dinner with friends and then head to our respective homes. Little did we know we would still be there over four hours later!\n\nIt wasn't just the company I was with that made this night great...the restaurant played a large roll. We started off with the mezes platter with toasted pita bread that I adored. Then we got the shrimp (excellent!) and the crab cakes. I ordered the mixed grill - it was so huge it also made for a great lunch the next day. I tried my friend's beyhti (sp???) and I would for sure want to share that with someone next time! \n\nThe servers were WONDERFUL. So much personality and just added to the fun of the night. We capped off the night with a couple hookahs and some dancing. They even taught us some hookah tricks with soap water. \n\nAt the end of the night, we were even able to hook up my friend's ipod to their speakers so we could listen and dance to one of his playlists. \n\nOh! And $10 corkage for wine was much appreciated! \n\nI already told my friend that I hope she doesn't mind that I totally plan to do my own bday dinner there later this year! :)", "author": "Jen N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-06", "description": "Excellent food, great service. Exceeded our expectations, even baklava was fresh and delicious.", "author": "Tata A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-05", "description": "Food is good but bit pricey for neighborhood restaurant. The mixed appetite platter is great.", "author": "Hiroshi F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-02", "description": "Ordered from GrubHub. Food came an hour BEFORE the estimated delivery time very hot. They included a second Greek Salad in the bag (yum, lunch for tomorrow!) and everything was in reusable containers. Couscous, salad, and pita were great. I've found my new go-to place!", "author": "Kim K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-10-09", "description": "My wife and I love this place and come here every so often. We've been here for lunch many many times and might stop by for dinner one of these days. Their kabob combo plates are awesome.", "author": "Vlad F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-15", "description": "Stopped in here for lunch last Saturday.  Could not have been better.  Everyone left their plates about as squeaky clean as you can.  I had the salmon kabobs and can't wait to go back and enjoy them again.  Service was efficient, friendly and the food was, as I said above, utterly delightful.  Next time, fattoush will be in the mix along with those delicious salmon kebabs.", "author": "Donna H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-07-08", "description": "I have been here a couple of times and it gets better each time.  This time I tried the hammus and it was delicious.  I like the presentation and the staff explained what each portion was on my plate.  :)", "author": "Manhav B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-04-03", "description": "This is the type of place you don't want to Yelp, cuz you want to keep it a secret for you and your friends...\n\nFriendly, attentive, warm service\n\nSimple, authentic, welcoming atmosphere\n\nFresh, filling, delicious food\n\nSweet, pleasant, interantional background music\n\n*Bonus, there's a nargile room in the back with good music and a big screen to watch international soccer!", "author": "kelly b."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-24", "description": "It's definitely surprising how quite this place can be sometimes. I've always had a great experience when coming to Layaly's. The service is impeccable. The waiter is always super friendly and tosses a few jokes back and forth with myself and whoever I have gone with. The food, although not 5-star quality, is above average for Mediterranean food in the Bay Area. I also love the fact that it turns into a hookah bar at night. Parking is a little bit of an issue, but what part of the Richmond is easy to park in anyways?", "author": "Eila S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-02-07", "description": "Hands down, the most populated restaurant in the outer Richmond on Clement last night. \n\nWe were a bit weary when we arrived at 6:45pm, and there was only one other group. However, throughout the course of our dinner, the whole restaurant filled up, and there were people waiting for our table. Obviously, Layaly has \"been discovered.\" \n\nWhy is this place so great? \n\nFirst, it's a family business. My mom loves playing the, \"Oh, I bet that guy is the father, and those are the children. Oh, and she's so skinny. I bet she's a vegetarian.\" \n\nSecond, the menu is simple and straight forward. Start with the $15 mezza platter, then pick a kabob. My parents had the kofta kabob (on the dry side, but it means that they are lean!), while I indulged in the mixed grill (two shrimp, kofta, chicken, and lamb). They are served with rice or fresh fries, and a salad to start. The sweet cheese dessert is totally worth the wait. YUM! And the house wine (merlot or cab) is a mere $4 per glass. \n\nThird, the interior is warm, inviting, and clean. I love the wood and light fixtures. \n\nPick up and delivery are other options.", "author": "Misha F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-05-26", "description": "Let's just say that I'm amazed of how unique and creative this place is. This place has a really nice combo of a restaurant in the front and a hookah lounge in the back. I'm a huge fan of Falafels and haven't had any for years so I decided to get it with some side of fries. Presentation was neat, customer service was excellent, and the food was great. \n\nNext time I'll be back for some Hookah.", "author": "Isaac B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-12", "description": "Absolutely delicious & wonderful service. A more formal dining experience compared to King of Falafel (which will remain as my fave, but this place is a close 2nd). Will be returning to Layaly next time I'm in the neighborhood!", "author": "Lynn m."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-04-19", "description": "Mezza platter was good.. Main course was not that great.. may be we ordered the wrong stuff!! But, it was OK!", "author": "Neetha V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-13", "description": "Excellent service and food was great!   we were a party of 4 so did family style so we can try it all!  \n\nOrder two appetizers-\n 1) Hummus Billahm-sirloin, onions, peppers served on a bed of hummus- delicious!   \n2) Mezza platter- comes with 4 small types of hummus- roasted eggplant,  garbanzo blended with herbs & spices, parsley with tomatoes, and onions, & a fried fillo dough stuffed with feta cheese and parsley.  I didn't care for Parsley, so  this was just \"ok\" for me. \n\nTried 4 Entress: Chilean Sea Bass, Lamb Kebab, Beef Kebab, & Chicken Kebab..\nAll were good, except Chicken was a tad on the dry side.. but then again, most chicken are!  \n\nBaklava:  Average.. not outstanding ...\nOverall we had a wonderful dining experience  with excellent service! \nYes I would come back again!", "author": "Susie C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-07-28", "description": "Great food great service! kabob dinner for two is just right with enough to take home!", "author": "Akiliano T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-08", "description": "GREAT lentil soup, just ordered it to-go but the online ordering feature was prime.", "author": "Lauren K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-03-17", "description": "Had this delivered for the first time tonight - AWFUL.  The pomegranate chicken smelled so god-awful I couldn't even stomach trying it.  The vegetarian couscous was so bad - honestly it seemed like cooking school 101 failure.  The phillo/feta appetizer was meh, very bland.  The lamb shank was ok - definitely the high point of the meal but I've had much better before.  I ate half of it and didn't want to eat anymore.  $65 and I ate about $10 worth of food and will throw the rest out it's so bad.  And what can you say about a Mediterranean place that can't cook couscous well?  How did ANYONE give this 4 or 5 stars?  Totally beyond me.  Go to La Mediterranee if you want good Mediterranean food - it's miles better and the entrees are probably $10 cheaper per plate.", "author": "Michael D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-10-07", "description": "Tried to use a Groupon that I had purchased.  The initial presentation was great.  My pre-purchased Groupon included an appetizer, two entres, and dessert.    We got our appetizer and dinners.  Then it got a little busy.  Our server decided that we no longer needed any service.  Her tip was already guaranteed.  She had other \"real\" customers.   Even after I walked up to the server station and pleaded for our dessert and the check, we were still ignored as she attended to other tables for several minutes.   Finally when she did come over with our dessert and the check, she put them on the edge of the table, leaving our large used dinner plates still in front of us. As she did this, she explained that the tip had already been added to the check total.  I said I wanted someone to take our used dinner plates away, and this was regarded as some kind of excessive request--I mean after all, I was merely a Groupon customer, not a real customer.   The wretched service ruined the whole experience.  Avoid this place.", "author": "Philip R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-05-01", "description": "This is by far the best Middle-Eastern place in the Richmond. Came here with my buddy before going out on a Saturday night to grab a quick bite to eat! However, after looking at the menu, it was game on! I had the chicken wrap, lentil soup, beef kebab, and baklava. The food was well prepared and presented. The seasoning on the meat was subdued and not overpowering, yet present to the palate. The chicken was well marinated and complimented beautifully with the traditional yogurt based tzatziki. The lentil soup had a good amount of cilantro and ginger to give your senses a real kick. And the beef was medium-rare and absolutely amazing. This place deserves five stars - no doubt!", "author": "Taj M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-19", "description": "Layaly serves good mediterranean cuisine with a California twist.  Recently, I went here for dinner and have been keeping this place in mind for a special occasion.  My friend who has been busy at work with travel was in the neighborhood so we went!\n\nFor starters, we got the Meza platter.  The platter includes 6 different dips such as hummus, baba ganouj, squash, tabouli, and a couple others.  Falafel is on the platter too.  I like how it was served with pita triangles.\n\nFor our entrees, we each got the beef kebab and mixed kebab.  The mixed kebab was served with shrimp, beef and kefta.  You are given a choice of rice or French Fries.  I chose the rice which had pine nuts (very good).   Both kebabs were very tender and delicious.\n\nFor dessert, you are given a choice of mediterranean selections or California cuisine selections.   We each had the kunafe (cheese pastry served with crushed pistachios and light syrup) and a dulce de leche (I think).   The kunafe was a bit oily but the other was pretty good.  Both desserts were topped off with Turkish coffee, which was not as strong as I've had it but still very good.\n\nAlthough Layaly was out of some items (like the grilled fish, lamb and baklava), what we got as alternatives were very good.  Will give their lunch menu a try too.", "author": "Janet H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-04-09", "description": "Been here twice already, the service is good and the lady that helped us was great at recommending wine and food. I always get the mix grill platter- mixed grilled meats-chicken, lamb, beef. The appetizer Mezza Platter of various dips are wonderful. The protions are real good and the prices are reasonable. This place is small and cozy, not too busy but can get loud (which did not bother me).", "author": "X X."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-04-03", "description": "Nice clean and color-coordinated inside (except for the amateurish paintings of Venice) that gives a tasteful impression.\n\nWe went very simple one early Tuesday evening: One mezes platter and one mixed grill dish. Seven dips with olives and chicken peas arrived on starter plate, arranged in a circle were a few spoons of delicious taste experiences such as Baba Ganouj, Hummus, sauted tomatoes, et cetera - all came with warm pita bread pieces. Yummy, specially the very white dip that tasted plate-lickingly fantastic!\n\nThe main course was succulent lamb, shrimp and beef/lamb-ground meat from a skewer with what I would consider the ultimate French Fries. They were not frozen, but fresh and crispy! A salad of fresh romaine and tomato pieces on the same plate rounded things up.\n\nIncluding tip, we left the place with a check of less than $35---mind you, we only had ice water and no coffees/desserts (the Creme Brulee served in a chocolate cup looked maahvellous!) and we did share the two courses we'd ordered.\n\nService was prompt, courteous and not overbearing. A perfect small meal of Mediterranean Cuisine and a great place to have a conversation!\n\nWe'll be back with a bigger hunger and space for two desserts...", "author": "Wolfgang S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-20", "description": "The wrap special with french fries is great and under 9 bucks for dinner! It's pretty quiet in there during the week so I take it to go on my way home from the office. Hit the spot!", "author": "Ashley A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-09-24", "description": "I found my dish at Layaly to be only ok. I ordered the \"tender beef\" dish which was more more rubbery rather than tender, but the red sauce it came in was good. My wife ordered the vegetable kebab which she enjoyed. \nOne thing that kind of bothered me was that we ordered our dinner and then ordered a starter salad. We only found out later that our dinner came with salad. Ideally, it would have been nice for the waitress to remind us while we ordered.\nPrices are reasonable, and our waitress was friendly, but not a place I'm dying to go back to.", "author": "Steve H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-08-21", "description": "Really cute inside--yay! not too many people in there--hmm why? \nfood-good, not excellent, but definitely solid and filling. \nservice--excellent, helpful. i would definitely go back for more! and i loved the meat, and the yogurt. and the homemade knafeh. oh and the mint tea! yum yum", "author": "Natasha F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-06-11", "description": "Service: Good, attentive. Waitress was helpful in recommending what kind of wine my friend and I should choose for our meals.\n\nFood: Tasty, good portions.\n\nPrice: It was okay, a little on the pricier side for me, but I think my meal was worth it.\n\nAtmosphere: Simple, somewhat classy, but clientele could dress casually.", "author": "Helene K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-30", "description": "GREAT Middle Eastern Food. Top ingredients. Very good execution. Nice ambiance. Good background music. Attentive service. Portions are too small, though.", "author": "Ayala K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-08-17", "description": "Tony and I just stumbled upon this place while driving down Clement, trying to find some place to eat at before heading to the beach.  We took a look at the menu posted outside and as soon as we spotted a \"People Love Us On Yelp\" sticker, we were convinced.\n\nWe came here for lunch, and  their lunch special prices are very reasonable.  We ordered the Meza Platter to share, Tony got the Grilled Eggplant Sandwich, and I ordered the Falafel.  The presentation of the food is really nice, but my falafel could have used a little more flavor.  I took a bite out of Tony's eggplant sandwich though, and it was delicious.  If I wasn't feeling pretty full from the meze platter and pita bread, I probably would've swiped his plate.  A girl's gotta do what a girl's gotta do.", "author": "Jen L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-07-24", "description": "This is the most lovely Mediterranean place in the Richmond!!\nThey have very delicious and fresh entrees, desserts and a lovely modern decor. \n\nPut aside the food, when you walk into the restaurant, ask about the following...\n\nThe secret to this place is the fabulous hidden hookah bar in the back patio ran by the super nice owner Bara. Bara operates the hookahs from 8p - 12 am M-F and 8p - 2a Sat & Sun. The place is very chill and relaxing, offers a GREAT variety of hookah flavors, beers and wine. It is not so popular because they don't advertise and so not many ppl know that there's a hookah bar in the back.. well.. now you know and I think it's better than that place on Haight - noisy and you don't get to sit at the tables to hookah til after 10:30 pm.. wth is up with that?", "author": "Catalina C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-11-02", "description": "Yelp failed me. How could a place with such great reviews have such terrible falafel??\n\nBurnt, heavy, and tasteless = not my idea of deliciousness. Although the sampler platter was arranged very beautifully, the dips on it were also just mediocre. Mediterranean places should, as a rule, have AMAZING hummus and falafel, and Layaly disappointed on both fronts. If my friends and I did not have a restaurant.com certificate that made our meal really cheap, I would probably have been more upset about paying so much for such disappointing food.\n\nThe fries that came with my friend's sandwich were really good though. But I wouldn't recommend a kind-of-pricey Mediterranean place to someone for their awesome fries...", "author": "Karen L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-11-05", "description": "Fantastic.  Everything just fantastic.  \nWent on a weeknight, so it was pretty empty  (which I never mind...empty=better service)  \nGot the Borek-fried fillo dough stuffed with feta cheese and parsley.  Seriously, if that description doesn't get you, let me say that this was possibly one of the best things I have ever eaten.  I dreamed about it for night afterwards.  \nAlso got the Layaly Mix Grill-kofte, chicken, beef, lamb and shrimp.  Very good quality meats, nice grilled flavor, and excellent spices.  That being said, I am not a huge huge meat fan, though my companion is.  He loved everything on this platter.  Personally, I could have just have like 8 orders of the Borek.\n\nAfter dinner we went into the back for some hookah.  Totally different atmosphere.  Very relaxed, with group of arabic guys sitting around playing cards.  Projection screen with the arabic top 40 music videos playing.  We got ourselves a deck of cards, ordered a hookah (with Lemon Mint Shisha. Good, I also recommend the watermelon flavor) and tea.  I have to note, I am not a smoker, and I hate the feeling of smoking (cigs or other).  However, this is smooth, cool, and easy....as sign of a well packed hookah, which is an indication of a great hookah bar.  Well done. I think we sat there enjoying the atmosphere for over an hour.  Great way to spend an evening.\n(The only possibly complaint is that you are not allowed to eat where you smoke.  Oh well, I guess it is a permit issue)", "author": "Anya W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-04-12", "description": "Just finished a Layaly takeout dinner and it was really terrible.  We've had food to go from here in the past and it was usually good, but tonight it was so bad that we're done with this place.  We ordered rack of lamb rare, and it was beyond well done, totally shriveled, dried out and tasteless.  Also got a mezze platter, and it didn't taste fresh and the pita bread that came with it was dark brown and so hard you couldn't even bite into it--we could barely break it in half.  Everything was lukewarm.  The whole meal had obviously been prepared, then left to sit out, then reheated in the microwave on \"High\", then sent out for delivery on a long, long voyage.  Sorry, but this place isn't what it used to be.  Too bad, it used to be really good.", "author": "Nancy K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-10-10", "description": "Seriously, where's the flavor?  I went there for lunch today and spent about 20.00 on a flavorless chicken wrap and the eggplant spread. Meh!  No flavors and so expensive for lunch. Why didn't i go elsewhere???  Plus, the sparkling water was of course Pelligrino, hello 3 additional dollars for lunch. But the table water was warm. yuck.", "author": "Shelley K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-09-29", "description": "Why isn't this place more packed?  The food was great here.  The place is clean and comfortable.  The staff are very nice.  \n\nI shared a baba ghounouj with warm triangles of pita bread and had the Layaly burger - ground beef and lamb with lettuce, tomato and a side salad and yogurt sauce.  M. got the mixed grill and it was good but I think mine was better!  Great for lunch or dinner.", "author": "Betty L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-04-08", "description": "I have ordered the same takeout from here before naan, hummus and grilled shrimp.  It has always been nothing special but OK .  Not tonight.  Naan was so hard I could have used it as a frisby.  Shrimp was over cooked.  Last time I order from here.  Bleh.", "author": "Sunny P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-07-26", "description": "I finally found great Mediterranean food in SF. Awesome food, fair prices and good service. The Chicken Pita sandwich served at lunchtime is excellent. A generous portion of white meat chicken rolled into 2 crisp servings of pita, makes this one of my favorite sandwiches in the city. \nTwo thumbs up!", "author": "Zach D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-23", "description": "Went here randomly and we had a great time, atmosphere was nice, quiet and the food was awesome!", "author": "Larry B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-04-20", "description": "I have one thing to say about this place: Om nom nom nom.\n\nThis place is clean, the service is excellent, and the food is absolutely delicious.  The lunch specials are a great deal, but the dinners are a little expensive, hence the one star off.\n\nTheir hummus is freaking amazing.  Kebabs are also wonderful.  The best part by far?  Their dessert.  My friend and I had no idea what we wanted, so we told our waitress to surprise us, and she brought us some baklava (some of the BEST I've ever had) and the tres leches cake, which was a-ma-zing.\n\nI'm sad that the place doesn't get much business.  It's a clean place with great service and food.", "author": "Tori S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-09-25", "description": "Mmm tasty!  thumbs up for the kofta kebab and rice - oddly enough cranberry juice was a nice accompaniment (i wasn't loving the wine list).", "author": "Julienne G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-09-20", "description": "Let me set the scene: Got off work late. Tired as hell and even more grumpy than snow white's dwarf. Picked up my best friend. My stomach was eating itself inside out from hunger. We wanted Mediterranean food. And FAST.\n\nI was disappointed when all we could find was this fancy restaurant. It didn't look fast or cheap. I was so hungry that I was invested the minute we started looking at the menu outside. Ordered a humus plate for appetizer and my friend and I ordered a beef and lamb kabob and split them. The food (despite my irritable demeanor) was amazing! The meat perfectly tender, the french fries tasty, and a delicious salad. Oh, and the pita was warm and delicious.\n\nI was pleasantly surprised, the food was great. I do however, wish that there was a take out falafel place around the richmond/sunset area so I could get my humus fix quickly (maybe i should just hook myself up to a humus IV....that would be quick....)", "author": "Molly W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-11-05", "description": "Being Lebanese I am jaded. So this place is also Lebanese, the french fries are a dead give away. Sitto always served fries/rice, sometimes both. This place is good, but it depends on what you order. \n\nThe hummus was made with 100% olive oil, they use plenty. Not reduced with vegetable oil. The bread was warm and very flavorful.\n\nThe Seafood offering of the day was excellent. It was a huge chunk of Bass grilled perfectly, brushed with what must have been olive oil and lemon and something else? Like something you would find at a top notch seafood place, priced accordingly. Served with assorted grilled zucchini, grilled ripe sweet tomato,  bell pepper choice of an excellent moist rice or FRIES, all seasoned to make your mouth water. \n\nThey need to change their meat supplier. \n\nI ordered the Lamb Kabobs- ehh, lamb is lamb. I ordered it medium rare. The meat was only ok. Not as tender as you would expect and not as flavorful either. I was disappointed. It was seasoned ok but not fresh then again its fall, this time of year lamb is spotty.\n\nTotal bill was over $50!!! no drinks. Wow. Sitto would have blanched!", "author": "William H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-05-19", "description": "Even though it's only a half a block away from my apartment, it took a while before I finally tried this place. What a delightful surprise! Tried the lunch special sandwiches and the appetizer sampler. Really tasty food! Also had some tasty beer that I'd never had before called Almaza.\n\nBest way to end the meal there is with the Turkish Coffee. So delicious!\n\nI'm disappointed that I didn't know about the back smoking patio with the hookah, it sounds fun. I'm going to check that out the next time I go. \n\nAlso, the restaurant was very clean with a nice decor, and the service was fast and friendly.", "author": "Chelsea H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-11-29", "description": "This place is good.  I was originally going to give them 5 stars, but I went back again and was going to give them three, but I figured I'd take the average.\nThe wait staff is nice and friendly, although for some reason the second time I was there, the owner (?)/host didn't seem to remember that we had previously engaged in witty rapport so there was a few awkward moments.\nThe good: I enjoyed the spartan, yet neat plating.  The food was tasty too.  I had the shrimp kababs and then the kofta kababs  (The kofta tasted good, but I have nary a clue how it should taste, but it filled up).  I also enjoy the tight little mound of rice you can get, that even stays together after a couple of forkfuls.  Nice.  The rice pudding was good too, as well as the falafel, which is what I was craving when I went in here.  You'll leave full and happy, but not over-full or overjoyed.\n\nThe bad:  The house wine tasted like the best balsamic vinegar that I had ever had, however, I couldn't really put it on my salad, so there you go.  Also, I wouldn't get the baklava.  There are better things on the dessert menu (which eerily reminded me of the fluoride menu that my old dentist gave me in my early childhood.  Weird.).\n\nNotwithstanding, the place is way better than I had hoped and better than some other restaurants in the area, which I plan to review shortly.", "author": "Ricky R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-09-11", "description": "it's not a place to go once, it's a place to go periodically, everyday, and never get enough, why:\n\n1. the food is addictive, in a nice way, really good dishes out there, they know what they are doing\n2. they are very friendly, amazing service, with a smile stuck on their face all day long\n3. it's a place to chill after 9, a place to hangout and listen to some arabic music before 9, amazing place to dine all day long\n4. it's my personal favorite in SF, GIVE IT A SHOT", "author": "Amir E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-05-03", "description": "LOVE this place. Great food, great apps, great service. Clean restaurant, and the service is wonderful.\n\nI loved their rice pudding, and really enjoyed their fish special.  I will go here again - it's one of my new faves!", "author": "Jennifer U."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-04", "description": "My sister-in-law and I, in the last-minute decicsion (since we initially wanted some Italian, but they didn't open for lunch) opted for this neighboorhood restaurant. And it was such a great experience!\n\nHere's my breakdowns:\n\n1. The food & services: This is my first time to have a mideastern meal so I have no comparision! We came around 1pm so it wasn't crowded at all. The service was fast. The waiters were very friendly and helpful. We had mezes platter (see my photos) for appetizer, it was very good. Then we ordered the \"lunch special\" items: Lamb Kebab, and Eggplant stuffed, $7 each (I believed!) The lamb was so tender! Then we had the \"Kunefe\" for dessert. \n\n2. The dessert: OMG! I had Buklava many times before, but this dessert is my favorite now! It looked like a slide of salmon at first, but when I used the folk to get a piece, its cheese filling was just like from pizza, and it's kind of hard to separate it from the whole thing! It has grated pistachios on top. It's so rich. I loved it!!\n\n3. The price: It cost almost $40 for 1 appetizer, 2 lunch specials, and 1 dessert!\n\nI'd give 4.5 stars for the food, 5 stars for service, 3 star for the price. Overall, it deserves 4-star rating! And I'd come back very soon with my friends!", "author": "Vivian L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-10-26", "description": "GO TO LAYALY! Like Betty l, I have no clue why this place isn't more packed. They're open for both lunch and dinner on the weekends (not sure about during the week). \n\nThey make a number of middle eastern dishes but with a twist. They have on their mezza platter the ordinary hummus, baba ganouj, falafel, etc. but they also have ezme, which is traditionally much heavier but they made it similarly to the baba ganouj but with roasted red peppers, DELICIOUS. They also have a squash puree dip as well, it was fantastic. \n\nMy husband had something called Biety (?)  Kebab which was a twist on Kafta...wrapped in a pita-like tortilla and with a sweet tomato sauce on top (served with raita).\n\nThey have had a great write up in SF Gate \nhttp://www.sfgate.com/cgi-bin/article.cgi?f=/chronicle/archive/2007/12/05/FD1GTLH3V.DTL\n\nI would hate to see it close, the family that runs it is so sweet. Go patronize this neighborhood gem!", "author": "Carson H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-06-14", "description": "Ambiance was quite nice.  I liked that the front windows and the sky light let in a lot of light.  I personally like the natural light.  \n\nWaitress was nice, but seemed a little fake to me.  I guess it's okay since she didn't exactly talk shit in front of my face... hah she walked to the back to bitch to the chefs because my friends and I sat there for like two hours for a lunch.  I don't feel bad because the place was pretty empty and we ordered quite a bit of food.  \n\nOkay, so this place would have gotten maybe a 4 because the food was decent and the place was really clean and well-lit.  \n\nSince this IS a Mediterranean restaurant, I expected some damn good falafel.  But nooooo.  The falafel looked like big balls of turds.  They were burnt on the outside and totally mushy on the inside.  Basically, bad falafel = bad restaurant.  \n\nMAKE BETTER FALAFEL!", "author": "Anna T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-02-17", "description": "I've been to this place a handful of times and cannot understand why it is always a ghost town.   For the quality of food, this place should be jumpin'!  If I had to live off any food for the next year, it would be the Meza Appetizer Platter.  If you're like me and can't decide between the babaganoush, the tasty-as-hell squash dip, the hummus, the tabouli, the roasted red pepper/eggplant, and the tzasiki, you can have it all on the Meza Platter.  Love it!  Their lunch specials are pretty good and I recommend the Layaly burger (served between a pita bread).  The turkish coffee is a good ending to the meal, but all their desserts are phenomenal as well.\n\nI deducted one star only because their backside patio kinda' sucks.  It's dark, has picnic tables, and simply makes me feel like I have stepped into mafia territory.  I think if they spruce it up a bit, it could be a big hit.", "author": "Bharu J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-04-29", "description": "Finally, I passed up India Clay Oven and tried Layaly.  It took some effort \nsince I LOVE Indian food and the great buffet there.  It was rather late in the afternoon, though, so I crossed the street and decided to indulge my hankering for baba ganouj.  I walked into a completely empty restaurant and was greeted warmly by owner, Maher Damous, who hails from Jerusalem.\n\nI was very impressed with the cleanliness of Lavaly, everything neat and in order.  He handed me an extensive menu with dishes, he explained, from Jordan, Lebanon and the Mediterranean.  There were choices to suit all tastes.\n\nI settled on a cup of lentil soup which was tasty but a little bland.  The \nmeza platter was utter delightful and so beautiful, I regretted not having my camera with me.  It was so visual, with its mix of colors and textures.\nEach scoop was delicious - hmmus, baba ganouj, tabouli, haydari, red ezme, falafel, and a yellow squash dip, served with pita bread.  I would never come here without having that meza.  Fit for the gods.\n\nI finished off the meal with an excellent Turkish coffee and a tres leche \ncake - I've had much better tres leche.  I suspect their baklava, made on site is superior.  Next time, I will go with the baklava.\n\nI will definitely return in the near future - with a friend - so we can sample more of the menu.  They have assorted kebabs, grilled fish, and an extensive sandwich menu, as well.", "author": "Carmen H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-06", "description": "There's a saying in the South, \"Makes you want to hit your mama,\" that is only spoken after having eaten something truly spectacular.  I've loved every falafel, shawarma, and feta pita I've ever had in my 16+ years in SF, but the chicken wrap from Layaly makes them seem like so much cardboard.  Bursting with crisp, fresh vegetables, and loaded with tender-yet-crispy chicken which had been subtly spiced and obviously cooked over an open flame.  The falafel was also superior (ate one of those in the same sitting,) and the dolmas were great, but the chicken wrap, well, you know how the saying goes.", "author": "Sid B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-21", "description": "Okay, so I may have already written a review for this restaurant but it is amazing! They have definitely come a long way since they first opened and I am so glad to them getting business. \n\nTheir food presentation has definitely improved and seems like they are trying new things in their recipes. The sautes are great to have when you are sick or having upper respiratory problems but they are EXTREMELY filling. I realize that may not sound very appealing but trust me, go there when you are feeling icky and have a saute. I guarantee that you will come out filling nice and warm and at least a little better. \n\nEvery time we go we get the same waitress. I believe it is only her and the waiter. But she is always nice and the service is always wonderful. \n\nAs much as I love this place I really wish they would improve their dessert menu and their nonalcoholic beverage selection.", "author": "Kayla H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-10-23", "description": "If you're new to eating Middle Eastern food then this place is perfect. The menu was very generic and catered to an American audience. Not a place to go if you're looking for traditional Middle Eastern dishes. \n\nAmbiance: Warm and inviting, not super dimly lit, but no florescent track lighting. The walls were painted a subtle cream color and there was art along the walls. They played Arabic music which totally gets you in the mood to eat (and dance).\n\nFood: The basics koofta and kebabs. They do have a mezza platter as an appetizer where you can try about 4 or 5 different dips along with a couple falafels. \n            Presentation was very nice. They took time to decorate with mint and stacked the kebabs very nicely. \n           There was enough food, but not in abundance. Arabs like to EAT and so i think a good measure of it being a real Arabic restaurant is how much of something you get. \n            Inexpensive wine that pairs nicely with all dishes!!\n\nService: Attentive and very friendly.\n\nI would recommend for first time Middle Eastern eaters. However, if you want to try more traditional dishes I would go to Oasis Grill or Fattoush Restaurant in Noe where you can get mansef and fasolui.", "author": "Rana A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-05", "description": "Fresh, delicious middle eastern cuisine. I went with a large party and the waitress was attentive and patient. Her recommendation of the Lebanese beer to begin with was \"spot on\"! The hummus, stuffed grapes leaves and pita bread were sublime. I had steak kababs and they were flavorful and delicious. All ten of us were very pleased with the food and the service was exceptional. Can't wait to return.", "author": "Veronica A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-01-22", "description": "Another gem in the Outer Richmond Clement area. We were walking around the neighborhood looking for a new place to eat. The restaurant is clean and nice and our waitress was really sweet.\n\nWe had a glass of the house wine for $4 (sweet!). He had the beef kebabs and I had the Chicken Tekka (mine were better). We shared the butternut squash hummus (a must!) with pita bread and the feta cheese and parsley deep fried with filo dough (you can skip that one). Our meal overall was really yummy and filling. Appetizers are about $4 and the entrees run anywhere from $13 - $24.\n\nI would definitely recommend coming here on a date or to hang out with a couple of close friends.", "author": "Jane C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-08-16", "description": "I just moved to the neighborhood and after a hard day of moving I decided to check out what was around the block. I stumbled aupon Layaly. \n\nMy friend and I were served by the owner and he was so courteous! I ordered a beef kabob and bab ganoush. It was my friend's first time trying mediterranean food and he liked it. The rice was real nice, i personally would've liked the beef to be a little more rare but it was still tasty.", "author": "kimy l."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-03-26", "description": "The food is here is quite tasty.  The spring roll filled with cheese is a great bite.  The various dips they offer are very tasty.  I find myself combining dips and smashing a falafel in between the pita. Yummy!\n\nThe french fries they make are actually done right! Nice and crispy. I wished they had truffle oil to lace it with, or some kind of Parmesan creamy dip. The Combo platter will give you a whiff of the many things they have.  I find the lamb very tasty on one visit, and sort of under seasoned the next.  \n\nThe kofta -or ground meat sticks if i got that wrong, are what gets me coming back here.  I love the meaty texture and flavor of the bite.  Chewy, herbacious, with the light acidic tang.  \n\nI was lucky to have tried the Chilean Sea Bass one night and that was a great skewer.  Perfectly cooked, charred, and paired with a nice grilled tomato.  The sweetness of the tomato match great with meaty fish.  I just wish there was more rice!\n\nAll in all, the food is tasty, prepared correctly, and fair priced.  The atmosphere is warm, the service friendly, and dining area is not too loud.  I've walked into the back patio which was very spacious, exclusive, and intimate.  The covered patio, is stocked with heat lamps and plenty of seating, enough for about 30 people.  They also have a projector too.  I understand they do catering and private parties.  It be nice to have a celebration here someday.  This is food done right.", "author": "Phat Hippo L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-12-17", "description": "So Layaly has changed ownership recently and they've been doing a great job so far lately! The food has gotten better. The lamb kabobs with rice and grilled vegetables are delicious! I LOVE THE RICE HERE... the flavor of the rice is so good. What's in it????? nom nom nom nom! Layaly also becomes a hookah bar at night! Great place to hang out after hours!", "author": "Brian P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-12-04", "description": "Shoot I should have taken a shot of the place.  It's way out on 25th and Clement and it was a nice charming little place.\n\nWe got there early as I was dining with my pops who was spending his last night in SF until he headed home to 'Bama.  \n\nAnyhow, we both got good meals, my dad got the stuffed eggplant which he liked although it was packed with so many flavors it was hard to enjoy each individual ingredient.\n\nI had something that was beef and lamb all rolled together into what looked like sausages on skewers.  The meats were very tasty and more filling that it appeared when the dish first landed on the table.\n\nOverall a good deal - the two of us had salads, our entrees and a beer apiece and it was just about $35 plus tip.", "author": "Gene X."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-04-25", "description": "Good food, great service.  \n\nCan be quiet inside, sometimes can be noisy - it really depends on how busy.  Hit or miss.  \n\nNot a lot of quiet and clean middle eastern places in the city who want your business.  This place does.", "author": "Dong T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-19", "description": "As you probably know, \"Mediterranean\" covers a large range of countries and cooking styles that are similar, but also subtly unique.  The cuisine of this restaurant hails from Jordan.  \n\nThe falafel sandwich has just gotten better now that they are wrapped in a thin lavash bread instead of the thicker pita.  The falafel balls are perfectly flavored and nice and crunchy.  It also includes hummus which is not very common which makes it more filling than others.  Though I have yet to find a falafel better than Truly Mediterranean.\n\nOddly enough, the french fries you can get with the sandwiches are the best I've ever had.  They apparently use special fresh potatoes and a double-fry them to make them perfect.  I only with they would give you something to dip them in other than ketchup.\n\nThe Layaly Salad is very flavorful for a fairly traditional salad that is served with crispy pita chips.  The olives in the salad are certainly amazing.  I'm not even a big salad person.\n\nI really like the Turkish coffee.  So why Turkish coffee?  Apparently it was the closest the owner could find to his favorite from back home.\n\nTheir baklava is also the best I've had.  Very rich in flavor and an awesome flaky texture with fresh ground pistachios on top. Mmmm!\n\nMy only complaint is that the Clay Oven is right across the street.  Layaly is the healthier, cheaper, and quicker option, but the greasy, exploding flavors of Clay Oven are sometimes too hard to resist.\n\nI give this place 4 stars because all the food I've had has consistently been great, the staff is very friendly and accommodating, and the facility is very clean.  I haven't ventured into the alcohol or the dinner menu yet to feel comfortable giving it 5 stars, but I'll update this if I do!", "author": "MS C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-03", "description": "I love Layaly, I ordered a lot of time and I am never disappointed.", "author": "Jenna M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-06-06", "description": "I have been wanting to go to this place for months since I walk by it all the time on my way to and from various other places on Clement. Finally, I popped in for lunch with some friends this Saturday.\n\nWhen we walked in the place was dead (I don't think they get a lot of lunch traffic on the weekends). So we got a good table right by the window and they started up the culturally appropriate music just for us. I really like the atmosphere in this place. There is good art on the walls, and the large windows make it seem very open.\n\n I think the owner was our server and he was very attentive and concerned with our well being. I have been in places were this is simply not the case when it is slow.\n\nThe menu seemed somewhat limited to me but the prices were good (keep in mind I am talking about the lunch menu). The chicken sandwich I got was quite good. The chicken was a fairly thin cut but it was very tender and well flavored (not quite grandma's motherland cooking but close enough). Where Layaly really shines is in its desserts. I had some of the best rice pudding I have had in a long time. It was nice and thick unlike the runny stuff you usually find, which seems more like heavy cream with sugar and rice dumped in it as an afterthought. This pudding was gourmet.\n\nI don't know if it is ever busy, because most of the times I walk by it is kind of off peak hours, but I hope they stay in business. I plan on going back for dinner soon.", "author": "Peter F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-09-08", "description": "The food here is reliable, delicious, and affordable!  I can always count on Layaly to satisfy my baba ganoush craving.  The pita is fresh and warm, and they are never stingy with replenishing it.  Salads are refreshing and I'm a fan of their fries.  I still have a lot of other things to try on the menu!\n\nParking usually isn't too bad during lunch hours, but during the weekend, it may be harder as there are many restaurants in that area.", "author": "Michelle W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-12-14", "description": "We went to Layaly for dinner and it seemed fairly inexpensive from the menu on the door; however, when we got inside, the prices had skyrocketed. \n\nDon't go here if you are hungry because the portions are EXTREMELY small for the price. I got the greek salad ($8) and there was barely any lettuce. Also, they couldn't seem to make a falafel sandwich, plate or pita for dinner (claiming that everything was put away at lunch); however, the falafel APPETIZER seemed to come on top a piece of pita (why they couldn't even try to accommodate is beyond me).  \n\nOverall, I would not go back for a second visit unless they lower prices or jack up their portion size.", "author": "Julie G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-05-02", "description": "Really fresh and flavorful food! Generous juicy cubes of meat on the kabobs, hot toasted pita triangles, and satisfying portions, filled my head with question marks of why the place wasn't packed. But, being that it's relatively new and on a strip that's predominantly Asian-fared, no doubt that people will sniff it out from beyond the 'hood, once discovered/established. \n\nVery reasonable prices for the quality of dining experience you get. Even the fries were excellent!  I'll definitely find my way back, even if it's out of the way.", "author": "Bibi B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-08-09", "description": "My girlfriend and I come here probably once a week. The service and food are ALWAYS consistently awesome. The meats are tender and flavorful;  I like the lamb kabobs the most. We often get the Meza Platter which has hummus, baba ganush, tabouli, a labane dip and a couple more. I am Israeli so I have a critical eye when it comes to hummus! It has never failed me. Another favorite of ours is their baked eggplant topped with Layaly's own special marinara sauce and cheese. BUT WAIT!....... Their Turkish coffee is worth the price of the meal :-) \n\nIf you are lucky, the waitress will read your coffee grinds.", "author": "Jennifer And Uri W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-12-07", "description": "Went there recently for my office holiday lunch.  We all (7 people) chose items off the dinner menu because it came with bigger portions.  In the beginning we started with the Mezza Platter and it was very good with a wide variety of different appetizers.  We all decided to have kebabs and ended up sharing so I got to try the lamb, beef, chicken, and kofte.  All were really tasty.  The service was fine. She refilled our glasses with water quite often which was great.  Prices are very reasonable.  This was the first time we all had Mediterranean food and we will definitely revisit this great restaurant!", "author": "Stephen W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-01-24", "description": "I went here the other night for a small dinner with pops and the bro, and I think we ended up doing alright there.\n\nThe hummus was fairly standard, the falafel was hot and crispy (mmm), there wasn't enough pita bread (standard at most Medeteranian places), and the kebabs were a little over priced.\n\nI ordered my lamb kebab medium, and it came that way which was a treat honestly. The fries with it seemed like real fries, but they weren't that great, so I guess next time I'll have the rice.\n\nOur waitress was very friendly, but didn't know a whole lot about the food.\n\nTheir wine selection seemed reasonable too, although I didn't have anything. I'm gonna come back another night, especially since its convenient.", "author": "Tom S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-04-22", "description": "The food was a little pricey and the portion are small.   But the food was pretty good so I would definitely come back again.  I would probably skip dessert next time.\n\nMeza platter - this was delicious.  They gave us a ton of warm pita bread \nThe entree comes with salad and rice or french fries.  We were not a fan of the dressing used on the salad but the rice and the french fries was really good.\n\nRack of Lamb - really good\nMixed grilled plate - the shrimp was really good but everything else was just ok\nLamb on a skewer - my brother liked it\nSalute Chicken - a couple pieces of the chicken was a little tough but the bowl that it was served in kept the chicken nice and hot the whole time.  The sauce it was cooked it was really good and went really went with the rice.\n\nThey spent a lot of time with the presentation on their dessert. \nRice pudding -this was really bad.  I love peppermint flavor but not in my rice pudding\nDouble chocolate mousse? - this was ok\nLa trie ***?  this was ok", "author": "L C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-09-15", "description": "I want to throw in yet another good word for Layaly. The Meza platter satisfies and the warm pita triangles are perfect for when you're not eating bread but you really need to cheat. I will say that both the Lamb kebob and the rack of Lamb aren't as tender as I would like so I've settled on the Kofta kebob which is delicious. If you like yogurt with your meat, their Hydari is sooo good.\nThe mint tea with sugar makes me happy AND there's a very sweet and lovely brunette waitress there during the day. I'm sold.", "author": "Nina M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-11", "description": "Great food ! try the mixed grill its phenomenal", "author": "Sulaiman B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-04-16", "description": "I was delivered food  from this restaurant using GrubHub. I made it clear in my order of a falafel, fries and a salad ($24) should have NO TOMATOES (I am allergic). The meal arrived 50 minutes later and both the salad and falafel had tomatoes, the fries were cold, and there were no utensils or napkin. I was in a hospital ER and had no access to cutlery to eat the salad. I called Layaly and was told a new falafel would be sent out on a rush. 30 minutes later, the same delivery person arrived, handed me the to-go container and began to rush away. I said, \"Wait! Where are the utensils/napkin?\" He shrugged his shoulders and said I had to request them when I placed my order and immediately left. I was unable to eat the salad (feta cheese in fine crumbles, oil-based dressing) and upon further inspection, found cherry tomatoes halved on the very bottom. Being in a hospital Emergency Room could have been handy in that had I eaten the salad, I would have gone into anaphylaxis. The food? The falafel was smallish and rather flavorless, the fries were not bad and salad at least looked good. I will never order or eat at LAYALY again.", "author": "Michelle M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-02-21", "description": "Would love to give it more stars, but I didn't get what I expected.  On the menu when one orders Musaka you expect lamb.  When I started eating it, all I got was potatoes!  MMM...when confirmed with the waitress that Musaka is suppose to have lamb in it, she said it was a vegetarian Musaka.  Then say so on the menu.  It is not \"Musaka\" but a \"Vegetarian Musaka!\"  didn't think I had to read every ingredient on their menu.  I know what is in Musaka.  Should have expected something was off when Moussaka was spelled wrong.  Won't be going back.", "author": "G J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-02-06", "description": "Just discovered this spot today- what a find! Great food, nice decor, and the two guys who run it are absolutely hilarious. They talked us into an after-meal Hooka in the back, which was a nice way to relax after eating. The back area is a very cool space- they keep it open till around midnight so if you're looking for a hooka spot I recommend it. Apparently they also show soccer matches back there in case you are a sports fan. I'll definitely head go back.", "author": "Megan C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-07-05", "description": "layaly has such amazing food and it's priced well too! The owner is awesome and  the service was superb!! I'll have to come back the next time I visit SF.", "author": "Natalie M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-05-08", "description": "Had an excellent lunch at this lovely restaurant the other day. It was quite empty and I wonder why more people haven't discovered it. \n\nThe Meze Platter was fresh, flavorful and beautiful to look at. The contrast of the various spreads -bright yellow squash,  red tomato, green tabouli, clean white lebneh, earthy smoky eggplant, with dark brown falafel in the center, were a delight to the eyes as well as the palate. There is enough to easily satisfy 4 as an appetizer.  I had the lentil soup which was flavorful and filling but perhaps a tad too thick for my liking. My friend had the salad which she thought was crisp and loaded with flavor. It came topped with crunchy pita triangles.  All in all a great place and worthy of a repeat visit to try some of the meat dishes we didn't get around to.", "author": "Ash A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-21", "description": "Layly serves great mediterranearn cuisine at a reasonable price. We came here for dinner Saturday night because, thanks to Yelp, and had a great time. \n\nThe restaurant is small and intimate, but the service was quick and attentive. The food was very tasty. I had the Biety Kabob, which was awesome!", "author": "R H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-05-30", "description": "Deliciously tender and flavorful lamb kabobs and rice. The tabbouleh and ezme were only ok. but came with warm fluffy pita that i really enjoyed. The only rub is that its a bit pricey for the portion size, but the quality and taste make it an occasional indulgence.", "author": "Stacy T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-19", "description": "The lunch special ($7) is a great deal: kebab of the day, rice, and salad. Pretty yummy. The kefta kebab is one of the best I have ever had, and the chicken kebab is moist and tender. Went once for dinner and got the mixed grill for two. All the meats were delicious (particularly the lamb), but the order was so large, we brought half the meats home. This is not a complaint, by the way.\n\nWe live in the neighborhood, and it is about a block from our apartment. Will definitely go back.", "author": "Geri J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-04-14", "description": "wow, was really surprised by this place.  love it for the below reasons and for sure will be going back:\n\n-clean\n-spacious\n-friendly service\n-appetizer sampler was so good, we mopped every drop off with our -piping hot hummus (i think it's unlimited refills)\n-entree sampler was also awesome - everything was cooked just right, -not greasy, and tasted really fresh.\n-greek salad was classic, yet tasty and a  good portion\n\noverall, a pleasant experience and delicious food.", "author": "Josie M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-02-15", "description": "The food at Layaly is delicious and very fresh. The service and atmosphere is inviting. I have brought many of my friends to eat at Layaly and they keep returning to eat there as well. Then they bring their friends and family because they like it so much. That alone says something about the restaurant. Try it out and I guarantee you will also go back again and again.", "author": "Ilana G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-06-04", "description": "I wanted to like Layaly more, really I did. It's such a lovely restaurant, both inside and out. Clean, bright and welcoming ambiance. The service was fairly quick and waitress friendly and attentive (water glass always full). Those are the good attributes... \n\nUnfortunately, not much good can be said about the food. My companion and I ordered the filo wrapped appetizer with cheese and herbs. When it arrived I thought maybe they had the order wrong as they appeared more like mini egg rolls. Edible, but a bit on the bland side, and soooooo not what I expected. The chicken kabobs I ordered were nothing spectacular. In fact, the chicken wasn't seasoned enough and was quite dry. The vegetables weren't very memorable to say the least. Thank goodness for the yogurt sauce that I used to drizzle over the kabobs...but even that was below par. The order came with fries and while I enjoyed them (probably the best thing we ordered), they did taste very frozen (think they didn't even thaw them, they just put straight in the deep fryer). My companions meat dish looked like a stew and when asked how it tasted, he proclaimed, \"Not super flavorful.\" And that my friend, is exactly how I would classify the entire meal...\"Not super flavorful...\" \n\nAgain, too bad because it's moderately priced, nice venue and service. Maybe it was an off day or we ordered wrong?", "author": "Marie B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-11-13", "description": "I finally found a place that serves lamb kebabs just the way I like them.  Nice portions too, and the grilled vegetables had great flavor.  I tried several appetizers too ... 2 of them were good, the other was just ok.  The dining area is pleasant, comfortable, and nicely decorated (love all the dark wood).  \n\nOnly 4 stars because I originally wanted fish but they were out of fish :(\n\nAnd, the restaurant was pretty empty when I was there and an employee must've been smoking out back because the restaurant smelled of smoke during the last 10 minutes of my meal.", "author": "C C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-02-11", "description": "Beautiful place excellent service the food very very good.great music and it's quiet and comfortable..The taste and flavor for the hookah great. beautiful and comfortable light ,that a great experience", "author": "Rami A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-07-23", "description": "We stopped there for lunch and loved it! Prices are really reasonable for what they serve and the food is great. The stuffed eggplants, lamb Kebab and wraps are mouthwatering!!! :)", "author": "Silvia M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-13", "description": "Layaly depends on the day you go. We went a few times when the owners and their friends were hanging out after hours. That's when you want to be there. They flirted with my sister, and one of them even ran across the street to get us a pack of cards. \n\nWe tried going one time when the owners weren't there, and it didn't go too well. I don't remember exactly what happened... but I think it was after hours and they wouldn't let us stay for hookah.", "author": "Ryan B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-10-13", "description": "Love this place. Delicious food, great ambiance, and friendly service.", "author": "Jessica P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-06-21", "description": "Layaly is DELICIOUS. My fiance and I love exploring all the restaurants in our neighborhood, and we wound up at Layaly one weekday evening. It was DELICIOUS. I was definitely a fan. Unfortunately, it's a bit pricey and I found it to be pretty loud inside, despite the fact that it was less than half full. Still, great food, great service... what more could you want? And, the house cab was REALLY good... and cheap :). Next time you're on this block, and if you can resist the Indian food across the street (which for me, is TOUGH), try out Layaly!", "author": "Bridgette A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-08-24", "description": "I really don't have much to say about this place.    Its never busy, the food is not that exciting... actually the place is not that exciting... its not very welcoming.  I've eaten  this style of food many times all over California and I love it.  My guess is that this place will morph into something different.  If you are good along Clement, you should be packing them in nightly... this place doesn't do that.     A restaurant should always start with the food, not the decor.  The decor is nice, but in SF, decor is a hard thing to sell of your food doesn't back it up with a punch!!  The food is not bad, but it doesn't want to make me come here again and again. There is something missing here, I just have visions of this place being empty all the time.", "author": "Demanding T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-12-07", "description": "Really yummy food and GREAT service!  Just don't get the baklava unless you're ready to pay like $7 a piece for it!  The falafel is so crunchy and delicious!  It would be a nice a place for a date because the entrees are nice to share and it's a place you could easily sit and talk for hours drinking wine, snacking on the yummy tidbits and enjoying each other's company.", "author": "Chloe B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-02-15", "description": "DELISSH -- came here for my husbands birthday and we LOOOVED it! He's middle eastern so he's hard to please and he was impressed! We're definitely going here again!", "author": "L O."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-10-15", "description": "strip mall\nquality food\n\nshopping mall\npresentation\n\nfancy mall\nprices\n\ndisco disco good good!!\nsound track", "author": "Dan M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-09-20", "description": "Mediterranean food by my house finally HELLS YES!!\r\nI do wish it was more like a cheap falafel type place that I could make  a staple of my diet.  So sick of Gordo's.  But I guess if they have to go all fancy smancy on  my ass I'll take what I can get.  Just not as often as I would like.  Damn my caviar taste, why don't you match my WAMU checking account balance?  You deceive me.\r\nWell, it's good anyway.  A nice sampler plate to start and some kick ass kabobs.  I'm docking a star due to the awkwardness of the service and timing, but its a brand new place so I'm sure it will only get better.  And the owner obviously knows how to work the  I-only-hire-cute-young-foreign-girl angle so noone really minds waiting a few extra measly minutes for their glass of red wine.  Or if they spill an entree in your lap.  Or rub hummus all over your back.  It's okay, YOU ARE SO CUTE with your little bangs.  Aww.  Never mind about that star, I GIVE IT BACK!", "author": "Starla D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-05-27", "description": "Went here for lunch.  Had a nice salad as well as a chicken kabob.  The Salad was great but the chicken had some kind of weird clove spice to it that I didn't like, although it was cooked well and was tender and juicy.  Don't miss the authentic Turkish coffee.", "author": "Mitch A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-20", "description": "The food was simply delicious. The waitress was friendly and very competent.  And the prices are reasonable.  What a find!", "author": "Margery N."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-04-19", "description": "I've eaten at Layaly a number of times with friends and family in the past and was very impressed with the food. I got a 25% coupon in a mailer recently and decided to take my wife there again. I found out when we got there that the restaurant was under new management and I was disappointed that the quality of food was not the same. \n\nWe started with chicken soup and it was really salty. Next we tried the Layaly Mixed Grilled because I wanted to see how the new owner prepared the various meats. (I didn't realize until we got home that our entree suppose to come with salad. They didn't give it to us.)  I recalled that the meats in past visits were cooked to perfection but this evening everything was overcooked and dry. \n\nI'm at a lost on why our dinner experience was so different. It could be a cook's bad night, my use of the coupon (hint: don't present it until they finish serving), or new management.", "author": "David Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-10-07", "description": "Layaly is a hit or miss joint.  I would definitely give the green light to the Haydari, the Hummus, and the Layaly mixed grill, although the lamb, which was spot on in terms of texture, was a little bland, which is also why I wouldn't recommend the lamb kebab.  The beef tantoni was also a bit of a let down, you can get twice the amount tomato beef fried rice for half the price.  The beer is cheap ($3), the service is great, and the dining area is spotless.  I'd give Layaly an additional star for upping the flavor and another star for lowering the price.", "author": "Tony L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-01-23", "description": "I think the food here is pretty good but they might be asking a bit much for it. The lamb kebab was good and the meat was done in the manner that it should have - but the fries were not particularly great. Also I thought the sauce with the kebab probably could have been better. The falafel appetizer was good - I cut up the little balls and put them in the small slices of pita for some mini wraps. Hummus appetizer was pretty good but it was nothing extraordinary. The service was friendly and prompt, so I will probably come back here in the near future to check it out again.", "author": "Sven S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-10-13", "description": "Decent price for good food. The place is quiet and the server was very helpful. Didn't even know they have a hookah bar until the waiter mentioned to us. Definitely a must try.", "author": "Bob C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-03", "description": "The service here is always great and the place is quiet. The quality of the food is very good, however, the menu is pretty basic. However, if you are in the mood for a tasty falafel wrap, this place will suit that craving. I go mainly because it is the only Mediterranean restaurant in the neighborhood.", "author": "Holly F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-06-09", "description": "If you are a table of two, I recommend the meza platter and the skewer combo. This makes for the perfect night out! The food is all so good!", "author": "Laura C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-10-30", "description": "Healthy Mediterranean food. Fresh vegetables and meat. Not oily. Tasty seasonings. Decent prices.", "author": "Robert S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-04-30", "description": "The flavors need to be more developed, they were too mild for me. I felt the baba ganoush could of used a little more garlic and the yellow squash dip was also missing some flavor. The staff was nice and the place was clean.", "author": "Ericka A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-09-20", "description": "don't get me wrong. i thought the food was good. unfortunately, this long awaited opening just doesn't quite do it for me. though i think they did a decent job on my kafta kabob, i think for the amount you pay vs the amount get is just not worth it. i'm hoping that the owner will just be working out the kinks with his pricing, staff (waitresses need mad training, but you honestly can't blame them), and quirks that are plaguing this place during its first couple of opening weeks. \non the bonus side, the owner did say he was going to open a hookah bar on the back patio. i may return to try the hookah. good luck to them, and i hope they figure it out :)", "author": "Aly L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-05-20", "description": "Finally, we were able to check this restaurant out...I was suprised with the cleanliness of the restaurant and the very cozy design they have. I'm very impressed :) We didn't know it would a small fancy restaurant. \n\nThe food was great. We ordered the following: \n- eggplant hummus (don't ask me how to pronouce or spell the real name of it b/c I can't.) This very simple dish but delicous. It came with small, cute and warm triangle pita bread. \n- kofta kabab- This is very delicious. How come when I make this it doesn't come out that way ;) \n- Mix plate (chicken kabab, shrimp and lamb)- The shrimps definitely had some kick to it. The chicken was cooked at the right temperature and very tender and so as the lamb. \n\nThe customer service was great and food was fantastic. The price is about right...come and check it out.", "author": "JM M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-03-26", "description": "Fattoush is what I would call this place.  They're specialty is the Layaly salad..hence their name, but I personally know this salad better as Fattoush.  Being of Lebanese origin myself, I'm always on the lookout for a good simple traditional middle eastern place where the flavours seem familiar...and this place is it.  The prices are good, not cheap, not over priced.  And the food has a lot of flavor and the portions are just right.\nWe went for dinner, the Layaly salad was great! The fallafel was very flavorful, hummus was o.k....throw in some garlic into that and it would be much less bland.  And the kofta kebab was juicy and yummy.  Rice was very much like the pilav I make at home...which was a good thing for me.  \nI'm surely going to go back over and over again since it's right near my house....I have to try the tabouleh next...that's always the real test.", "author": "Hagop K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-01-15", "description": "My wife and I are big Troya fans. We were here for lunch and the food was amazing. Would have preferred that they had unsweetened tea for those that are trying to cut back on sugar. However the food is very good - dare I say almost as good as Troyas? Try it out.", "author": "Glenn I."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-02", "description": "They deliver now, new owners (much better)... Good mix grill, rice with vegetables. I am looking forward to go to the restaurant to try some more food and have some hookah. I met one owner and he is very nice and cares about what the customer wants.", "author": "Sophia A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-07-07", "description": "Price matters -- this is standard Middle Eastern food with a 50% to 100% surcharge for cloth napkins. Truly Med should open a shop down the block and kick their butts. If you're going to spend this much, kick it up a little more and head over to Aziza, where the dishes have some originality to justify the cost structure. Places like Layaly exist so the upscale ooze from Lake can eat somewhere \"comfortable.\"", "author": "OuterLands X."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-11-21", "description": "The food was delicious. I had the stuffed eggplant and lentil soup. The soup had an olive oil drizzle and lemon wedge on the side. I've never had lemon juice with lentil soup before, and now I don't think I'd have it any other way. I'm a vegetarian who usually avoids eggplant, but I'm glad I tried it. The flavors of the tomatoes, onions, and feta were subtle and delicious while not over-powering. The mint tea was also perfect for the cold day. I'm definitely coming back and trying more food and the hookah lounge!", "author": "Kat O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-08", "description": "This is I think the best Middle Eastern restaurants we have been. The lamb couscous is to die for. Great ambiance of a bistro. Absolutely amazing food!!", "author": "Connie M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-02-01", "description": "I have two words:  MEZA Platter.  Get it.  It is by far the most wonderful thing on the menu.", "author": "Natalie S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-01", "description": "So good -- do yourself a favor and order kabobs for delivery.  Ourstanding flavors and so much food!  We come back to them all the time.", "author": "Mary F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-11-09", "description": "So my friends and I have heard marvelous things about this place, especially since the new owners have taken over.  We decided to go finally after our hookah craving was becoming unbearable to live with.  Boy were we glad to make the drive over there.  The restaurant itself is charming, inviting and perfectly lit. One of the nicest waitresses that I had ever had made sure that everything was just right, including waterglass always full, wine glass always full and pita bread galore.  The food did not disappoint either and man was there plenty of it. I asked the owner, who came over a few times to make sure everything was alright, what his favorite dish was and ordered that. A beautiful melding of lamb and beef on a skewer, grilled to perfection with an array of grilled vegies was magnificent and I could see why he loved it as well.  My friends got the Ahi tuna seared salad, which should not go unmissed. At 9 pm the hookah came to our table and we could not help but try to invite ever waitstaff person to join us...they graciously denied us, but just the fact that we felt like we were old friends in this new place gave us the motivation to visit again and again. \n\nIn short if your looking for fantastic service, phenomenal food, delicious hookah and penny pinching prices, DO IT.", "author": "Ashley W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-05-10", "description": "I love this place.  The food is wonderful, and moderately priced.  I don't know what else to say.  Try it!", "author": "Raphael R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-05-04", "description": "Have only been here once - Best falafel sandwich in the City. period.", "author": "Leslie R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-03-26", "description": "All I can say is: YUM!  For a girl that loves trying many different things during my meals, I found the meza platter to be amazing!  (I must say that I'm partial to the Haydari dip.)  The lunch specials are great-not too big, not too small, just right.  The place itself is cute, and I'm surprised that of the times I've gone there may have been only one or two other tables occupied.  Ordering take-out is always a nice option too...now, if only I can learn to pronounce the items I like on the menu.  In the end,  I would like to see more vegetarian options on the menu, but overall, I would say, give this place a try.", "author": "Alvina W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-06-02", "description": "Oooh, very good food.  Delicious pita and hummus!  I had the chicken skewers, served with rice.  Okay, I don't know what's in it, but the rice is soooooo good!  Our server was super nice, too.  The restaurant was not busy, which was nice too.", "author": "Sarah F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-14", "description": "I ate lunch here today with 3 friends. We all liked it a lot. The restaurant was clean and well-lighted and the atmosphere was friendly. The menu looked so good we all had a hard time deciding what to order. All the wraps and kebabs looked fantastic. 3 of us decided on wraps (1 salmon, 1 falafel, 1 chicken), and the 4th person got the kebabs. We were all really happy with our meals. Parking was a little tough, but it was worth it.", "author": "Janelle G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-12", "description": "Their homemade hummus is unbelievable!  As well the lemon chicken soup hits the spot.  This is a great local spot without a ton of tourists and lines.", "author": "Heather K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-09-18", "description": "Amazing food---best mediterranean in the City.  Wonderful service and a great place to spend an evening.  I recommend the mezza platter and the mixed grill platter.", "author": "Raman R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2006-10-23", "description": "This place needs a bit of improvement.  We ordered lamb, salad and chose the rice over the french fries.  (What is with the french fries?  There does not seem to be any other kiddie food on the menu)  The lamb was a little on the tough side and didn't really taste like lamb.  The rice was icky.  It just tasted like white rice.  The salad was ok, but I forgot to ask for the dressing on the side.  The dessert menu needs something that contains phyllo dough.  The noise factor was through the roof.  While tile floors are pretty, carpeting would help to dampen the noise (and make it easier on the feet and knees of the waitstaff wearing high heels).", "author": "Amy M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-04-02", "description": "Two of us went last night to Layaly, trying it for the first time with a Groupon offer and buoyed by some of the terrific reviews here. We had a perfectly good experience. The waitress / host was a charmer: efficient and clear and a nice personality. The food was good, not exceptional. I found the crab cakes tasty, my friend thought they were overseasoned - too much fenugreek. It was served with a tasty dip on a bed of nice greens. We each had skewers: mine were salmon and his, lamb. Both were well seasoned, tasty, overcooked and dry. Portions were generous; we each had a skewer left to take home. The accompanying rice was  just OK, the right texture and flavorless. The grilled zucchini and mushrooms were the best part of the meal for me. I thought they were terrific. Baklava was fresh and only OK. With our Groupon offer, it was a very good value. Without it, we would have been unhappy to have paid $60+ for this meal, with no drinks. Our waitress actually never asked about beverages and we didn't really think about it until halfway through the meal when it didn't seem to matter. She kept us well watered.", "author": "Donald O."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-06-07", "description": "We went here for hookah once after discovering our first choice wasn't open. The hookah tasted good, and stayed lit relatively well. The owner was there and was extremely personable. My first criticism was that we had to move halfway through our smokefest from the back room to the front. Totally a buzzkill, and I guess they do that because of trying to adhere somehow to a weird rule or something. The guys explanation really didn't make that much sense. Secondly, the beer and wine was sub-par and too much money. I know the prices get jacked up on alcohol to drink at a place like that, but I was drinking some 2 buck chuck for like $8 dollars. They only have 3 beers, and none of them really interest me. The price was a little bit high, especially considering they're in an area surrounded by many college students. Don't expect anything to look exotic or even exciting. The place is pretty drab. If you want to have a smoke in the area, though, I guess they're worth a try. I'm not really impressed.", "author": "Alexander W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-08-21", "description": "What I had: Hummus, Falafel, Chicken Skewers with Fries and Side Salad, House Wine, and Pita.  It was all really good and fresh.  Chicken was tender, hummus was creamy, none of my fries were soggy, and the falafel was delicious.   The atmosphere was quiet and the server was really nice.  An all-around postive experience, and I would eat here again.", "author": "Kari L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-04-24", "description": "I ordered delivery from this place.  The food was good, and if I were in the neighborhood and hungry I would certainly go there, but I think that Tuba (Turkish), Park Gyros (Turkish), Lavash (Persian), and Mazzat (Lebanese) are superior choices.  That being said, I haven't sat down at this restaurant and the experience could be different. I ordered the soup, falafel, kibbeh, borek, haydari, and the mixed grill.  I found the food to be clean, fresh, and nicely seasoned.  My favorite of the order was the shrimp, which had excellent flavor, followed by the haydari.  The falafel was ok, as were the kebabs.  The lentil soup was good but not great. I would not recommend the kofte or kibbeh- and definitely steer clear of the borek.  The borek, which was my least favorite had so little filling that it was almost hollow inside.  At first I thought it was a freak borek, but all the others in the order were the same.", "author": "N A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-06-08", "description": "I'm glad this place is close to me, and they deliver. There prices could be cheaper, especially considering the neighborhood, but the food is good.", "author": "Ryan M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-02-05", "description": "helloooo...is there anybody in here??\n\nlast time i came here for lunch, not one soul was to be found. hmmm...not sure why this place hasn't caught on yet, but the food is quite good and the ambience is very clean and pleasant. It's not everyday you find a decent mediterranean restaurant in the richmond.  you'll find that i get all giddy when there is another non-asian restaurant to open up in my neighborhood. don't get me wrong, i love my asian food, but sometimes you just need a little variety.\n\nanyway, on to the food.  the lunch menu is limited, but everything we ordered tasted very fresh and flavorful.  all the kebabs are delicious and they come with rice or fries and a light salad. The fries are made from real potatoes(no, not like the soggy in&out kind), are light and crispy, and just the way i like it.  if you want a non-meat item , i would order the eggplant sandwich, and I absolutely abhor eggplant, but this sandwich defies reason.", "author": "Jen C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-03-06", "description": "My husband and I had lunch here yesterday afternoon at 3:30pm and it was delicious!!!\nOur server couldn't be more more gracious.  First rate.  \nThe food was fresh and well prepared.   The atmosphere is relaxing and uncluttered.  This place is a gem!!!  We will be back!", "author": "joanne b."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-03-16", "description": "Great service.\nGreat atmosphere.\nGreat little hookah bar lounge area in the back.\nGet the kenafe for dessert.", "author": "A B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-09-06", "description": "what saved this review was the hummas... mmmm so good... and the pita bread was warm and fresh... the worse thing you can do to hummas is serve stale pita bread...so props to that \n\nbut the service... the girl seemed nice but not attentive at all... so it was hard to get her attention for something as simply as the bill or letting her know I was finished with one dish and wanted another \n\nthe squash dip... from the description it would make your mouth water... I tried a little and couldn't taste a thing... then i slopped a blob of it on some pita and STILL couldn't taste anything...let's just say cardboard has more flavor \n\nI'll go back though....for the hummas", "author": "Peta C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-03-28", "description": "My friend and I walked into this restaurant by chance. We were going to order something to go, but the owner started talking to us about his collection wine. His friendliness won me over and made me want to stay for lunch. We ordered an appetizer platter and a falafel. The food was outstanding and the service was superb. This place is totally out of the way for me, but I would go back in a heartbeat.", "author": "Pepper R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-08-26", "description": "I give it a solid B+.  The food was tasy, prices were decent, and the service was great.  However, it was really nothing to rave about and the food was a bit forgetable.  But, if your in the neighborhood and want some mediterranean food, this is a good choice.", "author": "a e."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-02-11", "description": "I love this place! Food is amazing! Make sure to try the hummus sampler platter with hummus and yogurt dip and other various dips so you can decide which is your favorite because you will definitely come back.  The deserts are pretty and tasty, and if you sit on the back patio you can enjoy a fabulous hookah", "author": "Janet H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-27", "description": "One of the best times I've had at a restaurant! Wednesday night it was very slow there but the food was THE BEST middle eastern food I've ever had with outstanding Hummas and Kebbobs. Arabic coffee was nectar of the Gods! waitress was super nice and helpful and the owner? Ahkmed (forgive spelling error) was a gentleman and stayed just for us to finish Hookah. Hookah was my first time and it was great! Had mint-Mellon.  Unfortunately a new wacky SF law will probably shut down most Hookah in the city by March. Well. I'll still come to Layaly for the great service and food.", "author": "David H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-06-04", "description": "Good food - had the mixed grill, Greek salad, hummus and falafel.  Presentation was exceptional (hummus was served on a wide white bowl, draped in olive oil, with a beautiful scallion(?) garnish!), quite fancy I must say, since I usually go to Sunset Deli or Yumma's.  Sunset has them on the falafel and Yumma's on price, but for a nice sit down Middle eastern/Greek meal, in a pretty atmosphere with an extremely pleasant wait staff - this is the place! Don't forget to have the Turkish coffee - twas delish!", "author": "Rita W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-09-29", "description": "I went here the other day for dinner and I really liked everything.  The food was SO GOOD, especially the hummus and the chicken kabobs. Oh and I forgot about the pita bread! It was really fresh and soft, and it was perfect with the hummus. The two guys that own this place are really friendly and super attentive.  They also have a hookah lounge in the back with a variety of flavors of shisha.  It was a little cold in the lounge, but I recommend the white peach- it was really tasty! I definitely want to go back soon, I found the prices really reasonable for the food.", "author": "Kate D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-08-18", "description": "A really pleasant experience. Reasonable prices for the food quality and comfy (and clean!) setting. The meza platter even won over my previously hummus-hating husband. Yummy hot pita, refilled as often as we wished. The mixed grill was a good first time dish - shrimp, kofta, beef or lamb skewer, really juicy chicken - mmm. Served with salad and tasty rice (or fries, but the rice is delish!) Servers were very nice, though one was a little inexperienced - and the parking is always a problem in the neighborhood, but it's well worth the trouble to drive around or walk a couple blocks!", "author": "Gale H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-04-28", "description": "We just wandered in after a day at Baker Beach and this place was so great - spotless, the food awesome, the service excellent, the prices soooo loooow... that after demolishing half the Greek salad we shared my sweetheart said \"I want to buy a lottery ticket here.\"  \n\n\"Hmm?\" I queried, digging more warm pita into perfect smooth fresh hummous... \n\n\"Because they wouldn't stoop so low as to sell a loser.\" he said, before biting into his lovely warm falafel sandwich with a side of fries and four pickle slices.  \n\nWe will look forward to it for after every nekked beach day.", "author": "Harley B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-02-14", "description": "Food is excellent. Nicely spiced and flavorful. We had the stuffed eggplant and the biely. Both were very good, a nice combination of tastes. Dinners come with fresh green salad that had a variety of real greens, not just iceberg or romaine. The turkish coffee is among the smoothest and richest coffee I've had in SF - and I'm a Blue Bottle drinker. Neighboorhoody atmosphere and confortable. Will definately go back.", "author": "Christina H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-08-09", "description": "Perhaps a bit out in the boonies, but well worth it.  Get the mezza platter and the kunufe you will go home happy.  We have been many times, and the owner always remembers us, and even the wine we have ordered before.  They have even made special dishes when the menu didnt have exactly what we wanted.  And, it has never been crowded.  You can usually get a gift certificate at restaurant.com, if you are wary of trying new places at full price.", "author": "Megan G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-10-22", "description": "Good food, really like the hummus.  A really fun place to hang out later for hookah.  The guys there are really cool and make it fun.  They taught us this card game that my friends and I play when we go.  Mohammad is a character; he always shows us a new card trick or magic trick each time.  Ask him about the toothpicks...", "author": "Henry C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-10-22", "description": "crisp small restaurant...outer richmond location....looking clean 'n' showing the tamed side to middle eastern cuisine....beautiful 'n' cozy the establishment....starting with $three stella (corona 'n' heineken the only alternative) 'n' lemon humus with toasty flat bread...creamy 'n' smooth with the taste of lemon...a marvelous combination in perfect harmony.....looking to maximize first time experience...budget efficient \"mixed\" the choice....samplin' of lamb, kofta 'n' chicken kabobs....fries for the side....house salad to compliment......notice the vinaigrette dressed salad greens pickin' a bit bitter for liking....but, fries 'n' ketchup a perfect golden brown treat.....for meal...kofta excellent 'n' seasoned right.....lamb most succulent, tender 'n' moist....finding chicken a mistake...not a fan of white meat poultry....a deal 'n' trade to taste the beef...losing out on the trade 'n' finding lamb definitely much better....overall..roughly $twenty per person meals....atmosphere 'n' service excellent...food good....", "author": "Hen A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-11-10", "description": "i really like this place, the food is good, love the atmophere! the waitress is very polite, and LOVE THE HOOKAH LOUNGE!!! i got the strawberry, and sex on the beach flavor, it took an hour to finish with 3 other people, and we were hella chillaxing!", "author": "Jessica C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-01-03", "description": "quality of meat was great, but the portions were really small for the price....and my clothes smelled like grilled lamb for a week.  there's better around...", "author": "Tabatha Y."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-12-04", "description": "great service but tasteless dishes. The entrees looked more appealing to the eyes than to the palate. Portion size was quite small for the price. I ended up  eating at king of thai 90 mins later.", "author": "cj d."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-02-15", "description": "Great customer service, fresh and delicious cuisine, comfortable atmosphere gives this place a solid five stars! We started with the Meza platter and tried the beity kabob...mmmmmm! Salad was light and refreshing...not lathered in fatty dressing like most restaurents. Amazing find and definitely something I'd take my guests to when they visit.", "author": "Danielle L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-12-23", "description": "Hmm, pretty good.  I can't say  it is the best and no where near the best Truly Med on 16th Street.  My whole in the wall beats it hands down.  I'm in the hood so it's good for that but not the best.", "author": "Misti L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-04-19", "description": "I gotta say,  I looooove Mediterranean food!  So, I was pretty excited to find this restaurant in our semi-new neighborhood!\nLayala offers a wide selection of Mediterranean/Middle Eastern food in a nice, warm atmosphere.  I love the food, it's always super fresh, light and delicious.  I'm not sure how long this restaurant has been open, I couldn't find a review on it.  Anyhow, 5 stars for freshness, very friendly service, consistent quality, and for being affordable at a high quality.  I had dinner here a few times, the kebabs are all very tasty and juicy, the appetizers are diverse and great, and the salads come with a simple and delicious lemon-juice-and-olive-oil vinaigrette.  Tonight I tried the grilled fish, served as kebab and superb (halibut, turned out to be on the expensive side - A.Q.) .  Oh yeah, don't forget to finish up with Turkish coffee and homemade baklava! :)  \nHad lunch here as well, great sandwiches and salads!\nDid I mention the food is very fresh?!", "author": "J R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-03-14", "description": "We live in the neighborhood and haven't been to Layaly in a couple of years.  We will definitely be back.  We ate there Friday night and had a great mean.  I had the cod with cous cous.  My son had the prawns and my wife had the eggplant.  The cod was probably the best I've ever had.  It was charred and tasty on the outisde; moist, juicy and tender on the inside.  My son (12 yrs old) stated his shrimp were the best ever and he's had lots of shrimp.  My wife really liked her eggplant until she tasted my cod.  Then she wanted that.  Portions were good - we were quite full when we left.  Everything seemed to be freshly made frorm scratch.  The dolmas appetizer were warm and quite tasty.  Nothing at all like those from a can.  The baclava was also warm and tasted home made.  It was so good, we had to get another order even though we were quite full.  Service was good and attentive.  I'm surprised they weren't busier given how good our meal was.  I did note the sign said \"under new management\" which could explain why my review differs from earlier ones.  We will be back within a month, I'm sure.", "author": "Joe J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-03-23", "description": "Everything was fresh and delicious!! The service was impecabble, ample portions and relatively inexpensive for a healthy, delicious meal.", "author": "Tim K. M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-02-25", "description": "Layaly always makes me happy.  It sounds good and always *is* good.  The Sitto here is always served  with fries or rice and sometimes both. The hummus is excellent  and authentic. The bread is warm and very flavorful. The seafood offering here is just as good what a usual top notch seafood place would offer and the priced accordingly. I almost always get the   Lamb Kabobs, so good and juicy.  It's reasonably priced, too.", "author": "Ron B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-04-21", "description": "cute atmosphere, attentive service (well, i hope so...we were the only ones in there!), great falafel and tahini, and elegant presentation. a little pricey for lunch, but well worth it!", "author": "N. M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-01-04", "description": "Our party of one vegetarian, one vegan and one very light eater chose this restaurant on New Year's Eve mainly because it was within walking distance to our homebase, and Mediterranean food tends to be veg-friendly and filled with tapas-style offerings. We were not disappointed: the light eater had the chicken soup, which she pronounced good; the vegan had the vegetable kebab, which he thought was tasty but looked to me like grilled eggplant, onion and potato piled rather gracelessly onto his plate.  I (the plain ol' vegetarian) had the stuffed eggplant, which was filled with a mixture of tomatoes, chopped eggplant, onion, and other savory vegetables. I thought my dish was quite good, though the eggplant's skin was tough and hard to cut.  We also all had dessert: the light eater and I split a chocolate mousse and the vegan had the baklava. We all thought the desserts were exceptionally good. \n\nHowever, this place really needs to be more attentive to service. When we walked in, our waiter was having a loud conversation with a friend, who was complaining about the lousy economy and how bad business was at the restaurant. We were the first customers in at 5 p.m. and were promptly seated and given menus. But the friend continued his long and impossible to ignore bitching about the economy, and our waiter was obviously preoccupied with talking, not serving. I had to prompt him to tell us what the fish of the day was (environmentally incorrect Chilean sea bass) and what the evening's specials were. I was also irate at being forced to listen to the conversation at the waiter's station: customers are NOT passive cows who don't understand or care what the staff is chattering about. I may not agree with your opinions, and I certainly don't like being ignored while I try to decide what to choose what's on my menu. Once the friend left, the waiter finally began to focus on serving us. But we waited 20 minutes too long to order. Things like this are the death of a restaurant, even if the food is good.", "author": "Eleanor T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-06-13", "description": "This was our first time there and it will not be our last. The food was flavorful, rich, wonderfully spiced and the bread was AMAZING!  My wife had the mixed grill and I had the beef tantoni, both were excellent. The portions were perfectly sized and we both left full and very happy. But most of all was the wait staff who was friendly and nice and open. They treated us like family and made us feel welcome and very happy. I will be bringing out-of-town guests here whenever possible and recommending it to all others. Great restaurant, great people!", "author": "Aaron S."}
