{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-01", "description": "LaCentral is one of my favourite French restaurants. The escargot was wonderful  served with a wonderful bread to dip into the accompanying garlic sauce.  I had the salmon that was perfectly prepared with asparagus and potatoes.   For dessert I had a lemon souffle which was wonderful.  I was with great company.", "author": "Carl L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-25", "description": "Transport me to Paris!  To start The bread and butter are superb!  We had pate to kick off the lunch followed by salad nicoise AND the Pomme Frites. Devine!!\n\nWe will be back!", "author": "Wendy C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-19", "description": "Really yummy French food! I arrived before my friend and I was a tad suffocated by the staff, who asked me at least 5 times if I wanted to order a drink. However, I realize that they were trying to be attentive.\n\nOnce my friend arrived we had a delicious dinner. I started with the onion soup. Ohhh my god. I love a good onion soup, and boy was this delicious. My friend had a salad and she was satisfied. For our main, I got the burger which was really good, and my friend got the filet, which was lovely. They had a really good sauce on the steak, which we both loved. Both meats were cooked to our liking and we enjoyed it very much. \n\nFor dessert, we shared the chocolate mousse which was outstanding. Chocolate loves, rejoice!\n\nOverall, lovely meal and would return again for a special occasion or nice meal.", "author": "Hannah S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-30", "description": "I really enjoyed my dinner at Central\nThe atmosphere is vibrant but yet on the quiet side\nThe service is great and the food is yummy\nTheir escargot is perfect and so is their onion soup \nDon't forget to eat some creme brûlée as a dessert", "author": "Jad A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-03-26", "description": "This place is famous for Mayor Brown, even his photo is on the wall. He has his favorite table too.\n\nThe place is exactly like it was when I last visited it 15 years ago! The Maitre'D still has that attitude. The place still old and run down. Lunch still packed with power house folks, a classic spot by China Town entrance, and something about this historical place, just nice to be back once awhile. \n\nThis is 1 of the oldest restaurants in San Francisco, classic French Bistro, famous for their casserole, 15,567 days since the cooked that pot. I didn't enjoy the casserole at all, too much beans, and it was too thick for my taste, I was hoping for more broth.\n\nThe Mussels was a generous portion, it was almost 2 lbs, good but no I had it better down the block at Plouf. \n\nThe French Onion Soup was also mediocre. The best was the fish dish special, with the sautéed veggies on the side.\n\nAnd the Latte was on point, service by the gentleman just started working there a few weeks. He was the highlighted of my lunch meeting.", "author": "Manda Bear B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-03-24", "description": "Le Central is a French restaurant offering French cuisine in the heart of San Francisco. We stumbled on this restaurant. When we walked in we were greeted by the bartender behind the bar and he pointed to a table and we proceeded to sit ourselves. We were greeted several minutes later by a server that had little to no knowledge of the menu and wine list. Or he just didn't want to be bothered with talking to us. He was rushed, distracted and was not engaging. \n\nWe started with a CA house cab which was $48 and very tasty. From there we had escargot and sourdough bread. The appetizer was garlicky, buttery and yummy. \n\nThe second course was a butter lettuce salad with nothing exciting to speak of. The third course was a French onion soup ($12) which was very mediocre. For the restaurant being French cuisine, I expected a top notch soup. \n\nNext, was the main, beef bourgeoisie and the duck confit special. Both dishes were overly salty with very little flavor. \n\nWe ended with a blah experience which we will not be repeating. For San Francisco this restaurant is one I would pass on.", "author": "Danielle A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-07-18", "description": "Small little restaurant that has been around for a long time. Was there for happy hour and was a good evening with good food. Loved the French music.", "author": "Sunil R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-26", "description": "We made a reservation here for Valentine's Day dinner. It was pretty easy to make a reservation via open table here since I did book it one week prior to the event. Most places were already booked out. \n\nThis place is pretty small. The tables for two were very crammed to the point where our host had to pull our our table for me to get into the booth. We also sat very close to the tables beside us so don't expect to have privacy or intimate conversations while dining in. Service was decent. The food was pretty tasty! We had the Vday Prime Fixe menu. I ordered the lobster bisque to start off. It was meh. Creamy, pretty tasteless. Bread that came with the meal was super hard/stale. I had the lamb racks as my main. Very juicy and tender, goes well with the sauce. The potato gratin was very delicious as well. Finally, I finished the meal with their creme brûlée. Very generous portion. Tastes great. After all the food prior, I could barely finish dessert. I would consider going back to try other dishes as well.", "author": "Maggie L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-05", "description": "This place never disappoints. Arrived early for business lunch. I had the salmon bearnaise. It was fantastic. About half pound of moist salmon crispy skin atop roasted cauliflowerets. The sauce was great with the salmon. \n\nThey served baguette with butter as you wait. \n\nThe service was outstanding. Water always filled. \n\nNo Willy Brown that day.", "author": "Frank T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-21", "description": "Absolutely unexpected gem of a restaurant. \n\nQuiet and cozy with a relaxing ambience. We savored delicious Happy Hour food at the bar including deviled eggs with roe, perfectly steamed mussels in a light, savory broth and Kronenbourg French beer. \n\nOur bartender Sean, a native San Franciscan, entertained us with stories of San Francisco's movers and shakers, which was the perfect accompaniment to our meal. \n\nWe will definitely be returning again.", "author": "Jenny S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-07", "description": "What a wonderful place, unfortunate that I cannot eat here every day! In a city full of new and fly-by-night eateries, I rely more and more on the classic institutions and Le Central is exactly that. I know every time that I visit that I can expect a great cocktail, a delicious meal, and an atmosphere that for me has become a home-away-from-home.\n\nGet a martini or a glass of Montagny, order the escargots or the mussels. And don't forget to try the cassoulet, it'll change your life!", "author": "Myles K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-12-11", "description": "Meh... last time here was 20 years ago when I worked FIDI and I've told my wife for years the best Cassoulet in the world, better than we've had in Lyon, France... yeah, not so much anymore... The Steak au Poivre literally did not have peppercorns but rather was a brown gravy and mushrooms... hey I wasn't born yesterday and I didn't just fall off the turnip truck, I know Steak au Poivre, and this was no Steak au Poivre... \n\nThe onion soup was tasty as was our reasonably priced bottle of french red... service was goo.b But we cannot recommend.", "author": "Kenneth F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-28", "description": "I'll admit, I wasn't psyched to come here for a group dinner a few weeks ago. There are so many new, trendy restaurants in San Francisco, and French food isn't usually high on my list. But I was very pleasantly surprised by Le Central!\n\nThe atmosphere is warm and feels a lot like the bistros you'd see in the streets of Paris--it was fun to feel transported when we walked in. They also have a good happy hour deal on house wines but you have to order it at the bar, can't get it at your table!\n\nThe cassoulet was definitely the standout. It's quite heavy--I split it with another person and it was still a lot of food. I'd actually suggest three people go for it and then get sides. But the flavors were excellent, it was comforting, and not something you find at most restaurants in San Francisco. We also had the butter lettuce salad which was delicious, the french fries which were really good, and the escargot because when at a French restaurant, go big or go home. Flavors on everything were solid, the dishes were well prepared, and and it was great for a group of eight.", "author": "Sophie S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-02-06", "description": "This place looks dated and overpriced but the food is really good and the service is personable. Great for a quiet catch up or business meeting. Be ready to spend a bunch, though.", "author": "Julie N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-21", "description": "I am reviewing Le Central based soley on the happy hour. I'm giving it 5 stars for atmosphere, friendliness, and a great French wine for $5. Sometimes a girl just needs a place to stop in for a glass of wine and feel welcome! This will definitely become a regular spot for me!", "author": "Sheila K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-02-26", "description": "Went here for restaurant week. The French Onion Soup was pretty good but we came for their Cassoulet which was mediocre at best. It was incredibly bland.\n\nGiving it another star for the ambiance as it does feel like a little slice of Paris and I could see myself coming back for a glass of wine at happy hour.", "author": "Lucy D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-26", "description": "Probably the worst French restaurant in SF or worst restaurant period.\nStarting from the welcoming or should I say the NO welcoming: hi, table for one ? When I walked with my wife and son !??:)\nMaybe a \"good afternoon how can I help you\" wouldn't hurt...\nThe food here is so basic and boring I don't know where to start. So I opted for their very famous Cassoulet. Big mistake.\nThis over cooked, tasteless, dry and over priced little casserole of beans with a quarter piece of sausage, and a few shredded duck meat and lamb was so disappointing it made me décideront write my first negative Yelp review.\nMy son was sitting next to the kitchen doors where there is almost half an inch of dust next to his face. Lovely.\nThe waiter also was on top of his form, giving me lecture on how to order Cote Rôtie to go with Cassoulet when all I asked was a glass of pairing red. I dunno maybe Cahors (Malbec) or even Bordeaux was more appropriate and in my budget. But no he said the Cote Rotie at $19/glass is what I need because he knows and I don't!!!\nLovely again.\nWhat's really funny is that I ate here 23 years ago and it was already disgusting. I'm not masochist but just wanted to give a second chance...\nThere won't be another one.\nBonne chance to all futur patrons there.", "author": "Laurent G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-02-11", "description": "A solid place for French food in the heart of San Francisco's downtown. I have seen the outside Le Central for decades now driving on Bush Street heading back to the East Bay in my car but this was the first time I had walked from the Montgomery Street BART station and eaten at Le Central and it was all thanks to San Francisco Restaurant Week. A friend and I wanted to meet up to commemorate another great year and so we looked on the website to see what affordable options that were out there that sounded good but also didn't break our wallets and we found a really solid option with Le Central.   \n\nUpon entry I noticed that Le Central could resemble a local watering hole in any American city or small local restaurant in Paris. It was cozy and warm without coming across as too pretentious. There was a huge long bar on one side of a double sided restaurant with small two top tables and booths abound. As for their menu they seem to have a number of dishes that best represent the best of what Parisian flair has to offer. Their San Francisco Restaurant Week menu best exemplifies some of the dishes they serve at a fairly decent price point. Where else could you get Escargot, Beef Bourguignon, and a Chocolate Mousse for only forty dollars total? No where in San Francisco outside of that ten day period every January.\n\nSince this was SF Restaurant Week and we were here to take advantage of the meal deal they were offering up I had to go with the traditional Onion Soup Gratinee with a boatload of Gruyere cheese and herb croutons this starter was just the way I like my French Onion Soup, gooey and cheesy.  As for my second course I debated between the Beef Bourguignon and the Cassoulet. Against my better judgement I went with the Cassoulet, with its white bean stew topped with duck confit, shreds of lamb and pork and served with one half of a Toulouse sausage. I felt that the dish, although well prepared, was filled with too many beans for my liking and not enough meat protein. Thankfully, there was plenty of baguette bread to go with my bean stew because I was in serious search for a starch to go with my main course and the beans weren't doing it. The dish does go well with the Cotes du Rhone red wine that I was able to purchase at the discount price of 5 dollars thanks to it being Restaurant Week. My dining companion got the Petrale Sole topped with lemon-butter-caper sauce, and served with cauliflower gratin and fingerling potatoes. She loved it and I had a small bite and loved how lightly pan fried the fish was. To finish off our meal, we each ordered both dessert options I liked the Mousse au Chocolat which was a chocolate mousse topped with both a creme chantilly and two rolled gaufrette pastries. But the real delight was the Souffle Glacee which was a chilled lemon souffle and berry compote. It was a light dessert without being overly sweet.\n\nI liked Le Central which of course is centrally located in between the Financial District and the entryway to Chinatown. An uncomplicated French Bistro the middle of the chaotic hustle and bustle of the city. Their menu deals for San Francisco Restaurant Week were solid for the price and hope they got more business than usual because of it. If I'm ever in the area again, I'll be sure to stop by and sample some of their other dishes on their regular menu, all of which sounded rather delicious. Merci Le Central!", "author": "Jason F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-16", "description": "Love love love Le Central. I ate here many times when it first opened in 1974. Still takes you back to France every meal. Classic and traditional French bistro fare. Excellent pate, lovely Belgian endive. Service was appropriate for slow food and charming bistro as ambiance. Although we arrived too late to take advantage of it, their happy hour looked excellent. If you love traditional French bistro food (and know what that actually is) you will love Le Central, too.", "author": "Jordana G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-12-23", "description": "Checked out Le Central on Bush St near Grant Ave in SF.  It's pretty old and not much buzz so I really shouldn't have gone.  I'm not a huge fan of French anyways.\n\nThey brought out butter and then cold, hard baguettes - boo.  Nobody especially me wants cold, hard bread!\n\nEscargot only 6 in a big puddle of garlic & butter $12.50.  Tasted ok, nothing special.  I dipped my cold, hard bread into the butter/garlic so it was a tiny bit better.\n\nspecial soup of the day was Carrot Butternut Squash Soup in a bowl $9.5 - tasted ok.  It does get cold pretty fast though.\n\nLamb dinner $36.50 was pretty good & too expensive.  some seriously small lamb chops, some scoop of potato gratin, tiny amount of eggplant, 3 broccoli spears.\n\nCreme Brulee $8.5 - not as crackly as it should be, just ok.\n\nB. got some booze - glass of Sazerac $12 and glass of Cotes du Rhone $10 - don't know if he liked it but drank it all up.  \n\nCharged it.  Meh overpriced dinner.", "author": "Ann L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-19", "description": "Fantastic service. Everyone makes you feel so welcome. The music is fantastic!  Food fabulous!!", "author": "Marc T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-24", "description": "I had a great time at Le Central.  I ordered a glass of Sauv. Blanc but the bartender offered that I could taste their happy hour white Bourdeux which was only $5 per glass at the time.  It was wonderful, so I opted for that.  I also had a glass of Sancerre later on in my meal and it was also a lovely glass of wine. I ordered half a dozen oysters and they were dainty and fresh, just how they outta be. The sauteed Dayboat scallops for my entree were perfectly cooked, atop a luscious pea puree with some perfectly cooked petite veg on the side and small spoonful of a decadent cauliflower gratin that was to die for. The dessert selection was calling my name but I'd reached an elegant sufficiency so I had a decaf coffee and called it a night. Magnifique, can't wait to go back.", "author": "Emma H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-02-03", "description": "2 Stars - for food. It was forgettable. We've had much better french food in the city.\n\n0 - Star - for service. We were a party of 13, I chose the place because it is easily accessible for everyone coming from work. We were there for both happy hour and dinner. Some of us  started ordering happy hour drinks at the bar but then the Manager rudely told us that we cannot order happy hour drinks anymore because we had reservation at the dining area. Hmmmmm, we are regular San Franciscan diners and we are very familiar about having happy hour drinks at the bar vs dining area. Fair enough . We understand this and it's common practice but to be told that we cannot be served anymore in the bar area is simply ridiculous. We usually run up a bill close to $800- $1,000 because we start with happy hour and stay for dinner .The Manager made a big mistake making assumptions that we are only there for \"happy hour\". The place was empty on a Friday night and they should have been more accommodating instead of being uptight about the whole thing. We would have ordered couple of appetizers, a bottle of champagne and desserts after but we didn't because of the cold reception. P.S. - on top of that they messed up our bill too! Added something we did not order. Never again!", "author": "Carrie F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-22", "description": "Dropped by for happy hour but ended up ordering from the dinner menu. Ordered the staple and was not disappointed. The steak tartare was not salty like in most places. The beef was fresh and can afford not to be overly seasoned. Escargot was also amazing. Kirsten, the bartender, was friendly and provided good service. I can see myself coming back for the $5 cocktails and the food.", "author": "Rori G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-16", "description": "UNREMARKABLE in every single way. We had the roasted chicken and the cassoulet, both were bland, completely unseasoned, and lacking any flavor at all. And this place passes on the 5% SFEM tax to customers as well! Go elsewhere!", "author": "Brennan J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-27", "description": "This SF institution is the dining room of who's who and we enjoy returning time and again! As three generation SF natives, we love Le Central! It is classic, old school....You know what you are going to get! Consistent authentic French Cuisine!\n\nStarters:\nFrench onion soup \nSteak tartare\nClams\nCrab cake\nEscargots \nEntrees:\nFilet Mignon\nRoast chicken with pomme frites\nScallops\nFrench Lamb\nSignature Cassoulet \nDessert:\nSoufflé \nApple Tart\nTiramisu\nBerry crumble \n\nOwners Anthony and his daughter are great at front and back of the house! Paul and Scott always a pleasure to have on the floor!", "author": "Sharon S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-05-11", "description": "Casulet served cold and had to be sent back to the microwave. It consisted of beans and what looked like an Oscar Meyer breakfast sausage floating in it, and not very much of it at that. The moulles were also cold by the time they arrived.\nThe is Resturant is a shadow of its former glory.", "author": "Greg S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-10-13", "description": "What HAPPENED to this place?! It used to be great. Hadn't been there for a few years until last night, when we had one of the worst dinners we've ever had in a restaurant. Food, drink, and service were all terrible. There is barely room to walk between the bar stools and the EMPTY tables. What HAPPENED?!", "author": "Laura R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-05-03", "description": "There are many French Restaurants near Bush Street and this place is a classic.\nIt is simple and not upscale and  all  of my 4 experiences have been fine. I have not been in two years but would try this place again when I am in SF and in the area.", "author": "Dan R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-02-09", "description": "partner took me here for a dinner date because he knew i liked french onion soup honestly all the food was bland and i feel like they judged us because we was young and didn't take us seriously", "author": "Donnae K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-03-23", "description": "I ordered the french onion soup and their \"signature\" cassoulet; I woke up with such severe stomach pain that I literally almost went to the hospital because I was worried I had appendicitis. 0/10 would recommend.", "author": "Ryan N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-02", "description": "Don't be discouraged by the whiners.  For 30+ years Le Central has consistently made me happy.  New and trendy are part of life, but old school and genuine are every bit as important to me.  When was the last time you walked into a restaurant after a three year absence and were welcomed warmly and told that you had been missed?  I told the waiter that he was mistaking me for someone else, and he replied, \"No, not at all.  Would you like your usual?\"  And he nailed my order right down to the martini!  I call Le Central warm and friendly, and DELICIOUS every time.  Can't wait to get back to SF just for Le Central.", "author": "Michael M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-02-12", "description": "We went to La Central during SF Restaurant Week and had the prix fixe menu. \n\nThe food was mostly delicious, but the restaurant was crowded. We both had the onion soup and it was fantastic, would definitely recommend. \n\nMy husband had the cassolette and wasn't blown away by it, he found it a little bland. I had the beef bourguignon which was very good, especially the mashed potato. The serving seemed slightly on the smaller side but I ended up not being able to eat it all. \n\nFor dessert Husdude had the Soufflé which was excellent and I had the chocolate mousse which was very good but I don't think there's actually that much difference between a decent chocolate mousse and a really good one so I wished I'd picked the Soufflé instead. \n\nThe bar was out of one of the ingredients for the cocktail I wanted to order and the cocktail menu was far from extensive so that was disappointing. I later heard the waiter tell someone else that they had a full bar but when I'd tried to ask for something off menu similar to what I'd wanted the waiter was entirely unhelpful. \n\nThe tables were extremely close together so if you're looking for an intimate restaurant for a date this is not really appropriate, unless you're ok with being intimate with the folks at the tables on either side of you as well! Overall this is a decent restaurant with good food but you definitely come for the food rather than the ambiance and don't feel inclined to linger.", "author": "Teegan L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-10", "description": "I don't understand the hype. Decent food but the venue is dated and not in a cool retro way.", "author": "Rosy P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-14", "description": "I was meeting friends from Mexcio who were visiting SF and we decided to go to Le Central.  We had a fabulous time.  The cassoulet was incredible.  Everyone enjoyed all of the entrees, and the two appetizers we shared were great as well.  Staff was very attentive and we enjoyed a great evening there.  Would definitely go back.", "author": "Ken E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-19", "description": "Even though I have lived in SF for many many years, I had never been to this FABULOUS RESTAURANT... People, GO, GO, GO!!!  There are several clubs that went or go all the time. EX-Mayor Willie Brown goes to lunch there almost everyday and we got to sit at The Famous Herb Caen table as he was a regular there,.There was nice music playing in the back ground and was soft enough to be heard and the room was not overly noisy.. You could still talk and carry on a good conversation.\nThe service was fabulous and the food was beyond exquisite...The escargot was perfect and the country pate' was beyond words. Two of had the Streak Tartare and I had the Cassoulet, and it was beyond delicious,Seasoned perfectly. It was very rich, so I got to take almost half home and get it for lunch tomorrowYEA!!!!!~!~!~ One of the best I have ever eaten. we had two desserts to share , the Mousse au chocolaté and the Tiramisu... both,  exquisite . I highly recommend this restaurant and be dining there a lot!!!!\nStefn W... San Francisco", "author": "Stephen W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-19", "description": "wife and I went to set menu as part of restaurant week.  as so many others have said, the Cassoulet was to die for but so was the Beef Bourguignon!  the appetizers Onion Soup Gratinée was OK but Escargots de Bourgogne was over the top... and the Souffle Glacee was exceptional", "author": "William T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-06-16", "description": "A strong 3 stars, but probably not a 4th.\n\nI had a business dinner at a table for 8 here one night, followed (coincidentally) by a social lunch for 2 the next day, so I saw both types of experience.\n\nIn all, a serviceable and cozy French restaurant with moderate prices.  As it is in downtown SF, it should get no easy grades - San Francisco is a sophisticated city with many good restaurants across the spectrum of food, so standards by which this restaurant is to be graded are high.  It is sufficient.\n\nFor dinner, there were escargots (average), oysters (above average), and scallops (average) for me.  I did also have a ginger/carrot soup (above average).  This was all chased by several shared bottles of white burgundy, which I found cold and charming of course, but the vintage escapes me and I did not handle the wine list, so I can't comment on their wine selections.\n\nFor lunch, I had a filet mignon plate (above average).\n\nAs for service, it was adequate and there were no disappointments - particularly for the dinner.  The lunch experience involved a waiter that was not terribly present or involved in making sure we understood the menu, but then again lunch is a more hurried affair and he was certainly not guilty of any high crimes or misdemeanors.\n\nI would have gone to a 4th star if my girlfriend was with me, but then again I get slutty with stars in reviewing restaurants on Yelp if my girlfriend happens to have been part of the meal.", "author": "chris s."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-02-22", "description": "This restaurant is stuck in time.\n\nIt's a shame because the food is actually pretty good. The french onion soup is solid with it's ooey gooey gruyere. I ordered the Rack of Lamb Persillé and was delighted that they gave me such a hefty portion of ribs (a full rack vs. usually getting a half rack at other French restaurants for the same price). They were succulently medium rare and went great with the creamy potato gratin. My bf got the beef bourguignon and it was also good (I was practically picking off his plate). As recommended my our waitress, we got the chocolate mousse for dessert. The presentation could have been a little fancier (kind of looked like a scoop of poop on a plate), but it satisfied. Still wish I got the tiramisu or creme caramel instead though. Aside from that, the staff was very nice and accommodating. We called ahead and got there barely before closing, and they still waited for us and were very attentive.\n\nBack to my first remark... this place needs some serious renovation. I didn't look at any pictures of the location beforehand and ate here because the menu looked promising, but I was REALLY disappointed that it looked like a diner inside. Even though I was very satisfied with my meal, I was conflicted because the interior lacked ambience and just didn't match my expectations. I was even feeling chilly! I don't think I will return because there are other French restaurants at a similar price point that are simply nicer and more intimate inside. Sorry.", "author": "Stephanie Joyce D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-10", "description": "We came as a group of 6. We first came for Happy Hour, which is only available in the bar, and then stayed for dinner at a table. Happy Hour was great. First of all it was available on a Saturday so it's not just during the week, and it went until 7pm! We had wine, brie, oysters, frites, and had a great time. It's an awesome happy hour deal with lots of yummy food to snack on for cheap! Dinner, on the other hand, was not as impressive. There was nothing wrong really, it just wasn't as good as the happy hour in my opinion. The French Onion Soup is made with gruyere cheese which smells so bad. I think a couple of their other dishes are also made with this cheese, because we kept getting whiffs of this funky smell when certain plates went past us. The soup I got was mostly bread and cheese, with very little actual soup. I got the impression the rest of our party felt similarly about their orders...good, but not great or worth the priciness. So in conclusion, I would definitely come back here and recommend Le Central for happy hour, but I would probably choose a different spot for dinner.", "author": "Nicole D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-12-31", "description": "Do not waste your time, terrible service, terrible food. The waiter actually came back and asked my boyfriend and I why our tip was so bad. Who does that!? The food tasted like it was a week old, our waiter was god awful and had no social graces and it was so damn expensive and we were served food that I wouldn't even feed my dog. \n\nI was waiting for Gordon Ramsey to come around the corner, this place could easily be on kitchen nightmares. Honest to god, do not eat here.", "author": "Elise G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-04", "description": "This was the only spot in the area we could find that served escargot. It was garlicky and delicious. We loved the French onion soup and the sea bass tasted great. It's clear that this spot is a neighborhood hangout with regulars that come frequently.", "author": "Sharon R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-01-03", "description": "Of course, Le Central's kitchen is fine.\n\nUnfortunately, there is more to dining that just the food.\n\nTo put this as simply as possible, I booked at table for eight for New Year's Eve.  The reservation was made a full four days in advance.  When I arrived with my out-of-town guests, all of whom were of a sylphlike slenderness, the restaurant attempted to seat us at a makeshift table set in the middle of the dining room that was best suited for six adults at best.  When we asked to be moved to a reasonably sized table, the staff kept us waiting for more than 20 minutes.  \n\nNow, normally, we are willing to cut our home town restaurants a large amount of slack during the holidays.  HOWEVER, in the dining room there were many tables on the banquette that could have been moved together immediately to accommodate us.  Why were they not?  Because the staff was more worried about a party of seven that had not arrived - and several other parties of two that had not arrived - than they were with the party of eight standing directly in front of them.  \n\nFinally, after three reminders that we were still waiting, the staff did, indeed, move the banquette tables together to accommodate us.  And they did not do it cheerfully, nor even politely.\n\nAnd guess what?  The party of seven never showed, nor did many of the other parties the staff were expecting.  During the entire meal, there was no line at the door.  Un tien vaut mieux que deux tu l'auras, Le Central.\n\nBy the way, our tab came to $1,200 for the party of eight, so its not like we were a poor risk.\n\nAs regular customers, we expected that Le Central would be a solid place to bring out-of-town guests in terms of both food and service.  It was an incredibly irritating and embarrassing experience.  I won't be back, and considering how often I have eaten at Le Central over the years, this is a strong statement.\n\nAs an aside, the wine list, in terms of the selection of French wines by the bottle, is poor given Le Central's focus.", "author": "Patricia P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-09-22", "description": "What a shame. The chef retired from this great bistro and now whoever took over for him has completely screwed it up. They've lost 2/3 of the menu items, half the staff, and the poor waiters as well as the other owner are completely overworked. I was told they hired a \"consultant\" who told them to rework the place. What a nightmare. This bistro has been the go-to spot for power brokers and those in the know for years. But you could also go have a nice quiet romantic dinner there with your wife, with great service and reliable very good food. If some newbie thinks they are going to turn it into a millenial hotspot they are idiots. It was never that kind of place and never will be. This change will just drive it into the ground. They even changed their famous roast chicken. WTF??? Bring back the onion tart!", "author": "Earl P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-04-01", "description": "This was enjoyable and the feel of the restaurant was similar to New York.\nHowever, note, that means the restaurant is tight... they had to pull the tables out for us to get into our booths seats! Getting to and from the bathroom was difficult as well.\n\nFood: Amazing! \nEscargots de Bourgogne - yes! \nCassoulet - my first ever, it was heavy, and creamy!\nDessert I couldn't care for, not recommended...\n\nService is where it falls short. The person who served us was rather rude and I felt hurried... Not that the restaurant was full at all during our dinner.", "author": "Amy H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-12", "description": "Loved the intimate ambiance and my lunch was delish. I wanted something light and decided on the roasted beets and the smoked trout with capers and onions served with a healthy side of potato salad. Damn, that was good! I loved, loved the beets; the smoked salmon (with a little horseradish dressing) was very tasty but their potato salad rocked. Hold on now, the best part of my meal: Hendricks grin gimlet, straight up, very, very cold, dry. Oh my the bartender knew what he was doing. First I saw the tiny martini Glass and my face fell until I saw the ice bucket with a carafe worth the rest of the gimlet. Love this place. Thanks to Joyce & Elvin Crum for the suggestion. I missed my friend former Mayor Willie Brown my minutes; next time....", "author": "Robbie B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-09", "description": "The Escargots de Bourgogne were just amazing, and I was pleased to find Choucroute and Céleri Rémoulade on the menu.\n\nIt was a long time ago though.", "author": "Bruno P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-01", "description": "I enjoyed my evening here. We were able to get a reservation during restaurant week the day of. Our waiter was very accommodating and the food came out in a timely manner. The food for the restaurant week menu was quite good and there was a lot of variety. I must say my favorite part was dessert. Their tiramisu was amazing. I would come back to try the rack of lamb sometime.", "author": "Lynn T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-11", "description": "I came to Le Central because of their cassoulet. I had actually planned on making this dish myself, but I thought I should try the classic French version first. While it was good, I could see there where a lot of additional ingredients I would have added. But then it wouldn't have been a classic cassoulet. I'd give it 3.5 stars. By the way, that dish could easily be shared by two. \n\nWhat takes them to 4 stars is the service and a superb apple tart. If you go there for dinner you must order the apple tart for dessert. I plan to go back just for the apple tart.", "author": "Anthony W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-26", "description": "I wandered in here the other night, surprised that the reviews on Yelp,were so lukewarm as I had a really good experience, from the people that I met to the the food to the friendliness of the bartender.\n\nI sat at the bar as I had no reservation but that didn't matter as I was warmly greeted and shown the specials of the day along with the happy hour specials.\n\nI ordered 6 oysters off the happy hour menu and then the chicken and pomme frites off the regular menu.  A nice pour of the house Cab and I was a happy girl.\n\n The food came up quickly and was quite good- simple in its approach but very tasty.  And with the old school feel of this place, I almost felt like I was at a small bistro on the back streets of Paris.\n\nLe Central is not a fancy place but rather a small neighborhood place where people seemingly know each other and are warmly greeted upon entering.  I could have stayed at the bar all night talking to the locals and enjoying the various wines that lined the bar.\n\nBut an early morning beckoned me so it was back to my hotel I went, but my tummy was full and step a little lighter from a nice evening out.", "author": "Carol K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-07-08", "description": "Made reservation via Opentable for last Wed at 7:15pm, a bufday celebration. Arrived ontime and was told my name is not on their system, host even showed me their list. So i had to reserve the next available 7:30pm slot. Dinner went smooth, our waiter was fast in ordering our two glass of Zin and numerous appetizers of crabcake hmmhmm good, filet mignon tartare(this was very bland), clams in white wine(very very juicy), beet salad(tasted a lot better than it looks) and for entree to share was the yummy scallops(chef plated separtely yet still a huge portion, thank you!) So full, we said no to dessert =]\nnext day, i get an email from opentable, restaurant claimed that i did not honor my reservation. i emailed back of course and received 100points only...argh!!! Please give me back my 1000 points! =/", "author": "Vee V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-05", "description": "Ideal restaurant for group and friends of course couple too. This French restaurant's service is great and food is nice too. Not too formal, and definitely good restaurant and worth to try.", "author": "Unyo N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-15", "description": "Excellent food and great vibe and people!\nThe New York steak the wine and the dessert was great!\nEasy 5", "author": "Ben R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-21", "description": "This is the second time we have come to this restaurant for SF Restaurant Week.  \nThis year it was somewhat crazier on account of the march in support for women after DT's inaug.  \n\nOur waiter was super nice and took excellent care of us.  The food was great and the desserts superb.  My favorite this evening was the French Onion Soup. It was perfect.  Prepared just like it should be.  Wish I could afford it more often.", "author": "Emilia G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-23", "description": "We took our intern out for his birthday and chose Le Central. He is French so we figured, why not. We made reservations easily and were seated in a nice 4 top table in the side room. We ordered the cheese plate $16 which was good. We also ordered the crab cake to share which was great. It was breaded perfectly and had chunks of crab. I chose the scallops for my entree, which came on a bed of spinach with tomatoes and a nice creamy sauce. It hit the seafood spot. For dessert we shared the tart tartine, which was just okay. The cream was way too sweet. \n\nI will have to drag my bf back here for dinner since it is a nice frenchy romantic place.", "author": "Katie Anne N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-11", "description": "I was treated to a special Christmas luncheon by my financial advisor on 12/10 and La Central was amazing! How often do you walk into a restaurant and shake hands with the ex SF Mayor Willie Brown? He was very friendly and obviously treats La Central like a second home. The waitstaff was very welcoming and Scott our server was on point! He was very helpful and took care of our group with ease.  \n\nMy first course was the escargot and it was the BEST I've ever had! Very tender, garlicky, and perfectly buttery little delights! My second course was the blood sausage and frites. The blood sausage was smooth and seasoned amazingly. It was very rich, but I couldn't stop eating them with the flavorful apples. Lastly, I enjoyed the creme brûlée and it was by far one of the best I've ever had! \n\nI can't wait until the next time I get treated to come to lunch here. It's like family here and the food is incredible. Great San Francisco institution!", "author": "Karen C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-01-01", "description": "My husband and I were fortunate enough to travel to Toulouse last year., home to the Cassoulet. Therefore it may be unfair to compare but what this restaurant serves is not a real French Cassoulet.  Le Central's version of this dish is really more of a stew.  It was ok, like the rest of their food.  It was not impressive to me at all by any measure.  There are other places in the Bay Area to eat good quality French food.", "author": "Daly D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-28", "description": "Third visit for lunch - prior lunch and dinner occasions. This is a classic in San Francisco, has been around I think over 30 years, and it is as old style class as you get, from the decor to the pretty classic French dishes - no nouvelle cuisine here - to Willie Brown sitting at a table for lunch today (I kid you not). The service is very good, they shake good martinis (from my dinner) and today I had the Bordeoux Blanc by the glass, $8. The food is solid, but not the best. Today I had the pork chops, and it was good, but not well bonded with the sauce, they were probably cooked separately, then the sauce poured on top. So, 3 stars for food, 4 stars for ambiance, service, decor, and character, makes it a 4 star in my mind", "author": "Massimo M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-17", "description": "Proper, near perfect escargot. Nothing unusual or innovative; just right. It was just an escargot-kind-of-night and I went grazing from one French place to the next. \n\nNice background jazz, good service, laid back... Nice!\n\nCritique: turn down the lights a bit for a sexier setting. \n\nI will definitely return to sample more froggy fare from Central.", "author": "Martin S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-18", "description": "Very French, great food and cozy atmosphere. I eat at the bar and at a table . Always great service and delish food.", "author": "Cecilia D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-19", "description": "Had a birthday lunch with my wife here today and it was very good. I had the burger and she had the green beans and it really hit the spot. The beef was exceptional and the fries were hot and tasty, we will definitely be back on our next trip to S.F.", "author": "Bill S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-05-27", "description": "There was a time when both I and Le Central were young.  It was remarkably good at that juncture in our respective lives. Then I left the area for a couple of decades. Neither I nor Le Central are young anymore--and one of us has lost their mojo.  Le Central's roast chicken was once a masterpiece--juicy, crisp, a bit salty--a worthy competitor to French cooking.  Now, it's a sadly small, shriveled and dry bird.  Certainly not one to attract me back.  Note: In the midst of my exile a colleague and I were in SF and I enthusiastically led him to dinner at Le Central.  It was embarrassingly mediocre. I had thought that maybe that was just a bad night; almost no one was there so maybe the chef had left the chief bus person in charge.  Today's visit confirmed that the decline is real.", "author": "Charles E."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-07-24", "description": "3.5 stars...used to be more.\n\nThere is a certain ambiance that I love about Le Central. Yes I have been eating here since the cassoulet was only a thousand days old...\n\nWhere else can you bump into Willie Brown, Harry De Wildt, or Wilkes Bashford (WHO??)....I'm gettin old...yawn.\n\nLove their Celery root remolaude, onion soup, and the famous Roast Chicken and pomme fritte....the aforementioned Cassoulet is also good.\n\nService is okay and the food is still pretty good...in a bubble...but when you compare Le Central to what else is out there it is not the same.\n\nNever the less if you really want to step into the wayback machine with Mr Peabody and Sherman (  http://www.youtube.com/watch?v=KEm_8m4or7M ) and see what San Francisco was like in the 70's have  lunch at Le Central.......IT IS A TRUE CLASSIC!", "author": "David G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-03-17", "description": "Went here for lunch, while the service was friendly and accommodating, I found the food to be generally way overpriced.  There are many better places at this price point I would recommend instead.\n\nMy meal focused on the appetizers since the main courses didn't seem to offer much bang for the buck.  Chicken and french fries: $24.  Cassoulet for $28.  Salad nicoise for $20.  All of these \"peasant\" dishes at the price of high end plates was ridiculous. The rest of the entrees were $25-$35 each.  \n\nWe got bread and butter as a freebie at the table.  The bread was delicious, but the butter was cold and hard.  I expected room temperature butter at this price point.\n\nI had the crab cakes, these were good and stuffed with crab.  \n\nA friend had a burrata and heirloom tomato salad, that would have been excellent if it was tomato season.  But it is not tomato season, so the tomatoes were not in season or local and were mediocre.  \n\nAll of the food was under seasoned.  The salt and pepper shakers were very much en vogue in 1974, basic chain hotel grade salt and old ground pepper.\n\nLe Central was probably great in 1974.  In 2016 there are a lot of better places with higher quality ingredients at the same price.", "author": "Jame E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-20", "description": "Charming little French place with a good location.  I have now been here several times and the food is always great.  I almost always get the filet.  It has a black peppercorn sauce and it is probably one of the best in the city.  The creme brulee is a nice way to finish a decadent evening!  Definitely will be returning.\n\nThey are on open table which is a plus!", "author": "Jax B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-03-03", "description": "Good service, food is nothing to write home about. It's just ok. My husband ordered the cassoulet over which, there is much hype, according to fellow Yelpers and the countdown in the restaurant over how many days they'll been serving it. Here is something to consider: the traditional REAL French cassoulet never, EVER has lamb. I asked the server if it tasted \"gamey\" , he kindly offered me a taste, which to me was quite gamey. I had the salmon, again nothing special. \n\nService was good for the most part and we were able to sit there 30 minutes earlier. \n\nI much rather skip the drive to SF and go to the Girl and the Fig in Sonoma. Now THAT place a really good French food :-)", "author": "Marie I."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-02", "description": "We ate at Le Central during Restaurant Week after not having eaten there for decades. The cassoulet remains the reason to go. It's flavorful and authentic; other San Francisco versions seem not nearly as rich as Le Central's. I enjoyed it greatly. My wife enjoyed her salmon, as well, but did not find it extraordinary. Desserts were quite good. The bar area where we ate is cramped but the adjoining room looks much more comfortable. Service was more than adequate, although our poor server had too many tables to manage. Recommended, especially if you enjoy cassoulet.", "author": "Mike R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-14", "description": "Wife and I went here for vDay. It was really tasty and they sat us even though we were 15 minutes early for our reservation. The food was really tasty. They lost one star because my Fillet wasn't cooked as ordered and it was placed on top of a piece of soggy \"toast\". The bread didn't have to be there and reminded me of Wonderbread. Luckily that was such a small portion of the whole.", "author": "Jm C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-13", "description": "I visited Le Central last Friday night for the first time and had a really wonderful experience. The ambiance was great, the location was convenient, and the food was  the best French cuisine I have had in San Francisco. I even ate escargot for the first time, and was pleasantly surprised.\n\nI arrived at 6:30 to meet some friends after work, and was immediately seated on the bar side of the restaurant. The waiter quickly came over and brought a cute blackboard with chalk-written specials of the day which he placed on the table. We ordered a bottle of the house pinot noir, and began looking over the menu.\n\nWe ordered:\nHerb crusted goat cheese\nEscargot\nDuck Rilletes\nCassoulet\nRack of Lamb Persilles\nDayboat Scallops Provencale\n\nThe food was amazing. I personally ordered the escargot and the cassoulet, both of which I had never had before, and they were delicious. The escargot was tender, and in an amazing garlic pesto type sauce, and the cassoulet came in a cute little orange pot and was the most amazing stew I have ever had. and I had the chance to try all of my friends plates, and they were were all on-point.\n\nThe waiter even came over and poured us more wine to refill our glasses on the house. It's little touches like that which really make a restaurant special, and this restaurant is definitely very special.\n\nThanks for a great dining experience, Le Central.", "author": "Jamie J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-12", "description": "Exhausted after walking through Chinatown, we literally came upon this place as we crossed the street on the way back to our hotel. We settled in with wonderful French bread, chilled sweet butter and a couple of glasses of white wine. We split a cassoulet, and it was magnificent. Duck confit, lamb sausage, cooked with white beans in a little covered pot of goodness.  This seems to be a regular place for locals.  They've been open for 39 years and use a little bit of the previous day's base to start  the next day's batch of cassoulet every day for the past 14,000+ days.\n\nEveryone seemed to know our waiter, who according to the lovely couple sitting next to us, has been their waiter for the 30 years they've been coming, always sitting them at the same table.\n\nMan, I love it when I find places like this.", "author": "Roger Y."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-04-06", "description": "Oridnary, service very basic, steal tartare, where was the egg? creme caramel looked like it had been made days beforehand", "author": "Kym H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-02", "description": "A taste of real french food!! I have never been to France but my girlfriends father is french who has been teaching me about great french meals. I love french deserts! I am a meat person so I tried the Pot Pie which was amazing. All the dishes on the table looked delicious and yum! The atmosphere of the place really complimented the food. It's petit!! I enjoyed trying new restaurant in the city and I most def recommend you try it too!", "author": "Nuno V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-11-11", "description": "I extended my trip to catch up with a very wonderful friend of mine I hadn't seen in two years, asking him to suggest a new lunch hotspot he might know of, where we could kill an afternoon. After all, not only is he a well connected business name in this town, he is usually on top of everything that goes on in several major cities he lives in throughout the world.. So it came as a huge surprise when I received the e mail confirmation from him about a place that's been around forever. \n\nLe Central is the westcoast's answer to \"21\" ( NY). When it comes to power brokerage, these places are not really about food but have everything to do with the scene. Five minutes inside and I understood it immediately. There should be a venue like this in all name brand cities, (and there is!).  This is a restaurant that offers two levels of front of house membership - Do They Know You vs. Who Are You? Weigh this carefully when reading the reviews here. Which group do you think has a happier experience?\n\nI'm from that last great bistro generation - the one where your dad's table was ready no matter what time he arrived, where the entire staff made things work no matter how crazed the room was, even moving lessor constellations to other tables so their best customers were taken care of. This was before Restaurant.com, Restaurant Week, the passive aggressiveness of internet reviews, online democracy. I'm talking about a time when players were PLAYERS, and trusted their Maitre' D with all the big secrets. A time when a house manager knew what deals were going down just based on the seating chart in his room.\n\nOh yeah. I almost forgot. The Sea Bass was great...... So what!", "author": "Gene D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-01-30", "description": "Solid three stars. (Service 3/5, Food 4/5, and Ambiance 2.5/5) and I came here for dinner Saturday at 8pm for Restaurant Week.  I picked this restaurant over the others because the prix fixe menu actually offered their signature dishes at a good deal, which is not the case for all restaurants that participate. I'm not sure why the reviews are so bad on service. We came 15 minutes before our reservation, and was seated right away. We actually weren't too fond of the spot, and the hostess was kind enough to accommodate by moving us to another table. Our server was also very sweet. He tended to us, but not in an annoying way. I took some points off because he kept mixing up our dishes as he served them and only gave one of us water, when we both had asked. The comments regarding how dated the restaurant is are pretty accurate. It's not terrible, but the old lighting fixtures and dated surroundings make you think what the kitchen is like. I'm sure it needs a general face lift.\n\nFood was good.  We got the following:\nEscargot--very tender and seasoned well. perhaps a little salty, but great for dipping bread\nFrench onion soup--I honestly don't know what good French onion soup is supposed to taste like, but just know...they use a very pungent cheese on the top, so if the smell hits you when you walk in the door...that's what it is.\nDuck cassoulet--stand out dish in my opinion. Flavorful and rich. For those of you who don't know a cassoulet is like French white bean chili with poultry and something fatty like sausage or porcetta \nBeef bourguignon--didn't try, by my dining companion said it was very good, and cleaned his plate!\nDessert: Souffle glace & chocolate mousse both excellent ways to finish off the meal. One refreshing and light and the other rich and creamy.\n\nOverall I'd say try Le Central for a taste of French food. (Nothing would compare to being in Paris...so I don't know why some reviewers bother with that comparison.) It's better if you can snag a deal like happy hour or Restaurant Week.", "author": "Noelle L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-31", "description": "San Francisco's finest.\n\nWilkes Bashford.\nHerb Cain.\nWillie Brown.\nUs.\n\nNot me but a former mentor and now good friend. Many years had past since seeing one another and we were long overdue to say hello.\n\nDid so while enjoying their rich and flavorful signature roast chicken and marveling at their cassoulet that has been cooking for almost 40 years straight.\n\nBit confused at how my chicken was advertised as coming with broccolini (there were two small pieces) but did appreciate the greens for fries swap. Just don't expect spinach.\n\nProbably three stars were it not for the impressive history, cassoulet and clientele. If it's a favorite of my mentor it's a favorite of mine. He has yet to steer me wrong.\n\nSeeing Mr. Brown sitting at his favorite table might have sealed the fourth.", "author": "Jason B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-09", "description": "I used to come here a lot. It's very Alsatian. My favorite. The steak au poivre is AWESOME!!!!!", "author": "Barbara B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-06-19", "description": "We came here for dinner before a show at Union Square and because it was outside of the Square, we found street parking just 2 blocks away in FiDi.  \n\nThe escargots reminded me of the ones I had in Paris, simple classic of just herb and butter leaving me enough to put on my baguette.  The cassoulet may look small but is very rich so make sure to share your entrees to balance out the richness.  For our second entree, it was the butterfish special which was a nice lighter alternative.  \n\nThe service was spotty however as it took a few minutes for the hostess to even notice us standing there as she had her back to us and was chatting with her coworkers.  I notice the same with others of the staff throughout dinner as well where they tend to congregate around the bar area talking.", "author": "Joyce Z."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-06-14", "description": "We have been meaning to try this place for years.  While the service was good, it is unfortunate to say that the feel of this place is more like a typical touristy Union Square eatery than it is the storied, authentic French bistro we were hoping it would be.\n\nStarters of duck pate and French onion soup with baguette were quite good.  We had the steak frite, which while solid was unspectacular.  They were cooked to order at least.\n\nJust little touches, like the paper on the tables rather than white table cloths, and the fact that none of the staff were actually French.  This is in the heart of the unofficial French district of San Francisco and right down the street from Cafe DeLa Presse and the French Consulate.... Well, where the French Consulate used to be for years before it moved.\n\nTo be honest, the food is probably better than your average Union Square tourist trap,  but at these prices, it's a bit harder to recommend.  Maybe we were expecting too much, but the ambiance was also not nearly as charming and authentically French as we were hoping.", "author": "Dave N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-15", "description": "Love Le Central! Excellent food, warm and welcoming service puts this restaurant at one of my favorites in the city.  I love the old school vibe and the traditional dishes. It's perfect on a classic SF foggy day. If you're new to the area, step off the main drag and enjoy some really authentic old school SF dining. Many of the French spots nearby are a little touristy, and not as great of service. Have been there about 8 times - for dinner and for cocktails at the bar, and it's always great. \n\nThe dinner is a little pricey, but worth it for quality food. The happy hour, however, is a great deal. Tip: go to happy hour early, and catch some of their great happy hour drinks and food at the bar.", "author": "Hyly K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-29", "description": "I've been coming here for over a decade, and not once have I ever been disappointed. The food is fantastic and it won't break your wallet. I used to work off of New Montgomery, and this was a favorite spot for all of our Executives. Lunches, dinners, or even just for drinks after work - there's not a bad time to go to Le Central. They have daily specials and their bartenders always know their stuff! If you're not sure what you want to drink, just give them an idea and they'll make something to match whatever you're craving.\n\nThe space here is limited, as with most SF spots, so try to make reservations, or be prepared for a small wait on weekends. This also makes parking the pits. And keep in mind that it's close to the gates of China Town, so you might get a few odd odors by the door, along with the wandering tourists.", "author": "T P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-03-26", "description": "I kept it simple and had the French onion soup, a chicken caesar and the Côtes du Rhône by the glass. All were very good, and the folks I was with said their Filet Mignon and Seabass were both good as well. I actually was going to order but skipped the scallops because I could smell our table-neighbor's from 4 feet away and they did not smell appetizing. \n\nThe service was relatively fast, though not what I'd characterize as welcoming (they were just to the point, not unfriendly).\n\nThe price/performance is not very high. It's not exactly what I'd call a *fancy* French restaurant, even though Steak-Frites is $32. The restaurant overall is dated, and the food not great enough to demand those prices.", "author": "Chris T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-28", "description": "So, my fiancé and I just ate here and I have to say that we were nothing short of impressed by both the meal and the service. The presentation was excellent, the portions exactly as they should be for a French restaurant. We ordered the Grilled Salmon with Asparagus and the Fillet Mignon with the pomme puree (mashed potatoes). Cooked to perfection! To conclude the meal, we had the Creme Brulee that was once again, prepared to perfection that would most certainly give many restaurants in Paris a run for their money. Bon Appétit!", "author": "Gerald D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-07-02", "description": "This was probably one of the WORST dining experiences that I have ever had. We came here for my best friends birthday dinner. My partner was not feeling well and needed to go to the bathroom. I went with him to make sure he was ok. Another friend also came back a little bit after to check on him, he was fine, just sick. The bartender then took it upon himself to come back to the bathroom and very publicly yell, for the entire restaurant to hear, \"What's going on? Are you two ok in there?\". My friends also overheard the bartender making snide remarks about the two of us. He implied the two of us were doing something in the bathroom together. I am appalled that a restaurant would employ such a despicable human being that would treat its customers so poorly. He continued to laugh loudly about the situation. I would never recommend this restaurant to anyone. The restaurant manager seemed to approve of this behavior as all she offered to do to rectify the situation was to give us her business card and to join them at a later date. We immediately asked for our bill so we could leave. Upon paying the tab and leaving, we observed the restaurant manager and another employee eating the dinner we had ordered. It's a very unfortunate thing as the appetizers we had tasted were great but their employees ruined it. I have never had such a demeaning experience in my life and would urge you to stay far, far away.", "author": "Josh S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-07-11", "description": "This was the worst dining experience of my life. I have never been insulted and treated so poorly by staff at an establishment. The bartender was out of line and completely rude to my husband and I. I will never go back here. We didn't even stay for our entrees. Completely disgusting!", "author": "Danielle M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-08", "description": "It's time to update my review of Le Central.   We like this small restaurant and have been here several times for lunch.  One of these times we must try dinner here. Not sure the menu is any different.  But the service is always consistent.  Once seated, water or beverage is offered and then you are presented with menus and a small blackboard listing the specials of the day.  I highly recommend those!\n\nWe both had Petrale sole in a lemon butter sauce with boiled potato, carrot, and broccoli on the side.  It was perfectly cooked with an egg wash and then sautéed.  At least that's how I tasted it.  There were two portions of sole so my husband and I could've easily shared this dish.  We did split a butter lettuce salad to start and that is always good with a light creamy vinaigrette dressing and a small amount of chopped egg on top.\n\nWe had excellent black coffee and skipped dessert.  We were full.  And we will  definitely be back.  One can always count on Le Central for a good meal---it rarely changes and it's nice to be able to know what to expect!", "author": "Mary A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-17", "description": "Back here on a business trip after too many years... Crossed the bay for a dinner!\nService is fantastic and the cassoulet is amazing, like it has been for more than 40 years!!!", "author": "Renaud J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-28", "description": "Ember is the best female bartender in the Bay Area.", "author": "David W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-31", "description": "We went here for date night. Service was ok. Food was good. Large portions. Classic French fare but reasonably priced. Dessert is the reason this got four stars. The meals were nothing to call home about, but the dessert was spectacular. If it's a cold night and you want some French onion soup and some steak frites, this is where I would go. Don't sit in the bar, sit in the dining room, it's much nicer.", "author": "Liza C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-06-18", "description": "Went to this place because the restaurant we initially planned to go \"Akiko's\" next door was completely booked.  Should have known better before we even stepped in here s the place was virtually empty on a Friday evening.  The ambient is good but the food is horrible.  Just horrible. The worst \"Salad Nicoise\" I've ever had.  The tuna was cooked solid as a rock. The unfriendly waiter proceeded to tell me that this is the French way of cooking (vs searing it slightly).  That may have been but I am sorry, it can't be the French way to make it taste terrible.  Too much dressing on the rest of the dish.  The crab cake is OK but way too dry, making me think they took it out of the fridge and microwave it.  The only saving grace is that my friend's scallop dish is done properly, seared lightly.  She seemed to think they dumped on too much butter.  The worst thing is my stomach was upset the next morning... I would not come here again.", "author": "Jenny L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-09", "description": "Oh my gosh -just checked out some of these reviews and I'm incredulous -what a fantastic place in that the staff are the most attentive -the food is fantastic and there is nothing amiss - \n\nThis place is a \"go-to\" place -totally consistent - great spot whether it's a quiet meal or a celebration\n\nDo ask what's NOT on the menu -they ALWAYS try to accommodate their guests -it's the French way of doing things!", "author": "Ruthie N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-05", "description": "I had dinner on June 16th when the Cassoulet was 13,662 days old or 37.4 years old. The Cassoulet was very dense and rich. Packed with white beans, duck, pork and lamb stewed together for 37 years, you start to feel the effects after eating half of it.  After finishing the meal, food coma started to blanket me and there was a need for coffee.\n\nLuckily I also split a fish special, breaded and baked, over vegetables in a white sauce.\n\nI came here for a early dinner, most of the patrons were at the bar drinking, towards the end of dinner there were more patrons having dinner. Looking at the menu, the next item I would like to try is the Blood Sausage special!", "author": "Brandon W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-09-29", "description": "Only rating the drink menu and bar as I'm not eating. I stopped in for a glass of wine and was surprised by the limited offerings at this French cafe. My by the glass choice ended up being a CA Zin! Attentive bartender and it looks like the food would be good. I may have to come back for food!", "author": "Jim U."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-13", "description": "Never a bad meal. Far too much emphasis by Yelp reviewers on who eats there, not enough on superb French bistro fare. Had cassoulet this week, perfect for cold weather. As always, my server was a gem, she always is", "author": "Christopher F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-21", "description": "Very nice lunch. French food that was fresh and delicious. Great service. I will return. We both had halibut special which was perfectly cooked. Ceasar was real.", "author": "Ann P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-01", "description": "3.5 stars rounded up!  My friend and I came here for Dine About Town, and it was an enjoyable place for us to catch up.  \n\nHad:\n* Baguette (loooooove baguettes - I have to STOP myself from eating it all and something about the kind of butter they serve it with was *SO* good, I really tried to make myself stop, really)\n* A refreshing glass of sparkling wine\n* Crab cake (perfectly crispy, loved it, mmm, I would order this again in a heartbeat)\n* Salmon (I try to eat fish twice a week and tonight I wanted salmon, nicely cooked, got full on the baguette so had to take it home, lovely as leftovers, mmm!)\n* Crème brûlée (sweet, creamy, gone gone gone in seconds)\n\nNice service, great location, quaint, feels like a piece of SF history.  Glad I got to try Le Central.", "author": "Maile N."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-03-29", "description": "Mediocre at best. Came her with some friends for lunch. Music was blaring and they were playing Beach Boys, Doo Wap, and Motown. All music I love, but incongruous in a French restaurant. Food was so so. I ordered the salmon and it came out luke warm. For 24.00 I would expect it to be piping hot. Bartender was great and made delicious cocktails. Food just seemed to be lacking. Always wanted to try it, and now I have.", "author": "Lauren K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-07-22", "description": "We walked in for week diner. Not terribly authentic French. Doesn't appear to be cook to order\nSteak tartare was really basic while onion tart with too much onions but taste good.", "author": "Claire C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-28", "description": "The best happy hour in the city. Five dollar Bordeauxs. Ask for an ashtray in French and they might bring you one with a complimentary pack of Thai cloves. \n\nOysters clams and crabs....  Good food also. \n\nThe bartenders are wonderful, engaging and friendly.\nVery small folks. Brother and sister, i think. One wears ties. The fellah loves Underberg. Tip him with underbergs and he will tell u a funny story about something Willie Brown or Don Johnson did there... His Melanie Griffith impression is spot-on. \n\nA simple old school french menu. Atmosphere is intimate and inviting. Winona Ryder comes here after shopping at Niemans. I asked to see her receipts. She was totally cool with that. Classy. \n\nSome weird Marin chitchat at bar this last time. Only drawback. We should ban them. Mr Gorbachev, bring this bridge down!\n\nNazdrovie! Merci duchamp. \n\n\nOld San Francisco at its best.", "author": "venice anon A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-18", "description": "We ordered a lovely dinner. We started with escargot that were the best we ever had. I had a quinoa and chicken salad that was sooo good and my husband had steak tartare. The service was outstanding and we had a wonderful time.", "author": "ilene g."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-06", "description": "I love a restaurant where the owner greets you warmly as does the wait staff like you're old friends. \n\nThat wouldn't be enough, however, to garner the consistently great reviews and loyal customers that Le Central has and deserves unless they also served delicious, often sophisticated, bistro fare. \n\nThey do -and they do it so well..\n\nToday, I took my BFF for a belated birthday lunch. We'd actually planned this lunch for 8 months at her very specific request - based on my rave reviews - to celebrate her birthday at Le Central.\n\nWe grazed through the menu so she could sample their classic fare of the onion tart (so buttery and delicious), the crab cake (pure crab meat, plated on a beurre blanc sauce) and then for me, a difficult choice of what to choose for an entree. \n\nMy friend had already decided months in advance she was having their popular chicken pommes frites (side of super-garlicky aioli, by request) and I had the filet mignon au poivre. It was the best piece of beef I'd had in years, so tender and buttery -and it was perfectly cooked (rare). Despite its generous portion, I have to admit I did eat every bite.\n\nFrequent Le Central customer Willie Brown was having lunch there with Ron Dellums and Wilkes Bashford generously let me intrude on a talk of current movies (I overheard him saying how much he loved the movie, \"The King's Speech.\")\n\nEven though he really doesn't know me, but has spotted me from time to time at Le Central, Mr. Bashford gave me a gracious good-bye and good wishes for the New Year. Le Central engenders that unpretentious and friendly atmosphere.\n\nAnd the good food and service put it on my \"Top 5\" places to dine in the City. \n\nIf you haven't gone there yet, put it on your New Year's resolution list.", "author": "Jennifer O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-19", "description": "Absolutely delicious meal. Loved the onion soup, scallops, goat cheese tarte and our Louis Latour wine.  Scott out fabulous waiter was very attentive and made excellent suggestions for wine and soup.  Service by Scott was five star and I would definitely return for another elegant meal.", "author": "Blue S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-02", "description": "There is something to be said for a French Restaurant which touts that it's cassoulets have been burning for over 14,000 days!\n\nBut seriously, their cassoulet is excellent.  Decently priced and quite filling.  \n\nThis is a very traditional French Bistro, white table cloths, waitstaff in ties, a Matre'd, and simple (read elegant) cuisine.  \n\nThe salad is a kind one does not see often in bistros anymore: a cut wedge, with simple vinaigrette. \n\nTheir steak au pouivre is incredible, as is their rack of lamb.  \n\nAll in all, a great spot in San Francisco, that needs to be patronized by all who can.", "author": "Devin C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-10", "description": "The worst thing about this restaurant is choosing what to order, everything is just too good! The thing I love about this place is that is that it offers the best of what I crave in a French meal; delicious ingredients really, really well prepared that just taste like the best home cooked meal ever. \n\nTake their cassoulet, it tastes like comfort in a bowl and the Paté de Campagne, well, who doesn't like pork with a side of pickles? The Goat Cheese & Leek Tart Frisée, is something I could eat everyday of my life and the Grilled Wild Salmon Beurre Nantais is crazy good. I could go on and on but there are other things I love about this place. \n\nThe ambiance is old world charming and not in a faux way. Le Central is forty years old and it lives in a brick building significantly older than that, it has a fabulous brass bar top imported from France, comfy seating and decor just funky enough to feel homey; I feel like I'm eating at a friend's house.\n\nOur waiters have always been knowledgeable and exceptionally good at their job. I have to admit the last time my sweetheart and I ate here he had just one too many glasses of the delicious wine we ordered and he was just a tad boisterous. Our waiter was not thrilled but handled it like a pro and a lovely dry wit. \n\nThis really feels like an authentic French bistro experience in the heart of San Francisco. I just wish I lived closer and could eat here every week!", "author": "Addison M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-21", "description": "We spent the past Valentine's Day here. It was good!\n\nIt took longer than we thought to get there so I called them to let them know we would be late for our reservation. They appreciated the call they said. A half hour later, we walked in and they accommodated us with no problem. Very nice of them.\n\nThe space is very tight. However, it seemed to work out ok. You get to know fellow diners and what they are having.\n\nIt was a pre fixed menu for the evening. Having been to France the year before we were eager to try the American version of the foods we loved. \n\nThe Escargots de Bourgogne was succulent. I could not stop dipping my baguette into the left over sauce of garlic, herbs and butter. \n\nThe French onion soup was exactly what we had hoped for with the abundance of gruyere cheese and savory broth.\n\nWe had the Filet Mignon au Poivre. It was the best we both have ever tasted. Simply perfection melting in your mouth. I had a Sea Bass I believe, but I kept eating from my husband's plate instead. YUM!\n\nOur experience with the Crème Brulee was not as good. We found it to have an egg-like consistency rather than a smooth texture.\n\nThe wait staff was helpful and courteous. I think we were expecting the waiter to clean the crumbs from the table with a crumb sweeper. But only because we experienced that before in other French restaurants\n\nI must give applause to our waiter (which I forgot his name, blonde gentleman).\n\nWe told him we were on our way to the symphony and he advised us on a shortcut to get us there on time. \n\nWe made it! Thank you Sir. :)\n\nAnd thank you all for a lovely Valentine evening for my husband and I.\nCheers!", "author": "Brenda S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-09", "description": "The first time I went, I would have given the place 5 stars. The roasted beet salad was to die for. I would have returned just for that! The crab cakes were melt in your mouth. The second time I went, the beet salad was not as I had remembered, it was not as fresh. Perhaps beets were out of season? They serve a very delicious local butter with their bread. It's the small things! I could have just eaten it. I was glad to see that this did not change. \n\nWill I return. Oui, bien sur!", "author": "Kae J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-11-14", "description": "The Setting:  Dinner with a coworker, Tuesday night 8pml, had a reservation, seated immediately.\n\nFood: 4 stars\nService: 2.5 stars\nAnd ditto Q.L's post about the host being a bit awkward...\n\nThe GOOD:\n1.  Escargot - I'm kind of a sucker for Escargot, but this was quite good.  The snails were cooked perfectly and the butter sauce with the bread was wonderful.\n2.  Cassoulet - wow.  Get this.  We both loved it!  Meat and White beans and sauce were all amazing.\n3.  Creme Brulee - I've had some bad creme brulee and it seems easy to mess up, but this was well executed.\n\nThe OK:\n1.  Grilled Salmon - While good, this was completely overshadowed by the Cassoulet and Escargot.\n2.  Service - While kind and well meaning, the staff was less attentive than I would have expected at a restaurant with the upscale atmosphere.  We had to ask for water and had to ask for a refill.  And had to ask for the bill twice.\n\nThe BAD:  nothing\n\nThe Bottom Line - Very good food and atmosphere with fairly mediocre service.  But for the price point and food quality ($60/person got us an appetizer, two entrees, a dessert, and a half-bottle of wine) this place is worth visiting, especially with it being worth 1,000 points on OpenTable (equivalent of $10 credit).", "author": "Kevin S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-11", "description": "Amazing onion soup and escargos. My favorites! What a treat to go here. Enjoyed every bite.", "author": "Betsy R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-13", "description": "Nice upscale restaurant. Had the Onion Tart (it was lunch) and it was good. Next time I will get the long-time-cooking stew.", "author": "Brian S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-10", "description": "Unlike the industrial-chic look that has permeated most of San Francisco's newest dining establishments, this restaurant stays true to it's roots and transports you to a french bistro. Ok they do have an exposed brick wall but it is offset by their great bar and white table clothes - this isn't manufactured authenticity, it IS authenticity. I love going to this place because people are refreshingly open to having a conversation with you instead of just looking at their iPhones. The food is classic french - no noveau french, not french infused - classic french. Try their steak tartare - it's some of the best in the city because they use better cuts of meat than most of the other restaurants. If you are low-carb you can always get it with endive instead of toast. Best part of this place is sitting at the bar - if you are fortunate for Kirsten to be working that evening she will entertain you until you realize you were supposed to go home 3 hours ago. Who knows you might also run into Willy Brown playing liars dice there if you are lucky. Definitely a place to come to and experience because you get that local feel of a restaurant that knows who it is.", "author": "Megan P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-12-25", "description": "Le Central has one of the best roasted chicken with pomme frites in the city!! That is my favorite dish. The salads and soups are good too (fresh ingredients and simple preparations).\n\nThe place has an old time atmosphere, which I like. I think it's amusing how they use a large board of \"specials\" that they put on your table. It's crowded during lunch time, but dinner is usually more pleasant.\n\nAnd yes, this place is expensive for a bistro. Service is not perfect. But I like to drop by when I crave their roasted chicken and pomme frites (always perfectly prepared - tender chicken with au jus, toasted skin, and crispy golden fries). Very yummy!!", "author": "Luis C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-04-15", "description": "Went here again last evening. Yum yum yum yum.  I had the special.  It was brisket with a horseradish sauce, potatoes and spinach.  It was PERFECTLY done brisket and it exceeded my expectations.  I had the onion tart as well- My dining partner had the duck rillettes with aspic yum yum yum yum and the escargot and the cassoulet- all SUPER great.  He did not really eat all of it himself, for I, of course ate some too.  Everything was delicious!!!\n\nI love this place, can't you tell?  It is a down and dirty French restaurant.  The cassoulet has been on the stove for 13,000 some plus days and a few months thus far.  The service is so nice and unpretentious, and it is not over priced.  We got to sit at a table by the window and talk and enjoy ourselves for a few hours.  I hope this place stays open forever!", "author": "Lisa M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-02", "description": "i don't know why we decided to come here for New Year's Eve dinner but so glad that we did.  We probably passed by this place a gazillion times in Union Square without ever noticing it! This was one of the only restaurants that had a reservation for 8pm available for a table of 7 so off we went.  \n\nUpon entering, the place is really charming. In addition to the NYE decor, I like the exposed brick wall, the two dining rooms separated by the bar, and the cozy bistro feeling of the restaurant (it's the oldest French bistro in the city!). Our hostess was really friendly and seated us to our table even though only 1/3 of our party was there. Our waiter was the no nonsense efficient but nice kind of guys-kinda reminded us of Chris Farley.\n\nReviews from the peanut gallery:\n\n*Cassoulet-pretty good, heavy stew if you are in the mood\n*Rack of lamb-good and cooked perfectly\n*Filet Mignon Au Poivre-delicious and cooked a perfect medium!\n*Pomme Frittes-fresh of the fryer..yum!\n*scallop entree-yummo\n*Cappucinos-just the way I like it and the perfect way to end the meal.\n\nI was really worried that this place would be a disappointment but I think everyone enjoyed their meal (whew). The portions are also perfect, not too big, not too small, just right!", "author": "Betty C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-26", "description": "Random night in union square brought me here for dinner. Looked up on yelp, and only 1 friend reviewed this place...... Cher, selena, where u guys at? Could be a bad sign.\n\nSomething about the host seemed off. But anyways the customer service here lacks slightly compared to other French restaurants in sf. Food wise here's the low down.\n\nClams - a little too much garlic but had a nice sharp kick to it. Mustve been chili peppers. But the broth was so good I had more bread to go with it.\n\nPork chop - a little dry but that's ok. Well seasoned. The sides that came with it was really well done. The scalloped potatoes had a creaminess to them while still having a nice bite to it. The beets and raspberry sauce added a sweet and sour taste to the dish. So much contrast of textures and flavors going on in this dish.\n\nNot bad but could be better.", "author": "Q L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-08-18", "description": "3.5 stars\n\nWe were headed to try Gitane but they are not opened yet.  So why not try Le Central?  It's been around for a long time...\n\nWe only wanted apps and wine so we sat at the bar.  The bartender, Heather, was very friendly and attentive to all her customers.  We sat at the inner corner and just admired the space and its history.  A lively regular came in and started a conversation with us...and then another regular came later and she was very friendly.   We can see this as a Cheers to many and an enjoyable spot to enjoy a drink or two to release a day or week's of stress...\n\nWe had:\na glass of Bordeaux - $10.50\na glass of Cabernet - $11.50\na dozen of oysters - $24 - ok, not chilled enough\nsteak tartare - $15.50 - absolutely DELICIOUS!\n\nIt is not easy to find restaurants serving steak tartare, harder yet to find a good one...we will happily return just to have the steak tartare, YUM!", "author": "Gloria H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-06", "description": "Escargot and pate was as good as in France! Cassoulet was amazing and gluten free (win!). \nPretty small place and had to overhear some very strange conversations, but the meal made it worthwhile.", "author": "Gramma L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-07-15", "description": "Absolue fantastique !!\n\nThis is the ideal spot to celebrate Bastille Day (July 14th). It's all about traditional, heavy country style French cuisine. (Not the modern light fair.) It's frequented by old money personalities dressed to impress. I'm told Willie Brown has a permanent table at the entrance of the restaurant. \n\nWe made last minute dinner reservations through OpenTable in honor of Bastille Day. The moment I walked in from the streets of downtown San Francisco, I was transformed to Aix en Provence, France. Once we arrived, they greeted us and seated us immediately. Everyone was dressed in French berets and patriotic neckties. The two small dining rooms and bar area were serenaded by a talented accordion player with traditional French tunes. At times, the musician would hum along with his music and customers hummed or sang along as well.\n\nThis is a small restaurant with lots of tables close to each other so we made new friends with revelers on both sides of us. Every time someone got up, the servers were right there to shift the table to help you in and out. It felt just like a packed family dinner table. The entire dining room felt like someone's home. Great service throughout our dinner. \n\nInstead of the regular dinner menu, a special Bastille Day menu was offered. It included several of their popular dishes. We couldn't resist the aromas coming from the kitchen.\n\nAppetizers:\nFrench Onion Soup - hmmm....skip next time.\nEscargots - Great!\n\nEntree:\nCassoulet - Delicious!  (if you've never had it, it has white beans, sausage and duck served in a little iron pot cassoulet.)\nBeef Bourguignon - Flavorful!\n\nDessert:\nLemon Souffle - Light and tart! Absolute must order!\n\nA wonderful neighborhood gem right down the street from the French Consulate. It's a must visit if you live in SF or just visiting. It's a small and very popular restaurant so reservations are highly recommended.", "author": "Christine T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-13", "description": "I love this place and have been coming here for a few years now. My favorite dish is the cassoulet. The escargot and celery remoulade are amazing appetizers. The desserts are quite good. Right now you can get the best deal in the city for great french food -- a $40 prixe fixe which includes an appetizer, an entree, a dessert AND a glass of wine!", "author": "Ish H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-08-07", "description": "Extremely disappointing. I wish I had checked Yelp prior to eating there because I notice that they have 3.5 stars, and after my experience I find that many stars to be very generous. We were 3 for dinner. Entered the restaurant and were seated immediately because it's wednesday and not too many people were out having dinner. After being seated one of my friends went to the bathroom. In that time the remaining diners ordered cocktails. When my friend returned from the restroom he ordered the same drink I had, a dirty martini. My drink came within moments of the second martini being ordered, but sadly his never arrived. After 10 minutes my friend asked the waiter, who finally acknowledged us, that the drink had never arrived. We could see the server asking the bartender only to learn that the server was not the only one to forget the beverage, but the bartender did as well. At that point my fellow diner told the sever to forget the drink. What was the point since it looked like it would take forever. I guess if we had followed a another tables approach and gotten up from our seats to inform the waiter of the need for a beverage we would have received our order.\n\nFood. Well after the drink incident we decided to cut our orders short. No starters, just 1 dish per person plus a side of fries. I ordered the lamb chops medium rare. It was an extravagant dish and quite costly, but it was a special occasion. When they arrived I started to cut into dry overcooked meat. Instead of the juicy medium rare they were more medium to medium well. Not a good sign. Lamb is not a forgiving protein. I took a couple of bites, but realized that majority of the meat was tough and not worth the effort to chew. Upon realizing this the server offered to get me something else, but considering what my fellow diners were eating I didn't want to hold up the group by waiting another 15-20 minutes for a new entree. \n\nWhen the check arrived I thought to myself this is absolutely ridiculous to pay $60.36 for a meal that was neither enjoyable nor filling. I hope the servers and kitchen staff appreciated eating all the meat that was left on my plate. I should not have to pay for the staff meal and definitely learned my lesson. San Francisco restaurants can care less about their diners. They just think we're going to go quietly after bad service and terrible food. I hope others see this review and think twice before wasting their time and money.\n\nSpend a little extra to teach your staff proper techniques for the dining room as well as the execution of your menu.", "author": "S P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-24", "description": "What a great place. Our bartender, Kierstan, is an absolute delight. Great drinks and conversation and a fantastic happy hour.", "author": "Steve K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-23", "description": "I really loved the food and I had a really great experience.Charlie was really nice My daughter even got to see a special show.", "author": "MARY GRAY S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-05-20", "description": "Delicious, classy, service-oriented, and all-around great. Choosing what to eat was difficult, and I was glad the menu wasn't any longer; it was particularly fun to have the daily specials on a small chalkboard that was delivered to the table.The cassoulet was excellent, though I'll admit some might find it just a touch salty. My sea scallops were exquisite - tender and just barely opaque all the way through. The service was attentive and unobtrusive throughout, charming but nearly invisible. The brick walls, patterned floor, and general decor all reminded me strongly of my time in France\n\nWhat put it over the top for me, though, was the end of the meal. Without a word, the waiter brought out a plate of their tiramisu with \"Happy Birthday!\" written lavishly in chocolate drizzle on a base of sweet cream for my companion. Two glasses of dessert wine accompanied dessert and made for a perfect denoument. \n\nTres bon noir - merci!", "author": "Bill B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-05", "description": "Been in business 40 years now and no wonder, a true French restaurant in the middle of downtown San Francisco 1/2 a block away from the gates of China Town on Bush.   The warm goat cheese salad is terrific and the prawn risotto is the ONLY thing I order because it is so good.    Been here for dinner probably 30+ times and have great memories of entertaining co-workers and friends and many quiet nights alone...", "author": "John P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-10-28", "description": "It was ok. Went for brunch and all 4 people in my party were unimpressed. For the money and nice atmosphere I expected more. Wouldn't go back.", "author": "Scott C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-25", "description": "The BEST Escargots de Bourgogne and Poached Salmon in town! Le Central can sometimes be mistaken as a private club for San Franciscans. The service is extremely attentive and the  employees remember the names of the regulars. I wish to express my gratitude to Paul, Charlie, Eric, Toni, Louie, Scotty, Jimmy, Johnny, et al. Congratulations.", "author": "S R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-04", "description": "Good food. Good service. One of the best filet mignon's in the city; has a black peppercorn sauce that's fantastic. Definitely in the heart of the tourist-y area of SF, but worth a visit. Also, they are on open table, which I am a fan of.", "author": "Ryan P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-01-22", "description": "Mixed feelings about this place. I ordered the Escargot to start and had the rack of lamb and cremebule for dessert. \nEscargot was great well done to that and i got an extra one of the hole had 2 of them score for me!\nrack of lamb was also great it was seasoned very well. it came with 8 ribs and it was hard to finish but i did anyways since i didn't want it to go to waste :) \nthe creme bule was decent. seeing so many reviews for this i decided to give it a try and it was only alright. the biggest thing i ddin't like about it was the temperature that it was served. the bottom of the creme bule was cold like it had been in the refrigerator while the top was warm since they had just caramelized the sugar on top. so it wasn't very enjoyable. \n\nthe setting is also very crowded. even though the place was not at all. we were there at 530 on a saturday night we tried to make reservations later but they said it was all booked. but still saw a bunch of empty tables when we left around 7. the tables are set really close to one another so you can easily over here what the next table was talking about (i did over hear a great story). We were seated parallel to the bar. to sit down you have to pull the table out so that there is room to squeeze by and also when you have to get out to go to the bathroom it was a big hassle. also i sat on the outside not against the wall and my chair was being hit all the time and that was with no one sitting at the bar stool behind me i can only imagine what it would be like if someone was sitting behind me at the bar.  The service was attentive and nice but the setting of this little restaurant trying to pack in as many tables as they possibly could really need", "author": "Steven N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-01-08", "description": "This place is a BIG JOKE.   \n\nFor many, many years, I would pass this restaurant and have always been intrigued by tthis \"French\" restaurant that supposedly had a lot of history.  Finally, I found time to stop by and have lunch here last Friday.  After reading so many positive reviews, I was excited to finally try Le Central!  With that in mind, my expectations were quite high...\n\nWhat a surprise!  I t hought this was a French restaurant...but I think I actually walked into a Chinese restaurant.  From the host/owner(?)/manager(?), to the waiter, to the bus boy to the cook!!!, they were all Chinese!  The service I received was also comparable to a dimsum experience -- harried.  They spoke Chinese too! (IN A FRENCH RESTAURANT!!!???)\n\nI ordered the French Onion Soup - which was bland and very ordinary ($9)\n\nFor entree, I had the Sea Bass special of the day - supposedly fillet -- but had 4 big bones ($28).  This too was very ordinary, bland and dry.\n\nLemon Souffle for dessert that didn't do anything for me ($11).  This is comparable to something you can order from Denny's.\n\nDiet coke was served in a 6 inch tall, very narrow glass, full of ice.  I probably had 2 good, long sips from my straw...and like magic, it was all gone. ($3.50)  I asked for a refill and I don't know what I was thinking.  I guess I expected a bottomless drink.  Until I got my bill and I got charged $7 for my Diet Coke.  I asked tthe waitress if this was perhaps a mistake and she said it wasn't a mistake.  I told her I only got 2 good sips from the first glass because it was basically 80% ice.  But she just shrugged and said \"oh  no, that's the way we do it.\".\n\nOne of the reviews commented on the staff brown-nosing the host/owner/manager; SO TRUE!!!  The staff not once failed to whisper something to host/owner/manager everytime they passed him.  \n\nThe place was also filthy.  It didn't help that I sat right in front of the kitchen.\n\n1 and 2 star reviews are so so true.  This place is a BIG TIME WANNABE.\n\nProbably once upon a time this place was a must-go.  What a complete waste of time and money.", "author": "Jake R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-06", "description": "A nice french-inspired bistro.  They have a fun wine program (currently featuring one of my wines, Corkscrew Luma Blanc).  A great place for tourists and locals alike.", "author": "Kaveh A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-27", "description": "I just had dinner here last night to celebrate my 1.5 year anniversary with my boyfriend so I thought I'd write this review while the experience is fresh in my mind.\n\nThe first thing we both thought when we walked in was, \"wow this place is French.\"  -- as in the decor.  We were seated right away because we had a reservation (general tip:  whenever you can, make a reservation, it will make dinning out a lot easier).  \n\nThe tables are veryyy close together (in fact, the waiter had to pull the table out for me to get to my seat.  Also it did get pretty loud during dinner, but not unbearable and understandable considering the place was packed.  It was pretty busy so we were served by just random waiters which made it a bit confusing when it came to asking for the bill at the end.\n\nAs for food, we had the crab cake for our appetizer and my bf really liked it but I found it a bit too \"carb-y\"?  Later he had the half chicken and said it was pretty good and I had the grilled salmon.  OMG.  Best salmon ever.  Not fishy, buttery, and soft and the sauce was amazing too.  \n\nAs for the price, I think it was a BIT overpriced for what it was, but then again it is a slightly fancier place.  This is considered a classic in SF so I recommend trying it, but I'm not sure if I'll go back (maybe just for the salmon).\n\nIf I could, I'd give this place a 3.5.", "author": "Vy L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-02-12", "description": "I came here recently and got the prix fixe dinner for dine about town. \n\nFirst of all, I really liked the ambiance - it's very French, from the decor, to the staff, to the way the tables are pushed very closely together. \n\nThe food: I got the french onion soup, which was good, but seasoned with too much pepper, which overwhelmed the dish and kind of killed it for me. The main course was roast chicken with veggies and mashed potatoes - this is a classic and they did a great job; I usually don't like chicken but this was delish, I could not stop eating. Finally, the chocolate mousse for dessert was solid, but its hard to screw that up. \n\nOverall this place was not an amazing food find, but I think its a solid neighborhood french spot. The one complaint I have is that the wine was horrible - first I asked the waiter for a recommendation, and it was a step above 2-buck-chuck quality. The second glass I decided to take a chance and was disappointed once again. For a French restaurant, I would like to see a better and more extensive wine list.", "author": "Tailor A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-10-08", "description": "What?  I have never reviewed this?  Okaaay.\nIt is actually one of my least fave places.  BUT, the hubs was brought up in a polish household and his mother served him Boudin Noir.  That is blood sausage for the rest of us.  He swears that the BN here is just like what his mom iced to make.  He loves it and makes us come every time we are here.  It is served with French fries.  I have no idea what it tastes like.  Today, they has pumpkin soup on the special board and it was just perfect.", "author": "Cassie P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-04", "description": "I have eaten at Le Central many times over the years and it feels as comfy as my old flip flops that my wife keeps wanting me to dispose of.  I have eaten through the menu and tend to stay on the light side of all things French these days, having the simple salads (when can you wax ecstatic about endive) and the frites and the onion soup.  Hey, this makes it a treat for veg-heads, but the fish and meats are also excellent.", "author": "Richard B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-09-23", "description": "Went into this bar for the second time. I'm not sure if they changed bar tenders or just got more pretentious. Got off work from a local restaurant and came over for a drink. We were the only people not dressed in business suites. People came and left and the bar tender never gave us the time of day even after we asked for service. Extremely disappointed in the service here. Servers judge by the cover. Don't bother going if your not wearing a business attire.", "author": "k l."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-21", "description": "I love this place. Old school SF style. The service is always great, yeah a little surly but then again that was old school. Don't expect your ass to be kissed but know what you want, order it and get on with it.\nLast night had one of the best pieces of fish in an encrusted Sea Bass. The cassoulet was great as always. Blood sausage is amazing. The short rib special fell off the bone. Places like this are dying out in favor of Nuevo cuisine and cement and steel decor. Don't get me wrong, I like new styles but you have to appreciate a place like this and be super glad it exists. Oh, and their Manhattans are amazing.", "author": "Dennis K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-10-21", "description": "Have I lived in San Francisco a long time?  \nYes.  \nHave I walked by this place a million times?  \nYes.  \nAm I kind of embarrassed that I never ate at this San Francisco institution until this past weekend?\nYes (she says with her head hanging in shame).\n\nWhen we stepped inside, it immediately felt like we were transported to a cute little Paris restaurant...minus snooty waiters and dogs at the tables.   It was a relaxed atmosphere and just felt comfortable.  If you go, try to get the table for four near the window.  It's fun to look out at the street or be near the open window on a warm evening (like we were).\n\nI loved some of the little touches, like bringing the specials of the day on a board that they propped up on a tiny easel so we could all see it.  We also liked the way they served our martinis, too.  They served them in small martini glasses with only part of the martini in the glass.  The remainder came tiny little carafes sitting on ice in small buckets to keep them cold.  So cool.\n\nOnto the food!  The menu is classic French bistro food and we enjoyed everything that we had.  We decided to start with three appetizers and rotate them between the three of us:  beet salad (I'm a huge fan of beets and there were a ton of them), asparagus vinaigrette (special of the day), and prosciutto with cantaloupe.  All were light and nice starts to the meal.\n\nFor entrees we all chose something different.  I usually don't order chicken at restaurants, but for some reason it was calling out to me and I had the roast chicken with fries.  It was so moist and had lots of flavor.  My other friends chose the cassoulet and the halibut special and enjoyed both of them.  \n\nThe waitress was stretched thin as she was the only waitstaff there that night (not sure why because it was a Saturday night...maybe someone was sick), but I thought she did a great job.  She was friendly and we didn't feel like our service suffered at all.  We didn't have dessert, but we wouldn't have had time anyway as we needed to make a 7PM show.\n\nThe food isn't inventive or anything, but one doesn't go there for that.  It's just good food in a cozy atmosphere and you can carry on a good conversation with friends.  I'll visit again and would recommend it to my friends.", "author": "Kimberly B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-06", "description": "Nina and I met our friend Lynn here for lunch today.  She had a hair appointment next door and made a reservation on OpenTable.  Nina and I took BART in and walked up from the Montgomery Street station, just a few blocks.  It had been rainy this morning but the sun smiled on us.  BART went smoothly, there was almost no rain and we were on the early side for our 12:30 reservation.  We were welcomed, seated and given menus.  Lynn arrived at 12:30.  We had almost decided what we were going to have when the waitress realized we had not been shown the specials board.  She did and when Nina and I saw chicken livers that blew away anything else we had thought to order.  Lynn stuck w/ the roasted half chicken and frîtes she had decided on.  We were given a basket w/ sliced baguette and butter.  Lynn and I each had a glass of Vouvray, which was bit sweeter than either of us had expected, but was tasty and not too sweet.\n\nThe chicken livers, which were cooked w/ Calvados and cream and served over pasta, were easily among the best we have had.  Every bite was a pleasure.  Lynn's chicken and frîtes were accompanied by sauteed spinach.  The portion was generous enough that she took some home.  We finished off w/ coffee and tea.  Service was smooth, attentive and unobtrusive and the restaurant was gloriously old school w/ dark woods, wooden floors, tables and booths.  A large wood bar fills one side of the room where you enter.  There is a single bathroom for women and one for men.  The bathroom floors are of small white hexagonal tile w/ black grout and the art on the wall of the ladies' room is charmingly French, a combination of vintage photographs, drawings and such.  As you might expect, the bathroom was spotlessly clean.  Le Central is a place I would return to.  Lunch was delicious and we enjoyed meeting in such an iconic yet unpretentious San Francisco place.", "author": "Toni M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-04-02", "description": "This place is WAY overpriced for the less than mediocre food. I ordered a Caesar Salad: It took 25 minutes and I could have made a better one myself. There was literally nothing to it. It has a cool ambiance but the food isn't good.", "author": "E L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-03-14", "description": "My coworker and I came to try the Cassoulet, which was 13,556 days old. The restaurant was very empty at 11:30, so if you want to go for lunch, go early. The dining area did have a strange smell - more like pine-sol. The fresh flowers on the table were lovely.\n\nThe service was ok. Our server did not offer any descriptions of the specials. In fact, no specials were mentioned, but a little chalk board was hung on the wall near us so we could read them for ourselves. After our order was placed, the chalk board was taken away. I noticed an insect on the sleeve of our waiter, mentioned it to him, and he was very appreciative of my notification.\n\nThe food was ok. We ordered the endive salad, cassoulet, and the Apple Tarte Tatin. The endive salad did have a nice dressing. The cassoulet was served in a very cute, Le Cruset mini-cocotte. The Tarte Tatin, was not sweet and bits of the apple core were in the apples. It kind of had a strange flavor, as I expected some apple taste and maybe a hint of caramel, but it didn't taste like that at all. It was served cold with whipped cream and caramel sauce.\n\nAs the restaurant filled during lunch time, it was as if a play had begun and the characters began to fill the stage. You can tell there are a lot of characters that dine a Le Central on a regular basis.\n\nAll in all, I'm glad we went for the experience, but I'm not sure if I would come back again. \n\nHere is my blog entry with photos:\n\nhttp://madeitlikeamy.wordpress.com/2012/03/14/le-central-and-the-13556-day-old-cassoulet/", "author": "Amy V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-01", "description": "Want an old school SF lunch? This is the place. Food is great, scene is awesome and service is top notch. All that will cost you what it should cost you, which isn't cheap.", "author": "Conor B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-11", "description": "I love Le Central -- it's a fabulous country french place! I go here for lunch whenever I'm in town and always order the celery remoulade (Classic!) and cassoulet! So if you're a fan of classic french country -- you must go here; there's not many places where you find Cassoulet that been cooking like it should be!", "author": "Ana M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-17", "description": "Took a date here Friday night and could have had better service.  10 STARS!!!  They were super attentive and made us feel like family.  Definitely coming back!!", "author": "Alex G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-26", "description": "I love old timey places like Le Central, where everything seems to have frozen in a bygone era. On a particularly melancholy Thursday, I stopped in, by myself, for lunch. Discovering Le Central was completely unexpected-- I stumbled out from a hair appointment at Elevation next door-- and totally welcome. \n\nI was in a terribly nostalgic mood and the small, dark European interior was inviting. I sat down with no wait around 1pm. Service was efficient, well timed, gave me sufficient space to ruminate over the tunes of Louis Armstrong. The waitress didn't bother handing me a wine list or dessert list, which was sort of surprising; usually they fall all over themselves to push a glass of cabernet or a slice of tiramisu on you. The crowd was 50+, white crust, lots of regulars. \n\nLunch for one, about $50 (crab cake, grilled salmon, cappuccino, sparkling lemonade). Crab cake is generously sized, grilled salmon was rich, but not dazzling. Prices are reasonable for French bistro fare. The ambiance is not for everyone-- bring your own moody film noir attitude.", "author": "Alyce H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-10-25", "description": "We walked in looking for Happy Hour, were seated at a table, ordered drinks and then were advised HH was only at the bar.  When we wanted a seat at both, they were disgusted.  So we had our wine, onion soup - bland and boring, and cassoulet, which the board outside noted the cassoulet had been cooking for days and days and days, but the flavor was also bland and boring.  Not worth ordering.  Could have used more fat!  HA!  \nOld financial district vibe.  Several regulars in suits.  Tiny, classic space.", "author": "Monica S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-21", "description": "Cute French restaurant right on the line of Union Square and Chinatown.  The french onion soup was actually the best that I've had at a French restaurant in recent memory, and the fries were crisp and delicious.  I also liked that it wasn't too crazy packed so it was a comfortable dining experience all around.", "author": "Mel G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-02-15", "description": "Above average cuisine, good wine list if short, nice decor, and just average service.  It gives the impression of a place in dire need of fresh capital for remodeling.  There is no question that the chef is capable.  But the atmosphere feels like the late 1970's, and the staff while friendly are clearly not the creme de la creme in San Francisco.  I can safely say the crab cakes are large and excellent.  And the Sea Bass entree was very delicious.  I added a bottle of Pouilly Fuisse and came away quite delighted.   But please do this historic place some justice and make a few strategic upgrades.", "author": "Kurt L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-11-11", "description": "One can do better, I have been here several times and have been underwhelmed each visit. The maître d' (owner?) often seems overwhelmed and crabby. The restaurant is typically crowded with tourists  and the food is mediocre.", "author": "Tom J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-07", "description": "The Goat cheese Tarte was excellent. Enjoyed the Cassoulet. Can't go wrong with the Frites.", "author": "Mike V."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-12-29", "description": "We have had some good meals there before .We went for lunch and sat at the bar .We were given menus but told by the barman that he would get to us when he finished his game of dice .He was gambling with a customer .They then started playing by banging down the dice cup .It was loud and there was no way we were going to enjoy a meal .So we left ,he did offer us a table but you could hear the noise of the dice every where .Very strange .", "author": "mark B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-11-20", "description": "This place has a long, storied history. We had eaten here about 7-8 years ago and thought it was okay, but not worth the hype. We tried it again last night and came to the same conclusion: okay, but nothing remarkable. \n\nThe food was actually very good (French onion soup and their \"legendary\" cassoulet for me and roasted chicken for my wife). Rather than listing the winery for each wine that they sold by-the-glass, the wine list showed only the varietal (pinot noir, merlot, etc.)...but not the name of the winery who produced it. So unless you asked, you had no idea whether you were getting 2-Buck-Chuck or something far better.\n\nThe servers and hosts were all very nice, but lacked the finesse and care that you'd expect. There wasn't a lot of down-time between courses -- it felt a little rushed. It was service with a smile -- nothing more, nothing less. Pretty much \"I'm here to take your order and bring you your food.\" \n\nMoreover, one of the owners (or by all the fuss, we assumed he was the owner) was dining that night near where we sat and during the early part of our meal, he kept pacing throughout the dining room and was talking on his cell phone as he determinedly strode back and forth between the kitchen, his table and the hostess desk. \n\nOnce his wife arrived, a continuous stream of brown-nosers from the wait staff loitered by his table in the corner, which was just a few tables from where we were sitting. It made for a rather uncomfortable dining experience, as we felt a bit like interlopers rather than welcomed guests.\n\nSo I'd give the food 3-4 stars (nothing to complain about, but not remarkable enough for the food alone to bring me back again). I'd give the service 2+ stars...\"serviceable\" or \"pedestrian\" are words that come to mind.\n\nIf you're looking for a decent meal and not a memorable dining experience, it's fine. It was our anniversary, though, and we were expecting more than just a decent meal. Oh well, as they say in France: C'est la vie...", "author": "Rod H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-08-26", "description": "Came here for lunch with a coworker the other day. He had been here many times but this was my first. The banquette tables are FAR too crowded, so we opted for the bar and glad we did. The bartender was gracious and suggested a vin ordinaire white Burgundy that was surprisingly wonderful and inexpensive. Upon my friend's recommendation, we each had the half chicken with frites. The chicken was very good - not the best I'd ever had but certainly good. The frites were perfect as was the service. The ambiance of this bistro is captivating and reminiscent of Paris. It has a \"we have been here a long time\" feel to it and its longevity clearly is deserved. It also appears to be a time-honored hangout for many movers and shakers in SF. All-in-all a really fine lunch and fun place to hang.", "author": "Kevin M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-08-29", "description": "Had dinner at 8 pm on a Friday night, the restaurant was dead.  The pate was good, especially with the dijon mustard.  My wife's cassoulet was very good.  I had the rack of lamb which was cooked perfectly but didn't have that much flavour.  The creme brulee was good but too liquidy.", "author": "David F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-24", "description": "This is one of the 'classic' SF restaurants that is a 'must' to experience.  It is the oldest French Bistro in SF and apparently a former mayor of SF would eat lunch there every day. \nIt is unpretentious, warm and welcoming. \nI accidentally found this restaurant one day when I 'missed' the official 'lunch hour' (it was 3:00pm) and while all restaurants seemed to be closed, they were open for lunch through to dinner - they do not close!  \nTheir food would be described as classic French food (meaning good sauces, but not too heavy and not sauces with  'everything'!), and you can tell by their steady, reliable, older, loyal crowd that they have earned loyalties through their consistent great service, food and atmosphere.\nThey have a wonderful - high end wine selection at very 'reasonable' prices - which is always a refreshing find!\nI highly recommend at least ONE visit to this great establishment!", "author": "MeeSun B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-06-21", "description": "Dined here alone while on a business trip to the US.\n\nThe food was acceptable, although not unique or fantastic.  Service was strange -- a bad blend of American casualness and European detatchment.\n\nNo prix fixe menu, had to ask for a wine list, paper tableclothes, etc.  French only in name.", "author": "Stephen B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-13", "description": "Came here with coworkers for holiday luncheon. My meal was paid for.. so maybe I'll be grading them on a curve LOL. I liked this place. Really nice French cute vibe. Food was good. I had the special which was lobster and scallops in what I would call a pot pie LOL. It was delicious with big chunks of lobster and scallops. Also had butter lettuce salad which was good. Didn't drink or eat any dessert but will definitely come back on my own with a friend or two. A good place to take out of town guests I think.", "author": "Vol T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-08-10", "description": "As the oldest french bistro/cafe in the city, this place has so much potential.  But, unfortunately it falls way short of what it could be.  My husband and I stopped by for dinner recently and ordered two glasses of Bordeaux, the chicken dinner, and goat cheese/leek tart.  The wine tasted cheap and was undrinkable, and we had to send it back.  Dinner arrived much too quickly and was luke warm and totally boring and bland.  The 1/2 chicken plate was dominated by french fries (and I'd be surprised if that was actually 1/2 chicken). And the pear served with the tart was right out of a can. \n\nTo the owner of Le Central - there are plenty of people who would embrace the old school french bistro. Update quality of your food, your wine and maybe hire a french server or two and you may just have a winner.", "author": "Sharon R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-06-04", "description": "We visited Le Central for the DIne About Town 2012 prix fixe special \n\nFirst impressions: The DAT menu was varied and offered picks from some of the restaurant's most popular dishes (cassoulet, roast chicken, onion soup, etc). The ambiance was cute, although the lighting seemed strangely institutional - that bright yet dim lighting of public school, if you know what I mean. Our waiter was grumpy but attentive. There is, however, a strange smell to the place that I notice has been commented on in other reviews.\n\n- Onion soup: OK but very oily (yes, more oily than this dish usually is). Surprised to see so much love for this in other reviews - maybe it was an off night for the onion soup?\n- Cassoulet: truly delicious, but I could only eat 1/4 of the dish before I started to feel ill. I'm a big eater, but this dish was just far too rich for me - and with the oily appetizer, it was just overwhelming. I highly recommend sharing this and starting with a salad instead!\n- Creme Brulee: I had a few delicious bites but felt too sick from the rest of the meal to eat much. Too bad, since it was very good. \n-Bread: I expect really delicious bread at a French bistro, and this was very mediocre.\n\nOverall, not a bad experience, but we probably would have felt disappointed about the food had we not been paying the discounted DAT prix fixe. Be careful about the richness/fattiness of the food and save room for dessert!", "author": "Orla Rose B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-02", "description": "I've been here twice.  First time was for Dine About Town and the food was okay.  Second time was last week and the food was great!  We got the escargots as an appetizer and there were delish!  One of my friends doesn't even like escargots, but she could stop dipping the bread into the garlic parsley butter sauce.  It was buttery goodness!  We got the steak and scallops as well.  The steak was cooked perfectly and the scallops just melted in your mouth!  I believe this is one of the oldest French bistros in SF so if you love French food you have to check this place out!", "author": "Elena N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-04-02", "description": "A classic San Francisco French Bistro with the waiters who have been there forever to prove it.  It bleeds tourist to locals, from Willie Brown in a fedora to folks wearing a fanny pack and I love SF sweatshirt- its all good here.\n\nThe wine list is basic, one - okay two good reds and a few nice white burgundies nothing to write home about.  The food is fine, no stand outs, French classics like roast chicken to San Francisco favorites like Petrale Sole in beurre blanc sauce are all good.\n\nThe one dish I would stay away from is the smoked trout - its so smoked and dried out it might as well be trout jerky.    \n\nSo go, you might see the Mayor at his table by the window reminiscing of Herb Caen days.", "author": "G R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-06-05", "description": "Four stars for the food and two stars for service!\n\nI went there with four other friends to try out their food for dine about town. I ordered the goat cheese salad, beef bourguignon, and the berry crumble. All the dishes I ordered were pretty delicious. However, the service was unacceptable. Since we had five people in the group, one of my friends was facing an empty seat. The waiter opened a bottle of wine for the two customers sitting next to us at the empty seat. He didn't even speak to my friend before doing that, but just pretended my friend was not existed. AND, there was a completely empty table literally two steps away from our table. I will NOT re-visit due to the poor customer service.", "author": "Sara Z."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-01-30", "description": "Visited for dine about town, 34.95 priced fixed 3 course.  The restaurant was good, not great.\n\nApp\nFrench Onion Soup - rich broth nice presentation.  Great.\nCrab Cake - real winner of the night.  awesome.\n\nEntrees\nRibeye with fries - OK, salty, low quality meat.  Served with tasteless spinach.\nLe Cassolet - House specialty, rustic, pretty tasty rich dish.\n\nDessert\nCreme Caramel - Flan like substance with sticky sweet topping.  A bit sloppy but OK.\nChocolate Mousse - Pretty awesome.  Fantastic texture for a mousse which is why I normally don't like them.  Plesant suprise.\n\nService was acceptable.  Normally too pricy for what it is, but decent value in dine about town.", "author": "Chris F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-02-14", "description": "So I somehow ended up here on vday which is another long story but i suppose i'll keep that one to myself.\n\nthe menu wasn't too impressive, especially for vday. where are the desserts yo??\n\nanyway. so the bf ordered escargot for appetizer and the rack of lamb for his entree. i had the lobster bisque and the seared day boat scallops provencale.\n\nescargot: way too much garlic, and on top of that the garlic was still pretty raw. the garlic was just waaaaay too strong and spicy.\n\nlamb: excellent. seasoned and cooked perfectly...and i don't even like lamb!\n\nlobster bisque... was not very bisquey. pardon me for sounding like a food snob but i could've swore that bisque is supposed to be creamy? it looked more like and tasted more like a lobster stock but oh well...\n\nscallops provencale: i thought that this was supposed to be a thick, oily tomato-ey sauce? and although my scallops were seared, they got chewy. i think there was too much sauce poured over my scallops. also, my sauce wasn't red or tomatoey at all?? there was like.. maybe 2 pieces of sun dried tomatoes..\n\nthe side dishes that came with our entrees: spinach, sweet potatoes, cauliflower. the spinach was bland, i added a lot of salt. the sweet potatoes were also bland, how'd that happen? cauliflower was gross, and my dish came along with half of a half cooked potato. go figure.\n\ni opted to skip out on dessert because i was actually pretty full although i didn't really finish my food. \n\nalthough i wasn't too impressed by the food, the service was great.\nmy extremely dirty wine glass was replaced immediately and water glass was never empty. Host was really nice, pulled out the table for me and everything. \n\nif you go, stay with red meat. i would've stuck with filet mignon or steak if i had known but someone told me i was going to a different restaurant so i yelp researched the wrong restaurant... but alas, i digress... I love my boyfriend, he tries. I love him dearly. \n\nalso, everybody in the restaurant was old. either geriatric or late 50s. says something doesn't it?\n\nand no i'm not a snobby 20 something asian hipster *rolls eyes* even though i came here.", "author": "Susy C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-01-31", "description": "\"Destination\" restaurant prices with lackluster, ordinary, not-at-all French food. Terrible silverware, glasses and wine glasses. Server stress with the knife on the right. A French restaurant that does not get steak frites right should close down. This one is still open.  Defrosted premise crab cakes (French??!!). Ok nothing was right about this place. Surely we can spend our money at better places in San Francisco?", "author": "Deepak T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-01-19", "description": "I hosted a friends birthday party here and everything was just OK.. The place had an odd odor to it and the staff seemed a but confused.\n\nOnce we go going our waiter was very attentive. \nI have had much better french food in sf, and I feel it was a bit over priced for the quality of food we received. It was an over all OK experience, but I don't think I'll be going back.", "author": "lorrin S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-12-14", "description": "Great old school French place (full of old school people). Traditional atmosphere, good service, cool Maitre'd.\n\nVery good steaks with fries. Mine was perfectly cooked and tasty. Fresh and good butter lettuce salad. Awesome creme brulee and chocolate mousse. Great selection of wines.\n\nI'll definitely go back!", "author": "David S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-11-24", "description": "Nice cozy place. Both my girlfriend and I enjoyed what we had, and the service was pretty prompt (however it wasn't packed, so I can't really comment on that). \n\nI had the cold salmon, which was pretty good and my girlfriend had the filet mignon, which was cooked perfectly.\n\nI wish their menu had more choices, both in food and wine by the glass. Other than that it was a good experience.", "author": "Michael B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-02-20", "description": "We were trying to get dinner before a show, and were enticed in off the street by a waiter, saying that Le Central was the longest running restaurant on the block, that the chef is French, the food is all fresh, etc. Sounds nice, but once you're seated, prepare to be underwhelmed. Service was slow and brusque. The escargot were good, but the filet steak (ordered medium rare, served well) was disappointing, and given the bill, everything should have been better...there's so many restaurants around here, not worth a visit.", "author": "Giles B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-27", "description": "I experienced this amazing french restaurant last night, and I couldn't believe my taste buds!! \n\nI wanted to take my lady out to a fancy meal, so I had scouted out this spot and it was a real winner! Fancy, yet casual, cool vibe, i'm sure we stuck out real bad, but whatever..\n\nThe Cassoulet that this place was known for was amazing!!!!!! I've never had lamb before and this thing has Duck Confit, Lamb, Pork, and a Sausage in it, in this amazing white bean stew.... superb!\n\nThe Lady had the Goat Cheese and Leek tart, soooooooooooo goood! I  was really impressed with that one!\n\nEverything was delicious, our waiter was very helpful, and it wasn't that expensive!\n\nHowever the one thing keeping me from the 5th star... we did notice 1 single roach walking on the floor.  Not sure if this is a bad issue, but I'm just saying, I saw 1.  So.. I hope you folks read this, and take a look around!", "author": "Carlos C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-26", "description": "Le Central is a very lovely restaurant with a fun ambiance and décor and which serves mostly tasty food. Only a few missteps prevent it from being great but it is solid and pleasant.\n\nThe first thing that Le Central has going for them is the design of the interior. Very lovely decorations and set-up with a mock-up of a French cafe in half of the restaurant and a more traditional dining room on the other side. Fun old-style posters, nice mirrors and booths, wooden beams, stained-glass decorations ... All of it is very lovely to look at and definitely gives it a French look without going overboard in the cliché department.\n\nThe service is friendly and our waiter was actually French which was a nice touch. I will say that we arrived early and as the evening wore on and the restaurant started to fill out, he was clearly overworked and we have to wait a LONG time for our dessert and bill. But the overall service was fine.\n\nNow on to the food. My major critique of the menu is simple: if this is a French restaurant, then the menu should be less generic. There are handful of specifically French items on the menu - and, as we will see, they taste great - and most of what is on the menu did sound yummy to me regardless but I did go there for French food and it turned out very little was \"typically French\". \n\nWe started off with onion soup, escargots and crabcakes. The onion soup - which I didn't taste because it is not my favorite - was disappointingly bland according to my dinner companion. Not bad per se but bland and a bit sweet. The cheese crust was wonderful though and it was served in a beautiful little pot which is a nice touch. \nThe two other appetizers were great. The escargots were exactly as they should be - although served out of the shell which is a shame since digging them out is half the fun. The garlic sauce was delicious and they were cooked perfectly. Soft without a hint of chewiness which is wonderful. Not out of this world because to this French eater, well, that's a common French dish but very very good. \nThe crabcakes on the other hand were absolutely to die for. Perfectly cooked - moist inside, crispy without being hard on the outside. The taste was crabby without being overwhelming with a nice touch of red pepper and the butter sauce was divine. We scooped it up with bread for sure!\nTalking about the bread, I was a bit surprised at how unremarkable it was. It was not bad per se but definitely needed to be better-quality at a French restaurant (crispier on the outside for a start).\n\nThe entrees were very very good. The cassoulet, first and foremost, is what this place is known for and now I see why. It was just Heaven. Both because it was authentic and \"as it should be\" and because it tasted unbelievable on its own right. Soft and melting in the mouth without being mushy. The wonderful meats all combined together for such a luscious experience. Absolutely recommended.\nAs for those Yelpers who complain the \"Casoulet\" was too rich, my question is: did they even know what a cassoulet is? That is the way it is SUPPOSED to be. Don't knock a restaurant for making the dish exactly like it should be cooked. They are welcome to dislike cassoulet but it is their mistake for ordering it, not to the restaurant for cooking it to perfection. I ate it all and was still hungry for dessert. Yeah, it is rich but appropriately so.\nThe lamb was also cooked perfectly with a lovely subtle wine sauce and the accompaniments were tip-top awesome. Creamy and delicate scalloped potatoes, sauteed spinach and a very nice - if a bit spicy to my taste - ratatouille.\nI also had some Roquefort just because. \n\nThe only disappointment was dessert. That creme brulee was a big miss as far I am concerned. The texture was very very wrong. Sickeningly firmer than it should be (it should melt in the mouth, not feel like Jello) and you could tell right away it was off because the sugar top did not crack as it should when we put our spoons to it.\n\nIn the end, this was a very very enjoyable meal with, as it should be, as highlight two wonderful entrees. It had enough small disappointments that it does not deserve five stars but it is a solid four stars. We definitely had trouble digesting afterward so maybe you should order more strategically and eat lighter but it was a wonderful dinner.", "author": "Dorian S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-10-05", "description": "I've been dining at LeCentral for over 30 years. It's like the old suede coat in the back of my closet - comfortable, unpretentious and hasn't changed a bit. The French brothers that owned it have long retired but the new owners have retained the menu - my favorites being the Chicken - roasted or cold - or the Cold Poached salmon. Always a butter lettuce salad to start and wonderful sweet French baguette and sweet butter to accompany everything. I never have a problem making a reservation and the staff are always kind and attentive.", "author": "Hotel B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-06-10", "description": "I want to keep this one simple:\n\n1) Great happy hour. $1 oysters were delicious. \n\n2) Awesome little bar to hang out at during off hours.\n\n3) The quintessential French bistro ambience que j'adore.\n\n4) A fantastic bartender. \n\n5) The ultimate highlight: They served my dirty and dry vodka martini in a chilled glass, with the liquid in a separate carafe kept on ice. Keeping the drink cold made a tremendous difference in the taste.", "author": "Joie D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-03-18", "description": "I did some searching and ended up having dinner at Le Central Bistro which was just a short walk from my hotel. I looked through the menu for a short period of time before deciding on the crab cakes for my first course. The presentation was phenomenal. I just wish the flavours were equally as stunning. The burr blanc was kind of mediocre, though I must admit the crab cake was very meaty and a good portion of crab. Everything just seemed slightly under-seasoned. Things picked up with the second course. The Beef Bourguignon was a perfect marriage of tender beef and red wine. The carrots were soft yet not overdone and it was a very comforting dish for the slighty chilly northern California evening. Things continued to get better with the creme brulee. I'm not much for sweets but this one was done perfectly. I'm usually sort of unimpressed by creme brulee, by this one was perfectly creamy and not overpowering with sweetness. The smooth vanilla texture went along well with the tasty caramelized sugar. Admittedly I am a sucker for caramel.", "author": "Zorin D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-15", "description": "A classic favorite downtown SF. Expensive, but consistently a wonderful experience. Vegetarian-friendly, good service, and a classy ambiance. Definitely try their french fries!", "author": "Jane D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-02-13", "description": "This place is mediocre at best. It has an odd smell upon entering and the tables are too close together. The service is minimal and the gentleman clearing the table looked at me and said \"you done\" Not exactly what I expect from a French restaurant.\n\nI would not go back to this restaurant!", "author": "Lisa L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-11-13", "description": "Was so looking forward to entertaining an important client for a late lunch at this legendary San Francisco institution. Never again. The service was unexceptional; the steak tartare was absolutely flat, bland and completely lacking flavor. I sent it back and whatever they did was no help.The tarte tatin was barely room temperature and smothered in a treacly caramel sauce. I used to live in France and have had better food in a hole in a French wall.", "author": "Meryl K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-01", "description": "As always, fabulous. From cocktails and wines to appetizers and entrees. My wife and I don't usually do desserts. Le Central is our favorite San Francisco restaurant. The staff is outstanding and always do the right thing. Our last visit a week ago as we live in Florida so don't get here but about five or six times a year, we had the joy of sitting two tables away from the Mayor Willy Brown. He's a terrific man, polite and interesting. We only addressed him as we were leaving and simply said how nice it was to see him.  We visit here often and never miss this place. The specials are winners and my last was steak tartar while my wife had the leek tart and we added salads and the pomme frites. This time I had a rum and coke and my wife had a house recommended white which was out of this world. In the past we had sat in the dinning room, at the bar, but this time at a table on the bar side. It is now where we will prefer to sit from now on. One thing that's special here is the attention to detail and the standard house dishes, one of which is cassoulet. Its the best we have ever had including visits to France. Amazingly, they had a hamburger on the menu this last time. I was tempted but then thought where would I have some of the other dises if I had this. Not to be missed is the Escargot and the French Onion Soup ... tho we don't often finish all the dishes we order we like to taste them. Finally, the classic French roast chicken. Wonderful. Now back here in Florida we are yet planning our next visit to San Francisco via Las Vegas and already taste the wonderful entrees at Le Central.", "author": "Frank S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-04-04", "description": "There's a reason why this place has been around for so long.\n\nPortions were a nice size, the lamb was really tender and it actually a whole rack. This is very unlike many places in SF, where you'll be lucky to get 3 little bones for more than you'll pay here. I'd recommend it to anyone.\n\nFor an appetizer we had the Escargots de Bourgogne. If you're into this sorta thing, which clearly why would anyone not want to eat snails, then this was also phenomenal. Just throw on enough garlic on to anything and it will taste great. In all honesty, these were REALLY good.\n\nService was quick, manager was nice, even though my dad was being typically annoying.\n\nI'll be back!", "author": "Josh D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-10-28", "description": "Having lived in san Francisco and now along the  Peninsula, I have passed Le Central numerous times over the years but never dined there. Several Saturday's ago, my wife and I were passing through the neighborhood and decided to stop there to eat.\n\nThe wait staff was pleasant and the food quite good and reasonably priced.  The setting was quiet and a nice break from the hustle and bustle just beyond the large windows. \n\nI gave the restaurant 3 stars not for any reason other than it is more like a nice café rather than a fine restaurant.  I wouldn't take someone there for a \"fine dining\" experience.", "author": "john f."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-13", "description": "We just wanted to have dinner near our hotel, and there're 3 French restaurants on the same street. Only Le Central has English menu outside & claims to be the oldest French bistro in SF, so we gave it a try. We ordered filet mignon & goat cheese/leek tart. Both were very good. The source in filet mignon is abundant in a good way & very tasty. I've never done quiche with source (balsamicy), but they tasted so good together. Last not but least is cocktail. Though they don't have cocktail menu, the bartender can make custom cocktail. The chocolate martini we ordered came in small bottle in a small bucket of ice with a chocolate piece in martini glass. We're surprisingly impressed with Le Central. Highly recommended.", "author": "Keiko M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-12-11", "description": "My friends brought me here after the musical, FELA.  I had always noticed this restaurant, but never ventured in... my loss!  The place is romantic, bustling with laughter with the aromas of delicious foods.... I had the mushroom soup and 1/2 Chicken, and everyone at my table tried my soup and they all agreed, it was the BEST ever... And the chicken was mouth watering... I cannot wait to go back!  Oh, and the staff are fun, professional and knowlegeable.  I love this place!\nJoanna, Sonoma, Ca", "author": "Joanna M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-03-20", "description": "Been here twice in the last couple of months. Their food is super yummy but a little on the expensive side. I took my fiancee here for our 3 yr anniversary celebration a few months ago & he really liked it. I got the Jumbo Shrimp Risotto which I have to say is AMAZING! very creamy, rich, thick & the shrimp are truly JUMBO. I gave them a 4 star because their server that particular day was to say the least an ASSHOLE! gave him a 10% tip just to be nice, but he should not have gotten anything at all this his snotty self. Anyways asides that I recommend this place. Without tip the bill came out to about $90 & with tip it came out to $100 exact.", "author": "Dessa S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-30", "description": "Very solid traditional French bistro fare.", "author": "Michael R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-11", "description": "Our Tuesday night, 6:15PM reservations weren't needed. The place was near empty. \n\nPlus: Tasty, well presented food. Excellent timing from the kitchen. A little bit of San Francisco funk.\n\nMinus: Our waiter tried to be a bit aloof, but I treated him like an old friend, and he warmed up. A tad bit pricey, $90 including tip for two entrees, two appetizers (no drinks, no dessert). \n\nOverall, pretty good.\n\nIf you need a night out from the kitchen, or a place where where non-foodies can relax and enjoy some pretty darn good chow, give it a try.", "author": "Art R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-17", "description": "We dine here at least monthly and always have the Nicoise Salad which is superb.   They make it with a tuna confit.  The decor is quite reminiscent of a Parisian café And they sell all sorts of international magazines and newspapers so be sure to pick one up to read with your meal. To make it easier they will put it on your bill. The staff is quite attentive and friendly and it's always a lively scene.  It's right off of Union Square so a great location for a business lunch or a break from shopping. We often bring visitors here for lunch.", "author": "Henry H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-24", "description": "Food is consistent, great for the price, unpretentious, one of the few traditional French restaurants left in town. Much better than Cafe Claude and Cafe de la Presse.", "author": "Jennifer C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-22", "description": "I am gonna keep this short because this place is simply awesome. An eclectic group allowing you to dress fancy or casual. You can sit in a booth or at a table. \n\nAll in all, a romantic little hole in the wall_kind of expensive, but what isn't?? I guess..", "author": "Greg A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-12-24", "description": "My best friend and I decided to come here for our Christmas lunch. She works far away in the marina and needs to drive to downtown, so Sutter-Stockton garage was the best place for her to park. Long story short - we chose Le Central for its proximity to the stupid garage. \n\nMoral #1: Never, ever choose a place to eat by its proximity to parking.\n\nWe did not have a reservation. It turns out that walk-ins are not welcome at Le Central. Vraiment? (translation: WTF? Really?). The host was a stark Asian guy, whose English was suitable for selling fake Fendi handbags in Chinatown. After telling us there were no free tables (restaurant was half empty at that time), he very rudely asked us how much time we needed for lunch. He could only seat us if we promised to be out of there by 1 o'clock. \n\nMoral #2: When this happens to you, walk away. There are plenty of eateries that want you as a customer.\n\nThe place is very small and to maximize the revenue per square foot, tables are so close to each other that I was brushing my neighbor's sleeve every time I reached for my bread. To be seated, the table needed to be completely moved forward then moved back. So if my friend needed to use the restroom, she obviously was out of luck.\n\nMoral #3: When you see that the patrons of the restaurant are pipe smoking, plaid flannel suit wearing, snobbish Sherlock Holmes wannabes, walk away. Fast. \n\nAnyway, the food was very good. Real French-style gourmand-worthy treats.\n\nMessage to the employees of the joint: dudes, lose the attitude. You are not in Paris. You are next to Chinatown.", "author": "Tatyana S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-02-02", "description": "I really really wanted to like this place! But all I can think about is- my hard-earned mulah went to waste, uhhhhhh..... sigh.............gasp!!\n\nWe went there thinking DAT is a good way to experience some pricey yummy French food. Sorry to say the yummy aspect was not there. \n- We had the French Onion soup and Crab cake for appetizer (nothing extraordinary)\n- Grilled Filet of Salmon Beurre Nantais and Flat Iron Steak with Bordelaise Sauce (utterly disappointing)\n- Lets say the best part of the meal was dessert. \n\nAnd my heart cried while signing that cc receipt.... sigh again.....", "author": "Kanwal A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-05-19", "description": "Last week Thursday I went to Cafe de la Presse but passed by Le Central. After having lunch at Cafe de la Presse I wanted to have lunch at Le Central. I did some research on their menu. I was interested in the cassoulet as it had the Le Central namesake on the dish. For any restaurant if it has their namesake restaurant on their dish it usually means it is one of their specialties. This past Thursday I went to Le Central to initially have the cassoulet only as I never had it before. The mistake was also ordering their french onion soup. The first time I had french onion soup was at Kincaid's Restaurant in Burlingame. It was really good because I liked the thick cheese on top. I hoped Le Central's would be as good. It was ok, but the disappointment was that the french onion soup and cassoulet were the same size. My fault as I should have asked the waiter how big was the cassoulet in comparison to the french onion soup. Also I should have stuck to my intention and just ordered the cassoulet only as a main dish and would have saved about $9. The cassoulet was really good but I did expect it to be in a bigger dish especially due to the price. I hadn't intended to ordered the dessert. However the waiter gave me a menu and noticed the soufflé glacée had the Le Central namesake on the dish so I decided to try it. It was pretty good and enjoyed it more than the French onion soup. A pretty good place to have a quick lunch from work.", "author": "Gerald R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-03-01", "description": "Enjoyed the beef stew;  nice ambiance. small servings.\ntight seating. Convienant if you work near montgomery/california. decent value, will go back. Where do i find Tete de Veau?", "author": "Bert K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-09-17", "description": "My mom has been whining for many months about Le Central for lunch. However, as a member of the working class, I cannot afford to take 1 1/2 hours for lunch during the week. So we compromised on a Saturday lunch in August. Mama was not able to sit next to Willie Brown, but sacrifices must be made. She LOVED her salad nicoise, I had the cream of mushroom soup and a big bowl of hot, and salty pomme fritte. The pomme fritte was the bext bowl of potato strings I've had in a long time. Way better than Citizen Cake, fo sho. We skipped the dessert but did have coffee. It took a bit of time to get our half caf/half decaf but that's because the bus person was making FRESH just for us. Friends, that's service, and the reason I completely overtipped. \n\nMom and decided to use the ladies before leaving. We asked, and the bar man pointed the way and said that if the ladies was in use, that it was okay to use the men's. and that's what we did. The men's room was very clean, and large. \n\nI will definitely go back again for lunch. I paid $50 + tip for a geat meal and outstanding service for me and my mom. \n\nLe Central is probably good for small'ish group 6 - 8 people. I've heard that it isn't a good place for children, and while I will agree with that generally for dinner or a long lunch, I witnessed well-behaved children enjoying the pomme fritte so it can be done.", "author": "Bronwyn W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-08-17", "description": "French name, French wine, French menu. Needs a little more French pop. Staff is attentive and polite. Patrons have fun. Famous past. It's all about the food. You decide.", "author": "Lawrence V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-12-05", "description": "Great steak au poivre!", "author": "Lawrence S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-12-05", "description": "Can you say cassoulet? Le Central has a very warm, inviting, and totally-date-worthy environment with friendly and super attentive service. My friend had the plat du jour, crusted sea bass ($23) over a slightly sweet pea puree and tomato sauce. I had the house specialty cassoulet ($19) and was surprised at how well the entire dish comes together in your mouth. The tender, falling apart meat with perfectly cooked white beans are explosive with home-cooked flavor; perfect for a cold winter night. We ended our dinner with two desserts: chocolate pot de creme and the chocolate mousse (both $9). Each had their own level of chocolate and unique texture, amazing!\n\nI will definitely go back to try more of their refined menu. Enjoy!", "author": "Lauren J."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-11-18", "description": "I will say one thing good about this place before launching into my tirade: the ambience of the restaurant did in fact remind me of France, which made me all warm and tingly inside. Our server was friendly and made us feel very welcome. And the crab cake was delicious, albeit lukewarm.\n\nHowever, the food in general was extremely expensive for what you get out of it. For example, we ordered a prosciutto with melon appetizer. Sounds exotic, right? Highly underwhelming. It was literally three slices of average prosciutto on top of half a cantaloupe not even sliced well.\n\nThen there was the $16 cheese platter, which was five small pieces of cheese and a few grapes presented on a depressingly bare plate. The brie was rancid, and I'm not using the word in a slang insult way. It was literally rotten cheese gone bad. Not wanting to be rude, we asked the waiter what kind of brie it was - after all, we weren't cheese connoisseurs and maybe there is brie out there that's supposed to taste weird...? The server went to the kitchen to ask, came back with red cheeks, and said in his best waiter voice, \"Why yes, it is double ripened President brie, accent on the E\". \n\nAs in President cheese, the generic, mass-produced cheese you can get in bulk at Costco?? \n\nSo to summarize, the chef phoned in his performance and we paid $16 for rancid Costco cheese. Our total bill was more than the food was worth, and we left feeling like we'd been lied to.\n\nLater that night, we went to get drinks and dessert at Absinthe. Now THAT is a restaurant that's worth the money. Le Central could take some pointers from them.", "author": "Jennifer H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-03-28", "description": "Thought from seeing all the old folks in here regularly that this place would have some classic charm. It did, but it also had a ton of kids being loud. Maybe the nearby hotels dragged them in. My steak was good, the wine was great. My dates seabass was not good.", "author": "Karl G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-03-22", "description": "I would like to start by saying that I would typically have mentioned these things to the waiter or manager, however we were never asked \"How is everything?\" or \"How was your meal?\" and I did not want to push anything with the waiter who did not seem to care. But as my Parisian husband put it, the rude service really made him feel like he was back home.\n\nAs my husband is from Paris, we frequent french restaurants, and we had seen Le Central on many a list of good french restaurants in the city. We were in the area last night (a thursday night) and got a table around 9pm. There were 2 other parties in the restaurant. We ordered: Duck Rillette (was nothing special; could buy higher quality at our local deli; I don't think they make it in house); Boudin Noir (too much cartilage, which I couldn't chew and left on a pile in my plate; one of the sausages was burnt); Steak Tartar (okay, but the toasted bread was burnt. We felt it was waaay overpriced at $29); With most of our food still on the plate, its a shame that nobody ever asked if something was wrong? Especially when there was a pile of cartilage on one plate.\n\nI understand that we were one of the last tables of the night, but with servers chewing on something (gum? food?) and loudly shutting down starting at 9:30pm, it just was not an enjoyable evening. We called over our waiter and gave him our card, and left as quickly as possible. As we headed home we kept scratching our heads about what could of been going on, because we had heard such good things about this restaurant. Did they change owners? \n\nBottom line: next time we will walk the extra block to Cafe Bastille", "author": "Jessica B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-03-01", "description": "The space was nice, service not bad, but the food was nothing great.", "author": "Susan A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-11-03", "description": "The atmosphere and service were great, but the food was underwhelming to say the least. I had the fries and chicken and the chicken was slightly over cooked and tough. I mean how hard is it to get chicken right? Over all, not bad, but since its SF, you can easily find plenty of competition that will deliver a knockout punch.", "author": "John Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-02-02", "description": "We've dined here many times.  We dine out a lot.  So we have some degree of authority and reference.  This restaurant pleases us consistently.  Were there again two nights ago.  Wife had the rack of lamb which we both agreed was one of the best ever after I sampled it.  I had the salmon which was cooked to perfection (most other places overcook and dry it out.)\n\nWine list was short, but what they offered was well selected.\n\nService was great as usual.  Attentive without being intrusive.\n\nThis place will always be among our regular haunts.", "author": "Les G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-09", "description": "Was at the restaurant Friday night and it was wonderful.  I spent the summer in Paris 2 years ago and this gem of a restaurant took me right back.  It's decor is authentic, food delicious, and service wonderful.\n\nSat on the bar side with a group of 4.  The bar was full and only a few tables free but I did not feel crowded as some reviewers have mentioned.  In fact, this is just like restaurants on Ile St-Louis where I stayed and added to the authenticity.\n\nThe food was amazing.  We started with escargot, duck rillettes, and herb crusted goat cheese.  Followed it with the cassoulet (over 13,000 days old and still going strong!), rack of lamb, and Dayboat Scallops Provençale.  Everything was flavored perfectly and not a bit was left at the end of our meal.  The serving sizes were very generous, and even though we were stuffed we had to try the creme brulee and we were so glad we did.\n\nServers were great.  Fast, efficient, attentive and generous with the wine pouring.   Also, you can tell that regulars come to this place time and time again.  We heard servers greet people by name and ask after family members.  This is the kind of place you want to come back to time and time again.  I know I will.  Especially for that lamb and ratatouille.", "author": "Carolyn S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-02-19", "description": "Disappointing. Not much in your plate, too noisy. Dessert (tarte tatin) wasn't good at all!", "author": "Chiara R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-11-08", "description": "Went here expecting great things based on other reviews.  The food was so-so.  Not bad but not great.   Had the cassoulet as it seems to be the house special.  The service made me think I was in France as it was inconsistent and rude. Actually, the French are better.  Save your money and time and go somewhere else.", "author": "Brian F."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-09-30", "description": "The menu is a bit basic as far as French food goes. There are a few of the classics, but everything else is pretty generic. What they do have though is very good. My steak was perfect and I'm told my wife's fish was equally delicious.\n\nWhat ruins the meal though is the service. We were ignored completely by our waiter (Scott) who fawned over the table next to us. Over all, it was a decent meal, but I shouldn't have to get up to track the waiter down after waiting 15 minutes for him to run my credit card. Either hire more staff or fire Scott.", "author": "John P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-01-18", "description": "We went here for the Dine About Town dinner, and it was just eh...the dessert (lemon souffle) was the best thing on the DAT menu.\n\nThe waiter was lurking for most of the meal, and was very controlling about everything, from the placement of my silverware, and moving it to where HE wanted to move it, to telling me to wait by the door, when I was meeting my dining partner at the bar. Wow.\n\nOkay, so it's a good thing I went in using Dine About Town, because I wouldn't have picked the restaurant, otherwise. Now I know...I won't go back.", "author": "Pam W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-05-31", "description": "I don't know what to say...I went here and found that the food was blah,,,,The filet was OK to good but not great.  The crab cake was one piece for $10 but just Ok. Ambiance: People that are older (50-60)  Decor was quaint and nice (kind of like something in a cruise ship)  But something was dead, off and twilight zoney...I will not be coming here again.  I give it two stars b/c I have been to worse.  \nThe Cassoulet was mushy with a lot of canneloni beans (no sauce), no flavor. The service was attentive and polite, It was just weird to come here,,,,maybe it was latural gray lighting from outside...Just say this, the food is better at Cheesecake Factory...", "author": "Q A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-08-07", "description": "What a pretentious , arrogant staff.  We were walking by and saw the awesome menu out front. Upon entering the staff was unwelcoming, unaccommodating and the vibe was superior. As a local I was very disappointed in my people.", "author": "James B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-05-11", "description": "This restaurant is considered old SF and you get that feeling once you walk in.  \nHappy hour isn't bad there.  M-F from 4pm to 6pm. $5 wine, beer and a couple drink specials. $1 Oysters on a half shell.  A good end of the day refresher and start to your dinner.\nThe Cassoulet has said to be cooking since the day the place opened.  It is a type of bean, stew with duck meat and thickened tomato soup.  The server gave us a sample after I asked what a Cassolet was once I read a sign outside that it had been cooking for some 13K days.  \nThey have daily specials that are written on a chalkboard and placed at your table.  The server will just read them to you but won't describe them, you have to ask.\nIt was the first time we ate French cuisine and I have no complaints.  We didn't think it cost very much.  It was less than $100 for 2 people, 2 appetizers (French Onion Soup and a Crab cake, which was served with the most tasteful sauce), 2 cocktails (Wine and a Jameson), 2 entrees (Chicken and Prawns).  \nIf I am in the mood for French food again I'll come back.  It is conveniently located near my work and isn't a bad walk.", "author": "Grace P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-01", "description": "3.5. FH and I ate here last week for DAT. we rolled in a bit past 8 and were seated in a corner booth. he had the french onion soup, salmon, and the chocolate mousse, i had the crabcake, beef bourginon, and lemon souffle. \n\neverything was fantastic. the beef was SO tender, it fell apart when i touched it with my fork. and the portion was MASSIVE. both of us ate some and i couldn't finish it all.\n\nservice was good - cute little place. although the odd couple talking about their sex preferences next to us kinda took away from it - we still had a good time.", "author": "laura f."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-06-07", "description": "I want to love this place, but the last couple of times I've been for lunch have honestly not been very good. Today my rillettes were cold and awfully pasty, more like a pate in texture than good shredded duck meat. And the salade nicoise was a bit underwhelming with limp green beans and what I swear was canned tuna. Add in a lost reservation and some mediocre service and I was wishing I'd gone up the street to Cafe de la Presse instead.\n\nLe Central can be good, particularly the cassoulet. And I love the tradition and role it places in San Francisco, want to support it. Maybe they just need to freshen up the cooking a bit.", "author": "Nelson M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-17", "description": "I've seen this place for years, but never had a chance to eat here.  Tonight, we decided to go for some French food, so why not try it finally?\n\nHubby started off with a mixed green salad with Roquefort cheese - he absolutely loved it.  I had to have the escargot.  Piping hot, fabulous garlic and oil that you just have to dip with French bread.\n\nFor entrees, I had the cassoulet.  Delicious!  White beans, sausage and duck served in a little iron pot.  My husband had the risotto with prawns.  Risotto was average, but the prawns were so succulent.  You really can really taste the difference with fresh seafood.\n\nFor dessert, I had the creme brulee.   Except for the powdered sugar on top (which I've never seen anyone do on this dessert before), I thoroughly enjoyed my selection.  There wasn't any left over, let's put it that way.  My husband had a slice of lemon tart with fresh whipped cream on the side, with a small pile of raspberries.  He said it was very good, but could be a little more lemony.\n\nOn the whole, we really enjoyed the food there.  The bar was the focal point of the evening.  There were only about three - four tables of diners this Friday night.", "author": "Denise M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-03-09", "description": "We hit up this place last Friday night when we were in SF for the weekend.  We found the place cozy and comfortable.  Although the place started out slow, it was pretty hoppin by 8ish.  It was full of what seemed to be locals -- which was our favorite part.  We try to not be tourists when is SF.\n\nI had the Halibut -- it was HELLA GOOD!!!  The hubby had the Osso Bucco (sp?)... really, really good.  Thu funny thing was we were the last 2 people to get these dishes because they only had 1 left of each... we scooped them up quickly.  The Halibut was so, so good I could have licked my plate clean.  I've never been to Paris but if this is what a french bistro is supposed to fee like... I can't wait to go.  Needless to say, we'll be back.", "author": "Kelly F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-10", "description": "Did the business lunch thing here recently.  I swear a sport coat's required to get a table, but hey, it's nice to dress up and feel important sometimes.\n\nWhile the prices were a little steep (I guess $30 for a filet is reasonable for downtown SF, but at lunch when the portions are noticeably smaller?).  Barack, where you at w/ my stimulus check?!?\n\nOverall, my steak was juicy and flavorful, and my friend's plates were clean in a hurry.  I didn't try their dishes, but we did share some prosciutto e melone - very tasty.\n\nFinal words of advice, sit down on the early side if you want to get in and out (relatively) quickly.  Around 12:15, I think a shuttle from the Embarcadero Center dropped off about 20 suits.", "author": "Forrest W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-09-27", "description": "Me and my fiance love this place. This is a go-to place whenever we have a date night in San Francisco.", "author": "Amanda A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-10-28", "description": "This is actually a pretty good restaurant .For dinner had excellent ,garlicky escargot , good cassoulet and tasted a first rate coq au vin.They tended to run out of specials.The off note was a rather weird waiter who over poured wine and seemed to think he was clever.Still it's a good place.", "author": "John K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-06-12", "description": "My bucket list of restaurant to try.\n\nWe took advantage of the DAT on a Sat night.\nI sat in  Willie Brown's designated seat.\n\nWe give the restaurant 5 stars for ambiance, it truly has the old school\nfeel of a established  French restaurant.\nAlso give our Waiter and Lady Maître  and service staff  5 stars.\n\nUnfortunately the Kitchen falls short in execution of its Food / Taste department.\n \nOur Steak, Chicken and Cassoulet had no seasoning  and needed salt and pepper. What happen to the old french way of heavy butter sauces?\n\nA big Bad, the Sea Bass was late and undercooked, Waiter and Maître did comp the entree and offer a dessert also. Which was a Class Act !!! \n \nI am willing to give it a another try in the future, if the Kitchen improves.\nThe fellow Yelpers who gave it 2 stars regarding taste was correct.", "author": "Food Sage W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-12-12", "description": "This place definitely serves a mean roast chicken, the green beans, and asparagus were truly amazing. We even ordered a bottle of white wine, and topped the evening with a chocolate cake from Minette. All of this was delicious, but you definitely get back to reality when you see your 230+ bill for 5 people. \n\nThis is definitely a place for some quality food, don't get me wrong, but if you must factor in price, it may not seem all worth it. You decide. Although, pomme frites, even though they are pomme frites are not worth any additional cash... but for the company I had tonight, it was well worth every penny spent! I would definitely come back for great service and attention, and great company.", "author": "Angela C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-06-23", "description": "We stayed at Union Square  this week, and walked in the general direction of Belden Alley, thinking we'd end up there. We stopped to look at menus at Cafe De La Presse, then Le Central, and were pleasantly surprised to find that Le Central is not as expensive as I'd always assumed.\n\nWe had a quiet table on Tuesday night, excellent service, and everything we ordered was fantastic. The atmosphere was intimate and comfortably elegant. \n\nThe maitre'd who seated us, who we were with for all of one minute, impressed us both with his attentiveness to the arrangement on our table after we were seated, bringing the salt, pepper and small floral arrangement neatly to the far corner opposite our seats. A small but elegant gesture. \n\nOur waiter, Scott, was friendly, attentive, and very knowledgeable about the menu, answering questions about preparation. He  arranged for a salad we were sharing to be served on two separate plates, something both of us appreciated. Both Scott and the busboy knew how to serve and remove plates properly, something that we've seen plenty of clumsiness around lately at other restaurants. \n\nEverything (table, food, service, vibe) was impeccable yet natural and relaxed, not uptight at all. High points: the onion tart, the cassoulet, and the grilled salmon. We look forward to returning later in the summer.", "author": "Mary P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-11", "description": "This restaurant was my first ever Yelp review and I was overly critical before, so I am updating my review. \n\nI came back recently for a business lunch and thoroughly enjoyed my meal, the service and my dining companions. Yes, there is a limited selection for a vegetarian, but that is my problem/issue, not the restaurant's. \n\nThis time around, I had the cheese tart with figs and a salad. The tart had a perfect combo of cheeses, was light and fluffy and the crust was fantastic, firm and not at all soggy. The figs were a great touch and had some sort of cream piped onto them. The salad had a nice balsamic vinaigrette. Some of the leaves were a bit wilted, but still a good salad. \n\nOn a more interesting note, I ran into Willie Brown on my way to the restrooms. He's a frequent diner here and it was great to meet him! Although I was a bit foolish and said to him, \"Hey! You're Willie Brown!\". Duh! I think he knows who he is!", "author": "Caroline C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-02-20", "description": "Real bistro fare that isn't shy about butter and cream - check.\nHard-core Vietnamese waiters kickin' it old school, Colonial style - check.\nMini-chalkboard menu brought to your tiny table - check.\nWillie Brown sitting at his window table every Friday for lunch - check.\n\nI've been here for lunch and dinner at least a dozen times and I am always the youngest person in the house... by a solid 2 decades.  It's loud, boistrous, and the seating arrangements border on claustrophobic.\n\nDuck rillettes.  Two words that keep me coming back.  Oh, that... and \"duck aspic\".  Which is served cubed and generously scattered across the serving plate... When no one is looking, I scoop a few pieces into my mouth, and let my tongue play over them as they yield and melt across my taste buds.  \n\nWhy can't I buy duck-flavored jello at the store?  \n\nThis gorgeous slab of decadent... duckness... liberally spread across sliced table bread and sprinkled with some gelee... followed by a mini-bite of cornichon is as close to lunch-hour heaven as it gets.  For $7.50, and without risking a misdemeanor, that is.  \n\nAnd that's my appetizer!  I also adore the leeks vinaigrette, the sexy salad nicoise and when I'm feeling like a splurge (which is often) I'll have the Crab Cake Beurre Blanc.  \n\nThe latter is a portly, fist-sized crustacean-cake that arrives crisped and coated lightly in bread crumbs... basking in a freshly-poured puddle of buerre blanc.  While this item is listed as an appetizer, if you start with something else... and share a few bites of your fellow diner's dishes... the crab cake can serve as an entree. \n\nI, personally am over tiny little appetizers... like the \"lobster ceviche\" that I ordered at Nobu back in 1999 for $20 and was nothing more than a short stack of tortilla chips with a paltry sprinkling of dry lobster crumbs between them. Not that I'm holding a grudge or anything.  \n\nOkay - back to my crab cake:  it's refreshingly free of fillers and chunks of not-crab.  It is perfect with a swipe of the beurre blanc and should be consumed reverently, at a leisurely pace.  \n\nSo... maybe this place is a bit stodgy... but between the authentic bistro fare, which includes seasonal delicacies and a charcuterie selection that never leaves me wanting... I always hit that gustatory sweet spot.  \n\nLook for me if you stop by for lunch; I'll be the only other person who doesn't have an AARP membership, blissfully attending to my rillette or pate de campagne.", "author": "Kim D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-13", "description": "Really nice place for dinner for 3.\n\nAppetizers:\n\nEscargots - Excellent, good balance of salt, butter, garlic\nSaucisson Chaud - Not overpowering, with a nice sauce and potatoes\nRillettes de Canard - great.  Just like you'd get in France\n\nMain plates:\n\nRack of lamb - terrific.  Perfectly cooked and seasoned\nSkate, sauce grenoblaise - excellent, this was a special\nCassoulet \"Le Central\" - melted in my mouth w/ duck confit and sausage\n\nDessert :\n\nPear tart - not too sweet with a flaky crust.  Exactly what I wanted.\n\nWine: \n\nA 2003 from Margaux.  Quite good.", "author": "Justin C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-11-25", "description": "I really wanted to try the OLD OLD thousand year old stew! But for some reason when it was being described to me i lost my appetite. Amish cake-Old Stew--sounds like a trip to the bathroom--many of them. \n\nSo i played it safe and went with sea bass which was delicious! Could have definitely come with more rissoti--I hate and love leaving a place with my plate wiped clean which leads me to believe it was delicious but just not enough. \n\nGreat ambience, seemed authentically french to me.\n\nOmg and I love how they present desserts--they have a tray of them--smart! cannot resist to them then. Creme brulee-chocolate cake, tiramisa--HEAVENLY!", "author": "Amy S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-09-20", "description": "I have lived in San Francisco for 17 years and I had one of the worst dining experience in my memory last night at Le Central. \n\nFrom the moment my girlfriend and I walked in we were treated like we were riff raff. Perhaps because we are young and most of their guests are over 50. \n\nThe host looked confused as to where to sit us despite our reservation and that the place was only half full. So he puts us snug next to another couple despite available tables for 4 which never were filled in the course of our visit. \n\nSo it starts like this.....The waiter bumped my chair twice while serving other parties before finally coming to our table. He was also rude when I asked him some details about the menu as if I was holding him up from doing his job.\n\nWe asked for water 4 times! From the time when we sat down from the host, then the busboy twice and the waiter once.\n\nAll of this to me is forgivable if the food is good. It was terrible.\n\nMy girlfriend ordered the roast chicken and pommes frittes which featured a glop of unfrozen spinach, along with a dry chicken and yup, you guessed, it soggy fries.\n\nThe dish I ordered was worse. AVOID THE CASSOULET if you insist on going here. It's a pot full of dry white beans and few pieces of leftover chicken and two slices of sausage that cost $18.50. I think I would have been better served by a tin of Spam!\n\nIt get's better. My girlfriend and I love creme brulee and in a hope to redeem the meal we ordered it. Well, it was bad. Too many eggs, and too soft. It barely felt like creme brulee. It was like sugar omelette.\n\nI don't like to write poor reviews on any place here on Yelp. However, for a restaurant that has been around as long as Le Central, I am compelled to be honest right here and let people know that if you want dry food and bad service Le Central might be right for you.", "author": "Matthew S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-06-13", "description": "Classy and elegant place where people were in proper attire like attending a business dinner. Ambiance was quiet and low key. The deco was good-- semi-dim lights to mellow out the evening.\n\nFood was also low key and simple. My prawns risotto was pretty good. Dessert was passable, a bit heavy and was pre-made way earlier and lacked the excitement.\n\nService was a bit confusing as we were served by multiple people instead of 1 who took the order and 1 server.", "author": "T L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2005-11-08", "description": "It's got an old-world French-restaurant-in-SF vibe.  You've got the old French waiters, an obviously aged dining space and a view of the city streets.\r\n\r\nNot too good in terms of service or dining.  I had the rabbit, whose bones nearly scratched out my tonsil.  The waiter stared at me for moments on end when I asked him for my meal and was in general a cross between distracted and rude.  I felt self-conscious eating with him around.\r\n\r\nThe presumed owner, or the owner's son, came by and took ahold of our table in a proprietary manner so he could pull it to the side for another couple to squeeze in next to us.  It was fine and all, but I'm always a little stunned to have my meal dragged away from me without an apology or explanation.\r\n\r\nI had creme brulee for dessert.  It was just like the one I made during a let's-bootleg-dessert! spree I went through last year: burnt sugary top, rubbery cold custard.\r\n\r\nLe Central costs too much for what you get and I walked away feeling dissatisfied and moody.", "author": "Angela N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-06-22", "description": "Dont waste your time thinking you are going to a french restaurant here \nmediocre food and service empty on a friday night at 8 pm bad smell when you enter the place Cassoulet a glob of beans and fat with a suspicious sausage at the bottom.... stale bread ....", "author": "didi c."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-16", "description": "First off, do not bring your children here. This is an adult restaurant for people who want to have drinks and really good French bistro food and do not want to listen to spoiled brats screaming at the next table. \n\nWhew. Sorry, had to vent. Truly good food. Very experienced staff who know how to take care of you provided you do not walk in wearing torn jeans with your shirt hanging out, and then demand that they change what you want to order in 10 different ways. Vegetarians need not apply. Excellent bartender and good wine list, and the wine by the glass is often a treat. Excellent steak au poivre, roast chicken, cold salmon, and the pomme frites are the best this side of Paris. Always a good dessert tray if the sweet thing is your thing. Good people watching.\n\nMy only minor complaint after eating here regularly for years is that the early lunch and dinner food can sometimes be undercooked - almost like the kitchen staff is not up and running in time for the opening hour - hence 4 stars instead of 5. A suggestion is to eat lunch after 12:30 and dinner after 6:00. Other than that, it's a terrific place with nearby parking in the Sutter Stockton garage.\n\nAnd don't forget - leave the rugrats at home.", "author": "Dexter N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-07-21", "description": "Christmas, 2007.  50 drunken Santa Clauses coming from the Irish Bank.  Damn - If the real one is in there, I'm thinking, Christmas is doomed.  Dave and I quickly duck into Le Central to avoid thier beligerent ho ho ho's and cracks about the reindeer.\n\nSuddenly I am transformed into an expat somewhere in the south of France.  The bar is a perfect mix of interesting people, freindly and knowledgable bartenders (we had a great discussion about Frenet-Bianca).  And the food isn't bad either.  The Escargots and French onion soup is great.  The place has a homey atmosphere that translates into plain old good eats.\n\nNext time you want to hide from an army of drunken Santas, hide in here.  They avoid it for some reason.", "author": "Randy C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-12-12", "description": "I had dinner here not that long ago and I still remember the dishes.\n\nStarted with the butterleaf salad, braised leeks, and celery root remoulade (between us three). Both of my friends ordered the roasted chicken with pomme frites. I didn't try the chicken but from their faces, I think they approve.. But the pomme frites were so good.. Hot and crispy.. I ordered my favorite dish which was the boudin noir, fat black aromatic sausages. You can't get this anywhere else. Really juicy and yummy. \n\nEverything from ambiance, food, service, and cocktail was great.", "author": "Juliane N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-11-20", "description": "Le Central is my go-to place for lunch in the city.  I've been going there since the mid 1970's and it has yet to disappoint.  The cosmopolitans are excellent -- not the typical overly-sweet drink -- and also generous as you get a mini carafe to refill your glass.  The food is always excellent, but I especially love the poached salmon or sole.  The warm goat cheese salad and the beef tartar are also very good. The fries are ridiculously delicious.  It's a cozy place that's great for people watching.  The wait staff is not necessarily warm and fuzzy, but hey, it's a french restaurant and it has the status of an Old San Francisco restaurant favorite...", "author": "Sue J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-10-21", "description": "Oh, Le Central -- a very sweet little bistro with a funny old crowd. I wouldn't come here with friends or on a date, but the family enjoys the atmosphere and sort-of-French food. The menu has some \"Italian\" items, which I find to be a bit strange. And the menu is very meat heavy.\n\nI had the butternut squash soup, which was really good. Almost as good as the kind in the cardboard box from Trader Joe's. I really love that soup, especially the tomato one. Anyways, my fam had a bunch of fish and meat dishes. They liked them fine, nothing extraordinary. The quaint bistro atmosphere is cute -- a bit outdated.\n\nAwesome German and French beer selection. The Bitburger was my favorite one. Our waiter was very nice and funny, but not super attentive. I think he had a lot of tables, so things were a bit slow, but we weren't in any hurry.", "author": "Syd V."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-04-21", "description": "Like almost everything else in SF, thanks to YOU, \nit used to be better.  Low-quality ingredients, riding on\na reputation, and depending heavily on tourists \nand ancient longtime customers who can't tell the food now is\nso so at best.  Tasteless might be a better word.\n\nAnd no French anyone anywhere at all.  Chinese owner and \nmarginal white people staff.", "author": "harmonia b."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-12-04", "description": "Very uneven.  The first time I went, service was courteous, friendly, and timely.  The second time, they gave us a lousy table, we had to flag down the waiter for *everything*, the food was just so-so, and they brought the wrong bottle of wine (3 times as expensive as we ordered) which we didn't notice until the bill came. (Yeah, I know that one was my fault, but still.....$75 for a half bottle?)\n\nLook elsewhere.  A rip-off downtown.  They're not any better because they don't have to be.", "author": "Steve S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-02-27", "description": "Temperature inside was cold\n\nSteak tartare was good\n\nChicken was greasy, and plate was piled with very overdone greasy fries that were bad. Plate had one tablespoon of spinach. Bad presentation, not enough vegetables at all. Very heavy and not the way I picture French food at all!\n\nI don't think i would go back. Menu was overpriced compared to some of the other pleasant lunch places in the FiDi. \n\nOh, company was good, she brought the French to the French restaurant.", "author": "Danielle V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-12-13", "description": "OMG is a very fitting comment for this restaurant. Everything we ordered are awesome. As soon as we mentioned we had a reservation, we were wisked to a table immediately. Service is great and the food came timely and smoothly. I'm more than satisfied with this restaurant. It's my first time dinning at Le Central and it won't be the last time.", "author": "Anita S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-11-19", "description": "My husband and I stayed across the street  for our anniversary. He wanted to go to the burger bar in Macy's and i was grossed out by the menu. I really wanted to go to La Central from the moment we checked into our room. We were greated by a quiet by smiling host, Our wait for a seat was only 5 minutes. Not being from the area, while everyone was very cold we just had a little chill, the restaurant for us was very very warm.  My husband was reluctant to have the ribeye because he hates rib eye. He has now fallen in love with ribeye thanks to the wonderful chef that night. I had scallops and pasta in a cream saucae and was in heaven. The food was amazing as was the service. It is very quaint and what I was looking for as our anniversary dinner. Very glad to dine there and cannot wait til our next visit to SF! I would recommend this restaurant .", "author": "Antoniett M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-11-17", "description": "If you go to an elegant French restaurant that charges $25-$30 for a main course, you expect great food, great service, and a beautiful ambiance. When we arrived, an unsmiling host quickly seated us. The waiter was perfunctory, speaking as little as possible, not telling us about the menu or the specials. When I joked to him, you should say \"merci!\" he said, \"I am American,\" and walked away. That happened as soon as we were seated and set the tone. We split the crab cake for an appetizer (if I were the waiter I would have told us that there is only one crab cake; often in restaurants you get two, so it's a nice thing to split). It was good. But my shrimp were verging on dry and were not anything special. The saffron pea risotto was bland. My husband's steak was fine, but nothing special. His green beans were overcooked. We paid very special prices for a very mediocre experience.", "author": "Katherine E."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-01-23", "description": "The rack of lamb was so tender, tasty and done to perfection.  On the other hand my friend's veal piccata was tuff and tasteless(doubt if it was real veal).  The service was very good.  Compliments to the bartender, Mat.  He is so polite, courteous and has a great personality.  He is a keeper!", "author": "mary f."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-08", "description": "We love Le Central.  The staff and especially bartender, Nate, are very attentive and accommodating.   Playing dice at the bar has long been a fun tradition at Le Central and it's refreshing to see that it has withstood the test of time.  We are now back to being lunch time regulars here and adore the ambiance!", "author": "L. C. M. V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-11-20", "description": "I was fairly suspicious of Le Central before going.\nAfter all, this place has been around a long time and has quite a bit of history... good and bad.\n\nLe Central's pretty proud of some of their more high-profile clients:  Wilkes Bashford, Herb Caen, and who could forget, former mayor \"Slick\" Willie Brown.  If you go at the right time, you may even see Slick Willie trying to proposition some nubile blonde in the corner, a definite Kodak moment.\n\nAnyway, wifey and I pass by this place all the time and finally decided to step in to see what all the hubbub's about.\n\nThe maitre'd was delightful and accomodated our last-minute seating request without hesitation.  We sat in Herb Caen's table right next to the window so we could make fun of the tourists walking by...\n\nThe menu consists of straightforward and unpretentious French bistro fare.  Nothing wild or fancy, just solid classics.  Sometimes classic dishes are the best way to gauge the skill of the kitchen.\n\nThe standout dishes we had included a kickin' onion tart and a rich onion soup that any French grandma would be proud of.  Wifey's prawn risotto was nothing to sneer at either.\n\nThe staff was efficient and unobtrosive and prices were more than reasonable.\n\nMy assessment, great food and a fine experience.\nI can see why Slick Willie brings the girlies here.", "author": "Gracie-C Y."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-08-21", "description": "Dreadful. Ordered the roasted chicken pomme frites and returned them. Driest as chicken, ever, and the fries had absolutely no taste. Pepper and salt didn't save either.", "author": "S W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-30", "description": "This review is based on one salad... one salad that I cannot stop thinking about for the life of me! Get it please: the warm goat cheese salad... It has sweet figs, and buttery walnuts, and crispy bibb lettuce, and a warm, gooey, melty round of goat cheese atop a crunchy, toasty, fresh hunk of bread... the best part? The inside of the goat cheese manages to stay so flavorful and soft on the inside... believe me, this salad is magic!", "author": "Jamie K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-08-17", "description": "I am a hound for soups and the spinach soup was great. The cassoulet was outstanding, fantastic, superb. My friend liked her salade nicoise. The creme brulee was just right - the cream was delicious and I always like it when the burned parts cut the roof of my mouth (no joke, that's part of why I'm rating this place 5 stars). The service was warm, attentive, efficient. The place itself is great - lovely decor, very cozy and classy ambience, very nicely done with the brass rail and exposed brick, very clean and roomy. I am delighted and will return.", "author": "Michael E."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-01-21", "description": "Dine about town 2013, looked for a place close to Jonny foleys dueling piano bar for a friends bday right after. Parking was easy, managed to snag a spot right across the street. The decor/ambiance was ok; if I had to describe it all in one word, \"musty\" comes to mind. I tried the herb crusted goat cheese salad with walnuts, the beef Bourguignon, and the berry tart with Creme fraiche for dessert. I also tried a bit of M's cassoulet, a white bean stew with slow cooked lamb and duck. The salad was so so, not well presented and the goat cheese came in one big block. The entrees tasted like standard French comfort food; I half expected the theme song from ratatouille to start playing in the background. I could only finish half of my beef as it was very filling. I think the cassoulet is better than the beef because the meat is more tender and the white bean stew is quite savory. Dessert was the best part, though not something I'd specifically come back here for. Service was meh. Overall, convenient location on Bush Street but probably will not be back.", "author": "Joyce H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-09-18", "description": "I recently returned to the Bay area from years in SoCal.  Le Central used to be one of my favorites.  I was reminded of it when I saw it mentioned a couple of times in Willie Brown's column - apparently it is one of his favorites too.\n\nTo make a long story short, the wife and I went there last night.  This restaurant has nothing in common with the Le Central I once knew.  I expected, but did not get, an authentic French Brasserie meal.  Not even close.\n\nThe duck rillettes, a slice of pate cut into two pieces ($11) was OK, but Marcel & Henri's is significantly better.  The saucisson chaud ($10.50)had a nice sauce, but the sausage was not house made and the waitress had not a clue where it came from.\n\nThe onion soup ($9.00) was OK, but not the killer I expected and it was quite small.  My wife ordered a shrimp salad.  It cost more than $20 and consisted of nothing but a pile of chopped head lettuce with a few small shrimp on top with a slice of tomato that was so mushy it was inedible.  The waitress told us that the chef made it larger than usual.  I gather that \"larger\" means a lot of head lettuce.\n\nThe wine list was overpriced.  we had a bottle of vin ordinaire Macon Village for $32.  I bought some of it recently for $6 retail, so the markup was over 500% - not cool to say the least.\n\nThe place wasn't crowded and one waitress was assigned to cover our entire room.  Although the poor gal ran her a-s off, she was not able to keep up.  The maitre de just stood around watching - I couldn't believe that she didn't pitch in to help.\n\nIn summary, if you want to blow $100+ on lousy food and iffy service, this is the place for you.", "author": "Michael B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-12-23", "description": "Old world charm, new world prices.\n\nThe salad nicoise was very tasty. I never would have ordered it if work wasn't paying for it.", "author": "Tamar N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-01-04", "description": "Disclaimer: I'm friends with Louis (the most famous and fabulous server in this echelon of dining) , so that probably helps as far as receiving excellent service.\n\nThis place is old-fashioned European, slightly snobby, touristy and proud of it. So if you're a vegetarian or part of the 22-year-old hipster Asian crowd, you probably won't like it there. Go to Herbivore or be cool somewhere else.\n\nIf you like kitsch, hob-nobbing and artery-clogging food every once in a while, you've come to the right place. The Pommes are sinful, the Charcuterie is delightful (but definitely not light), and if you're in the know with the staff you can order a scallop salad that's generally not on the menu, which is delicious (and actually not even bad for you!).\n\nAnd if you're really lucky you can make faces at Willie Brown while he's trying to be suave and important.", "author": "Tatjana G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-01-03", "description": "The only reason why I give this place two stars is because of the attitude. It was so bad I thought I was in Paris. The place had a charm of a falling joint that you can tell was still living in it's ghost of former self. At any moment I thought Chef Gordon Ramsay was going to bust in on his show Kitchen Nightmares to condemn the place. So with that it was amusing.\n\nBUT I WARN YOU. If you come for the food you'll be sorry. The only thing good was the bartender knows how to make a martini and the onion gratin was good. Everything else was prepared as top chef in 1966 was frozen in time and prepared meals with the same sensibilities. It was terrible. The most unimaginative preparation and presentation. This is NOT French food. \n\nThe French cook with love. This was cooked with, \"I hate my life\". Seriously stay away if you are looking for a good meal. And to top it off it is pricey. Spent $150 for garbage. \n\nCome if you can afford to drop $150 and be amused at clueless attitude ridden service.", "author": "Scott B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-05-19", "description": "I have walked past Le Central a few thousand times and finally took the opportunity to have dinner there. Ordered the ossobuco special. Best ever. The cassoulet was amazing as well. Service was excellent. Staff very pleasant and accommodating. A really wonderful experience. Excellent value for the area.", "author": "Dave H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-03-12", "description": "Forgettable (except for the bad parts: a handful of flies buzzing the room, wines that tasted like grape juice, and the obese old men eating there).", "author": "Reality Check S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-08-01", "description": "Definitely one of the most authentic French restaurants in San Francisco. I had the steak and pomme frits and savored every bite. \n\nI've heard that Willie Brown frequents there and to my surprise he came in and sat next to my table mid way through my lunch.", "author": "Sue L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-06-12", "description": "My sister and I went here for her birthday dinner because they were offering the Dine About Town special, so we were inclined to like it because it was going to be special and cheap!  No no no.\nThe main problem was our waiter.  He started out great great great- we saw his tip going up.  My sister was torn on what she wanted, so he brought her out a tiny dish of the cassoulet (?) to try.  He also brought out some veggies (yummy and free!) even though my sister had also gotten fries. Great guy. But once we got our food, he disappeared.  Well, we saw him, but he didn't see us.  I was beginning to wonder if we had turned invisible, as even our water glasses sat empty.  \nWe had not yet ordered our dessert, and the busser boxed up our leftovers.  And we sat there.  Our waiter helped the tables on either side of us.  He saw our bag of takeaway and still didn't come over.  After he didn't come over for at least a half hour (I am so serious), my sister spoke with the manager and requested our dessert to go.  She apologized and was great, and we saw her talking to our waiter, but he was not at all apologetic.  He came over and dumped off our desserts, making it clear he wasn't speaking to us.  \nWhen he brought the bill, he sort of spat out that he took 10% off since we had to wait so long.  \nHe was just baffling.  \nAnd the food wasn't all that great, so I'm very glad we didn't have to pay full price.  \nBah.", "author": "Robin D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-08-07", "description": "I've heard good things about this bistro and it is your place for french comfort food. I had a tiny bad experience which was a lipstick stained water glass. The waiter took it away and poured my water into a new glass =\\ why he had not just handed me a new glass...i do not know. \ni ordered the CHICKEN POT PIE and it was very good. it had a nice flakey crust. the chicken, peas, potatoes were oozing with comfort. not too salty, not too bland, it was just right. the greens on the side were ordinary, so maybe for next time, a starter salad like their goat cheese cheese or butter lettuce will be make a nice addition.\n\nMake reservation if having lunch here on a weekday. it can get very crowded.", "author": "Oanh N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-04-01", "description": "The staff here is very friendly here and I have been able to catch up on there many stories of growing up here so it is a relaxing place to stop off on a slow evening.  I have only had the wine here and they have a good choice of French wines at moderate prices.  One day I shall eat here if I stop through and am actually hungry, though I seem to prefer my liquid dinners anyhow.", "author": "Blake B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-01-05", "description": "So, I go here for the drinks and the French fries.  \n\nUsually, just the drinks but sometimes, if I haven't quite filled up on my starches in any of the Belden Place eateries I will order the fries.  Very good...crunchy, thin, hot fries!  \n\nThis is the perfect place to get a feel of \"old\" San Francisco.  Former politicians, society doyens, elite SF real estate agents, Olympic Club members...hell,  they all show up at one time or another and are pretty darned entertaining to watch.   But, in my opinion, they are welcoming and very friendly (especially after 9pm!!!!).\n\nGotta experience this place at least once.", "author": "Maggie K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-13", "description": "I love this restaurant and would give 5 stars but the tables are a bit close together for my liking -- but - maybe that is the way of French Bistros!!  I had a business lunch the other day with a client and had the Salad Nicoise which was wonderful.  I usually order the roast chicken which is also very good.  Very professionally operated with great food and excellent service.  Very easy to get in and out within a lunch hour as the food comes out quickly.", "author": "Vicki B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-10-25", "description": "I went here mostly because the restaurant is close to my apartment and opentable had a 1000-point.  I thought, why not.  As the rating shows, it was just A-OK.  The food, the wine, the service.  Nothing was bad...yet nothing really stood out besides the tasty free bread for an appetizer.  I was really surprised at the prices.  Most entrees were higher than I expected and should have been less.  On a positive note, you'll never have trouble getting a seat here...they always have room on opentable and it's never busy when I walk by", "author": "Joel F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-02-12", "description": "A wonderful find.   Perfectly quaint and ideally suited for a comfortable weeknight dinner out.  The prices are fantastic, the selection on the menu is exactly what we expected, and the cassoulet was to die for.   \n\nLooking for a place for a guaranteed good meal but you regret not making reservations anywhere?  This is your spot.\n\nWonderful french bistro cuisine", "author": "Jon S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-01-11", "description": "The place was very charming! Perfect for a date with your sweetie! I expected a fussy and upity staff and atmosphere but it was very artsy and casual. The staff was extremely hospitable! I got a red rose with our reservations, courtesy of my fiancee. The food was so tasty, worth the price we paid! Oh and try the cosmopolitan!!", "author": "Anne j."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-05-21", "description": "Ate here with my pops and wife on our weekend fam-stravaganza.  Le Central is a very FRENCH kind of place- not haute cuisine french or nouveau cuisine french but the kind of bistro you actually eat at in france because they don't have fast food restaurants and you don't feel like eating a crepe or baguette on the street like a hobo.\n\nIt's french down to the drinks- which are tiny- french down to the service which is occasionally attentive but often negligent.  If it wasn't for the english on the menu and being spoken in the restaurant, I could sworn I was in France.\n\nThat's not to say that this is a totally great restaurant- the food is super heavy and the prices are high for what you are eating.", "author": "scott p."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-01-29", "description": "I don't know where the previous reviewers ate but it does not ressemble the restaurant we just left.  We were greeted by a stony-faced maitre d' who never cracked a smile all night.  Our waiter thought he was doing us a favor by his presence--grumpy and unattentive.   Our waiter's attitude did not change when we ordered$120 worth of wine to start off.  On the positive side our table for six was ready when we arrived on time at 6.30 and a very pleasant hostess showed us to our table by the door!  \nTables were packed together to the point that we had to disturb customers on adjacent tables when were seated and left.\nThings didn't improve with the food.  Two members of our group had one of the house specialities (casoulet)--very ordinary, as were the seaboat scallops. Our group has eaten at fine restaurants all over the world so we know good food when we taste it.  The roast chicken and the Boudin Noir (blood sausage) were good.\nThis may have been a good restaurant in the past but tonight it was very poor.  There are too many great places in the City to eat to even think about going back to Le Central.", "author": "don M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-10-12", "description": "Le Central is one of those places you wish weren't located in one of the most touristy blocks in San Francisco (between Union Square and the Chinatown gates).  \n\nThese guys serve the best blood sausage in San Francisco, amazing fries, great cheese and wine selection, and good cocktails.  \n\nI've eaten there maybe a half-dozen times, and received service completely commensurate with my level of dress.  I could almost smell the waiter's disdain when I walked in wearing a hoody and jeans; the same waiter treated me well when I wore work clothing (even if I got a little sloshed over the course of lunch...).  I don't hold this against them.  What I do find obnoxious they can't do much about: the restaurant on the bar side is narrow, and when you're seated with your back to the restaurant, the patrons and waiters constantly hit the back of your chair trying to pass.  It gets old.  If this place were bigger, less touristy, healthier and cheaper I'd go there more often...but then it wouldn't be le Central, and I probably wouldn't like it as much.", "author": "Phil K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-02-05", "description": "I wish I had tried the cassoulet. I went in wanting to try the blood sausage but it wasn't on the menu that night, so I uncharacteristically played it safe with the roasted chicken. It was a disappointment-- a bit dry and overcooked. The french fries were pretty good, but oddly enough the most flavorful thing on my plate was the roasted tomato topped with crumbs and some cheese.\nI heard good things about the steak across the table.\nThe atmosphere is pleasant and festive, and it was a nice meal, but the prices are pretty steep for what you're getting. \nAnd no Wilie Brown! But that's ok, I think I've seen enough of him for one lifetime.", "author": "Sara G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-04-23", "description": "For very reasonably-priced French food in a relaxed but classy atmosphere, it's an excellent option. It's a convenient lunch option of mine, so I can't vouch for dinner, but I can say the following:\n\nSalad nicoise - YUM!\nCaesar salad - quite good\nFrench onion soup - nice, but a bit too much cheese on top for my taste\n\nService is friendly - they greet me by name - but it can be a bit slow during peak hours.", "author": "Amy K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-08-12", "description": "The crab cakes here are amazing - warm & toasty served over a plate of warm butter & white wine sauce... You must try this one! Friendly staff, and the occasional special SF elite guests sitting at the window table if you're lucky!\n\nGreat spot for an afternoon cocktail, steak and fires dinner or just a glass of French (or California) wine and a creme brulée dessert.", "author": "Brian B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-09-28", "description": "Boo! This was one of the first places I went to after moving to SF years ago. I gotta say...it's gone down hill. Sad because I used to love Le Central. Even the onion soup wasn't as good as I remember. Having one server is not ok - when you're charging as much as they do!!! Even if it a s week night an it's not packed! Le Sigh...", "author": "Marianne s."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-04-16", "description": "If your looking for a warm cozy French Bistro with ambiance, and good service Le Central is Perfect. Convenient location downtown draws locals, tourist and regulars a like. \n\nI recommend the tasty onion soup!", "author": "Shannon H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-07-03", "description": "Good but coulda been better. Very fine corn soup leads to decent but somewhat bland beef bourg. n very bland sides. Again def. way too pricey for the caliber of  old time bistro fare offered", "author": "Rick N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-06-16", "description": "I use to frequent this restaurant a lot and have eaten a lot of the choices on the menu. I've eaten many lunches and dinners at this restaurant and I have thoroughly enjoyed every single meal I've had here.  At lunch you will typically see some of San Francisco's biggest bigwig's from Mayor Willie Brown, Wilkes Bashford, even the Gov. Arnold Schwarzenegger.  \n\nThis place has the absolute best French fries you've ever tasted.  I would usually get the Filet Mignon with the Pepper Corn sauce and use that as dipping sauce for the fries, it is delicious.  Their Greek salad with Chicken is great for lunch. Actually all of their salads are great.  Their Shrimp Risotto was another alternative of mine.  It was always seasoned great and the risotto was great.  Their French Onion soup is always good any time of the year.  For dessert, I typically would get the tiramisu (which is still the best tiramisu, I have tasted ... and trust me I've had a lot of tiramisu).\n\nTheir servers and wait staff is very friendly and helpful.  The atmosphere is great.  It is a small bistro w/ nice dcor and usually has fresh flowers in both rooms, the bar side and the dining table side.  The small little chalkboards with the specials is a nice touch.  Parking may be difficult, but then again..... its San Francisco.\n\nOverall if you're looking for a great experience in a nice French-bistro style restaurant, go to Le Central.", "author": "Jason S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-02-08", "description": "Everything was great.  Excellent service was timely but not rushed,  Varied and interesting menu choices.  Good selection of wine by the glass or bottle.  Food was excellent and beautifully presented.  We had fresh oysters on the half shell, a salad, and split an entree.  Our filet was cooked perfectly, split onto two plates in the kitchen and so beautifully presented that it appears the chef has a flair for design.  A memorable experience!", "author": "Jeff H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-10-22", "description": "I came here with my wife about a year ago... we ate relatively well, by keeping it simple, and somewhat enjoyed it, although it can't be compared to Cafe Claude or other French restaurants in the city.\nTonight we went back with 2 more guests, and we ordered much more traditional French food: the cassoulet was tasteless, the chicken super-dry, the duck rillette like... out of a cheap can.\nThe place is very dirty; they sat us in the corner at the end of the dining room, and I felt that the whole surrounding was quite filthy as we were sitting down. After 20 minutes, an unidentified insect (I really don't want to know what it was!) started cruising on the wall right next to us. We called the waiter and... she asked us to catch it (!). They offered to give us free desserts on the house to apologize, but then they only took one dessert (the cheapest one) off the check.\nPretty disturbing and pathetic experience. Definitely a no-go-back.", "author": "Peppe R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-07", "description": "Went here last night for my Dad's birthday dinner. Decided on this place because he used to work here in the pantry 24 years ago and hasnt been there since.\n\nI called 2 days in advance for a reservation and got seated as soon as they looked in the book. BTW parking is horrible.\n\nWe were served by Jimmy, older Asian man. Wasn't too pleasant and it felt like we were a bother to him. seemed to be more into the bigger party and the smaller party on both sides of us. (8 on one side 2 on the other). But the Hispanic guys were on point! refilled water and drinks, bread, the whole 9 consistently.\n\nThe food was good. Everything we ordered was well presented and cooked to perfection. Def. recommend the roasted chicken w/ frites and the jumbo prawns with risotto.\n\nfor 4 people with appetizers, main dish, and dessert came out to 160 before tip. kinda pricey but worth seeing my dad happy. Would come again.", "author": "Edwin M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-10-20", "description": "So this week I've been trying more of the entree dishes and so far they have been delicious!  Both times I went for lunch this week the fish special was so good.  The butternut squash soup too was awesome with a beautiful presentation.", "author": "Ikey S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-12-25", "description": "Quite disappointed.  After a few meals at Scalas Bistro in the Sir Francis Drake Hotel, I requested a nice change of pace from the hotel concierge.   She recommends Le Central.  Bad call.   Food is not very inspirational, service seemed flustered and put out, and some mystery floaters in the water.   Not a great night.", "author": "Shad A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-09-27", "description": "The tables on the bar side have the best views of the moving tableaux of SF's MoversandShakers, and, most importantly, easy access to hailing your waiter to bring a second martini.  \n\nLe Central is always good for listening in on others' conversations and reconnecting with the Interior Carnivore - if you're a vegetarian or on a diet, just don't go there.  Monsieur Boeuf is the King and Madame Creme de Fromage is his consort here.\n\nYoungin's groan at the 1970s era decor - get over it, kiddies.  You're not wearing the decor, for chrissakes.\n\nThe prices are a bit high for what it is, but stick with the onion soup and the endive salad (ah endive prices at the market make me want to scream), or splurg for a case of the gout and order the cassoulet (been cooking since the Carter Administration supposedly).  Just don't eat anything for 12 hours prior to the cassoulet: it's not for rookies.   \n\nI don't recommend the pate - just save your pennies for your trip to France and get the real stuff.  The dessert tray has seen brighter days, too.  \n\nThe service is great at lunch (Louie is one of my fave waiters in SF).   Supper is a much more sedate crowd, but no less enjoyable.  Not the place for hard-core foodies or those on the extreme end of food fads, but fine for a dependable meal and civilized conversation levels.", "author": "Curtdude T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-12-07", "description": "We Had a reservation for 6:30, but somehow wound up an hour and a half early. Good thing too. Our waiter was Louie, sharp as a tack, saw us standing outside, ushered us in, gave us the best seat in the house and couldn't do enough for us. He's been with the restaurant since it opened and knows his stuff. The only problem is that he only works from 11:00 am to 6 pm. By getting there at 4:30 and eating early, Wow, what a treat. Would not have been the same meal without him. I had the cassoulet, in a word, perfection. My friend had the veal piccata, again, perfect. Don't get me started on the extras.........I haven't had such a good time and a good meal in years. Go early........grab Louie.......they're open all day. We'll be back...", "author": "Jeffrey C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-12-01", "description": "I wanted to like Le Central but was sorely disappointed. The food was very mediocre. The staff not much better. I'm generally not that critical but I was just kind of shocked at the whole experience (lunch).  Once you've eaten at a true French bistro this seems liked a charade.", "author": "D. H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-03-13", "description": "Overpriced and overrated would be the best ways for me to describe this spot. The food is fine -- nothing memorable -- but my overall experience was subpar. In fact, two stars is being a touch generous in my book. For lunch, at least. My boyfriend and I went in for lunch on a whim and were a bit surprised by how pricey their lunch menu was (they don't have a lunch-specific menu; it serves as a dinner menu, too). After a slight jaw drop at the $25+ lunch options, I finally settled on something small and my  boyfriend nabbed a Nicoise salad (around $20). Now, with the pricing and the intimate (read: tight) layout, I would think that the service would be top-notch to match. Nope. Not even close. I've experienced better service at Vietnamese restaurants where my server and I weren't even speaking the same language. Our server was far from welcoming and at times I felt like we were a burden for him. He was very blunt when answering my questions and seemed extremely perturbed by the fact that I ordered off of the starter menu for me meal. I mean, KILL ME! I wanted soup -- I'm sorry I didn't get the $25 catch of the day at 1PM! As soon as I ordered, his response went directly to the order minimum (apparently there's a $15 minimum per person... oops on my part for not reading the fine print): 'Well, I guess I'll let the minimum go since you're obviously not hungry.' Umm... okay, gee, thanks. While I do appreciate the gesture -- I really do! -- I felt bad the entire time and felt like a complete cheap ass for being called out. The waiter  plus the stuffy environment made our lunch very awkward. I would have opted for hole-in-the-wall pho or cheap-o sandwiches over this place. Unless something changes drastically, I can't imagine I'd ever go back or recommend this spot for lunch.", "author": "Shannon E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-02-13", "description": "beautifully presented food on a perfect afternoon lunch with my loved one =)", "author": "Linda A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-05", "description": "There were seven of us for dinner on Friday evening.  The appetizers we had--smoked salmon, clams bordelaise, Caesar salad, onion soup--were very good.  The entrees--from the cassoulet to the sea bass to the salmon to the steak--were terrific.  The service was impeccable without being intrusive.  The staff was very accommodating as we ate and talked for three hours.  It had been awhile since I ate here and we were glad we decided to try an old favorite.  We'll be back.", "author": "F B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-01-03", "description": "This is one of my husband and my favorite restaurants in the city.  I always have the scallops, which are always perfectly cooked; and my husband always has the chicken with french fries - the french fries are the best in town!  They also make a mean dirty martini.  We love the after work people who sit at the bar and become weirder as the evening progresses.  The only thing I would change is the fluorescent lighting that's covered by pretty stained glass.  (Keep the glass, change the lighting.)  The owner/manager and wait-staff are hilarious.  With them and the funny clientele, it's never the same place twice.", "author": "Ravena F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-09-07", "description": "What can you say about this place?  It's one of the standards in the City.  If all else fails, head to Le Central.  I have yet to find a more savory French fillet anywhere!  I have even sat by Herb's table a couple of times.", "author": "Joel C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-12-26", "description": "All the food was decent, cassoulet was quite delicious, but the price was excessive for what you get.  I think this is a result of being near Union Square and a bit of a tourist trap.  Not for locals.", "author": "Mike P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-04-07", "description": "The folks were quite CHARMING and the service was amazing. The folks here truly pulled out the stops to make us feel special. Definitely get the friend chicken!", "author": "BrasilPo P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-01-01", "description": "I tried this place after reading an article in my local paper in Austin, TX.  The review was over 2 years old, and I guess have changed.  I ate there about a week before Christmas with a group of 9.  I had made the reservation, which was easy enough to make for a Wednesday night.  Immediately my impression was of a tired, old restaurant trying to hang out to its glory days.\n\nThe staff was extremely friendly and attentive.  I ordered a nightly special, pasta Bolognese.  I've had much better in Italian restaurants.  It was quite bland.  I should have ordered the cassoulet, their specialty.  Two others did, and I got to try it.  It was excellent.  It tasted like it had been cooking for hours, and it just melted in my mouth.\n\nSomeone had a fish dish, and they said it was pretty unremarkable.  To compare, I had eaten the year before at Café Claude, a couple of doors down.  That place definitely made me feel like I was in a French bistro.  The food at Le Central was several notches below that.\n\nFor a place on the coast I've never understood why the prices are so high on seafood -- and everything else for that matter.  I can get food that is far superior here at home, including seafood, for much lower prices.  I understand that cost of doing business is higher there, but still...\n\nI'd recommend this place for a group, but for a more intimate dining experience and better food I'd go elsewhere.", "author": "Philip G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-10-13", "description": "A personal favorite provided that one sticks to the basics: filet mignon au poivre with fries and a salad nicoise to share, with the dishes plated for two people. Delicious and the creme brulee is excellent as well. Other dishes are a bit more \"hit or miss\" though these two treats always make it feel like a bit of France here in SF, especially on a rainy day.", "author": "Eric F."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-10-27", "description": "This the worst restaurant I ever had in my last 5 years... they label it as French !,  this is a lie, the food is cheap, poorly done.. they probably pay the people to say good thing about them, shame on you. \nWe had a dinner, 7 peoples and everyone was like ..what ! , unbelievable , save your money and date ! look for a decent restaurant, avoid this SCAM.", "author": "Cheval M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-04-18", "description": "I have had better service from a taco john's drive thru and the food was just 'eh... Le Central is more Le Dreadful.", "author": "Steven K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-23", "description": "Consistently delicious food in a very comfortable setting!!!  Le Central has been a favorite for years and years!", "author": "Morgan A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2005-10-04", "description": "An old San Francisco standard that you really should not go to unless you are, well, old.   Most dishes are heavily laden with salt and butter.  The menu is famous for its Cassoulet, Escargot, Crab Cakes, etc.  Very heavy, very 1974.  On the plus side, if you go at the right time you can do some minor local celeb spotting - Wilkes Bashford, Willie Brown, Nancy Pelosi, among others.", "author": "Amme P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-07-18", "description": "Great Tiramisu and I dig the French Onion soup here. I must admit I have ordered a few things here that were less than great over the years....  but I do like the overall feel of the place for an intimate dinner. The whole power lunch crap that goes down here is laughable. Used to be Herb Caen's hangout, and the front booth bears a plaque in his name.. The service is pretty good, and it's usually not packed for a late supper....   good place to talk on a date.", "author": "Steven G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-07-01", "description": "Le Central has gotten pounded!!! I went to Le Central after reading tons of not -so -great reviews and I think that places like Le Central, that is older, established restaurants are not appreciated for what they are. \nLe Central is not the newest or the flashies, chowhound food place. \nYou are not going to find it on some feature in a San Fran magazine. \nWhy go? Because it is a classic and I very much wish that Yelp reviews took more note of those places that have been around. \nI went with a party of four and I should note that we are young. We loved it. It was memorable and yet, so many places in SF are just a flash in my mind.\nIt is so classy and the maitre'd was in a lovely suit. Our wime choice was great and our entrees were delicious. The filet was excellent, my flat steak was really perfect. Goat cheese salad had lovely tomatoes.The chicken was so-so as was the risotto but when they brought the dessert cart out, well, I felt like a kid or as if I were in a dream. The food is not creative or new, but it is great and the ambience with the open windows is very romantic and quiet. This is a great date place. Le Central may not have latest but the food is good, the ambience is great (reminds me of a small village place in France) and deserves a visit.", "author": "Emily H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-08-08", "description": "Le Central came highly recommended from a friend so we walked in with high hopes. It was just as charming and quaint as expected. Our server was very helpful and suggested an haricot vert salad that was very refreshing. The fettucini bolognese was spicy, but comforting, and our greek salad was tasty too. Nothing revolutionary (i.e. vive la revolution!) but I will definitely go back when I'm craving the warmth of a traditional French bistro.", "author": "Amy J."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-02-02", "description": "Okay, so Le Central is really nice, quant, good Martini's, attentive bar staff. However, I have an issue with the description on the menu. I had \"Grilled Jumbo Prawns Saffron green pea risotto, tomato sauce\" What I did get was 4 perfectly cooked jumbo prawns with rice with green peas, NOTHING close to risotto.. At $25 if it had been a proper risotto then I would have been, okay there was some work involved in the dish and perhaps justification of the cost of the entree, but it was plain old rice, and grilled prawns, no special talent needed to do this.. So basically it was like $5 a prawn and $5 for a portion of rice.. I know you are close to Union Square and get a lot of tourists (BTW, I am not a tourist, I might have an accent but I've lived here for 22 years). Set the expectations for the diner. I was expecting risotto, I got rice with peas. The Butter lettuce salad was good, true to the menu. Desert was good too, and true to the menu. For me, the heart of the night is the main dish and it really fell short. I did look at our neighbors who ordered the filet and it looked really good and they totally cleaned their plates.. I am up for trying this place again.. Perhaps I need to ask many questions before I make my decision on what I am going to order so I am not disappointed.", "author": "Martina L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-03-30", "description": "I was told I would see Willie here! Oh well, maybe next time. The service is relaxed and friendly and the food is dependably good, albeit expensive. The lunchtime crowd tends to be power lunch types and geriatrics, but perhaps to be expected for the neighborhood. The cold salmon is really good, as is the shrimp and risotto.", "author": "Jen L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-20", "description": "Great atmosphere and amazing happy hour! $1 oysters??? Yes please!!", "author": "Shermayne C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-17", "description": "this place is old school frenchy.  think cigars and brandy.  willie brown also seems to frequent this place... although i don't think of him as either old school frenchy OR cigars and brandy.\n\ntheir filet mignon is tasty.  if i feel like a good filet mignon, i'll come here.  also love their crab cakes.  all their food is very simple, but done well.  even their plain vegetables side taste awesome... but my favorite side is the gratin.\n\njust because it's traditional french doesn't mean it's easy to do well; i've seen many places fail at just that.  this place is solid in my book.", "author": "Erika C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-05-14", "description": "Went here for a weekday lunch with the Moms and got seated immediately next to none other than former SF Mayor Willie Brown.  I think the hostess was diggin' my suit so much she felt compelled to seat us among the power executives.  Little did she know that I picked up that particular garment in Thailand for a price I won't disclose.  Anyway, my pre-conceived perception regarding French food and small portions was put to rest that day.  French Onion Soup was on point and the special of the day, a Braised Beef dish, was very satisfying in both quality and quantity.  To conclude my Le Central experience, Willie Brown shook my hand and gave me a pin promoting his new book.  Now that we're homies, I feel obligated to give him a plug.  \"Basic Brown: My Life and Our Times\", in stores now!", "author": "Brent N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-08-07", "description": "I can't say one good thing about this restaurant and can't for the life of me figure out what others have liked. The host was morose. The unintelligible manager was confrontational and the waitress was surly. The onion tart was a mass of gooey butter and flour with no texture whatsoever. The cassoulet was overcooked with soggy flavorless meat and the chicken frites arrived raw. After sending back the chicken it was returned burned to a rock-like texture. We also had to send the wine back as well and had everyone come over to our table to give us dirty looks.  The place was empty and we should have taken the hint. My friend grew up in France and I am a caterer.  Stay away and find someplace good to eat.", "author": "wwmb b."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-04-29", "description": "A quintessential SF spot in a way that people have been going there for decades and some of the movers and shakers are there playing games and socializing... Arnold, current and former mayors, Wilkes B and similar crowd frequent this spot.  The food: delicious, the service: impeccable & classy, ambiance: suave, fancy...yet comfortable...  Go check it out!", "author": "M D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-08-04", "description": "overrated.  \nthat's all.\nso expensive. and none of it wowed me even remotely.\nwe saw brian boitano AND willie brown there and it still wasn't worth it.", "author": "K H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-07-22", "description": "This was a last minute choice as we had just arrived in San Francisco.  The food was wonderful and the staff helpful and friendly.  Definitely a keeper!", "author": "Alessandro I."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-09-03", "description": "A wonderful neighborhood establishment for classic french cuisine. The atmosphere is cozy, the staff are quite helpful and the prices are reasonable enough to attract the locals as regulars.", "author": "Sara C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-21", "description": "Old San Francisco restaurant with an exceptional menu and wine list.  Their half chicken and pomme frits are the best you'll find anywhere.  Its a place where the local politicians eat.  In the old days you would find former mayor Willie Brown having a quiet lunch.  Its still great after all these years!", "author": "Ron C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-09-28", "description": "I'm an old soul so I like this place with an old fashioned feel.", "author": "Wakako U."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-20", "description": "Through a strange circumstance, our first and only meal from this place was takeout.  I felt pretty lame standing by the host's stand in shorts, waiting for plastic-bagged French food.  My lameness notwithstanding, the meal we ate at home 20 minutes later (!) was easily one of the best ones I've had in San Francisco.  How could a Filet Mignon delivered in plastic taste THAT GOOD?  I can only imagine what it would have been like in situ.  Likewise, my wife's chicken and frites were that old-world delicious that only places that have been open since the 70s can conjure up.  The raspberries for dessert melted wonderfully in my mouth.\n\nWhen I first walked into Le Central, I pegged it as something of a tourist trap; if anything, it might be somewhat trapped by the tourists.  The locals need to give this place some respect, and certainly more of their business.  We will.", "author": "Rob P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-03-30", "description": "Classic French bistro.  I go back and forth between Le Central and its neighbor, Café de la Presse all the time.  Drinks at the bar or diner, I've never been disappointed here.", "author": "Kim M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-07-26", "description": "I know this is Willie Brown's favorite hang out for lunch and a power broker's haunt, but skip the menu and just go for the desserts.  The cassoulet was dry, over-cooked and ordinary.  Smoked trout appetizer  presented in a lackluster presentation, overloaded with red onions and the baked goat cheese appetizer with salad came with too much vinegar in the dressing and a stingy goat cheese cube.  (I know it's a French restaurant, but I also know a plate full of greens to distract any substantive elements when I see it.)  Desserts were great but left a $50 lunch tab plus tip with a promise not to return.", "author": "Eileen S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-10-28", "description": "I first came here for Bastille Day and had really good French onion soup and  escargots.  This time we sat at the table where Herb Caen used to sit and had the French onion soup, butter lettuce salad, tomato and anchovy salad, and the smoked trout plate, along with some stiff drinks and ending off with the creme caramel and chocolate pot de creme.  Like J said, just basic ingredients, but all prepared correctly.  Staff was very nice, friendly and attentive.", "author": "Pelle Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-04-13", "description": "Yup Dave the bartender is the best!   I also love the atmosphere of the place.  Really quaint.", "author": "Jean K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-07-09", "description": "So-so place.   Nothing blew me away about this place.  The beet salad was pretty tasty but nothing to write home about.", "author": "Chaz N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-03-10", "description": "old school service, french menu...great celery ravigote!", "author": "Margaret L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-02-08", "description": "I go here for the escargot (very traditional with loads of butter and garlic versus the nonsense some restaurants come up with for this dish).  The french onion is excellent.  The entrees can be hit or miss.  If you like traditional french food with no twists, this is the best place in town for that.", "author": "S. C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-01-26", "description": "I came here for lunch awhile back with some colleagues. It's very french - meaning the crusted mahi mahi that i ordered came laden with a rich, heavy cream sauce and accompanied with creamed spinach. It wasn't bad, but at $25 I found it a little too heavy on both the wallet as well as the stomach for just lunch.", "author": "Amy H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-03-31", "description": "Classic SF bistro that is mostly French cuisine.  I think it has been around for at least 30 years.  Sit on the bar side  if you can.  I typically come here in the late afternoons when the crowds thin out (don't care about the who's who who eat here and wouldn't recognize them anyhow).  Over the last several years it seemed like the service and food was going downhill but recently had a great lunch.  Cold salmon and the salad nicoise (?sp) were very good.  Service was good.  Would have given it 3 stars but since it seemed to be improving I bumped it to 4 and will obviously return.  someone else mentioned possible new owners, I don't know about that but something seemed different and potentially for the better.", "author": "Damon S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-08-18", "description": "This place is a quaint, cozy San Francisco tradition. You can come in here for food and a drink to warm up from the fog outside, escape the heat, or shelter from the rain. The food here is the traditional French Bistro and is delicious. I usually sit at the bar and eat and drink. The waiters and bartenders are friendly and know the ins and outs of the cuisine and wine pairings.", "author": "Vanessa C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-03-29", "description": "I used to like this place... not so much anymore... I had a bad experience last time I went there; I was with a group of friends, a group of 6+ so yes they included the 18%, fine... what was not so cool is that they charged each single of us who paid with a credit card an additional 18% tip even though we mentioned $0 as the additional tip on the receipt... mistake? maybe yes, maybe not... I'd leave one star for the food that was quite good.", "author": "Jean-Paul S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-03-26", "description": "I give this restaurant three stars for one reason only: the food was pretty damn good.  The service on the other hand was awful.  Our waitress took about 15 minutes to come to the table (the busboy had already given us bread, but we didn't have anything to drink), and was as personable as wet cardboard.  She didn't ask if we had questions or make any suggestions as to what we should order as first time diners.  The appetizer arrived and instead of the french onion soup I ordered I was presented with a crab cake.  I alerted her to the error and decided just to eat the crab cake, which was delicious, instead of wait for her to remedy the situation.  She apologized but once again the lack of any real concern showed through.  My boyfriend ordered the cheese plate which was tasty but the neighboring table had to supply him with a piece of bread as our waitress never came back to check on us, although he attempted to make eye contact with her repeatedly.  It was as though she was blatantly ignoring us!  Our filet mignons with veggies were cooked properly and very good.  I had a coke to drink and after it sat empty for 10 minutes my boyfriend was finally able to flag the waitress down to ask for another.  I work in a fine dining restaurant in another state and I completely understand how it feels to be weeded, but a smile and genuine concern for my customers always goes a long way.  The tip, needless to say, was the worst I've ever given any server in the last 15 years.", "author": "Meg D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-05-31", "description": "The place for french onion soup on a cold day. Menu proally hasn't been too updated the last ten years and Willie B. loves this place to hob nob w. Arnold S. They have no taste...in old style food.", "author": "miriam b."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-02-14", "description": "Not impressed - probably will never go back given the dining options in San Francisco.  For the price, try Absinthe on Hayes.\n\nThe food was just okay.  Nothing to write home about.  I had the onion soup, caprese salad, and filet mignon - the soup lacked flavor, the tomatoes tasted like safeway, steam-ripened delights and it felt like the kitchen was trying to hide the fact that the ingredients were cheap by burying them in mediocre salad dressing.  The filet was nothing special.  The presentation was laughable - it felt like Joe's at Westlake.\n\nGenerally an older crowd.   The tables are crowded together, so you're literally sitting inches away from the people next to you.  On the night we went out, my wife and I were enjoying ourselves and our own conversation, but by the end of the night, we found ourselves having to apologize to the people next to us - a pretentious, older (50+), racist (anti-german) french couple sitting next to us - because they thought we were being too loud and gesturing too flamboyantly.\n\nGiven the crowded placement of the tables, the mediocre food, and buzz killing neighbors we had the night we were there - I have to give this place 2-stars....", "author": "Justin V."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-08-25", "description": "Great little French bistro in the heart of SF. The menu is limited, but specials make up for it. Good place for a tasty taste of French food at an affordable-level.\n\nI'm a suspicious as to whether the by-the-glass Bordeaux was really a Bordeaux or not.", "author": "andy s."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-10-23", "description": "Whenever I get a need for REAL French food, I go to Le Central.  It reminds me so much of the bistros I visit whenever I am in France.  A true delight in the City.  The food is excellent and the staff is very friendly and helpful.", "author": "Danny M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-10-30", "description": "While the food is good, I also enjoy the atmosphere. It's clubby without the pretension. Louie the waitperson is fantastic, and it's fun watching the San Francisco Swells in their Brioni/ Chanel best shmooze and gamble. Have some fries and enjoy the show!", "author": "Fawn L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-04-14", "description": "Steak tartare the best in the city as well the french onion soup. .\nkeep up the good work", "author": "susan m."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-05-28", "description": "Le Central is a perfect example of a small French bistro you'd find in Paris or the nice part of any random French town. The food is very good for bistro standards and attracts a high-end clientele during the week's lunch hours. However, lunch on weekends is very slow and perfect for a quite meal.", "author": "Guillaume J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-07-23", "description": "Le Central was good.  The entree was amazing, it was one of the daily specials, a seabass.  That I would highly recommend that as well as the frites (fries).  But the creme brulee was just ok.  It was kind of bland and very eggy, but the rest of the meal was great.  The service was also very good, the wait staff was very attentive.  The prices were good not great.  Try it for yourself...", "author": "Brad T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-09-10", "description": "Food is great, and Willie Brown is a staple.  I'd recommend this restaurant for a casual lunch close to the financial district and shopping.", "author": "Matt W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-11-20", "description": "a fantastic french bistro.  i had steak tartare for the first time, and it was great.  my husband had the lamb, which was also wonderful.  and, i met willie brown there, the waiter introduced me!  it is always great to have a high budge meal where the waiters are not snobby.", "author": "charlene l."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-05-31", "description": "It seems Le Central isn't quite hitting it with the younger crowd... I've gone here three times, with my best friend and her parents, before a show at the GG Theater. (Years ago, right?) Personally, I've NEVER had a bad experience here, and the food I've ordered has been very good. The service is hilarious if you don't take the waiters seriously! I never do. When we were there last we saw Maggie Scura. Cracked me up! She looked exactly like she did on TV years ago! We've seen the mayor W. Brown, too. I don't know. It's an old SF institution... I dig it for the experience, and honestly, I've always had good food or I wouldn't come back. You just have to know what to order. (Not the rabbit, apparently...) I wish I could remember what I enjoyed the most, but other than the creme brulee, I'm drawing a blank. I've eaten at too many French restaurants to keep the menus straight unless I've just eaten there. I'll post an addendum next chance I get because I want to take my husband there and see what he thinks....", "author": "Shari D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-13", "description": "For a great stand by, solid French meal, nothing fancy and not too expensive  and not trendy but comfortable, Le Central is quite dependable. We had dinner last night with a friend visiting from NYC. Great poached salmon and great flank steak with frittes. Steak tartare and buter lettuce salad to start were all superb. Salad a little over dressed but then again its not Bosnia. Wine list is a bit varied but from a consistency standpoint - Le Central is always there for a good dinner. Service was pleasant and efficient. They give you the LARGEST chunk of butter with your bread - that has got to be worth something", "author": "greg o."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2005-03-30", "description": "bonjour everyone....just found the best onion soup...if u like cheese...this is the one to order.....  bon apetite", "author": "Mee-stique K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-03-05", "description": "I ate dinner here at the bar the other night, food was great, the bartender was fantastic, I think his name was Dave, and he was cute too ;)", "author": "blah k."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2006-02-20", "description": "Over-priced, over-hyped (just cuz SF poloticos go there dosen't mean the food is good!) Very disappointing food esp the Casoulet though the pomme de frites are tasty!", "author": "dawn w."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-11-15", "description": "The Scallops Provencal  - awesome! And the staff was very nice! Charlie, the man who greets you when you come in, did something extra special for me - he held on to a parking space right by the restaurant and guided me by phone as I was just a few blocks away! I have never had such kindness extended to me by a restaurant person! The restaurant is an easy walking distance to the Theater District and Union Square. This was my 1st time there and I will go back - many good choices on the menu. Nice wine, too. Will be added to my fav's.", "author": "Doris D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-02-13", "description": "Our recent visit was truly a bad dining experience. I think that the quality has plummetted, perhaps its 'new ownership,' not the original team. We were a group of 4 sitting in the back room. On the banquette at a table next to us was a man and woman 'couple' who were amorous in an appallingly inappropriate plublic manner. Our group is in our 40's and no prudes, but it was an uncomfortable experience, one that we felt discomfort not only for ourselves but for those around us also who clearly had an issue with this inappropriate behavior in a public setting. It was also a disappointment that management didn't address this situation and seemed to ignore the comfort of their guests. I would never bring my parents to this place after witnessing that. On top of that, our server, and thus service, was poor: slow, forgetful, and usually absent. The food was forgettable, I had casoulet, which was just mediocre, lacking in flavor, I have had much much better elsewhere (eg., Jeanty at Jacks). I would be disinclined to suggest Le Central to my parents - or my friends - in the future- but i would suggest they go to any of the better french restaraunts in town, Jeanty's, Cafe Claude, Fringale, etc..", "author": "Mike P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-02-01", "description": "On 1/26/10 a friend and I had dinner here and I must agree with some of the other reviews that the place is not worth the money for the quality of the menu items. My filet with the peppercorn sauce was just OK but the sauce drowned out the flavor of the meat. The onion soup was very tasty however and normally I would give more stars but the attitude of the waiter controls the number of stars in this case. The place was virtually empty and yet the service was very poor with the waiter having an attitude of boredom as if he was  bothered having to wait on us. I had read they were participating in the \" dine about town' pre fixed dinner plan and yet when I asked about this they were somewhat aloof and not eager to provide any information about this program.When we did get that ' dine about town ' menu he started to grab our regular menus away with a huffy attitude. Although we did not select that pre fixed menu it would have been the smarter thing to do since the value for the regular ala carte entrees was just not there. Maybe if the wait staff's attitude was a bit more friendly they would have more than 3 tables full on a week day night !", "author": "Ann B."}
