{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-05", "description": "Le Regency is my go-to for a healthy breakfast...or bagel and lox. The veggie omelet is huge with bounteous amounts of spinach, mushrooms, and more. Sometimes I add pepperjack. Sometimes I don't. Never hurts the omelet either way. Very tasty and fresh. The same goes for their lox. Fresh tomatoes, crisp red onions, delicious lox, and so much cream cheese it oozes out the hole of the bagel. Complete shift from a healthy omelet, but incredibly satisfying nonetheless. \n\nI've never gone their for lunch but I've seen the owner/manager preparing sandwiches and they look amazing. Maybe someday...", "author": "Nick J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-12", "description": "This review is for their sandwiches. They are always fresh, and don't skimp on ingredients. I usually get a turkey, cheese, and avocado sandwich and it comes to under $10 (and they give you half an avocado on the sandwich!) Friendly fast service, too.", "author": "j s."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-10", "description": "After many years of my office being in another part of town, I've recently moved back to within a short walk of Le Regency Deli. I was pleasantly surprised to see that this deli is still family-owned and still tops!  Best deli sandwiches in the financial district!  Support our locally-owned businesses!  Eat at Le Regency Deli!", "author": "Darryl W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-15", "description": "Great location, good quality ingredients, tasty food varied menu and great hours.", "author": "Jimmy L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-03", "description": "Decent breakfast place! It's a cute little place and the staff is super friendly and kind!\n\nThey have a variety of sandwiches, breakfast items, drinks and snacks. I tried their omelette with ham with tomatoes, spinach and potatoes. It's like making a subway sandwich. They are pretty quick which I like because I got to get to work and prices are cheap and portions are big. The omelette was pretty decent, definitely I feel its more healthy than eating Lee's deli oily eggs. Overall I would definitely come back here again for breakfast!", "author": "Natalie L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-23", "description": "Conveniently located near the Embarcadero BART station, I grabbed a plain bagel, lightly toasted with cream cheese and tomato to help me along my Meatless Monday. The gent behind the counter was super friendly even though the guy in front me ordered a coffee but decided to not move forward with the purchase. Not trying to add to that frustration, I paid, tipped them and smiled. He returned the smile and gratitude. So don't be that other guy. Plus the bagel was exactly what I ordered. Yes, people can mess that up. Believe me.", "author": "Bernadette M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-27", "description": "Awesome! I had the burrito with Spanish rice, refried beans, potato, egg, chorizo and cheese. I eat A LOT and it filled me up! Fresh and delicious!!the coffee was excellent too!! Fresh fruit was actually fresh and REALLY good too!!!", "author": "Darren R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-11", "description": "I needed a filling meal after my doctors appointment. This happened to be next door, and this is probably one of my favorite sandwich places now. Large selection of meats, quality bread and a great atmosphere. Thanks for lunch.", "author": "Aiga B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-11-08", "description": "I saw the line and thought this must be an interesting place to try.  I was disappointed.  The sandwich was just ordinary, on the salty side.", "author": "Sin-Yaw W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-08-25", "description": "\"The sandwich you need, not the sandwich you deserve.\"\n \nI work pretty close to this place, so whenever i want something quick, around $10 and decent I will hit up Le Regency.  This deli is not going to amaze you with ridiculous flavors or stunning ambiance, as it is what it is, a standard deli.  My personal favorite is the Turkey Bacon on a sourdough  roll.  The main takeaway is you could get this same sandwich from Safeway for $4 cheaper.", "author": "Anthony B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-02", "description": "Simple sandwiches at a great price (Turkey + Avo + Cheese) and under $10. No fancy aiolis or meats, these are Mom & Pop style sandwiches!", "author": "Molly H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-05", "description": "My go to spot for a quick bite to eat for breakfast. The best egg and cheese bagel ever. Plus I love the fact that they use real eggs.", "author": "Michelle L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-12", "description": "Just got an omelette and English muffin. Eggcellent!  I'll be eating breakfast tomorrow there again.", "author": "Mark L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-07-31", "description": "I hate to give a low review to a mom and pop shop because I'm all about supporting small business but simply the food is not good (at least not breakfast). It's the only cafe around the block of my new office building so I stopped by for a quick breakfast platter take out. \n2 eggs over med with bacon, potatoes, and toast.  The line moved quickly - the front register lady was friendly and to the point. \n\nService was quick so no complaints on that but after paying almost $11 for a breakfast platter - what I ended up getting were some hard potatoes that weren't cooked through and microwaved, along with a few strips of greasy bacon that was premade and nuked, the eggs were ok but over easy, the toast was soaked in butter and slightly stale.", "author": "Brenda L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-16", "description": "This place is another of my favorite lunchtime take-outs. The sandwiches are to die for, my favorite is the BBQ Pulled Pork sandwich.  Nom nom nom. Service is extremely fast and even when there is a line out the door (always a good sign) you will never have to wait too long", "author": "David M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-05", "description": "These guys are GREAT! They make your sandwich right there in front of you - whatever you want. Speedy and thoughtful - the bread is always fresh and they pile on the meat - great roast beef or turkey or pastrami. You get your money's worth for sure.\n\nYou can eat in or take out. The cashier is always glad to see you too.", "author": "Laurie Anne B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-17", "description": "Yes! My hands down favorite breakfast spot. I was a big bring your own food to work guy. But sometimes I just needed some bacon egg and cheese in my life and his was the best one I'd found. Add a little avocado with a nice toasted bagel and you've got yourself a serious sandwich that can cure any any kind of Monday feeling.", "author": "John B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-23", "description": "Best of everything...fresh meats, bread selection, soups, salads, all the extra and PRICES.\nLocation is super convenient, clean and staff is very considerate and welcoming.\nExcellent place to sit & chill with friends or impress your boss over a fast and reasonably priced meal-meeting. Outdoor seating is a plus - clean with FiDi atmosphere.", "author": "Susan m."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-14", "description": "What's a delightful little find.  I'm not from around here and I wanted something simple (read: not hotel restaurant)but friendly (read: not fast food) and I stumbled into this little gem. The menu has great diversity of standards and fun stuff and the staff is helpful and very friendly.  Stop on down for some eggs, your momma would want you too.", "author": "Efrain A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-08", "description": "Le Regency is my go-to spot for a sandwich in the financial district. Two main reasons for this:\n\n1) Really quality sandwiches\n2) Very short wait\n\nDuring the busy lunch rush, it can be difficult to find a place that is quick, and with good food. I have never waited more than a minute or two at Le Regency, as they are very quick at preparing sandwiches, and the location is somewhat hidden compared to other areas in FiDi.\n\nThis is a typical make-your-own-sandwich type of place where you choose your bread, meat, and cheese, along with all of the toppings. They also have soups and salads. I would recommend this place for a anyone looking for a quality lunch option in FiDi.", "author": "Andrew L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-09-18", "description": "Came in here looking dumb HAHAHA. Walking in, I had no idea there was a giant menu on the right. I stood there for 3 minutes looking at a small breakfast menu on the left.\n\nAnyways, when you have decided on your sandwich, tell one of the guys behind the deli and they will ask you what your preference is. Mustard/mayo, what cheese, bread, etc. Sandwich is pretty giant. The chicken is a little dry though. I got dutch crunch bread and to my disappointment, it wasn't crunchy!!!\n\nNot a very good experience... Maybe will give something else a try but IDK...", "author": "Benita M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-31", "description": "Still walking by LeRegency and stopping in more frequently for one of their fantastic sandwiches.  Most recently I had Cajun turkey and provolone with the works on a French roll.  The sandwich was huge and so delicious!  I ended up ditching half of the roll since it was just too much bread.\n\nService is fast and very friendly.  And the place is immaculate and always smells so good!  Lee's could learn something from LeReeg (as we call it at work).", "author": ".Hon H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-02", "description": "Very good deli sandwich shop. Great service. Line can be long but moves fast. Go to place for breakfast and lunch in the financial district.", "author": "Ryan G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-28", "description": "Huge delicious and super fresh sandwiches.  My friend from work surprised me with lunch and I open the roast beef sandiwch and gasped.  Fresh, fresh, fresh.  And a giant and delicious sandwich.  One of the best in this office-oriented neighborhood.", "author": "Scott H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-05-12", "description": "I always try to avoid coming here, I'd rather not eat than to come here. The staff are so RUDE, including the owner. And the food isn't even good.", "author": "Jessica S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-02-18", "description": "tl;dr: Le Regency charges you whatever price they want.\n\nLe Regency used to be great: very close to my work, and they make good breakfast sandwiches. The price was always different: sometimes $5.31, sometimes $5.97 ... not a good sign. But it was under $6 so I didn't really care. I came here a LOT for breakfast.\n\nToday they charged me $7.47 for the same sandwich. No \"our prices have gone up\", just \"this is the price it has always been, people must have been charging you wrong\". I've been here 30 - 40 times by now, I know what a breakfast sandwich costs. And by the way, it is egg, toast, tomato, and avocado: that shouldn't be $7.47.", "author": "Egon S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-28", "description": "Their breakfast burritos are so good .. How are they so cheap?? They're huge! Bought them for my sales team and they were so happy.. Also got some breakfast sandwiches which were good too.. But the burritos .. We never knew there was a thing as so much bacon", "author": "Alyssa H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-02", "description": "Have been coming here for years. Great food, super nice staff and affordable prices. I really like the high quality ingredients. \n\nMy personal favorite is the Cajun turkey sandwich with Dutch crunch bread for lunch. \n\nThere can be a line at lunch sometimes, but it moves pretty fast.", "author": "Ari-Hovig I."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-12", "description": "Simple, quick, easy, healthy, affordable. \n\nEverything in the financial district is made for the investment bankers and FAs making 6 figures. Don't they know that FAs require associates, assistants, secretaries, accountants and security guards. And even then...they are the ones expensing everything leaving us to buy our own food. \nSo it is definitely a breath of fresh air when you come here and can afford food or don't wince when you are paying for it. In addition, it's nice to come here and be treated like a person and not part of their production lines.", "author": "Julianna I."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-12-19", "description": "Super friendly staff. The lady who takes order at the speed of light while making all types of coffees and cheering people will welcome you with a 'hi beautiful' or 'hello sweetie'. It makes you feel great and is an excellent approach (especially in these rainy days where we need if no rays of sun some nice words). I liked me capuccino and enjoyed it at the outside little terrace (even if raining, it was still nice). My croissant was big and cute looking but hard like baked the day before. Still is a place I would like to go, I saw a big line and everybody knew what they wanted, which means to me they are regulars there. Prices are very good for the area.", "author": "Carmen V."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-06-08", "description": "$7 for an egg, one slice of cheese & some nuked bacon? \n\nNo thanks, too many less expensive options in the area, without the attitude & price!", "author": "B K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-09", "description": "You won't find a harder working man than Paul who gets up well before dawn to get his Deli open and ready for business. His breakfast sandwiches are cooked to order for you so you know they will be fresh. You will also find really good Soups, Salads and lunches. He has a dedicated hard working staff to serve you as well. After many many years he still offers a fair price even though rents have skyrocketed and he's still around where other investors have come and gone. He deserves community support so don't hesitate to stop in and get your food at Le Regency!", "author": "Shawn K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-07-06", "description": "Overpriced for minimal quality.  I paid nearly $10 for an omelette and a coffee.  The omelette is just meat folded inside eggs and the coffee was weak and tasteless. Nothing special, city prices.", "author": "Rachel H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-02", "description": "Love this place! Beautifully fresh food , great portion sizes, fantastic value for money, and pretty much the friendliest service in the city. Soup and sandwich lunch is a real winner ... try the roast beef!", "author": "Michelle M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-09-21", "description": "This business cheats their customers.  \n\nThat's the simplest way to put it.  Behind the upbeat facade and cheery greetings, this is a genuinely unscrupulous business that I encourage you to steer clear of.\n\nThe ingredients are fresh, but over the 3 years I've been coming here I don't think I've ever been charged the same price twice in a row--even though I've purchased the exact same item on every visit.  The price varies slightly each time, but the general trend is upwards; it's like they're trying to see how far they can get away with pushing the prices up.  I've watched the price of the menu item I order increase 40%(!) but, even today, that price isn't reflected on the menu.  \n\nGo there a few days in a row, as I have, and watch them charge you a different price for the same item each day.  Watch them charge different customers different prices for the same item.  It's infuriating once you realize it's absolutely not an accident and just the shady way they do business.", "author": "Jay S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-12", "description": "My husband is here on business, and I had the grand pleasure of accompanying him.  Walking him to the office, we were looking for breakfast and found Le Regency.  \nWe were greeted by two friendly men behind the counter.  One of them pointed out the breakfast menu on the wall, which was close to the door.  I thought that the menu might be more centrally located, but it wasn't.\nI ordered a vegetable omelet and toast.  My husband ordered scrambled eggs, bacon, potatoes and toast.  He ordered coffee, but I abstained because I saw no decaf with the other coffee thermoses.  One of the men asked why I didn't get coffee, and I stated that I need decaf or hot tea.  He quickly made some decaf just for me, which was very nice.\nI like hot sauce on my eggs, and there was a variety to choose from.  I noticed that the tabasco sauce had no lid, so I chose siracha and green jalopeno tabasco.  There was just a little sauce in the bottle with no lid.  They should just toss that and get a fresh bottle.\nMy omelet was delicious!  The vegetables including mushrooms, onions and bell pepper. They were cooked just right.  I wish that there had been a little more cheese, but I need to cut back anyway.  The toast was a hearty wheat.  My husband thought that his scrambled eggs were a little dry, but he is really into cooking breakfast and particular about his eggs.\nI like this place.  You can tell that it is family owned and has been around for many years.  Good food and good service.", "author": "Robin C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-26", "description": "Crescent shaped, flaky, buttery.  There's nothing that can compare to a good croissant for breakfast.  \n\nFor a minute I get to pretend I'm in France  at a sidewalk cafe. Sipping on coffee, reading the newspaper, eating a croissant at the open tables in front.\n\nI first started coming to Le Regency during the World Cup because they would be playing on the television early in the morning when the games would start in South Africa.  This is when I discovered the super sized, incredibly delicious croissants served here. Best croissant I've had to date. Add cheese, ham, and egg and you have yourself a meal.\n\nThey have fruit salads, bagels, sandwiches, and everything to satisfy your cafe needs. Le Regency is my first stop around Embarcadero when I'm in the area.", "author": "Michael L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-31", "description": "I don't know if this happens to anyone else, but I am great at reviewing places I've been once and horrible at reviewing the places I go all the time. Le Regency is one of those places. \n\nMy standard is the turkey avocado on a sourdough roll.The people here are so friendly and the line moves quickly. They are reasonably priced and take credit cards. What more do you want from a deli?", "author": "Rachel E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-30", "description": "There's not one thing I can complain about during my visit.  The service, the food, the prices, the wait... I felt truly taken care of here.  If you're in town for Super Bowl City, this is right next to it, and will show you how The City takes care of you.  Highly highly highly recommended.", "author": "Justin K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-17", "description": "I'm so close to this place and I can't believe I've never been. I'm actually glad my friend recommended this place for us to sit in for lunch. I had a salami and cheese sandwich on Dutch crutch and a side of chicken noodle soup. \nThe place is spacious and a good sit in for lunch. The cold cut and salad assembly line is neat as is the menu. I am looking forward to grab lunch there a few more times in order to try some of their soups and salads.", "author": "Eli A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-01-24", "description": "There is nothing redeeming about the lunch I just forced myself to consume.\n\nCajun shrimp salad: 5 shrimp, 3 tomato wedges, 1 egg, 1/4 brown avocado and a whole lot of iceberg lettuce. Shrimp, despite the cajun seasoning, were bland and rubbery. Iceberg lettuce does not belong in a salad. At least put some romaine into a salad that costs $8.95.\n\nVegetable soup: tasted rotten. \n\nHalf herbed chicken sandwich: flavorless dry meat atop dry bread. \n\nI guess it's at least better than finding a hair in your food. But not by much.", "author": "Katy C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-09-05", "description": "My coworkers treated me to lunch here my first day on the job.  They called it the \"House of Meat\" because they pile up the meat in their sandwiches.  They weren't kidding, I saw my coworkers' pastrami sandwiches and they were stacked!  I ended up ordering the Reuben and it was really good!\n\nTheir real hidden gem though in my opinion is their breakfast burrito with chorizo sausage, rice, egg omelette, salsa, and potatoes.  For $7, it was worth it considering how heavy it was for a breakfast burrito.  It was like a dumbbell.  I remember coming here every other morning, having their burrito, and not eating anything else for the rest of the day.  Big money saver.\n\nGreat people, fast service, generous portions, it's a perfect spot for breakfast or lunch in the FiDi.", "author": "Rodney H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-30", "description": "I love when my assumptions are wrong. It teaches me to open my eyes a little more. I walked by this place so many times, assuming it was just an average personality-less coffee shop. But when I stepped in this morning, Le Regency kept giving me reasons to like them.\n\nI normally don't comment on decor, but this place has personality: \nFramed vintage European ads,\nRed accent walls,\nExposed pipes,\nAn oversized red wooden bench in the front of the store just screams to be sat in.\n\nThey have very friendly service with lots of regulars, which is a good sign. In fact when a customer walked in, the woman behind the counter said, \"Let me guess...\". She then proceeded to recite his \"regular\" order, to which he responded \"That's right!\" Awesome. \n\nCome here for breakfast sammies, omelettes, sandwiches with freshly sliced deli meats, or made-to-order salads. \nGrab a cookie,\nTake a seat - there are LOTS of tables in here!\nRead the paper....\n\nCause that's the kind of place this is.", "author": "Mariela D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-20", "description": "I had the best egg sandwich on a croissant with ham and cheese. The coffee was really good too! Definitely would come back again!", "author": "Cin P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-27", "description": "I was running to a meeting and needed a quick lunch so I just jumped in here and grabbed a sandwich. For what I was paying the sandwich wasn't anything special, I could have made the same thing at home. Still it was a good sandwich and the ingredients were fresh and they were quick.\n\nTheir breakfast menu on the other hand looks pretty awesome. I wish I could have gotten a breakfast burrito.\n\nI'll give this place the benefit of the doubt and just say you'll get more bang for your buck if you get breakfast here.", "author": "Pranthik S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-10", "description": "I really like this place, but I can see why people wouldn't: they are a little expensive, and the girls behind the counter have strong personalities and are very witty. But the food is really good, it's super clean, nicely decorated and has been run by the same people for 37 years.", "author": "Robert B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-22", "description": "Conveniently located a block away from my office, Le Regency is always a great place for breakfast. My favorite is their bacon, egg and cheese sandwich on your choice of bread (usually varies depending on my mood) for under $6.50 which is good for the FiDi.", "author": "Ashley Nicole C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-03-31", "description": "1.  Review of lunch from Le Regency Deli.\n\n2.  It was busy.\n\n3.  The order and prep process was organized.\n\n4.  The sandwich maker was efficient and friendly.\n\n5.  From arrival to paying for food was well below 15 minutes.\n\n6.  Lots of options for sandwiches (meats, breads, cheeses, condiments, etc..)\n\n7.  Spicy Chicken Sandwich - real chicken breast, tender, fresh ingredients, good roll.  I loved the mustard they used.  It had a nice zip.  It was very filling.  It was a very good sandwich.\n\nhttp://tinyurl.com/434rb9j\n\n8.  Decent prices - Just over $11 for sandwich, drink, two bags of chips.\n\n9.  Overall, it was a nice experience.  If there were not other great sandwich places in the neighborhood, it would garner a higher rating.  I would definitely return or recommend.", "author": "Mark D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-07-29", "description": "Le Regency makes Le Good Sandwichi.\n\nMy personal favorite is their pastrami. Um, yeah, it ain't Katz's in New York but it's pretty darned good for a west coast pastrami sandwich.\n\nNote: the ladies make better designed and packed sandwiches. The men make 'em sloppy! What does this say about the sexes?! \n\nI don't really care, just something I've noticed consistently.", "author": "Meredith R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-12-04", "description": "Was @ 150 CA St. for a meeting yesterday.  Got out needed lunch.  After bumping into Kara's Cupcake cart n getting 3 cupcakes, I walked the block down to LE Regency.  I saw all the meats freshly sliced on the counter ready for the lunch crowd. A superb selection and I liked to view the prepared dishes on the counter as well. Great visual to see what your order may look like.  I really love pastrami but I need low salt, n fresh pastrami not greasy tough meat. Oh MY!! I asked for a sample and thought YUM when I tried it.  Not salty, fresh meat, no grease. How is it possible? Luv @ first bite.  \n\nI ordered the half sand. on the tastiest Dutch crunch bread had it heated with swiss n provolone cheese lettuce, tomato, onion, pickles, mayo n dijon.  I was stuffed off the half. I took a pic on my cell but not sure how to get it on here yet.  I sent it to the hubby his fav. is pastrami. His reply WOW!!! I know he was bummed he missed out on the other half.  \n\nBetter than a Togo's, Subway or a corner deli. I even asked what the brand of Pastrami was they used.  The cashier had to ask the owner as I was persistent. IT is Evergood, so I have to find where 2 get them too. But til then we will be back to try some other yummy sammies.  I'm sure the hubby wants that to die for pastrami. It was soooo good and let me tell you I wasn't hungry for 5 hours after I ate it. I almost was gonna ask to buy a couple of Dutch crunch rolls to take home too.", "author": "Shayda A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-05-08", "description": "I had \"un BLT\" here that was very tasty.\n\nLe sandwich \"turkey cheese and avocado\" is of the highest grado.\n\nYou too will be enjoying some \"Le Regency\" if you try it out on \"votre\" next  \"break du lunch\".  It's \"le deli de luxe\" of \"cet area\".", "author": "Nicholas F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-19", "description": "I'm definitely a fan of this place.  I work in the attached office building, so it's super convenient. The staff can mow through a lunchtime crowd with ease, so there is rarely more than a 2 minute wait.  The sandwiches are solid with fresh meats, toppings and condiments.  The bread (I prefer Sourdough Roll (specify roll) and Dutch Crunch) is fresh and flavorful. I sometimes go here several times a week and have never been disappointed.  It's pretty cheap for a good FiDi sandwich, too.\n\nThey have breakfast as well which I have had on occasion.  Burritos are good and the standard eggs/bacon combo looks good as well, though I haven't had it.", "author": "Nathan G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-29", "description": "Looking at these reviews I'm shocked. I was in the city for an interview and wanted to have lunch before going in. This place was right there, so very convenient, and with a line out the door, it must be good. Even with the long line I was in, ordered my sandwich and payed in under 4 minutes. These reviewers must of caught these people on a bad day, because everyone there was very friendly and smiling. I ordered the pastrami sandwich and was awesome. Very good place.", "author": "Jonathan R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-24", "description": "I agree with other posters about how confusing it is to order here.  I think that they have one of the best BLTs around though, and I'm willing to put up with some confusion for a high-quality BLT. Their bacon is crispy, fresh, and delicious. I think they are much better than Lee's and better than Specialty's. \n\n I've also had their tasty breakfast sandwich (bacon, egg, and cheese on an English muffin).  They fry their eggs right in front of you, and that's a huge improvement over other places that just nuke a scrambled egg.\n\nDefinitely worth checking out if you are looking for a decent deli in the Financial District.", "author": "Greg R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-11-17", "description": "I'm probably biased, as I'm regularly forced to go to this place by a large number of dedicated fans that are in a professional group I belong to. None of them can explain why they insist on meeting here - other than the very convenient location.\n\nThe ordering process is somewhat confusing. There are two registers.\n\nThe service is extremely unpleasant. The people who work here clearly have no patience for customers and I've watched countless people be treated in a really rude manner.\n\nFinally, without going into detail, I have reason to believe that the conditions are unsanitary. I always just order a Diet Coke.\n\nHope they improve some day. Bet they won't.", "author": "Michael B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-16", "description": "I love this place for a several reasons.  They're extremely quick, always friendly, and offer tasty sandwiches with fresh ingredients.\n\nSPEED\nEven when there's a line out the door, it's never taken me more than a few minutes to get through the line, order my sandwich, pay, and make my way out.  There's only one line, but two people making sandwiches.  Sometimes they even have assistants helping out.  I think it helps that both staff and patrons seem to have a routine here, which helps things keep moving smoothly.\n\nFRIENDLINESS\nWhen I first started coming here, I was caught a little off guard that the lady at the counter used terms like Baby, My Love, and Papi to address me.  Let's be honest, I didn't mind. Then I realized that she speaks to ALL of the customers this way.  The rest of the staff is always friendly as well.\n\nFOOD\nThe only reason I didn't rate this place 5 stars is because there are better sandwiches out there.  That's not to say these aren't good sandwiches, because they are.  The ingredients are always fresh.  My regular is a hot spicy chicken breast with provolone on dutch crunch (little mayo, lettuce, tomatoes, and sprouts).  It's consistently tasty.  I do however stay away from the salads since they appear a little boring.", "author": "Lee T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-12-09", "description": "I used to enjoy walking half a block down to this deli to pick up a quick breakfast or lunch.  However, I've finally decided to write a review for this place because I'm sick and tired of having my order taken by the sour-faced, rude ladies who run this place.  There's only one pleasant girl to speak to here (the youngest of them all), and I can no longer tolerate the rest and their unprofessional attitudes.    \nFurthermore, aside from the fact that they're totally lacking in the customer service department, they are also super unaccommodating when it comes to mix and matching your order with different items from the menu.  I have been grossly over-charged here and am no long willing to allow these insufferable individuals to rip me off. \n Boycotted for life", "author": "Amber R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-08-17", "description": "During a hectic, so-stressful-I-haven't-taken-the-time-to-refill-my-water-bottle kind of day, Le Regency is my haven for a fat, juicy, classic sandwich to ease my hunger pangs. I love this place. The staff is fantastic--so obviously a family joint, with extremely hardworking people behind the counter. They call me by name (on occasion) and know my sandwich select better than I do! \n\nGreat selection of chips and drinks. Decently priced, as well. \n\nI highly recommend getting the Cajun turkey on sliced wheat with mayo, mustard, pepperjack, and ALLLL the veggies (avo, sprouts, pickles, pepperocinis included!) The perfect way to break up you day.", "author": "A E."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-05-23", "description": "-100 stars, collected money and touched food with the same gloves, never changed them.\n\nI walked into Le Regency last week for breakfast.  I placed my order with the lady in the middle then paid the dark haired lady at the very front.  I'm standing there waiting for my breakfast to be cooked and the dark haired lady asks me what type of toast I want.  I see her reach into the bag and place the toast into the toaster.  She had gloves on so I thought, she must have changed them.\n\nI got my breakfast and started eating, that's when I saw her take money from other folks then proceed to touch the toast without changing gloves--time after time.\n\nCOME ON.  Really?  I threw out the food and walked away.  Maybe I should have said something or made a scene but I had other things to do.\n\nIf you can't figure out not to handle money and food you've got issues.", "author": "EJ N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-06-29", "description": "Ummm $8 basic sandwiches...  2.5 Stars! \nLe Regency's ordering process was a bit confusing at first, but I got the hang of it.  1) walk in, look at menu on the left wall 2) decide what to get \n3) have people cut in front of you while you are deciding 4) Me: roast beef sandwich , w/ everything on sliced sourdough please  5) annoyed n under paid sandwich lady: here you go.  6) pay at the other counter.\n\nA bit underwhelming for a $8 sandwich that left me hungry.", "author": "Jeff H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-01", "description": "Loved this place. I just got moved to a new office, and I'm so sad that Regency isn't nearby. Quality deli sandwiches, competitive in price, and fresh ingredients. Highly recommend!!", "author": "Meghan D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-06-10", "description": "If you need a caterer for a casual work event, Le Regency is the place to call. Paul, the manager, has been extremely helpful to me dozens of times. His food is always fresh and always on time (usually early!). \n\nAs an office manager, he helps make my job easy :)", "author": "Kristen K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-01-14", "description": "I wish i can give this place 3.5 stars instead of just 3 stars..\n\nGood paninis here!  Prices vary around $5.75.  I thought it was a bit expensive but hey, we are in san francisco!  The sandwiches were definitely flavorful!  I got the spicy chicken sandwich.. good amount of salad, cucumbers and sauce.  Definitely strong taste of spicyness.  Chicken was moist and dutch crunch is a definite choice for any of your sandwiches!  After going to Lightening foods though..I rather go to Lightening foods for around the same price to get the salad, soup, bread with it!\n\nStaff- very friendly!\nplace to eat in the back!", "author": "Kathy D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-02-03", "description": "(See pic) \n\nI had a salad here that was $8.95 with half of a avocado, 2 Cajun prawns, some cold shrimps and a small piece of salmon on a bed of lettuce and a couple cherry tomatoes. \n\nIt was good but I still think it's more expensive than it should... \n\nI am kinda glad that I did not order the sandwich. I know at home I don't wear gloves when I am making a sandwich at home or even in the good old days, but I am used to the cleanliness... And seeing them digging their fingers into the roast beef and then put on the bread in raw hands, I just lost my appetite. \n\nThe location is good as it's right next to the Vietnamese place where I can get my iced coffee fix! :)", "author": "T L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-29", "description": "Best deli in the city for the pricepoint.  Theyre a fixture here in the financial district, and been a customer for years for a reason.  Great food, fast service, and an awesome family run deli.  So sick of chain reataurants.  Will be a customer here for life.", "author": "Shark S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-02-01", "description": "I happened to stop by this place for breakfast on my way into work from BART. It was a chance coincedence as I walked up the wrong exit 2 blocks away. Anyways, when I walked in, I saw they had a list of breakfast items that included Egg plates, Breakfast Burritos and sandwiches. The lady who took my order was not that friendly. I ordered the fried egg sandwich. She was like \"UH, ON WHAT BREAD??!!\" without telling me what she had... so I found that a lil annoying. I could have requested it on foccacia thyme roll just to play but I was hungry and wanted to get out asap. \n\nPrice wasnt as bad, I had a juice, fried egg sandwich and fruit for about $10.... and in FIDI, its pretty normal to pay an arm for breakfast.. \n\nAnyways, my real irritation comes from the sandwich. I have this HUGE croissant and fried egg sandwich smushed in a box that did not fit and the sandwich was not even cut. The fruit tastes like it has been marinating in nastiness for a long time. \n\nFor a deli that states it has gourmet type food, this was far from it.", "author": "Jayashree S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-03", "description": "I usually go here for breakfast, before I step into the office.  The prices are reasonable, food is always prepared to expectation and above all, they deliver wonderful service.  \n\nHaven't had lunch, but it's usually packed.", "author": "Michael J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-05-26", "description": "Stopped by here yesterday to grab a sandwich and they are definitely decent and the place to go if you want a basic sandwich. Negative points for not having cucumber but bonus points for sprouts. They definitely throw in tons of meat and sprouts and the wheat bread is absolutely delicious and soft! \nThis will definitely make it on my rotation from time to time!", "author": "Maria G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-06", "description": "Fresh, made to order, delicious sandwiches. Bread and meats delivered daily. I've never been disappointing. The owner works right on the line. They also do a ton of catering for local businesses for years. I can't speak to anything else but the sandwiches, which have high quality ingredients. I noticed one reviewer mention a  cleanliness issue and that is either absurd or a one-off event. Come at lunch, you will notice the people making sandwiches do not handle money, process is well managed.", "author": "Nareg D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-10-16", "description": "The Everything Bagel only has poppy seeds and sesame seeds, so right off the bat you're dealing with a disappointment. The tomatoes are cold and the cheese didn't melt, but there was an ample amount of innards. Plus, no line and no wait! Fast service and the bagel was only $2.00. \n\nI returned to Le Reg another time, based on my relatively positive first experience, but earlier in the day. It was total chaos! Three servers were arbitrarily taking orders from a crowd of people, rather than an orderly line of customers. The people preparing food were also handling money simultaneously. \n\nEven more bizarre, the \"cook\" grabbed an order of scrambled eggs with melted cheese and a pile of bacon with her bare hands to transport it from the microwave to the serving plate. It was a metaphor. Eating at Le Reg is like a fist full of scrambled eggs.", "author": "Stumbalina b."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-15", "description": "I had the turkey club, and I have to say, they did quite a good job. Ingredients were tasty, and they asked me if I would like the bread toasted, which I did.\n\nThe price was pretty fair. $10 for a sandwich and chips. Maybe a little steep, but I had just been to the Taco Bell Express around the corner, so by comparison, I was getting way more food for the same price. (In case you didn't know, the Taco Bell around the corner is wildly overpriced, as the sheer mass of lunch-goers means there is no incentive for them to have normal Taco Bell prices, since there is always a market!)\n\nI did not eat at the restaurant, but it looked like pretty comfortable digs, if you wanted to eat the sandwich. The staff was pretty friendly. A little stern, but only because it was busy, so they did their best to keep the line moving.\n\nOverall, I recommend this place. I'll probably make it a weekly visit.", "author": "Derek L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-07", "description": "Large sandwiches, reasonable prices and friendly service.  Have enjoyed this place for years.", "author": "Shawn C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-02-01", "description": "I am going to keep this simple. \n\nHey lady with the sh*t attitude without patience for the customer - why don't you try and not handle food right after handling my money. How about you let the staff that is there to cook handle touching the food. How about you break that miserable look on your face to crack a smile to make it appear that you are grateful that people are giving you money to put in to your pocket and help feed your family. Better yet - get out of customer service all together. You should not be touching the food and you should not be dealing with people \n\nI'm sure the food is passable however everything else in unacceptable. Done with this place.", "author": "Michael B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-10-04", "description": "This a great place to go downtown for a quick sandwhich.  I was out the door quickly with a great spicey chicken breast sandwhich.  Berad was fresh and they gave plenty of meat. The service was friendly and efficient.\n\nThanks,\n\nJimmy", "author": "Jimmy M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-06-29", "description": "Hard to give a sandwich place 5 stars, but this is as close as it comes.  I was going to Lee's until I stumbled on Le Regency.  All I can say is the food is fresh, and everything is delicious.  Everyone can to go SubPar (subway) for 5 bucks, or go to Le Regency for a couple bucks more and have consumable food.  \nIf you want someone to put a ton of time and care  into making your sandwich, go somewhere else, they are quick and get people through the line. That's all I want when I go get a $6.50 sandwich.", "author": "Mike G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-06-26", "description": "Had the cajun flavored turkey sandwich on a wheat bread with parmesan, $7.75. A tall sandwich (lots of turkey), but it could be a little less spicy (but that could be as well the cajun talking).", "author": "Bruno N."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-07-07", "description": "That was the saddest, most paltry Turkey sandwich I've had in my adult life! Prison food is made with more zeal and attention to detail! For Christ sake if I'm watching you make my $7 combination of meat, cheese and bread at least act like you care if I come back or not.\n\nAnd please brew your coffee stronger! There is no reason I should regret not going across the street to Peet's for a real cup to complement my breakie burrito!", "author": "Lee S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-08-18", "description": "Hands down great ppl! Their food is fresh and very good. Breakfast and lunch, no disappointments! Also they cater and deliver. Will help you set up if you need it.", "author": "Irma R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-04-18", "description": "This place has AMAZING breakfast burritos! Especially if you've imbibed a bit too much the night before. They are humongous and packed full with potatoes, rice, salsa, eggs, bacon, cheese... SO good! They have great breakfast sandwiches as well. I've been there a few times for lunch. The sandwiches are good portions for the price. Nothing out of this world about them, but definitely good if you're looking for just a basic sandwich!\n\nAlso, the two girls who work there are super friendly. Great service!", "author": "Amy A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-26", "description": "Came here for lunch the other day after searching for a wonderful sandwich place in the Financial District.  It was a nice walk from work; unfortunately, we had a meeting from 1230-130 (I know, right...who in their right mind schedules meetings at lunchtime??), so we didn't arrive until about 2:15pm.  They were close to closing, but definitely welcomed us into their establishment.  The menu was super small and I actually decided on the Spicy Chicken Salad.  The salad was pre-made, but extremely fresh.  The veggies were good and the chicken was good (although I wish it would've been served hot instead of cold).  The salad dressing was sooooooooooooo good. I'm sure it made the salad unhealthy, but whatever. The dressing was called mustard vinaigrette and boy was it soooooooo flavorful and delicious!\n\nPatty P tried to order the chicken wrap, but they were out of that (remember, it was 2:15pm), so she decided on a turkey wrap.  That looked good as well, served on some sort of pita bread.  I wish I would've tasted it, but oh well! Can't wait to come back and try out one of their wraps or sandwiches.", "author": "Jenny W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-29", "description": "I'm about to chop off my hair and sport a 'Katie Holmes' style.  But I'll call it the 'Suri Cruise,' because, like Suri, it's gonna be 50% batsh*t crazy.  \n\nTo prepare for my new look, I want to drop a few pounds.  Because, ideally, I would like the short haircut to make me look like my mom and not like my dad.\n\nIn addition to walking 40 miles a week, jumping rope in my living room (take THAT neighbors!), and dusting off the late-night QVC fitness impulse buys from yesteryear, I need to eat right and with enough consistency to convince my body to stop storing fat, since it doesn't look like I'll need it for winter hibernation.\n\nThe sandwiches at Le Regency are a great low-fat option.  Whole wheat sliced bread, cajun-spiced deli-style turkey, lettuce, and tomato.  They prepare them in front of you, so you can \"just say no\" to cheese and creamy condiments.  Lunch is inexpensive, and the portions are generous enough to provide a filling lunch, and dinner, for the day.\n\nBread + Meat - Surplus Janney Chin = Face that can pull off Short Haircut.\n\nThanks to Le Regency, I will be Le Skinnyface in no time.", "author": "Janney B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-02-15", "description": "Thanks to Luis M. for suggesting and accompanying me to this place!\n\nI had the spankitopothingamabobberboo and it was really huge and good!  It's seriously enough for two people. But of course I had to get my own once again. Ugh. \n\nBe very clear about what you want because there can be some miscommunication.  I asked for the corner piece of the spankitopothingamabobberboo because I love crust. The man just looked at me with a straight face and said No. I thought he was being sarcastic so I laughed and asked him if he was serious.  He said, \"No you cannot have the corner piece.\" \n\"No wait, really? I can't have the corner piece? Are you kidding me?\" \n\"No.\" \nI turned to Luis, but all he did was shrug his shoulders.\nI'm not sure how, but eventually I was given the corner piece that I originally asked for. ????\n\nI will be back to try their sammiches and wraps. Hopefully there won't be any confusion that time around!", "author": "Aim E."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-03-18", "description": "Not a bad sandwich at all! The ingredients were fresh and the service was quick! Got there around 12:15 and there was a line out the door, that being said, pretty sure I was out the door, sandwich in hand, in 8 min. \n\nI am kind of a Sandwich snob, and there was nothing \"amazing\" about the sandwich, but it is definitely a reliable lunch spot when you need something to fill you up with out the food coma.", "author": "Ken V."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-01-08", "description": "My ultimate chicken salad sandwich fix! The chicken pieces are cubed, not shredded which means a lot of fall out but they stuff that sandwich up, boy. Get that on some dutch crunch and you'll be a happy little lamb. However, they ran out of alfalfa sprouts so I was a semi-happy lamb. Okay this was at 2pm so it's excuseable to be out of sprouts at that time. \n\nI haven't tried anything besides the chicken salad but I intend to! They have a wide variety of Sammys. I think it's worth the $5.75. They have the necessary sandwich accoutrements as well, chips, beverages, cookies, etc.\n\nFriendly staff!", "author": "Tatiana D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-10-14", "description": "*doing a happy dance because today is WEDNESDAY and on WEDNESDAYS Le Regency serves the BEST Split Pea Soup ever!*\n\nOther thoughts: Definitely do your best to beat the lunch-crush, the line will be out the door; though, to Le R's credit, they hustle you through the line like no one's business.\n\nSimilar to other reviewers, my stomach can't help but execute a slow roll when I see the workers creating their sandwich masterpieces with NO gloves....\n\nBut, if you can get over that fact, this is one of the best sandwich places in the FiDi. Not that it's healthy, but occasionally I'll have a BLT to complement my Split Pea Soup. Suffice it say that most of those folks making the sandwiches literally pile that bacon on (I am not exaggerating when I say I've opened my sandwich back at my desk to find more than 6 pieces o'bacon!) Minus one star because there's one guy behind the counter who subscribes to the Surgeon General's health guidelines and will seriously skimp on the bacon. Boo on forced health, especially when it's just mid-week.", "author": "wildhippychile d."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-08-09", "description": "When I walk in for breakfast I am welcomed and they truly make you start your day great. You definately walk out with a smile. The sandwiches for lunch are very tasty.\nthey are extrememly fast, friendly. Their catering is very good too!", "author": "Talin A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-04-04", "description": "So occasionally I hop over to Le Regency for a deli sandwich, which is pretty much a fancied-up Lee's, minus the Chinese food, plus some lasagna and some unidentified Eastern European delights. The deli sandwiches are nothing fancy and pretty basic, but totally decent. They come with lettuce and tomato; you have to ask for anything else. I always ask for pickles, and instead of putting them on the sandwich, she just hands me a bag (the same kind of bag a cafe might put a croissant in to go) full of pickle slices. The really delicious, light green, sour crisscut kind. My favorite. A bag of them, that I may spread on my sandwich as I please. Love it.\n\nI am a lover of exposed brick and art nouveau posters, so I think the interior of the cafe is a lovely place to sit a while. Extensive drink selection and sometimes, if I'm lucky, they have flavored coffees in the morning.", "author": "Megan W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-02", "description": "Had lunch here yesterday and ordered the roast beef sandwich. The lady behind the counter was kind of hard to understand because of her accent/speed she spoke at, so I kind of randomly responded back to her. Well pretty much I knew she was asking me for what kind of bread and whether I wanted all the components of the bread (condiments, etc) but at the time I was really confused. I got a TON of meat on my sandwich though, which was cool, especially since the sandwich is so outrageously expensive.  What I liked most about the sandwich though, is that it stayed in one piece the whole time, even though there was so much food inside the 2 slices of bread! 4 stars for nonmessy, good tasting sandwich!", "author": "Melody L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-07-11", "description": "The turkey avocado (jack) cheese on dutch crunch was PACKED with tons of meat; everything in the middle tried to escape with every bite. A pretty basic it-is-what-it-is sandwich, and that's not a bad thing.", "author": "Maximillian M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-06-25", "description": "I can describe this place with three adjectives: cute, friendly and tasty!\n \nThe service is great but sometimes they forget that they're speaking in Spanish when they talk to you...but it keeps me amused. I've had their breakfast burrito and it is a MUST GET (don't forget to get cheese with it -- it's an extra 50 cents but SO worth it). I would opt out on the potatoes with your breakfast burrito since it comes with rice, or the other way around. Having both of them just feels like too much carbs.\n \nI've also tried their wraps (turkey, tuna & chicken) and despite the fact that it tastes really healthy, I'm sure it isn't because it comes with cream cheese. The bread on the wraps is to die for. I wish they would sell just the bread for the wraps, a cup of cream cheese, and their mustard-like dressing for their salad that comes with the wraps. It's mouth-watering. Not too expensive but make sure you have cash if you're making a small purchase (under $5) since their min. charge on credit is $5. Would give 5 stars if they didn't have a min. on credit since I'm not a cash person.", "author": "Heidi C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-06-05", "description": "I think this place is quite over-priced for what it is. The sandwiches are above average, and the ingredients are fresh. Line moves quickly during the busy lunch times. But for what I pay here ($8-9 for a relatively small sandwich), I could get much better/more elsewhere in the FiDi.", "author": "Buster B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-05-12", "description": "Great place for breakfast sandwiches in a hurry.  Nice selection of sandwiches, and during lunch rush they get it done in a hurry.\n\nThe staff makes it all worthwhile.  Very friendly, they will remember you if you're a repeat customer.  I forgot my wallet one day, and they let me pay the next time I strolled in.\n\nI recommend the cajun turkey sandwich with avacado and bacon, on sourdough roll!", "author": "Dan H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-12-15", "description": "I second (Read Luis M.'s review) the cajun turkey.  Quite savory and cheap!  I got a huge sandwich with tons of meat and chips for $7.50.  Pretty comparable with other places around, but I feel the people are more friendly than those at Lee's.\n\nI think I'll definitely keep coming back to this place as another lunch option since I can't seem to get my act together to save a bit and bring lunch from home.  Damn morning forgetfulness!", "author": "Chris M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-12-20", "description": "A little place with a sitting area and good variety of sandwiches, wraps and salads. Vegetarian options available and the food is super fresh. Staff at this Cafe is unbelievable...always smiling and happy! I enjoyed my lunches here and I keep coming back...\n\nMy fav choices: tuna wrap and spanakopita....yummy-yum!", "author": "Katja S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-04-30", "description": "Typical NY-type deli, complete with the requisite crappy attitude from some of the staff. As I am an East Coast transplant, I don't mind and give as good as I get.  Besides, they are fine to me but I've seen that counter girl go off on people in the mornings.  That's not why I am not giving them more stars.  \n\nThe breakfast bagels are good and they give you a TON of lox/meat if you order one of those bagels.  So much so I usually throw half away and end up scraping off an inch thick layer of cream cheese.\n\nThe sandwiches are pretty bland and basic, though.  Again, you get a ton of meat on them, but limited condiments and toppings.  \n\nBottom line: This is not the place you go to if you are trying to eat healthy.  They will slather on the mayo, mustard, cream cheese and give you a ton of meat.  If you are into that, and you like getting a little abuse with your morning coffee or afternoon sandwich, go right ahead.  \n\nAlso, they have that weird AM tax thing going on.  And the hours they post for when they charge that extra tax are BS.  I've been charged more and less, regardless of time.  It really came down to how they felt about me that day, I guess.", "author": "MakeUp M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-10-11", "description": "So frustrating.  Le Regency has been a staple of mine for almost a year because it's the closest thing to a traditional deli in the area.  I regularly got a sandwich and soup, and always enjoyed it.  The last two times I've eaten there, however, have been bad experiences.  Two months ago, I got my standard turkey sandwich to go, an ended up biting into something really hard that broke up into a gravely (yet unidentifiable) substance.  I hadn't been back since (in part because I was traveling for work), but today I decided to give it another shot.  As usual, I got a bowl of soup to go (Wedding Soup), but it was sour/rancid like it was extremely old.  It's really disappointing because I liked the place, but I feel like it's a crap shoot when I go now, so I'm not sure I will return.", "author": "F F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-07-01", "description": "I thought this was a nice deli. The staff are friendly and patient. I looked at menu and thought \"wow'. What I liked is that everything seemed fresh here. I did try the salmon salad,which I did enjoy very much.\n\nThe prices are reasonable.Also you are able to sit and eat near the back after paying.\n\n--------------------------------------\n\nLe Regency has a decent breakfast menu:eggs and breakfast burrito just to name a few.The breakfast burrito tasted ok which was filled with eggs,bacon and cheese.. and I don't need the salsa in it early in the morning.Oh NO!!", "author": "Dani D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-03-31", "description": "I've decided that until I've tried every lunch spot around my office, I'm not repeating places. So, today I was going to go somewhere in the Embarcadero Center but the line was the out the door and I was in a rush. Next stop, Le Regency. When I got there I was a little nervous since their line was out the door too, but I figured if I kept changing places then I'd never get a sandwich. \n\nWell, I was happily surprised to find out that their line moves very quickly! Actually, I'd suggest knowing what you want to order by the time you get in line because I was rushed when it was my turn. I read that someone else recommended turkey and avocado but since I didn't see it on their menu at first glance I picked something else that seemed like it would be good: spicy chicken with bacon & pepper jack cheese. I asked for whole grain bread and the girl asked me what about whole wheat. boo that they didn't have whole grain, but I did appreciate that she told me the kind it was going to be.\n\nI'd say this is a 3+ star place: sandwiches are good, line moves quickly, they have seating, take credit cards ...but I doubt I'd go back and order the same thing again.", "author": "Caitlin B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-02-05", "description": "I've worked across the street for years and yet never thought to stop in here for a sandwich. Thanks to a co-worker who selected this deli for lunch, yes many thanks. \n\nHe scared me at first, \"Let's go to that 'big pile of meat' sandwich place.\" \n\n\"Yeah, that sounds great, but you know I'm a vegetarian. Where is this place?\" \n\n\"You know, it's across the street, where they always give you lots of meat.\" \n\n\"Okay, that sounds kind of gross, but let's see what they have that I can eat.\n\nOf course, they have the avocado and sprout sandwich (on a sourdough roll for me, thanks), which is pretty much de rigueur in this town. A good sandwich, nevertheless, and now I have a new place to go with my carnivorous co-workers.", "author": "Milk and Cheese .."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-06-01", "description": "Busy at lunch time for a reason. Everything you want from a sandwich place - high volume so everything is fresh, good selection of meats, cheeses, and condiments and sides. Sandwiches are on the bigger side and prices are on the low side. Cant beat if you want a sandwich or a quick bite.", "author": "Sam P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-12-12", "description": "High quality food, but the price was a bit steep for what you get.\n\nThe ordering process causes confusion.", "author": "Sean R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-08-05", "description": "If you go to Subway instead, you're an idiot. Great great sandwiches and people at Le Regency.", "author": "Mikey S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-09-16", "description": "Being from New York and all, I miss those hearty, fresh NY deli sandwiches. So, I've made it my personal mission to find a good sandwich shop in the Financial District. I like this one.\n\nThe ingredients are fresh, but the selection of ingredients is a little smaller than I hoped it would be. The staff is super friendly and they are very attentive to your order. There is a good selection of breads to choose. I recommend this place. So far my favorite sandwich shop in the FiDi.", "author": "Bella T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-25", "description": "I just moved to SF and decided to try and write a review for every place I eat at, for a month, for a year, I don't know we'll see. This is the first one. I biked from outer sunset to meet my roommate for lunch. 7.5 miles, 35 mins, not bad, until she suggested we eat at Subway, I said, are you crazy? So thinking about how bad Subway is this review for Le Regency might be a bit biased. This place is a gourmet sandwich shop, or that's what the sign told me. I got the spicy chicken breast with pepper jack on dutch crumble bread for $7.20. It was really good actually. The chicken was spicy, and I eat really spicy food. The bread was really good, which we all know is the litmus test for a good sandwich. A little pricey for the portion, but this is downtown, so I didn't feel too bad. If you work in the area I recommend checking this place out for lunch.", "author": "Michael V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-05-08", "description": "The bagels at Le Regency are hands-down the best in the Financial District. Suck it, Noah's! Your ass has officially been handed to you by the type of Mom & Pop joint you and your evil chain ilk were trying to overtake. \n\nAnyhoo, I am afraid the secret is out on Le Reg; lately they have completely sold out of bagels by 9:30am. \n\nI was surprised that so many reviewers hated on the staff. I have always found them to be extremely friendly and accommodating.", "author": "Emily D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-01-19", "description": "id have to say for a sandwich place downtown this is probably the top of the line! \nIf you like new york style sandwiches this is it! HUGE portions on your sandwich and the people behind the counter are always positive. \none of the owners victor is always happy to meet a new face and Olivia knows regulars orders at the flip of a dime! \ni go there twice a week and am always full and ready to keep working the rest of the day. \nONLY DOWNSIDE! \nprices have gone up and i cant get a drink and chips which sucks but i think that's the only downside. \n\nOther than that i love the place and would recommend it to anyone that's hungry and has 7bucks and like satisfying their stomach at lunch time", "author": "Steven T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-18", "description": "The best sandwich shop in San Francisco bar none. The food is fresh, the atmosphere is excellent, and the service is outstanding. I especially like the turkey sandwiches on the kaiser roll bread. The owner is very friendly and attentive to the needs of his customers.", "author": "Raffi M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-08-17", "description": "Awesome sandwich and breakfast spot. Ingredients are extremely fresh and service is excellent. They usually have a long line but you won't be waiting for more than 5 minutes. Family run.", "author": "Nick C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-11-24", "description": "The marinated chicken sandwhich is my favorite here. Everything else is kind of meh. The prices are too bad, and this is also another regular on my lunch list. \n\nThe owners and staff are super friendly once you do get to know them.", "author": "Josh M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-08-04", "description": "The employees here are hands down the nicest people in the FIDI AND they are fast! You can't come here expecting something out of the ordinary. They do normal sandwiches, but they do them extremely well. I'm particularly addicted to their veggie sandwich, which has avocado, sprouts, tomatoes, lettuce, and pepperocinis ...and it HAS TO BE on wheat bread, because they have the softest wheat bread. It looks like normal wheat bread that you would buy at Safeway, but somehow it tastes so much better. Oh and they'll do half sandwiches too!", "author": "Rose K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-03-30", "description": "Although the staff is friendly, the quality of the food is awful.  I ordered toast and coffee expecting to have no problems.  The toast was not toasted...the butter was merely melted.  In addition, the coffee was quite weak.  It was early in the morning and there were no other customers, so there was really no excuse to ruin an order of toast.", "author": "Cal S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-02-06", "description": "Why this deserves a 5 star rating?  Hands down the best sandwich spot in the financial district! Deli meats are piled high on your favorite choice of bread for all gluttons out there.  It can be at times, my only reason to go to work in the morning.  Yes, that good!  My personal favorite is the Pastrami Reuben sandwich. Big portion to settle your appetite especially after missing your breakfast. I love their sandwiches.", "author": "James M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-06-03", "description": "Only a block away from my work, it edges out most of the other sandwich competition. Gives more meat than Birley's, which is a huge factor in my book. My go-to sandwich, Turkey & Swiss on wheat roll, ends up about $6.75. Admittedly, a bit overpriced, but again, good portions. Solid 4 stars for what it is, a decent sandwich place in the FIDI when lunchtime rolls around.  Also try the Chicken Pesto sandwich.", "author": "Donald R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-05-03", "description": "I think this is my favorite deli in the FiDi.  It's not that their food tastes wonderful but the place just has a good feel about it.  The staff has always been friendly to me and they are always generous with their food.  I've seen some monster tuna sandwiches being made!  I come here mostly for the spanikopita (spinach and feta pie) or the grilled shrimp salad.  They make a good pasta salad as well.  The only thing I've ever had that I didn't enjoy was the grilled chicken salad.  The grilled chicken was delicious but the salad part was not so good.  Every time I look at their house salad it just looks unappetizing.", "author": "Luis M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-10-22", "description": "The staff is warm and greets me like an old friend every morning for my daily latte fix. Good breakfast sandwiches too! I recommend the Dutch Crunch bread for lunchtime.", "author": "Amy J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2005-03-30", "description": "Another worthy little lunch spot from my downtown days that I wanted to give props to.  A little pricier and more classy than Portico, but they have at least one sandwich to die for--mashed eggplant, roasted red peppers, and sun-dried tomatoes with feta cheese and a hint of Italian dressing on foccaccia bread.  Again, a lot of their other offerings look really tasty, too, but are prohibitive to vegetarians like myself.", "author": "Michael T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-11-18", "description": "Le Regency is by far the best deli in the financial district and possibly my favorite deli in SF. The bread is fresh, the meat is juicy, the veggies are crisp. If you ask for avocado they put like an entire (ok, maybe only half) just sliced avocado on your sandwich. They will also melt your cheese onto your meat if you like which I highly recommend doing with pastrami and cheddar cheese. The staff is very nice and accommodating, I believe it is a family owned establishment. I must go for breakfast one of these days as I have heard great things about their burritos and breakfast sandwiches.", "author": "Kristen C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-02-26", "description": "Me and my homie Ken Thug hit this spot up for lunch. They had a variety of meats, cheeses, and condiments to choose from to create your masterpiece sandwich.  I stuck with good ol roastbeef (the prime cut of deli meats in my opinion), throw it on some wheat bread, add some lettuce and slap some swiss on it. IT tasted pretty good. The bread wasnt dry and the roast beef had quite some flavor to it, a hint of some sort of spices and herbs. The service there was hella nice, joking around with the customers and chopping it up. It seems like there are alot of regulars that go there since the workers knew them by name. Me and Ken wished we were BOSS status like that. We just stuck to ourselves and ate our sammiches in our little world.", "author": "Rex P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-04-03", "description": "Okay, so I haven't eaten here for lunch. \n\nBut Le Regency, I le heart you. \n\nYour coffee is tasty (and organic), your bagels are fresh and chewy, you're open early enough that I can be at my desk by 7 sharp, enbageled and caffeinated. My girlfriend swears you have the best breakfast sandwich in our universe -- specifically the bacon, she says, the bacon! \n\nYour service is fast and friendly; you even remembered me when I left my card there and came back late in the day. I can't wait till I'm one of those lucky regulars for whom you start a daily, foamy, caffeinated beverage when you see them on the street.", "author": "Celeste L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-06-10", "description": "Went for lunch with Sharon and split a turkey avocado club sandwich. Pretty good price and taste, but nothing amazing. However the ingredients were really fresh. The line was kind of annoying because of the narrow entranceway, so ppl had to stand outside in the wind to wait to order.", "author": "Matt H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-03-29", "description": "OMG! This place has the best cornbeef sandwiches. Since I have moved here from Maryland, I have not found a place like back home. I've been looking for quite sometime and found this place a few yrs ago. I highly recommend this friends. Nice lean cut cornbeef on rye. Yummie! I love love this sandwich. A must try! East Cost taste on the West coast.", "author": "Ginger R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-10-26", "description": "A good lunch was ages ago, and a good breakfast was this past week. Egg whites were no problem, and I loved how they used pan spray instead of oil. The best compliment I can give - it tasted exactly as if I had made it at home.", "author": "Jason B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-10-25", "description": "Terrible service, always trys to rush people through.  And the last time I was there, one of the female server gave me so much trouble for something I didn't do.  I always order an egg salad on wheat toasted, and while the bread is toasting, and bacon.  But the server said my order was alot of trouble.  How is an egg salad sandwich on toasted wheat and folded bacon trouble, she only spend 1 minute on my order.  I don't recommend this place to anyone.  They suck!!!", "author": "Teri J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-01-24", "description": "Best deli period.  Been coming here since I was 7 (when my dad used to work across the street), now 27, so for 20 years.  Never dissappointed.  If I want a sandwich, I'm coming here if I'm in the city.  Only draw back are the hours, close at 3, damn it.", "author": "Alex L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-05-06", "description": "wow, I'm sincerely shocked this place has such good reviews.\n\nto me..le regency, you totally le suck!!\n\n1 star for super duper convenience. Another star for filling me up when I am starving.\n\nBeen here 10+ times with coworkers, only for breakfast though.  Their food is sub-par, ham tastes funny in the morning, and I finish my meal in my cube with a stomachache.  (Yes, I know we're idiots for always going back..I just really don't want to eat at the Body Shop next door).  \n\nToday I had an omelette. First they fried one egg and put it really flat in my container.  Then they chopped up the bacon and mixed it together with some cheese in the frying pan.  She then put the bacon cheese mixture on top of the egg and then folded the egg over like a taco.  Then she smooshed the egg ends together.  Great.  \n\nI avoid this place..but the convenience is what keeps me going back I suppose.  One of the only places in the area to get \"real\" hot breakfast food.", "author": "Vivian L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-04-10", "description": "Love the breakfast burrito with bacon and cheese, but I think the refried beans are overkill--of course, this may be just my preference.  You better be hungry when you come for this breakfast burrito cuz they are HUGE!!", "author": "Paul P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-05-30", "description": "I give this place a whopping 4 stars because I appreciate the reasonable prices for decent food that is so hard to come by in the financial district.  And because they serve one of my favorite lunchtime indulgences-- spinach pie, aka spanakopita. If you work in the area and haven't tried it yet, you really need to.", "author": "L. Renee D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-05-08", "description": "Pretty standard deli - nothing special as far as offering, though the salmon/shrimp/avocado salad looked really rood.  Had a pulled pork BBQ sandwich - roll was decent and soft, pork was tasty.  7 bucks.", "author": "Jimmy B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-10-14", "description": "My new favorite work lunch spot.  It's a family place.  The meats are soooo good b/c they are fresh.  I love their roast beef, thin, perfectly-done, fresh.  Fast service.  Breads are fresh too.  The fruit salad is fresh, a great medley, and a lot for the price.  (Of course in America, healthy fruit bowls are gourmet & expensive, so it's silly of me to be wowed by their fruit bowl, but I am.)  Their service is fun, hearty, and kind.  I like how they post photos proudly of their family.", "author": "S M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-11-16", "description": "I eat here at least 3 days a week for b'fast & lunch....'nuff said!!", "author": "Anon Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-10-29", "description": "Best sandwich shop in the financial district. Might I recommend the turkey, avo and cheese, its $7.45, you can't fit your mouth around it and its all fresh delicious ingredients.", "author": "Jordan L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-01-31", "description": "Love this place!  Great tuna salad and breakfast sandwiches.  Everyone that works here is ALWAYS super friendly whenever I'm in there.", "author": "Andi B."}
