{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-06", "description": "Had the chicken/mozzarella sandwich and corn chowder which were both great.  Have always liked the location downtown, so I was excited to see West Portal has one as well.\n\nMost importantly, I know this restaurant gives young people and entry level workers the leg-up they desperately need, because I saw the sign in the window that they use E-Verify.  I would come back just for that.  The excellent food is just a bonus!", "author": "Jed G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-10-26", "description": "Wow. This place has good food - but dang! The portion sizes are meager. For what you pay, $3.25 for cold cauliflower side that's crazy small and don't even start with their poke bowls - seriously it's robbery. \nFood? - ok\nValue? - run away!", "author": "Andy G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-07-22", "description": "First the positive:\nThey make the most delicious chocolate chip cookie ever.  Utterly insane!   Far better than the fancy bakeries I've tried.  \n\nAs for the salads, they are just ok.  I find them to be on the limo and wet side.  Nothing crispy and real fresh tasting.  \n\nThey do use powerful flavors and lots of spice.  \n\nIt's an ok spot.  Nothing I'd intentionally want to hit but i wouldn't complain if someone wanted to meet me there.  As mentioned, the prices are steep.  \n\nAnd the cookie is dangerously good.  Omg", "author": "Pauline C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-06-26", "description": "If you want to pay $13 for a bowl of mashed potatoes and a sprinkle of bbq and veggies... go to lemonade. \n\nI enjoyed the food in the past but hadnt been in a while. I was reminded today why we dont go there anymore. Its overpriced and the portions are a bit skewed. The food is good but the portions are a bit frustrating.\n\nTake the poke bowl with rice. Youre pretty much paying for a bowl of rice with fish garnish. As a place that seeeeems to be health cautious, youre just giving people fillers. Id at least expect almost equal parts fish and rice. Instead, its a small layer of fish on top of a mountain of rice. \n\nI guess a new menu is available and today i got a Backyard BBQ Brisket bowl. You could ask \"what bbq?\" As they proceed to fill the bowl with like 2-2.5 servings of mashed potatoes and very little veggies (you cant even choose which!) And bbq brisket. I asked for MORE veggies afterwards as what they gave is a ridiculous amount of mashed potatoes. AGAIN, fillers. Who the hell eats THAT much mashed potatoes in one go? Also, what they serve is NOTHING like the photo (are they ever really?) Where you couldnt even tell there was potatoes underneath. Its like looking into a thick bowl of soup with, again, garnish. If im paying $13, it shouldnt be for something thats considered a side. I ordered a plate with the word BBQ brisket in it, i want my damn brisket.", "author": "Clarizeyale R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-10-09", "description": "I just stopped in here because the bakery we just went to didn't have any open tables and we wanted to have a seat. This place had some tables open in the patio so we had a seat but I felt bad not getting something. So I ordered a Blood Orange Lemonade.  It was good but not really anything spectacular. I would stop in again if I was in the area and maybe I'll be blown away next time.", "author": "Marcus K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-11", "description": "Stop by for some lemonade which was ok. I got the blueberry mint. I did grab a quick light appetizers before dinner. The tuna salad and tomato avocado was actually pretty good. My first time there too. The workers are nice and I think they make sure to keep their food fresh. I was about to order Mac n cheese but the manager said it's no good since it's been out for a certain amount of time which they will toss and make fresh dishes. That is definitely a plus. The price isn't cheap but decent. I will definitely come back for healthy light food.", "author": "Christy V."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-06", "description": "I have been to the 9th ave location as well as west portal. I found the west portal location to be even more confusing to order at than the 9th Avenue location. \n\nOnce I got my food, it was just okay. It tasted fresh, but not much flavor. It was also ~ $17 for lunch. Not sure it was worth the price.", "author": "Angelito R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-09-20", "description": "I wasn't impressed with my dinner last night. Since this is cafeteria style food - the food looked like It has been sitting out most of the time and also tasted like it. It is also pretty pricey for the small portion you get for $7.00+ for poke. They do let you sample the non meat Items. I was craving ahi tuna but it didn't look appetizing in the food case. I ordered a salmon poke bowl and for some reason it tasted like It was sitting out to long. Didn't look or taste fresh for $12.50.", "author": "Donna L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-02", "description": "I came into Lemonade with high expectations, and they truly did not disappoint! I've heard from lots of friends that this is THE place to go when you want really quality food with not a long wait, so I decided to check it out. I was kind of confused with the process at first, but Cynthia was really polite and explained everything really well. If everyone else is as friendly as her, I know I'm in good hands. I'll definitely be coming back soon!", "author": "David B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-03", "description": "Lemonade is the best restaurant and I enjoyed my first experience here. I want to highly praise the staff for being courteous.\n\nI want to point out on an agreement with fellow yelper Susy, the food here certainly might not be the healthiest of all choices. But this is good comfort food, it does the job satisfying my cravings for something small and quick. I suddenly had a craving for Mac N Cheese with Mashed Potatoes and a cup of Lemonade. This is when I decided to come in and get something to eat.\n\nWhen I entered, I saw the choices available and there were plenty to choose from. I went down the line, chose the items I wanted then got a beverage to accommodate and pay for my meal.\n\nIt's true, this restaurant is set up similar to a grade school cafeteria. Certainly the one thing that came to my mind when I entered.\n\nSome of the items I ordered were:\n- Mac N Cheese\n- Mashed Potatoes\n- a cup of Lemonade\nThis is one delicious meal, I enjoyed it and very satisfying. Lemonade is an excellent alternative in terms of beverage choice. It is also very refreshing. Overall, positive first experience here.\n\nReasons for 5-star rating include:\n- courteous staff\n- clean facility\n- good food\n- good service\n- indoor/outdoor seating available\n\nAnother great spot along the West Portal corridor to get something to eat.", "author": "Bennett W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-06", "description": "Stopped in on a whim for a midweek lunch.  As first-timers, it was a little unclear how the ordering process works, but we opted for a couple pre-designed Poke bowls.  Both of them (the Reel Classic and the Spicy Fin) were very good, with fresh-tasting ingredients and generous but not excessive portions.  The flavors all complemented each other nicely.  I also tried one of their \"Skinny T\" drinks - the blood orange with blue butterfly flower tea.  This was also quite good - I liked the fact that it wasn't syrupy-sweet, which can make a drink the exact opposite of refreshing.  At the same time, it did not have any artificial sweetener aftertaste (though I have no idea whether it actually contains any additives).\n\nService was efficient and reasonably friendly, and overall this was a pleasant meal.", "author": "Lee L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-09-10", "description": "A glorified and upscale cafetaria for adults with a little more money to splurge.\n\nI dig the seasonal and healthy concept of the franchise but it can be a bit pricey for what it is.  I like to try a little bit of everything so it's hard to narrow down my choices to just a few.  My personal favorites have been the snap peas & edamame, curried cauliflower, roasted brussel sprouts and salmon avocado salad.\n\nI've tried both the white truffle and traditional mac n cheese but the consistency wasn't as creamy and appetizing as they looked.  I would pass in case you were considering giving it a shot.\n\nOne tip I'd give is limit yourself to one entree and one or two appetizers before you find yourself digging deeper into your wallet.", "author": "Derek L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-11", "description": "Very hesitant to jump on the SoCal originated lemonade bandwagon. But caved, went in expecting a glorified Whole Foods salad bar and was pleasantly surprised. Yes it's basic healthy food but well prepared, seasoned and delicious! My faves were the spicy poke, the beet and butternut squash salad, the cauliflower harrisca, and best of all the miso braised short ribs. These were amazing!  The lemonade is kinda...meh, but how can you not try something the store is named after. Tried the frozen strawberry ade, and blood range ade. \nWould I come here again..? Yes, really enjoyed the food and lives up to the hype.", "author": "Linda H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-06-17", "description": "This place is okay, I guess if I didn't have to pay $22 for a normal amount of food each time I went then I'd feel better about going more often. I really love their mac & cheese, spicy chicken & arugula melt sandwich, basil watermelon drink, curry cauliflower, and tuna poke. However, when there's so many other great places in West Portal that cost half the price for twice as much food, you have to kind of reevaluate what Lemonade is asking for such smaller portions.", "author": "Virginia J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-07-14", "description": "Love the salads, but the interior is DIRTY. Messy floors, tables not wiped well and bench upholstery is filthy. Lot of missed potential.", "author": "Kent F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-08", "description": "Cafeteria style eatery. Everything was okay but there wasn't such a variety as I remember. I've only eaten here once so I may not be the best reference. \nMaybe I'll try it again and update my review then.", "author": "Mashimaro M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-17", "description": "Nice place to pickup something quick to go, or take advantage of dining in with their colorful decor, tables and chairs.  I was here to catch up with my Yelp buddy Crisy.  We hadn't seen each other for a few months and wanted to share insights on cool places to dine in the area.  Lemonade came highly recommended by Crisy as they have a ton of selections for healthy eats.  Love that they also offer a good selection for vegetarian. What I didn't know is they have tons of locations all over California.\n\nCrisy recommended their Curried Cauliflower with Golden Raisins and Almonds which was fantastic. We both ordered their Pineapple Chicken & Green Beans with Toasted Coconut, Jalapenos, and Jerk Dressing since it was just too good to pass.  Turned out, it was our favorite. If you get a chance, order Lemonade's Seared Pepper Crusted Ahi Tuna with Crushed Orange-Ginger Ponzu.  It was very fresh and ask for a side of sauce.  Lastly, Crisy and I had their freshly pressed Watermelon Rosemary.  It was refreshing and refills cost an additional $1.95.\n\nBest of all, I was able to pay with my SamsungPay (mobile payment and digital wallet service) and quadruple my rewards points.  Woo-hoo!!  Thanks Crisy!  :p\n\nPS - there is a large area for outdoor sitting for a nice day in San Francisco located right up front.\n\nCheers!", "author": "Edwin R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-09-29", "description": "Use to come here frequently when they first opened but the service is unacceptably poor. Walk in on a Friday night and stood at the Hot food area for five minutes and no one came to help. There were three workers but they has their backs to the two of us in line. No, \"we will be with you in a moment\". I walk out after eight minutes.\n\nAnother thing, they seem to be skimping on the portions. They would give on scoop of salad where the other Lemonades give two or even three. \n\nSuggest the manager at this place train their staff to look after the customer and interact. I would be hesitant to go back to this particular Lemonade on West Portal.", "author": "John M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-20", "description": "Fast casual. Not sure what the effing complaints are all about. This isn't the healthiest place ever so if that's what you're looking for, go elsewhere! Geez.  Lemonade has fresh \"Californian\" food. Salads, noodles, some comfort food (mac n cheese and mashed potatoes anyone?!) and LEMONADE!!!!!!!\n\nI've dropped into Lemonade a handful of times. This is easy to do when MUNI isn't agreeing with your life. I've had many a long walk from West Portal. Those were some trying times. Don't think I could've survived without a lemonade from Lemonade in my hand. \n\nStaff has always been friendly especially when it comes to samples (important when you are indecisive! ok). Lemonade is set up cafeteria style, so again I'm not sure how people complain the staff is slow. The food is already made people. You go in, grab a tray, slide it around the counter and order what you want, plop it on your tray, go to the register and pay. It's that simple.\n\nPlenty of seating, both in and outside.", "author": "Susy C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-19", "description": "First time here. I loved the lemonade. It was really refreshing. We didn't get to eat the food because we already planned to go somewhere else. But I'll def be back to try the food. It looked delicious! Was really debating if I wanted to eat here.", "author": "Cheyanne M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-20", "description": "Food: 5/5\nService: 5/5\nAmbiance: 4/5\nOverall: I'll be back\n\nThe extended details...\n\nFood:\n\nQuinoa & Apples - Definitely a good dish in my opinion.  Very good flavor as the apples give it that nice sweet taste.\n\nTriptip with potatoes - Not a bad dish at all especially for a side dish.\n\nAhi with ponzu - Yummy dish.  Solid dish.\n\nService: Very friendly staff.\n\nAmbiance: Very casual setting but it's cafeteria style where you grab and sit.", "author": "Spencer Q."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-03-07", "description": "2.5 STARS\n\nHmmm, a burger at Calibur or \"healthy\" comfort food at Lemonade?\n\nSeeing that Tater Tot was having a nutrition consult with a nearby veterinarian, I figured we keep with the \"healthy\" theme and go with Lemonade. Otherwise, you know my fat ass would have went ham on those beef tallow fries at Calibur. \n\nI've been wanting to try this much hyped SoCal based chain since Lemonade opened their first NorCal location (Yerba Buena). I love their concept of serving seasonal, Californian style cuisine with global influences that's fast, healthy, and affordable - at least that's what their website states. \n\nThe cafeteria-style set-up offers Marketplace [veggie] sides, Salads, Sandwiches, Land & Sea (chicken & fish), Hot Braised Dishes, and delicious sounding Comfort Food like truffle mac & cheese. Lots of vegetarian, vegan, and gluten-free options available. They also offer 6 seasonal flavors of Lemonade.\n\nEverything about Lemonade sounds five stars worthy but I found it to be overhyped and overrated. \n\nLemonade is the SLOWEST fast-casual eatery I've ever been to. From the first counter to the register, it took over 20 minutes! Keep in mind, everything is prepared and sitting in trays already except for the sandwiches that need to be assembled. We had 30 minutes before Tater Tot's appointment which I thought would be enough time and it wasn't. If you're in a rush, don't come here. \n\nMy friend and I shared 3 marketplace sides, 1 hot dish, 1 poke, and 1 lemonade and the total was $31: http://bit.ly/2lACwVG! There's \"expensive and worth it\" like good sushi but Lemonade is in the \"expensive but not worth it\" category. \n\n*Snap Peas & Edamame: Ok but needed acid to brighten things up.\n*Avocado & Cherry Tomatoes: Incredibly salty and sour (unripe tomatoes).\n*BLT Panzanella: Super salty.\n*Red Miso Beef Short Ribs: Inedible SALT BOMB!\n*Ahi & Avocado Poke: Best item we had. Nice chunks of fresh tuna and chunks of buttery avocado; not overdressed with soy. \n*Blood Orange Lemonade: Very sweet but good flavor. Tasted much better after all the ice melted. \n\nVery disappointing and expensive for a cafeteria-style meal. We left hungry because we couldn't eat the majority of things on the plate because it was so salty. \n\nLemonade may have good intentions of offering \"healthy\" food to consumers but it defeats the purpose when you're dumping a sh*t ton of salt in the food and loads of sugar in the lemonade. I did a keyword search for \"salty\" and \"sweet\" for their other locations (including the ones in SoCal) and there were lots of complaints of food being overly salty (even salads) and overly sweet lemonade. \n\n1 star for the poke, 1 star for the lemonade (after the ice melted), and .5 stars for the dog-friendly outdoor seating but rounding down because of the slow, and not so friendly service.", "author": "Cherylynn N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-03-05", "description": "Following my two positive experiences with the Lemonade down by the Metreon, I was pretty excited to see that their West Portal location had finally opened.  In part because the food isn't too shabby, but mostly because the location is so much more convenient!  Besides the fact that it's closer to where I live (relatively, at least), but parking here is so much easier.  Plus, it's not nearly as busy - no crowds during the lunch rush here!\n\nIf you've ever been to a Lemonade before, this one isn't any different.  Not only is the food the same (salads, sandwiches, hot dishes, sides, desserts/cookies, and lemonades, of course), but the set-up is identical as well (the layout is cafeteria-style, but you can hop the line to any section you want).  Oddly though, despite having the opportunity to try something new (like their salads or a hot dish), I ended up with almost the exact same order as my very first trip to Lemonade.  Whoops.\n\n-- AVOCADO SALMON LOUIE with Grapefruit Segments and Pickled Cucumber...$6.95\n(https://www.yelp.com/biz_photos/lemonade-san-francisco-4?select=_oTXE3igjQgckdna17ZxSA)\nArguably pricey for what it is, but it's pretty darn tasty as well.  Not only is there a decent amount of salmon, but it tasted fresh and flavorful.  What's more, the avocado was at the perfect ripeness - creamy and soft (though not mushy).  Love the acidity the grapefruit and pickled cucumbers added as well.\n\n-- GANDOLFINI - Turkey, Chicken, Ham, Swiss, Pepperoncini, and Olives...$7.95\n(https://www.yelp.com/biz_photos/lemonade-san-francisco-4?select=Ib9tjalGGjwHDGqodanb2Q)\nWhile this may have been the same sandwich that I had before, it wasn't nearly as good this time. Rather than being served hot, toasted, and gooey, this one was tepid and untoasted.  It may not seem like much, but not having the melted cheese and toasted bread made all the difference.  For what it was though, this was...okay.\n\n-- BLOOD ORANGE LEMONADE...$3.50\n(https://www.yelp.com/biz_photos/lemonade-san-francisco-4?select=hh6NXmAHFBsB42dHaBhynQ)\nAlthough it was a little bit sweeter than I remember it being, this was no less delicious than  the first time I had this.  The bit of tartness from the lemonade was a nice complement to the blood orange, making this ever so refreshing, even on a relatively chilly night (though that's practically every night on this side of SF).\n\nEven with the misstep in my sandwich's preparation, service here was definitely better than at the Metreon/Yerba Buena location.  Not that the workers over there were bad, just that the ones here were extra helpful and friendly.  Perhaps a benefit of not having to deal with hectic lunch crowds during the week?  Even with all of the small businesses and families out this way, I can't imagine it getting nearly as crazy.\n\nIn any case, it really is a shame that the food fell short of my last couple of experiences.  I still like Lemonade and I'd definitely come back again; there are plenty of other things I'd want to try and it's far easier to come here than the Metreon or soon-to-open 9th Ave locations.  It's just that it's more likely to happen when I'm already nearby in the area than as a destination.\n\nTHREE AND A HALF STARS rounded down.", "author": "Mike L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-17", "description": "Reasons why I love this lemonade\n1. Healthy \n2. Indoor and outdoor seating \n3. Great service\n\nSuggestions for improvement :\n1. Why are the plates so large? In my table of 6 people we all ended up making the same mistake and buying way more than we could eat to fill up the plate. So even though the food is healthy you still end up over eating.", "author": "Julianna I."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-04-21", "description": "Ordered tonight through Uber eats, food was okay, I was expecting it to be better given all the hype about this place. but for $5.60 I expected more cauliflower than the small cup I was given. \n\n\nUpdate - ordered again. Figured I would give them another chance. Ordered 4 sides separately and paid for them individually but received them all in one box? The sides were for multiple people so this was awkward. I know they have a deal where you can get 4 sides as a combo for a little cheaper and it comes with a piece of bread (which wasn't in mine) but that's not what I paid for. Squash seems to be hit and miss on how good it tastes. The curry cauliflower is very good. \"Seasonal rice\" is just a small cup of white rice. I thought it was going to have some kind of flavor.", "author": "Donna S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-14", "description": "I've been anticipating the arrival of Lemonade at the West Portal location for a long time and glad it's finally here! Lemonade offers quick, tasty, and healthy food options plus a variety of refreshing lemonade flavors. The restaurant is clean, bright, and the yellow decor gives this place a happy and positive vibe. It's cafeteria-style...grab a tray and order along the way! Almost all the food is ready-cooked and just needs to be scooped or put on a plate/bowl. \n\nI tried the soy roasted chicken thigh with Thai chile mango glaze ($10.50). The chicken was flavorful and the the mango was a nice touch, but the chicken was slightly over cooked and not tender and juicy. Also, it's not a lot of chicken for the price. \n\nThe ahi tuna and avocado poke ($6.95) comes in a relatively decent sized cup and was pretty good! First, I loved that there were LARGE chunks of tuna, and avocado (and tangerines). Second, the flavor was great mixed in with sauce and sesame.\n\nWhat was also pretty good was the white truffle mac n cheese ($4.50). The mac n cheese was nice, white, and creamy with good texture. Plus, the truffle was clearly present and added excellent flavor to the mac n cheese. Yum! \n\nThe workers were just as positive as the bright colors of the restaurant. They encouraged sampling and asked for food allergies prior to offering. I tried the brussel sprouts, which were nice and crunchy. I also love their wide variety of lemonade flavors including watermelon rosemary, pomegranate tarragon, cucumber mint, blood orange, and original. \n\nLike many food crazes, Lemonade came from LA and is now spreading into NorCal. The food is not the most outstanding quality individually, but the variety is large and the food is fresh, flavorful, and healthy. Some selections are seasonal. Because it's cafeteria-style, I love that you can order as much or as little as your stomach desires. I also love that they are open all day. Lemonade is new, exciting, and a wonderful addition to the West Portal neighborhood.", "author": "Jean S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-09-22", "description": "Atrocious service. Mediocre food. Sorry portions. Outrageous prices. Go to Submarine Center across the street and feel far better about your meal.", "author": "John P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-02", "description": "I generally really enjoy Lemonade, and I am delighted that they had made its way to NorCal! This location is just as great as their LA locations. Everything is well made, and the lemonades taste as they should. My favorites tend to be the strawberry rhubarb lemonade or their watermelon rosemary lemonade. I always get their new Mexican Chile roasted butternut squash and their red quinoa and fuji apple salad whenever it is available. Also, I highly recommend their white truffle mac and cheese. Excellent! Service and pricing is great too.\n\nI always feel pretty good after a meal here, but it makes me feel extra Californian, if you're catching my drift, LOL.", "author": "Tiffany W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-13", "description": "Fan of their concept, though not a fan (today) of my food selections.  This location is a bit on the smaller side compared to the ones in Newport Beach and Palo Alto.  It's a bit bigger than the one in SF (Metreon).\n\nMy Marketplace Salad selections (Tuscan Kale & Kumquats, New Mexican Chile Roasted Butternut Squash) were bland and not very interesting.  Take up the server's offer to try them before you place your order.  However, my Red Miso Beef Short Rib entree was delicious!  For dessert, pass on the macaron and go with a cookie!", "author": "Gene D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-09-29", "description": "Aw man, I wanted to love you.\n\nBut I didn't.\n\nMediocre salads, terrible mac 'n cheese, dry coconut cake. \n\nI didn't like it, my 2-year-old didn't either. Meh.", "author": "Gabriela W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-06-23", "description": "I decided to wait a bit before trying Lemonade.  I wanted to give them some time to settle in perhaps wait for the curious crowds to abate.  After hearing mixed reviews from someone that lives nearby and someone that works nearby, I decided it was time to see for myself.\n\nI liked that the food was on the healthy side and there were so many options.  I ordered the combo with options for one protein and two sides and selected the salmon with brussels sprouts salad and the snap peas with edamame.  The two salads were really good, really fresh and super tasty.  The salmon had a light mustard sauce.  While the first bite seemed dry, the rest of the fillet was moist and well cooked.  I ordered a peach ginger lemonade which was not too sweet, a nice balance of sweet and tart, and very refreshing.  \n\nThe tab came to around $19 for my order.  This is why I gave them 3 stars.  For the price paid, only the lemonade seemed to be worth it.  The fish was the size of my palm (4 oz?), and  the salads were each 1/2 cup portions.  I can understand the protein being the size it was but the vegetables at $3.25 per order seems really steep.  The woman paying ahead of me also expressed shock at the price of her meal.\n\nThe food was good, the service was fine, the staff was nice and the restaurant was clean and bright.  It was not crowded when I dropped in.", "author": "Melissa L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-01-05", "description": "Alright here we go!!! This place is a casual, yet wanna be boujee fast-food with a summer time vibe.\n\nCons:\n\n1) Over-priced for food.\n\n2) The taste is not very unique and more basic than anything else.\n\nPros:\n\n1)  fast-service", "author": "Nikki P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-11", "description": "I've been waiting for lemonade to open up in West Portal ever since I heard the news!! So happy this eatery is so close by now, especially because I feel like they have so many healthy food options. :-)\n\nMy bf and I finally made our way here on a Sunday afternoon. The line wasn't too bad for a new establishment! We were handed menus and the menu was explained to us by an employee. He also let us know we could sample anything! Lemonade is cafeteria style, basically you go down the line, pick out what food you want, and pay at the end! If you eat with your eyes (like me) it's pretty hard to decide what to get.. you may even accidentally get too much! I definitely did.. lol!\n\nI got 3 marketplace sides: chipotle butternut squash and corn, edamame and snap peas, and watermelon radish with ahi tuna. I also got the white truffle mac and cheese because I love anything with truffle! I've also had this in socal and it tastes just like I remembered. My bf got the pickled beets and cantaloupe with the pineapple chicken and string beans. They were all yummy! We did wish some were hot instead of cold (squash and corn, and pineapple chicken with string beans) but we liked all the healthy options. My favorite side is probably the pineapple chicken with the string beans.  \n\nOverall a great place to eat since there are so many options! It can get a little pricey but they give you hefty portions!", "author": "Tara A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-09", "description": "Second time trying Lemonade; 1st time at this grand opening location and I still loved it like the first time.\n\nThis Lemonade is located at West Portal which is one of my favorite areas in SF because of its neighborhood scene. There's a ice cream shop, toy shop, pizza but there wasn't a good place for salads/light eatery so I was so happy to see Lemonade open here! \n\nAmbience is nice & spacious. The style is like being in a cafeteria. You grab a tray and walk into the station of your desire, tell the person what you want and you pay at the end of each item you get! Outside seating has heating lamps so you won't freeze sitting there. \n\nMy favorite to get here is the watermelon Radish with ahi tuna and white Truffle Mac n' Cheese! The watermelon Radish is something light and refreshing and the white Truffle mac n' cheese is one of the best I've ever had. Creamy with a good amount of Truffle flavor and the noodles were cooked perfectly. There was a great selection of different Lemonade flavors. I got the watermelon lemonade and it was so refreshing & light. Goes great with the food. Will totally go back to try more flavors. \n\nAs far as service goes, for their first time opening it went really well. Some things were a little disorganized because some customers didn't know they could go to any station and not have to wait in line. Prices are a bit too high for me to come here often! \n\nOverall, great place to grab a quick lunch or have a light dinner!", "author": "Tiffany H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-11", "description": "Two bites into his meal my husband said he \"cannot wait to come back\" -- yeah, it's that good. \n\nCertified cleanly and bona fide friendly.\n\nOfficial in every way. \n\nDelicious realm of DIFFERENT delights and unexpected options. Pre-made salads, proteins, poke, sandwiches, salads, hot entrees and marvelous desserts. They switch up their dishes everyday keepin it fresh!\n\nOoooo la la lemonade!! I SEE YOU! ;)\n\nCame two days post grand opening for my birthday movie night with friends. From hard core vegans to \"anything is plenty maine\" - all my friends loved it. \n\nYeah, it's pricey. But it's quality. Especially in this high end market and shift in cleaner eating avenues. \n\nWhat I ate:\nTri tip and potato salad\nPad Thai noodle salad\nMandarin orange and avocado poke\nChicken sandwich \nBreakfast sandwich with béchamel (holy rolaids!)\nShort ribs\nBlood orange cheesecake pick me up (my favorite!)\nWatermelon mint lemonade (hubs)\nSugar free Coconut apple keifer lime lemonade (to die for!)\n\nMy husband and I sampled plenty. We both favored certain dishes over others but absolutely nothing was bad. \n\nIt should be known, all food was very well seasoned. They've mastered their sauces and dressings which really shined through all courses. AND my made to order sandwich was served piping hot! YES!\n\nPro Tips:\n\n- Pace yourself \n- Check out all stations before ordering \n- Samples are plentiful \n- None of the food I tasted was sub par in anyway whatsoever. You really can't lose here so if you're indecisive don't be scared and take a risk!\n\nKudos to well trained, sincere, polite staff. All kindly asked for food allergies before handing out samples. \n\nNon fussy, modern, straight forward food. \n\nI have no cons. Just go. Now.", "author": "Rosalyn W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-06", "description": "If you're looking for a quick decent meal Lemonade is the place to go. They have a variety of food made up including: salads, fish, sandwiches, and beef brisket.  They also have vegan and vegetarian dishes as well.  Being the meat eater I am, I've only tried the short rib and brisket here and both were decent.  It's definitely quality comfort food.  Oh, and most of the flavored lemonades are good. I just didn't care for the sugar free flavors.  They have outdoor seating and their location makes it a great people watching spot.  The only reason that I didn't give it a higher rating is the price.  They are a bit on the expensive side for the food they serve.", "author": "Mike S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-06", "description": "The food and customer service is wonderful the atmosphere is great !!! Very relaxing and comforting most of all the salmon salad is delicious!!! My fav place in west portal.", "author": "Demario P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-09", "description": "Came here on the grand opening and it was also my 2nd time going to lemonade, and let me tell you it was something Iv been looking forward to for months now!\n\nWhen I walked in I had a bit of a hard time figuring out if I go straight to the section of food I wanted or if I started from the beginning and went around cafeteria style.\n\nI got the truffle mac n cheese which they are famous for, it was the mac n cheese I have ever had. The price of 4.95 for a small cup of it is a bit pricy but it was still delicious.\n\nAlong with my mac n cheese I got a side salad of thanksgiving greens with pomegranate vinaigrette dressing. The salad itself was really good along with the pomegranate dressing, the ingredients tasted sweet and fresh! And at $4.50 it was a good portion side too!\n\nTheir lemonade is also amazingly good! I got the pomegranate tarragon and it was tangy, sweet and most importantly refreshing. My girlfriend got the watermelon lemonade and that was less tangy but also very refreshing and sweet.\n\nBe sure to come by west portal and try out lemonade! You will have to get their truffle mac n cheese and some of that famous lemonade!!", "author": "Jonathan B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-01", "description": "A modern \"cafeteria\" was how our friendly, knowledgeable server described the Lemonade concept. Walking in, you're faced with a line of salads, cold dishes, and hot dishes, and you can either choose all your items a la carte or get a combo plate for a slight discount. Coming in for lunch, I ordered the \"Big Chill\" plate, which consisted of two \"marketplace\" salads and one \"land and sea\" option. For my salads, I got the kale/kumquat salad, which had a surprising spicy kick to it, as well as the shaved brussels sprouts with dates. Both of these tasted so fresh and delicious and were perfect for a hot summer day! For my \"land and sea\" option, I got the salmon/avocado louie salad, a refreshing composed salad of cooked salmon and chunks of creamy avocado, all in an aioli and mustard-based dressing. Every bite of this was delicious--the salmon was so tender and the avocado so creamy! The plate also came with a parmesan crisp, which added the perfect crunchy element when combined with bites of the salad.\n\nOverall, I'm in love with the Lemonade concept and the flavors of their food--everything here somehow looks soo enticing, and I'll be back to sample more of their options!", "author": "David K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-06-19", "description": "I don't really like this place at all. First, prior to visiting this location I'd never been to a lemonade before, so I didn't really know how the portions worked and I asked for the wrong container.  The service was slow as hell. I stood there for five minutes waiting for someone to come out from the back and was getting ready to leave when someone finally came. All of the workers looked as though they hated life.\n\nI got two different salad sides, one of which was a Brussel sprout concoction that was gross. I think it had dates in it and was way too sweet. I also got Mac n cheese, which was very basic. It reminded me of the Mac n cheese you find in the freezer section at the super market. Oh, and they ran out of mashed potatoes, which is my favorite comfort food ever, so I was bummed. I think the only good thing was the short ribs, which I'd order again. \n\nI think I'll definitely give this place another try because there are so many options, but I'm not in much of a rush.", "author": "Steph L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-01-17", "description": "Updated: When you rate a place 2 stars and then they act like they followed up with you via a private message but never did... you downgraded yourself, Lemonade!\n\nStopped by for a snack (truffle Mac and cheese and Brussels sprouts) and what a disappointment. Sadly, the best thing I ordered was a bag of kettle chips that I added to my Mac and cheese. Sadly, it didn't make it much better.", "author": "Jane L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-20", "description": "I was really excited to be here today after going to the Bay to Breakers Expo. I took my two friends because we were starving for something healthy.  I normally get the ahi tuna with watermelon radish, roasted broccoli, and the potato dish but, I was downtrodden because they told me they discontinued watermelon radish because it wasn't popular. So SAD!!!!!!!\n\nMy friends and I still enjoyed the fueling but pricy meal. Please bring back watermelon radish!", "author": "Jray M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-20", "description": "Back in LA, I loved the ambiance and cold side dishes at Lemonade. When I saw one pop up in West Portal, I made sure to check it out. It's formatted as a cafeteria, with hot sides in one area, entrees in another, and cold salad sides when you first come in. The cold salad sides are the cheapest and beyond the mac and cheese, I think everything else here is a little overpriced. We ended up getting 4 cold salad sides ($3.25 each) and it was a great pre-dinner meal for me and my BF.\n\nWe ordered:\n\nCurried cauliflower: This was really good! The flavoring was good\nSoba noodles & kimchi vegetables: This has always been my favorite side, slightly creamy and tangy, but not too heavy\nAvocado and cherry tomatoes: Another one of my favorites, although be warned the lime flavor makes it pretty sour and salty. \nPoached albacore tuna: There wasn't much tuna in this one, a lot of potatoes and veggies, but still not bad\n\nThere isn't much order or direction when ordering so the line wasn't really moving along without anyone directing us or helping us along.", "author": "Jingxi Z."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-05-26", "description": "I used to love this place before they changed the seasonal menu. The majority of the dishes from the marketplace aren't very good and are too 'unique' for me. While, I do love their blood orange lemonade, the other flavors are too bold, but they're called Lemonade for a reason right?\nMy main concern is the cafeteria style ordering. Every time I go here, there are like 3 people working, one at the register, one in the kitchen, and the other is your server. It takes a while to get your food, despite everyone saying it's \"quick\". \nAlso, this place is a mess! There is occasionally someone cleaning up outside, but usually the tables are covered with spilled food and the chairs are sticky.", "author": "Kailey H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-01-02", "description": "Ridiculous price for what you get in the mango chicken bowl! And the chicken is spicy!! White rice only, not even brown rice! How can it be more expensive than a poke bowl with fresh fish?!", "author": "Honaunau B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-22", "description": "Nailed it with the Poke bowls! I was so happy to see this spot open in the neighborhood and have always enjoyed the lemonade drinks but like other reviwers, I found  the food too expensive for a quick meal.  Tonight me teen son and I tried the poke bowls and we loved it. Great quality ahi tuni, loaded with avacado and the crispy onion toppings and seaweed salad were delicious. Price was reasonable and we had leftovers.  We will definitely be back soon to try the other bowls.", "author": "Nancy A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-19", "description": "Okay, so I haven't tried a lot of things that they offer just yet and I've been stopping by for one main reason; I love their salmon avocado salad. Their ahi tuna poke salad is alright too, but there's too much oil in it for my taste. The staff is generally very nice and I've not had any problems service side. Apart from that, they got a wide selection to choose from, and the sandwiches do look very appealing. My biggest peeve here, and this is the reason why I took off two stars... is that the portions are ridiculously small, making their food highly overpriced.\n\nI get it, it's a cafeteria-style place, and I usually don't mind small portions as it's expected. This time though... it's pretty bad. And I can't really keep quiet about it. At least give me half a scoop more? I'm including the picture of my portion today, and it's criminal how little it is. For something that is like, $8? :( I want to be able to keep coming here and not feeling like I've been ripped off.", "author": "My N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-02-27", "description": "Overpriced dishes tasted stale.  \n\nWe went in with the intention of looking at what was on offer.  One staff guy made us uncomfortable, hovering as we perused the fare. Feeling somewhat pressured to order as though we were being surveilled, my wife chose her dishes.\n\nAs we made our way to the register and drink choices we approached the cookie display, we decided to get one so we reached for the lid.  The officious attendant reached over and almost slapped my wife's hand away, we felt as if he had a certain aggressive flavor to the gesture.  \n\nHe seemed to take great pleasure, and in all seriousness, (as if guarding the crown jewels), in telling us that mere customers were not allowed to touch the cookie jar lid. My wife used humor to defuse the situation but ultimately felt reprimanded by the supercilious teller/keeper of the sacred cookie jar....\n\nMy wife ordered the mango chicken ... it was cold and super dry ...\nand felt like it had sat there for 8 plus hours... The side of veg was limp and sad... the mac n cheese like mush... the potatoes sloppy and barely warm.. \n\nOne meal for one person was almost $35 with a tart lemonade to wash down the swill.\n\nAs we left, one of the staff members noticed that we were leaving almost the whole meal untouched.  We had to be honest and tell him what we noted here in this review.  He said something about offering a replacement meal, but my wife responded no thanks. Later, we thought he could have insisted on refunding us our hard earned pennies for a substandard experience and lower than sub standard food.\n\nHow do these places get away with ripping people off like this? \n\nIf you go, stick to cookies but if you like your hands don't dare reach for the cookie jar lid or your will leave with one fewer finger... \n\nLemonade ought to be renamed lame and limp.... a kind descriptor of sub standard fare... avoid this place like your hands and taste buds depend on it....", "author": "GreatAlfredini A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-06-24", "description": "So I've been to Lemonade before in the L.A. and Newport locations but it's been about 2 years since I've been.  So while in SF, decided to stop in for dinner since their food was always really good!  However, the menu was totally different with their price fixed menu and options seemed completely different.  It was a bit confusing as I used to just order everything a la carte cafeteria style.  So I asked and staff said that was fine. I proceeded to order 4 different a la carte items and a lemonade.  My friend did the same- but $42 later?  WAY overpriced!  2 Stars because the food wasn't nearly as good as it used to be, was lukewarm as the restaurant was empty and it had been sitting around a while, plus way overpriced.  The only thing I enjoyed was the lemonade.  Very disappointed as it used to be a fave place.", "author": "Chanda T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-02-23", "description": "I've heard nothing but good things about Lemonade and was looking forward to finally trying them out for dinner last night.\n\nFirst off, I love that Lemonade is cafeteria style and that there are so many healthy options to choose from all in different categories - land and sea, leafy greens, marketplace, sandwiches, and hot dishes. I went with grilled chicken breast, mac and cheese, and a Thai chicken dish with vegetables. My favorites out of the three were the mac and cheese and the Thai chicken; the grilled chicken breast was a little bland for me. I also had an original lemonade.\n\nOverall, I thought the food was good and enjoyed the lemonade but it's all a little too pricey for me. I spent almost $20 on three items and a drink. I was happy with the choices offered but for the price, I think the portions could be bigger.\n\nIf you're in the area and are looking for something healthy, quick, and with tons of options, Lemonade is perfect. I definitely want to come back and try out their sandwiches and other hot dishes, but the prices definitely won't keep me coming back regularly.", "author": "Stephanie C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-15", "description": "I'm a fan now! While visiting some friends, they suggested we try this place. It's kind of like eating at a really healthy delicious cafeteria. I love the theme. It's so bright, warm, and happy. All the food looks so fresh and tasty. \n\nThe line looks really long, but it moves pretty fast. So many options. All the food looks good, and I wanted to try them all!! They have salads, fresh sides, sandwiches, hot main dishes, dessert, and of course lemonade! \n\nHere's what we tried:\n+ avocado and cherry tomatoes: mmm avocado was so tasty\n+ roasted butternut squash: probably one of my favorite sides. I love b-nut squash!\n+ miso short rib: melt in your mouth meat\n+ bbq brisket: also melts in your mouth. We liked this one more bc we love bbq!\n+ truffle mac n cheese: this was so so, needed a little extra salt in my opinion\n+ coconut apple and lime lemonade: so refreshing!\n\nOverall, I love this place. Great selection of food that tastes great!!", "author": "Cindy K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-26", "description": "I love Lemonade! I've been to a ton of other locations and it's always the same, which is nice.\n\nI went on a Sunday for dinner and it wasn't too packed! When my friend and I got on line, the workers were very helpful and even allowed us to try some of the side salads. \n\nI ordered the pineapple chicken side salad, which was incredible! It tasted a bit coconutty, which was a pleasant surprise. As a main dish, I got the salmon salad sandwich. I've never had this type of sandwich before. Usually its chicken salad, but the salmon was so good! If you're a fan of chicken salad sandwiches, and you like salmon, give this a try! I also got the old fashioned lemonade - classic choice. FYI - the lemonade is a bit sweet. In total, all 3 cost around $16, which is a bit on the expensive side, but the food is good quality.\n\nMy friend got a chocolate chip cookie for dessert with his meal and let me try it as well. I definitely regretted not getting it because it was so good - very moist and chunky. Definitely give it a try. \n\nI'll be back a lot for sure!", "author": "Remy B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-30", "description": "Ordered Spicy Tuna Poki, was notified that it will be prepared in 15 minutes, 18 minutes later I arrived to discover they don't have the Spicy Ahi Tina, or the regular tuna! Horrible service for a $17 lunch, wasted my lunch hour by coming here. They can learn proper customer service skills and check what is in stock before commuting to taking orders. Will never return to any Lemonade location again.", "author": "Anna S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-04", "description": "Lemonade.... what a pleasant surprise to see one of these in NorCal!! \nAs many of the reviews have already mentioned, Lemonade is a la carte and cafeteria style so you walk down a line, choose what you like, and pay at the end. We came in around 8 pm on a weekday so there was no line and the service was quick. The girl who helped us (unfortunately never caught her name) was extremely sweet and helpful! There are a ton of choices so it can get a little overwhelming, however, she let us try a plethora of samples and helped us with our decisions. \nOut of everything, our favorites had to be the Watermelon Radish Ahi Tuna, the White Truffle Mac 'n Cheese, the Brussel Sprouts (YES), and the Blood Orange Lemonade. \n\nAs far as seating goes at this location, there is plenty indoor and outdoor seating and the ambiance is bright and refreshing like their food. \nIf you have yet to try Lemonade, it's definitely a must! Would I come here again? Most likely. There are plenty of options so there's always that curiosity to try more! \n\nWhy do I give it 4 stars? \nWell, it can get pretty pricy for the amount you're getting. Especially if you want to try a good amount of food, it can really add up. It worked out for us because my friend and I decided to split the bill and share, but if you're dining for yourself just be aware of how much everything is as you're walking down the line!", "author": "Tricia Angela L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-15", "description": "This is a fun, family-friendly and allergy-friendly place to eat a low key lunch or dinner. The food is generally healthy and fresh. I enjoyed the chicken pot pie and a pasta salad. The lemonades themselves are pretty good too. \n\nThe foods all contain allergy information so you can choose nut-free items.\n\nThis is a great addition to the neighborhood.", "author": "Sven S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-03-16", "description": "I like the concept is this place. The only complaint I have is the foods are all so salty.", "author": "Fion S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-08-11", "description": "Lemonade has been popping up all over San Francisco ever since La Boulange closed down in many of these different neighborhoods. I first tried Lemonade in the city by their first location by Metreon, and so finding out one was coming to the area where I lived I have been meaning to pay a visit.\n\nWhenever I pass by here, it's never very crowded so when my mom and I came here it was super easy to get the workers' attention if you wanted samples or a plate of food. Lemonade is cafeteria style and each item is individually priced, most of it being around the same price point as those in their category (i.e. sandwiches, marketplace, land & sea, sides, etc.) and they have a wide selection of different types of lemonade! We decided to share a few items; their truffle mac and cheese, kale salad, soba noodle salad, curry chicken with raisins, and harissa roasted cauliflower. It came out to be almost $30 which is a little pricey for me especially the portions aren't that big, but it was just right to share between us two. The quality of the food I felt was just okay, it wasn't anything that I would go out of my way for or it being a must try. This location is smaller than the one by Metreon so they don't have as much of a selection compared to over there, but I feel it fits well in this area as it's one of the healthier options and a very family-friendly place.", "author": "Kathleen S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-03", "description": "As a Lemonade addict, I was excited to see a place open up called Lemonade in West Portal. Of course, I had really high expectations and didn't want super acidic overly sugared lemon juice. I decided to give this place a try and the lady at the counter was super nice and let me try all of the different flavors. When she named the flavors \"Cucumber Mint,\" \"watermelon rosemary\" and \"blood orange\" I was like damn girl, I just wanted a cherry! Once I tried the different flavors, I was hooked. Here is what I thought of each: \n\n1. Cucumber Mint: By far my favorite. I like the clean refreshing taste with a subtle hint of mint. You can definitely taste both but it has a very clean taste. \n\n2. Blood Orange: I like this a lot also but it was a bit sweet for me. The Blood orange has a very distinct taste and it blends well with the lemonade. \n\n3. Watermelon Rosemary: Also very good. The watermelon is subtle and I didn't really taste the rosemary. I didn't realize how good watermelon mixed with lemonade. \n\n4. Strawberry Rhubarb: I didn't really like this flavor. It was a bit bland and did mix with lemonade as well as the others. \n\nThey also have Peach Ginger and Old Fashion which I didn't try. \n\n---------------------------------------------------------------------------------------------------\n\nOverall, best lemonade I've had so far. I really don't like super acidic lemonade where you feel your mouth start to peel after drinking it too long which I get at hot dog on a stick lemonade. This place does a good job with the mixture and there isn't any syrupy or overly sugared taste. I loved how natural it tasted and now subtle the flavors were without overpowering the lemonade. Now that summer is just around the corner, this place is a must try as the weather starts to heat up.", "author": "Jonathan L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-04", "description": "Fast, friendly service, sleek modern interior, and DELICIOUS food. The salads and fish are extremely fresh and reasonably priced. The avocado salmon salad was my favorite! One weird thing was when I asked what type of salmon it was the reply was \"farm raised\" but then after I made a face they changed the answer to \"wild caught\". I'd love to know if anyone else has experienced anything like this...", "author": "Amanda W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-08-07", "description": "I have been to this Lemonade four or five times. The veggie dishes are generally flavorful and fresh tasting. You can ask for sample tastes of each dish.\n\nLast night the ahi tuna poke tasted bland and the crisped bread slice was soggy tasting.\n\nSometimes the servers forget to give you the crisp as part of 'the big chill' entree choice. Happened twice out of five visits\n\nIt can be five stars or two stars depending on serendipity of that day. I gave 3 stars because last night the poke was so flavorless I couldn't eat more than a few bites.\n\nIf consistent, I would give 4 or 5 stars for flavor and nutrition.\n\nTry it at least once:)", "author": "Randy D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-07", "description": "Healthy and delicious food. It was my first time there and I really liked it. The grilled cauliflower with chicken was my favorite! And the strawberry lemonade is so good!", "author": "Enaile B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-04-08", "description": "I'm generally a fan of Lemonade. First time to this location. The food was good as usual but the service was horrible. Clearly understaffed, zero sense of urgency from anyone working there, and no management presence to be found.", "author": "Michael M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-16", "description": "In short: the food is delicious but the price is a bit steep for what it is.\n\nI've been waiting for Lemonade to open at West Portal for months and now I don't have to go all the way downtown anymore! I love the variety of salads they offer - some are vegetarian, vegan, gluten-free so there are plenty of options for those folks. Or if you're like me and just want to eat delicious food that just so happens to fall under those categories, Lemonade fits the bill perfectly. Aside from salads (Marketplace - $2.95), there are protein options (Land & Sea - ~$6.95), sandwiches (~7.95), mac n cheese ($4.95), a soup, and a few hot options.\n\nMost items are under $8, but a meal won't be cheap if you want to mix and match (which is what they recommend). For two people who each ordered a Land & Sea, two Marketplaces, and a lemonade, the total came out to about $40, which is pretty pricey considering this is a cafeteria-style establishment. \n\nThe lemonades are great! They don't seem to have as many flavors here as the downtown location, but they make up for it by offering sugar-free versions. \n\nIf you know exactly what you want and don't want to go through the whole line to look at all the offerings, you can just head straight to the cashier after you've gotten your order. Great. The only problem with this system is that people in line think you're cutting in front of them if they are unaware of this policy. I wish they would either create a separate line or at least put up signs because I feel awkwardly uncomfortable being glared at by the people behind me.", "author": "Olivia V."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-01-25", "description": "I went tonight with my 2YO after going to Peekaboo Factory. There was quite a line because of a fundraiser for a school. I decided to wait and got the couscous from the marketplace, the pickled radish and ahi tuna, regular mac and cheese and mashed potatoes. \n\nThe couscous (1/5) was bland and lumped together. The mushrooms in it were nice but all in all it wasn't good.\n\nThe pickled radish and tuna (1/5) was also not so great. I got literally 1.5 pieces of ahi tuna and everything else radish and peas. I wish I had taken a photo but I was trying to get my LO to eat. The line was so long that I didn't want to ask for something else.\n\nThe regular mac and cheese (3/5) was probably the best thing we had. Just your typical and I assume more kids would love.\n\nThe mashed potatoes (2/5) lacked salt and texture was about grainy. \n\nI really wanted to like this place as it's a new arrival to sf. I ended up having to go to another place afterwards to get my LO dinner.", "author": "Tiffany L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-04", "description": "Tried the Sesame Marinated Lo Mein Noodles and the citrus poached salmon. Both were very good. The lo mein noodles come in a nice peanutty type sauce, carrots, mushrooms peanuts, edamame, and cilantro. The salmon has a while grain mustard sauce that is fairly mild and not too strong. \nA big perk is that you can get a sample of almost anything before you make a decision. You are practically guaranteed to like what you order!\nWill come back ASAP! Am already planning my next choices.", "author": "Mackenzie W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-05", "description": "Having been to the Lemonade by Metreon once before, I was kind of expecting more or less the same thing when we decided to come here today. The only difference really was that there was less staff, so the line moved a bit slow compared to the other Lemonade.\n\nLast time, I'd gotten their famous white truffle Mac which was really good! But I found it to be quite heavy in flavor, so this time I got half white truffle and half classic Mac, which I felt was the perfect balance! I also got the BLT salad, which is really good and definitely hits the spot when you just want something light. \n\nThe best part, however, was the coconut Apple lime lemonade. That sounds like an odd combination, but I was obsessed the minute I tasted it. I got the blood orange one last time, which was also good but in my opinion doesn't compare to this one. It was the perfect balance of sweet and tangy, and honestly if you're a fan of coconut this lemonade is a must! \n\nMy meal total was around $12.50 which is a bit pricy, but I still enjoyed it and would definitely come back again! \n\nAlso, the staff is all really sweet and helpful.", "author": "Anila K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-04-13", "description": "Absolutely expensive for a fast food like restaurant. 2 tiny hot veg bowl for $5 each. Avoid avoid......", "author": "Melvon M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-04-28", "description": "Food is overpriced, the service is glacial, and the layout means that you'll be standing in line for 10 minutes before you can even look at the food options.", "author": "Phil C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-07-30", "description": "I appreciate it if a business says it will follow up, but it not sincere when they ask for my email for their GM to contact me and it's over a month. Not expecting to hear anything at this point. It would have been better if they didn't pretend like it was going to happen.", "author": "Jen B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-13", "description": "When life gives you lemons, you make lemonade.  And boy, did they make lemonade!  Well let me get the lemonade later.  Let's talk location.   Lemonade took over the old La Boulange.    It feel bittersweet walking back in there knowing what it used to be.  The place is more bright and clean looking.  They still have seating outside with heat lamps, but who wants to sit outside with their salad on a  cold San Francisco winter day.   This place is very close to the West Portal train station, so you can easily walk there.  My boss took us here for lunch today so it was very easy for us to get here.  \n\nWe got here around 12 and there was already a huge crowd.   I think a lot of people wanted to check out the new kid on the block.   There was a waitress in the front asking us if it was our first time here.  She took her time explaining to us how it all works.  So you can order at any place in the line as long as you what you want.  It's broken down by MarketPlace, Leafy greens, Land and Sea, Sandwiches, Hot dishes, desserts and Lemonade.  Their Marketplace are different types of salads.  It's broken into three sections, vegan, Vegetarian, and with protein.   You can do one of the salads for as little as $2.95 a portion. I recommend doing one of their popular suggestions.  You get to try a little of everything.  You can pick 2 Marketplace options plus an item from the land and sea, or Sandwich plus a leafy green as a side, or a full leafy green order plus land and sea.  I know the options maybe overwhelming but don't hesitate to as for a sample.  They give you samples with a smile on their faces! \n\nOk enough talk, lets get to the food.  So i ended up doing the 2 marketplace items plus the land and sea. I ordered the Shaved brussels sprouts and dates and the curry cauiiflower as my two marketplace items.  For the land and sea there was NO WAY i was going to turn down the Salmon Louie Stuffed Avocado.  The curry Cauliflower was not too spicy. There are times i tastede a mild spice and times i didn't.  I love cauliflower so this was very interesting.  Actually this tasted like an egg salad, except it had a more sweet taste because of the golden raisins and almonds.    The Shaved Brussels sprouts and dates was soooo good!  I loved how  the dates there chopped so perfectly where it mixed well with the brussel sprouts. The parmesan did not overwhelm the salad.  There are times when i get salads at other places the cheese overpowered the salad.  This was perfect!  However, this was not my favorite dish. My most favorite dish was the Salmon Louie Stuffed Avocado.  Have you ever had a tuna melt?  Well imagine that this is very similar.  Salmon melt over an avocado.  They give you enough salmon to go with every bite of the avocado.  The avocado was very fresh because you can always tell when an avocado turns color, and this one was so green.  I loved this so much i can eat a dozen of these for lunch! And last but not least, the Lemonade.  I got the old fashion one, because i always believe that you can't call yourself Lemonade if you can't nail this item.  And they did nail it.  i love how it was tarty, and it wasn't sweet.  I can't stand it when people add sugar to the drinks. \n\nThe service as pretty good.  The cashier who took our order made sure everything was ok and got everything for us when we were missing items.  She came to check on us twice.  And the waiter came and took our empty dishes away when we were done and told us to take our time. He didn't even rush us.  My only complaint is that this place is super cold.  They had both doors open and come on, it's winter in SF,  you need to keep your doors closed.  Our their doors handles were slices of lemonade.  How cute is that?! The rest of my coworkers loved their food, not a crumb was left.  Great place to have  a meal with your friends and kids.  The next time i come back here, i need to try their desserts!", "author": "Belinda C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-01", "description": "The new guy who helped me touched my food a couple of times. Use some gloves when helping someone serve ffs; that should already be included in the training. Although they offered to get me a new bowl I didn't get a new one because I don't wanna waste food. Some homeless person is gonna eat good tonight.", "author": "Danrae S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-15", "description": "Killer lemonade. Killer sandwiches with unusual tasty dressings. Nice, inventive salads. Extremely courteous sweet staff. Really a great lunch find. And they have some fresh baked cookies too. So much better than anything else in West Portal for lunch.", "author": "Cathy L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-03-03", "description": "Below average food and service. Another average \"wanna be\" restaurant.\n\nBe sure to watch what they put on your plate, lest you receive undesired items you didn't order.\n\nEven if you ask the server to help you stay clear of gluten, don't trust them. I asked politely for him to identify which salads are gluten-free, then I picked from within choices. Lo and behold, I bit into croutons in my salad. When I point their mistake out, the answer is \"it's not our fault if croutons fell in the salad!\"", "author": "Flynt I."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-13", "description": "The lemonade was different, with coconut?  Flavor was OK but seem water down. \n\nTheir macaroons was the size of my palm Awesome , but $5.  They had food and drinks also but we didn't get to try.  \n\nTook over where La Boulange was in Burlingame.  Location was clean and modern, nice :-) .  \n\nWould come back to try other stuffs.", "author": "Danny H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-18", "description": "Lemonade is great! It's just a really easy place to eat at with quality delicious food. We live a few blocks away and go here once every 2 weeks or so to get to get a decent meal when we are too lazy to cook. It has a decent amount of space. It's good for kids. They have a lot of quality salads, sides, and hot dishes that are consistently cooked well and tasty. My favorite thing to get here is the \"Cozy Comfort\" combination. You get one salad (kale, beets, shredded Brussels sprouts with Parmesan, tons of other good stuff). one hot side (roasted Brussels Sprouts, or roasted cauliflower, or roasted seasonal vegtables, etc etc. all really good.), and one hot main dish (slow cooked, braised Texas brisket or Korean short rib, or roasted chicken, etc. etc.), good stuff! QUALITY but relatively cheap for the value because it's ready to go and you order and pay before you eat. Love this place.", "author": "Thom W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-07", "description": "I've loved lemonade since I first tried it in LA and was super pumped when they announced they were gonna bring several locations to the Bay Area. \n\nI was even more excited about the West Portal location because it's so close to me (and I don't have to make a trek downtown to get dat mac and cheese).\n\nFor those that don't know, Lemonade is cafeteria style, with school trays that you slide along the different stations. You start off at the market place which includes all the healthy sides and salads. They assign you a number at this station so all subsequent orders will be placed under that number for convenience. \n\nThen you have the sandwich station, where those guys are made to order. Then you have the Land/Sea section, which includes ready-made proteins like salmon, chicken, and beef. Then we have the hot sides, which include my recommended favorite truffle mac and cheese. Oh lord that stuff is delicious and I can eat that forever and ever. This section is tempting because everything looks so good when it's piping hot and in big batches. \n\nNext is a glass case containing desserts which house things like big ass macarons, which I have not tried but they look pretty decent. And huge. \n\nLastly, you have the cashier station and located behind them are waterfalls of different lemonades. I recommend the blood orange lemonade, it's not too sweet and it's super refreshing. \n\nThis place is great to grab healthy (and not-so healthy sides) food but it is pretty pricey. For a complete meal, you'd probably spend around $15 give or take. But if you're willing to pay for fresh, good food, try it out!\n\nParking is metered or if you're lucky, free street parking in the neighborhood behind the shopping area.", "author": "Stefanie S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-07-06", "description": "Website wasn't working so much time wasted trying to place an order, small portions served in little cups, ahi tuna with avocado was a cup of diced up ahi and diced avocado (who dices avocado)? Grilled cheese sandwich had tough crust; wasn't impressed with this restaurant; we won't be back.", "author": "Carolyn M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-02", "description": "I haven't tried lemonade before and this was my first time here. I've heard about this restaurant in socal area but haven't tried. I decided to give it a try since they had a new location in sf. \n\nThe food scoopers offered their suggestions on what salads they like and gave me a lot of samples. After the salad section, there's a sandwich part and then a hot food area. I highly recommend the white truffle mac and cheese. It just tasted a different kind of cheesy taste. You just gotta try it yourself. I also ordered the miso pulled pork, mashed potatoes, those weren't bad either. The food scooper at the hot food station was very thoughtful and also gave me samples, she also was the cashier too. Shout out to Jia, after I told her how much I like the mac and cheese. She showed me a recipe cook book, that has most of the dishes at the Lemonade restaurant. But that's not all, the second best part after the white truffle mac and cheese is the different lemonades available. There's plain, blood orange, watermelon, rosemary and tons more. Jia also told me that you don't only have to get one lemonade, you can also mix and match the different flavors of lemonade. I took her recommendation of mixing  plain lemonade, blood orange lemonade and watermelon lemonade. My new combo lemonade was not too sour or too sweet, but perfect. I'm sure I'll be back to lemonade to get their white truffle mac and cheese.", "author": "M L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-04-23", "description": "This place sucks. I am disappointed.  The food was mediocre and service was extremely rude.  I thought this was going to be a go to for my diet, which excludes grains, soy etc... This seemed appropriate given that they cater to vegetarian, vegan and gluten-free customers.  \n\nThat said, after over 15 minutes trying to see what they had, while attempting to stay out of the way, I asked for help.  You would think you could ask at one station for all of them. Nope.  When I asked at the protein section, the girl rolled her eyes and stomped over to the same book the last lady looked at.  Then she was bitching to her co-workers about it.  So, I kindly expressed that my diet is medical and I am not trying to be a pain in the ass.\n\nIt came down to two items that I could eat -- I find this hard to believe. I was so exhausted that I ordered them and didn't bother with the other sections.  I ordered the shredded Brussels sprout salad with dates and the chicken with a yogurt sauce.  The lady didn't heat the cold chicken or even take the paper off it, as she threw it on my plate...kind of gross and rude.  It was dry, cold, and difficult to eat.\n\nIn conclusion, this was an exhausting experience and the overpriced food sucked.  They really need some customer service training to carry-out what appears to be a good vision.", "author": "Kiki I."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-09", "description": "Great variety of salads! Love the ahí poke, the curry chicken with walnuts and the macaroni and truffle cheese.", "author": "Ibelig V."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-05-08", "description": "I'm not too fond of this place because of their service, but sometimes I do come here for a healthier option along west portal.  The food is ok.  I usually get a small sides and a sandwich and their blood orange drink.  I can't fathom their cafeteria style ways because the patrons think you're cutting  the line, but really, they're taking too long to decide on what to get and I just want to jump to the sandwich station and order my stuff and pay. Secondly, when you reach the desired station, no one is there and the neighboring chefs who are manning their own stations ignore you.  So to circumvent all this waiting annoyance, I try the online ordering.  I order my stuff, give them 20 minutes to assemble the order, hop in the car and drive to pick up your to go order.  Simple idea, right? Panera does this, calibur does this. No problem!  Lemonade?!?! No! I show up, show the cashier lady my online order, and she only gives me 1/3 items.....my sandwich.  Where's my side salad and drink?  After a couple years of being open, they still don't have their stuff down. Smh!", "author": "Lisa W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-24", "description": "I love salads, so I loved the one I ordered. The service was warm and friendly. My only disappointment was that I thought it was overpriced. Still, I will return.", "author": "Clare H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-01-06", "description": "The neighborhood needed something like the fast-casual chain Lemonade. It's relatively affordable, healthy, and kid friendly. I'd say that a year or so in the fixtures are already starting to show the wear and tear from all the traffic, so corporate should keep an eye on that.\n\nThe sandwiches are the only things made to order, so towards the end of the day when the rest of the stock is getting a little low or tired looking that's my go to. The lemonade itself is huge and very sweet; if they happen to have the unsweetened in the store they will let you do half and half which brings it down to a manageable level of sugar.", "author": "saru k."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-06", "description": "First time here, the set up reminds me of Ikea. Grab a tray, go down the line and point to what you want. The food seems chef prepared with fresh, healthy, creative choices - although a little on the sweet side. Ordering was a little confusing as the side dishes are presented first as you go down the line. Ordering by combo is cheaper than doing ala carte. Our order came to 45 bucks for two. Seems a bit steep, but the quinoa with pear salad was worth it .", "author": "Mel D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-09", "description": "I've been wanting to try this place and boy was I disappointed. The food was mediocre and more like cafeteria food. It took us a while before we could figure out what to order. They have a lot of different salads but everything looked like it's been sitting around for a while and drenched or wilted with dressing.  $13.50 for 2 scoops of room temperature salad and a small piece of lukewarm salmon.  My son had the Mango chicken which was very dry because it's been sitting out too long.  The rice and kale with it was good.  They do have good lemonade.  We ordered a blood orange and tangerine.  My daughter's dish came with fresh baked crisp but it wasn't offered to her.  When I asked,  the cashier said they ran out.  So why didn't they mention it or offer me a substitution? I had to ask for it so the cashier said he can give me bread.  I said ok.  Waited for a while and asked if he had forgotten.  He said he thought I didn't want it. Speechless!!! Then they ran out of forks.  No metal or plastic forks.  When I asked,  he went to check and said they're being washed right now and will take a while.  So I asked if they had plastic forks and he went to get them.  Seriously??? Nobody checks? I had to ask for him to get the plastic forks so my kids and I can eat. The chairs were stained and the canvas back rest were dirty. The only good thing about this place is the very nice African American lady helping us with the food and their lemonade.  Will we be coming back? Nooooo!!! There's too many better places in the neighborhood. This place lacks management and quality control.", "author": "Mimi C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-03-18", "description": "Lemonade was OK, but I don't think I'd be back, except perhaps for a giant macaroon.  Food is served somewhat cafeteria style - you grab a tray, stand in line, and pick out the items you want.  It ranges from healthy deli like foods to hot foods as well.  Items are served in mini bowls, so that you can select a variety of items for your meal.  You're given a number so that as you go down the queue, the workers will tab everything up and know how much your total will be.  \n\nThe food quality was OK - wasn't amazing and probably on par with what you could get at Whole Foods.  The lemonade was a disappointment - this was expected as I've never had \"amazing\" lemonade.  I mean, how good can lemonade get?  Overall, it's probably not worth coming back considering the costs really add up once you start stacking up the plates.  We paid about $35 for two people.  \n\nMy only highlight was the pistachio macaroon - it was huge!  Quality was fine and not bad for $4.50.  You go to any other store and it'll cost ya $3.xx for a tiny bite which makes me want to cry at times.", "author": "Laura C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-09-17", "description": "Tasty food but this place is poorly managed. Line out the door for people to choose pre-prepared salads. One poor soul dealing with the line and the customers indecisions meanwhile a cashier just stands around and does nothing to help the line and another person is standing by cutting bread. I should not have to wait 20 minutes on line to have food shipped scooped onto a plate.", "author": "Anthony S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-09-16", "description": "This was very disappointing I was excited to go here and have a go to place for a healthy meal.  The sides were not good and the chicken was dry and not great flavors.  We need the Spinnery on Polk  in the sunset much better", "author": "Seth J."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-11-11", "description": "Used to love coming here. Portions have gone down significantly since they raised the price to $3.25. Also it's upsetting when you see others get the same market portion but a bigger portion on their plate. Luckily the cashier helped and added more once we complained that the portion seemed small.", "author": "cindy n."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-24", "description": "New location in West Portal w/ essentially the same menu and dishes as any other location. Brightly lit, clean and staffed w/ a set of teenagers, restaurant runs like clock work. Quality and food are the same - no complaints. \n\nCame in near holidays and if planning to close early, they should stop letting people in. There was a young man who basically went by sweeping the floor when we were still seated and gave us \"the eye\" and said out loud at no one in particular that he needed to get out of there for their company holiday party. Weird.", "author": "Julie L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-01-21", "description": "The place is more of a 3.5 star joint, but I always round down. It's definitely pricey for the amount of food but there's plenty of variety. I like the cold salads and sandwiches much more than the hot food. Heat tray food just doesn't keep as well. I've eaten here twice and always leave spending more money than I expected. I wish they have more composed salads like Blue Barn instead of a bunch of exotic salads in small portions. They're almost like toppings for a regular salad. Their lemonades are excellent, probably the best part of the meal. The dessert selection is also pretty decent. I will continue to look for a good salad place in West Portal.", "author": "Alice W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-20", "description": "There is this guy who works there that is the sweetest person. He knows what to recommend and always brightens my day with his great customer service. Thank you!!", "author": "Anuja S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-01-04", "description": "Ever since I heard about lemonade coming to SF I have been dying to visit! The location downtown isn't ideal for me to get to so when I heard they were opening one in west portal I had to visit! \n\nThis location is exactly like the first one I visited in LA. They have a wide range of side salads. I ordered the butternut squash and the chicken green bean salads. They were both okay. The chicken green bean was a little too spicy for me. For my main dish I ordered the chicken vindaloo and it was AMAZING! It was so tender and the sauce was delicious. I also sampled the watermelon lemonade which was also really good.\n\nI think its a great place to get a healthy meal and I'd come back when I'm in the mood!", "author": "Kelly S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-10-15", "description": "This is one of the worst customer service experiences I've had in a while. If you can't (for some reason, since there are five people behind the counter) serve someone when they arrive, at least acknowledge their existence. I'll never know how the food is, because I will never come her again. I have stood here for more than 5 minutes now, and nothing. They will, legit, NEVER get my money.", "author": "Ms J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-03-24", "description": "I love the salads, or selections from the \"Marketplace\" here because I can easily make a meal out of two of them, but the salads I tried here the other day were extremely salty and unappetizing. I tried 3 salads; the BLT Panzanella, the Tuna, and the Cherry Tomatoes with Avocado. Every one of them was so salty that I didn't want to finish it, and that's a rarity!! I honestly don't care about the lemonade (except for maybe on a hot day when it's warranted?), so the food better be good. Right now, this location has left a bad impression on me and I hope I can give it a better rating in the future when I try out their other offerings.\n\nP.S., I ate my food outside and the dining area seems to attract a lot of flies. Fly traps maybe? It's also hilarious to watch people pull the heavy right-hand side entrance door open because the left-hand door rests over it. If you've been here, you will totally understand what I'm talking about.", "author": "Enari L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-07", "description": "Great food here. Simple enough to order going down the cafeteria style line (but it's definitely NOT like old school cafeteria food). The staff was friendly, patient and helpful to myself and other newbies. I went back a few times during my few weeks in SF. The truffle mac n cheese was my favorite. But everything was good.", "author": "Denise D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-08-03", "description": "Ok food.  Expensive price. Uncomfortable seats.  Pros: great variety of food and lemonades\nCons: salad is kind of bland and lack of a flavor. Hot dishes are way too tiny portion.", "author": "Janita s."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-31", "description": "Since i panned the Palo Alto site, i thought i should be even handed in saying that we enjoyed our first Lemonade experience which was at the West Portal restaurant.\n\nService: the staff went out of their way to explain the offerings, offer us tons of samples so we were confident we would enjoy what we ordered. \n\nPrice/Value: while the meal itself wasn't inexpensive, the food was fresh, inviting, and a moderate priced meal that sort of felt like cafeteria styled tapas which we enjoyed immensely. the best values were the salads themselves as some of the hot dish portions were pretty small for what you are paying, but the salads at $2.95 per serving offered good value and great taste.\n\nSome specifics\n- mac n'cheese: they make three types, all of which my 4 year s old sampled and decided she still like the plain one the best. the truffle one was a nice twist, but to me all of them had way overcooked noodles. but maybe that's perfect for a preschooler who doesn't appreciate al dente pasta.\n\n- kale/pear salad: nice fresh inviting salad with a great mixture of textures and flavors.\n\n- Tijuana sandwich: another fresh and inviting taste. a little spiciness with tons of great textures and flavors.\n\nour two favorites:\n\n- the Ahi Avacado Poke which was wonderfully flavored, the fish was very fresh, and the portion was nicely sized for what we paid.\n\n- the Ahi tuna + watermelon radish was a feast for the eyes and palate. it's not quite what you expect when you look at it, but if you are adventurous and willing to try something new, you are in for a delightful experience of texture, taste and flavor.\n\none thing i should note is that often restaurants try too hard in putting too many things/flavors into one dish. for the last four items mentioned above, the chef found the right balance of complementary flavors and textures.\n\n(for some of the other items we tried, that was not the case)\n\nanyway, at least for this location: give it a shot. at least go in and try a few sample. the staff was generous and patient in letting us try things out. if you don't like the samples, then nothing lost except a little time. but if you like to explore some new food at moderate pricing, i'd give Lemonade a shot.", "author": "Derek F."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-10-14", "description": "We ordered via Uber Eats. We ordered 4 items but only received 3. they did not include our Curry cauliflower. The chicken thighs on the menu came instead as one chicken leg attached to a thigh. Not worth the $7,  and totally not what was as described on the menu. Also the Lemonade's are nothing but sugar and water. We ordered two lemonades... one that says watermelon with rosemary, but it was just water, sugar, maybe two tablespoons of watermelon juice and zero Rosemary. Will never order from this place again.", "author": "Denise Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-08", "description": "When I lived in San Diego, Lemonade was one of my favorite places to eat. When I heard they were opening a location in San Francisco I was super excited! Lemonade takes a simple idea and turns it into a nice, delicious dining experience. It's like a lunch line! You pick everything you want and it is spread out in different sections. The staff is super friendly and helpful as well. I recommend the mashed potatoes. They are AMAZING. Of course, I will be returning really soon.", "author": "Korra B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-12-23", "description": "Lemonade might have been so popular in LA but after I try out once it didn't go wrong with my expectation.\nLots of good healthy looking Market section salads are very flavorless and compromised with \nsweetness.\nThe worst thing was that Apple smoked bbq beef that comes with too sweet bbq sauce.\nWhy all thing became this much sweeter as soon as arrive in America?", "author": "Piano B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-02-03", "description": "I feel like for $2.95 the portions were a bit small. I tried 5 different dishes including mashed potatoes, mac n cheese, guac w/ tomatoes, cauliflower and kimchi noodles.\n\nI wouldn't say it was the best but it wasn't bad either. I'm having mixed feelings about this place.\n\nThe lemonade was a bit sour for me but it might taste good for some.\n\nI wouldn't go all the way to brunch in this place.", "author": "Kathy D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-04-05", "description": "Incompetent people who work here. Takes 20 minutes to make 1 SANDWICH!  And it doesn't taste good!!!  What a waste!  Don't come here unless you want to waste your time and money!", "author": "Marsha L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-03", "description": "Awesome salads! We tried about 5 of them and each of them were stellar. Love the sugar free lemonades as well. The hot food was not bad but nothing great.\n\nThe service was amazing and very friendly staff.", "author": "Karthick S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-23", "description": "I Love this place! Healthy eats, so colorful and rich. Vegetarian & vegan options too. And all the varieties of lemonade yummm!", "author": "Candice N."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-12-12", "description": "The food was underwhelming, pricy for what it is, flavorless, served by a clueless staff. Only cold vegan choices, weird blends of salads, without anything great. The lamb meatballs were described as three tough bland balls in a flavorful sauce.\n The salad preparer seemed overwhelmed. He couldn't figure out the dressings, We waited several minutes for one dressing and that was harshly flavored. He reused the same bowl as the portion control so you got an interesting blend of other salads mixed in with your choice. \nWandered back and forth to figure out what to order and when I asked questions of the staff I got little help. \nI'm not sure if I'd go back. There are some great choices for sit down, well made meals within one block for about the same price.", "author": "Art R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-13", "description": "We were wandering around the area for a place to eat and saw that Lemonade finally opened.  There are so many employees behind the counter. They are well staffed. I tried the poke which is different from traditional poke. It had tangerine pieces, avocado and seaweed.  It was good and I'd order again. The cup of broccoli soup was good but not great.\n\nHubby really liked his turkey sandwich but after consuming 1/2 the sandwich there was something not right with the 2nd half.  The General manager happened to walk by and she fixed the problem immediately.  That's good business practice. We didn't try any lemonade on this trip but plan to when the weather is warmer.", "author": "Ry T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-25", "description": "Looking forward to a chain in my hood. Who would have thunk? Nineth Avenue local, come on down, it's your turn.\n\nThe staff was great at WP's Lemonade. It was a night it was pouring. WAY kid centric, that is okay, the play party place is next door, so it is bound to cross over.\n\n*great, fresh, tasty selections on everything. if you cannot find something, well then, you ARE a fussy eater.\n*Lamb stew with tasty balls, a must.\n* The tuna tar-tar great, especially with the citrus.\n*All the veggie dishes worked for me, esp. the tenderloin fingerling dish as well as the sweet potatoe/squash side.\n*Everything worked and I would imagine the patio is great on a nice day, when there was not a flash flood warning.\n*wanted to try all the fresh drinks but truly enjoyed the bloodorange lemonade and the pomogranite ade as well.\n*dinner parnter had dessert, I had a bite, good selection there as well.\n\nSo, I can let that they are from LA go, there are brining a unique, good price point product to the Bay Area.\n\nNow make up with the Carpenters and finish the Inner Sunset's location!", "author": "Joe Bob J."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-01-07", "description": "A friend raved about this place yesterday so I decided to bring my son here today. Walked in, and stood there, waiting, while nobody acknowledged me. Finally someone asked what I wanted. I ordered a kids grilled cheese and a provolone grilled cheese.\n\n25 minutes later, they finally brought the sandwiches to the table. My provolone was barely melted and the bread was soggy.\n\nMy son's grilled cheese was also marginally melted. \n\nRather odd. I doubt we'll come back at this point. Too bad.", "author": "Holly B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-05-21", "description": "Very very nice food (fresh and flavorful),  great atmosphere, and friendly staff. But... this place needs an experience re-design. There are multiple layers to ordering - Marketplace Salads , (with 3 subtypes of salads), Land &Sea, Leafy Greens, Hot Dishes and Sandwich stations along a cafeteria style line. On top of this there are bundled \"Plates\" - e.g. The Big Chill, Farmers Marketplace, Cozy Comfort, etc.- which combine components for each of the other stations. It's so complicated that they have a handout menu (that doesn't make it clear), and the staff - of which there are many (surprising how many given how slow the line moves) don't even know what the Plates include.  are either. So the entire ordering process is much more complicated than it needs to be - major issue when you're in the neighborhood that is filled with families with young children. Great potential- not there yet.", "author": "David F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-07", "description": "I am so happy Lemonade has made its way to NorCal and even in closer proximity! Like most Lemonade I've been to, this one is pretty standard. You order kind of buffet style and you pay when you get to the cashier. \n\nI always enjoy walking by the food and deciding what to get. I really love their poke, brussel sprouts, and truffle mac n' cheese. These are probably their stables to Lemonade. I did hear that they change their menu once a while so you always get a pretty good variety of food. I always end my meal with a blood orange lemonade, which is my absolute favorite! The guava lemonade is also tasty, but too bad that one is only seasonal. \n\nOverall, this is a great spot if you're looking to eat a healthier meal. Yes, it could get pricey depending on what you get and how much you order. I do think it's reasonable for the quality of the food you're paying for. It's an once-in-a-while, and treat-yourself type of meal!", "author": "Wendy Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-26", "description": "First time here was for lunch during the week, it's a fun spot. love the Lemon theme, contemporary style and cleanliness of the place. They have lots of offerings for vegans to meat eaters all in separate areas to pick and choose from. I had the Kale and kumquat salad and it was good, a bit bitter with sweet and slightly spicy due the red pepper. The tomato and avocado salad which was really yummy, both veggies were nicely ripe. Oh and then I indulged in the Salmon Louie Salad that also had avocado in a nice creamy dill sauce. I ordered Original Lemonade was perfect to wash it all down. To top it all off they have macarons the size of your palm I had the raspberry, it had that little crunchy exterior with a little chewy inside of the cookie and a light creamy strawberry filling, can you tell I liked it? They also had pistachio and caramel flavored. Definitely swing by this place.", "author": "Elizabeth S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-10", "description": "I had the best service, and welcoming experience. The workers were very kind, they gave me samples and offered suggestions on what type of food to eat. The manager was extremely helpful, on explaining the different types of food they offered. The food was delicious and healthy. I highly suggest the West Portal Lemonade it's definitely a great place to eat.", "author": "Marisela M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-14", "description": "This place has a really interesting concept but is kinda confusing to come alone. I would recommend a preordered plate rather than free styling which I did! Besides the confusing ordering process, the staff is helpful tho I wish they recommended a plate instead for my first time. The food is really good!! Also I just found it you can try samples which the worker did not tell me! I felt like she was just rushing me to get my order and be efficient which isn't the best especially as a first customer", "author": "Amani R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-23", "description": "This was a great place to hang out, the food tasted good and was not super over priced, there was only one tiny thing, they didn't really have much to drink besides lemonade and water, now this does not affect me but if someone wants a coke I did not see any maybe they were out, I just think they needed more drinks, otherwise the design was nice it was light and healthy food but filled me up. I definitely would go back, especially for their watermelon and rosemary lemonade.", "author": "Kyle F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-08", "description": "Pretty tasty but come well before closing. Love the southwest squash. The chicken salad sandwich was so good but limited time only. The actual lemonade is a little sweet so cut it with water", "author": "Joe P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-04-24", "description": "I was not impressed with Lemonade. I ordered Mac and cheese. It was barely warm. I asked to Jane it re-heated. It came back exactly the same temp. Not very warm or inviting. My server had unacceptable people skills. Did not even speak to my or smile. I felt like I was inconveniencing them. The Mac and cheese flavor was ok. I doubt I'll be back. To many excellent places to go on West Portal.", "author": "Michelle M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-21", "description": "Excellent cucumber mint lemonade, awesome vegetarian chili and the turkey blt mmmmmmm.... will retufn", "author": "Paul D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-05-19", "description": "If you want to get something to go, or need to get in and get out, this place is longer than In n outs drive thru. You say to yourself, let me grab something quick to eat at my desk, or i only have 20 mins on the meter that should be enough, wrong. They need to streamline the ordering process. You walk to the door and the line starts there. There is one person to help out with the items. If the person ordering decides to sample 5 items, you wait and wait and wait. Please make it easier to order your stuff to go. It should not take 1/2 hour to get brussel sprouts & an order of beets to go.", "author": "Pug P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-07-14", "description": "Arrived late about an hour before closing.  Out of sandwiches and food looked old. Lost my appetite.", "author": "jennifer m."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-07-28", "description": "I use to go here for lunch. I work in the area and I stopped going because it got old and cost to much for the quality of food and service. but I thought to try it again. I paid for my sandwitch and said Ill be right back to pick it up. I came back and waited over 20 min while people were getting their lunch that came after me. they did nothing to help even when I said how long ive been waiting. they offered me a lemonade I said no thanks I'm not trying to get free stuff just good service. wont be going back.", "author": "Travis S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-12-11", "description": "My first time at Lemonade and my experience was fine. It's just that there was nothing I ate that really blew me away and the prices are a little bit high.  I didn't mind the cafeteria style, but I can't say I'm a big fan of chain restaurants.  The Citrus Poached Salmon was well cooked, served cold and had good flavor.  The White Truffle Mac N Cheese was exactly what you'd expect, good, but nothing unique. The best part of my meal was the New Mexican Chili Roasted Butternut Squash, very flavorful and the most inexpensive thing on my plate.  \nI opted to get the sugar-free Pomegranate Tarragon Lemonade, my strong advice, opt for the sweetened version. The staff was obviously new, very friendly, but over-eager considering all the choices to ponder.  \nYou can get samples of anything, but there's no place for you to put your dirty sample cup when you're done. So you have to leave it on your tray. It's a little awkward. \nOverall give it a marginal thumbs up, yet not someplace I'd enthusiastically recommend. I might go back to try a couple of the salads, since that's what people seem to be getting,  but in no rush.", "author": "Gary B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-26", "description": "I live very close to west portal and see this place all the time when I'm on the Muni and have been meaning to check it out. Finally got the chance to when my mom came to visit. The first thing we noticed was that there where A LOT of options, almost over whelming. The second thing, was the menu was not clear at all of how the place worked. By having the images of the food, it seemed like that's what you could order and everything else was sides.. but once we figured out how it worked it help. I was VERY surprised how many gluten free options they had! Which was great for me, since I'm trying to cut back on the gluten due to health. They are also vey generous in their portions. Overall, mom and I enjoyed our experience and the food.", "author": "Nikki H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-12-01", "description": "I ordered from their website for pickup since i was nearby. It was on a weekday before noon. It was my first time here.  It was clean, spacious with lots of tables & chairs and all organized in a cafeteria style like everyone posts.  The employees were all courteous and the order was on time. I expected to love their texas brisket but the size was pretty small-it was tasty but small for $8.  Their truffle oil mac n cheese was tasty & creamy and a good enough portion so no complaints.  I'm not a fan of overly sweetened drinks so their lemonade was way too sweet for me.  I have to say what blew my mind was their coconut cake-  the cake layers weren't just ordinairy sponge or regular cake layers.  Instead, all the cake layers were mixed with coconut so along with the coconut frosting, it really woke you up! It was very sweet but for a dessert, i don't mind it sweet.  I wanted to give it at least a 4 stars, but it doesn't pass my \"price to value\" score.  Of course, it's the pricey West Portal, but Calibur, Submarine Center, and Burrito Loco are less than half a block away and yet I view them as scoring higher.  It's hit or miss depending on what you order here.  When i come back in the future, i'll update.", "author": "Frugal C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-05-18", "description": "My plate literally only came with 5 pieces of tuna poke. Is that the usual serving size?", "author": "Priscilla T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-07", "description": "We went here for neighborhood preview day and loved it! West Portal has desperately needed a good salad place and this fits the bill.  It is cafeteria style and broken into sections (salads, grill, sandwiches, soups etc.) so you can pick and choose what you would like.  The food was fresh and varied. I had a butternut squash salad, hearts of palm salad and a salmon/avocado dish.  They were all excellent, as was the regular lemonade (fittingly).  I will definitely be going back.", "author": "Johanna W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-10-23", "description": "Lemonade has tasty dishes, but the price point is a little outrageous. I paid $7.50 for three Thai meatballs. My husband had the smallest poke bowl I've ever seen for $11.50. Really?! Tiny tiny tiny. I'm so disappointed.", "author": "Carol C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-04", "description": "I absolutely love this place, so I'm glad it finally made its way to SF. I like that everything is a la carte, so you can customize your own meal. This place is the perfect healthy lunch spot. I highly recommend ordering the shredded brussel sprouts, butternut squash, and seared ahi tuna. My absolute favorite thing from Lemonade is the watermelon rosemary lemonade.", "author": "Kyle S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-01-06", "description": "The place has been packed since they opened, food is good but some things bothered me: placing the silverware at the cashier is annoying because people keep getting in your way when they come back to get the silverware they forgot after they checked out. These things should be placed on the side. The sugar free watermelon rosemary drink was undrinkable, didn't taste good. Recommend watermelon mint instead. The last thing is that the yellow entrance doors are too heavy, and make carrying a tray difficult.", "author": "Domenique B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-17", "description": "Spontaneously popped in when I was trying to find a different restaurant this afternoon. Their food is fresh and innovative. I really liked their tuna poke and blood orange lemonade. It was a full house when I arrived and the line was nonstop while I ate.", "author": "Vivian L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-09-30", "description": "I ordered a Roasted Turkey BLT sandwich but when I got home, I was given another sandwhich and the place wasn't even crowded. Terrible.", "author": "Justin L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-03-03", "description": "I was so excited to try Lemonade since I love it in socal but it's just not the same up here. Everything just seems...soggy? I do give them props for keeping the prices relatively similar to the ones in LA but it feels like they sacrificed on something in the process. You can get a better $20 lunch elsewhere", "author": "Amanda B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-07", "description": "Had a really nice experience at Lemonade yesterday. Ordered one of the Poke Bowls with spicy tuna, yum. Great balance in flavors, average price, but worth ordering. Staff was friendly and helpful. Was greeted at the door by the manager and was given a nice walk through about how the process works, as it can seem like a lot to take in initially. Seating area inside was comfortable and cozy. Clean store, great service, and great food. I'll be back", "author": "Karla R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-03-01", "description": "The staff work hard. But come early as they have very little near closing. The salads are attractive but highly over salted. \nIt's good for a snack and the variety of lemonade's served are quite good. \nOtherwise, it's fair. Certainly miss the bakery that had been in the same space.", "author": "Phil B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-06-20", "description": "WARNING! Looks can be deceiving!! I've been wanting to try this place since it opened but avoided due to the long lines on the weekends. Finally had a chance to come on a Monday for lunch. Super SLOOOOOW to serve, given there was no line and only a handful of people. What was worse was the amount of SALT in the food! I had a scoop of the Red Quinoa & Fuji Apple, Snap Peas & Edamame and the Ahi Tuna & Avocado Poke. You'd think these would be light, and refreshing to eat because they look really good. The edamame was just ok, but the quinoa and the poke were the worse! OMG!! I think they dumped a cup of salt into each... do they even taste before putting the food out? Whoever's in the kitchen doing food prep has some F'd up taste buds! I couldn't finish eating it and dumped it. In hindsight, I should've taken it back and complained, so now I'm here writing this review. And I know I'm not the only Yelper with similar thoughts about the salt being used here. If you like eating a salt lick, this place is for you.  The peach ginger lemonade was the only thing I liked. Not sure I'll be eating here again. If I do, I'll ask for a taste first!", "author": "Betty L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-01-06", "description": "We have eaten there several times. The staff is super nice. Food was good but concerned about the temperature of hot entrees. The were luke warm at best. Not hot enough to kill bacteria. I took temp of food when I arrived home with thermo pen which is pretty accurate. Temp was 98 to 102 Too low for health dept even with time of transport home. Hope they address! Also last time I ate there I had salad. It tasted good but several bites were sandy and gritty. Disappointed", "author": "J J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-01-19", "description": "Overpriced for what it is, but convenient. The little vegan options are pretty bland and I often stand there wondering why I didn't just make this stuff at home. They also wrap their sandwiches in a way that they come undone when you open them and get all over the place. The lemonade is tasty and I won't want to know how much sugar is in them!", "author": "Bella S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-12-20", "description": "I have no idea what all the hype is about. The food is slightly above average, at best. And way overpriced for what you get.", "author": "AsianMom S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-03-02", "description": "Lemonade is one of my favorite spots but westportal was definitely a big fail. Whenever i go to the burlingame and yerba buena location the sandwiches are perfect. I ordered the tomato mozarella sandwhich and they not only forgot the olives it usually comes with and gives it flavor but it just looked sad. Big fail and very frustrating.", "author": "Laura E."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-02-12", "description": "Tasty, quality is here, little portion (so different than usual american portion) ...  but really pricey for a family experience at a self service restaurant.", "author": "Frederique C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-01-29", "description": "Food was four stars but my biggest issue was the really poor customer service. It took far too long to get some chicken with a couple of sides. The staff seemed only interested in their own social conversations rather than doing their job. (The one exception was the lady clearing the tables. She was working hard and was really nice.)\n\n Warning... it was also crowded, loud and somewhat claustrophobic. I'll probably go during the week when it's not so crazy.", "author": "David W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-05-11", "description": "Over priced, disgusting food. Over cooked noodles all soggy. Salmon was NASTYYY me and my friend both got it and took 2 bites. We couldn't even finish it.", "author": "Kyra D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-06-28", "description": "Another update: I was told I would get my comp meal certificate in the mail and it never came. \n\nUPDATE: management has contacted me to assure me that will investigate and has offered to comp my next meal! Glad to see that customer service is a priority for them!\n\nGot there when they first opened at 11 with two young kids, the woman was rude from the moment we walked in. I asked to for a sandwich, she said it was going to take longer because the sandwich maker was still making the display sandwiches...? I said fine and then proceeded to pay for what I thought was my sandwich and two grilled cheeses for the kids. Each grilled cheese was $10 and didn't come with a side! The kids sandwiches came out but not mine. I told the woman that I was still waiting on my sandwich so she should leave the number. She came back 5 min later and picked up the number. 10 minutes later, the kids had finished their lunches and I still had not gotten my sandwich. I asked the woman where it was and she said she never put my order in. She then said she would have them make it now but that I didn't pay earlier for my sandwich so I needed to pay now. I get that she made a mistake by not putting in my order and I was pretty understanding of that but then to charge me after her mistake. She then said \"Sorry, it's been a slow morning.\" That's just bad customer service.", "author": "Bella T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-04-10", "description": "I went to Lemonade today and everything I tasted was delicious. But I noticed everything was a bit on the salty side. I ordered the salmon and avocado, chicken and cranberries, and brussel sprouts salad. As I was eating the brussel sprouts salad I had to spit it out of my mouth because there was a couple of hairs in the the salad. That completely grossed me out, so I threw everything away. I won't be going back there any time soon. I was very disappointed.", "author": "Deborah A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-04-11", "description": "I have to agree with other reviewers that the food is incredibly salty, which is definitely not in keeping with 'California cuisine.' Honestly, all three things I had today were oversalted and lacking in other flavors: kimchi soba noodles, arugula/apples and kale/kumquat salad. They need to retrain their line chefs on how much salt should be put in the recipes, because it makes the food hard to eat.", "author": "Mari W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-12", "description": "Severs were knowledgeable and friendly, made great recommendations as to what was most popular and what people seemed to like most. Accommodating in giving samples to try out and taste. Loved the blood orange lemonade here!", "author": "Candy L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-03-20", "description": "Love the decor and the cafeteria style serving, but HATE the food. It tastes bland and plasticky. They have these giant sandwiches on display for $9, but what they give you is literally half the size. Not sure how they can get away with the false advertising, but it shows you what kind of company this is. One great thing here though, the giant macaroons! They got those right. I really want to like this place, but after trying locations in LA and SF with the same experience, I won't be going to lemonade again.", "author": "M J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-19", "description": "This specific lemonade location has THE best customer service I have ever experienced. I really enjoy their food and especially their lemonade. It is a bit on the expensive side, but worth it. I would like to note this specific incident where this rude gentleman throws food at an employee because he thought they were ignoring him. In reality, it was a lunch rush and there was about 4 workers trying to serve about 25 people. The staff handled the situation EXTREMELY well and made sure the people around were okay when the rude gentleman through food at the ground. I also saw one of the workers helping out a handicapped man. She also took the time to make sure he was suffice. All in all, I enjoy this place because of the food and the GREAT customer service.", "author": "Rachel B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-02-16", "description": "I went for my first (& only) time the other day.  Plenty of hype so I wanted to check it out.  The food is OK, the service subpar & the price point pretty steep for what you get PLUS it is cafeteria style.  Plenty of better spots on West Portal.  I won't be back.", "author": "Joe D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-19", "description": "Amazing food! Everything tasted very fresh and there were lots of options for gluten-free and vegan folks. The flavors were inventive and interesting. This is not your average lunch spot", "author": "Ashley B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-23", "description": "I bought dinner for 4 of us---one is a vegetarian.  I needed some guidance since I was new to the place.  The young man at the first station was very cordial and helpful.  The food is delicious.  I bought the sesame lo mein noodles, the shaved brussel sprouts, the bar-b-que brisket, the chili lime chicken and truffle mac and cheese.  Everything was delicious, especially the bar-b-que brisket.  I will definitely go back. I'll try one of the lemonades on my next visit.", "author": "Andrea P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-20", "description": "Just opened, I went on the first day. It was fine but there was a big line. Some people cut the line and it was very loud. Food was pretty good and the Lemonade was excellent. Cost a lot for what it is but otherwise good", "author": "Izzy S."}
