{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-16", "description": "This restaurant is conveniently located in the JW Marriott in San Francisco. The menu is brief but had enough variety to find something you would enjoy. We were staying in the hotel so we enjoyed both dinner and breakfast at this restaurant . The restaurant staff were all very friendly. We had plans in the evening and service was quick , breakfast was leisurely and we were not rushed. The menu is pricey but the portions are big. The food was great. My favorite was the Brussels sprouts appetizer. After an evening out , I passed by the restaurant going back to room and the waitress remembered my name and wished me a pleasant evening , nice touch!!", "author": "Michelle D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-24", "description": "REVIEWER #189\n\nWell dang! Did I feel fancy up in this G-thang! \n\nLevel III has it goin' on! Everything from the sexy JW Marriott hotel, to the friendly staff members, oh-let's not forget about the sexy chandeliers once you step out the 3rd floor! Whoo! At least come here to check out the décor and ambiance-you will be just as amazed as I was! \n\nLevel III is located in beautiful San Francisco's Union Square-JW Marriott hotel. The restaurant is a little pricey then the norm, but it's because you are paying for the location (nothing in D/T Union Square is cheap!). \n\nThe bar area is a great place to sit and relax (chat with the bartenders). They also have seating areas in the restaurant and areas to sit around the restaurant that consist of outlets to charge your electronics (sweet)! Some friends and I decided to get together here to enjoy a couple drinks and I was shocked at how cute this place was! The hotel itself is gorgeous and impressive, but the bar is a MUST! \n\nI hear there burgers here are delicious, wait-lemme not forget about their well-known Mac and Cheese!! I'm still wondering why I didn't order that dish! However, I ordered the Truffle Fries and dived right into a Lemon Drop and they both did not disappoint. I appreciated that the menu was short and simple, but at the same time offered a little bit of everything you want. \nHappy hour!! Don't we all love happy hour deals? Well, Level III has half price off their 3 signature cocktails, red and white wine. Hours are from 4PM-7PM Monday-Friday! \n\nDid I mention they have a wonder wine list! Yess, honey! The wine itself is enough for me to keep coming back. During the weekends, they offer a wonderful l JW Buffet which consists of a lovely health y breakfast and a create-your-own omelet from 6:30AM-11AM. Lunch and Dinner is served from 11AM-11PM.", "author": "Porsche C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-02", "description": "Wow: had room service at JW Marriott, and this meal was the best part of my stay.\nFrom the gem chop salad  with impeccably sliced avocados , to the juicy steak frites, to the delicious creme brûlée with the perfect amount of crispy sugar on top, everything was prepared perfectly!", "author": "Allie C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-09-29", "description": "Our waitress was not very attentive and did not know the menu or what was available. The manager seemed to recognize this and came over to get us drinks after we sat for 5 minutes without drinks. The food was pretty good. My husbands steak and eggs was very good. I would say it's a good place to eat if you are staying in the hotel, but I would not travel out of the way to go there. FYI- The restaurant is open to the lobby of the Marriott. The lobby is pretty.", "author": "Amber S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-19", "description": "Since it's inside the JW I already expected nothing but the best. Expectations definitely met. Good food. Great service. Couldn't ask for more", "author": "Michelle T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-26", "description": "Very very good!! We came in late and STILL received excellent service. Never felt rushed. I was pleasantly surprised at the creative twist the chef placed on common meals. The bread they bring before your meal was delicious. I really enjoyed the open atmosphere of the bar area and the intimacy of the restaurant itself. If this is a romantic dinner you can snug up in a corner booth. Also had breakfast and it was equally great. Prices typical of San Fran downtown area. See my pics :)", "author": "Jenna M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-22", "description": "I want to say the host Scott and his waiting staff are absolutely amazing. Best eggs Benedict I've had in a long long time. I give the dining experience 5*. Can't thank Scott enough.", "author": "Robert M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-01-05", "description": "Unfortunately, didn't even order. Menu was filthy and had food on it when it was brought to us. Staff didn't even appear aware of very much. \n\nI don't like giving a poor review especially when we didn't make it to ordering. The food maybe alright as well as the staff but, we were turned off before even making it that far.", "author": "J B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-31", "description": "Well the Kettle one lemon drops are amazing.  Not cheap, but damn good.  \n\nThe trio of desserts is mediocre at best, but when you need sugar and don't want to leave the comfort of your your hotel, it'll do.\n\nThe table service is pretty bad...one woman for the entire lobby, but the service at the bar was great, as long as you don't mind waiting for your order.", "author": "Lucky S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-03", "description": "This was a pleasant surprise, we spent a weekend at the jw marriot in union square and decided one night to try the hotels restaurant that being level 3. The food was amazing and the service even better. Make sure Samia is working because she was just the best! I wouldn't say its the cheapest meal around but for the area and the quality of food I definitely felt I had gotten a good value. No matter how full you get you MUST try the creme Brule it just may be the best thing I have ever eaten.", "author": "Ryan B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-09", "description": "My wife, 3 year old son, and coworkers had dinner here tonight.  The food was excellent and the service was great, which is enough to bring us back, but a personal gesture by the hostess set this experience apart.  The hostess noted that my son likes trains and gave him a cable car toy to keep.  \n\nThe atmosphere at the restaurant is classy, a little more so than I usually see at hotel restaurants.  I ordered the artisan grilled cheese, my wife ordered the turkey club, my coworkers ordered the filet mignon and grass-fed burger.  We all enjoyed our food and the toasted marshmallow/peanut butter/banana dessert that came after.  Again, the food and service was enough to bring us back, the personal touch is what we've come to expect from Marriott.", "author": "Jonathan K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-05", "description": "We went in on the 4th of July holiday around 6 and the place was dead. I was a little worried based on that and the reviews but the food and service was great. The server was very warm, friendly, knowledge of the menu and accommodating. Might be considered pricy but relative to the area. Great kids menu with different options. I would definitely recommend it!", "author": "Katie H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-05-16", "description": "I was not a fan. Had some service issues with the staff. So not impressed at at. Will not be coming back. To much attitude from them.", "author": "Joe M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-29", "description": "My family and I had a great experience here. We told them that we had a flight to catch and they were very accommodating and brought out our food as soon as each plate was made. They also brought out a small Greek yogurt dish as a complimentary appetizer before our food came out. Every plate I tried was fresh and tasty. I recommend the following lunch items: brussel sprouts, kale salad, pumpkin ravioli. \nWe had made reservations but the restaurant was quiet and empty. Only one thing is that we couldn't find our waiter in sight to order our food and had to get up and find him. I found this odd since we were one of the few parties at the restaurant.", "author": "Monica S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-25", "description": "Went here for Christmas pre fixe menu and everything was tasty but the star of the show was the Marrow crusted short Rib! It was delicious! Best I've eaten ever. My family had a great dinner, the wait staff was attentive and the wine selection was nice. Will definitely come back next time I'm in San Francisco!", "author": "Kamila P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-06-24", "description": "I was staying at the JW Marriott and after a long day of sightseeing, I decided to have a late lunch and a cocktail. I sat down at the end of the bar because I just wanted to relax and there was a crowd near the middle. I ordered a drink with tequila, grapefruit, and maraschino liqueur. Unfortunately for me, there were no prices listed and shame, shame I should have known better. I drank 2 and they were $14 a pop. \n\nI got the fish tacos which were certainly not an entrée portion. There were three tacos. They had seasoned fish, onions, and crème fraiche in corn tortillas. They came with a side of guacamole and salsa. They were pretty good but nothing spectacular, however they set me back another $20. So all in all, drinks, food, mandatory tax, and tip, it cost me over $60 to have lunch. It was most certainly not worth $60.", "author": "Megan K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-03-31", "description": "Not very bad at all! We came to get dinner before watching wicked (amazing show) and I'm glad we came early. We arrived around 5:30 to a relatively empty restaurant (alarming at first) and got settled in. Here's the breakdown: \n\n-cheese tray: omg get it! Delicious mix of cheese, breads, fruit, crackers, etc\n-roasted chicken dish: it was just ok, chicken could've used more flavor and risotto that came with it was just kind of whatever. \n- side dishes: asparagus was very good, but the Mac and cheese was disappointing. After a few bites it tasted similar to something from a freezer. The purple potatoes.. Delicious! Probably one of the best dishes we ordered. Definitely get it! \n- dessert: we ordered the sampler which was 3 small desserts and it was just the right size; however, the desserts themselves were just ok. \n\nThe service was very good, our server was helpful and attentive. The restaurant itself is nicely setup and offers a good view of the city. Definitely recommended if you're looking for a nice dinner in SF!", "author": "S. P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-05-25", "description": "Well.....if you've read the reviews from Hannah C. and Bobby L. my review of Level III will pretty much be very similar since I was part of that lunch group.  We were looking for a restaurant to have for lunch during Dine About Town and I decided to go with Level III since I was really impressed with their food when they held a Yelp Elite Event there a few weeks earlier.\n\nWe were so excited because we read on their DAT menu that they would have Ribeye Steak there for $17.95.  BUT, when the waiter came to take our order, the first thing he tells us is that \"We don't have Ribeye, only NY Steak.  It's Better.  You'll like it.\"  They pulled the old 'Bait and Switch' tactic on us!!!  So yeah, we settled for the NY Steak since the waiter claims \"It's Better\" than Ribeye.  Uh huh, yeah sure.\n\n1st course - Endive Salad\n(http://www.yelp.com/biz_photos/qxQ2OSOZgruD0q2QI2WeKA?select=kZJ0nMT9rjS2gYS3rVmLrw)\nWhile it looks pretty, I didn't really care too much for this salad.  Probably because I was still feeling bitter that they didn't have any Ribeye.\n\nMain Course - Ribeye....Oops, I meant NY Steak and Garlic Fries\n(http://www.yelp.com/biz_photos/qxQ2OSOZgruD0q2QI2WeKA?select=e9K3qyq8oJB0ozHv4snIFQ)\nThe NY Steak wasn't too bad.  It was cooked fine and medium rare as I requested.  But it definitely wasn't \"Better\" than a Ribeye steak.  And the Garlic Fries were just okay.\n\nThe real kicker was what happened with Hannah C.'s order.  We both ordered our steaks medium rare, yet when they brought them out, mine was fine, but her's was well done to a crisp.  How the cook messed that up is a mystery.  When we told the waiter about it, he said that the \"order confused the cook\" which is didn't make sense since we both ordered our steaks medium rare.  Well, eventually they fired up another steak for Hannah and it was medium rare.\n\nTo shed some light, despite all the mishaps, we kind of found this dining experience to be indirectly entertaining.  We probably won't dine here again for DAT.  If you do consider going here for Dine About Town, take extreme caution as you'll probably get something different than what's advertised.", "author": "Rodney H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-11-21", "description": "Pulled into the whole holiday spirit, we decided to hit up the hotel bar, get a little festive and order a nice little strong cocktail. As I ordered a Maker's Mark Manhattan from the bartender he asked me \"Sweet\" or \"Spicy\"?\n\nUmmm, always spicy. He adds some Ancho Chile powder to my Manhattan and slips me the bill - $16. One drink, sixteen dollars? Wow, it was good but not that good. I've had better Manhattans with better bourbon than that. \n\nAlthough the cocktail was delicious, it really didn't make me want to stick around for another one. Off to another place instead.", "author": "Rebekah T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-17", "description": "\"The quality of food is in inverse proportion to a dining room's altitude, especially atop bank and hotel buildings (airplanes are an extreme example).\"-Bryan Miller\n\nMaybe Bryan Millers words are true because all the Marriott's/Ritz Carlton lounges I've been going to, are on the ground floor or as in the case of Level III, it's located on (this makes sense right?) the third floor.  Also the higher up a dining room's altitude, the higher the prices get.\n\nAs of late, I've ended up at Marriott hotels and it's partner company Ritz Carlton, eating at their restaurants/lounges.  And I'm realizing these hotels have a really nice chic atmosphere, good food, service, and comparatively reasonable prices.  \n\nArriving on the third floor via Marriott's cool elevators, I loved how the bar area looked.   Contemporary all white upholstered benches, stools, tables laid out nice for chillaxin, and comfortable booth areas overlooking the City.\n\nThe menu looked great with entrees like filet mignon, oysters, sliders, sea bass, and Mac & Cheese.  I ordered a couple beers at the bar and socialized with my friends.\n\nSince I came during a Yelp event I was able to sample a few items from the menu:\n\nKobe Beef Sliders:  very tasty, cooked to medium, with fresh toasted slider buns.  No better social finger food than sliders except maybe buffalo wings..\n\nMac & Cheese:  it was ok, it's hard with all the competition out there making this cherished comfort food.\n\nI also had good desserts and of course the cause and solution to all of mankind's problems: alcohol.\n\nSo in my Level 3 voice... Here's a clip of my Level 6 voice:  \nhttp://www.youtube.com/watch?v=snmUrzdMRFQ&feature=youtube_gdata_player\n\nLevel III lounge is a great place to socialize even if you aren't staying at the Marriott.  BTW, you DON'T want to see me go to 10!!!", "author": "Michael L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-04", "description": "Had an amazing time for brunch here. The elevator was a but confusing, but given the name...everything panned out (you'll get it when you go)\n\nLocated inside JW Marriott on he 3rd Floor. \n\nHad the most amazing table by the window on a sunny bright day. Donna was our server and she was very attentive.  \n\nOrdered the Salmon with roasted vegetables. Slow cooked and MR for the win! \n\nThere was a conference going on , but they were able to put up set sounds walls to keep the setting still intimate. \n\nThe decor and ambiance alone was enough for me to come back. This time for a night cap.", "author": "David D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-02-10", "description": "Believe the reviews about the Mac and cheese. So true! On par for a hotel's signature eatery , very pricey and high brow service. However the food was fab and the drinks did not disappoint. Über bright in the dinning area. \n\nFaves: lobster mac and cheese, crispy pork belly", "author": "Christina L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-31", "description": "We enjoyed happy hour here. They have a couple of flat screen TVs for sports. Our server was quick to serve us and very friendly but professional. We enjoyed two apps- edamame with sesame and togarashi as well as pita with hummus and eggplant. Both were very nice. Especially liked the seasonings on the edamame!  Yum. \nThey had a decent selection of happy hr drinks, though after the server let us taste the house Chardonnay we went with a non-happy hr wine. \nEnjoyed our time here!", "author": "Dale H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-01-11", "description": "Don't go to the @JPMarriott in #SF. They charged me $80 to reserve a table because of the JP Morgan Healthcare Conference - just for drinks!", "author": "David L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-08", "description": "Four-course prix fixe dinner was beautifully prepared, deliciously consumed, and elegantly served. Some memorable notes were that they waived the corkage fee to accommodate the four vintages we thoughtfully selected for the occasion, and the parking too (!). Recommendation for patrons is to share with your wait staff-they work hard to keep your drinks flowing and your conversations going. Also, take a moment to appreciate what you have and celebrate your life as you have lived it. Thank you Level 3!", "author": "utterly i."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-18", "description": "Came here for a quick bite the other day and ordered fish tacos. The fish was pan-seared halibut. There were three tacos in the order, with generous portions of halibut.", "author": "christina diem p."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-01-17", "description": "Where do I begin.... false advertisement (NO RIBEYE on DAT menu) or a clueless waiter with an attitude. \n\nQuite an interesting experience and was very much service related.\n\nWe were super excited to try the ribeye on the Dine About Town lunch menu.  When it came time to order, the waiter said no ribeye but there's NY steak and \"New York steak is better than ribeye\".  Are you for real???  **This just cracked us up.   \n\nDisappointed and caught off guard, a friend took an extra minute to decide on the order.  During this time, the waiter impatiently said \"There really aren't many choices on the menu to decide.  Either one or the other\".  MMMM ATTITUDE!!!\n\nSo let's talk food.  Among the 3 of us, we were able to sample all choices from the menu:  seafood chowder, endive watercress salad, pan roasted chicken breast, and the infamous \"better-than-ribeye\" NY steak. \n\nThe endive salad with julienne fuji apple, candied walnuts, and blue cheese was refreshing (http://www.yelp.com/biz_photos/qxQ2OSOZgruD0q2QI2WeKA?select=F__a4h37qLFJobBlX5rMcw). \n\nThe seafood chowders with clams, scallops, and crab meat also had chunks of potatoes and carrots.  It was creamy and pretty good.  (http://www.yelp.com/biz_photos/qxQ2OSOZgruD0q2QI2WeKA?select=g2vak9m0xNU9Wml3BPtsoQ).  \n\nThe chicken breast with maitake mushroom & roasted tomato risotto. Chicken was ok but the risotto wasn't good. It tasted like canned tomatoes were added.   (http://www.yelp.com/biz_photos/qxQ2OSOZgruD0q2QI2WeKA?select=sDPDav85ceJ9jIASfSfEAg) \n\nBack to the waiter.  Two of us ordered medium rare steaks but I happened to be the unlucky person to send back the well done steak and wilted fries.  When I told the waiter, he accused my friend for having mistakenly eaten my steak.  He also came back to tell me that the chef was confused if I wanted my steak more or less cooked. Haha really?  Can we say confusion!!!  He did return later with a medium rare steak.  The fries were definitely better when they were crispy.  (http://www.yelp.com/biz_photos/qxQ2OSOZgruD0q2QI2WeKA?select=9sub3qrAT_w7r-ueS-1_iQ)\n\nOur waiter was pretty clueless.  He never stop by to check if we needed anything.  Keep in mind the restaurant wasn't busy. He also didn't know how to split the bill on 2 separate credit cards and that we would have to wait for him to figure it out. Afraid of having to wait for 30 minutes, we put the entire bill onto one card.  Sigh.", "author": "Hannah C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-01-17", "description": "This place is unforgettable!  \n\nHighlights include...\n\n-Nice modern decor and ambiance.\n\n-Waiter telling us that the ribeye (featured on the DAT lunch menu) is not available and that NY steak is better anyways.  \n\n-Spotty service with a hint of attitude.  Our waiter and the chef were \"confused?\" (we know what medium rare is!)\n\n-The Seafood Chowder....best part of my entire meal.  I've had better Risotto.  Chicken was okay, like all other chicken dishes served at hotel receptions.  Maitake mushrooms...I wish I had more.  \n\n-GARLIC FRIES took my attention away from the NY steak.  And no Mr. waiter, It wasn't better than any ribeye I've had.  \n\n--------------------------------------------------------\n\nSolid 2 stars.  Unfortunately, my Dine About Town experience here wasn't a very positive one.", "author": "Bobby L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-10-13", "description": "Since we were staying at the Marriott and the Giants game was on (they had not lost the season  yet) we decided to have cocktails and food at the Level III bar.  First off, the bartender was so unhappy working, while a team \"he does not like\" is playing on the TV made it quite uncomfortable for the guests enjoying the game.  Since the game went into 13 innings and the bar closed at 11, he turned off all the lights and left us in the dark to watch the game and finish our drinks.  Talk about RUDE. We had the cheese plate, which was actually ok.  But the service made the experience unpleasant.  Won't be back - overpriced as well", "author": "Deb U."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-08-21", "description": "I've tried this place at least 3 times.  The name suits this place because the food deserves a level 3 out of 5.  Nothing is special here and everything is expensive because it is at the JW Marriott.  I can't remember much from my meals except that it wasn't memorable.\n\nService is friendly and helpful.  The decor and ambiance is well lit and comfortable with booths and tables.  Parking can be tough on the street unless you use valet service at the hotel or want to pay for a local garage.", "author": "Jenny L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-03-12", "description": "SF's Dine About Town really serves two purposes:\n\n1) To be able to sample a prix fixed menu at nice restaurants for an affordable price in the hopes of coming back\n\n2) To be able to sample a prix fixed menu at nice restaurants for an affordable price so that you wouldn't come back and spend more on the regular menu\n\nUnfortunately, Level III falls into category 2.\n\nI'll admit, the decor can be interpreted as maybe artistic, stylish even, but that novelty soon wears off, especially once you start eating.  I can see this place being known more for its happy hours than dinners.\n\nThe attempt at the cream of brocolli soup was noble, but clearly fell short of anything remarkable or noteworthy.  The pepper crusted petit filet mignon was a bit tough and chewy and cooked rather poorly.  Perhaps the meat was just too old.\n\nWhat was even more interesting was the mac & cheese croquette.  I had heard the regular mac & cheese was good, so I had higher expectations than to bite into a hardened brick of stale out-of-the-blue-box thing.\n\nAs if dessert couldn't come quick enough, the old fashioned chocolate cake was pretty rich and smooth, but so are the ones at Costco.\n\nBesides the food and the mediocre service, I spent more time observing the artwork and decor, especially the grand red chandeliers and the interesting statue of what seem to be figurines dancing in a circle.\n\nIf I do come back, it'll probably be to grab a quick drink for happy hour or after getting stamped at Ruby Skye.", "author": "Tony L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-02", "description": "Not bad for a hotel restaurant. We ate here after shopping in Union Square. If you get a table by the window, it's fun to look below upon all the pedestrians. The food was generally good with my watercress soup being one of the best soups I ever had, not too salty as usually soups are from restaurants. The service was polite also, and we got the added treat of voting for the best gingerbread house in the foyer. There were about 5 amazing ones, one of them being the head chef's, the other 4 culinary students.", "author": "Makelina T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-20", "description": "We stayed for a staycation and decided to bring some alcohol with us to the hotel room. However, the person that did not have to come from work (not me) forgot to pack a knife to cut the limes. Therefore we headed down to the hotel bar to grab a knife and instead ended up hanging out with the bartender and drinking a couple of drinks. \n\nFirst we sat at the bar and ordered two drinks off the menu. Definitely delicious. One was like a strawberry mojito, and the other a lemon drop almost. The guy ended up chatting up the bartender and manager at the bar. We tried some interesting drinks - some raspberry liquor that was actually pretty good, some apple whiskey or something that was just way too strong for me, and a root beer type whiskey. I liked the drinks that we bought better, but it was definitely interesting to try something new. \n\nI had a great time at the bar and would definitely go back and try some of the food there. Great place to drink and hang out.", "author": "Nina Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-05-08", "description": "The service was excellent, the drink was yummy (had the \"Spring Fling\" which was jalapeño infused vodka with elderflower) and the food was tasty - started with the ahi which was ok. A bit unimaginative, just the basic ahi with mango in a sesame soy sauce. The Bison however, was delightful. Cooked perfectly, tender and yummmmmmy.", "author": "Allie P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-11", "description": "On a rare occasion would you find me hanging out with my girlfriends having Happy Hour bc well with a full work schedule and kids to tend to, it never happens but then again never say never..\n\nI'm a newbie when it comes to happy hour but my my girlfriend works in the neighborhood so she knows the hotspots for HH and so she decided this spot. **Level III is on level 3 on the Marriott Hotel**\n\nWhen we first stepped out of the elevator and onto the 3rd floor we started searching for the best seats available and so our waiter Jeremy came to our rescue. He escorted us to our seats, handed us our menus and attentively checked in with us. He was great with helping us pick out which items were the tastiest on the menus and which cocktails were the BEST and most importantly he did it all with a GREAT smile! *Like I've mentioned in my reviews countless times, smiles are deal breakers for me and it can turn any grumpy person into a happy one :)\n\nAnywho.. we ended up ordering the sliders *A must have!! Comes with two so it's perfect to share. My thanks to the chef bc these sliders were awesomely tender, juicy patties, warm melted cheese that was foodsgasmic in your mouth after every bite!! Another appetizer we decided on was the chips and salsa. *Hey we were having cocktails and needed something quick to soak up the alcohol before we headed to our next spot. Never before had I seen tortilla chips so perfectly made. The prettiness of these chips matched the hotel itself and I couldn't tell you how much I LOVE their guacamole dip over their salsa dip. I'm usually a salsa person but on this day it was all about their guacamole!! \n\nNow what kind of cocktails were making us laugh and get all giggly you might ask..  My girlfriend ordered the Pomegranite Martini *I believe she was buzzing after the first couple of sips. LOL. It was an absolute great pick for drinkers like us!* I on the other hand decided to go with the Lemon Drop. *This drink will definitely have you relaxing and dropping in your seat after the second sip. I'm a newbie when it comes to cocktails but I'm a pro when it comes to taking Ms.Henny to the face, funny isn't it?* \n\nA cozy lounge to kick back and relax. You can have a seat at the bar, dine in at their tables or even hop onto their comfy couches while watching your favorite sport channel. My absolute favorite hot spot for HH :)", "author": "Anonymous P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-12-12", "description": "The engineering lead on my team, who had done such a great job, deserved to have a little celebratory lunch to say thank you. I looked around on OpenTable to see what was available. Not much. I called some places. Everything was booked. So I went with the highest rated, nearest place on OpenTable. I went with Level III. What a mistake. We should have ordered a pizza. Let me paint you a picture. This is in real time. I am sitting here with my team. The server is trying his best. He really is. None of this is his fault. He is friendly enough. But he is all by himself. Marooned in the lies of yelp reviews provided by the mechanical turk. My colleague, Ryan, just got his arugula salad. It looks very tired. At least we got our drinks, which were steeped for 15 minutes in benign neglect. My diet coke reminds me of the seldom cleaned soda gun I wielded circa 1989 in a rural Vermont bowling alley.  The ambience is 100% Marriott. That's where Level 3 is located. We are in a hotel. The rug. The tables. The lighting. The music. I am celebrating my team mate's professional achievements in a hotel lobby. Oh. Here is our food! (45 minutes later with an empty restaurant).\n\nMy french fries are a little soggy. My burger is \"fine\" but it costs $16.00.\n\nI am sorry Rob. You deserved so much better.", "author": "Matthew R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-12-24", "description": "I really enjoyed my sliders and my wine! I don't really think this place deserves more than 3 stars, if we could have got a seat by he fireplace I might give it more stars! Plus your in San Francisco get out of the hotel and explore!", "author": "Holly G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-07-07", "description": "Rarely when I am in a city do I eat at a hotel restaurant. After all- there are tons of other places where i can eat. But during my recent trip to the Bay area- Level III was a logical choice for a couple of eating occasions. \n\nIf you go- go for the heirloom tomato salad. Three to four kinds of tomatoes, buffalo mozzarella and garlic toast crumbles all drizzled with balsamic dressing make for a great first start to your meal. This is my favorite of all the items I tried. \n\nI also had the NY strip (okay but coming from Chicago I guess I expected so much more). It was thin, well prepared but a bit tasteless and I found the mashed potato and pea combination a little odd. \n\nAt another visit I had the tuna poke, that while very artfully arranged, was a bit tasteless. It needed more soy sauce and Wahhabi or anything that would give it some flavor. \n\nThe atmosphere is trendy, the service spot on but know that Level III has fine dining prices. Dinner with drinks ran almost $70 a person which felt steep for a hotel restaurant, although I get they don't want to be considered a \"hotel restaurant\". They do have a prixe fixe special of a starter, entree and dessert which probably would be the better deal than ordering a la carte. \n\nLevel III has good food, served by friendly people. I guess I'd just prefer if I am paying those kind of prices to be at some trendy place across town!", "author": "Carol K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-03", "description": "This is a cool spot for an after work meet up. Stop by when they have live music - I caught Sony and Jerry Holland here and heard some excellent tunes.  The Happy Hour menu is hard to beat too. Strong drinks, professional staff, beautiful space and the music swings. \n\nAlso, big plus, the valet parking is free with validated parking stub!", "author": "Carolyn S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-10-22", "description": "Jeeeesus Christ, this place is amazing. I would recommend this place to anyone looking for a good place to get together with a couple girlfriends, a couple cocktails and a good time flirting with waiters if that floats your boat. The restaurant is off by the windows and because of the wonderful way it was decorated, you could hardly tell you were in the lobby just inches from the lobby bar. \n\nI have to say these five stars go to the black truffle mac n cheese. Oh my goodness, the mac and cheese is unlike anything else I've ever had before! There's something special about having black truffles in each and every bite of mac and cheese. The appetizer is served in a cast iron pan thus ensuring each bite is rich and hot 45 minutes into dinner. I have dreams-no nightmares about how good that pasta is. I hate the chef who thought up this dish 'cause he's ruined me for Southern Comfort food now. \n\nOkay, so besides that, we also had:\n\nChicken sticks: This is basically Thai satay chicken right down to the skewers and peanut sauce.\n\nFlight of Kobe Beef, Crabcake Sandwich, and Pulled Pork Sandwich: Honestly, I was too stuffed from the appetizer to really dig into it too much but the presentation was beautiful and the gherkin pickles they found to adorn the tops of each burger made it that much more delightful.\n\nFlatbread Pizza: This is a classic Italian style pizza with just the right balance with fresh arugula and tomatoes. I love how the arugula gives the pizza a kick that put it over the top. \n\nSo I'll come back to this place one day when I lose the 10 lbs. I gained from inhaling all that mac and cheese. I'll see it in my dreams tonight probably...damn it.", "author": "Jessica K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-07", "description": "The Good: The food was amazing, the desserts are to die for.\n\nThe Bad: The food took a long time to arrive.\n\nThe Review: Let me first say that I do not usually eat at fine dining restaurants so I was a little out of my element here.  Level III has a great deal called the Prixe Fix Menu.  It is $39 and includes your choice of one appetizer, one entree, and a dessert.  Considering the prices of the entrees this is a really good deal.  I had the scallops, the portobello ravioli, and the Apple Grunt.  The scallop starter was exquisite.  I don't know what was in it but trust me when I saw it was delicious.  The ravioli was good, but I felt it was too much...as in the sauce was a little overpowering, the portobello raviolis were delish though.  If a delicious cheesecake and a scrumptious apple pie made sweet love their baby would be the Apple Grunt dessert.  It was decadent.  I also had a few bites of the filet mignon, man it was so good.\n\nThe ambiance was really nice, as the restaurant just flows from the lobby area.  Our table remarked that it could have been a little more dim to set a better mood.  The service was great, they came by often to refill our drinks and check on us.  Unfortunately the kitchen didn't follow suit.  The food took a really long time to get out there.  It took a good while before we got our first appetizer, and then it seemed like we were waiting awhile for our entrees.  That aside the food really made up for this.", "author": "Joel S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-03-21", "description": "Decent food. Attractive surroundings.  Great service. \n\nThere are zillions of restaurant choices in San Fran. This one wouldn't be a recommendation.  Not bad, just not wow.", "author": "Kimberly S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-11-25", "description": "Rubbish. Hideously overpriced, with an indifferent staff and food pooped out of a Popeil's Cuisine Californicator, this place is just sad debris left in the wake of the pressure wave of yuppy bullshit that threatens to destroy the restaurant scene in the city. Leave it to the unfortunate hotel guests.", "author": "John H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-11", "description": "We stopped in for drinks after having dinner in Union Square.  The bar and restaurant are quite trendy looking and reside in a large open space.  I enjoyed the look and took the time to appreciate the design that someone created. ( an idea suggested in the book A Whole New Mind).\nDrinks were well mixed by a personable local mixologist.  Conversation flowed easily.  It was nice to get out of the comfort zone of one's regular haunts.", "author": "Thomas D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-04-13", "description": "3.5 stars rounded up because of the nice service!\n\nMy bf was definitely not in a good mood tonight as he's doing his taxes at the last minute (I'm the opposite, did mine in February).  Ugh, so I left the house to get some air and a quick dinner.  An acquaintance once told me that the Happy Hour at Level III at the Marriott was worth checking out.\n\nIt's not far from my place - somehow I found myself there tonight.  Nice ambiance and friendly service.  I just made it in time for the tail end of the Happy Hour (M-F 4-7PM).  I ordered the Mac and Cheese (with gruyere, mascarpone, and parmigiano reggiano topped with toasted breadcrumbs) - pretty darn decent and it filled me up quick!  I also ordered artichoke dip (a-ok) with house tortilla chips and the house pinot noir (smooth, just what I needed).  Ahhh, I was hungry and that all hit the spot, especially the pinot.    \n\nThank you, Level III for saving my evening and giving me a good break from my grumpy, tax-stressed bf - ugh!  ;)  \n\nP.S.  He's in a slightly better mood now - thank goodness!\n\n2 Happy Hour dishes+1 glass of house pinot noir+tip+tax = $28", "author": "Maile N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-06-22", "description": "This place has an awesome atmosphere.\nThe dining options were very American, but with a more high class take on it.\nTheir Macaroni and Cheese was the best I've ever had, large portion with a crispy top and hot, creamy insides.\nWhen I got to desserts, I was in heaven. Their creme brulee, apple pie, and chocolate cake are to die for.\nLOVE IT! Will be coming back!", "author": "Christopher S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-11-05", "description": "Watched one of the Giants playoff baseball games here. It was fun and a nice place to chill out. Everything here is expensive. Clam chowder was my favorite. Everything was to chic and trendy for me. I'm more of a meat and potatoes guy. If your into fancy food you will probably like it better than me. Did I mention that it was pretty expensive especially for the portion size! The Giants won so that made it a great experience.", "author": "Jeff C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-19", "description": "Need a place for a business diner or visiting parents or just have a group with a range of diets? Level III is a good option for you. While the food isn't the most creative every dish we had was cooked perfectly. We were a group of six and ended up being there for Dine about Town which can be a hit or miss.\n\nThey had two options for first and third course and we tried everything. \n\nThe first course was either a greens salad of a cauliflower soup. The soup was the most creative dish of the night and had a complex flavour and wasn't too creamy or heavy.\n\nThe green salad was ok but forgettable.\n\nThe entrees were all excellent. Two of us got the filet mignon which is one of my favorite cuts. I had mine medium rare and the other person had their medium well and both of our meat was cooked to order and tasted great.\n\nThe fish dish was an arctic char that was prepared well and had nice accompaniments.\n\nThe vegetarian entree was a butternut squash tortellini which probably was the most complex and interesting entree and was a dish we all agreed we would have again. It had a nice spiced almost floral sauce.\n\nWe ended with the dessert which was old fashioned chocolate cake and cheese course. The cake was super moist and creamy. The cheese was decent but the dried fruit served with it was rather anemic and should have just be left off.\n\nThose of us that drink were unimpressed with the wine list. They did have fake cocktails which were tasty.\n\nThe service was absent. They forgot to give us a wine list  when we sat down and then came back and asked if we wanted to order wine. The food came out at a good pace but the server seemed missing in action for most of the night.", "author": "DeathandFood H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-06-12", "description": "3 is a great number for this place - it's on the third level of the JW Marriott, it's about 3 $$$, and it's getting 3 stars. \n\nAs one reviewer pointed out, the purpose of Dine About Town is to try dishes at restaurants you'd otherwise not visit. DAT is to showcase what a restaurant does creatively and get you to come back. While there was nothing technically wrong with the dishes' execution - NY Strip came out medium-rare, as requested, veggies were flavorful, etc. - there wasn't anything outstanding. You put mac and cheese with steak on a DAT menu? Salmon on a bed of spinach? Solid, but really lacking in the creativity department here.\n\nThe one outstanding thing was the service, but not in a good way. Level III was dead empty on a Saturday night, with one server running the show for the entire place. Spoons for soup were forgotten, and the server seemed to disappear completely between courses. We actually had to get up and search for her when it came time to settle the check, since we were left twiddling our thumbs in front of empty dessert plates for about 15 minutes and the time window for our valet parking (Level III validates 2 hours for free) was running out.\n\nPity the poor souls who pay full price for this. I guess it's a good option if you're staying at the JW and don't have 2 minutes to walk a block to a better restaurant.", "author": "Sherry W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-12-26", "description": "The food melted in my mouth! Tasty sliders, macaroni and cheese (needed more mushrooms), and desserts disappeared as soon as they were put out at the Yelp event I attended. When I tasted these treats, I could understand why. \n\nLevel III serves unique and adequately stiff cocktails in a pretty setting. I love the red decor and the stunning view the hollow center provides - an open view of the many floors between you and the rooftop.", "author": "Jaime L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-03-10", "description": "My partner and I had a nice meal here once, for their prix fix. It was great. I went back recently for their \"happy hour.\" I use quotes because there was nothing happy about paying $8 for a glass of okay wine during happy hour. That's their version of happy hour!? Down the street at Jones you can get seriously half off food and drinks for way better. Rip off of a happy hour if I ever saw one. It's a joke.", "author": "Mark S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-01-18", "description": "A generous three stars.\n\n-The decor was pleasant but we were seated at a table where the light fixture, hanging from the ceiling, was so low and off center of the table that it was actually a distraction.\n\n-The service was iffy. The server took our order, sans smile, and said bread would be right out.  It took about 15 minutes,  just prior to our soup and salad.\n\nI had filet mignon with macaroni and cheese which was good and my wife had salmon which was OK.  At no time did the waiter come back and check on us which was amazing considering there was only one other table with guests at the time.\n\nNot a restaurant I will revisit.", "author": "Jeff H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-03-13", "description": "Food = mediocre.  A bit overpriced if you ask me.  *shrugs* But I guess it doesn't matter.  They do have a happy hour...which may entice you.  \n\nDrinks = decent list.  \n\nDecor = Simple, warm hues, modern but cozy feel.  I'd ask for more tables though in the 'lounge-y\" area, since they serve food there, but there is no way that you can eat everything on regular plates on your lap.\n\nService = friendly enough.", "author": "Fannie S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-05", "description": "I went to Level 3 to meet up with friends who were in town and staying at the hotel. If they wouldn't have told me about it, I never would have found it and that would have been a shame! \n I ordered from the happy hour menu, so I am not sure what the regular menu looks likeI started with the house pinot noir and I really liked it. I should have asked what brand it was because I really really liked it. I split the mac and cheese and sliders with my friend, it was the perfect amount of food. The mac and cheese had Gruyere, Mascarpone, and Parmigiano Reggiano Topped with Toasted Breadcrumbs - it was delicious and just what I needed after a few drinks. The American Kobe Sliders had Crispy Cipollini Onion Rings, Sonoma Pepperjack, Tomato and Cornichon. They were some of the best Kobe sliders I have ever had. \nThe service was good, even though it was off hours our server was very attentive and handling all the tables. If I am in the area again, I will definitely stop by and check out their regular menu.", "author": "Alycia N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-06", "description": "Strictly for their Happy Hour:  M-F 4-7pm\n\nWe were going to shop in Union Square and I yelped ahead of time for some Happy Hours to hit while we are in SF to take advantage of them.  Level III was the first of three that day.\n\nIt's a cool lounge.  Plenty seating throughout.  Very open.  Nice bar.  Bartender was a bit aloof.  Great Happy Hour menu.  We had:\n\nAmerican Kobe Sliders - three mini delights served with crispy cipollini\nonion rings, sonoma pepperjack, tomato and fresh brioche buns - $6 - nice presentation and tasty mini burgers.  We had it medium rare and that was exactly how it was served.  A slider never tasted better.\n\nBistro fries - house seasoned fries served with parmesan and parsley - $3.50 - very crispy but was salty.  Addicting but got too salty after a while.  As hubby said - it's a bar, that's how they sell more drinks!\n\nI had the shanghaied - square one cucumber, canton ginger liqueur, and organic lemongrass syrup, shaken and served up with an english cucumber slice on the rim - $6.  A bit too sweet for my liking but interesting.  Hubby had the Anchor Steam draft for $4.  \n\nFor a Friday, it was a bit slow.  After an hour, there were only a few patrons but it was time to head out to other Happy Hours.  If we are ever in the neighborhood, we will definitely return.", "author": "Gloria H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-01-26", "description": "At first, I was a little disappointed that this place was physically on level 3 at the Marriott.  But then, the fun/ slightly swanky yet trendy and vibrant decor turned me back on. They have decent house music which was a plus. \nThe food was good. Sliders were excellent. \nNot sure if I would come back though...", "author": "Rada I."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-10-12", "description": "I met a friend who was in town for a conference here for dinner. As a person who often wanders around larger hotels aimlessly until I get oriented, this place is ridiculously easy to find. It on the third floor, or more precisesly, on level 3 just as its name implies.  I especially love the dramatic decor, that includes vibrant splashes of color and a large scale fountain with a ring of dancers frolicking around it. Service is friendly, and the food is good. I particularly like the mac and cheese. With the addition of some lobster, the small portion was a decadent morsel. It was so rich, I'm not sure I would have been able to eat the large.The fish tacos are also excellent. It seems like a quite spot in general, and it was great for conversation.Some of the menu options seemed intriguing.  If I was going to ACT or something else around Union Square, I might give it another go.", "author": "Nicole M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-30", "description": "This was a great place to stop after a long day of walking and sight seeing. My mom is in town visiting me in the city, and we wanted to try something new and fun. We were skeptical of going to a bar in a hotel, but were extremely surprised. The service was out of this world. Dan- the bartender- was extremely personable and made us feel at home. Another waiter went out of his way to take my phone and charge it for me when he heard me wondering if there was an outlet anywhere. Needless to say, it was a great experience and I'll definitely be visiting again.", "author": "Rachel E."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-02-23", "description": "Came here a couple of times...the first time was for an event..the second time with several girlfriends. \n\nThe service was extrememly slow..I waited 10 minutes before the cocktail waitress came by to take my order. To add insult to injury, she charged some of us the full amount for the wines we order because apparently she placed the order right after the happy hour cut-off. ..WTH? \n\nThe food is uninteresting...doubt I'd go back again to endure the crappy service.", "author": "Mimi T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-06-26", "description": "How many different ways are there to say the word \"awesome\"? If it wouldn't annoy people, I'd list them all for this restaurant. \n\nThey are never crowded, it seems, which makes you worry they must not be good, but don't let that scare you off. \n\nThe restaurant is on the third floor (naturally) of a hotel. \n\nThe food is FANTASTIC. I got these scallops as an appetizer and they were so good I asked the waiter if they'd consider making them into a main course. He told me many other patrons have asked the same question. The service is stellar. A manager always comes by to make sure you're enjoying your meal. \n\nThis is a place that truly wants you to enjoy your experience there. They will allow almost any substitutions you request. Love it. Oh, and the bathrooms are across the lobby, and very clean.", "author": "Green Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-07-31", "description": "My husband and I stay at this JW Marriott in Union Square whenever we visit San Francisco, usually once a year or more. We have always LOVED the Onion Soup and Mac&Cheese which are both incredible. On this last visit we ate twice in this restaurant, and got food to go once. I must say the food is good, but EXTREMELY overpriced with EXTREMELY limited choices. In fact, they no longer serve the mainstays at all despite being told that we could \"find the FULL menu online at 'levelIIIsf.com'\". We did this, saw some fairly great choices, cancelled our high priced, fantastic steakhouse reservations outside the hotel only to find upon arriving in Level III that the online menu had been completely changed 5 days before, and the hotel is slow in getting the website changed!!!!!  Needless to say we were beyond disappointed to have to pay $106 for two 6oz Fillet Mignons with ONLY one side each!!!!  No special sauce or anything, just the steak and a side of potatoes for me, and spinach for husband. Way, way, way overpriced.  Disappointed at how the JW Marriott could have this sort of miscommunication when completely revamping the menu to the ONLY restaurant in the hotel. Unacceptable and unprofessional. At least they still have the fabulous Mac&Cheese with truffle oil!!!!!", "author": "Vicki M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-15", "description": "I am writing as a local, as a person who doesn't normally do happy hour, but I gotta say, after stopping by on a whim to check out the music there (as a former NYer its hard to find live music anywhere in SF that isn't noise) I was very pleasantly surprised -- the place is a little gem tucked away in the somewhat merciless Union Square area. Nice service -- okay the martini I ordered had ice chips in it, kinda a pet peeve of mine -- but the ambiance (I know! we're talking about a hotel here!) -- was very soothing, a big fireplace always helps.  The music -- a pretty blonde crooner and chill guitar accompaniment, just made it all perfect.  Will definitely be going back, hope the music is still there.", "author": "Mark P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-09-11", "description": "************* REVIEW 258 ****************\n\nLocated inside the Marriott Hotel. I haven't been here for awhile so when my relative in town & stayed here, I figure might as well. The place  is still nice & the bar was busy with loud sport watchers as usual.\n\nWhat we ordered:\n\n- Kobe Sliders - & I asked for extra pickled,  so yummy!\n- French Onion Soup - a bit salty.\n- Mixed Green Salads - nice & fresh dressing.\n- Mussel - was nice side, but the broth was good for dipping.\n- Stripe Bass with risotto & veggies - the cream sauce was a bit much over the rice. It was almost like a risotto, except the\n- NY Steak - was also over cooked for my cousin.\n- Scallop & cheese ball over a a bed of zuccini salad - nice.\n- Duo shortrib & Filet - The shortrib was nice, but the filet was medium!\n\nService was just OK this time. Our server tried, but he didn't bring out the dishes at the same time. He didn't really know where the ingredients come from when we asked for it. He had to get back to us. That just fail me right there. The service seemed lacking the smoothness, compared the last few times I was here which was a year ago!\n\nOverall: 3.5 stars\nFor value: 4 stars\nFor Food: 3 stars\nFor Service: 3.5 stars \nFor ambiance: 3 stars\nFor Crowd: Too crowded, we were near the bar!\nFor location: Valet is only!", "author": "Manda Bear B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-24", "description": "Yes this is a hotel restaurant but the fact that nobody knows about it is a great plus. I came for dine about town and was pretty impressed with the service and food. You get top-notch hotel service and high-end furniture which already makes the experience very positive. Throw on a great seafood chowder with chunks of crab meat and a nicely portioned steak frites and it becomes a surprisingly well-rounded meal.", "author": "Ed L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-22", "description": "This is like a gem hidden deep in the earth's crust. Bumping into this place also feels like that. Its hard to notice the restaurant from the exterior since there is only one sign. Sure its large and impressive but thats what this place needs, more signage. But lets get to the food and service.\n\n  When you enter the MARRIOTT HOTEL, one can start to smell the intellectual gastronomy in the air. My wife and I had to take a very modern elevator to, yes you guessed it, LEVEL III. The place was not too busy. Vibes of working people getting off work for a late afternoon drink. Nice. Plenty of people with suits and business attire. My wife and I were seated right away and our server (Mike or Michael) recommended the famous HAPPY HOUR drinks and small plates. It was a great afternoon chatting and trying to pick out the tourist from the locals. After drinks and appetizers, our server spoke about the changes made to LEVEL III and how the menu rotates from week to week. If you never been there, check it out. I think you would be pleasantly surprised.", "author": "Edson C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-12-05", "description": "I've never been in the JW Marriott and I was pleasantly surprised.  It's a really nice space.  It's a bit confusing when you walk in on level 3 because you're at Reception for checking into the hotel when you get off of the elevator.  It's not totally obvious that the restaurant is just past it.  \n\nWe wee there for lunch and our group ordered the mac and cheese, the seafood chowder, and the sample plate of three desserts for ten bucks.  The mac and cheese and chowder received rave reviews.  I was the one who ordered the dessert and I picked the butterscotch pudding, peanut butter chocolate crunch bar, and creme brulee.  The pudding and brulee were tasty, though not the best I've had.  The bar was so rich that after one bite I was done.  I didn't like it at all so then I asked if I could have the chocolate cookies instead.  Those weren't all that special either.\n\nFor ten bucks total, overall, I got a good value.  The booths were super comfy, and you could certainly hang out for hours chatting with your pals.  The server, I believe his name was Drew, was exceptionally nice and took great care in making sure we were served well.  We were 1 of only 2 tables taken in the place, so I'm sure that helped :-P", "author": "Tamar D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-12-26", "description": "I was really disappointed with this place. While the food was decent, that is about the only thing to say. For as high as everything was priced, I had expected a much better experience.", "author": "Ashley J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-06-22", "description": "Visited Level III on Friday night, where it was an unseasonably warm 90+ degrees in S.F.; it's important to know that in reading this review. Can't blame the restaurant for the weather, but it did make me notice that my seat was parked right under a very low, very hot chandelier. Pretty, but very hot. The service and food were very good, but the lighting should be reconsidered. \n\nOur waiter was very attentive and did an excellent job, despite working in the heat. The food? Yum. We had salads for starters, which were nice but the entrees were breathtaking. My mac and cheese featured a crumbly crunchy top and the shaved black truffle was the ultimate in upscale comfort food. I was panting halfway through, though- it's a huge serving (photo above). The tuna tartare was the wiser choice for a warm night and was accompanied by an avocado cream that was smooth and refreshing. Both dishes were excellent. The \"amuse bouche\" with crab was out of this world- the chef scored big points with us there! It was citrus-y and slightly sweet (from the crab) and salty, and all that flavor packed into a tiny glass. Sadly, we were too full for dessert but we'll be back- hopefully before this place gets crowded.", "author": "Joi W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-12", "description": "It really is on the III level of the Marriott, so I was thrown off just a bit when we first arrived. I did set reservations but really didn't need to because we walked in to a ghost town.\n\nThe experience once we on to the III floor was great , the location looked very modern which set the mood. The custom service was excellent, our waitress was extremely attentive. The food ( Fix Menu)  was extremely well done!\n\nover all we left satisfied and extremely confident that this was a good choice our a special dinner !", "author": "Steve S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-03", "description": "I wish I could come here everyday! Food is awesome and so is Joseph! We came 2 days in a row and we got lucky to have Joseph take care of us. He really made our visit more memorable. Always having a smile on his face and he works very hard.  My son loves the mac and cheese and for me, filet mignon. Thank you so much for being so awesome and making our visit so wonderful!", "author": "Linda M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-11", "description": "We enjoyed our stay @ JW - Marriot & decided to try their in-house restaurant/ bar (Level III)... A little pricey but Food was great... :-)", "author": "Yurey P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-11-26", "description": "First and last time I will eat here.  Food was decent but uninspired and incredibly over priced.  Some of the wait staff were difficult to understand. The manager should recognize that a close to empty restaurant on a Saturday night in San Francisco is a warning he/she should be noting.", "author": "Ginger L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-11-27", "description": "A shockingly mediocre experience.  Every few years, I have a definingly mediocre dining experience that then becomes a reference point for all others, until it is superceded or has finally worked it's way through my system.  Level III is my new level 4 bad dining experience and the one that inspired me to finally sign up for Yelp just in order to lay down some feedback. \n\nI don't know how any restaurant with this remarkably low standard of service and quality, can survive in a competitive San Francisco market.  I think it must solely survive on the captured hotel guest clientele that are too lazy to venture down the street, though I see other reviews here that suggest people intentionally come here.   My mistake, as last minute Thanksgiving travel plans imploded and we found ourselves instead at a Union Sq hotel restaurant and at the mercy.  \n\nSo, our expectations were low to begin with but we were in an appropriately celebratory mood going in.  Level III took care of that in a hurry.  Stiff, unfriendly, unprofessional, lacking in basic social and service skills, from host, to waitress, bus boy.   I'm pretty sure our waitress had not worked in that capacity more than 2 days before bumbling through our evening.  We had to flag her down almost a dozen times just to keep water in our glass, a fork on the table, \"we still have entrees coming right?\".  Even our visa card at the end of the night went missing for a time.   The staff couldn't get out of their own way, let alone ours.    \n\nThe food?  I would coin it cafeteria-lousy.  It was so poorly executed (and I'm not a food snob, really)  that we sat across from each other, politely picking through our dry, tendon-laden Thanksgiving meal, before finally requesting an extra ladle of gravy just to be able to grease it down our throats.  Seriously, I've had better dinners at Pinewood Derby award dinners. \n\nWe walked out of there not only embarrassed to have overspent for a thoroughly mediocre experience, but also challenged by a 2 hour struggle that threatened to suck the life out of the rest of the evening.   The final kick in the head came with the bill to learn that our small, weak cocktails (Saphirre & tonic) were $12 each!   Level III = Lousy Lesson Learned.", "author": "Span D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-12-03", "description": "Ok, I had to sign up for yelp just to give a review on this place! \n\nService: AWESOME! I had Zack at the bar help my friends and I out, we got the jalapeno lemondrop's and some grey goose martini's, he is great! made some bomb drinks. And Zack the turned us over to our waitress Layla, she was fantastic as well. She was cute & funny and gave us great suggestions on food! We had the Mac & Cheeses, which was soooo creamy and good. And we ordered the sweet potato fries, the apple grunt, the Sliders, and the Ahi Tuna! ALL of it was truly AMAZING! Good job for a Marriott, I was impressed! I will def come back for more!", "author": "Larry C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-08-04", "description": "Was happy when I first found this place and used to come fairly often but now I'm rethinking it:\n\nPluses: Wednesday through Friday Jazz (more lounge music) - Sony Holland is great and hits the spot in winding down after work. The place, while 80-ish, is very spacious and seating has never been a problem. I also like the fact that they have a work bench with plugs so I can even finish up some work without feeling like a buzz kill in the lobby/ bar. \n\nMinuses: Pretty much everything else - the Happy Hour is not really a Happy Hour as wines on and off the Happy Hour list are around the same price. Apps and food are overpriced and nothing special. \n\nWait staff is hit or miss. The young-ish waiters and waitresses are on point and friendly. The older waitresses aren't very friendly and don't seem to know the drink menus that well. One time I asked for an Old Fashioned and the older waitress said she'll check if they had that 'brand' Another time I asked the waitress if she had a sweet white wine by the glass for my wife. She said, \"No\" so I took a look at the menu and found a glass of riesling was in fact available. What ticked me off though was I ordered a 'SideCar'. Well mixed drinks are listed as $6 during happy hour. When I got the bill, she charged me $10 and it said 'well-whiskey' on the receipt. I asked her about it and she said she used extra alcohol. I told her a sidecar is not made with whiskey. She said she 'knew' but had to charge it that way??? It would have at least been nice if she let me know she would have to charge it as extra before giving me a bill with a bogus whiskey charge.\n\nNew plan; Farallon down the street has an AMAZING happy hour and impeccable service. Head there first - fill up. Head to Level III, order a beer (hard to get that wrong) to listen to Sony and just tip her directly!", "author": "Parag G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-03-15", "description": "Came here with friends during the Dine About Town Special. \n\nVery average. Food was OK. If we didn't go during the Dine About Town, I would have felt ripped off for the price they charge. \n\nNothing special or memorable.\n\nThe Eggs says: Average, just average.", "author": "Cindy W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-02-20", "description": "Like many others, I found our service was awful. Never checked on us. The bus boys pretty much took care of us throughout the evening. Took 25 minutes to get our check - which we had to get up and ask for. No one to be found, so we wandered to the kitchen to get assistance. The table near us had a similar experience. The lady at that table decided to yell for help though.....\nAvoid \"Andrew\" as a server & you might be ok.", "author": "Miss G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-12-06", "description": "Good place, not excellent. The mac & cheese is the best thing on the menu. Flat bread pizzas are really good too. The Kobe beef sliders are amazing. Go at least for the drinks. Specialty drinks created by a local mix-ologist are excellent. \n\nOh and get the french onion soup. One of the best I've EVER had.", "author": "Colleen M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-01-31", "description": "Happy Hour in the hotel lobby is good. Decent food and price but nothing I'd rave over. Service can be slow at times but otherwise is good.", "author": "Anna S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-03-14", "description": "Our family of 5 went for the prix fixe.  The first course was excellent (seafood sampler and day boat scallops).  Most of our group ordered the filet mignon and nobody was happy with that.  It was advertised as peppercorn encrusted but what came on the plate was a gray, plain piece of steak.  Very disappointing.  I had the gnocchi with steak and lobster, it was good but not worth the $39 prix fixe price.  (I think I was the only one who was happy with their meal!)  \nMy advice is to skip the prix fixe and stick with appetizers.", "author": "Nancy S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-09-26", "description": "Did you know this place existed? Neither did I. Neither does the entire population of San Francisco, apparently. \n\nMy friend made a reservation here for his birthday for a party of 6. We were running late and I immediately went into typical \"being late for a restaurant in SF\" mode of \"OMG, they're gonna pass up our table, we'll have to wait another hour, we're missing 1 person so they won't sit us until we get there\" and so on. \n\nThe joke was on me. \n\nWe got there, rushing to the restaurant and barely appreciating the gorgeous open atrium of the hotel, when we found the check in table and started looking around. \n\n\"Huh. The restaurant must be somewhere behind all these empty tables and chairs. I wonder why they're walking us through them. Oh. They're seating us here? At this table. All alone in the entire place. Maybe it's just a waiting area. Yeah, maybe the real dining area is hidden in a secret place. Oh, no. They just brought us menus. This really is Level III. Well, let's hope we make it out alive.\"\n\nIn all honesty, the place is pretty cute but the food was average. I've never used the word \"meh\" to describe something, but this place feels like it deserves a \"meh.\" \n\nMEH. Meh. meh. meeeeeehhhh.\n\nThey have a prix fixe menu for $39/person including an appetizer, dinner and desert. From what I tasted of others' meals, I'm not sure it was entirely worth the price. I ended up choosing the halibut tacos and Caesar salad. Neither were memorable. AND the fish was fried. So weird! Who puts fried fish in fish tacos. What a let down!\n\nBut kudos to our waiter. He was pretty awesome, patient yet attentive, and even brought the birthday boy a glass of champagne.", "author": "Jared S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-11-27", "description": "WHERE: third floor of the marriott hotel. POST st.\ninterior decor was on point. christmas tree/ornaments/lights, fireplace, had the game on, full bar nearby... scrumptious.\n\n$$: prix fixe menu was $40.\n\nFOOD: two orders of fries, not on the prix fixe, not too soggy, a tad salty, but good garlic:fry ratio.\n\npan boat scallops were a bit under cooked, tasty though. ahi tuna tataki had avocado slices and the sauce? ..CRACKEN!\n\nseared salmon was ehh.. kind of bland? came with garlic sauteed spinach and bits of crab. and the butter based organic chicken breast was a little dry. was on a bed of cheese risotto which was delicious, and a mushroom gravy sauce?\n\ntoo full so i didn't even try the dessert. we left and it wasn't finished, i assume it was 3/5 stars. our waitress michelle was very friendly and redid a gin martini that was a little watery. restaurant was empty and our water glasses stayed empty also.. for too long\n\nOVERALL: for the price, i'd try somewhere else next time. the company was spectacular and its in a great location so still had a great time!", "author": "Braden K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-11-18", "description": "Great hang out place for some appetizers and drinks.  I thought the mini burgers were good and the mac and cheese was too.  The chocolate chip ice cream sandwich was really good!  I'm more of a savory person, but I have to say those sandwiches were good.  I also thought the cocktails they were serving were very unique and sounded scary, but they were actually very tasty and refreshing.  Never would have think Jim Beam with homemade apple cider would taste good together. But yes it did!  I wasn't liking how the area was so spread out, but I guess its good for those hotel lounge/bar areas.  It's a big space and there's tables that are far from the bar, so the waitress (if there is one) will have a hard time seeing you if you needed something.", "author": "Gina S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-14", "description": "My old good friend took me out to this place on a Sunday night  and I really enjoyed this restaurant. Food was delicious and the environment was elegant and quiet. We could catch up many things without any interference. We stayed for almost 2 hours but servers were very nice and didn't seem to care so much~ \n\nI returned to this restaurant with other good friend when I had to tell her about my recent problems with love life. I think this restaurant is a certainly good place if you want a quiet environment with nice trendy decoration. Place doesn't seem to get crowded and the food was served pretty quickly. I hope there are more dishes on the menu to choose from, but I enjoyed squash pasta, oyster, taco, and chicken salad I had here.", "author": "Sunny K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-10-04", "description": "Nice place, great hh food, insane hoops to jump thru to get wifi!  Would come again if I don't need wifi", "author": "Jon B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-08-26", "description": "You know when you're speaking with someone for the first time and they're trying to make an effort to be really warm and engaging but they come off as slightly chilly in disposition?\n\nLevel III is a gorgeous place, and the bar staff is extremely efficient. However, when such an expansive (as in large) place is practically empty, I involuntarily shiver.\n\nDRINKS: A great Happy Hour menu; better than most upscale places in Union Square. A friend/colleague went with me, and since we're both industry people, the bartender made us off-menu cocktails for a couple hours. Great prices. \n\nEATS: One should never order food when already drunk. But in the case you're rewarding yourself for a hard week's work, please do! The chicken wings are amazing, as are the parm fries. There are all on the Happy Hour menu, and come in rather well-suited portions; enough for two alcoholics, or for four rather sober people wanting snackies.\n\nATMOSPHERE: The splashes of red in an otherwise austere layout remind me of religious goings-on. The glass elevators are gorgeous, but the seating for Level III is somewhat off to the side of the lounge bar. It's almost like the tables were an afterthough. Granted, the bar was converted after the hotel was taken over, so the designers didn't have the choice of complete remodeling.\n\nAlso, the open ceiling into a 20+ floor building? You really feel tiny. Also, it's never wise to crain one's neck upwards after they've been drinking!", "author": "C. P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-14", "description": "Hotel food is always the way to go. This was a last minute decision, but so worth it. Really, really good prices for what they had. The crab cake sliders are TO DIE FOR. And the nut assortment was a very generous serving for the cost. Good, speedy service, too. An odd bar, but delicious. I'd go again!", "author": "Elisë K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-10-22", "description": "The food was great. We had the fries (which were supposed to be sweet potato but she brought us garlic instead), kobe sliders, prix fixe menu of corn bisque, ravioli and artisan cheeses with the wine pairing. And for dessert the apple grunt, mini ice cream sandwiches and vanilla creme brulee (best dessert I have ever had). \nThe fries were great. The kobe burgers were amazing. Super tasty bun, and the meat juicy and flavorful. The bisque was sweet and delicious. Ravioli had a great sauce. Cheeses were just ok. \nWait staff was slow...lots of time between courses. Nice layout to the eating area. Felt very spacious. GREAT decor. AWESOME location", "author": "Katie C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-09-01", "description": "Swanky.\n\nThey have a really nice lounge, including some booths by the windows with your own personal televisions. My friend and I sat in some large chairs by the fireplace and enjoyed cocktails and Parmesan fries. I was really impressed with the cocktail menu- they came up with some unique drinks and many were San Francisco themed. I tried Emperor Norton's Mistress, which was Makers Mark with muddled strawberries, Cointreau and Navan. Our waiter was really nice and we enjoyed chatting with him.  \n\n Seems like a good place to end the evening on a really good date, or a quiet location to rendezvous for an affair.  I mean that in a good way!", "author": "Lisa R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-12-22", "description": "Ok, so what if it's in the Marriott? Level III has helped redefine the new hotel lobby. It's a lounge, a restaurant, a meeting area and workspace all in one. It's wide open, yet intimate when the occasion calls for it. \n\nDrinks are not inexpensive, but with a menu from H. Joseph Ehrmann (of Elixir fame http://www.yelp.com/biz/elixir-san-francisco), they do deliver on quality and originality. The Harvey Milk Punch comes in 3 levels of the Big Easy classic; I'm not sure who's ordering the level 3 cuvee du cent-cinquantenaire at $90 a glass but let me know if you do, but the level 1 at $15 is a relative deal. The Shaghaied at $15 is also tasty, and the description of the cocktail lets you know that \"you'll go willingly on this Chinese journey,\" and I want to believe them.\n\nBut I'd say the real pleasant surprise for me was the food, namely the bar snacks. Items like: bistro fries seasoned with salt and pepper; a mac and cheese made up of gruyere, mascarpone, and parmeggiano reggiano; and kobe beef sliders on mini brioche buns. Mmm!\n\nWhether it's after a hard day of work or shopping, definitely keep Level III in mind. It's a place that deserves to be more of a destination. I'm also intrigued by their Take 3 Happy Hour: 3 reds, 3 whites, 3 beers, 3 cocktails, 3 plates, 3 hours,  1/2 price, 4-7 Monday-Friday. Three is indeed the magic number.", "author": "Nish N."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-10-08", "description": "Had I read my fellow yelpers' reviews before dining here, I might have expected the restaurant to be completely empty, like it was. I met my dining companion about 30 minutes before our reservation (They apparently wouldn't let us have an earlier one.) with the intention of grabbing a drink at the bar.  No need to worry, though since NO ONE was at the restaurant.\n\nService was very attentive, but the food seemed sub-par.  I had a half-order of mac & cheese, which was good, and my steak sandwich was fine, but the fries were way too salty!\n\nAnd I ordered a caramel ice cream sundae, which took me approximately 1.5 bites to eat! And the ice cream wasn't even very good!\n\nThe highlight of the night was seeing this guy passed out by the bar and the hotel manager had to shake to wake him up.  I couldn't hear their discussion, but the sleepy patron seemed upset that he'd been roused from his sleep, then promptly tilted his head back and closed his eyes again once the manager walked away.", "author": "Marcus C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-12-02", "description": "Level three has so many things going against it, and they haven't overcome that.\n\nLet's start with the building.  It is a ridiculous building, a hideous mid budget glass elevator monstrosity with exposed duct work that has always reminded me above all else of the atrium from the death star.\n\nAnd then the setting, it is a Mariott.  Mariott has never stood for hip or cool, I'm not sure what it stands for but clueful is not it.  Mariott doing ultra lounge is like tuedo on a monkey.  Maybe I would rather see the monkey.\n\nAnd Union Square, that's tough competition.  Within a few blocks are the Saint Francis, Campton Place, Fairmont, Sir Francis Drake, Mark Hopkins, Ritz, Omni, plus any number of boutique hoels.  If you come to San Francisco and your boss puts you up in the Mariott you've got rocky times ahead my friend.\n\nAmidst all this, somebody studied the success of the W and all the boutique hotels and said, lets do this!   In fact, let's take it up a notch!\n\nSo now there's an utterly sprawling, vast restaurant lounge lobby that takes up the entire surface (other than the news stand and the elevators) of the main floor of the hotel, floor 3.  They have every conceivable amenity and seating arrangements - formal tables, couches, bar seating, bar tables, banquettes, long Cat 5 enabled computer hookup tables, Internet pay stations, semi-private flat screen roomlets (at least a dozen of those), fireplace seating, and beds.  Yes, you can even plop yourself down in one of their lobby beds and order from there.  It's nuts I tell you.\n\nFor all this, service is slow and haphazard.  Food is middling to terrible, menu is not thought out well.  Drinks are well designed but not well executed (names like Harvey Milk Punch, Marina Margarita, Emperor Norton's Mistress, Dirty Harry).  The prices are unconscionable - $8 for a draft beer????   Hello, this is not the Saint Regis.  At happy hour they have a small number of half price options which just makes it a normally priced bad meal instead of something you kick yourself in the head wishing you didn't.\n\nThe best part of the place is the design and layout.  It is pretty cool to lookout, and not bad to hang out.  If only the food, service, vibe, and prices were at that level.  But even the design, it's still in the lobby of the death star, it looks as if somebody put an ultralounge in Darth Vader's palace.", "author": "Gil S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-12-17", "description": "I would have probably never known of this place if I hadn't sampled some of their food at an event in San Francisco, but they know what they are doing. It is strange that it is in an open hotel lobby with just some curtains separating diners from hotel patrons checking in, but that makes this restaurant a little different, which I kind of like. If you are looking for a private dining experience then this is probably not your place. However, the food was very good.\n\nI took advantage of the Price Fix menu paired with wine. I have been on a soup binge lately and started with a carrot puree, which was not the best ever, but was a good way to start the meal. For my main course I had the Filet Minon. It was lightly seasoned and cooked to perfection! The way a piece of meat is cooked means everything to me and they nailed it. I actually went to a place \"famous for steaks\" a week later and was longing for the cut I had at Level III. That is pretty impressive when you can outshine a famous steakhouse. The dessert I chose was the cheese platter because I don't like sweet at the end of a meal. They missed a bit on this. They weren't the best cheeses and the accompanying items on the plate just didn't work.\n\nI would try this place again and recommend it to others if they are not sure where they feel like eating. The Scallops looked delicious and I would try them next time. The price is about what you would expect from similar restaurants in SF, so you won't feel ripped off. The one thing to keep in mind is that there is little to no privacy, so if you are looking to be secluded while you eat this is not your place.", "author": "Frank J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-10-29", "description": "I just found my dinner receipt in my pocket* and realized that beers at Level III were $8 a piece. $8! I don't have a problem paying $8 for a beer at a concert or at a cool Belgian bar but in a glorified hotel restaurant? No thanks! \n\nNo wonder the place was almost empty on a Saturday night. I will definitely not be returning unless it's during happy hour when everything's half price.\n\n*great filing system, eh?", "author": "phil h."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-12-28", "description": "Although it sits in the tourist-heavy Marriott hotel in Union Square, locals will fall for Level III.  With their unique martinis, excellent food and calming ambiance, Level III is the perfect place to relax with your friends next to the fireplace drink in hand.  \n\nDuring happy hour (4-7 PM Mon-Fri), they feature their 3 signatures cocktails, 3 red and 3 white wines and their appetizers for half-price.  Their HH menu includes kobe beef sliders, parmesan fries, handcut potato chips with blue cheese dip, and mac and cheese.  With their delicious \"Shanghaied\" organic lemongrass and ginger vodka martini and kobe sliders both priced at $6, the only thing you'll be splurging on are calories!", "author": "Kimberly J."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-01-18", "description": "We came here for brunch and had the all you can eat buffet and crispy french toast. The food was decent but nothing amazing. Plus, it was more expensive than other brunch places with better quality food. \n\nThe food is average but I took off one star since brunch is overpriced.", "author": "Lisa H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-09-20", "description": "We had breakfast there this morning as we are staying at the hotel.  I was served a tasty, large bowl of oatmeal, my husband did not like his pancakes.  He said it tasted like they were made hours ago and kept under a warmer.", "author": "Ali B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-01-18", "description": "Please don't eat here. Save your money for a slice at Blondie's. I guarantee you that that will be infinitely more satisfying.\n\nIt seems like the marginally good reviews for Level III are thanks to their cocktails. But as for their food, please don't eat here. Especially for Dine About Town.\n\nFirst off, it's disappointing when you don't get a choice of courses for a DAT menu. I know it's not a rule to do so or anything, but I happen to appreciate any restaurant that would give me a choice of food, seeing as how I'd be the one subjected to... *cough*... I mean, seeing as how I'd be the one eating it.\n\nSecond, flavoring your food is NOT a bad thing. Our three-course meal consisted of a half-decent tuna tartare (because as long as the fish is fresh, it's damn hard to screw up tartare), a god-awful butternut squash pasta, and some subpar ice cream sandwiches. The flavors were boring at best.\n\nThe pasta was the single most disappointing plate of slop I've had in recent months. The butternut squash sauce and tagliatelle came out looking like gloopy mac n cheese. Not a high-end mac n cheese, mind you, but something that looks like it had a Velveeta label on it five minutes prior. \n\nAside from being an ugly plate of food, it had no seasoning whatsoever. Butternut squash and cream. I think that was it. My friends and I looked around guiltily as we emptied the salt and pepper shakers onto our plates, because after all, when dining at a nice restaurant you shouldn't have to season your own food.\n\nAnd then there were the ice cream sandwiches! A Neapolitan trio of chocolate, strawberry, and vanilla ice creams sandwiched between some cookies. The strawberry ice cream sandwich was plated next to some slices of strawberry. And you know what? The chefs at Level III cut their strawberries on the same cutting board as their onions. I know this because strawberries usually don't taste like onion! That was the end of the meal for me. Never mind that the service was decent, since we were one of only three tables in the restaurant at 12:30pm on a Saturday. \n\nArgh. Dine About Town, I want my $21.95 back.", "author": "Amy C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-06-12", "description": "One star per level.  Sorry for those of you who read this earlier, but I was writing from my phone.\n\nI stopped into this gorgeous, bright room for breakfast before working a university orientation across the street. The hostess table is a little hard to find, but the concierge was there to point the way. High ceilings, glass elevators and a blend of modern and classical deign elements make the room seem glamorous, despite the odd quadrant system. Servers still don't know the menu, but I'll wait until they are open a full day before I complain. \n\nThe coffee is crap, the buffet looks great and my eggs benny were far from the best I've had in the city, but the eggs were cooked perfectly, even if the sauce was bland, generic and too thick. They're offered as full or half order, which was a nice touch and they came with limp yet tasty asparagus and a grilled tomato. It's fun to think that being here a half hour after they open for the first time, I probably ate the restaurant's first Benedict.", "author": "Quinn S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-06-20", "description": "So I came back here for dinner last night. I was craving the mac & cheese that I had at the opening party so that's what I ordered--except instead of a tiny little taste of it...i had an entire plate...for dinner...all for moi!!! So far, I have to say...it's the best mac & cheese I've tasted. \n\nAlso, I made a new discovery. This is a great place to go for a pre/post- theater dining. Not too many people know about it yet since it's fairly new and inside the JW so it won't be super crowded like Colibri or the Grand Cafe.", "author": "Sue L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-04-04", "description": "ehhhhhhhhhhhh, I felt the food was alright. Kind of felt like they had the AC on...its freakin cold outside!! what are you thinking?!\n\nAnyhow though, had this menu with an assortment of things, it was a set dinner with a salad or soup, entree and two desserts and a cheese..I think they over did the dessert portion, you dont need to give us chocolate and then a fondue and then a cheese platter. Way too much stuff, and I guess you were trying to cover up the fact your salad sucked.\n\nThe entree of beef two ways was pretty good and that could possibly be the highlight of the entire dinner. Service was good, she was very nice and i'm sorry I dont remember your name but keep up the good work~\n\nOther than that, I would stick with the finger food instead of the dinner food...", "author": "phillip w."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-09-17", "description": "Take it to the next level?\n\nTimes when this question is ok to answer:\nIn an Ice Cream Shop\n\nWhen picking out a piece of jewlery. Or Cake. \n\nNOT ok: \nWhen it is asked by that Creepy Guy at the end of the bar. You know the guy. No amount of beer is going to make him pretty. Get out of there Riding Hood!!\n\nAlso Ok:\nLevel lll.\n\nI happened upon their menu, saw lobster mac on the brunch menu and set the date. That's all it too. Cheese. Macaroni. Lobster. \n\nThe scene: Floor .... what, what floor could this possibly be on? hmmm...\nOdd for brunch, I see gathering here as a first stop on a night on the town. Made for lounging with all the Ladies, or ditch those whiney bitches and get your Guys to go. TVs to keep their ADD riddled minds at ease and plenty for you to watch.\n\nSunday Brunch, however, is quiet. We were quite late for a brunch, but still we almost had the place to ourselves, which was fine, 'cause I broughts my appetite and I came to play. \n\nFirst Level: pastry basket instead of bread. Sweeeet.\n\nSecond Level: Drinks. Mine? Bloody Mary Baby, extra Bloody. Honestly, who knows what the fuck that means, but it sounded cool. \nI love a spicy kick-your-ass-Mary, and they have it so a Gal can customize here, so I chose the jalapeno-infused vodka with the kamikazi twist, includes ginger, wasabi and special spices. This was done RIGHT. Sure as shit better be, at $12.\n\nLevel 3: Brunch. Since the Lobster Mac was a given, I was having trouble deciding between the crabcake benedict or the chicken salad when I saw ratattoui. I am a sucker for eggplat, and so that's what was placed before me. Mama got the Cuba Cristo with spicy home fries and we settled in to our Mary's.\nFood came out quick, lobster mac was first. I dug in with shame at a Level 0. Topped with toasted breadcrumbs, and creamy bechemel, this dish looked like a winner. LOOKED. I was disappointed in the flavor. Or lack of. I know that with seafood, you got to be subtle - but this had no soul. \nRatattoui was better, I ate every last bite. Mama's Cristo was done on brioche, but the overall taste of all the dishes? A little canned. Kinda salty, kinda processed. \n\nI would go back for a take 2, but I'm going at night, wearing my ruby slippers and gettin me some more of that Mary! That's where the Levels are at - the BAR.", "author": "Katie W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-09-29", "description": "Got off work and met up with a girlfriend the other day for cocktails. We decided to check out Level III at the JW Marriott. We walked into the hotel lookin kinda lost because all we saw were elevators and no signs indicating where Level III was. Well, duhhhhh.....we finally figured out that it was on the third level. How clever of them. Yeah, I can be the most blonde Filipino girl out there sometimes. \n\nThe bar/lounge area was right off the lobby and not far from the hotel's front desk and so we really didn't feel like we were in a separate area. Although our table was perfect, it still felt like we were in the lobby. We decided to share the Seafood Salad, Kobe Beef Burgers and Tuna Tartare. It was delicious! They really designed their dishes for sharing and mingling over cocktails. The burgers and seafood salad came in threes. 3 mini kobe beef burgers and 3 small bowls of seafood salad. Everything tasted fresh and of good quality. I'll be back!", "author": "Anne E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-05", "description": "I am seriously impressed by the food at Level III!\n\nLocated inside  the new JW Marriott, it's the hotel restaurant on the third level of the building - - hence, Level III.  One thing to note that the front desk is also on this level, and essentially, you are dining IN THE LOBBY.  It's a bit weird, but they've designed it in a way that works - - the lobby sort of melds right into the lounge, which melds right into the restaurant.... and while you may technically be eating your dinner in the \"lobby\" - - it's not bothersome.\n\n\nWhile it is a hotel restaurant, it's not all that formal, and quite bright.  Service was excellent - - every server we encountered was trained to the JW Marriott style - friendly, pleasant, and polite.  \n\nBut the food was EXEMPLARY.\nI am tempted to give it 5 stars because it was so good, but as I always say - - 5 stars is a class of its own, and while Level III really impresses me, the overall experience is not quite up to par.\n\nLevel III is a \"shared plates\" concept, tapas-like, if you will.  They do have larger entrees which could serve as your main course, but that, too, is best shared.  All \"level 1\" items are very small, all \"level 2\" items are a bit bigger, and all \"level 3\" items are similar to main entrees.\n\nOn this night, we started with the seafood salad, which was EXCELLENT.  I can't begin to explain how good this was, full of real lobster meat, clams, scallops and tons of flavor - - 5 stars hands down.  I could eat four plates of this by myself.  We also had the tuna tartare, and contrary to how bland it looked, with the green sauce, it was really quite good.  Then we had the Kobe Beef Sliders - - which were PERFECT.  We requested rare, and it came close... two patties with an onion ring inside the slider, it was perfect.  Last, but not least, was the Mac and Cheese w/ Black Truffles (the truffles are an added option, as is lobster mac and cheese).  At $17, this was one FANTASTIC mac and cheese, with Gruyere and mascarpone cheese.  The pasta itself was a bit overcooked for my taste, but it didn't take away from the final 5-stars I give this dish.  (Edited to add:  We also had ice cream sandwiches and freshly fried donuts with chocolate dipping sauce --  the sandwiches were excellent, piled high between cookies... the fresh donuts were good but I've had better.)\n\nCombined with a bottle of J Pinot Gris, which was quite good, the total was a $135 or so and we were stuffed.  Frankly, for hotel dining, I thought this was quite reasonable.,,, and factoring in the food quality, I'd HIGHLY recommend Level III.\n\nThis is, without a doubt, a welcomed addition to the San Francisco dining scene, and with a little time, undoubtedly will become well-known for their great food and good service, at reasonable cost.  It's a fantastic date place, if you secure private booth seating - - or in my case, I preferred a table on the outskirts of the restaurant as it was quieter on this night.  Be it a date or a group outing, Level III can host your dinner, and I'd assume groups of up to 20 people could easily eat here.\n\nLevel III takes \"shared plates\"  to a whole new level, and does not disappoint!", "author": "Grace K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-04-30", "description": "I like a good-looking restaurant, and I like all the hanging chandeliers and the plush booths at Level III, but the food here is, as many people say, overpriced and sub-par. And on top of that, the service is slow and inattentive. We'd made a reservation at 6 p.m., thinking that in any ordinary universe, two hours would be a perfect amount of time for a practically empty restaurant such as Level III to serve up a coursed meal, but because the wait staff was so inattentive, we ended up rushing to get our check taken care of by 7:30 so that we had enough time to walk to the theatre. \n\nWhen we first came in, there was no host at the host stand and had to wait. Then, once we were seated, it was 10 minutes before a waitress came by to take our drink order. And another 10 before she brought back our wine. Mind you, we were there at 6, and there were only two other seated tables in the whole place. We didn't get our first course until 6:40, at which point we told the head waiter that we needed to make an 8 p.m. curtain. At which point, they picked up the pace a bit, which was appreciated. \n\nI can barely even remember what I ate there, save to say that their French Onion soup is unmemorable and the butternut squash pasta had no subtlety (basically just tasted like butternut squash). My desserts were three little ice cream sandwiches, that I left unfinished because it was 7:40 and I had to get to the Orpheum.\n\nSlow service plus uninspired food? Not a place I'm likely to return to.", "author": "Stevi C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-02-11", "description": "A solitudinous dinner, I reasoned, would help assuage my mounting anxiety stemming from a depressingly long game theory problem set due next week. \n\nAs I stepped out of the JW Marriott's third floor elevator, I noticed an unpeopled hotel lobby/dining room. With time, though, Ryan Jette, Level III's chef de cuisine and erstwhile French Laundry chef de partie, undid my unease with his enrapturing prix fixe menu menu. \n\nThe amuse bouche was a chestnut soup with apple relish. Although a bit cloying for an amuse bouche, I savored the lingering roasted chestnut aroma.\n\nIn addition to the prix fixe, I ordered the sliders. Gruyere melted down onto the plate, the patties' interiors revealed a luminous rose color, and the crispy onion rings all harmoniously married.\n\nNext, I had the tuna tartare. The chili powder, cayenne, ginger, and wasabi were pleasant additions to a ubiquitous dish.\n\nThe beef fillet au poivre with pommes frites and veal jus was a really good steak. The veal jus, which boasted a mostly salty flavor along with the slightest fruity note, inhibited the peppercorns from overwhelming the palate. The fries had an unforgettable crunch. The only conceivable way to improve them would have been to cook them in duck fat. For that, I suppose I will have to revisit Monsieur Mina.\n\nThe dessert was mundane - three bite-sized ice cream sandwiches.", "author": "Andrew F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-06-15", "description": "A fun, trendy place that delivers!\n\nThe old Pan Pacific hotel has been remodeled to a luxury hotel that can compete with the best of them. Level III is a lounge/restaurant that offers full service whether or not you sit down in the lounge or eat at the restaurant. I was there for the grand opening and the menu was delightful comfort food -- mini sliders with onion rings, mac and cheese with truffle oil and shavings... fantastic. \n\nThe space is designed in a contemporary and luxurious style -- it offers a mix of quiet corners that are more intimate --perfect for date night-- or open, loungey areas -- perfect for ladies night out. \n\nI got a chance to chat with the manager, Steven for a bit. Even though he's opened some hot spots in town - Tartine, Blowfish Sushi -- he's very warm and down to earth. I think I've found the next 'hot spot' in town.", "author": "lindsey l."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-06-02", "description": "Where do SoCal locals go to watch the Laker playoff's?  That's right --on the third floor of the JW Mariott in San Francisco. \n\nWe initially thought, go to the closest spot to the hotel to catch the game.  By default since we were staying there we went to Level III and heck why not---it's happy hour from 4-7.  Perfect timing.  And amidst the hootin' and hollarin' and trash talking to the other guests that were rootin' for the chicken Nuggets, we did manage to stop and pay attention to the lush decor and the upscale appetizers that are far more swankier from the ESPN Zone.\n\nGreat for happy hour. Best mac n cheese you'll ever put in your mouth.  Don't believe me?  Oh you will when you try it and get a squirty surprise.\n\nIf it wasn't for all of our game chaos, this place seems like it would be a nice place to chill with friends.  The restroom experience is even posh-- listening to the sounds of jazz from Etta James to french, makes you feel shi-shi even while peeing. \n\nLevel III, props to you guys for takin' in a bunch of rambunctious Laker fans.  LAAAAAKE SHOW!!!!", "author": "Sharen G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-03", "description": "IF you are looking for a public place to practice your art of seduction, look no further. Level III at the JW Marriott is the place to win his (or her) heart (or body).\n\nLevel III Restaurant has city views in a quiet corner for that tête-à-tête which is perfect for wining and dining \n(for more discreet setting, they also have intimate dinner booths)\n\nThe Service is not obsrusive but very attuned to your needs which in turn, makes you focus on your date's needs\n\nDecent wine at a great price ($20 is the lowest -- at that price, you can use the extra savings on the sensual dessert -- try the trio of ice cream sandwiches)\n\nkobe sliders (3 to a plate and so yummilicious)\nmac n cheese with truffle oil (decadent)\ntempura veggies -- (made you feel that it was actually healthy even though it was fried)\n\nThe fact that this restaurant resides in a hotel works in your favor -- you can start your seduction in restaurant then work your way to your room. \n\nBon Appetit!", "author": "Vanessa J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-06-16", "description": "Okay, I think it is really annoying when I am really the first to review, but someone else, who has just heard of somewhere new, or happens to know the owners whatever, takes the blue ribbon away! \n\nBut, this place Level Three. After a few hours of shopping, I could tell I was being led towards a watering hole. From previous experience, I knew it would be a place that served Martinis. It was. \n\nLevel three was actually having their premier opening party on this particular day, and there were lots of vendors, fire dancers, passed aps, and champagne, and wine. Dry ice rose out of the fountain, and it was very pretty. \n\nThe bartender seemed a little dazed, and I was surprised they let us order the food, that minutes later was being passed around free at the party. Thanks for the heads up dude. \n\nThe decor was great, some neat couches, and a great place to hang out if you were staying at the hotel, as there are tons of places that you can hook your laptop up to.", "author": "Danielle V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-29", "description": "Update: Feb 2009\nHappy Hour here rocks! Three white wines, three red wines, three cocktails and appetizers half off. We stuffed ourselves on mac and cheese and sliders and guzzled Shanghaied cocktails like no tomorrow. Awesome!\n\n---------- \n\nMonday nights aren't usually the best night for getting a good feel for a restaurant. Since they are new, I'm giving the server a pass on forgetting one of our dishes, for mis-understanding our requests a couple of times and mixing up which sliders were medium-rare and which were medium-well. \n\nThat being said, I like the decor, though it would be nice if the lights weren't SO bright. We had a decent sized group so we were able to try a few dishes. The sliders were very good, along with the black truffle mac and cheese! We tried most of the \"level I\" dishes and all were tasty. \n\nThe cocktail list isn't as extensive as some other places, but the ones we did have were unique and well made. Nice wine list overall, though the mark-up on bottles is fairly high (even for SF). \n\nNice experience even though our server could have used a bit more training. We'll try again, for sure!", "author": "Sarcastic T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-08-25", "description": "Found Level III via Yelp and Opentable about 6pm on a Saturday night.  All the usual, \"hot\", places were already booked, but I figured I'd try something new.\n\nDecor - definitely a bit bright, music too soft.  Hotel-ish, (it is in one).\nCrowd - sparse.\nLevel 1 - Cross-cut chips w/blue cheese.  Great.  Of course, we're lovers of blue cheese anything.\nLevel 2 - Vegetable and shrimp tempura.  Very tasty.  Sauce was unique.\nLevel 3 - Mac n Cheese.  Excellent.  We both loved it.\nLevel 3 - King Salmon - Kind of bland.  It was mixed with sea grass, a few different tomatoes and a broth.  The tomatoes were very yummy.\nLevel 3 - Tuna.  She loved it  I'm not a fan of raw tuna, so I'm not gonna comment.\n\nOverall, we loved the food, but the place is just too quiet for a Saturday night.  It worked out well though for our date. :)", "author": "shawn p."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-08-07", "description": "A few of my friends and I made our way to Level III a few months ago.  I really liked the space/vibe, but since the place was still rather new, it was shall we say...rather empty as well.\n\nThe restaurant itself opens up to the rest of the hotel floor and bar.  Which was nice I guess.  You can see the comings and goings of the guests etc. etc.\n\nFood wasn't outstanding, but it was tasty and we did enjoy it.  Among the items we ordered, were mac & cheese, bistro fries with parmesan and parsley, American Kobe beef sliders, and oysters on the half shell.  I know there were a few other things ordered but I can't remember.\n\nI'd definitely come back and give this place another go.  Hopefully by this time word  has spread around thereby bringing them some more business.", "author": "Jennifer H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-02-18", "description": "** My fiance informed me the tip was returned right away! It still happened but Thank you for fixing it right away... 5 stars for Level III!\n\n\nWent to dinner on Christmas (Back up I go through spurts when writing reviews...) Anyway, Went to dinner on Christmas and had a fairly good time with my fiance. The food was tasty, but took a long time to make it to the table. The waiter was kind enough to notice so he comped the drinks. Because of the holiday I won't be mean, and I am actually glad they were open because it gave us a pleasant evening out of the house together. My only gripe was that we left a VERY nice tip in cash at the table and they still charged a tip on the cc... NOT COOL LEVEL III", "author": "Miguel V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-02-03", "description": "Came here for an anniversary dinner with my g/f.  We both got the prix fixe and paired it with wine.  We were really happy with everything we ate except the over exaggerated pepper on our filet mignon.  Way too overpowering... once we scrapped the pepper off, it was great tho.  We got the tuna tartar, filet mignon, cheese and panna cotta for dessert.  \n\nAs for the service, our waiter was attentive and well mannered.  Four stars for this place.", "author": "Dalia A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-06", "description": "You know there's something about you, baby so right...\n\nOk wait that's Level 42. Level whatever, this is the theme song you feel when you step out of the space-age elevator and walk into the swank Level III lounge. \n\nI couldn't live you without you , baby tonight. \n\nThe food was very good, my bouche was amused and all following courses: salad with pancetta , salmon with spinach, and trio of mini ice cream sandwiches, were tasty and paired well with wine.  Presentation and service were top notch. I'll be back soon, perhaps to try the happy hour menu after a hard day of work or shopping!\n\nSomething about you, the way you are so right...", "author": "Sarah B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-09-09", "description": "Came here for the first time with a group. Actually I was meeting them here. So I came in a little after 6 because of traffic and didn't know this place had food during happy hour. I had wondered why the place was kind of empty for such a beautifully designed room. So I went to the bar after saying hi to everyone.\n\nI ordered my cocktail and that glass came out to be $14.00.  I talked to one of my friends and even he said his shot which was $5 at happy more than doubled afterward. Now I know why the place was empty.", "author": "M C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-09-09", "description": "When you walk in the door, of course you are entering through the hotel; but it smells so good! \nYou can take the \"Willy Wonka\" style elevator up to the third level which is the restaurant. The interior is very uniquely decorated and the seating is very comfortable. \nThe menu is on the small side but they offer some great snack type options if you just want to have a few drinks and a small \"bite\".\nMight I suggest the nut tray- they have an outstanding selection of nuts and the presentation is really neat.\nI would surely go there again!", "author": "Janell D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-10-19", "description": "Three things to note about this place. Food, service, and set up. It's in a hotel lobby. All be it a very nice hotel lobby, it's still not like you're in a restaurant as much as in a lobby. Service was pretty sub par. And by service I mean our waitress. We brought a bottle, which she spilled on my menu, and cleared away before we had completely finished it. Had we not been late for a play those would have been fighting words. \n\nThe food however was worth every bit of anything we had to put up with. I was stunned with how good it actually was. We had the short ribs and the Salmon lobster plate. \n\nI recommend against desert though. It was big enough for a pixie and not for an adult.", "author": "Casey C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-09-04", "description": "Surprising!\n\nI went here for an early dinner Sunday with a small group, so it was pretty quiet but hopefully that was based on the day of the week. \n\nWe all enjoyed the multiple appetizers we ordered- mac & cheese, fries, sliders, ahi tuna, tempura. \n\nService was also very friendly and our food came out quickly... however our cocktails took a v-e-r-y long time, so long that even our non-cocktail drinkers were wondering what was going on.\n\nThat was weird. \n\nOverall all, though, I did enjoy my experience. I might try it again on a Thursday nite, for HH!", "author": "Nenette Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-10-05", "description": "I made a reservation here for my birthday dinner on a Friday night because it was one of the few restaurants that still had tables available on OpenTable by Wednesday. Normally, this would be a big warning sign, but I had always heard mixed reviews about this place, so I didn't give it much thought since I had been wanting to try it for some time. \n\nWe arrived a little late for our reservation, but it was no problem because the place was so empty you could've heard crickets chirping. Besides one other group of people a few tables away, we were the only diners in the restaurant. \n\nDespite the lack of patrons, I really liked Level III. They have a $39 prix fixe menu that has many nice choices from the menu that add up to well over the price of the prix fixe. I ordered seared scallops, filet mignon, and a fruit filled creme brulee. The scallops were a little lukewarm, but cooked just right. The filet mignon was super soft and tender. And finally, the creme brulee was to die for (I don't even really like creme brulee). I also had some of my bf's new york steak, which made me regret my filet mignon. His steak was so juicy and melt in your mouth I totally foodgasmed. \n\nI think this place is a little underrated. The general complaints I've heard from people is that it's expensive and the food isn't that great, but I think if you go with the prix fixe menu, it's not really more pricey than many of the other nicer restaurants out there. The food is pretty good too; no complaints here. If you need a last minute reservation at a nice restaurant because you failed to think ahead, this is a great option.", "author": "Danny L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-06-27", "description": "The food was reasonable and the atmosphere was right up my alley - calm, casual, private and chill. But the service was so horrible, it takes away 2 of the 3 stars the food deserves.  Our waitress forgot our drinks, then after remembering 20 minutes later, had to give us the bar menu again because she accidentally gave us yesterdays bar menu.  Whatever, things happen... so we order new drinks, which take a good 20 more minutes to come out.  We order our food and the wrong thing is served... I dont let the waitress know because she's having a bad day is my guess.  I wanted another drink, but she was nowhere to be found.  Ok fine, don't take our money, but then it took 30 FULL minutes to get our bill.  Completely ridiculous.  It was honestly like anytime this lady came over to deal with us, she immediately went to take a dump right after.  Totally lame as we had high hopes.  The food was ok and the drink menu was pretty awesome (backlit ipad-ish type menu), but that's as good as this place gets.", "author": "Trey W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-15", "description": "I would say 4.5 stars.  The food is very tasty - every bite and every dish has great flavor and imagination.\n\nthe restaurant is in the lobby and I wish they would have closed it off in a separate room from the lobby,..\n\nServers must be new as they were a bit inexperienced and seasoned...but for a hotel restaunrant what should I expect?  Well what about Minna that is in a hotel.  Americano or Cuba de SF or Cortez.\n\nIn any case- great times, great food, and great company was a fabulous night....", "author": "Rob C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-06", "description": "My hubby and I loved our dinner the food was amazing however one of our waiters was just ok  he seamed put out by helping us and gave my husband the wrong change back on our bill. But on the up side we did have a really great waiter that sat us for dinner and helped through our meal he was exactly the kind of guy you want to serve you at a place like level III ask for Joseph he was amazing!", "author": "Jayme E."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-11-13", "description": "I would call the service bad here, but I'm not sure we actually had any service.  Sheesh.  This place will fail, and very soon, if they don't get their act together on the service front.  It is an absolute failure.  \n\nMenu was limited though relatively interesting. Food was prepared reasonably well, but was nothing special in my experience (especially given the price point). \n\nDrinks were insultingly over-priced, and the tonic in my G & T was flat.  Nice going guys. Why is it always that the super-expensive drinks are the absolute worst prepared?  \n\nWent on a Wed at 8pm, there were only 2 other tables dining. Despite this nearly empty restaurant, the service was extremely slow, inattentive, and disinterested. We stood at the empty podium for 5 full minutes before someone appeared from the back to grudgingly take us to our table, with no apology. In fact, they tried to walk right past us until we spoke up.  They made no attempt to explain the menu or offerings (even when asked), or make us feel welcome. Seemed like they should have been working in a crappy diner somewhere, instead of a nicer restaurant. Truly inept on every level; maybe the manager went home early that night because it was so empty.  If they keep it up, they can all stay home when this place goes under.", "author": "Artie D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-03-17", "description": "Some girlfriends and I went here for happy hour.   My friends had a couple of their happy hour drinks and didn't like them, they were \"disgusting\".  We had garlic fries as an appetizer (yummy!).  \n\nThe place is nicely decorated, a comfortable place to chitchat.", "author": "Phuong H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-14", "description": "Yummy crunchy French toast, great espresso, and fantastic service!  Would come again most definitely!", "author": "Janet Y."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-12-14", "description": "I had read about the renovation of Level III and by the looks of the pictures and the articles I was very curious to check it out.  I must say that the review was much nicer to it than I am.  It did look nice inside but honestly wasn't anything more than a glorified hotel bar.  We had a bunch of appetizers that were very good but nothing to write home about.  Happy Hour was a good deal for the appetizers and it was a perfect location for us since we were seeing a play but I wouldn't go out of my way to go here again.", "author": "Blake B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-26", "description": "The restaurant is located on the 3rd floor/level of the Marriott resort. The decor was very nicely put together. Very modern, and if you're lucky enough for one of their booths, very private. It wasn't too crowded for a Friday night, but maybe it's the economy.. who knows... We were seated promptly, but.. that didn't mean we were noticed promptly. We probably sat there for about 20 minutes before our server came around with water. Then waited a few more minutes to receive the additional drinks we ordered. But that was the last problem we had as she became very attentive for the rest of the night. \n\nI started with the Lobster Bisque, and my boyfriend ordered the French Onion Soup. Both VERY delicious. The French Onion soup was not too salty, and perfectly cheesy. And the lobster bisque was creamy. For our entree, I had the King Salmon Sautéed Spinach, Glazed Pearl Onions and a Tarragon Buerre Blanc  and he had the New York Steak with Roasted Chestnuts, Haricot Verts and Truffle Veal Jus. The new york steak was awesome!! very delicious and tender. the salmon was very nicely cooked and flaky, but wasn't as tasty as i had hoped it to be. For dessert, we had the ice cream sandwich.. YUM!!! oh man, little pieces of heaven. I wanted to order a dessert wine but didn't know what would go great with the 3 cheese platter we had, our server brought back a delicious Gewurztraminer (but didn't get the name), and also brought a pretty big tasting of a port she likes (no charge). Very nice gesture on her part.\n\nParking is non-existent around here, but, what can you expect with the neighborhood.", "author": "My C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-23", "description": "Came here for lunch with my best friend after reading the reviews. The food was delish! The tables we sat at were comfy & cute. \n\nIt's also a good place for meeting clients and business associates.", "author": "T G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-12-30", "description": "Cool place in the heart of downtown for a Happy Hour bite to eat.  The mac n cheese, kobe beef sliders and seasoned fries were tasty, but I can't weigh in about the other items on the menu, though they looked yummy in theory. \n\nWhimsical drink list too.  Yummy caiparenia's.  The waitresses my party encountered were sweet but the place was pretty dead so yeah.  Drinks are about the price of most bars of this ilk in this area so be prepared to live with that.\n\nThe decor I could take or leave.  Seems like it lacks longevity but maybe I'm wrong since only time and consistently good food and service will tell.  Overall a cool place to grab a stiff drink and share some mac n cheese with friends after a ball busting day at work (4pm - 7pm M-F).  And pretend you're living Sex and the City or some madness.", "author": "Margaret L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-09-15", "description": "Overpriced food and wine list - even more so for a Marriott. Service not bad but why does the waitress have to kneel on everyone's booth (seat) to take the order? I don't even see that at Denny's. Some diners dressed like slobs.\n\nOrdered Filet Mignon and clearly specified 'medium rare', came out medium well. Glad I went but would never return on my dime.", "author": "Bobby J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-05-09", "description": "Went for happy hour: \nDecor is great, food has generous portions, drinks and food were dirt cheap, service slow. \nBut where is everybody it is a huge space, with zero ambiance, an elevator music...that you barely hear...", "author": "Carpe D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-05-29", "description": "Great food! Everything we had was awesome... Pre-fix menu: scallops, filet, dark chocolate dessert. $39 Perfect atmosphere, service and food.", "author": "A M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-08-07", "description": "FAIL.  \nThis bar seems to think because Bourbon & Branch can charge $15.00 for a drink, they can too. The decor is lovely, but  bar is much too large.  The small drinks taste like they were made with generic mixers picked up at Safeway.  It is a shame as they sounded wonderful.\n\nAs for the food, the portions were generous, but they were bland.  Had I paid full price for the Mac & Cheese, I would have been very annoyed.  \n\nIf you want to grab a drink away from the Union Square crowds, I'd consider this place, but stick to beer and skip the food.  Honestly, I think you can do better elsewhere, though.", "author": "She-Ra .."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-01-11", "description": "When we book this place for dinner we didn't know that it was in the Marriot.  Just a FYI like others has mentioned.  The restaurant is on the same floor as the lobby and it's open to the lobby.  I was expecting something more intimate, again just another FYI.\n\nI tried the prix fixe menu paired with the wine.\nI think we must have caught them on an off night because I think our waiter wasn't a waiter.  She was a bit challenged with English and wasn't familiar with the menu.  She was super courteous though.  Also there were only three other parties in the restaurant when we at (we had an early dinner) and the food too a VERY long time to arrive.\nThe scallops - they looks great on the dish but mine had some grit them!  The chorizo wasn't as tasty as I thought it was going to be either.\nThe fillet mignon looked great on the plate at it was tasty  Not the best but good.\nThe dessert the 'warm apple pie grunt' was good, we all loved it.\nThe wine pairing (for the price) was a good deal and to me matched the food pretty well.  Unfortunately the food took so long to arrive I had finished my wine before the food came.\nThe kids had the Mac and Cheese - and as others have said, it's very good.\nSo - for the price that I paid it was good.  Very good for a Marriot hotel (I eat in a lot of Marriot hotels).", "author": "R P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-20", "description": "The hotel is very nice, free valet parking because we were dining at Level III.  The food was casual but detailed.  The kobe sliders, lobster bisque, tuna tartare were all very good.  The chicken sticks and mediterranean mussels were mediocre.  It was very quite there, hardly anybody... In a way, it's nice because we felt very private.  The private booth table they gave us was great.  Overall it was a great experience.", "author": "Jay T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-19", "description": "My friend was visiting and staying at the Marriott, so we decided to try Level III. Well, when I got out of the elevator, the restaurant was kind of hidden. The decor was not bad, quite bright and fun. The table was spacious and it felt comfortable. \n\nI ordered the prix fixe three-course dinner. I started with tuna tartar, which was right on and delicious. Then, my main course was absolutely fantastic. It was a white fish in a tomato broth. The flavor was subtle, and compliment the fish very appropriately. Then I finished with their cheese plate, which was also fantastic. The cheeses were served with grapes, pear slices, strawberries, dried fruits and nuts. It was a great way to finish dinner.", "author": "Jose K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-30", "description": "I was here for dine about town this past year. I have to say the food was amazing! The three courses and wine pairings were spot on and and delicious. Our waitress was also very attentive and sweet. \n\nI started with the beet salad, followed by the filet mignon and ended it with a cheese plate for dessert. Everything just melted in your mouth.\n\nLevel III is a hotel restaurant which is not busy at all and the ambiance is not the best but it is warm with red decor and high ceilings.\n\nI would have never guessed that the food was as amazing at it was. Totally underrated....definitely recommend this place.", "author": "Kalifornia S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-11-21", "description": "I went to Level III with my Bf as a guests of Nirvino Mixology Contest. We ordered several appetizers and it was really good.  If you don't know what to order, try some of these foods:\n\n1. Mussels  ( Can't miss It! )\n2. Mac n Cheese ( Simple but the taste was standing out! )\n3. Tuna Tartare ( Even it came in the small portion but it was gooddd!)\n4. Gin Gin Mule ( It's easy to drink, good start of the night )", "author": "Sasitorn O."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-02-15", "description": "Went here for a V-day dinner w/ some ladies.  The food was pretty good.. I particularly enjoyed the Kobe sliders, fancy mac & cheese, and fish tacos.  Less mentionable--the squash pasta.  Just tasted like squash, not much else.  I had a pretty good drink.. I think it was called Sunset Over Dunnagan or something like that?  Tasted like grapefruit wine.. yum.  Also kind of cool, the manager came out and brought us a round of fruity pink shots (which I didn't drink).. it was a nice gesture.\n\nThe cons.. it's kind of a weird space.  Very hard to tell where the lobby ends and restaurant begins.  Had a hard time finding the hostess to seat us.  And they definitely jacked up the prices for Valentines day (booo lame fake holiday), thankfully the manager let us order off the regular menu and not the prefixed $70 menu (ugh!)  Our server was kind of.. awkward.  Left dirty dishes piled up next to us after she gave us the bill (which was before we got our last drinks).  I'll go easy on her though, must not be easy serving lovey-dovey couples on vday.\n\nBottom line-- the food was great but pretty expensive.  The deco/ambiance is a novelty that wears off.  Service was ehn.  Probably wouldn't come back, but it was fun to try.", "author": "Christie C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-05-25", "description": "Fantastic opening party - very, um, colorful!\n\nHave been back for drinks and bar noshes.  One word. YUM!  Cocktail waitress was very attentive, but not over the top.  Beverages were perfectly prepared... even the gin martini I ordered accidentally. (I forget my friend will swap between gin nights and vodka nights, so when i pointed to her glass and asked for \"one of those, but a bit dirty\"... i got a dirty gin martini.... for someone that does not like gin, that was not the best move...!) I digress.  The food was great - can't wait to go back for a real meal.. The truffle (aka crack) mac and cheese was wonderfully decadent.  Chicken stix, mixed nuts, steak au poivre, can't even remember what all we tried. All great!", "author": "Danielle R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-18", "description": "The third floor of the hotel includes this Level III restaurant, the bar, the lounge and reception. A bit confusing but the decor is fabulous. \n\nWe sat at the high back booth and it was a quiet night, they've only been opened for about a month and I guess the word hasn't been out yet. \n\nDrinks a little on the expensive side $12- $15 but they are nice and strong. \n\nWe've ordered the veggie tempura, Mac N Cheese & Kobe sliders. The Yuzu soy sauce that came with the tempura is amazing....I put some on my MacNChesse.\n\nThe MacNChesse was a little bland for my taste but you can tell it was made fresh. $ 9 plain, $15 with Lobster or $17 with black truffle. \n\nKobe sliders were wonderful, it comes in 3 and the meat was lean & juicy. I wish it came with different sauce though....\n\nDessert we had Donut bites and it has this amazing mini Churro.....and it MELTS in your mouth. The dount balls are only soso but they give you warm chocolate sauce to dip in. If you are a churro fan...you've gotta try this. \n\nOverall I think it's a good deal consider the location & ambiance. Real relaxing and service is very prompt and friendly. \n\nDefinitely way better than most hotel restaurants!!!!!!!!!!!!!!!!!", "author": "Maggie C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-02-01", "description": "i would have given it 5 stars, but the service sucked. the waitress was really stupid. came here with a bunch of girls and we ordered a lot of stuff and she couldn't remember a lot of what we ordered. can't u just write it down? simple as that. then she still forgot one of are orders and acted surprise, like we didn't order it in the first place. also we ordrered crab sandwhiches, but gave us pull pork instead. when we told her, she was like \"oh no, the kitchen messed it up,\" but when we got the check it said \"pull pork\" can't u just admit u were wrong and say sorry. she was nice, but just stupid... also they gave us bread when all the food came out. aren't u suppose to give it in the beginning? luckily the food was really good or else....n e ways back to the food\n\nthe scallops were the first dish that came out and that was really yummy with a lil bit of bacon, the tuna tataki was my fav. never had anything like it with a lil bit of avacado and tanderines. the flavor is so good that i can't even describe it. the mac and cheese was light and so delicious. it comes out in a big pot. the dish is huge. the fries were cispy enough, the short ribs was super tender, the crab cake mini sandwhiches were also another favorite. crunchy and a lot of crab meat, flat bread artichoke was great, but the desserts sucked. also the place is inside jw marriott. it looks like a lounge more than a resturant, but super spacious and very cute. would come back here just for food, but hope they have smarter waiters.", "author": "Karen H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-11", "description": "We were staying at the JW and decided to try the restaurant since we were too tired to go elsewhere....GREAT CALL!!!  The set up is kind of ackward....whenever I was in the lobby I couldn't tell if it was a restaurant or lounge or what?!  An open space \"no boundaries\" type concept.  Yes there were crickets chirping and no creatures a-stirrin' i.e. lots of empty tables, but what the hey...don't knock it til you try it.\n\nFOOD HIGHLIGHTS:  Manila claims with bacon and bread crumbs-you only get 6 :(   Steak and fries - steak and fries were amazing, ahi tuna/poke...drinks are great too...I had 2 of the one with absinthe and passed out when I got to the room.   According to the waiter, the chef was trained/came over from the French Laundry to help them set up the menu and such.\n\nLOWLIGHTS:  The mac & cheese, it was lukewarm, runny...there are so many great alternatives, stay away from the heavy starch, your tastebuds will thank you!  Oddly enough the chef's amuse bouche was gross....crab roe with lump crab meat and applesauce...Mott's must've been on sale somewhere.  \n\nThe manila clams were so awesome....just a dusting of bread crumbs and enough bacon to add to the flavor and a wonderful coconut milk sauce over that.  The combination of flavors and proportion of ingredients were perfect.", "author": "Rafa D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-08-19", "description": "I found Level III on Opentable.com.  My girlfriends and I like to try new places and this was perfect before we went to a show last Wednesday.\n\nOur bartender, John, was absolutely wonderful.  I asked if the Shanghai drink special was worth $15.00 and he informed me it was happy hour, so it was half price.  It was delicious, so I had two....worth the $7.50 any day of the week.  I have no problem paying $7.50 - $9.00 for a really good cocktail but would have trouble paying the full $15.00 price. \n\nI did have one issue with the bar itself.  I was moving my drink out of the way so as not to knock it over.  There is a flush light fixture that runs the length of the bar, built inside the bar itself.  Well, when I went to slide my drink out of the way it got caught on the lens of  the fixture (I guess it's not really flush at all when you think about it).  I ended up spilling some of my drink which I wasn't very pleased about.  It wasn't a lot, but enough where I needed a couple of napkins.\n\nOur server, Jess (short for Jessica I think - but after two Shanghai drink specials I asked if we could call her Jess and she was more than happy to oblige) was equally friendly, very pleasant and down to earth.  She got us exact directions to the SF Playhouse, none of us had a clue to where it was.  \n\nAs Tasha said, the ham and cheese and sliders were yummy, as well as the tempura veggies with dipping sauce.  None of us were that impressed with the chicken salad, it lacked flavor.\n\nI loved the decor and the open feeling to the place.\n\nI will definitely go back when we're not so rushed.  I could have stayed longer but we were  rushing to make our 8:00 show time.", "author": "Judy B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-04-04", "description": "Great food with great services!! Love the steak and scallop!\nWe are very greatful to have Michelle to give us the BEST friendly service!! We will sure go back!", "author": "Jenny D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-05-27", "description": "This restaurant is inside the JW Marriott and 2 blocks away from union square,  I have two things I want to say about this place, Kobe burger and fries.  When I first walked in, I did not quite understand the setup and it was bit confusing, one side is lounge and the other is dining.  I instantly feel in love with the decor and then a very attractive waitress appeared and said we can sit anywhere we like.  My hubby was in a mood for a burger, he ordered it medium well, and we split it,  The meat was fresh and perfectly cooked, the bread was a Kaiser roll, sauteed onions, sharp Cheddar and when I bite into it it was dreamy--and I am NOT even a burger girl.   At approx 15 dollars a plate, it is a bit pricey but sometimes you have to treat yourself.", "author": "Violeta H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-09-14", "description": "Very good food, and good service, but eerily empty on Labor Day for dinner.  I am a big fan of JWs in general, but this one was kind of a disappointment.", "author": "Jonathon S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-07-17", "description": "This place is great to have a meeting with a group of friends. I noticed several cocktail events going on while I was in the back with a book meetup. We all ordered beer and few of us ordered food. The fries looked deliciously seasoned, but the topper of the night was the chicken quesadilla. It was over flowing with goodies! The waitress was great. She never forgot about us which I was surprised she didn't because of the large cocktail party going on and us being the only ones hidden in the back of the restaurant. We will definitely be back for the next book meetup.", "author": "Casi C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-07-10", "description": "Came here with Todd and Nikki. It was good, but not remarkable. \n\nWe took the elevator up a few floors and found ourselves both in the lobby and in the restaurant. It is really blended with the giant hotel lobby, which was sort of strange. Happily, our table was behind some sort of mini-wall, so it wasn't agoraphobia-inducing. It was a Thursday night at 7pm, and the restaurant was nearly empty. Presumably this was because it's brand new, but it was a little weird, but also nice.\n\nOur waiter was good, friendly and funny. He obviously had some time on our hands, and was very interested in our reaction to everything. Good stuff.\n\nThe food was good. We got the potato chips (called crisps or something like that) with an amazingly rich blue cheese dipping sauce. It was hard to believe how they got so much flavor into this sauce. We shared truffle mac'n'cheese, lobster mac'n'cheese, chicken stix (chicken on a skewer with peanut sauce), and little mini burgers. It was all quite tasty, but none of it knocked my socks off. Which was fine, because that would have been awkward. \n\nAnyway, I enjoyed it, but with so many awesome restaurants in SF, it's hard to give it a higher rating. Maybe I'll try it again in a few weeks and adjust my review.", "author": "Josh O."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-01-04", "description": "Highly disappointing, especially with so many other great restaurants around.  \n\nEverything was on the heavy side: buttery, creamy, and / or fried.  While i'm a fan of all those things, just not for every dish.  The drinks were inventive, but the tastes weren't.  Lots of good ingredients, but mixed completely wrong.  \n\nMade me think that the sub staff was on that night, but it was a Saturday night at 8pm, and the place was empty.", "author": "m k."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-11-28", "description": "I had been to Level III for their opening night party a few months ago and decided to stop back in again to show my boyfriend.  It was Thanksgiving weekend and we were giving THANKS that we didn't have any crazy plans with travel or family and stopped in to see what Level III had going on.  We sat front and center at the bar and had the perfect set up with a flat-screen TV playing that day's football game and one of the BEST bartenders I've found in this city for a long time..Jon. \n\nJon was awesome!  He was super attentive and provided the perfect balance of checking up on us while giving us our privacy as well.  We ordered the kobe beef sliders (amazingly yummy) and I enjoyed 2 generous glasses of champagne while my boyfriend tried a few of the beers on tap.  Hour 1 led to hour 2 and we decided to stay for an entire meal and more libations.  We were not disappointed.\n\nThe service was exceptional and the food and drinks were very good.  We will definitely be back to visit Jon again and to take in the modern approach that Level III plays on the otherwise typical hotel lounge.  Private flat-screens, a roaring fireplace, an interesting and diverse wine list and a hip, fun menu!", "author": "Tiffany S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-05-03", "description": "All i can say, is the Mac and Cheese is BOMB!!! The rest of our meal was good too. :)  Service was great and our waiter also gave us tips on some cool spots to hit up.  If i ever get the chance to eat here again i will!", "author": "Erica O."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-08-24", "description": "Went there for lunch on a Sunday afternoon with 5 people. \n\nFood: \n\n- bistro fries are ok \n- selection was not great\n- little pricey but it's a hotel, what can you expect? \n- club sandwich was uninspired, Kobe beef sliders were cooked pretty well though \n\nService: \n\nI docked stars from my review because the service was so freakin' bad. We were the only customers in the restaurant for most of our meal (one other small group of 3 people showed up halfway through) and the waiter was completely incompetent. Not sure if he was filling in, but he brought out bread way too late. Only brought 3 bread plates for 5 people (then finally came out with 2 more when he realized his mistake). Was opening my coke and pouring it into a glass--he missed the glass and poured it into my water glass. Didn't replace it with a new water. Had to ask him 30 minutes later when he finally came around again to check on us.  No spoon or plate brought for tea and tea bag. Took forever to get the check, had to ask for it twice. \n\nYou're supposedly a fancy restaurant in a hotel, but your service is so crappy. Lehm.", "author": "Ashlee T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-06-22", "description": "Note to all brunch fans - if Level III is your destination, go by 11. You'd think they'd extend breakfast on the weekends till the afternoon, but that is not the case. We got there right after 11, and after putting our order in, the waiter came back to say they were no longer serving. We were going to leave, but after a bit of double checking, the waiter came back to tell us they'd go ahead and make our order. It was not a good start.\n\nFortunately, the food was excellent.  Since perusing their menu online, I had been obsessing about their French toast - wheat bread dipped in egg beaters, complemented by grilled cornflakes and fruit. Ah, yeah. It tastes as amazing as it sounds. And my friend had no complaints about his eggs benedict.\n\nFurther props for the good service, including letting me sneak a no charge taste of their house granola in the breakfast buffet. The only thing keeping this from five stars was the prices (bit steep) and decor (red carpets? tacky). I probably won't race back for dinner, but would definitely recommend Level III for brunch, er, breakfast.", "author": "Jason B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-10-15", "description": "Great setting, and the food was A-mazing! I have to say it's the best dining experience I had in San Fran. I had an incredible chicken dish (honey almond, I think) and it was melt-in-your-mouth delicious. Next time I'm in the bay area, I will definitely be visiting this place again.", "author": "Kellie W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-09-07", "description": "Social food. What an annoying choice of words to reiterate that small plates are conducive to sharing. I'd been keen on trying this place, so took my hawt (yet gimpy) date here before tonight's Sarah Silverman show. All-in-all, it was pretty good. The space could use more definition between hotel lobby versus restaurant, but is nicely appointed. We dug our private round booth, and both experienced \"the Big O\" upon tasting their Gruyere-laden lobster macaroni and cheese. While I wouldn't go out of my way to come back, I'd definitely do so if pimping in the area.", "author": "Gregor G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-01-23", "description": "Came here for Dine About Town.  Had the mixed green salad with berries and fresh vegetable with portebello ravioli.  It also came with a mini ice cream sandwich and coffee/tea.  It's a good bargain for $17.95.  Food was decent for the price but not spectacular.  They also had 2 hour validation valet parking so overall, good deal, but I would pick a different restaurant next time - not worth coming back a 2nd time.", "author": "Irene C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-13", "description": "I thought that the relative hype about this place would leave it as a music-too-loud-people-everywhere bar/restaurant. I was very happy to learn that it was nicely laid out to provide privacy for people in the booths and also had no thumping music playing. Imagine being somewhere where you can actually hear your friends/date talk!\n\nWent here for appetizers and drinks before dinner.  They have some of the best french fries ever!  The mixologist is very good and creative with drinks that work right and leave you wondering if you should order a second one or try something else.  I had the Golden Gate Fog and Shanghaied drinks, both which are excellent.  The waiter was attentive and gave us absolutely no pressure.  As we were only there for appetizers, I was almost sure he'd pressure us to order something from the main menu as we were there for an hour and a half. I was pleasantly surprised when he wasn't pushy that we had hardly ordered any food.  \n\nWe would definitely go back!", "author": "Kelley P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-01-21", "description": "Hit or miss.  I can see how this place would be good for drinks and small plates, but for a dinner spot, there are better options.  \nWe brought a bunch of older (read: picky) ladies last week and were disappointed to see that they were ONLY serving from the Dine About Town menu--meaning picky old ladies did not like the limited options and immediately wanted to go elsewhere.  Thankfully, they allowed us to order off the general menu, which was greatly appreciated.  Our server was very perky and friendly and did her best to make everyone at the table happy.\nUnfortunately, the food is inconsistent.  The lobster bisque was terrible--runny and watery with only bits of crab--where was the lobster?  The mac and cheese was good, but there were literally specks of lobster, no real chunks.  The sliders, however, were very good, although every order was prepared almost rare, despite a few order requested to be medium rare.  The potato crisps with blue cheese sauce were excellent, as were the tempura veggies.  \nI could see myself returning after a day of shopping for a glass (or 3) of wine and some appetizers, but not really a go-to dinner place.", "author": "Jessica L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-09-10", "description": "Considering this place for a work function I am planning. The space has a cool but high energy feel to it. Great lounging furniture and decor for a cocktail reception...I'll update this review if we end up choosing the spot.", "author": "Cat T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-08-06", "description": "...is just a ZERO.  There's a reason why this place was dead--uninspired drinks at high prices.  Decently portioned fries and skillet-sized mac&cheese at the happy hour price of $4, but they both needed a healthy dose of salt&pepper for flavor.  The space is just too big, bright and open.  Wouldnt go out of my way to come here.", "author": "brewgirl b."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-01-27", "description": "First off, don't get fooled by the stairs leading up to the round glassed off staircase that goes down.. it's not the entrance.  You actually have to go up to the 3rd floor / hotel lobby/registration to get to the restaurant.\nThe way that space is laid out, it's confusing as to where to find the hostess, but we found her.\n\nWe enjoyed the food but really can't say the same about the service.  With a restaurant that's located within a upscale hotel, we thought the service would be one of the selling point but we were thoroughly disappointed.\n \nWe made it there between there happy hour 5-7PM, and were glad to enjoy the half off cocktails and wines.  \nSince we were there for the Dine about town, we tried their 3 course menu.  The steak was very tasty, the salmon was excellent with crispy crust but soft and moist.  The vegetables are great.  \nWe liked the lobster bisque, but we both thought the soup would be creamier than what was served.  Nonetheless it is still very delicious.\n\nWhile we just got our desserts, our waitress put the bill on the table with the dollar sign up.  We were kinda of shocked.  Then as we went on taking a couple of bites, she came back and expected the bills to have been paid.  It took us at least another 10 mins to finish the 3 ice cream cakes, and it was just really odded that she rushed us through to pay the bill.  There were plenty of empty tables around us and we didn't ask for the bill so it really was rude for us to get that bill at the time it happened.\n\nThen when we were ready to go, we couldn't find anyone to get us our coats.  Some staff member helped and then they have to hunt for our coats where eventually we were ready to leave.\n\nI am not sure if I will be back anytime soon, as the regular menu looked pricey, and I am not impressed with the service at all.", "author": "Cynthia C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-10-04", "description": "I agree with the previous post here.  It is like Wille Wonka.  And the sad part about this is that its predecessor, the Pacific Grill, which was overpriced and bland in taste, looks better than this newly renovated cafe.   Nothing really appealed for me at lunch today.  I was hoping that the Chicken Salad and the French Onion Soup would wow me, but it was very bland.  They give you a good amount of chicken than the weeds that they serve on your plate.  Coffee Service was abysmal.  You call that service?  The server and busperson nearly ran into each other, and then the follies continue when he forgets to bring the half-and-half.  And the joint only had 3 or 4 tables during lunch.  They weren't busy at all.  I will stick with the places across the street from the this place.  JW Marriott is a big joke.  Too bad the Pan Pacific Hotel is gone.", "author": "Tony L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-04", "description": "Went there with a group of 8.  The service and ambiance was great.  Highly recommend the pan seared sea scallops and the salmon entree.  The pound cake dessert was only fair.", "author": "Ben L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-09-17", "description": "I came here for a Friday Happy Hour, and I really liked this venue. It's kind of hidden but it is a very large space with lots of seating areas and lots of standing room if you want to mingle with different people in a large group. I can't really comment on the drinks because I usually don't get alcoholic drinks but they did offer a HH specials menu. I tried my friends' mac and cheese and fries which were pretty good. We're already planning to return in a few weeks to host a pre-event for a fundraiser event.", "author": "Lisa M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-05-14", "description": "what drew me to try out this place was the mac-n-cheese they had on the happy hour menu, b/c i love me some good mac-n-cheese\n\nthe friend and i ordered kobe beef sliders (which were just ok, not too special) + the salt and pepper fries (which were really yummy) + finally the mac-n-cheese (which kind of took a long time to come out, we honestly thought our server forgot to order it for us)...the mac was good, but was a little too creamy and i could definitely taste the gruyere\n\n2 hours spent there + good catching up time + 2 glasses of wine/person + filling food came out to about $45, which was pretty good considering...but i dont think we'll have the desire to go back again", "author": "Alice K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-21", "description": "Just went for a Dine-About-Town lunch. Nice ambiance and good service. Chowder was delicious. Rib-eye and chicken were cooked just right. It was a good portion for $18 lunch.", "author": "Kar K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-09-06", "description": "Given the size of this space they'd have been better off putting in pool tables or air hockey.  What a waste.", "author": "Greg P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-04", "description": "Recently had dinner for a party of 13. The restaurant in general looks pretty current with the nice design and layout of furniture and tables. I thought it was a great spot for dinner.  The food was good and the wine was refreshing.  Enjoyed the company at dinner talking bout life and all that good stuff you talk about at dinner.  Overall it was a plus in my book, just marked it off my list of restaurants to check out.  As with any other reviews that you are reading, go out and try it yourself and see whats up.  Go get off that chair and stop spending your whole time on the computer, smile and enjoy your life.", "author": "marcus o."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-12-08", "description": "I checked out this venue for a Nirvino event, so all my drinks were free. The happy hour prices looked fair, but other than that I wouldn't pay the prices they want to charge. The space is REALLY large and so has tendency to feel empty. I personally don't see it as a destination for locals, let's hope the tourists keep them busy.", "author": "Nikke G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-03-12", "description": "happy hour bargain at it's best.\n\nwe're all trying to save money, but then again... I would also like to contribute to the economy and spend some money.  but it doesn't mean I need to spend the BIG bucks to have a good time.  okay, let's start this review:\n\npros / classy place, lots of room, good drinks, and great appetizers.  I just went for the happy hour prices and they're GREAT.  I had a 3 dollar beer and the 6 dollar kobe sliders... both a great deal if you ask me.  I wanted to try the mac and cheese... but I'll save that for next time.\n\ncons / not much really.  it's around the union square area... and I work by the ballpark and live in the east bay.  but every once in a while, you need to get out of the box and explore.\n\nsooo... support the economy and try to add this place for a new place to check out.", "author": "Walter M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-11-10", "description": "Came here for happy hour drinks and apps. First off, it is located in the lobby level of the JW Marriott hotel on Post Street, about a block from Union Square. Grab a seat by the windows and take a peek at the cocktail list and snack menu. Chicken sticks with peanut sauce, your typical Thai style satay. Sweet potato fries, a substantial portion, crisp, sweet, with your choice of seasoning (salt, pepper, garlic, parmesan, or all of the above.) Artichoke dip, featuring house made tortilla chips, which in my opinion was the star of the dish. The mixed nuts were a pleasant surprise, actually a tower of various nuts-smoked almonds, wasabi peas, cinnamon pecans, glazed cashews, and spicy peanuts.  The cocktails we tried: blueberry lemonade-blueberry vodka, fresh blueberries, not too sweet or sour, but very refreshing, pumpkin martini-fresh pumpkin puree, nutmeg, cinnamon, and vanilla vodka, sweet but not too, like pumpkin pie in a glass, blue cosmo-with blue curacao and white cranberry juice, was a little too sour. The downside of happy hour is the $5 drinks doesn't include the specialty cocktails, so we ended up paying full price for all of them. Still, it provided a good escape from the street for a nice afternoon buzz.", "author": "Coren D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-04-03", "description": "this place is awesome... the drinks during happy hour are the bomb and the view is great..... was here just last week for drinks on sunday night", "author": "Ronny O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-15", "description": "This has become Brian and I's Sunday afternoon hang-out, lunch spot and sports bar. It's convenient to our house, and since they recently opened, they are doing their best to determine who their crowd is. The first Sunday we arrived to watch Euro Football 2008 and the bartender gave us a flight of all the red wines they had complimentary, so that we could determine what we liked, but alsowhat may or may not work behind the bar. \nAs for food, we have enjoyed the Mac n' Cheese w/ black truffle oil (lovely!), the sliders (awesome!), Tempura (tasty!) and the French Onion Soup (delish!).\nWe enjoyed ourselves so much, we made it back the next 3 Sunday's to watch Euro games and eat and drink.\nI have nothing to base my review on a weekend or happy hour, but for a cool non-pretentious hang out, with cool staff and strong drinks, this nails it perfectly. And this is a hotel lobby??? Yes, which makes the people watching just an added bonus!", "author": "Jason D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-02-15", "description": "Came here for the prix fixe menu on Valentine's Day. The waiter was wonderful- very knowledgeable, attentive, and sweet. The squash/walnut tortolloni was surprisingly one of the best things I have ever eaten. The halibut was a little dry, but everything else was good. The apple grunt desert was amazing.", "author": "F B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-06-30", "description": "I will take into consideration with this review that this is a newly established restaurant:\nMy husband and I went here for dinner on Saturday night and were able to get a table next to the window right away (5).  The place is so bright with these huge chandeliers hanging down above the tables, I thought I was going to melt (2)!  The server noticed and came over right away to open the window for us (5).  Our server was very friendly throughout our entire meal (5).  They were out of the wine we ordered, so they upgrated for the same price (5).  We ordered the french onion soup (4 - smelly but tasty), the loster bisque (3 - very, very runny), tuna tartar (5 - yummy), macroni and cheese w/ lobster (4 - cheesy and tasty but not much of a lobster flavor), and ratitouille (3 - not very exciting).  The timing on the dishes was a little off, which I expect will get better with time.  The place is beautiful though and the colors incorporated in the chairs and carpet make it very nice.  The lighting, as said before, is a little too bright.  The servers were very friendly.  Maybe we will try it again in a little while when they aren't so new.", "author": "Rise G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-08-24", "description": "the atmosphere is amazing! def worth getting a drink and checking it out.\n\nthe food was ok. i got the prie fixe and was not horribly impressed.  at $50, it wasn't horribly expensive.  the ginger jello thing was weird. they said it was a palette cleanser, but it was the 1st course. weird way to start a meal. nothing was worth going back for. not even the drinks.", "author": "Christopher L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-11-15", "description": "When to lunch here today and had a really yummy chicken sandwich on brioche.  So good.  Service was great, location was easy to get to when shopping down town and this is a place I will come back to.", "author": "Jaime A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-06-27", "description": "Was hoping the decor would be a bit less hotel lobby, but, as we were sitting in the hotel lobby, that would've been difficult. It was hard to find someone to seat us, but the host was very friendly once we found him. Service was a little spotty, but the food was great.", "author": "ike s."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-29", "description": "4.5 stars!  We went there on a Tuesday night around 7 and it was pretty empty. The dining room is beautiful and the round booths nice for dates. We had the waffle-cut potato crips (delicious), mac&cheese (mediocre), bisque (incredible and unique), and kobe sliders (my favorite).  Save room for the doughnut bites, and the ice cream sandwiches are worth trying as well. The service was attentive, and they do have some dessert wines - just ask.", "author": "Derek G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-08-07", "description": "For what they are charging, the drinks need to be A LOT better than they are.  For $15 a drink, I expect a bit more than an overly sweet concoction in martini glass. Additionally, the bar is far too large and is right outside the hotel registration desk. Atmosphere / ambience is definitely lacking. Would recommend passing this place by.", "author": "MO L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-08-13", "description": "This restaurant is Amazing! We eat here alot, the Chef is actually pretty famous. Was trained in Europe, try their Fixed Price menu. You will get a better deal. Their Fillet Mignon is the Best! It's located inside Mariott. You can get free Valet parking Validation if you eat at this restaurant. The view of the hotel interior is amazing, it's hollow in the middle. You have an amazing view going up and down the elevator. I highly recommend people to come and stay here. Definately 5 stars!", "author": "Michael W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-06-24", "description": "This lemongrass cocktail I chose was amazing! I have quite a bit of a sweet tooth so it was just perfect. After a few of those, we decided to have some food. The shrimp and vegetable tempuras were on point and perfectly seasoned. The batter stayed crispy and the miso-wasabi, and yuzu-soy dipping sauces were so tasty! Of course we couldn't skip dessert! we ordered the trio of ice cream sandwiches, and the cookies  and pairings with the flavorings complimented each other very well.  My favorite was the balsamic cookies with strawberry gelato. Service was great and attentive. Friendly people and comfortable decor. I usually enjoy a scene when it's a bit more lively but then again it is fairly new and I am sure this Level III is a hidden jewel soon to be discovered.", "author": "Laianna T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-06-24", "description": "A friend and I came here and each got different options on the Dine About Town menu, so we got to share one of everything between the two of us. The food was excellent! We both loved everything. Normally I think it would be a little overpriced, but the special fixed menu was a great deal.", "author": "Nicole V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-02-14", "description": "My husband and I came here several weeks ago and was a bit skeptical because of their hit or miss reviews. We decided to give it a try since it's fairly close to us. We came on a Sunday night and it was pretty dead and I was a bit worried. To our surprise, the food was actually pretty tasty and our waiter was very attentive & nice but the restaurant was practically empty so that might be the reason. I ordered the sliders which was good but not orgasmic. My husband ordered their pre-fix: pan seared sea scallops, ale braised beef short ribs, and for dessert I can't recall the name but I think it was a chocolate cake which we were so stuffed by that time we only picked at it. He enjoyed his entire meal and I think we'll swing by another time to check out their happy hour.", "author": "Xuyen H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-12-27", "description": "After having several change of plans to our Holiday Schedule last minute my fiance and I ended up in town, just the two of us for Christmas eve and Christmas Day. Having never been in the city, almost alone, on a Christmas we weren't really sure what to do with ourselves. We decided we'd get all dolled up and go out to a fabulous dinner at the Top of the Mark, Fairmont, or Ritz and  play fancy tourist in our own town I mean ya gotta check out these legendary SF locations sometime right? Well silly of us to think we could get reservations for any of these places on Christmas day for our fabulous dinner. We then turned to yelp and opentable to find out where we could eat. We live in Nob Hill so Level III was close. The reviews were only so-so so we went in with low expectations and were just happy they were able to get us in (plus we got open table points, always a plus for mystery place). The service, although clearly bear boned staff was excellent. They were totally full and only had about 2 people waiting so they were constantly rushing around, but very apologetic for any amount of wait and very friendly and informative about the menu. The menu wasn't anything amazing, but everything we had we liked. We each had a soup then shared a few small plates. i loved my french onion soup, his lobster bisque was a bit watery, but had a nice flavor. We had the mac n cheese with lobster which was rich(waaaay to heavy for my taste, but i don't like mac n cheese), some veal dish and oysters. Everything was good. I would go back for their happy hour deals if I went again. Overall they made our Christmas evening one to remember.", "author": "Audrey V."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-01-20", "description": "I'm a bit torn with this review, and I'll try to explain why.  My friends and I decided to take advantage of Level III's dine about town menu last weekend before a big night out, and while the food didn't disappoint, the service left something to be desired.  Well, let me rephrase that - our waitress just plain old sucked.  Granted, I was the first of our party to arrive and was seated (by the manager himself), but the waitress ignored me for a good 15 minutes before the MANAGER (bless him) came and took my drink order.  Once the rest of my friends arrived, it went from bad to worse.  It took another 15 minutes for the girl to come around to take the rest of our drink orders, 30 minutes after that for her to decide to take our food orders, and then probably another half hour or more for our food to actually arrive.  In the meantime, the restaurant is still half empty, our glasses are empty, no one has come around to see if we wanted another round, and we are practically gnawing at our arms to ease our hunger pains.  All the tables around us somehow got bread, and yet no one has even offered us anything, despite us having been there for an hour at this point.  We had to flag down a busboy to beg for a basket of bread - at what restaurant do you have to ASK for bread??  Ok, so then we finally get our food - after another debacle where our waitress mistakenly brings us another table's order - and we pause for maybe 2 seconds in our ravenous eating to notice that the steak actually is pretty darn good.  At that point, we were ready to just leave and get on with our nights, but one of the girls decided to go voice our complaints to the manager, and he turned into recovery mode faster than a blink of an eye.  He practically ran to the bar and brought us 2 rounds of drinks, then proceeded to load us full of yummy desserts, including chocolate fondue and cheesecake, on top of our DAT desserts.  The waitress, however, was not apologetic at all and didn't even seem to care.  The manager was incredibly gracious and saved the night for us, and I would consider going back solely because of him.", "author": "Irene W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-07-11", "description": "No no no!  I went last night with a friend.  We're thinking hotel bar/restaurant (think Ame) where it will be cool vibe....well, let's just say there was NO vibe, because I think there were only two other people in the entire place.  It's a weird open space, and the reddish color everywhere just doesn't work.   So I'm figuring that because there's no one in the restaurant, the wait staff would be more attentive.  Well, the woman came over about 3 times in the first 30 seconds to ask if we wanted drinks, even though we told her we needed a couple of minutes to pick a bottle of wine.  Then later, when we wanted to get the hell out - no one was to be found.  The food was - eh.  The mac & cheese was okay, but nothing special.  The seafood salad was not good (gritty!), the salad was fairly boring, and the tuna tartare was good - but really hard to eat because it was in these miniscule pieces which were sprinkled along the plate (i.e. it looked nice, but wasn't very substantial).  Overall, nope - not going back there.", "author": "Leigh c."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-09-07", "description": "I wish I could rate Level III higher as it is a nice venue. Today my friends and I did brunch and unfortunately a train of errors wrecked the experience. Firstly three of us at the table had to wait over 15 mins for our meals after the others were served. I ordered the crab cakes, and although the meal was tasty I expected crab cakeS, plural - not a single, small cake for $15. My friends also had to ask for their side servings that were supposed to come with their dishes. Plenty of room for improvement Level III.", "author": "Michael P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-11", "description": "From the red stemmed martini glasses to the hip Chilewich placemats they sure got the renovation right in this place.  The space is huge and very nice.  There's a fireplace in the lobby and lots of seating.  The decor is all in red & golds with lots of curtains, round booths and beautiful chandeliers.  The big rave though is for the food.  We stopped by for dinner pre Symphony. I had the pomegranate and asian pear mixed green salad and the veal croquettes on braised spinach with cremini mushrooms and truffle sauce.  Delicious!  My husband had the Hawaiian big eyed tuna appetizer (gorgeous presentation), and the lobster mac & cheese and his literally swooned.  We will definitely be back to check out their happy hour.  I'd call this one a hidden gem on Nob Hill.", "author": "Anne H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-04-28", "description": "don't let the aesthetic beauty fool you, we went in a group of four and only one of us enjoyed the food, which was fries, the chicken was the driest that ive had in a long time, mac and cheese had no flavor and the fish tacos were sub par at best, if you have one night in San francisco, don't waste it eating here", "author": "Kevin B."}
