{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-23", "description": "I've eaten here enough times that I may as well write a review.\n\nWhat I have liked:\nEdamame with smoked tofu and five spice.\nTheir hot and sour soup. A little heavy on the white pepper but good.\nBraised vegetables with mushrooms\nTheir green onion pancakes.\n\nWhat I have loved:\nTheir spicy garlic eggplant\nE mein. YUM YUM. Half boiled, half fried noodles with the yummiest texture. \nNeen go, these little gluttonous rice discs with pork and cabbage. It's a Shanghainese specialty per my friend. Whatever, it's delicious! \n\nCootz OUT! \n\n({})", "author": "Cooter T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-13", "description": "Love this place! My go to for cheap, fast Chinese food. \n\nI always order the 3 dish for $24.95 deal. Comes with soup and unlimited rice. You'll definitely leave here full without breaking the bank. Come here almost once a week. The food is always consistently delicious. Service is always great. The waitresses are never rude when you ask for something. My favorite are the scrambled eggs with beef, salt and pepper chicken wings, braised tofu with veggies and dry braised green beans.", "author": "Esther G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-09-13", "description": "Came here for Ma Ma bday. Food is ok which I found out later they specialized what's on the wall menu not on their book menu. Oh well.. Overall we had a good time. No on their XLB and one if the dish we send back because it was too salty. Note to self...Order their specialty menu on the wall.", "author": "Christy V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-08", "description": "Absolutely delicious! I came here with 3 family members after visiting another family member in the city. My relative told me that everyone comes here and that there food is the best. I told her \"I'll be the judge of that :)\"\n\nAs I walked in, the place is pretty small. The seating is a bit awkward and complicated but that didn't bother me. What I really want to experiment is the food. \n\nWe ordered eggplant with chicken, salt and pepper chicken wings, tofu, rice, and soup. We chose the 3 meals for $24.95 option. When the chicken wings came, I told them \"Aye! Let me take a picture first!\" then I said \"continue on...\" After biting the chicken wing, damn I guess I was blown away of how good the seasoned it. Very nicely seasoned and very huge wings. The tofu was by war the softest tofu I've ever had; The sauce was the best part. The eggplant and chicken, don't get me started. That's the one you want to order! The sauce below the good stuff is what makes it good. I scooped that all over my rice. It's so good! \n\nThe bill came out to be around $27.00 with tax. Not a bad deal with 4 people. \n\nOverall, food is a plus, Service is a plus, and the value is also a plus plus!", "author": "Jonathan Z."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-04-10", "description": "Ling Ling is legitimate Chinese food.  It was 100% chinese customers when we walked in and all the food looked so delicious.\n\nThe menu is extremely large and they seem to have everything.  There's a special for $23 where you can choose any 3 items from a list.  What a great deal!\n\nSalt & pepper pork chop was perfectly crunchy but a bit under seasoned.  Fried tofu & beef saute was flavorful.  Clams in black bean sauce was just ok..  The best dish of the night was the ling ling noodle.  The sauce was spicy, sweet, and tangy and it was full of noodles, veggies, and tofu.  Noodles like this are hard to find!\n\nClean bathroom.  Good service.  Will be back for more!", "author": "Seung Eun C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-30", "description": "Two words \"Kung Pao\" Its always spicy the way I like them full of veg that supposes to be there with the chicken.  Have been running around like a chicken to get some decent food around here and this is a reliable spot.  Parking is harder and harder now a days but where in SF if that's not a problem.", "author": "Lantz G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-04", "description": "Everyone has a little SF hole in the wall they go to for a quick, cheap meal. For Chinese food, Ling Ling is my little gem! I've been here about 30 times, and I still look forward to future meals here :)\n\nTHE GOOD:\n\n- No item I've tried on their extensive menu has tasted too oily/salty/full of MSG. This is rare. I've eaten Chinese places around South Bay that charge twice as much as Ling Ling, but are half the quality and full of double the unhealthy crap.\n\n- Price & Portion size - Your dollars go a long way here. I believe their lunch menu comes with rice and soup for 6.95 before tax! Yay! Dinner prices are fair too at an $8 average/dish\n\n- Try their 'steamed dumplings' / xiao long bao ($6.50), Chow fun/mein ($8.50) clay pot dishes ($7-12)!! I'm always in awe at the portion sizes, how good it tastes, and how much meat/ veggies they give you in each dish.\n\nTHE MEH:\n\n- There is minimal street parking around, so you'll have to find residential parking around the ave if you want food around noon and dinner time\n\n- This isn't their fault, but they only have about eight 2-4 people tables, and 2 large group/ party tables. I wish they would expand \n\n- Service is hit or miss, but has always steered on the good side - quick . Sometimes I feel like they give us their complimentary soup (that i love) on a whim...\n\n- Their special menu could be translated into English for the non-Chinese speakers. Very jelly to see what other Chinese people order... like there was a whole steamed fish dish with soft tofu and special sauce for only $13 somewhere up there... *drools", "author": "Vy T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-11-29", "description": "Ling Ling used to be my fave go to spot for take out Chinese food. But the quality has certainly gone down hill over the last few years. The prices have also increased and dishes have gotten significantly smaller. I still come here from time to time, but it's not as good as it used to be.\n\nI would recommend the salted fish and chicken eggplant and the XO sauce fish sauteed with assorted veggies. These are two of their best dishes! The tofu and fish claypot is also alright. The salt and pepper pork chop used to be good but I would pass now.\n\nService is quick and efficient. The ladies pretty nice as well. Overall, it's alright, if you need a quick takeout near San Bruno, try Ling Ling.", "author": "Eva C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-10-05", "description": "DO NOT EAT HERE. WHY: \n\nWhat we ordered: \nStir fried lamb - decent with a lot of meat and not gamey \nSizzling fish plate with satay sauce - barely any fish and not very tasty\nSalt and pepper chicken wings - only dish we really liked\nBeef chow fun - bland \n\nWhen you order the first three dishes, you get free soup and rice is included in your meal. When we paid for the bill and asked for boxes, they took the rice back. We told them we wanted to pack it but they said that packing the rest of the rice would cost $1. When we declined, they took the rice and served it to another table. \n\nARE YOU SERIOUS?? YOU REUSED RICE SOMEONE ELSE ALREADY ATE FROM?", "author": "Marlene T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-05-02", "description": "Super affordable hole in the wall (soup + 3 dishes for $22 if I recall correctly) \n\nSeating is tight so not great for groups\n\nFlavors are standard, no highs or lows\n\nService is efficient so don't expect chit chat or pleasantries \n\nOverall Thoughts\n\nSolid bang for your buck", "author": "Eddie W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-02", "description": "Been very curious about eating here, but could not exploit the 3 dish deal for $25 since I have been alone until now. With my family in tow, we dropped by at 5:30pm ravenous after a light lunch.\n\nWe selected our three dishes, and was pleasantly surprised to get complimentary tea and a soup in addition to the tubs of fluffy white rice.\n\nWe ordered:\n\nMongolian Beef--this was easily my favorite entree with dried chilies and wok seared, tender sliced beef. Lots of sweet onion to go with the rice.\nKong Pau Chicken--chunks of green bell pepper, fried peanuts, and a bit of chicken... not my fave, but it was alright.\nMalaysian Chinese Broccoli with Beef--Gailan in gloppy sauce with gently cooked beef. I was very confused how this got the Malaysian tag... and was the most bland of all three dishes.\n\nThe small dining room was filling rapidly as we got ready to leave at about 6:30pm, and a steady stream of customers came in to collect their take out orders.\n\nWe will definitely return and try more of the broad selection of dishes--where else can you feed a hungry family of four in SF for $25?!!", "author": "Lu-Shien T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-06", "description": "My boyfriend and I came for a late dinner. We ordered the beef pan fried noodles and the ling ling noodles. Both of the dishes were good! The pan fried noodle didn't skimp out on the sauce nor the beef. It was so saucey and flavorful. The ling ling noodles were also good, but not as good as the pan fried noodles. The flavor reminded me of hot and sour soup. The serving size was big. We weren't even able to finish one whole dish.\n\nOnly negative is that I kept having to shoo away small gnats. Super annoying. Also, our table was a little dirty when we sat down.", "author": "Annie H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-26", "description": "Tips charge on togo order, Beware!\nI ordered 3 dishes for $46 but I was charged $53 on a togo order. The younger waitress is nice and but the older 2 witness are not! They made it seem like I'm cheating them but in fact they obviously overcharged me!\ninstead of giving me back the difference, they wants my card back for voiding and recharge again, waste me another 10 mins...\nI was wondering why they over charged strange amount $6.3, it turns out they add tips to my to go order!!! obviously cheating.\n\nThe food was tasty and deserve 4 star, price 4 star, service is absolutely 1 star!", "author": "Apple P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-11", "description": "I love their service and food is made fresh. What I also love is that the prices are very reasonable and I received large portions for the three meat fried rice noodles and the shrimp and egg over rice dish. I love the eggs in the rice dish because their so silky and the green onion adds a nice touch. The best part about the shrimp too is that they actually took the intestine part out and cleaned them very well. The shrimps are fresh and not overcooked at all! They do close at 2pm for lunch like most typical Chinese restaurants, but they allow you to place and order before their lunch time and pick up later when they're having their lunch which is great considering that I get my lunch break from work around 2:30pm all the time. I will definitely be coming here more often!", "author": "Annie Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-15", "description": "This place has good Chinese food and a fair price.  Normally I order the beef pan fried noodles, along with another dish.  This time I decided to order the shrimp and eggs over rice.  The beef pan fried noodles is my favorite thing here, and although the other dish wasn't bad, it was a little bland for my taste so I had to add pepper.  The wait for your feed is pretty quick too.  And they even serve you soup and tea with your food. \n\nThis place is becoming my go-to Chinese restaurant in the area.", "author": "Eric L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-19", "description": "A really good find for celebrations with my family! They have good priced family style dinners with a whole lobster - wow - priced between $40 something to $50 something. We came here for father's day celebration and the food was so yummy! However, the $40 something dinner was more for 3ish people, as we finished everything with 4 people since there were 2 vegetables entree and only one other meat entree in addition to the lobster. I loved the lobster and all of the dishes, but especially the red bean pancakes dessert. They also included white rice and tea without charge! They accept credit cards, but I paid with cash for their good service as it's a small family business (credit card charges extra fees). The second time we were here, we ordered the 3 entrees for $20 something deal. It also included soup of the day, rice, and tea without charge. I recommend their salt and pepper pork chops, very crispy and not spicy - the way I like it. The jalapenos gives it a good smell but it's not spicy unless if you actually eat the jalapenos. I've been here 2 times with my family so far and will definitely be back!", "author": "Jennifer T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-07-02", "description": "I've been this place few times and service was very poor and had to waited for the food almost 1 hour.\nOther, the cook smoked after during the break and did not wash his hand......when he returned to work", "author": "JJ w."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-06", "description": "Super cheap and delicious Chinese food.  We usually order to go when we're back at my parents' for dinner.  Getting 2 orders of the 3 dishes + rice and soup can feed the entire family of 10 and for just under $50.   Often times, there's leftover for lunch tomorrow \n\nThis place is very small with only 2 big tables in the back of the restaurant.  Parking can be difficult.  Order ahead of time so you can run in, pay, and go.  \n\nTheir string beans with braised tofu and bitter melon with beef are my favorites. YUMMY!", "author": "Kris L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-10", "description": "Living only 2 mins from here, I cant believe I've never been here. It's not the nicest restaurant but they definitely serve cheap food! \n\n$23 bucks for 3 dishes is pretty good for poor starving college student like me. The food can last me up to 3 days lol \n\nI love how the server speaks English and most importantly they take credit cards! Wooho! I am impressed and cant wait to be back!", "author": "Debbie D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-01-10", "description": "Place is good over all with nice customer service and all and I've always had good experience here except this time I ordered a silky egg and shrimp chow fun and I never expect them to turn all the eggs in to a sauce.. To the point where I see egg sparks in a sauce soaked chow fun... Chow meaning fried.. Dish came out to look like everything was boil cooked and placed in a sauce filled Togo container.... The 2 stars are for basically customer service.", "author": "Tony T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-20", "description": "I hardly ever give a Chinese restaurant such a high rating but this is my local neighborhood one and it's so convenient and cheap.\n\nI've ordered multiple things over the year I've lived here. A few yays/nays\n\nPOT STICKERS ARE ABSOLUTELY DELICIOUS. I grew up with my mama hand making these for our family and they compared with hers very well. The dough wasn't too thick and the meat filling was delicious. It wasn't mostly cabbage or one of the cheaper fillings.\n\nClam mussels in black bean sauce. 70% of shells had clams.\n\nLemon chicken. Good chicken but sauce is very thick and lemon. Kinda didn't like it.\n\nPork and squid salt and pepper. Both good with the appropriate amount of batter and lots of good filling.\n\nBraised beef stew and tofu. A staple and solid dish to order here. The beef isn't tough although it doesn't melt in your mouth but what do you expect at a Chinese restaurant.\n\nCombination chow mein has all the meats and seafoods but no vegetables. Still tasted right and cooked right.", "author": "Mimi T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-03", "description": "This place is have really good flavors... I was at working craving Asian food but didn't know which one would be good.... Yelp came thru for me once again!!!\nThis place taste really good not like the Americanized Asian food... I think they still use MSG! J/k idk for sure!! Lol", "author": "Jade M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-12", "description": "Had tofu with vegetables and green beans with lamb. Freshly prepared with excellent sauces. Tofu was tasty. Lamb was tender. Nice storefront place with excellent prices.", "author": "Lawrence P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-05", "description": "My go to restaurant for Chinese food around here.\n\nThe interior setting could definitely be cleaner. But it's as clean as most of the other Chinese restaurants here. What really defines the restaurant though is its plethora of Chinese dishes.", "author": "Henry L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-04-08", "description": "WARNING: RE-SERVED RICE . This place uses leftover rice from customers to serve to their new customers. I had a sit down dinner with my family and was boxing up our leftover to go. As I was boxing up my food, the waiter hovered over to purposely tell me that I cannot box up my rice that was leftover. While leaving, I saw them taking that same bucket of our leftover rice, added some fresh ones on top, and served it to the next table. If u ever eat here, you will most likely be eating rice leftover from another table before you. That leftover rice could've been coughed into, spit out, touched, or who knows.. this restaurant cares less about health sanitation,  more about saving cost by re serving rice.", "author": "Helen K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-08", "description": "For $23 you get soup, rice and 3 savory dishes of your choice. They serve generous amounts. Service is quick. I recommend the Mongolian lamb,  salted fish eggplant, and chicken and basil lamb. They also sell a lunch deals for $6.", "author": "Tes Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-17", "description": "Live in the area? Want decent and really cheap Chinese food? Then this is the place to go. \n\nFor $7.50 I got the Sweet and Sour Fish which was good, but boy did that fill me up. I'm a pretty big dude (6ft) and for only $7.50 who can complain?\n\nThis is the type of place you go to when you just got back from the gym, rushing to go somewhere or just want to Netflix and chill. You don't come here to impress your date or think you're getting the best Chinese food in SF. You come here for quick, good and cheap Chinese food. That's the expectation you should have when coming here :)", "author": "Alexander G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-21", "description": "Ling Ling does not disappoint, ever. I've been here with my family of like 8-10 people, and I've been here with just my bf. I think that the max number of people you can come with is 8-10 at a table, otherwise you'll have to split up, but the tables are probably located in the back next to each other. Anyways, the food is good American Chinese comfort food. Everything that I have ordered here is always amazing, especially their 3 dishes deal for like $23-24? This menu is extensive af, so you can choose from protein, seafood, and even veggies! It also comes with soup and rice, which makes for the perfect balanced meal. Yes, the food can be oily as Chinese food does include lots of oil in the cooking process, but it's definitely comfort food. Their soup is always bomb af, it's a veggie soup that I don't know the name of, but it's like my favorite soup of all time. Honorable mentions: beef chow fun, MONGOLIAN BEEF CHOW FUN (nomzzz), salt and pepper short ribs, and literally everything and anything. Wait, except for the chicken and veggies, because that was bland af, but everything else is pretty legit. The service is quick too, whether dining in or for to-go. They actually take credit cards, so you don't gotta worry if you don't have cash. Ling Ling is a place that will never disappoint you, except for that one dish, but maybe they just forgot to add flavor with the numerous orders that they have. This place is my go-to for Chinese food since they're literally near my house, but parking sucks, no matter during the day or at night.", "author": "Brenda K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-23", "description": "3 items and rice for $20 is a deal that can't be beat! The place is not the fanciest but the food, service, and price makes you forget about the decor.\n\nGreat for sitting down or taking home. \n\nParking could be a drag on the weekend during lunch.\n\nMy favorites:\nSpicy eggplant\nPeking spareribs\nSalt pepper spareribs", "author": "Teresa S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-04", "description": "A hidden gem. Not fancy but very tasty. \n\nThe service is fast and it's what you would expect a Chinese place to be in this neighborhood. The restaurant isn't fancy but man they cook with such flavor. \n\nI highly recommend this place.", "author": "Rylan C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-09", "description": "affordable and great food! Little hole in the wall gem :)", "author": "Tara B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-01", "description": "Many, very delicious Chinese food, cheap price, it is suitable for the whole family to enjoy. I will definitely come back!", "author": "Ming L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-08", "description": "Note this review is only based on the food. If you want a nice atmosphere or great service this is not it. Don't get me wrong the place is clean but packed and busy. Best place to go on the San Bruno strip. \n\nPlace was packed with Chinese people (great sign) with no open tables glad we made a reservation. All food we ordered was great. Nothing too greasy or salty. prices are super cheap with dishes from 7-15. I highly recommend the Mongolian beef, lobster noodles, fried fish. Ask the waiters what the locals order and be prepared for a tasty treat!", "author": "Victor T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-01", "description": "This place is so traditional. The outside is really old and dirty, the inside is tight and sticky. But if you can forget all of those and here for the food! Oh man you gonna be happy in here, the food we get is really good, the only things blocking you from ordering is the  food menu some of them are only in chinese.", "author": "Dennis L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-19", "description": "I ordered 3 take out fried noodles dishes.  I was on my way in a rush and all other choice was closed on a sunday:-( Ling ling was quite busy.   The orders came out fast, the portion was generous, taste great, pay $25 and sure hit the spot.  Always go for the beef show fun.", "author": "Mar H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-17", "description": "My dad always finds the hole in the walls.  This was no different.  I would've never stepped foot into this place if it weren't for him.  Thank goodness I had the opportunity to eat here.  \n\nSomething I never knew:  You can bring your choice of seafood items here and have them cook it for you at a small cost.  My dad brought lobster tails and his own catfish and asked the chef to cook them for us.  I was super impressed by the flavors and of course, the quality was not to be questioned whatsoever.  \n\nAll of the other dishes we ordered were tasty.  We ordered additional veggie dishes and a clay pot of duck and taro.  DELISH.  The prices were decent and the service was on it.  Can't really ask for more than that at a Chinese restaurant.  \n\nSuper 5 stars.", "author": "Jen W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-09", "description": "Very good Cantonese food. My family and I almost go there every weekend. Their food taste really good not like the Americanized Asian food. LOW PRICE but taste GOODDDD   :b\nI highly recommend this place.", "author": "Doris X."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-09-10", "description": "one of my favorite local to go place, althought nothing fancy but it's tasty most of the time and price is reasonable.", "author": "kiwi k."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-09-08", "description": "$10.90 for minced beef with scrambled eggs during lunch time. The lady waitresses  who took my order in Cantonese wouldn't tell me how much when I asked over the phone before picking up. Now I know why. Maybe they jacked up the price when I ask if I could put on my card. If your the owner I hope you are reading this. Almost double the price of 80% of chinese restaurants that serve this? Please do yourself a favor and go someplace else!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! Horrible, horrible, horrible, horrible, horrible, horrible, horrible, horrible, horrible!!!!!!!!!", "author": "Curtis C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-27", "description": "First time ordering food from here . Family came to visit so we decided to come and try this place. We order like  seven dishes. We order the clay pot stinky fish tofu chicken ( you can really taste the stinky fish and that entree was made just right.) Fried pork chop ( very cripsy which i like.) Beef and brocolli ( brocolli wasnt soggy it was crunchy and very flavorful.) Sweet and sour chicken ( made just right.) Hot and sour soup ( taste exactly how it should taste, didn't taste any msg so that was good.) Chicken chow mein ( very yummy and the noodles was not greasy. So far i like the food not oily but flavorful. I would come here again and try their other dishes.\n\nWe order take out and the lady told us our food will be ready in 20 minutes. She wasn't playing around it was ready on time like she said. They take debit card so thats a plus and they are very fast with the food.", "author": "Hoa T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-20", "description": "Yelpers, this is the real deal.\n\nOn a Sunday night, tables are filled with neighborhood Chinese.  Four chefs work quickly in the open kitchen to churn out dishes of every flavor. With an unassuming exterior, this small hole in the wall restaurant offers authentic, unique, and most of all delicious homestyle Cantonese food, all for a very an amazing price.\n\nLing Ling offers Americanized Chinese food (think Mongolian Beef and Lemon Chicken), but what is special about Ling Ling is that they cook up Cantonese dishes that my grandma or your grandma might make at home. No frills. Nothing fancy or done-up. But all good.\n\nSince moving to the Bay Area more than five years ago, I've been searching high and low for a Cantonese restaurant that could match up to or top my favorite back at home in Fresno. (Yes, that little city in the Central Valley...) I never expected that it would take five years, especially being in the Bay Area. However, I am happy to say that my desperate search is now over, thanks to Ling Ling Cuisine Restaurant! \n\n\nHere's what my family and I tried between the two nights that we came here... in a row.\n\n-Garlic stir fried pea leaves.\n-Salted egg fried shrimp and pumpkin. (So good!)\n-Pan fried sea bass\n-Tofu and oyster hot pot. \n-Deep fried pompano fish\n-Oyster pancake\n\nFor the more adventurous they have:\n-Pork blood with chive on soup\n-Young pepper leaves soup with fish balls.\n\nPro Tip: They have lots of specials posted up all along the walls written in Chinese, so if possible, bring a friend that can read Chinese. If not, just point to a random one and see what you get...just kidding...but not really, because I'm sure it would be good anyways!", "author": "Tracey L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-04", "description": "This is probably the best Chinese restaurant in the area considering pricing and food. I recommend the lobster dinner sets that comes with pre-selected dishes and rice.", "author": "Ken Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-09", "description": "This is a good basic Chinese restaurant. I've done take out twice and haven't been disappointed. The last time they included a small container of the complimentary soup. It was fantastic with a ton of ginger and thin strips of very tender pork. Even though just a complimentary soup it was like one of the best soups I've had.\n\nThis time I had Chinese broccoli with beef, pea tip, and ong choy with fermented bean curd. The Chinese broccoli was a bit heavy in stems (still good), the pea tips tasted fresh and not over cooked, and the ong choy was decent.\n\nNext time I'll have to try out the 3 dishes for $22.98.", "author": "John W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-18", "description": "I've been coming here for years, it's is a neighborhood gem. The food is incredibly tasty and affordable. The kitchen is busy and I like watching the cooks do their thing while I wait for my order. Lots of stuff on the menu, the spicy garlic eggplant is a current favorite. I usually take out but I like to bring friends here for a good local food experience.", "author": "Hernan S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-15", "description": "The lunch specials here and the 3 dish, free rice and soup are great deals that make this place a go-to place for years. \n\nThey have a very extensive lunch menu that's only $5.50. I believe there's two whole pages of lunch menu that ranges from about 5.50-7.50 this also includes free rice. \n\nThere is a family special that's the 3 dish, free rice and soup for about $20. They also have a quite extends ice menu there was well to choose from. This being enough to serve a family of 3-4 if they're not super big eaters. \n\nWhat I like to choose for my 3 dishes is their signature Ling Ling chicken. Their sauce looks like teriyaki sauce but with a kick. I quite like it and it comes with broccoli. I also like their Ma Po Tofu. Spicy meat bits with soft tofu. Can't get much better than that!! And a plate of choy to have some more greens in my life. Fiber for the win!\n\nI would definitely recommend this place to anyone who wants a nice sit down family style restaurant. Don't let the broken glass door fool you, it isn't that ghetto inside. Haha", "author": "Calvin Y."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-02-04", "description": "This is one of the better Chinese places in the area.. And that isn't saying much. I usually order to go from this place once in a while, for the past 4+ years it's been here. But as a need, pressed for time. Otherwise, I drive to sunset or the peninsula for Chinese food. Even the 2546 place a block away, is somewhat better. \n\nEver since they raised the prices on the 3 dishes deal, while somehow simultaneously lowering the portions, this place started to take a dive. They also don't give you the soup, if you order the combo to go.., with no adjustments to the cost. And they somehow have hidden charges here and there, without any posted notices.\n\nWhen the lame SF bag law came, they started charging for bags.. Thinking they had the right too. \n\nSo what compelled me to write this late review? On top of the many health codes that they are probably violating - the nail in the coffin was witnessing the head chef pick his nose vigorously.... and without hesitation, continued cooking.", "author": "Scott T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-02", "description": "It was very good Chinese food, great sauces and spices in the noodles and good. Meat was too tendony but otherwise what a delicious meal.", "author": "Joseph H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-08-02", "description": "I came here twice. Food and service for the first time was good. The second time I ordered towel gourd with black fungus and fish ball. The taste of the towel gourd  was bitter and i asked for exchange. But the waitress ignored my request and did nothing. I still got charged for the dish. So disappointed about their service.", "author": "Janine K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-20", "description": "The food and price is unbeatable! The food is MSG free and full of flavor. The dishes make me feel like I'm at home. It gets pretty packed here as well (good sign?). I know that they recently changed their boss a year ago, and this restaurant has gotten much tastier. Give this a go if you're craving Chinese! I highly recommend.", "author": "Katie J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-17", "description": "This place is very inexpensive and the food SOO good. I always come here with my parents, and we always leave the resturant happy and satisfied. The workers are so nice and attentive as well. I always get their pai quak dish (short rib) and sometimes their ling lings chicken. It taste so similar to San Tang but with their own twist. It doesn't hurt to try :)", "author": "Sandy C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-11-19", "description": "After reading other yelp reviews, we decided to try the 3 for $23 deal. There's a huge list to choose from. The rock cod with bean sauce was quite flavorful and a generous portion of fish. Kung pao chicken also delicious, & even crunchy veggies-not over cooked.  The mistake we made was our third choice-sweet & sour pork. Most of the chunks were pure fat-yuk! Since we took our order to go home, we were able to peel back the breading and after cutting off the fat, the amount of meat made only 2 bites!", "author": "Susan H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-15", "description": "TOGO - This place is awesome. Where do you get three yummy dishes with rice for $22 out the door??????? \n\nEat in - not the best ambiance but look at the prices. Ladies are friendly and it looks clean enough. I'll definitely keep coming back as its way tastier than the 2546 place across the st.", "author": "Mike H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-13", "description": "This hole in the wall Chinese food is actually pretty good! Great prices , quick and no hassle. It's probably the best Chinese food on San Bruno avenue.", "author": "Jimmy D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-04", "description": "Best Chinese food ever. Simple. Cheap. Right to the point. Order their chicken fried rice! It's to die for, yummmmmmy.", "author": "Mileti A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-17", "description": "Always very friendly and very delicious. I am fortunate that it is 3 blocks from my house.", "author": "Brian P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-02-20", "description": "DELICIOUS! Great comfort food at a great price!\n\nMust try the sweet and sour fish, and clam! Droooooools", "author": "Sandy T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-07", "description": "I like this place - its cozy and the food is fresh.  Plus the 3 dishes for $23 is a good deal.  The air can get a little smokey at times (prompting them to open the front door).  but otherwise its a pleasant place to enjoy a meal.", "author": "G. R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-08", "description": "The lobster noodle always the best thing in here. You can said the service is not good,  you can said the food have to wait long time, but they always have a lot of customer, specially the take out order. That's proof people like their food!! So am I !!", "author": "Weng T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-25", "description": "This is is great...   they has this special $19.95 chose any 3 items.  Today. We got mongolia beef and black beans sauce with clams and egg with winter Melon. \nDamn. He'll good and cheap.. and this is place not dirty at all.  Highly recommended. .", "author": "sean c."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-20", "description": "HIgh quality, good tasting, well priced food.\n\nI have been coming to this place with family and friends  for years. I absolutely love the food here. My only complaint is the customer service, same waitress has been there for years and despite having had seen me come in as a regular for years, never manages to offer a smile or a heartfelt greeting. I have come less often because of this but I am not sure I will completely take away my patronship away just yet. \n\nI still have hope.", "author": "Liz H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-03-17", "description": "Grandiose.\n\nWindow and menu claims this is some of the healthiest Chinese cooking around. After ordering the Ling Ling special (teriyaki chicken) still made a request for light oil.\n\nNotes were not taken.\n\nFinal product didn't exactly live up to the previously seen grandiose statements. Oil was not excessive but still a noticeable amount covering the chicken and surprise broccoli.\n\nWhich was certainly a good surprise. As was the teriyaki taste. Entire dish ended up being just $7 and enough for me and someone less fortunate.\n\nThat's grand enough to keep a third star.", "author": "Jason B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-07", "description": "Good Chinese food always busy,great price,fresh food,so many good choices and you know it's good even if the Chinese are waiting in line no pun intended", "author": "David S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-01-03", "description": "Everything was so salty. The salt and pepper pork, the pan-fried chicken, the yi mian, the lamb and green beans, and the beef and pepper. The latter two were also too greasy, while the first one was like 50% batter and 50% meat. The mushroom had broccoli--wtf? The sauce on the honey walnut prawns tasted almost sour, which was somewhat unsettling. I have no idea what happened today, but we won't be back in the future.", "author": "Tony D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-29", "description": "A true hole in the wall best bang for your buck. The food isn't the BEST chinese food out there, but it is very good and the portions are huge. Like any other Chinese restaurant though, don't expect for top notch service. The chefs were singing and the waiters were talking about gambling when I was there, but they did check up on us once in a while to make sure everything is all good. It seemed like most of their customers are regulars. \n\nI think their fish dishes are awesome.", "author": "Wilson P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-09-24", "description": "what i ordered.... Kung pao seafood\n\nKung pao seafood or Kung po as it was written in the menu was ok.... good sauce, lot's of diced vegetables and not bad amount of mixed seafood.\n\nambiance... bad (untidy and dirty floors)\nservice... ok (drop and go with a lot of smiles)\ncost... $- (inexpensive)", "author": "Gors P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-11", "description": "I had not eaten at Ling Ling for several months until I decided to do so yesterday.  Actually I walked in with the intention of ordering chow fun, but when I didn't find it on either the regular menu or the lunch menu I opted for my next \"go-to\" choice, Hong Kong style pan-fried noodles.  Imagine that though, a Chinese restaurant that doesn't offer chow fun!  Whatever.\n\nMore specifically I ordered the Chicken and Pan Fried Noodles and the Potstickers.  The presentation on the noodle dish was pretty cool as it was served in a miniature deep dish wok (http://www.yelp.com/biz_photos/-Hbs48iAU13vCuzkGEnRjQ?select=NOQ9rnrv4ilATr0UEX5jOA).  The thin egg noodles were fried up crunchy and a mixture of chicken, fancy cut carrots, stalks of bok choy and minced garlic in a brown soy-based gravy was ladled on top of the noodles.  The taste was very good despite the gravy being just a bit too salty.\n\nThe Potstickers (http://www.yelp.com/biz_photos/-Hbs48iAU13vCuzkGEnRjQ?select=7duqjJSfu8NHOy47tKHNhA) could have been browned just a bit longer, but it was good.  Unlike what I recorded on my previous review there was a good gingery essence in the juicy pork and cabbage filling.\n\nWhile Ling Ling is not a solid 4 rating, I think their cuisine rates a bit higher than some of the 3.5's that I've reviewed.  Their prices are on the low side as the check for all the food I had yesterday came to a measly $9.70.", "author": "Wilhelm Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-01", "description": "This placed surprised me. I didn't want to venture too far for a quick dinner and decided to stay around the San Bruno ave area. I never really like 2546 or Cali-pho-nia, so I decided to give this place a try.\n\nCleaning looking small restaurant. Service was friendly and quick. I had low expectations of this place so I was delightfully surprised. Food was good, flavor was good. Prices were very reasonable.\n\nGreat place for simple chinese meal.", "author": "Jenn T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-12", "description": "I come here all the time because they are the best on the San Bruno strip for Chinese food. Pretty affordable and delicious! Same waitress works there. She may seem cranky but once you are polite, she's poilte back.", "author": "Mau T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-31", "description": "Ling Ling is the only Asian restaurant in the area that does not use MSG. It was my go-to place (or, more accurately, my stay-home place) for delivery for over a decade. Sadly, LING LING NO LONGER DELIVERS. \nAnd yet, more than a year later, it continues to show up in Yelp searches as a result for \"delivers in the Portola District.\"\nPlease correct this listing, Yelp!", "author": "Mj M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-07", "description": "This place is one of the best Chinese restaurants in SE SF and the packed house is a pretty good sigh of that. It's a hole in the wall with a pretty stark and unassuming interior but the centrally located kitchen with chefs cooking with flaming woks and an almost all Chinese customer base gives the place a very authentic feel.  We like the Ling Ling chicken and the salt and pepper calamari is absolutely delicious. They have all the expected basics such as chow mien and sweet and sour pork which are delicious but there is also a large selection of dishes that you don't find at most other places.", "author": "Alexander H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-06-29", "description": "The food is very delicious! They use fresh ingredients and have no msg in any of their dishes! \n\nPro: very reasonable prices, food variety, food taste, neighborhood convenience\n\nCons: The inside of the restaurant isn't too appetizing for some people(I eat in anyways)", "author": "Belle Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-21", "description": "At $5-6 a plate, I don't know how it can get any better.  It's quite a small place, but it's nice enough and being Chinese myself, I actually like that the kitchen is right there for me to see.  Kind of reminds me of street food.  \n\nOh yeah, they have a deal where it's 3 plates with rice for 20 bucks.  If you feel lazy about cooking, feeds 4 pretty decently.", "author": "Danny K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-23", "description": "Absolutely loved this place.  It was a sunday about 6pm, place was busy, but my wife and I sat down right away.  They have a menu where u can order 3 items w rice and it's 22.98, a bargain imo in sf.  We ordered fish w black bean, spicy basil chix, and beef w scramble egg.  All were delicious and fast.  Comes w a large bowl of rice.  So glad this place is in my backyard..  only weird thing is they didn't let us take the leftover rice home.", "author": "Jamonit Mobile I."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-01", "description": "Tried this place a few months ago and it has definitely become my new favorite restaurant. The wonton soup is SO flavorful compared to so many other place I've tried. Everything here is amazing. I also like that their kitchen is right there in front so you can see just how fresh your food is. And clean also!", "author": "S M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-28", "description": "This place is the best!  It's super convenient since the place is in my neighborhood, and takeout is a cinch.  \n\nOrdered the Ling Ling Noodles, which was not too salty compared to other restaurant's noodle dishes.  The salt and pepper Pork Chop was excellent and tasty. They do not skimp out on the portions and the prices are very reasonable.\n\nI will definitely be coming back!", "author": "Ben S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-02-16", "description": "I ordered from here after reading yelp so i thought it was good, but nottttt it was awful! the beef broccoli was the only thing besides the steamed rice that was okay, wouldn't eat it again; but the chicken chow mein it was so greasy and it tasted like dirt, like they didn't wash the bean sprouts or vegetables, and the orange chicken was not anything I have seen before. This restaurant is horrible, I will never get anything again from here, and they charged me $25.00 yuck!", "author": "Susie C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-02-04", "description": "Takes forever for them to make the food.  Called in but they forgot to take my order.  Ended up waiting 30mins cause of this.  Go when no one there or prepare to wait.  The food quality is good", "author": "Jed H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-04-28", "description": "Supper long wait just for a to go 3 dish, wait it for 45mins ~ they don't cookie the food in order, is not the first come first service, people who came later and place the order get the food before me, also the the air condition inside is not very good, I thought I was in the cooking room , while I was waiting the food there is no chair for me to sit, I need to stand there for 45 mins and when I going cancel my order the women told me the food is ready in another 5 mins, so why it take so long to cookie that 5mins dish? There is noway I'm going back to that place even for free.", "author": "zoe z."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-11-27", "description": "I've had better meals here before.\nI'm not sure if there are new owners...\nI had a craving for Tomato & Beef Fried Noodles.\nThat's exactly what I ordered...it was good and satisfying.\nI also ordered the Shrimp & Leek Dumplings - these were excellent.\nFairly ok eats and the bill was very very reasonable.", "author": "Derek N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-24", "description": "A great place to get good food with a great real! 3 dishes with eicw for $21. I love so much their salt n peppar poek chop! They are the greatest. Then next would be their beef with double mushroom. Veggies are cooked just right! Then it is a must have the pork bbq noodle soup! It is like comfort food!", "author": "Lilibelle T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-10", "description": "This hole in the wall is bomb! We always get the salt and pepper spareribs, the tofu with string beans, the salty fish chicken with eggplant. Sometimes we also get the salt and pepper fish or the black bean sauce fish, so tasty....oh and also the stir fry lamb is so tasty and I usually dont even care for lamb but I love this dish. The clams with bean sauce for extra fee, a dolla or so. This is the best bang for your buck when it comes to complete satisfying dinner.", "author": "Ravenous T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-09", "description": "When I first moved to SF, I was living in this area.  They have a number of Chinese restaurants on San Bruno.  I have been there at least 8 times since December.  What I like is that you can order 3 items off their $19.98 menu - and get soup and rice with the meal.  They have several sizzling platters and the fish platter is excellent.  I have brought several friends and they have enjoyed the meals too.  There are over 50 selections - and so far nothing has been bad.", "author": "Stephanie C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-01", "description": "Hole in the wall type of place but friendly and helpful waitress. Absolutely great chicken salted fish fried rice and Shanghai style thick noodle chow mein. Good price very village type of cooking (home style) that is hard to find these day .", "author": "Warren Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-09", "description": "Cannot beat 22 bucks for dinner. \n\n22 dollars for three dishes, unlimited rice and complimentary soup. There were so many options for the dishes (literally 50+). Will feed two and have plenty of leftover for a second meal. Will feed 3-4 nicely. \n\nWhat I liked: \nSpicy Basil Lamb- so good! \nBroccoli and Beef (the asian style)-  a tad salty but still very yummy. \n\n\nWhat was okay: \nSalt and pepper squid- sort of like calamari but very plain and a bit bland. \nWonton soup with noodles- Not use to wontons having so much ginger in the filling, a bit off tasting to me but the soup was good.", "author": "Michelle T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-09-22", "description": "Pricing: Good-Excellent. Use to be able to feed four with less than $20, but now we need a little more so not as cheap as it use to be.\nQuality: Good. Cannot really go wrong with cheap Chinese food.\nTurnaround: Slow. The food is so easy to cook so why did we have to wait so long?!\nService: Poor. Very quick to make us order, but nowhere in sight after that.\n\nThis is local neighborhood restaurant for me so I really only come here when I am feeling too lazy to cook my own meals. Otherwise, this place is not really that good. Pricing-wise, this place is pretty cheap. We can order 3 dishes for about $20 and it will feed a family of four easily. I think they recently up the price because I remember I use to be able to drop a $20 and it would cover tax and tip, but now I need a little over $20. The quality of the food is normal. This is cheap Chinese food so I am not expecting anything gourmet, but I did order the sweet and sour fish that was super bright orange. At least the fish was not mushy though. The stir-fry vegetable is nice and simple too. We also got a lamb dish the last time we went and the lamb was cooked well, but the dish, which was not large to begin with, was mostly onions. They sat us and got our orders fairly quickly, but after that, we waited and waited and waited for the food. These dishes are super easy to make so I have no idea why the wait. The worse part is when we keep asking this one waitress to help us check and she said she would, but she never even steps into the kitchen. This is definitely not a restaurant worth going to if not for the convenience and I was lazy.", "author": "Jenny W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-06-18", "description": "This review is for to go and food only. Restaurant is small and it's more of a cafe than a restaurant. Always order to go for lunch or dinner here since no other good choice in the area. \n\nServices for pick up is fast, staff is friendly. Most of the dishes are not bad but some can be really greasy. Some memorable dishes are salted fish and chicken fried rice, deep fried spareribs, beef stew with bean curd, chicken wings. Lobster yee mien (noodle) is too greasy. \n\nI don't like that they decreased their to go food size. To go box is half of the size thinner than what it was before... Price increased a bit too...", "author": "Y Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-29", "description": "Love it. Best price and food in the area honestly. It is busy and don't go there for atmosphere. Really good  won ton soup, beef broccoli and chow main.", "author": "Sarah P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-10", "description": "Don't let the narrow and small storefront fool you, the food is pretty good for the price.", "author": "Gerald S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-10-16", "description": "Ling Lings is a nice little hole in the wall on San Bruno Ave. I've had their Fu Jian fried rice to go, which was really tasteful. I came here another time for dinner with my family and the food was just mediocre... Something was missing but I couldn't tell what it was. I'll give Ling Lings another try if I'm craving for Chinese when I'm in the area.", "author": "Edgar G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-12-10", "description": "i come here once in awhile for porridge and lamb, decent chinese food, 20 bucks for 3 dishes plus rice and soup", "author": "Long C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-06-21", "description": "Ling Ling is actually one of the few restaurants in this area that I believe is cheap and good. It is not the best restaurant ever, but still very good. I've been coming here for many years now. I love their onion pancake with egg (probably the reason why I like them so much.) I even remember my dad getting me food from Ling Ling when I was sick (noodle soup so that it would be easier on my stomach.) Not everything here will be greasy, really depends on what you order. \n\nAs the previous reviews are stated, the service can be bad. But I am a little more sympathetic. The restaurant is small and there is usually only one waitress. If the place is busy, the service can be bad since it is just one person helping everyone. Honestly, if you have been to enough Chinese restaurants, this is pretty standard. \n\nIf you want nice friendly smiles and amazing service, this place would not be for you, but if you just want good food at cheap prices at a small restaurant, then you have found the right place!", "author": "Angela T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-04-30", "description": "I'm still not sure what style of Chinese food this is. I suppose more Northern than anything, but its just...Chinese. I suppose.\n\nI came here for lunch and it wasn't too packed. We opted to go here because other places in Portola were too busy. That already says something about this place.  \n\nThe decor is a little strange. The entrance is an ADA ramp that walks into the \"kitchen\" area, where either you continue to the back to be seated or are directed 180 degrees to the front seating area.  I find it interesting that the non-Asians tend to sit in the front. \n\nWhat struck me first was the little oddities in the restaurant.  They offer fruity drinks for $1.75-2.50 on the walls...and there's a picture of (what I assume is) the owners daughter in each of these. So...is the daughter for sale too, or what? Cause if its on the same page as the ad, I tend to think its a sale not vouching for the deliciousness of your drinks.  The other thing is the strange ramp I mentioned earlier. I assume its because it was much cheaper to build a ramp than it is to shave down the concrete of the entire restaurant, but it feels weird because of the 180 turn. To make it more \"private\" they erect a plastic barrier there, but it makes eating in the front feel like a zoo. For serious.  The last thing I couldn't get over (other than the dusty decor) was the huge numbers of misspellings all over their menu's. Oh, Engrish, how I love/hate you.  I'd like an ice litche ta pioca with lemen please!\n\nNow, to what you really want to hear about - the FOOD!  Right? Because regardless of the place, you want to know about the food.  Well...here's what we ordered:\n\nJellyfish with Cucumber (don't judge!) - This came out first.  After a long wait...it was pretty good. The jelly fish was actually a little salty for me.  It was NOT spicy at all (which some places do).  I appreciated the cucumber (Julienned) because it cut through the saltiness of the thing. But...given this, it really shouldn't have been THAT salty. Fail.\n\nBeef noodles with Chinese Broccoli - This was arguably the best thing I had.  The noodles were flavorful and yummy.  BUT the issues I had with this dish was that the broccoli was a little under done (but still cooked), and my beef slices occasionally had some tendon or something very hard in it. It was a little strange. But the flavors were food overall.\n\nPotstickers - I have no idea what's up with these. I think there's two flavors to it and they indicate the difference by how \"golden brown\" the bottoms are. I ate the 3 with the darker bottom, and my dining-mate ate 2 with the lighter bottoms. The first three I had was pretty typical - Meat with ginger, cabbage and probably some onion.  Given there was a last piece of the lighter bottom, I ate that too...and was surprised to have a totally different filling inside! It was a kind of reddish pork with some other spices to it - no distinguishable vegetables. The wrap was a little too thick, and I think I'm just thrown off by the different fillings. What the heck?!\n\nNow, the service. There seems to be one woman who does the service, which is typically fine. She was pretty quick with our order, and I think there are regulars here. There were two tables who came in before us and got their food wayyyyy before us. I think they sat down and ordered immediately.  For us, who have not been there before, we waited a while for her to come get our order, drop off the order, and what felt like forever for our food to come! But our tea and drinks came pretty quickly. \n\nReally, I'd guess its more of a 2.5 kind of place, but there were too many little things that threw me off.  I will attempt you again, Ling Ling...some other day when there's too many people at most other restaurants in walking distance.", "author": "Lily W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-11-20", "description": "I used to come to this restaurant with my family couple times a week because it is close to my house and cheap.  Most of their dishes are good but lack of consistency with their cooking.  Recently I stop coming to this place because of health concern.  The cooks use too much oil and salt even when I asked to reduce them.  I am sure they also use tons of MSG because I always get very thirsty after having their meals.  On the other hand, their wait people are very nice and we become friend with one of the waitresses.", "author": "David D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-05", "description": "My husband and I stumbled upon this place and couldn't have been happier with our experience.  It is a total hole in the wall, very basic seating and atmosphere, but wow, what amazing food!  I am very particular about Chinese, and this place knocked it out of the park! Very reasonable.  Will be eating here again.", "author": "Kim F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-05-20", "description": "If you can see past the \"attitude\" of the waitress, its all good! And if you usually eat at a Chinese restaurant you know you're not going to get a smile, let alone a response LOL. \n\nI love love love the mustard greens here. Its basic and healthy. The noodle dishes are satisfying, but as with all Chinese food a bit on the greasy side. Make sure you have a cup of water to gulp each time you take a bite to wash the grease down. The tofu dish in a clay pot was yummy. The green onion pancakes are yummy. Mongo beef was a no-no. \n\nAgain, if you can look past the waitress, your golden. Hahahaha, I even called for take out and she muttered \"ywejsaja\" and I say \" Mustard Green to go\" and she replies \"okay\" then... click. LOL. BUT when I got there in 10 minutes it was ready... What can I say :)", "author": "Alice E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-02-28", "description": "Living in the Portola district for 11 years, we have eaten at Ling Ling's enough times to know, the food s consistently yummy and affordable. What I like most is the food is not greasy. It all tastes fresh and light. The shrimp with walnuts is amazing! We fight over every last bite! We usually get the basics, broccoli beef, sweet and sour soup, etc. \n\nWe have eaten in and had take out. Both good. \n\nThe service is what you would expect from a cheap Chines place. I don't expect a lot. They are always nice enough. I'm not going there to make a best friend.", "author": "Keri V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-29", "description": "i give this place a 4 because the food is BOMB.com and great prices, but their customer service sucks!", "author": "Courtney N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-12-07", "description": "Decent (or okay) Shanghai food.  Porridge seems to be made from real rice rather than rice powder.  Green onion pancakes could have been thinner, but some people like 'em thicker.  Good taste to the shanghai noodles but probably needed more pork and less egg.\n\nWatch out for the slippery entrance ramp on a rainy day.  The bathroom floor is sticky, too.  Also, this is the first time I've heard Mandarin being shouted out from one end of the restaurant to the other in cacophonous tones -- as if it was Cantonese!\n\nService is perfunctory until you give the server/restaurant a compliment.\n\nIt was a super-cheap meal...", "author": "Christine T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-11-22", "description": "Found a fly all tangled up in my noodles. \n\nTold the waitress. \n\nShe took the noodles away and gave us \"new\" ones which were 99% probably the same ones (she probably just picked the fly out).\n\nCharged us for the noodles. \n\nI was about to storm out because it was too ridiculous but my mom said just to let it go.\n\nNever again.\n\nEven if I didn't find the fly, the food wasn't tasty either.", "author": "Jenny T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-01-23", "description": "I don't know about the rest of you, but I just finished having dinner at one of the best Chinese food restaurants in San Francisco.  Doing Chinese right, son!\n\nThis is northern Chinese cooking. Spicy and fiery. Unlike other places, sizzling beef and lamb platters are hot and flavorful. Chinese grade their chefs based on the \"heat of the wok\" and you definitely taste the heat from that wok.   \n\nDammn this place is good! It's cheap! $20 bucks will get you a three plate meal. $40 will get u a lobster dinner!  Lunch plates start at $3.50! $3 mf 50 bro!!! My godddd... Try their honey glazed walnut prawns too...thank me later.\n\nYou can make like an out-of-towner tourist and get ripped off in Chinatown, or come here and get yourself a truly authentic and worthwhile meal! \n\nHolllla", "author": "Roland L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-12-11", "description": "I went here with my parents and aunt. The service was a little slow for my taste but there was only one waiter so I understand. \n\nThe food tasted magnificent, especially this one dish we ordered (I don't remember the name of it but it was first on the menu for the \"Order three dishes\" menu). The meat was cooked in a perfect consistency. It was just right; soft and chewy. In the dish, there were many zucchinis. I for one do not like to eat zucchinis but it tasted good; or maybe it was because of all the oil in the dish. I also enjoyed the Lemon Chicken. The sauce was very \"tangy.\" \n\nOverall, I like this place  mainly because of the delicious food considering it's small size and limited waiter/waitresses and sticky tables.", "author": "Vicky P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-06-28", "description": "The worst Chinese food I ever had and I just ordered $400 worth for our staff meeting lunch.  Sorry staff!!!!  My reputation is ruined, I must find a way to redeem it.  Everything was virtually tasteless.  If everyone wasn't so starving I doubt they'd eat it - I sure wouldn't.  I'll be giving the leftovers to the homeless - I hate to insult them but some food, no matter how tasteless, is better than no food at all.  I only gave it one star because no stars was not an option.", "author": "Allene R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-10-23", "description": "Their pork and preserved egg porridge is alright but super bland . Their pork pan fried noodle was decent . Their steamed dumplings were alright but it tasted more like Shanghai dumplings because there was so much soup inside . Food is so-so ... it wasn't horrible but it wasn't good either . This place is super cheap ... I would definitely recommend coming here if you're hungry and on a budget . It only cost $23 ( tax included ) for a porridge , steamed dumplings , and two plates of noodles !", "author": "Eileen L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-07-07", "description": "I have a theory about this place: every entree is in the same sauce. Pretty sure... still testing it out. \n\nThe meat here is really soft which is cool, they give you weird free soup before your food comes out (which is surprisingly quick), and their 3 entrees for $19.99 is a pretty good deal.", "author": "Holly S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-05", "description": "Don't be fooled by the outside appearance of a house.  The food is yummy and cheap and can be busy during lunch hour.  They have excellent customer service, the owner even gave us a free dessert.  Ordered the lobster noodles and they even help us crack the shell, so it would be easier to eat.", "author": "Lee C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-31", "description": "This place was recommended by my niece. I was a little skeptical at first but went anyway. I got the Honey Walnut Prawns, Sweet n Sour Chicken, Combo Fried Rice and Beef Chow Mein.. Everything was good, had great flavor and wasn't greasy at all like some place. I will definitely be you going back", "author": "Ayana K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-07-08", "description": "We call in to order To Go  from Ling Ling usually for their Rice Cakes and Shanghai Style Chow Mein (kinda greasy) when no one wants to go out or cook food at home. Someone said it was too salty, but I think it's alright.. maybe my tastebuds are dying. It was tasty to me.. and I also am not a huge fan of regular chow mein.. Shanghai style is thicker and chewier... \n\nI paid $10 for two dishes to feed 3 people. Not bad.. and I was pretty stuffed.. Decent portions.\n\nService is eh.. the lady is kinda weird, but it's been like this forever.. I think she's just like rude sounding naturally :P The owner however was pretty nice and knowledgeable. They see themselves as a healthier option because they use a lot of soy products.. or something like that. I rarely head over to San Bruno Ave anymore, so if I'm around here, it must be for cheap chinese food.", "author": "Donna H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-11-12", "description": "This place used to be a lot better. Nowadays, i would go there if i am hungry and don't know anywhere else to go. Price is mediocre. Small friendly Chinese restaurant. Food is not very tasteful but acceptable. This place is generally pretty empty.", "author": "Michael Q."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-23", "description": "Very good food for low prices. Their $19.95 specials are great, 4 courses for that price is a great deal. The best part is that they do not use MSG, and food is very healthy with large servings. The waiter tends to be a bit rough but once she knows you she is much better.", "author": "Carlos C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-21", "description": "I happened on this place by accident and keep coming back because there's no better place offering same quality/ price.  I typically get my food togo though.  I probably wouldn't eat there but the food is soooo delicious.  Everything from veggie dishes (eggplant, beans etc) to meat dishes.  They are very nice too.", "author": "Mishelka L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-05-13", "description": "went here again tonight for take out!\n\nFabulous Fast Chinese Food (This says it all)\n\n$5 Chicken Chow Mein feeds you lunch & dinner..\n\none full & statisfied Bev.. priceless", "author": "Emily L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-05-11", "description": "Normally I would not yelp a place after ordering from them only once, but there were four of us eating the food from this place. I ordered the kung pao chicken, which was pretty spicy.. just the way I like it, so for me the experience was pretty good. My elderly friend also ordered the kung pao chicken and only had like three bites. Probably just too spicy for him. His Jamaican girlfriend is extremely picky about her food and has allergies and was disappointed not only that her fried rice came with eggs in it (which her system has problems with), but she also thought the rice was not fried enough, so she pulled out a pan and fried them the rest of the way. Hmm.. Anyway, I'm definitely going to try this place again when my friend's girlfriend isn't visiting ;)", "author": "John B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-12-30", "description": "Yum. I always go to Ling Ling when my family and I want some Chinese take-out for dinner. The food is cooked pretty quickly.and is all the salty, spicy, crunchy Chinese flavors you want. It's a pretty small resturaunt so you might want to consider take-out if it is crowded and stuffy. I love Ling Ling. Although the owner, Ling, might not be friendly to me all the time, she sure is friendly to my mom.  \n\nI usually order the green onion pancake with scrambled egg. It's super delicous with sweet 'n sour sauce. Try some!", "author": "Nick B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-09", "description": "Great taste, reminds me of China. Very authentic.\n\nAuthentic right down to the crappy service.\n\nBut wait, this is not 15 bucks a plate of Chinese, it is 5 or 7.\n\nGo to Koi Palace if you want long lines and great service, go here if you want cheap and delicious.", "author": "Joe Z."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-07-17", "description": "I'd really love to be able to rate this restaurant.  I find it very frustrating that it says delivery, but in any of the 5 times we have tried to order for delivery they have denied us. We then attempted to order for pick up, and twice the woman who picked up put us on hold, but her version of hold was slam the phone on the desk and leave us there for a time longer than was reasonable.  \n\nI really want to be able to eat locally but when you can't even put in an order how can you!!!", "author": "Crezia T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-04-19", "description": "I used to work right down the street from here, and the first day of work, my new boss said Ling Ling was the best! I finally had a chance to eat there (take-out) recently, and she was right... I'm sure it's far from \"best of the city\", but it's the yummiest Chinese food I've found in this neighborhood - which has a TON of Asian restaurants. I had the Lemon Chicken, my favorite dish, and it was prepared just how I like it... lean strips of white meat, crispy breading, and hot lemon sauce in a separate container (which keeps the dish from getting soggy). I also had some Chicken Chow-Fun & Veggie Spring Rolls, which were perfectly adequate. Prices are reasonable, parking is easy most of the time, and it was ready before I got back from Walgreen's across the street. They do deliver locally, and since I live nearby, I'll likely become a regular customer!\n\nEdit on 6/19/09: I still enjoy Ling-Ling 2+ years later, although it has made me sick a few times recently... probably just my MSG sensitivity, which is why I rarely eat Chinese food these days. But I just thought I'd mention it, in case anyone else is very sensitive to MSG (which ALL Chinese restaurants use to some degree). Too bad, because I miss their chow fun! The lemon chicken should be safe, though....... :-)", "author": "Laura P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-01-02", "description": "i love their chowmein here! thats all. \n\nall these years and those damn 2 chi lady servers never gave a smile nor show any slight customer appreciation after all my take outs! come on, this is the only place I order chowmein from! smile.", "author": "JASE B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-06-18", "description": "We've done take out a couple times from here, and on my grad night thought we could eat a simple, 5-person family dinner, cheap in price and good in flavor.\n\nWRONGWRONGWRONGWRONG. I was wrong.\n\nWe only ordered four dishes, and they all turned out to be greasy. The Mongolian beef HAD NO BEEF, the beef stew only had TOFU and no beef, the prawns and walnuts dish that cost 7.50 only had like...10 pieces of shrimp and a couple of walnuts, and the one vegetable dish we ordered was a plate of bad quality vegetables. \n\nWHAT HAPPENED? The take out was fine, but when we decided to sit inside, we got NOTHING. \n\nAnd the lady who took our order...I'm not even sure if she was doing her job. She was on the phone half the time and not really checking if we needed anything.\n\nsuch a GREAT grad dinner. /sarcasm", "author": "Betty T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-08-09", "description": "We ordered to go from here and it worked out great. $5 for large vegetable dishes. $8.50 for large portion of peking pork chop. This place serves up large portions at affordable prices and they deliver for free! Everything was tasty and they delievered in 30mins. There are other promising items on the menu and I will definitely order from them again for the convenience of not having to leave my place. \n\nWe ordered the following items and everything tasted good:\npeking pork chop\nsalt & pepper prawn\nsalted fish, chicken, tofu\nchinese broccoli\nmustard green, soya bean, tofu\nbeef chow fun\n\nIt fed 5 adults and 2 kids with lots of left over.", "author": "Yenly M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-13", "description": "Love the ling ling chicken in this place. The lady that works here is kind of rude tho. You can tell in her voice when you place an order or if you go there and eat.  Ling Ling chicken over rice is a must!!", "author": "Domino P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-05-21", "description": "The food is excellent, beef, chicken always tender, shrimp always plump, fish always perfect, nothing is overcooked and everything here is made fresh and made with love, yes really! And now they have the 3 entrees for 19 bucks special. My family always enjoys coming here. We eat in often. Great customer service, Ling Ling is honest and straight up and she will tell my Dad off in a minute! That's right girl!", "author": "sonia m."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2007-05-22", "description": "When we first came across Ling Ling, we really thought that we had found something special.  We were ordering 2-3 times a week despite the curt lady who takes the orders up front; we were in love with the fried chicken wings and the beef chow fun.  One day we walked in and my son pointed out that the score from the Department of Health had gone down significantly.  I really did not think twice about it and placed the order as usual and everything was fine...as usual.  \n\nHOWEVER....one day we were having a small gathering of family and friends over and we thought that Ling Ling would be the perfect place because it is cheap and the food is good.  WE THOUGHT WRONG!!!!EVERYONE in the house got SICK....the TODDLERS...the KIDS...ALL of the ADULTS .....EVERYONE was SICK for days.\n\nNow, I am not saying that the food is the reason that EVERYONE got SICK.  But, my family and friends don't order from Ling Ling anymore....", "author": "Karla F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-26", "description": "Don't expect customer service from the lady waitress... But the food here was good...  My ex-coworker had lunch today.  I had the sweet and sour fish and he had the sweet and sour chicken.  We are the only customers there at 11ish in the morning.. so the food was cook fresh and serve hot.  I like it. I came to chit chat with my coworker and so it was alright.  Our meal plus a soda came out to be $12.  Not bad for lunch.", "author": "Selina L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-10-30", "description": "Noodles only for me, smoky and delicious.  I drink a coke while I wait for my take-out.", "author": "Holly B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-07-31", "description": "It is what it is and more.  San Bruno Ave in the Portola Ave is home to many Chinese restaurants, bakeries, markets, etc.  Honestly a lot of the restaurants are prettty dingy looking and the food I see in the window does not look apetizing.  Ling Ling doesn't have any food in the window, it is covered with menu info and specials in Chinese.  I've been here enough times to say it's consistantly delicious, fresh, hits the spot and fills you up.  The veggies in their dishes always have a bit of a crisp to them which is great.  \nThings I've had and loved:\nbrocolli beef \nwonton soup\nhot and sour soup\nhunan chicken\ncombo chow fun\nchow mein\npotstickers\ncrispy fried shrimp app\nsteamed shrimp/garlic wontons\nsweet and sour pork\nEach of these items is about $5-6 and gives you a ton of tasty food.  I even ordered delivery once to Excelsior area and the service was super speedy and food was piping hot/fresh just as if I'd gone and picked it up myself (beware though, a $25 minimum order will feed 2 people for like 3-4 days!) haha.\nIf you live in the area, call in your order and you can pick it up in 10 minutes or less, if you're in the surrounding area you can probably get delivery within 30 minutes.", "author": "Sarah B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-11-02", "description": "Ling Ling is my go to place for Chinese takeout. I'm giving it five stars not because it's the finest, most inventive, or most sophisticated Chinese cuisine out there, but because it's always fresh, very inexpensive, and super tasty. Plus they say there's no MSG and it's not greasy, which are rare qualities for a Chinese hole in the wall.\n\nOn a side note: I've been away for the summer and was worried when I read Karla's review about the health inspection score. But my cravings got the best of me, and I decided I'd check things out for myself. I ordered my favorites, Chinese Broccoli with Garlic (not on the menu) and Spicy String Beans. When I went to pick the order up, I made a point of looking at the health inspection report. The score is 100 (dated January 07). I don't know why someone would post false information in their review about something so serious. But Ling Ling is as good (and clean) as ever.", "author": "Joel O."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2005-07-12", "description": "Very nice customer service.  They do not deliver -- dine in or take-out only.  The menu promises less greasy and more healthful cuisine, featuring spinach noodles and other goodies.  Good prices, and okay food.", "author": "Andi T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-13", "description": "I love this place.  Really good food and portions for the price.  They almost always have A-choy, which is my favorite chinese vegetable.  Also check out the shredded potatoes with jalapeno peppers.  Nom!", "author": "Adam T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-02-19", "description": "Ling Ling's won't give you any new revelations about Chinese food but it's your best option on San Bruno Ave.  The food is always fresh and MSG free.  I usually stick with their vegetable dishes including tofu.  Their various fried rice, chow fun, and noodle dishes are good if you are into that.  \n\nIt's a solid 3.5 stars (how about a 1/2 star option, yelp?)", "author": "Ray W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-10-20", "description": "The hong kong style noodles are great and so is the green onion pancake. I wasn't going to write a review for this place because I don't really write reviews for restaurants in my neighborhood, but I wanted to point out a mistake on the listing. This restaurant is listed as being in Bayview/Hunter's Point when it is actually in the Portola district.", "author": "Leanne M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-09-15", "description": "It's OK at best.  I have eaten here 3 times now and I won't rush back.  It just happens to be a bit better than the other low-quality restaurants in the Portola.  (Like our nearby \"Mexicatessan\" that puts slices of cheese food products on their burritos!  Is real cheese that expensive?)  The \"waitress\" grunted a few times at us and never came close to asking if we needed anything or asking how things were.  The food is so-so.  Sure it is cheap in price but com'on, can I have the flower to the broccoli instead of just the stalk?  The place was pretty clean for the type of food joint that writes the specials and new items on scrap paper and tapes them to the wall.  (I hear that computers are fairly cheap these days & can print out menus!.  Spell check anyone?  What is the \"Weenkend\"?)  For all the Chinese in our neighborhood we can do better than what we have.  Let's step it up a bit so that people might actually want to visit the Portola and not just use us as a short cut to the 49ers' games.", "author": "Larry W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-06-19", "description": "great, reliable chinese food - not too greasy, but still delicious. very clean place. healthy chinese food that's perfect after a long plane ride. i recommend the chow fun, pan fried noodles with seafood on top (crispy noodles), chicken with tender greens, and the soup dumplings.", "author": "Lisa M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-09-18", "description": "I've already had ling ling 2 times since i moved to portola. well, 3 x if you count the night we had leftovers. we ordered delivery the wednesday before last... it took a little long, 40 min i think, im not sure, cuz i wasnt home when they called in the order. they said it was $20 minimum for delivery i think, so somehow my roomies went overboard and ordered twice that much. there was so much that after 2 big eaters and one medium eater, we still had enough for dinner the next nite for us 2 big eaters. my favorites were the noodles (mmm they have thick unsoggy noodles there sooo good) and the sesame chicken. the sweet and sour pork was good too, and the potstickers, and the red bean paste desserts... our least fav was the mongolian lamb or beef or something but even that was good. anyway we ordered a bunch of food. and it was so tasty. we all thought so. even the second day.  then we went back here again after a disasterous pho restaurant incident and did takeout. $18 was enough to feed j and i with a little leftover. yum i'm sure we'll be back again. ps no general gau's chicken here.", "author": "Merredith L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-01-04", "description": "Ling Lings... something you hear on a movie who is making fun of chinese in general. But anyways, i came here once, and it was DEFINITELY MY LAST. I was craving chinese food for ONCE, my boyfriend had brought me here because he came here couple times with his parents WHEN HE WAS YOUNGER and he said it wasn't bad (he's latin), i should've known to not go in. NOT ONLY FROM THE UNAPPEALING OUTSIDE BANNER, but when i got inside, it was sticky at the table we sat on; utensils didnt seem to have been cleansed well enough for use. even using the old chinese trick with hot tea to clean the utensils didnt work that well. And don't even get me started on the customer service, the waitress was not at all friendly or seemed like she cared at all we were there to eat (at the time we were the ONLY two eating inside). I had ordered the Porkchop with cream corn & white rice (what i usually order at ANY CHINESE PLACE to try out) and the boyfriend had ordered a cold lemon ice tea, and  non of it was good. there was barely any sauce to even cover the porkchop, so dont even count on using any sauce for your white rice; and the porkchop was dried up. i was disgusted at the end that made me HAPPY TO LEAVE. being a chinese girl coming in to a chinese restaurant, i was highly dissapointed. NOT ONLY that, but the waitress who had waited on us was gossiping with her co-worker in chinese about me&my boyfriend, i had overheard her speaking of \"kids now a days are such a disgrace, not being with their own kind\". i was furious when i overheard them, i'm assuming she thought i didn't understand nor speak chinese (cause i ordered the food in english). i was so upset, that i had only left my leftover loose change as tip to her (when i shouldn't had left ANYTHING! cause of the poor service). And my total came to $9.00 something! ;[", "author": "Eva H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-04-01", "description": "the food here was good usually. but sometimes it's very salty ... overall service is bad!", "author": "Max C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-01-09", "description": "Ling Ling provides consistent, tasty, healthy cuisine.  Contrary to what one review states, they do deliver with a $25 minimum order.  This is our favorite restaurant on San Bruno Ave.", "author": "Cybil S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-02-28", "description": "the food is good, the place is kinda greasy tho. the soup, dishes they have on the menu is not bad considering its on san bruno ave with the many competitions.", "author": "A A."}
