{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-04", "description": "Authentic cuisine. Tasty and friendly. Not expensive. \n\nVery beautiful place wit Nepal touch and feel.", "author": "Yevgen V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-15", "description": "Hello, \nI like Little Nepal because the atmosphere here is amazing. Mostly, I like that they have really good prices and the servers are very fast. I like the chicken in a spinach sauce.  The Lamb tandoori is unreal. My mother likes it, so we order two plates. \nDelicoius food and nice decoration. I think I will be back! Thank you for a great service!", "author": "Elena L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-01", "description": "Little Nepal is absolutely deserving of its good rating. The prices are reasonable, and there are free refills on every drink you get (even things like mango lassi!). \n\nThe restaurant itself is brightly colored and decorated with various Nepali items, like the Nepalese flag and the ceilings have prayer flags strewn about. \n\nAs for the food, it certainly doesn't disappoint. The most popular items seemed the be the combo of tandoori salmon, chicken and lamb (mismas poleko masu) and also the chicken in creamy spinach sauce (khakura ra palak). We ordered both of these and it seemed like everyone around us did too! They were incredible, and the momo are a great appetizer to start with (and a Nepali classic).", "author": "Claire C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-18", "description": "GREAT FOOD!!! We had the delicious tandoori chicken and prawns and chowmein. Yum!!! The mango drink was also delicious. Service was great and food was delivered in under 10 mins. Great experience!", "author": "JonJon W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-29", "description": "Thank you so much Susan for making our experience in San Francisco one of a kind.  \nThe food was absolutely amazing! \nMy husband and I tried the \"momo\" appetizer 1/2 chicken and 1/2 veggies, along with our entrees \n\"tofu tarkari curry a la carts and palak paneer curry a la cartel\" hands down! Best tasting food we've tried in San Fran. We will definitely be back.", "author": "Daniela R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-15", "description": "The restaurant was really lovely. Small and bright. The food was great. I has the Palak Paneer and my friend had the Bhantar Kirtara and both dishes were delicious.\n\nThe staff was really friendly. The portions of food were pretty big. And the price was fair.\n\nEven though finding parking was tricky, I would definitely go back.", "author": "Jas B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-04", "description": "My friend and I came here on a chilly Sunday evening around 8:30pm. One guest was just leaving, otherwise, it was just us and then another group that showed up around 9:30pm. The ambiance is warm and calming and staff is friendly.\n\nFor appetizer, we ordered:\n\nHimalayan Momo (We ordered vegetable)\nMinced chicken, pork or vegetable wrapped in flour dough and steamed. Served with chutney sauce made of sesame, chili and tomato. \n$6.99\n\n\nFor main entrees we ordered:\n\nAlu Tama Bodi\nPotato, black-eyed beans, and bamboo shoot cooked with fresh tomatoes, garlic, ginger and spices.\n$11.99 (a la carte)\n\nTofu Tarkari (We substituted paneer)\nTofu and green beans cooked in light cream with fresh tomatoes, garlic, ginger and spices.\n$11.99 (a la carte)\n\n\nThe momo's were nice. The momo sauce was good, could have had a little more pop and flavor to it though, maybe some salt.\n\n\nFor the tarkari, we substituted paneer for the tofu. As a paneer tikka masala fan, this was tasty and quite filling because of the creaminess. The green beans were a nice touch.\n\nThe bean dish was interesting and different with the bamboo shoots addition, but I'd say this dish was very light and delicious. Also, a more healthy pick.\n\nThe naan and rice come with order of an entree and the naan and rice we're done right.\n\nI'd recommended trying out this restaurant. \n\n\nExcuse the messy food/table in the photos!", "author": "Shruti D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-25", "description": "This is by far the best Indian/ Nepalese food  I have ever experienced!  I have written only a hand full of Yelp Reviews in my life and this by far is worth a 5 star review, which speaks volumes!!! The atmosphere is absolutely charming, authentic and blissful. I smile the entire time I'm here listening to the culturally tuned music and the sweetness of the entire staff. I am in Love with this place and I want to shout out loud, tell my neighbor and sing the praises of Little Nepal restaurant!!! My new favorite by FAR!!", "author": "Jamie B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-12", "description": "Amazing little place with great salmon curry dish. Very friendly staff. I would definitely go again when In town and try other dishes.", "author": "A S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-10", "description": "I went to Japan this year and believe it or not I fell in love with indian food over there haha. When I got back this one the only place to curve my craving.\n\nI get the cashew creamy chicken curry (forgot the name) and usually the combo but I ask for extra veggie curry instead of the lentil. I just like the veggie curry a lot. \n\nSusan the owner is super nice, social, and a great woman to hang out with. I often go here on my own to relax and she always makes me feel welcome dining solo. Not to mention she's offered me wine, and even given me an appetizer (on the house). Love her!!!\n\nI highly recommend this place! I never leave unhappy and always hear others complimenting the food.", "author": "Jewel S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-19", "description": "An absolute neighborhood gem. The food was saucy, the portions were perfect and the variety of options for vegetarians and omnivores is ideal. \n\nThere was no wait for a Saturday night with one of my gal pals and I. The restaurant is cozy and colorful and the service was hospitable. I look forward to coming in again.", "author": "Jeannine A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-05", "description": "My go to for the best Kukhurako Ledo\nChicken breast baked in Tandoori clay oven and cooked with light cream, cashew nut, fresh tomato, garlic, ginger and spices!!! Friendly amazing yummy gem on Cortland in Bernal Heights", "author": "Elena M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-30", "description": "Great food and great value! The staff were very friendly too! We'll be back again for sure!", "author": "Rosanna S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-01", "description": "Delicious food, great presentation & all around superb first visit! From the moment I walked into the restaurant I felt at home! Great service, super cute decor & the owner (Susan) is a total gem! I will come back for the food & her magnetic personality! I cannot recommend this place enough!", "author": "Carlos H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-06-30", "description": "Had an early weekend dinner with an old friend, so early there were no other diners save several people coming in for to-go orders.\n\nService, while not rude, was unenthusiastic and inattentive. \n\nWe had veg samosas to start (2 large ones for $6 rather expensive but pretty good). Complimentary papadum came with cilantro and tamarind sauces. \n\nShe had the grilled shrimp dinner which consisted of five large shrimp served on a bed of onions on a cast iron pan. I had a $20 mixed grill of salmon, lamb and chicken, also served on cast iron, and all woefully over-cooked and seasoned too mildly. Our dinners included a separate platter that held two small pieces of naan and little cups of lentil daal and an orange veg curry. The daal and curry were bland and lukewarm.\n\nWith tax and tip my beverage-less meal came to $30.", "author": "Trish W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-03", "description": "Updated review. 2.5 years later and the food was just was just as good as I remembered.\nEVERYONE NEEDS TO COME HERE TO TRY THE NEPALESE FOOD. That is all.\n\nFav's\nPoleko Kukhura (chicken tandoori) - Prob one of the most moist & tender chicken you'll ever have!!)\nLamb samosa - so flavorful, moist, and BIG! lol)\nRice pudding - perfect texture and just a subtle hint of coconut", "author": "Emily C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-14", "description": "Went here a few nights ago with family and was treated to a truly delicious dinner. We started off with the Himalayan Momo - really tasty dumplings especially when dipped in the sauce along with Samosas and the Mismas Pakauda - a spinach dish with onion and spices. All served as a great prelude to our main courses of Poleko Khasi (lamb) and Poleko Kukhura (chicken) - that was served beautifully. Lamb especially is a tricky dish to prepare as many times the gamey taste is too obvious but this was not the case at all here.\n\nThe service was timely, polite and courteous and the ambience was perfect. Photos of Nepalese culture and locations line the walls and might even inspire some to climb Everest at some point. I am looking forward to returning here for another meal in the future.", "author": "Mike G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-13", "description": "Went to Little Nepal for first time. It was tiny place but comfortable and very decorative. We were offered great service. Liked the aromas, spices and dipping sauces that come with the papadums. For all our orders, we had the combo choice that comes with lentil soup, mixed veggies, basmati rice, Naan bread and tasty chutney. The Lamb tandoori and tiger prawns tandoori were very tasty. We also had the Lamb and vegetable samosas. Very nice! It was very enjoyable dinner.", "author": "Irene T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-26", "description": "We love this place! Every time we come to SF we make it a point to come for dinner. The staff always recognizes us and are super sweet and attentive. The food is amazing also, the samosas and rice pudding is my favorite, and we get different dishes with rice and naan bread that's always fresh and hot. Definitely recommend!", "author": "Cheryl H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-18", "description": "I walked in, ordered a #9, and left full and happy. This place is amazing and I can't wait to go back. In fact, I'm headed there tonight to get a second #9. I'm not even looking ok'ing at the menu before I order. So there!", "author": "Tracy A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-03", "description": "Excellent service everyone very friendly, excellent food and prices.\nStreet/meter parking or free on side streets, but very busy neighborhood \nParking can be difficult. \nExcellent place", "author": "Sergei Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-01", "description": "Me and my boyfriend went for dinner. We highly recommend this place for authentic Nepali food, served by friendly people and of course fantastic food.", "author": "Binjee R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-17", "description": "Woohoo, indeed! If you don't like spices you can get no spice. I go for mild and that's hot enough for me. It's a small comfy restaurant. I use their delivery at least once or twice a week when I don't want to cook. Good stuff at a reasonable price for the yummies you get.", "author": "Pamela H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-14", "description": "Love love love! They deliver in rain and shine and the food is always delicious! I wish I could go there more often.", "author": "Adriana A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-04", "description": "This is my go to for Nepali food and Bernal Heights is a great place to walk and shop all the food here has wonderful floral notes to it without being flowery. This is my second time here and I think the entree that they have set for 2 people is the way to go more then enough and if anything left overs. Very nice staff and knowledgeable about the cooking process will go again and suggest anyone in the area to stop by for $50-60.00 (without drinks) this is a great food experience.", "author": "Weyland W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-04", "description": "OMG this place is so good.  I had never eaten Nepalese food before coming here.  It's basically like Indian food, but lighter, more buttery, and not as many spices.  All of the dishes we got were fantastic, and the people working in the restaurant were adorable.  When I came back to Chicago I searched Yelp for a long time trying to find a good Nepalese restaurant, but sadly haven't found any options that look as good as Little Nepal.  \n\nI couldn't tell you what we ate (confusing names, pretty sure it was the Khukarako Ledo??), but it tasted really similar to Tikka Masala.  We also had another tandoor dish that was sooo buttery and creamy. Oh man. The momos were also good, and the little ball they give you for desert is complimentary.  Can't wait to make the trek back to Little Nepal when I'm back in the bay!!", "author": "Melissa B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-26", "description": "5 stars for their service! Went above and beyond my expectations. They are good at answering their phones.", "author": "Deanna C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-17", "description": "We had a great weeknight meal here.  Flavorful food, good service, and an inviting, pleasant atmosphere.\n\nMy husband and I shared the following dishes:\n\n1) Chicken momos - flavorful, with a tasty, spicy sauce\n2) Lamb choilla- very unique, but we weren't fans\n3) Sabjika Tarkari (cauliflower and potato curry) - delicious and light\n4) Tulsi (basil) Lamb - great \n\nEach entree comes with rice and naan, which I thought was very nice touch!  The complimentary tea (Chiya) and dessert (gulab jamun) was also very thoughtful.\n\nThe service was very friendly and efficient.  They made one error, but remedied it quickly and pleasantly!  Also, they happily helped pack our leftovers, which we appreciated.  We were able to walk in without a reservation on a Thursday night. \n\nThe setting and lighting are lovely, and the sitar music playing is very soothing.\n\nWe had a delicious dinner here, and look forward to coming back!", "author": "Barnali D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-17", "description": "Haven't had better Nepalese food before this! Good quality food with great service. Would love to dine here again!", "author": "Shalini O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-11", "description": "This has got to be my favorite Indian/Nepali restaurant of all time. I am happy I live so close to it. The food is consistently great tasting, not too greasy, home style and best of all, the Thali combo for 2$ is a steal and more than that it reflects how the food is meant to be eaten traditionally - as a complete meal with protein, vegetables, and carbs. I just wish they would add yogurt/raita to it and then it would be just like a meal at home.\n\nTo top it off, the owners and staff are just lovely and know hospitality.", "author": "Astha G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-11-15", "description": "Someone sent me a message in regards to my review of this restaurant.  Yes, restaurant prices are a questionable thing for sure.  But for my boyfriend and I who have never eaten there and saw that the majority of the entrees cost about $14 and up,  we were not willing to eat there unless they still accepted the Entertainment coupons.  My boyfriend is very choosy as it is when it comes to Indian food as he does not like curry although I do.  However, I do not like food that is too spicey.  But we were willing to take a chance and try the food.  We actually went out of our way to go there as the ratings are indeed pretty good here.  But it is getting annoying when an establishment no longer honors its own coupons.", "author": "Irene S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-01", "description": "The food is delicious and the staff go out of their way to make you feel welcome. Definitely recommend!", "author": "Scott S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-27", "description": "OMG, food is excellent! Service was great! It's got a homie feel, like moms cooking for you", "author": "Jeremy S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-11", "description": "Our neighborhood go to for dinner. Suzan is the owner/Mom, and she's takes care of us all the time!", "author": "Olita T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-17", "description": "Lovely little place in our neighborhood. Great for vegetarians.", "author": "Aaron M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-31", "description": "I've never had Himalayan/Nepalese food. So, I was a little nervous bringing my wife, and 75-year-old mother here.  Nepal is northeast of India and thought that my mom would burn her mouth on everything she ate and blame me for pooping fire.  \n\nI was wrong. She was very happy. The short: we were  not disappointed with any of the dishes I was served here.  Everything was delicious. The restaurant has a very cozy feel to it.  It is well lit and well decorated without feeling overly done. The servers were nice.\n\nDishes: chicken momo (potsticker-like dumplings), lamb chhoila (bbq-ed meat, even my lamb hating wife loved), alu tama bodi (think lentil soup with bamboo shoots), kukhura ra mula (marinated boneless chicken served with bell peppers and onion on a sizzing platter), and the machhako mitho takari (salmon on a sizzling platter).\n\nDrinks: Himalayan milk (chai w/ milk), sudha dahi (sweet yogurt)\n\nAte way too much. Chhoila and sudha dahi is a must.", "author": "Randy M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-12", "description": "Had dinner here on a Saturday night about 8 pm.  About 1/2 the restaurant was occupied and we were seated immediately.  The staff was friendly and the food was excellent.  We especially enjoyed the lamb momos and the garlic nan was perfect.  There were about 4 vacant parking spaces on Cortland so parking was not an issue this night.  We will definitely be back soon since my daughter is really liking Indian/Nepalese food.", "author": "VC D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-13", "description": "Really great !  Samosa was fantastic naan couldn't be beat.  We shared two dishes one lamb and one chicken absolutely awesome even the Indian beer was great !  Quiet little space. Awesome ambience. It wasn't busy. A real shame wonderful food and service. You should try it !!", "author": "Kathy J."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-08-19", "description": "What a disappointment :(\nI dined her with my mother & husband. Service was slow & seating was very cramped where we were sat (by the window). I know it sounds weird but the seats were waay too high for the shorter table.\nMy mom & I got bottled beers, so not too much to talk about there. My husband got a chi tea which left much flavor to be desired :/.\nWe ordered their dumplings which were good but took quite a while to come out (the restaurant was not too busy).\nNext we had the sog paneer which was okay and the combo neater platter for 3 with chicken, lamb, & salmon. The convo meat platter came with rice & a piece of nan bread. Most of the meat was super overlooked. The chicken was way to dry, the lamb was dry & tough, & the salmon was a good preparation. \nWith all the restaurants in San Francisco, I don't think we will be back. My mother who lives in a small town in the Midwest was more forgiving than me but again, of all the places, I don't think she'll be back either.", "author": "Ashley G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-23", "description": "Staff is warm, friendly and attentive. This is by far one of my favorite restaurants and I always tell my friends about this place. Decor is sweet, bright and reminds me of just a fun place to be. Veggie momo is delicious and steamed to perfection. I especially LOVE the tomato chutney. I try and recreate it at home but always fail to do so. The veggie platters are delicious! Mainly because the saag is farm to fork! Organic and healthy. My son loves the lamb tandoori which lamb can be disgusting if not cooked right. Chef makes lamb tender and moist and full of nepals special spices. One of my favorites is the seafood tandoori with king sized prawn and thick pieces of salmon. Im hungry just thinking about it. Yum! This place I believe is one of the first nepalese restaurants around that area and you definitely can not imitate the original. Will be back!", "author": "Vicki E."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-08-04", "description": "I wish it was possible to give them ZERO stars. I'm not only dejected but disgusted by their utter unprofessionalism. I mean, what kinda business refuses to serve their customers? \nAfter 15 minutes of putting in a delivery order online on Yelp, I received a call from a third-party, which I assume must be a facilitator between Yelp and the restaurant, saying that the business won't  make my delivery; their reason: difficulty in finding a parking spot in my area. Granted that I live on Market street and finding a parking can be a little tedious here,  i offered them a simple solution to the issue: I'd wait outside on the street when the delivery is on the run to save them from parking hassle. To my bewilderment, shortly after, I was told that the delivery-driver flat out denied making my delivery ( no reasons told) , and therefore no food was going to be delivered. Must applaud their blunt straightforwardness.\n\nEither don't take the orders at all, or at least have a convincing reason for your incompetence!\n \nTake note: I'm ethnically Nepalese and I feel proud to see Nepali businesses and establishments flourishing and doing well in the SF community and I feel innately attached to them JUST BECAUSE IT\"S NEPALI. I care less most of the times and look the other way when the service or food is sub par. But this kinda attitude?? INTOLERABLE! \n\nAfter finishing writing this diatribe, I ordered my food from Cusine Of Nepal, which happens to be located in the same vicinity as Little Nepal, but they didn't have any qualms delivering my food.  Kudos to Cuisine of Nepal!!\n\nLittle Nepal, step up your game!", "author": "Naraami G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-01", "description": "Truly incredible neighborhood gem. The food here is absolutely delicious. We had the set menu for 2 and were totally stuffed + had some delicious leftovers to take home and continue the flavor party the next morning. Perhaps the best part of the meal was the rice pudding which was OOOORGASMIC! We will be back soon and often!!", "author": "Justin Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-28", "description": "This is probably my favorite place to eat when I go to the Bay Area. Too bad it's two hours away from me but when my son and I are really craving it, we'll make the 2 hour trip together. He loves the Kukhurako Ledo. The food is amazing, I love the decor and the staff is very friendly.", "author": "Cesar S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-25", "description": "This isn't a review about the food but about the service.  I forgot my credit card at the restaurant.  I called the day after and they agreed to mail it back to me since I lived at least an hour away.  I received it in the mail a few days later. I really appreciated that!", "author": "Joe D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-20", "description": "Lovely little place with very tasty food and great service.  We got veggie samosas, the mushroom curry a la carte, and the mustard leaf curry combo.  The food was delicious, satisfying, and hearty, and it was not greasy at all like other restaurants.  Their mint chutney (comes w samosa) and creamy tomato chutney (comes w combo) were clearly made from scratch and tasted fantastic.  \n\nWe came here with a restaurant.com coupon, but will definitely return even without one.  Street parking is easy to find.", "author": "Bee M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-08-10", "description": "They lie about their delivery time and cause issues. This place is bad for delivery so far. If you are willing to be lied to and wait in the cold hungry while being told it will take 30 more minutes over the time you already have been waiting then this is perfect. Starving and waiting in the cold with unreliable information from the delivery app.\n\nFood was ok. The momos were good enough but had two strands of short hair in mine. The chicken was disgusting and inedible. We ended up throwing it away. It smelled pungent and tasted rotten.", "author": "Nancy P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-11", "description": "Really tasty food -- excellent, friendly, efficient service. The whole package. We all had Tandoori dishes (salmon & shrimp) and they were delicious. Will definitely be back.", "author": "M H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-24", "description": "I love this local place.  The owner uses fresh produce from her amazing garden and is so wonderful and friendly.  Love the food!  Thank you!", "author": "Sarah C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-04", "description": "Delivery was so quick and painsfree. Amazing food and right amount of spice levels. Definitely going to order again several times.", "author": "Bhargavi P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-06", "description": "I literally just licked my bowl (all the bowls) clean.\n\n* Chicken Momos - if you don't like these there is something seriously wrong with you. They are dense little pockets of yum. The sauce is VERY spicy in all the right ways. I wanted to dip everything in it.\n\n* Lamb choilaa - now this was interesting, and recommended by my friend from Nepal. The puffed rice was a new texture for me, but I loved the crunch when eaten with the lamb. There meat was perfectly cooked and tender, and the chunks of ginger and spices were delicious.\n\n* Kukhurako Ledo (combo) - the creamy cashew sauce was incredible. It was the perfect blend of smoky, sweet and savory. The chicken was tender and perfectly sized. My stomach is stuffed but my tongue is still craving it. The lentil soup and curried vegetables that come in the combo were good, but not as fantastic as the main event. Served with a great portion of rice and a crispy naan that was so much better than any naan I have had. There was a smooth chutney/sauce that didn't seem to go with anything, or maybe I may have done it wrong?\n\n* Rice pudding - perfect portion and end to the meal. Reminded me of horchata a bit. Really appreciated the gesture of a complimentary treat. Not many restaurants do things like that anymore.\n\nMy husband and I split all of the above, and it was the perfect amount of food. (We're not small eaters either). I can't wait to come back!", "author": "Haley J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-21", "description": "This is great! The food is delicious and presented are very excellent. I can't wait to come back! Thank you for sharing. :)", "author": "Golden One A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-30", "description": "Little Nepal is delicious! The food is amazing and the service is too. I order delivery from Little Nepal all the time. It comes fast and the delivery comes with a smile. Always great. You won't be disappointed!", "author": "Matt C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-28", "description": "I get delivery from this place at least once a week.  They're always on-time and the food is always hot, which is great. There are a few different Nepali places around that I've tried, but Little Nepal is consistently the best. My go-to order is kukhurako ledo, which is a lot like chicken tikka but richer and smoother. It's definitely a good first thing to try, along with some veggie momo (vegetables are good for you!).", "author": "Josh M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-13", "description": "The food is excellent,staffs member are great service. Love the Nepali food   Recommends to everyone want try", "author": "Susan L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-02-25", "description": "The Thaali set I ordered in my opinion was a bit pricey. And by definition, thaali is a set that includes variety side dishes (veggies, pickles, dessert, daal etc.) but they only served rice, naan, and meat. They even said the daal is \"on the House.\" Servers were nice and friendly though.", "author": "Tsering G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-27", "description": "Delicious! Was feeling adventurous and first time trying Nepalese food. We walked in and were seated quickly. Service was great and the food was amazing.\nWe ordered:\n- the Samosa: packed with flavor, I enjoyed the mint sauce. The sweet and sour sauce fared well.\n- the Kukhura Ra Palak: this was my favorite dish out of everything. The chicken was tender and curry sauce was amazing. My husband who doesn't tolerated any spicy foods couldn't stop eating it. My son finished the leftovers the next morning. \n- the Mismas Poleko Masu: had chicken, lamb and salmon. The dish was served on a sizzling plate. Although the meats were a little overcooked for my taste, my husband devoured it.\n- Tofu Tarkari: soft tofu with crunchy string beans in a creamy sauce.\nThey gave us free dessert, not sure what it's called. It was a little cold pastry ball in a sugary glazed sauce.\nWe will definitely return to try their other dishes.", "author": "D V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-22", "description": "Delicious authentic Nepalese food, generous portions and reasonable prices.  Attractive decor, relaxing ambiance, efficient and friendly staff.  Many delightful selections for omnivores and vegetarians alike.  I highly, highly, highly recommend this place!!!", "author": "Patricia G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-28", "description": "I just learned that Little Nepal is NOT MOVING and I'm SO HAPPY!!! The ambiance at this cozy spot is great. Sizzling Tandoori Lamb is to die for, and their lentil soup is amazing. \n\nEven though my husband tries to lead a vegetarian-free diet, he (rightly) loves the Alu Tama Bodi, and orders it regularly. I also love that they deliver to our house whenever we need our Nepali fix.", "author": "jenna p."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-27", "description": "Food: 4\nService: 5\nAtmosphere: 5\nCleanliness: 5\n\nCute little place. I was so not in the mood for curry, but my friend was craving lamb so we hit up Little Nepal. Luckily they had much more than curry available... I got the prawns that came out on the hot plate. I could've chosen a la carte for $17.99 but I opted the combo $19.99, which came with white rice, a couple corners of naan, a mini side of lentil soup and a mini side of curried vegetables. The prawns and his lamb were a little tiny bit over cooked, which was partially our fault because they sat on the hot plates too long. Besides that the dishes were both very flavorful with sautéed onions and cabbage along with the meat. So were the rest of the sides. I came with hardly an appetite and we both left after practically licking our plates clean, simultaneously. \n\nService was efficient. They were busy, but still approached us and sat us as soon as we walked in.  \n\nThe tables were clean, they had cloth covers, glass tops and even paper on top. \n\nI like this little place. It's low-key and can be a casual dining experience or even a good place for a blind date (it's cozy). \n\nWould I return? yep!\n\nEnjoy!", "author": "Cassandra E."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-07-19", "description": "3.5 stars.\n\nGood food, but portions are definitely more for single serving than to share family style. We ordered everything a la carte, which comes with 1 scoop of rice and 2 pieces of naan, and 1 appetizer and 4 entrees were juuuust enough for 5 people -- luckily 2 of us weren't very hungry at all, otherwise we definitely would have had to order more food. Flavors were good, and the lamb dish (with basil) was very well cooked. Just wish there was more for the price!", "author": "Kathy L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-10", "description": "Wonderful restaurant with such a cool vibe. I felt like I was at Everest base camp siping on a Pinot eating tasty Indian food...not as cold with far more oxygen of course. ;-)  Super friendly staff and very pleasant decor - and the food was really good. This place is a repeat for us!", "author": "David F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-23", "description": "Loved our food and this quiet spot so much. Salmon curry was incredible. Great selection of vegan curries for my date. It's bright and cheery.", "author": "Jazmin H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-06-09", "description": "I've never had Nepalese food before...similar to Indian but more mild in flavor and spices.  We ordered delivery - perhaps not the wisest approach.  Not sure what happened but something got lost in translation.  We ordered a la carte and appetizers - rice and naan was extra $$.  We ended up with what looked like combo meals on top of the extra sides we ordered so less of the entree and up to our chins in naan and rice :-/ for $95 worth of food we felt majorly deprived.  We have lots of bread and rice left...I think ordering Indian food for delivery is the better option next time.", "author": "Jade P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-06-29", "description": "This place is a small joint in Bernal Heights that's serving up some Nepalese food. Their menus claim to be the first Nepalese restaurant in SF, but somehow I find that hard to believe.\n\nI had mixed feelings about this food. We tried the veggie momos, the nepalese chow mein, and then tofu and green beans combo platter. I would skip the momos and the chow mein - neither were great in my opinion. We substituted the tofu for paneer in the tofu and green beans dish and it was really tasty! It was basically their take on paneer tikka masala but with green beans as well! The combo plate is a really good deal for all the food you get! \n\nThe restaurant does serve sizzling platters as well so when we were there, it tended to get very smokey at times when they brought out one of those plates. The service was also pretty slow. I think this would be a great takeout place for their curries, but I would skip the traditional nepalese dishes, I did not enjoy them at all!", "author": "Malika R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-01-07", "description": "I came to Little Nepal for dinner on a weeknight and shared with a friend: \n\n--Mismas Poleko Masu Tandoori: Combo tandoori with chicken, lamb and salmon. Very flavorful and each protein was cooked perfectly. \n\n--Palak Paneer: Not as flavorful as expected. I thought cheese was tofu at one point and I wish it was a bit more warm and melted.  \n\n--Garlic Naan: Great garlic flavor but naan was very soft. I like a bit more crunch in my naan.\n\nService was friendly and the restaurant is little but cute and clean.", "author": "Maya S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-20", "description": "Great food out here I really like the lentils and service feels homely. Food is really really awesome feels like own food you have back home in my country in Nepal. It's really really awesome.", "author": "Nikesh L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-24", "description": "Server was nice polite and had a smile. Very helpful in choosing an Authentic Nepali dish for me. Food is nothing I have ever tasted. Very unique. I will be back", "author": "Joshua J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-15", "description": "My boyfriend & I went here about less than a month ago as we just moved to area. The service was really great as we walked in 10 min before closing & they served us without rushing us.  The food was simply Delish.  We tried what the waitress recommended as it was our first time but very similar to Indian food with different names. They even gave us a free dessert to try as they were out of our first choice. The only downside was it was a bit pricey so we wouldn't go there regularly unless it's a special occasion.", "author": "Marta L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-01", "description": "YUM.  Came here with a friend who has tons of dietary restrictions (no gluten or dairy) and we both managed to have some super tasty stuff.  Following the Yelp masses, I ordered the [long Nepalese word for chicken] Ledo, which was like a really good, really creamy Indian chicken tikka masala.  My friend had one of the famous vegetarian dishes (with cilantro) and I wished I had more of my Ledo to barter with him!  I'd recommend going in a group and doing it family style so you can try all the goodness.", "author": "Aaron M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-07", "description": "Fantastic Nepalese way up in Bernal Heights .  Ordered the dinner for two and it was awesome.  The waiter advised us to just mix everything together and eat it and it was great.  Super friendly staff, nice interior and awesome food but it may come at a bigger price than other Nepali places.  The dinner for two with drinks ran about $70 but you do get a ton of food so it was well worth it.  Can't wait to go back!", "author": "Anthony G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-20", "description": "This place is great!  We had a great meal.  The staff is very friendly and very attentive. The  owner is warm, friendly and very inviting.  She recommended us some really good dishes.    We will be back!", "author": "Darren K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-10-01", "description": "The service is fine. The interior is fine. But the food is strictly okay. \nWe tried three things \n1. Momos -half chicken and half veg \nThe Momos were not tasty  (I have eaten many plates of Momos and this one goes to the bottom of the list). The dip/chutney lacked character. \n\n2. Choila \nThis was perhaps the OK dish from the entire lot. The puffed rice was crisp. But the chicken was cooked and spiced enough to be served...what I mean is...there was no extra effort to make it tasty. \n\n3. The mixed tandoori platter \nIt was the same chicken that was served in the choila. I had to saw through the lamb to fork it. They serve it with rice and naan....and they all sit together dry.. like they aren't on talking terms. \n\nIf you have had Nepali food in the past, you may want to skip this place. If you haven't had Nepali ever, this restaurant may be a one-time novelty. But please go to other Nepali places after.", "author": "Rapunzel C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-11-03", "description": "Delivery came more than 2.5 hrs after ordering, more than 1.5 hrs after the maximum estimated delivery window.  Tried calling the restaurant 8 times while waiting trying to get an update on the delivery status without success (no answer & voicemails).  By the time the delivery came hours l had to refuse delivery.  Worst customer service & experience ever.", "author": "Tim M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-02-04", "description": "My score for this restaurant would be 3.5 stars. This mainly due to the fact that my particular entre wasn't that great, but there were some outstanding dishes that were ordered. \n\nI ordered curried cauliflower (sabjiko something or other) the first entre under the vegetable heading. The texture of the veg was somewhere between soggy and crunchy and didn't have very much depth of flavor. The table also ordered a couple of lamb dishes and the tomato chicken with cream. After reading the menu a a bit I discovered that meat entrées are divided by meat. \n\nFor example I learned that kukurhako (sp.) means chicken. The lamb that was ordered was outstanding. Almost like lamb fajitas, really tender high quality lamb chunks. I really wish they had combo entres for a single person. So instead of getting an entire meat entree u would have veg and meat on the same plate. Ordering family style would solve this problem, but the family I was with doesn't play this game. Sad. \n\nOverall a satisfying meal. They added on a bonus dessert of either rice pudding or a small scoop of vanilla ice cream.", "author": "Alex S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-07", "description": "Woohoo, indeed! If you don't like spices you can get no spice. I go for mild and that's hot enough for me. It's a small comfy restaurant. I use their delivery at least once or twice a week when I don't want to cook. Good stuff at a reasonable price for the yummies you get.", "author": "Andrew Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-19", "description": "I've actually been to Kathmandu. Yes I have. Even hiked a few days on the Annapurna Circuit. Aren't you impressed? No? Well, I don't know you so who cares (shrugs). Anyway, I can count on one finger the number of times I've had Nepalese food since that trip. That finger was the Taste of Himalayas restaurant on Lombard, which turned into Shangri-La and then switched to Indian as Viva Goa. In fact, Little Nepal may be the only Nepalese place left in the city since Metro Kathmandu in the Lower Haight closed a couple of years back. That seems a pity since it's a hearty, tasty cuisine, a compelling melding of Indian, Afghan and Tibetan flavors that's quite unique.\n\nIt seems ironic how you have to trek to the peak of Bernal Heights on Cortland to find this hill station of a restaurant. Once you're inside, it's quite clean, modern and tranquil except for the 24-line bus that keeps rattling by. Jamie W. and I decided to take that bus for the first time from the Castro and discovered a whole section of the city we never traversed. I knew the first thing I wanted to order was the $6.99 plate of Himalayan Momos. Momos were what my sherpa and I ate for dinner on that Annapurna trek. Impressed yet? Oh who cares. Anyway, the momos here didn't look like the creased, overstuffed pillows of joy I remember.\n\nInstead, they looked like standard potstickers but much meatier with plenty of minced pork inside and a sturdy wrapper that tasted quite al dente. It came with an unusual chutney sauce mixed with chili and sesame oil (see photo). Jamie ordered as his entree the $16.99 combination dinner of Khasiko Masio Masu, which is a spicy minced lamb curry cooked with mushroom, green peas and spices. It came with all sorts of goodies - basmati rice, naan, a lentil stew, mixed seasonal vegetable in a broth, and more of that chutney sauce (see photo). It was genuinely good stuff.\n\nMine was a carnivore's delight and an overeater's dilemma - the $19.99 combination dinner of Mismas Poleko Masu. This is what Sizzlers would generously call a mixed grill special - chunks of tender tandoori chicken, Atlantic salmon and lamb, all of it marinated in olive oil, garlic, ginger and spice and nicely charred on a cast iron server (see photo). I also received the same delicious accessories as Jamie. Needless to say, we were stuffed with no mountain climbing imminent to burn away what surely must have been a high triple-digit calorie dinner. Out of guilt, we briskly walked down Cortland and then cut across Mission just so we could pretend some of those momos melted away.\n\nFOOD - 4 stars...delicious Nepalese food, your only option in the city unless you go across the bay\nAMBIANCE - 3.5 stars...hill station chic\nSERVICE - 3.5 stars...smiling though their attention wavered when their regulars started coming in\nTOTAL - 4 stars...did I mention I've been to Kathmandu? Oh who cares.", "author": "Ed U."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-08-31", "description": "Little Nepal  |  925 Cortland Ave, San Francisco, CA 94110  |  415.643.3881\n\nSome old college buddies and I were meeting up for dinner in San Francisco and wanted to find something convenient to public transportation.  We don't have the opportunity to get together often since we live all over the Bay Area, but we were excited to finally catch up over some yummy Nepalese food in Bernal Heights.\n\nTo make things simple, we decided to order their set menu for 4 people, which we were told would be plenty of food for our little group.  We started off with their mismas pakauda, which was a fried spiced spinach and onion mix with mint sauce.  We all really enjoyed this dish and it was sort of like Nepalese onion rings.  Next came the Himalayan pork momo's, which were steamed flour dumplings served with a couple different sauces.  This was another delicious dish that I really enjoyed, and the dipping sauces were all really tasty and spicy.\n\nOur entrees consisted of alu tama bodi (a curry of potatoes, black-eye beans, and bamboo shoots cooked with fresh tomato, garlic, ginger, and spices), khasiko masino masu (minced lamb curry cooked with mushroom, green peas, and spices), and poleko kukhura (tandoori boneless chicken marinated in yogurt, ginger, garlic, and spices).  I really enjoyed the lamb curry and the vegetable curry was ok too.  The chicken was a little bit dry for me, but had good flavor overall.  Along with the entrees, we were served rice with naan, some lentil curry, and another side dish that I couldn't identify.  I didn't think it would be enough food, but it turned out to be quite a bit, and we were all very full by the time the rice pudding dessert came.\n\nThe food here is pretty yummy, but the service is something else entirely.  I actually thought it was pretty bad and there was a language barrier that made communication almost impossible.  Checking out was slow and we did our best to try to accelerate the process considering people had buses and trains to catch.  Overall, I think it's worth coming for the food if you're willing to be patient with the service and not ask too many questions.  You'll only be frustrated in seeking a response.\n\nFood: 7/10\n\nService: 4/10\n\nPrice: $$\n\nAtmosphere: 7/10", "author": "Joe M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-05", "description": "This is my favorite take-out or delivery establishment. We've tried many of the dishes, and you can't go wrong. The momos (vegetable or chicken dumplings) are awesome, and I love the garlic naan. Good-sized portions. If two of us order two main dishes and an order of momos, we usually have enough leftovers for at least one meal.", "author": "Svetlana Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-14", "description": "Birthdays always count for a celebration of sorts. We celebrate the birthday year with friends and family, almost always sharing the moment by dining out or enjoying a meal together. Since it was my Dad's Birthday, he chose a local spot in Bernal Heights with Nepalese food. \n\nThey are only open for dinner and have mostly small tables, so it is wise to call ahead and make a reservation. We were seated and while we were waiting for the rest of our party we ordered a couple 22oz of Flying Horse beer which is light and balances the spice in many Indian and Nepalese foods. http://goo.gl/0Ql84\n\n*Veggie Samosas: 2 to an order and very large. The sauces are a cilantro based sauce and tamarind sauce, one adding a fresh spice kick and the other a sweet. http://goo.gl/Y9o1N\n*Malaysian Chicken Momos: These are like steamed pot stickers, which is not completely new to us - but the sauce is mild yet flavorful. http://goo.gl/cVdRO\n\nFor dinner we all ordered a combination plate http://goo.gl/8nKUb where you pick a main and get the same sides. You can also order ala carte, but we wanted it all. You get light basmati jasmine rice, lentil soup, vegetables http://goo.gl/jzcCj and naan with your main dish. We decided to share some of our main dishes amongst us in typical \"family style\":\n\n*Lamb Tandoori: While I hardly ever order lamb, I decided to take a chance and order this for myself. Some of the pieces were completely tender while others were a little bbq'ed, all were delicious. I really enjoyed this and shared it with others. http://goo.gl/utFzp\n*Salmon Tandoori: Lighter protein with the same sauces served on a bed of grilled onions and peppers like the others. http://goo.gl/J8wJQ\n*Prawn Tandoori: Probably the most attractive dish of them all, these had great flavor. http://goo.gl/PeIJQ\n*Salmon Curry: Based in a sauce, the same light grilled fish served in a tiny copper pot. Don't let the size fool you, these are enough for one and perfect for sharing. http://goo.gl/SkoK4\n*Lamb Curry: Very tender lamb, much softer than the tandoori and based in a sauce with light veggies. Perfect over rice.\n\nFor dessert, we brought our own, but they gave us plates so we could sing and wish my Dad another wonderful birthday.", "author": "Rebekah T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-07-29", "description": "Despite having lived in SF for so long, I've never really trekked out to Bernal Heights to check out the neighborhood.  Cortland Avenue's strip of restaurants and cafes is pretty cool, but who knew it was also home to the only Nepalese restaurant in SF?  Surprising, given they city's vast food scene, but apparently true according to Yelp.\n\nSince my friend and I were having Nepalese food for the very first time, we both wanted to try a variety of items.  We started with the Lamb Samosas and each ordered an Aanp Ra Dahi (Mango Shake), but we couldn't decide on what entree to get.  As it turned out, the Mismas Poleko Masu was the perfect dish for us - a sizzling platter of Tandoori Chicken, Atlantic Salmon, and Lamb (marinated in yogurt, olive oil, garlic, ginger, and spices).  Making it a dinner combination (instead of a la carte), the sizzling platter also came with basmati rice, buttered naan, lentil soup, mixed vegetables in curry, and a spicy dipping sauce.\n\nThe lamb and curry in the Samosas matched really well (though I could have done without the peas) and I liked how the dough wasn't chalky, but it was the size of each piece that impressed me the most (http://www.yelp.com/biz_photos/Kx1WExNj5ogaFe0cyg9L6A?select=kHHFjcxOyoUuVt19RcYclg#Clv1Iljrd6k2ENruckjMPw).  Just based on that, I already knew I wasn't going to be able to finish my entree.  Out of the three (http://www.yelp.com/biz_photos/Kx1WExNj5ogaFe0cyg9L6A?select=kHHFjcxOyoUuVt19RcYclg#9wRyp0L7xMUTSv6toidyQQ), I liked the Atlantic Salmon the best - flavorful and the center stayed surprisingly moist.  The Tandoori Chicken was pretty decent overall (although a touch dry), but the lamb felt overcooked and dry.  The taste might have been okay, but I can't say for sure since I couldn't get past a couple of bites.\n\nAs for the side platter (http://www.yelp.com/biz_photos/Kx1WExNj5ogaFe0cyg9L6A?select=kHHFjcxOyoUuVt19RcYclg#W_YJtWRC2JsR_rYQHMCatw), it was just okay.  The buttered naan and lentil soup were pretty good, but the vegetable curry wasn't anything special and the basmati rice was literally tasteless.  I would certainly get the Aanp Ra Dahi again (nice balance of fruity and creaminess... http://www.yelp.com/biz_photos/Kx1WExNj5ogaFe0cyg9L6A?select=kHHFjcxOyoUuVt19RcYclg#fsHvURTcO3DxTzVhiyX_5w), but I'm not sure if/when I'll be coming back to Little Nepal.  I know fellow Yelpers are quite fond of the place, but I'd rather check out some of the Nepalese places in the East Bay first.", "author": "Mike L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-02", "description": "Delivery said 30-45 minutes and took an hour and 15 minutes. Chicken in the chow mein was very dry. Cashew sauce chicken (first thing on the menu) was very good. Portions are pretty small but come with rice and naan. Garlic naan is delicious. Saag paneer was good. Same owners as the other Nepal place where it's a better experience dining in since the customer service can't be beat.", "author": "Tish M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-02", "description": "The food here is so yummy! there are only about ten tables but it wasn't crowded on a Saturday night at 7:30. The ambiance is really nice. My boyfriend and I ordered the samosas (great), the tofu and green bean curry (great) and the sizzling chicken (great). The tofu and chicken were cooked amazingly well and we basically wanted to lick the sauces off our plates. \n\nThe tofu dish was a little small but comes with either rice and yummy naan, or rice naan daal and veg for a couple dollars more.\n\nCan't wait to come back!!", "author": "Bari S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-09-01", "description": "disgusting! we ordered for pickup & the portions were pretty small. one dish was not discernible as to what was in it. basically it was just cooked down into a mushy stew. \n\nI had the Kasiko Pakuwa  and was rudely awaken to the runs IN MY SLEEP! and another 1.5hrs later, yet again, I'm back on the toilet. Thank god I didnt eat much & hopefully my body's rid of it all.", "author": "Ly T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-02", "description": "Super cute and small spot in Bernal right next to all of the shops/boutiques on Cortland. We had no idea there was a happy hour (Tues-Thurs from 5:30 pm to 7:30 pm) which had everything including drinks at 20% off. There was no one else in the establishment but we were fine with that. :) Our host/waitress was really nice and helpful with suggestions--there were plenty of vegetarian options for my veggie friend too. Dishes are around $12-15 each depending if you want a la carte or the combo which includes a couple more sides. For three hungry 20-something year olds, we got an appetizer, three entrees, garlic naan, a carafe of red wine and only spent around $60. Would definitely go back again soon!", "author": "Sarah M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-19", "description": "Probably one of the cutest little places I've ever eaten at. They even have vegan options! I was pleasantly surprised with how quaint the restaurant was and not to mention the server was very sweet and had good recommendations. Very affordable place so I definitely went all out and splurged. I was on vacation when I came here to eat so this was a nice little spot to discover. The atmosphere was cozy and they have Nepalese music playing throughout the venue so it really does add to the ambiance.", "author": "Ahryana H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-09-29", "description": "This place was  okay, the spices aren't too strong. Nothing really caught my taste buds... \nHimalayan momo  is a no go! Not yummy, skin was too soft and it was dry, the sauce that came with it didn't help either \nPoleko Kashi sizzling tandoori plate wasn't too bad, tasty\nChowmein ra sabi was the best plate for me, it was the perfect noodle dish but then again it's hard to mess up on chowmein...\nKukhurako Ledo was an entree but it was so small! \nOrdered one more vegetable curry that was not memorable as well", "author": "Christina T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-22", "description": "There's a convenience to Little Nepal.  It offers quality Nepalese food in comfortable surroundings.  It gets a bit less foot traffic than it probably should, but that means that one can more readily find a seat there than more bustling places down the block (Red Hill Station or Vega, for example).  The staff are friendly and welcoming.  Takeout options have served me well when I preferred to dine at home.  \n\nPortions are very reasonable, particularly if you get the a la carte option.  Try the momos if you're dining in a group.", "author": "Rob R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-11", "description": "Best Nepali food ever eaten!!! And I spent 2 months in Nepal and have eaten great Nepali food regularly in Colorado but Little Nepal had to be the most delicious Nepali food Ive ever had!!!\nWe ordered both of these dishes as combos (You get dal and some other yummy dish include, rice, naan) 1. Saagko Tarkari- which is Seasonal Mustard Green Leaf in incredible sauce with lots of delicious spices and 2. Bhanta Tarkari - which is Peeled eggplant cooked with fresh tomato, garlic, ginger and spices. Loved them both !!!! Very unique and sooo delicious!!!! \nCant wait to return!!! HIGHLY RECOMMEND!!!!", "author": "Julie V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-07", "description": "I really enjoy eating here and always get excited before I do. It's consistently tasty with large portions for leftovers, and the option to order as a meal or a la carte makes the price a great value. Service has always been friendly, but questionably professional during my most recent visit.\n\nI drove by at 9:15pm with the intent of ordering takeout, since their hours state closing at 10pm. I noticed the \"closed\" sign on the front door, but there were still people inside...so I called to see if they were actually open. A younger guy answered the phone and I asked if I could place an order for pickup, and he goes, \"Yeah, I guess that's okay. The kitchen is about to close.\" So I took the yes and ran with it. While I was still driving around looking for parking, I asked him what the chicken curry options were and he goes, \"I don't know, we have a lot.\" I'm slightly irritated at this point because they don't even have a proper menu listed on Yelp, let alone have their own website, and I'm trying to take advice on what to order from someone who doesn't sound the least bit interested in helping me. I finally asked him if he could just wait for me to park and come in to look at the menu, which he said yes, but when I arrived and had questions regarding the differences between 2 of the dishes, he mumbled something quietly (which I still don't even know what he said,) and I just gave up at that point and ordered something random. I watched him interact with guests that were closing out their tabs, and he was completely disengaged with them as well. So, maybe he was new, or having a bad day, or maybe he didn't care to be there...but either way, it was the service that led me to write this review.\n\nOn a brighter note, the kitchen accidentally gave me extra food that I didn't ask or pay for...so yay for me! I'll still be back again, and I hope this place stays in business. My only guess for wanting to close early on a Thursday night is a lack of business.", "author": "Kimberly R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-17", "description": "They deliver to my house and are SO delicious.  I've yet to order poorly - and I'm exploring the menu instead of sticking to the favorites I've found.  This is unusual for me!", "author": "Kim C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-03-04", "description": "Food is okay but the spices seem a bit off for Nepalese food. Would recommend the nearby neighbor Cuisine of Nepal instead.", "author": "Brittany R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-03-25", "description": "Based on the reviews, I had much higher hopes. \nThe raita was turning, sour and effervescent. Not okay.\nThe cilantro chutney was probably the most flavorless I've ever had.\nThe naan was underdone and soggy, garlic included.\nThe basil lamb was quite delicious and the tandoori chicken was tender, saving them a star.\n\nThe service was friendly.", "author": "Fareed R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-13", "description": "I have never had Nepalese food anywhere else, so I admittedly don't have much to compare this place to. But I've really enjoyed the food each time I've eaten there. It has some similarities to Indian food. It's usually not super busy so it's a nice last minute dining option if you're in the area.", "author": "Diana G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-01", "description": "Chicken Tikka masala is outstanding (add a touch of salt)!!!!\nAlways delivers on time, but usually before quoted time!\nThe owner/manager is awesome!!!\n5stars", "author": "Heather M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-18", "description": "THis place was pretty good, the food was more sweet than spicy.\n\nThe chai tea didn't quite have enough bite .\n\nPlace is a lil pricey like most places in Bernal heights but hey its the only Nepal place around. \n\nThe food was very sizzling.\n\nEven the lime was hot.  The meat is very tender.\n\nNothing else compares to the food here.\nI can guarantee that. .\n\nThe rice pudding is really good too.", "author": "Luke S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-26", "description": "Bright, clean, yet still peaceful and atmospheric. Vibrant, but acoustics are fine for easy table conversation. Very tasty dishes. A lot of similarity between the items (same spices and so on). They stick with what works!", "author": "T G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-10-13", "description": "I had dinner there once.. The dumplings were really good.. But was a little disappointed with the curry dishes...never", "author": "Shashank D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-21", "description": "One of my favorite spots! There's never a wait and it is super cozy inside.  Super friendly service... A real neighborhood gem!\n\nWe got the:\n\nLittle Nepal Special Chhoila \n     Cubes of barbecued Chicken marinated in olive oil, mixed with garlic, ginger.\n\nKukhura Ra Palak \n    Boneless chicken cooked with spinach, fresh tomato, onion, garlic, ginger, spices and light creamy sauce.  \n\nPalak Paneer \n     Minced Spinach and home-made Cheese cubes cooked in fresh tomato, onion, garlic, ginger, spices and creamy sauce.    \n\nChhayau Tarkari \n    Mushroom cooked with fresh tomato, onion, ginger, garlic,and spices   \n\nEVERYTHING was super fresh and flavorful! Just the right amount of spice and heat. And we had plenty for leftovers... If they make them home. ;)\n\nCan't wait to come back soon!", "author": "Nina S L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-22", "description": "Truly a haven of wonderful varying flavors with every entree combo. The samosas also are VERY good, clearly freshly homemade. The dishes they use are beautiful as well. Which really contributed to the harmonious ambiance. Cannot wait to go back!", "author": "Lauren A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-26", "description": "The best Authentic Nepali Restaurant in the Bay Area. I love the service, the Fresh Food, the interior design, and the most important is the Owner is the best, he always come to your table and check on you. The best Service ever! Thank you so much for delicious food!", "author": "Hendrik N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-09", "description": "This has quickly become one of my favorite restaurants. Their veggie chow mein is delicious, as is everything else I have tried here. The fact that they deliver through Yelp's partner service is an added bonus.", "author": "Justin S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-26", "description": "Stopped by here with my wife while traveling through the southern part of San Francisco a while back.  We shared the todu tarkari and alu tama bodi and I have to say we were both very happy; interesting flavors that were a bit more unique than the sort of Chinese/Indian fusion that I had come to expect from Himalayan cuisine.\n\nThe service was friendly and the interior decor was pleasant.  Would definitely come back here.", "author": "Alan S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-13", "description": "Happened to be around Bernal Heights last night so finally got to try Little Nepal which I had bookmarked for months now -- very nice dining experience.\n\nThe décor is small but surprisingly modern with wood panel walls and bright lighting.  Service was great, food came quickly, was delicious and piping hot.  I will say portions are not large, but with heaviness of Nepalese food -- I felt full and was ready for bed immediately after!\n\nThe group of 5 of us ordered the following, listed from favorites to ... less so:\n\nTofu Takari ($12) -- Fried silk tofu in tomato cream, highly recommended!  Never had silky tofu in a curry before, but found it to be delicious!\nPalak Paneer ($13) -- Spinach and cheese cubes curry.  Very fresh ingredients and super flavorful.\nPoleko Khasi lamb ($16) - Lamb tandoori.  Great dish.  4 huge pieces of boneless lamb, tender and juicy.\nKukhurako Ledo ($16) - Boneless chicken tandoori.  I'm shocked it so recommended so often as while good, was definitely not the best thing on the table.  Chicken was slightly dry...\nHimalayn Momo ($7) -- basically Nepalese/Indian version of dumplings.  I wasn't as crazy about this dish, but perhaps b/c I'm Chinese and have a bias on what dumplings should taste like\n\nWe enjoyed our meal and I'd definitely be down to come back if I'm ever in that part of town again.", "author": "Kendra W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-09-14", "description": "In \"Will & Grace\" (aka thee best show of the 90s), a reference was made to \"Himalayan whistle kids,\" & that's what I thought of when I saw Little Nepal's yelp listing. The end, nothing to elaborate on, I just thought of that episode (my thoughts are shallow & nonsensical.) \n\nSo, we shared the $48 dinner for two which included:\n-- momos: we chose vegetarian. kind of like potstickers, very, very bland.\n-- samosas: two gigantic fried purses filled with spices, potatoes, & peas. so delicious, as most fried foods tend to be. went well with all three sauces provided.\n-- cubes of bbq chicken: (neither of us wanted lamb or pork.) \n-- alu tama bodi: a curry of black eyed peas, bamboo shoots, & potato. not spicy or flavorful. I was excited to try because I love those ingredients, but turned out to be quite boring\n-- sizzling polenko kukhura: boneless chicken breast marinated in ginger, garlic, yogurt: beautiful orange/red color from spices, incredibly moist, but again flavor was lacking in *something*, although the orange dipping sauce gave it a much-needed kick\n-- beautiful platter of rice (plain), naan (too chewy, similar taste as a flour tortilla, we joked it was \"naan good\"...get it? non-good?!), lentils, sauces, & stewed veggies (did not look appetizing) \n\nSimilar to indian food I've had, but with much less heat. Super busy, so they must be doing something right...unfortunately, my tastebuds just didn't see the big deal.", "author": "Fancypants X."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-16", "description": "I loved the food there and the staff was friendly.\n\nNot a fan of the chicken momos, but the veggie ones were great because they were flavorful.\n\nThe lamb samosas were by far the best thing I had there, and tying with that was a lamb dish (can't remember the name) which I ordered a la carte (came with rice and naan).", "author": "Ellie M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-30", "description": "If you're looking to try something new, something different with a quiet ambiance and friendly people, try Himalayan and Napalese food called Little Nepal. It was my first time and I was impressed with the food quality and price. We didn't wait to get served either which is always a good thing. It's a nice neighbourhood on Bernal Heights- check it out !", "author": "DJ Nocturna R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-08", "description": "This is an authentic Nepalese restaurant not and Indian restaurant. We had the lamb curry which is done in traditional Nepalese style and it was very good. The menu choices are very limited but I have to admit that while that is the case in terms of selection the quality is good. Service is ok as it is not an upscale restaurant servers are prompt and courteous. I will visit them again.", "author": "A.M. E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-28", "description": "The meals were tasty and well presented. Service was fast. The tandoori lamb could have been more tender, but the chicken tandoori was very good!\n\nIt was nice and busy and they were welcoming us even with a little child.", "author": "Jaapjan V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-06", "description": "I thought this place was yummy.  Well worth the trip to Bernal Heights.  The owner is delightful and everyone who works there is trying to make your experience pleasant.  I recommend!", "author": "Elizabeth F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-05", "description": "What a lovely looking restaurant! I had no idea this gem was in my neighborhood. Great selection of vegetarian items and the chai was to die for. Great service too. Very relaxing place to stop by and eat.", "author": "Dee K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-15", "description": "Wikipedia IS my best friend.\n\nYou see, Wikipedia has saved me from some potentially embarrassing moments. \n\nColleague: \"Cherylynn, what did you think about the Dalai Lama controversy?\"\nMe *thinking*: \"The f*ck?...Dolly, the (cloned) sheep?\" *scurries to the restroom*\nMe: \"Ahh yes, the spiritual leader of Tibet...\" *phew*\n\nClearly, politics are not my forte and neither is geography. I stumbled upon Little Nepal (Himalayan/Nepalese cuisine) on Yelp and immediately thought it was Eskimo food because you know, Eskimos are from the Himalayan Mountains. I'm not even going to try to explain my logic here. :/\n\nWith a quick tap to Wikipedia, I found out that Himalayan/Nepalese cuisine is similar to Indian cuisine with Chinese influences. Lentils, curries, and tandoori are some common dishes. Ok, interesting enough to give it a shot. \n\nTucked along the cute Bernal Heights neighborhood, Little Nepal's contemporary and festive vibe with crisp white linens, shiny wooden furnishings, bright orange walls and colorful mini portrait quilts was a pleasant surprise. With seating for about 35 people, this cute restaurant was nice and cozy.\n\nWe started our Saturday night dinner with the Himalayan Momo ($6.85). http://www.yelp.com/biz_photos/Kx1WExNj5ogaFe0cyg9L6A?select=Hcc-htAdOZs_JFtxw7PWCw The potsticker-like dumplings were steamed and served with chili, sesame and tomato chutney. The skin was a bit doughier than expected (I'm trying to stay away from refined carbs) so I just ate the pork filling which was packed with robust seasonings. I loved the accompanying aioli-like chutney which gave a fiery tang. Next, came the Tofu Tarkari ($10.35), a tofu and green been curry dish which was a lot SMALLER than anticipated. http://www.yelp.com/biz_photos/Kx1WExNj5ogaFe0cyg9L6A?select=nouAWbMVfKn2dEB3Uj7CVw The mini silver bowl had only three fried tofu pieces and green beans swimming in a fragrant light tomato cream sauce with prominent garlic and ginger spices. The silkiness and tantalizing flavors of the sauce was purely addicting and a perfect accompaniment to the basmati rice and soft naan which I sneaked several bites of (SHHHHH!). As the aroma of sizzling onions permeated in the air, I knew our Poleko Kukhura (Chicken Tandoori -$13) dish was arriving. http://www.yelp.com/biz_photos/Kx1WExNj5ogaFe0cyg9L6A?select=SbjYhwXJ-k7lAWOJLDOq0A Yelpers weren't lying when they say this is the \"best chicken tandoori\" they've had. Marinated in yogurt and spices and then grilled, the chicken breasts were succulently moist (from the dairy in the yogurt) with aromatic nuances of garlic and ginger. I could have scarfed down the whole platter by myself (SHHHHH! x2). \n\nService was friendly and attentive but rushed. Towards the end of dinner, our waitress asked us twice within a 2 minute span if we were finished when we still had food on our plates. My friends and I are fast eaters and I can understand if we were taking our leisurely time and if they were closing but that wasn't the case. \n\nI heart Wikipedia. It has allowed me to discover and savor unknown cuisines not to mention save me from looking like an Asian Jessica Simpson because you know, Dalia IS Dolly as Tuna IS Chicken (of the Sea)...", "author": "Cherylynn N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-29", "description": "My boyfriend and I were in the mood to try something new so we decided on Himalayan food! We went on a Wednesday night, so it wasn't busy (two other parties in the restaurant). Service was a bit slow at first, and they forgot to bring our beer until we waved someone over. They were very apologetic about it though, so that made up for it.\n\nWe ordered a Kukhura Ra Palak combo and a Poleko Kukhura combo. Both were very good, the chicken was surprisingly moist and juicy. To be honest though, it tasted very similar to Indian food to me, just way more expensive. We finished everything and were both really full.\n\nOverall, very good quality food, though pretty pricey for what it is and how much you get, but definitely a good spot to try. I'll be back in the future, just not any time soon.", "author": "Sarah K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-08", "description": "The world needs to know. This is amazing. I would eat it continuously until I died if I could.", "author": "Racheal S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-13", "description": "I love the food here and use to order the set meals all the time for delivery - everything was always delicious.  I recently moved from the mission to west portal. And although the website says they deliver within 4 miles of their location - i was told they don't deliver to my area (3.9 miles away according to google maps).  Please Please tell me you have changed your mind!!!! I would love to order take out from you again!", "author": "Angelito R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-08", "description": "Very good food!  My experience with Indian food is very minimal, however this place has a Great Palak Paneer.... The flavors are very rich and the plates are sized to share.   I had the Himalayan Momo appetizer... Thumbs Up!\nThe Poleko Khasi was also very tasty! \nIf you're a beer drinker, order yourself a large Taj Mahal, you won't be disappointed.", "author": "Jaime P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-22", "description": "I, normally, do not write reviews unless the business in question has left a lasting impression on me. \n\nI pass Little Nepal weekly during my visits to Bernal Heights Park. It was only recently that I decided to give it a try. Going there for dinner was probably one of the best decisions I've made in a while. \n\nThe service was exceptional. During my group's wait for a table, the host was being extremely hospitable. Actually, every one there was very welcoming. I, honestly, felt as if I was visiting an dear aunt and uncle's home! \n\nThe food was amazing. I had the lamb curry. They did a great job at hiding the gamey taste of lamb. The lamb was also tender. I tried other dishes that my company ordered. Nothing on the table was too salty, which I sometimes find to be the problem for other curry places. Try the garlic naan as well! It reminded me of garlic bread.\n\nAfter one visit, I'd say Little Nepal has become one of my top favorite restaurants. I love finding small restaurants that often get overlooked and discovering that they are hidden gems.", "author": "Donna L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-13", "description": "So delicious! Cute little casual neighborhood restaurant with relaxing atmosphere. Always friendly, attentive staff. The food is always just right--not salty or greasy.", "author": "Sasha P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-22", "description": "My experience at Little Nepal was something to remember, the food was excellent, and the service was very respectable. We ordered the Lamb choila, chicken curry, garlic nan, and a small dessert side of rice pudding. The lamb choila was well prepared, bbqed with succulent flavor oozing out of each bite. A unique flavor with ever bite taken. The chicken curry was smooth had the greatest hint of coconut not too much, not too little, but just right. The Nan bread was excellent, a wonderful aroma from the bread and the hint of garlic smothered on it made every bite that much more enjoyable. For the dessert we had the rice pudding which was fantastic, i can't say more about there rice pudding it was served on a small plate perfectly sized for after a good dinner. That amazing flavor that i keep running back to because its that good. As for the service our waiter Dilip, checked up on us periodically to make sure everything was doing fine and that we were enjoying our food. The background music was set to a perfect volume to ensure quiet and peaceful conversation. All in all my experience at Little Nepal was something to remember, and ill be back soon to enjoy some more of that darn rice pudding.", "author": "Anwar H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-05", "description": "We had a wonderful evening and meal at Little Nepal last night!  The food was delicious and very reasonably priced compared to most restaurants on Cortland.  The servers and managers were exceptionally friendly and helpful.  Can't wait to return!", "author": "Emily K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-16", "description": "I'm a regular here and I love that they know my order right when I walk in. I still look at the menu for show, but always get the same thing: Kukhurako Ledo a la carte, extra rice, extra naan. \n\nKukhurako Ledo is a chicken dish in a creamy sauce that is to die for, rich and savory and spiced without being spicy. There is a spicy chutney sauce that comes with the combo that a lot of people I've taken here love, but I'm not a fan of spicy, so I don't go for it. Indian food is usually too potent for me, but I love this Nepalese place because it's like Indian food without the overwhelming spices. \n\nThe atmosphere is subdued with clean and modern decoration, while there's traditional music playing and pictures of the Himalayas on the walls. The staff are always courteous and are usually waiting, scanning the room to see who needs help, rather than running around and stressed.", "author": "Jessie N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-07", "description": "We've been here so many times, I'm surprised I haven't written a review before now. Little Nepal is a comfortable, modern-looking neighborhood spot with what I believe is authentic Nepalese food. For appetizers, we enjoy the Mismas Pakauda (deep fried onion & spinach with green sauce - delicious), the samosas, and the momo (Nepalese dumplings). For entrees, the tandoori dishes are all good, as is the Khasiko Masio Masu (a delicious combination of minced lamb and green peas), Kukhurako Ledo (in the same vein as Indian chicken masala). It's always nice to have a glass of house-made mango juice to go with.", "author": "David K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-09-30", "description": "Before we left for San Francisco from the hotel, we made a route plan to follow and since Nick didnt had Nepali food before. I thought i would surprise him with our traditional foods. \n\nWe had so much trouble getting to the location the GPS was screwing up. After we reached to the location it was full :) we waited for 10 mins.\n\nWe started with appetizers and then the final meals. We ordered Lamb Choila, Chicken Momo and Pakuda and then Bhanta Curry and Palak Panner for the meal.\n\nI am anxious how would the food taste and since it was first timer for Nick. I hope it tasted great and it was great.\n\nThe CHoila was awesome, Nick said, it was the best Lamp Choila he had. \n\nMomo, it was always my favorite and i was super excited when Nick Loved it too!!!\n\nPakuda, i was deep fried and it tasted delicious.\n\nWe already ate too much, but our mail meal was coming on. I tasted palak panner from other places but the difference here was it was not as heavy as other places. It was perfect, not over spiced. The Bhanta or Egg plant was simply best. It tasted good. \n\nAfter he got off to restaurant, we thought, well all this trouble with GPS, it made a worth, we were glad we picked this restaurant.\n\nCheers :)", "author": "Ashish P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-05", "description": "Nice place.  First of all, they're have an audio rotation of mild chanting and some Nepalese music.  It's pretty darn calming.  The staff is very friendly, but are not fully versed in English (if you need a fuller description of your meal).\n\nI only ordered a couple of appetizers for myself.  The Himalayan Momo vegetable dumplings were good. It comes with a chili chutney that had a nice kick to it.  I also ordered Sabjiko Jhol (lentil soup) which was awesome.  Just a hearty tasty soup.\n\nI'll come again soon and order an entree.", "author": "Jeff H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-07", "description": "Really fantastic food, service and great value. Hole in the wall vibe that is not crowded. Highly recommended.", "author": "Olin H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-02", "description": "I always love coming to Little Nepal! The staff there are as friendly as they get; always warm, friendly and accommodating. Of all my visits, I haven't had one bad experience, with the food tasting delicious with so much flavor and Nepalese goodness.\n\nTheir chicken and lamb sizzling tandoori is excellent served on a sizzling plate (go figure). Are you a big fan of Butter Chicken (served Indian style)? Little Nepal has something similar called Kukhurako Ledo  which is boneless chicken from clay oven (Tandoori) cooked in light cream, cashew nut, fresh tomato sauce, garlic, ginger and spices--tastes excellent with Naan!\n\nAnd for those that can't make up their mind, they also have a selection of set meals for parties of 2 to 6 all within reasonable value. The meals come packed with plenty of food to eat from and a meal of 2 can easily feed 3 people in case you have an odd one out.\n\nYou can always count on Little Nepal for a good meal in, or out (with free delivery within a 4 mile radius!)", "author": "Andrew S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-12-24", "description": "I have an iron stomach and something my friend and I ate did NOT sit well with us. Mint tea was also a ripoff at $2.99 for a bag of Stash in a small coffee cup that wasn't refilled.\n\nWe are regular spicy and Indian-esque food eaters. No idea what happened.", "author": "Liz K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-23", "description": "I have been meaning to try Little Nepal since moving to San Francisco 6+ years ago.  I finally made it last night and it was worth the wait.  I sure wish I had discovered this spot sooner.  The interior was cozy and comfortable with sleek wooden benches.  The servers were genuinely nice and helpful.  \n\nMy girlfriend and I both ordered entree combos which came with Naan, Lentil soup, and a small curry.   She ordered the Kasha Ra Tulsi (Lamb with basil, etc) and I the Channa Sagg (vegetarian, chickpeas and spinach).  Both of our meals were delicious.  I was amazed at how well done the lentil soup was.  Something that initially seemed to be a throw in for the combo platter turned out to be one of the best lentil soups I have ever had.  \n\nThe food was similar to the more common Northern Indian food but the spice blend was slightly different.  Either way we found our meals to be extremely flavorful and delicious.  I left feeling warm from the inside out on a chilly San Francisco evening.", "author": "Jason C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-11-09", "description": "Went back and also tried:\nMachhako Mitho Tarkari : Boneless Atlantic Salmon cooked with fresh tomato sauce,garlic,ginger and spices.\nBhanta Tarkari: Peeled eggplant cooked with fresh tomato, garlic, ginger and spices\n\nBoth were awesome!  The Poleko Kukhura (Chicken Tandoori) is still the must-have dish for this place.  Again, it's the best I've ever had!", "author": "Michele S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-06-22", "description": "Staff is still attentive and friendly, the food was not good. I wish I could say unmemorable, but I will remember.\n\nThis place feel like it is a small mid-west version, (apologies to those who live in the midwest and and actually have yummy places to go), of an ethnic restaurant that has no competition and whose cook has no point of reference for what a dish should be.\n\nTandoori Chicken was lifeless, with little seasoning, even salt wouldn't bring out enough flavor to make it middle of the road. Naan again was lacing anything of flavor and was covered with butter or margarin. Tasted like unsalted pizza dough and no evidence of being in a real Tandoori oven, no charring, no flavor. Rice texture reminded me of what happens when you microwave left overs. Chai Tea tasted more like warm brown powered milk with very little tea.\n\nI really hate giving Little Nepal 1 star. It's in my hood and I love my hood and support most of the businesses on Cortland. I'll buy here before I will buy in another neighborhood, even if another store is more convenient. My hood is what it is because of the businesses that thrive here.\n\nLittle Nepal might be a great place for some, but not for me.", "author": "Steve S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-06", "description": "The menu is not huge, but the food is delicious and authentic.  The staff and service are stellar.  It's located in a cute little area of Bernal Heights, and there is never a long wait!", "author": "Liz A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-19", "description": "Decent spot for Indian food (did not order any of the Nepalese food, so I cannot speak to that). I order chicken vindaloo everywhere that I can in search of the perfect dish and the one here is definitely good. Not the best but absolutely acceptable and does not disappoint. Relatively good value - meals come with rice but are a little small when it comes to the actual dish.", "author": "Emily K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-31", "description": "Nice atmosphere and good service. Plenty of food ala Carte. I had the sizzling Tandoori chicken and my wife had lamb. The owner spoke with us a bit, worried over our food, and was charming. Great intro to Nepalese food.", "author": "David H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-06-01", "description": "Lentil soup was delicious (even if it just was a small bowl), but the tandoori chicken and spinach/garbanzo dish were pretty bland.  Also, the portions were quite small for the price (adding plain naan and white rice does not justify increasing the price of these dishes).  I might go back to try other dishes, but the first impression was not memorable.", "author": "Janelle F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-29", "description": "solid food in bernal heights, seating can be tight, but the food is pretty solid. can have a wait during peak times, but you can make a reservation.", "author": "Long C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-08", "description": "This place is tucked away and hidden from the city... or at least it was to me! I don't venture into the Bernal Heights area much... but maybe I should after this place! Never had food from Nepal but sure glad I finally did! A lot of the food reminded me of Indian food (or at least all the curries did). I got the set meal for 2 and shared it with a friend. Got the pork momo's and it reminded me of Chinese dumplings. This was probably the most forgettable item of the night (probably because I eat dumplings all the time, so I really didn't care too much for it). It was moist and flavorful though! Next was the lamb samosa which was delicious! I usually skip samosa's because they're usually really dry and the seasoning seems to be off. However, Little Nepal is a game changer and I definitely hold other samosa's to their standards! Moist, seasoned well, and it was a pretty big looking samosa! Next was the chicken chhoila. My friend and I had no idea what this dish was and thought it was the chicken tandoori look alike item (it looks like it)! Had a nice flavor and the chicken meat was nice and moist. The entree was the poleko kukhura (which is very similar to chicken tandoori) but it was definitely as other reviewers mentioned... the best tandoori I've ever had! Seasoned perfectly and the meat was soooo moist! This was probably the highlight of the meal. Finally, the vegetable curry that came with the meal was the alu tama bodi, which reminded me of other vegetable curries... so it didn't stand out too much to me but it was good. The meal also comes with a rice and some other curries on a platter. Overall, the meal was good. I got kind of overwhelmed with all the different curries that kept coming... eventually some of them started tasting the same. Place is clean and my cup of water was constantly filled. The only thing I wish they did differently was that they told you what they put down on your table... my friend and I got confused on two of the dishes since they were both chicken and neither of us knew what was what! If you're looking to try food from Nepal, this is a good place to start!", "author": "Johnson S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-16", "description": "I've only managed to get here once but I'm eager to return!\n\nMomo - potstickers! in curry sauce! so good!\n\nWe got Kasha Ra Tulsi, and it was delicious. Tasty lamb, tasty basil, tasty curry.\nAlso the chicken tikka masala equivalent (Kukhurako Ledo) and it was also amazing.\n\nThere were also tons of other dishes I wanted to try so this is a place where I can't just order the same thing every time, no matter how much I want to...\n\nThe place also just looked cool, nice decor.\n\nThe combos were a nice touch, comes with rice, naan, and lentil soup. So delicious. I just wish there was more buttery naan. Definitely going back!", "author": "Christine H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-23", "description": "Quite delicious garlic naan. The tandoori chicken is quite good as well. \n\nThe service can be a little slow though. Sometimes you need to wait 30 min to get someone's attention which sucks. Despite the poor service I'm still giving it a 5 star though for delicious food. \n\nPlus they deliver which makes them even better. :)", "author": "Hello G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-03-28", "description": "I had the Kukhurako Ledo (chicken) combo, which came with stewed veggies and lentils, and I subbed in garlic naan. The chicken was pretty good, the sides were okay. Fancy metal dinnerware, friendly service...it's just a bit spendy for what you get ($20 for my meal, before tip).", "author": "Maximillian M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-22", "description": "Want dinner served to you by an ex-Sherpa from Everest?  This little tucked away place in Bernal Heights was a fateful stumble-upon for me and a friend - the food was totally delightful: light, crispy & perfectly seasoned lamb samosa, dense and flavourful pork momo, and an airy naan accompanying lentils, veggies and a tikka-masala type chicken that bested any Indian food I have ever had by being lighter and more fragrant.  I don't know what I expected, but this gem blew me away.  Will definitely be back for the service AND the food!", "author": "Tricia L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-24", "description": "The is my first time eating at Little Nepal. The size of the restaurant is quite small but the ambiance is great. I loved the design of the restaurant. \n\nAs for the food, I loved the food. I ate with a friend and we ordered a lot for two people. First we ordered vegetarian samosa, loved it. Secondly, we order the chicken with spinach (delicious). The chicken was so moist and tender. The flavors of the spice were working harmoniously. Thirdly, we order the salmon curry, which was filled with favor. Lastly, we order garlic naan to soak up the curry. The naan was perfectly made. \n\nWe both left the restaurant happy.", "author": "Christopher W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-09-06", "description": "I called to try to order delivery.  While it clearly says on their website that they deliver within a 5 mile radius, when I called and told them my address, the woman put me on hold saying \"I have to check, because we only deliver up to 4 miles away.\"  While I'm on hold, I quickly search and find that it is 3.8 miles from my house, at which point a man gets on and asks whether there is parking on my block.  I assured him that it isn't a busy block, and people put flashers on for deliveries all the time, but he just said oh sorry we can't deliver there tonight. \n\nIf you don't want to deliver to 3.8 miles away, don't state that you deliver up to 4 miles away and put on your website that you have a 5-mile delivery radius. \n\nDisappointing!", "author": "Kara M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-02", "description": "Charming service. Delicious food.", "author": "Mark S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-15", "description": "The first time my family and I tried Nepalese cuisine and it was scrumptious! Little Nepal is a great find that we enjoyed very much. We had the Himalayan Momo - which is like a potsticker but with a nice spicy sauce, Kukhura Jhol - light tomato based a little touch of lentil, Kukhura Ledo - I can just ask for the Ledo soup with butter naan and my tummy would be delighted and Tandoori mixed - chicken/salmon was perfectly cook but the lamb was a little well done for my taste. We tried the Himalayan tea which was creamy and tasty! The mango shake was also excellent. The service was excellent and what made it extra sweet was the owner gave us mango lassi and Himalayan tea to go that is on the house! We definitely enjoyed the experience and can't wait to come back!", "author": "Kay D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-10", "description": "Big fan of this spot. Got the 2 person tasting and it was a lot of food! Never had Nepalese food before would say it's like a mild Indian food? Love all the different sauces and different sides, big fan!", "author": "christopher h."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-08-19", "description": "This place was so disappointing. Ordered food to go, spent over $100 and couldn't even feed 4 people. The portions are a 1/3 or less of what they serve in the restaurant, a total joke when you are spending a decent chunk of change. On top of it, i got sick and threw up. The dishes were overdone with tomato sauce and hardly any veggies or meat. What a shame, I was looking for a great local place. \n\nNot to mention that they missed one of the plates we ordered  so after calling to find out what the hell happened, they stated that they serve less food to go and the only reimbursement they would offer for the missing dish is a discount off our NEXT order...what a freaking joke, I will NEVER be going back there. I rarely write reviews on yelp but I feel its only fair to warn others before they spend their hard earned $$. DO NOT GO HERE!", "author": "Rose M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-12-04", "description": "I'm seriously going back and forth on this review. I guess i was hyping myself on this restaurant because I was expecting more. The lamb samosas were good and fresh but not, to the point where they made me took notice. We had the tandoori Alaskan fish ( which I'm sure is used in all traditional Nepalese food) and that was good too. The sides, were amazing though but also didn't stand out. I will have to try this restaurant again and order something else, because I'm sure it'll stand up to it's 4 star reputation. \n\nAt least you don't have to worry about the dinner rush on a Friday night. Plenty of seating.  \n\nInteresting fact of the night: Their mango juice is so thick that you can stand a straw  straight up and it won't fall to the side.", "author": "Roth E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-31", "description": "Which was more outstanding, the food or the service? \n\nImpossible to say. Prim, the owner/cook (?) gave us the most genuine and caring service. There was a slight mix-up in the order, and they were so apologetic. Prim came out and hand-delivered the replacement dish, plus extra naan.\n\nAnd the food. \n\nWe started with the momos - much like dumplings, with an awesome spicy red sauce.\nMy friend's saag chicken was mouth-watering - so tender! I wanted to steal it all.\nI got the Saagko Tarkari, a filling veggie soup with steamed mustard greens.\nMy other friend chose the Kukhura Pakuwa (chicken in an addicting tomato/onion/ginger sauce) was also very good.\nThe naan was good, though not the very best.\n\nThe owner then brought us complimentary gulab jamun dessert. I was stuffed so couldn't eat much of it.\n\nScrumptious. Cozy. I'll be back, and often.\n\np.s. This place was the one that finally got me to do a Yelp review.", "author": "Dana K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-05", "description": "Healthy and Spiritual Eating\n\nI eat some kinds of meat, but I dine with a vegetarian. Finding a restaurant that we can both get excited about can be a challenge. Tucked away at the East end of Cortland Street in Bernal, Little Nepal belongs to that rare breed, and that's even without having ordered anything with meat on our last visit. \n\nFor an appetizer we had the Mismas pakauda... enough to feed four.  I ordered the Saagko Tarkari (mustard green curry) combo and my partner the Tofu Tarkari. The vegetable curry that it is included with the combo dinner is quite delightfully spicy. The two main-dish curries were a nice contrast and made for a very satisfying meal. The Saago made me feel very healthy. It was on the salty side, but not overly so. The Tofu was fluffy and the bright orange sauce just rich enough to be perfectly delightful but not indulgent. \n\nOverall the meal was quite filling without resulting in post-meal fatigue. The price was very reasonable, and combined with the quality of the food makes for a rating of excellent in the value category. The service was flawless, and the ambience is peaceful and relaxing.", "author": "David S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-14", "description": "What a cute little restaurant on a cute little street! My friend and I spent a nice evening strolling around Bernal Heights and came to this restaurant at the end of the line. We couldn't understand anything on the menu but the staff was super friendly and helped us make our decision :)\n\n==Food==\nTasty, and pretty big portions! We shared an appetizer and a 'combination' which comes with the main dish + rice, naan, and 2 little soups. That was more than enough for two girls!\n\n-Mismas pakauda - Yum! They're like Nepalese-style onion rings! Comes with a sweet and a minty sauce. Pretty large portion.\n-Poleko Kukhura - Really fancy-sounding name for Tandoori chicken. It was almost like fajitas with the onions and bell peppers on the sizzling black pan thingy. The chicken was nice and tender and went well with the tomato chutney sauce.\n\n==Service==\nSuper duper nice! I asked one of the waiters (maybe he's the manager?) for chopsticks and he was reallyy apologetic when he said they didn't have any. And the other waiter guy taking our order was really patient as we butchered the names of the dishes and asked for advice.\n\n==Ambience==\nI would say almost calming with nice color tones and decorations. Lots of people on dates it seemed!\n\n\nA nice spot for dinner, I would come again! :)", "author": "Suejung S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-22", "description": "This was a Saturday night destination with a pretty large group of friends (16 of us I think?). We did not call ahead because we had actually planned for sushi, but while we waited for our table we strolled down the street and popped in here; VERY accomodating!\n\nHow many small restaurants will go out of their way to accomodate such a large group? They seated us in the larges open area they had, and as other customers finished their meals, they acutally moved tables to add to our group to assure we were comfortable. That's really impressive.\n\nWe were pevenly distributed with about half being vegetarian and the other half being healthy, Bacon loving, meat eating, carnivores (If our group is ever stranded on a desert isle, we'll eat the vegetarians first!). So, with a breakdown like this, we ordered pretty close to the entire menu. I can't tell you everything we had, but I can tell you EVERYTHING was wonderful; honestly, not a single bad dish.\n\n- One dish which was reordered over and over because everyone loved it: Tofu Takori (yup, I was surprised too, but WOW... you won't want to waste a drop of the sauce, so get extra Naan).\n\nIf you're in the mood for Nepalese, look no further, this is where you want to go with a fun group.", "author": "Christopher J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-11", "description": "Momos and Choila were delish! Finally a Nepali restaurant that serves authentic Nepali food!", "author": "Kanchan C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-01", "description": "Went for the Nepal earthquake fundraiser, so this was not a typical experience. There was a huge crowd of people and a certain amount of chaos and confusion. But it was clear how much the people who work here are loved by this neighborhood, and we were seated and served remarkably quickly, considering. The service is fast and charming; the food is tasty; the Nepal brands of beer are definitely worth trying. I'll be back to try the regular menu soon.", "author": "Valerie T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-08-23", "description": "We went to this place on a Sunday night with some friends.  Last time I was here the food tasted amazing, this time not quite as great.\n\nThe samosa was huge, hard and absolutely not crispy like it should be, the filling wasn't stellar either.  The lamb curry was very tomato based, not a ton of flavor and the lamb was tough and chewy, pretty much inedible.  The chicken dish was good, the chicken was tender the sauce was well balanced.  The nan was a bit oily and chewy as well.  \n\nI don't think I'll be coming back, there are plenty of delicious  places that don't require a far drive.", "author": "Inga W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-03-05", "description": "Wow - An Amazing Feast for everyone! \n\nIts a small, intimate little place but that is what makes it all the much more. \nStaff is always hustling about - either continually refreshing your water, or clearing your table for more food you'll get the most attentive service here! \n\nFood can come in smaller plates; should wish to try the vast offers of Indian foods or you can just get a large platter of various spreads, rice, spicy meats, and veggies. \nPeople at my table could not rave enough about the juicy spiced lamb. \n\nEverything came out steaming hot - so if you want your pores to smell like Indian spice then just lean right in! Yum! \n\nLittle Tip: There also happens to be alot of cute little shops nearby, so if your waiting for a table you can always browse the vintage stores.", "author": "Heather H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-03-19", "description": "Mild is not possible if you order  the combo, which was tasty regardless. We also had the veg chow chow, which was about 50%'onion, 50% other veg. Service was a bit too casual. There is better Nepali food out there.", "author": "Mike S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-02-11", "description": "Wow, it's been a long time since my last review. This time my husband and I went in person rather than get delivery. It's such a cute little restaurant. We went early and after 30 or so minutes, it filled up pretty quick. The service was excellent. It seemed every time my water was 1/2 full, they filled it up.\n\nI had the boneless chicken with tomato sauce and garlic (third one down on the menu) and had it with their combination. The chicken was very tasty. I liked how there was no cream as well. The naan was butter filled. If you don't like butter, make sure to ask for it without. My husband had one of their vegetarian curries with bamboo shoots and potatoes - and it was so delicious. Sorry I don't remember any of the names of the dishes but it seems like the waitresses there can steer you in the right direction if needed.\n\nThe food here is just soo much lighter than eating at a traditional Indian restaurant. I just wish it were a little closer to where I live.", "author": "Natalie S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-28", "description": "So here goes my first ever Yelp review :) :\nMy room-mate and I came across this restaurant while looking for some good Indian food on one hungry Saturday evening. We ordered two vegetarian combos. Don't remember their names now, but one was a potato-cauliflower curry and the other was an eggplant curry. Both the dishes were quite tasty. The spice level was just right, and the food was very flavory. The 'naan's were spectacular. They were very soft and fluffy and reminded me of the tasty street-side restaurants of Delhi, India. I haven't come across such 'naan's anywhere in the US till now.\nThe only downside about this place is that it's a little too expensive. I thought that the combo could've been priced at 10 dollars. 15 seemed to be a little too much. But that said, I will definitely order food from this place again.", "author": "Srivatsan S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-04-18", "description": "We've eaten both at the restaurant and had delivery.  We've always enjoyed the food. The food is like Indian food but not (I know, that was not a great description)... let's try: wonderful sauces full of flavor, but not as heavy, oily or creamy. \n\nTonight's meal was the best we've eaten from Little Nepal so far.  We always order the Lamb Chhoila (so, so, so good) and we try to order something we haven't yet had.  The lamb Chhoila never disappoints, melt in your mouth, busting with flavor cubes of lamb (in the future, I plan to order 2 lamb Chhoilas and a veg curry combo, and that will be plenty with leftovers to spare). Kukhurako Pakuwa was awesome too, chicken in a tomato sauce full of spices.  We ordered the chicken as a combo, so it comes with naan, rice, potato, lentils and a spicy sauce situation. And last but not least, Saagko Tarkari.  We both looked at it and said 'looks meh,' but it was delicious, Indian greens meet Southern greens.  \n\nFor two, the lamb Chholia, Kukhurako Pakuwa combo and the Saagko Tarkari  was more than enough.  We like leftovers.  I lied, I like the idea of leftovers and pretend to like them and my bf actually likes leftovers.\n\nThey quoted us 45 minutes for delivery, it was literally here in 15. AWESOME.  Thanks Little N!", "author": "Lani N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-03-10", "description": "What a pleasant little surprise!!\n\nAfter previewing some properties with a client/friend in South Bernal, we moseyed over to Cortlandt to grab a bite.  It was a toss up between this place and the Peruvian joint across the way but the exterior of Little Nepal was just too damn cute and sooooo inviting on this windy and cold evening, so in we went.\n\nWe grabbed a corner table with lovely bench style seating and cushions (reminded me of Switzerland) and a nice bottle of Taj Mahal to start things off.\n\nAlthough I didn't much care for the lamb choila appetizer (the flavors reminded me of a cross between Vietnamese barbecue and kitchen cleaner) and I couldn't quite figure out the \"puffed rice\" as it reminded me of uncooked rice that was run over by one of those big machines used to flatten asphalt during highway construction projects.\n\nHowever; the Kukhurako Ledo (sounds like a Nepalese rooster dish) was outstanding, along with the cooked Basmati and Naan.  Friend ordered the Chhayau Tarkari which for me was just okay.  I prefer how the Spaniards cook up their mushrooms with sherry instead.\n\nAlthough the place was pretty empty (it was only 6pm on a Tuesday and this was my lunch) they did a brisk take out/delivery business and by the time we left, it was starting to fill up.\n\nAll in all, I thoroughly enjoyed this cozy little place, the cute little smiling waitress, my dining experience and I would DEFINITELY go back.  \n\nSupport your local Buddhist operated joints.", "author": "Anthony D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-10", "description": "We went for dinner on a Sunday.  We got the chicken momos, a chicken curry and tandoori chicken.  I didn't notice a difference between Nepali and Indian food, aside from the momos, so I'll try something else next time.  The service was average.", "author": "Seong P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-06-08", "description": "The atmoshpere is homey and the service staff is super friendly.  It just feels good to be there, so you'll find yourself lingering.\n\nThe food, OMG the food!  At the time when I dined here with a friend I wasn't eating any animal products.  That didn't take anything away from this experience.  I had the sabjiko jhol and sabjiko tarkari combo.  The flavors popped!  I was impressed.  I wish I had a Little Nepal closer to my house.", "author": "Hester B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-15", "description": "As a Nepali , I was always let down by the fact that when I go to Nepali restaurant there are couple Nepali cuisine and rest are Indian . I understand the business perspective but I wished they had a little but more food ... But little Nepal had pretty surprisingly amount of typical Nepali food !! Liked the fact that I can take my friends who are  not Nepalese to give them at least a hint  of Nepalese cuisine. The dumplings and lamb choyla were my best choices. Keep up with the  good food. Oh did I mention, food was yummy like in home ..", "author": "Pratima D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-08", "description": "Enjoyed a wonderful meal with my friends.  Our server was attentive and accommodating in having my friends share.  We enjoyed  the Chhoilla and the Chicken Momo.  The Momo wrapper was a bit chewy and thick and reminded me of a potsticker with a 'weight' problem.  The sauce that came with it was perfect for that nice borderline spicy and  hot. \n\nWe shared combo orders and enjoyed the king size tiger prawns, khasi ra tulsi lamb,  mustard greens, etc.   Delicately seasoned and the blend of spices were easy on the senses.\n\nWe had a very nice dinner experience and I definitely would return.", "author": "Amritasri R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-05-23", "description": "My boyfriend and I went to this restaurant on a whim last weekend.  This is the first time we really explored the Bernal Heights restaurant scene and we found Cortland to be a lovely little street boasting some really nice coffee, pizza, Peruvian, and Nepalese food.  We were very pleased that we lived so close and decided to try out the Nepalese restaurant in light of its excellent reviews and its general rarity.  \n\nWe came into the restaurant and were seated at a table immediately.  We came in on a Saturday around 5:30 pm and the restaurant was pretty much empty.  We sat their for about 10-15 minutes before the waitress accidentally spilled my boyfriend's water glass into his lap.  It happens, I know, but still not fun.  We were moved to another table.\n\nAt this point we decided to order:\n\nKukhurako Ledo Combination- which included rice, a dahl and vegetable curry and two pieces of nan for $17.99\n\nSaagko Tarkari A La Carte- which included two pieces of nan and rice for $11.99.\n\nTwo Chai Teas\n\nWhile waiting for our food we noted that the music that was playing in the restaurant was this sort of repetitive, solemn drumming and choral line which we found a tad bit annoying after a while.\n\nWe received are teas which were very nice.  Nice fresh, spicy flavor, not sweetened.\n\nThe Kukhurako Ledo Combination followed and we thought it was nice but not as outstanding as its price would demand.  The chicken was well cooked with a nice balance of flavors.  The portion was a bit small and the variety and complexity of the flavors could have been more outstanding.  The sides were very nice in particular the lentil side was quite good but again the portions were miniscule.  The nan and rice were disappointing.  The nan was flat, flavorless and chewy and the rice was incredibly watery.\n\nSaagko Tarkari A La Carte followed the chicken dish and we thought it was quite good.  Mustard greens were spicy and well cooked but again the price demanded it be more outstanding and unique than it actually was.  The rice and nan that came with the dish were the same disappointing, watery, flavorless, small portions that accompanied the chicken dish.\n\nOverall the main dishes were good.  The sides were very good and the nan and rice abysmal. The atmosphere was quiet with annoying repetitive music.  If the restaurant wants to charge what they do for their food the rice and the nan at the very least needs to be excellent and they need to be more generous with their portions (at least provide more and better cooked nan and rice with their dishes) or their dishes need to be more eye opening.", "author": "Liz M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-24", "description": "This place has very warm and friendly service with amazing food! I had never had Nepalese food before I ate here last weekend and I was blown away by how tasty everything was.  I highly recommend the Kukhurako Ledo which is boneless chicken from clay oven (Tandoori) cooked in light cream, cashew nut, fresh tomato sauce, garlic, ginger and spices--to die for! This meal came with naan, rice, lentils, and veggies.  The veggie momo were also yummy--reminded me of potstickers--and had a great spicy dipping sauce. I would highly recommend this place for a casual meal or date spot. Probably not good for large groups as it is a small restaurant, unless you make a reservation or come during non-rush hours.", "author": "Natalia K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-15", "description": "Everything was DELICIOUS! We got the Kukhurako Ledo and the sauce was to die for...you have to get this if you come here!!! Will definitely be a regular here.", "author": "Sofia M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-17", "description": "The Palak Paneer was incredible! Perfect spot for vegetarians and Nepalese/Indian food fans. Super fast service - just a little on the pricer side, but definitely worth it.", "author": "Natasha P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-12", "description": "how can I not give 5 star to a restaurant that offer me free mango lassi while waiting.\nservice is superior. \nfood is good.\nwaitress didn't know the menu very well though. wanted to order a lamb  curry dish and shrimp but was told that shrimp was cook it similar sauce so I didn't order. \nbut when I saw the table next to be ordered the jumbo shrimp and it came on a sizzling hot plate I wish I would have ordered it.\nso, maybe next time!", "author": "Rina C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-23", "description": "Nice food, great service... naans are very very fresh .. .momos are good. We ordered a combo of sizzling chicken, fish and lamb. Its awesome. I wish I could give service 7 stars :)", "author": "Astha S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-24", "description": "This is my go to nepali/indian restaraunt. After spending 2 months in Nepal, I know good dal baht when I taste it, and they hold it down pretty darn well here. \n\nThe set meals (tandoori chicken) always satisfy, and delivery is consistent. Try the special dahl, so tasty!\n\n Keep up the great work, dhanyabad!", "author": "Ben J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-09", "description": "I fell in love at first taste. First off, let me start by saying how great the service was. My friend and I were promptly seated and the waiter was so patient and nice to us during our entire meal, refilling our water and checking in on us. I got a curry dish that was one of the most creamy and delicious curry I've ever tasted. The rice was so chewy and the naan bread was so soft and hot. I truly love this place and can't wait to go back.", "author": "Bobzilla D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-03", "description": "Checked out Little Nepal yesterday night with the wife. Don't know exactly when but I had bookmarked it. Turns out I have good taste in bookmarking... And I'm modest. \n\nThe food was familiar as a riff on North Indian.  The Nepalese bent seemed to be a more mellow spice mix and a somewhat lighter fare with more tomato in place of lentils. I think I enjoyed it more than Indian food. \n\nWe started with the Himalayan momo - a chewy sort of dumplings very similar to Chinese potstickers. We opted for vegetarian and the filling was way better than any Chinese veggie dumpling.  They also came with a fantastic spicy sauce. Warning: it's hot.\n\nI had the tandori chicken as my main. It was again the best tandori I've had. The chicken was so moist and so full of flavor. Get this dish!", "author": "Ivan L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-29", "description": "Located on Cortland near the end of the main commercial stretch of Bernal Heights, Little Nepal is more of your typical neighborhood eatery (if you can consider Nepalese food typical!) rather than a destination restaurant.  But in  no way does that take away from the friendly service or the delicious, authentic courses served here.\n\nTouted as the first Nepalese restaurant in SF (are there others?), it appeared that it's family-run. The space is minimally decorated but warm and inviting.\n\nFor starters, had the Himalayan momos, which basically resembled potstickers but with much thicker and doughier skin.  The spicy chutney sauce that accompanies it gave the dish a nice kick and added some Indian/Nepalese twist.\n\nFor entrees, the Kukhurako Ledo (boneless chicken cubes in a light cream broth with cashew nut, tomato sauce, garlic, ginger and spices) was delicious, especially the sauce which I ended up smothering over my basmati rice.  The Poleko Kukhura (tandoori chicken) was also quite good  and served over grilled onions and peppers.\n\nThey have several types of Indian beer (Kingfisher, Taj Majal and Flying Horse), all of which have a light, crisp finish that pairs well with the spices and the curry.", "author": "F. P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-09", "description": "Love this little neighborhood gem.  Dined here for the first time last night and was pleasantly surprised on the very good service, food and atmosphere.  We had the tandoor combo which was delicious, and the paneer (hope I spelled that correctly).  It was plenty for two people and pretty reasonable priced.\n\nWe will definitely go again soon.", "author": "Gina C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-08", "description": "Great flavor.  I'm a vegetarian and the tofu tarkari dish I had was slammin!!  Everyone in my group enjoyed the food. I'll be coming back to eat here again.", "author": "Fatemah N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-01", "description": "I had the Khasiko Pakuwa (boneless lamb cooked with fresh tomato sauce, garlic, ginger and spices) that's really good. The naan was quite good too.\n\nOrdering A la Carte is your best bet, IMHO, since the extra stuff you get for the Combo isn't really worth it.", "author": "Paul L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-11", "description": "Pretty good Nepalese/Indian place. Service can (only occasionally) be slow - but even then the waiters have given me free appetizers / additional food for my troubles which gets this place +1 star in my books.\n\nGood tandoori options, and the curries are all tasty.", "author": "Scott H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-20", "description": "Really great value for the quality, friendly service, presentation, and atmosphere.  Highly recommend checking it out.", "author": "Julio L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-11-01", "description": "I love Himalayan food and was very excited to try this restaurant, but it not very good the curries are very different and they have strong smell from animal fat, overall nothing special.", "author": "Tala J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-09-18", "description": "So I should start off by saying that everyone--including my roommate who has already placed a review on here--was really happy with this place.  We were on our way to dancing and I was anxious to get there.  I suppose this could be a pretty good date spot but the crowd was a little too Bernal Heights for me--meaning it seemed as if we were the only single people in there.  Everyone else looked like married locals who came in regularly.  \n\nThe decorations are also a little bit on the bland side.  It really does have the feel of an accountant's office that has been dressed up with Nepalese knick-knacks. \n\nAs to the food, I didn't really like the minty samosas everyone raves about.  Maybe it is because mint just reminds me of toothpaste and that is not what you want to be reminded of while eating.\n\nAlso, the choila that this place is known for just didn't do it for me.  \n\nThe seasoning just felt super bland to me--except for this slightly sour taste I could not put my finger on.\n\nIt might have been just me. Everyone else seemed to really love the food and it was a topic of discussion for a while.  If I ever come back, I will definitely have to try the chicken instead like my date did.  \n\nIn my opinion the service was a touch slow too as well, but maybe it was just because I didn't enjoy the meal.", "author": "Nikki K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-30", "description": "Little Nepal is a great place for delivery.  Their radius is 5 miles!  Really, in this city?!  I can't get delivery from some restaurants within a mile of my apartment.  \n\nEveryone there is nice and their food is good.  The menu has a mix of spicy and not-spicy items.  Sometimes it's hard for me to figure out what I'm ordering, though I have to accept some of that blame.", "author": "Mike H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-09-26", "description": "One of the best meals I've had. Also some of the best service. We had the combination tandoori style, which came with sauces, veggies, lentils. Also a lamb curry that was just banging. \n\nBe ready for some spice, and get a beer to go with it. You won't be disappointed. I will be back for sure. What a wonderful little Cortland gem.", "author": "Carl S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-05-11", "description": "My husband and I recently moved, and we feel very fortunate to live within Little Nepal's delivery area! We'd never tried Nepalese food before, but based on various reviews, we tried it. The food is delicious! It us similar to Indian food, but some of the dishes use spices completely new to me, such as: \"Little Nepal Special Choila: Cubes of barbecued Chicken, Lamb or Pork marinated in olive oil, mixed with garlic, ginger. Served with puffed rice and soybean.\" They use a delicious and unique spice blend in this, and the lamb version is tender & juicy. \nThe Kukhurako Ledo is similar to chicken korma. It's creamy & wonderful & I've ordered it every time. \nTheir naan is the moist, and dark brown on the side that was on the tandoor. \nWe've lived here less than two weeks, & have ordered from them three times and look forward to trying more of the menu.", "author": "Amanda H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-09", "description": "Recommend the grilled salmon and the lamb. Great service, friendly staff, fairly priced. Great for locals!", "author": "Andrés M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-06-25", "description": "I used to come here all the time with a date and always ordered the same thing - kukurahko ledo or salmon, and tandoori chicken with garlic naan. The naan is different from most Indian naan's; it's slathered with butter and more delicate, as if it has been baked in foil rather than slapped to the wall of a clay oven. Loved the salmon, but the taandori was bone dry - not a problem if you have a creamy dish in which to slather it.\n\nA delicious culinary getaway within the Cortland district. Booth seating, cushy and intimate, noise level minimal.", "author": "Jaime Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-14", "description": "Had the set meal for two. Delicious! Very filling, could easily have fed 3-4.", "author": "Mandy H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-02", "description": "Went to Little Nepal for the first time this Saturday after reading good reviews on Yelp. We were not disappointed. Parking was difficult to get though street parking were available (8 mins for a quarter.. maybe this is normal for people living in SF but we are new to the city and thought it was outrageously expensive). The restaurant was small but reminded us of restaurants back in Nepal. Overall it was pretty clean considering they have been in business for a while (was the first Nepali restaurant in the city...that is what the owner claims anyway).\n\nWe had momo and chicken choela. Decent price and the serving size wan't bad either. Do note that they use horse-radish in choela. So if you are like me and do not like the smell/taste, ask them to not use it.\n\nWill definitely come here again.", "author": "Bibek B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-04", "description": "FANTASTIC! We had a amazing meal that was worth the trip from Seattle. Warm, inviting and very friendly. Just go and have a meal you will remember. We will be back as often as we can. Thanks to all and see you soon.", "author": "Allen M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-02", "description": "I may be easily impressed by Indian/Nepalese food, but I did really enjoy eating here. So far, my roommates and I have yet to find a place along Cortland that we didn't enjoy. This was the first such place, and it set the bar pretty high. We arrived to be informed that there was a 5-10 min wait, for which they were really apologetic and we thought was luxury compared to the usual SF wait time.\nThe food was delicious, spicy, and authentic feeling. Everything hit the spot perfectly and there was enough left over for later. The even brought us a rice pudding on the house as a way of apologizing for the wait (again 5-10 min is really not a problem.)\nI'd give them 5 stars if I could remember the food a little better, but I went there a while ago. I'll have to go back and confirm that everything was as delicious as in my memory.", "author": "Nik K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-08-20", "description": "We got the \"set meal\" for two - lots of great tasty (and spicy! - I was sweatin') foods like pork momo, vegetable samosa, lamb, lentil soup, sizzling chicken with naan & rice, plus rice pudding for dessert. Lots and lots of food - it just kept coming and we were like !! how were we going to eat all of this?  Needless to say, we had no room in our tummies for the rice pudding dessert, but I will be having that along with leftovers for dinner!  :)  Yeah!!\n\nThe service was very sweet and attentive.  This place is definitely a find & by the way Cortland Ave. is so cute!\n\n1/2 of the Set Meal for two+1 Taj Mahal beer+tip+tax = $36", "author": "Maile N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-05-16", "description": "A well-earned 4 stars. \n\nThis was my first Nepali experience. I was along for the ride, and have no idea what we ordered, but everything was tasty and delicious. \n\nNepali food is a little bit Indian meets a little bit Chinese-ish.\n\nThe standout dishes include: lamb tandoori, potsticker-ish things, and the mushroom curry. \n\nEverything washed down nicely with a large bottle of Taj Mahal.", "author": "Misha F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-06-08", "description": "Really rockin' delivery. Their version of CTM rocked my world. Their naan was different, but lovely. For delivery, this is the best of the best.", "author": "Andrew K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-20", "description": "Order delivery from here quite frequently, never had a bad dish. I really enjoy their veggie samosas & their sauces that accompany them, delicious combo. Kukhurako Ledo & Poleko Khasi are my fave entrees", "author": "Michon N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-04-08", "description": "Really good, cheap food. Could have had more flavor punch and pronounced taste and heat to the curries. Overall, pretty good.", "author": "Koshika S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-01-22", "description": "WHAT HAPPENED?  We used to LOVE this place!\n\n1.Undercooked \"Sizzling\" Tandori Chicken served with raw onions\n2. Sabiko Tarkari: bland, watery, supposed to be curry (?) -yuck!\n3. Gigantic portion of Naan tasted like thick, bad pizza crust.  \n4. Couldn't chew through the samosa \n\nSomething very bad is going on in the kitchen.  We were thoroughly disappointed.", "author": "Sarah W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-18", "description": "This is for one truly great dish Tofu Tarkari.  It's super soft tofu, green beans cooked in a creamy tomato sauce.  It comes with naan and basmati rice. OMG! So delicious.  I've had other things at this Bernal Heights restaurant, all delicious, but I usually order Tofu Tarkari.", "author": "Pat P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-31", "description": "Tucked away in Bernal Heights (which itself is a gem in the City), this place is fantastic on a cold summer day in SF watching the fog roll over the hills.  We shared the momos (imagine potstickers with an Indian flare served in a spicy chutney, tomato sauce...it's mos def spicy, so dip the momos in it first and try before lathering the sauce on) and the Kukhurako Ledo, much juicier Tandoori chicken and the cream is a little bit lighter, so I can just sit there all night, dipping my naan bread in this sauce.\n\nI will admit I was hesitant at first, but will definitely be coming back for more!", "author": "Ben T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-16", "description": "If you're going to read one review of this place, read this one only because I'm speaking for 3 people, two of which happen to be extremely satisfied Nepalese guys who miss their mothers' and sisters' cooking. This place serves authentic Nepalese food...period. I've read some reviews on this place and there are plenty that are way off base, the ones that say the food is bland and that they were expecting more flavor. It should be made clear to these reviewers that Indian and Nepalese food share similar ingredients but there is a difference. This is very good and certainly authentic Nepalese food. If it sounds like an Indian dish then it is one. If you come here, and you most definite should, I recommend getting the vegetarian combo to have a close authentic experience since in Nepal it's rare to have a meat dish on your thali but dal, veg and rice is plentiful. But if you must have meat, get the chicken chhoila (I was told this is an excellent version) and chicken or veg momos to start. The saagko tarkari (mustard greens) is spot on and so fresh tasting it brings back memories of preparing the leaves for cooking with my mother- and sister- in laws in Chitwan. We also had the Jhinge macchako tarkari (shrimp) though not a common dish, was well prepared and delicious. Service is friendly and relaxed. Don't expect to rush through your meal. This is a place to appreciate the care and attention the owners make towards creating meals worthy of being served in any Nepalese home.", "author": "Lovella K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-09", "description": "By far one of my favorite places in the Bernal corridor. Palek Paneer and potstickers are amazing. They bring food on a heavy hot skillet. The place itself is kind of sterile but the service is very good. A good date place", "author": "Sigorney S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-09-07", "description": "Quickly becoming my favourite dinner spot. Best naan in The City, cooked in clay oven. Try any dish, you will be satisfied.\n\nQuiet and intimate atmosphere which, for me, makes it nice to enjoy the good food and dinner companions.\n\nStaff is extremely pleasant and sincere. They deliver too!", "author": "alistair g."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-11-15", "description": "My friend really liked it, but I wasn't so impressed. We split a bunch of dishes between the 4 of us, waitress recommendations: Alu Tama Bodi \n(Potato, Black-eye Beans and Bamboo shoots), Chhayau Tarkari (mushrooms), Mismas Poleko Masu (Mixed Tandoori chicken, Atlantic Salmon and lamb marinated) & Poleko Jhinge Machha (Tandoori King Size Tiger Prawn)\n\nOut of it all, I liked the side of vegetables & the Chhayau Tarkari. The lamb in the Mismas was surprisingly cooked well in on the inside although it looked charred from the outside, the salmon lacked any flavor & texture. The prawns were disappointing as well, although large, they lacked the spice/kick that you wanted. However, the green bell pepper & onion that it came sizzling with were tasty. Naan was obviously just made which was great and the rice went well with all the dishes. \n\nOur waitress informed us that Nepal food is like Indian but with a few different spices. Ok, I like Indian, but I wasn't too impressed w/ their version of \"mush\" & spice. I suggest sticking to the vegetarian dishes, go w/ a few people so you can get a variety just in case you're not happy with your choice. \n\nI was really excited after reading all the reviews, but maybe these people haven't been to Maharani near Polk St.", "author": "Marissa H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-02-18", "description": "Salmon curry had no flavor, as well as the tofu with green beans curry. Sauce for the salmon was runny. The tofu curry though was thick and creamy and went well with the naan. Also, it's bright neon redness was like nothing I've ever seen in a dish, so thumbs up for that. After drying off the sauce off the salmon, the fish went pretty well with the tofu sauce.\n\nBasmati rice was dry, lentils salty, vegetables plain, and the chutney on the spicy side. Decent chai though and attentive service.\n\nOverall, it felt like a mediocre, but pricey Indian restaurant.", "author": "David G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-09", "description": "Fabulous food...If you haven't had Nepalese food it is very similar to Indian/Pakistani, but with different names.  Indian with a twist and just better-spicier and perhaps not as creamy curries.  Very flavorful tandoori style items.  Tiny, cozy and modern restaurant, very sweet service, courteous and attentive and perfect after several visits, the food is very consistantly good.  One one time the naan was a little on the greasy side, but it was so minor that I ant rate the restaurant down.   It is a must try in Bernal Heights.", "author": "Anibel B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-15", "description": "One of my favorite places in Bernal. Reliable, always space to take a table, and a great take-away option too. Delicious Nepalese food with a great wine selection.", "author": "Courtney B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-05", "description": "Awesome place for a casual meal. My husband and I just moved to the neighborhood and this place quickly became our regular spot. The food is yummy, prepared well without that greasiness that you typically get from other Indian-style places. Their naan is to die for. We've tried the lamb curry, prawn curry, and prawn tandoor and the experience has been very consistent - each dish stands on their own (very tasty and healthy).", "author": "Nga P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-30", "description": "Little Nepal is phenomenal.  Although I've heard it can be a hit or miss, I personally find a hit every time.   Its small and cozy, so I would recommend calling ahead to ask about a wait/reservation if you are going on a popular night.  They have this cashew butter masala sauce that will blow your mind, so amazing.  As someone who has travelled in Nepal, I can't say its completely authentic (most Nepali cuisine is Dahl Baht (lentils and rice), but it certainly is good, and the spices are authentic.   Good location, just on Cortland in Bernal.  Also great staff most of the time, I've been when they have been completely slammed with people, and understaffed, and yet the wait staff seem to bust their butts to make sure everyone is satisfied.  A+ restaurant.", "author": "Benjamin F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-01-01", "description": "- food:  very spicy but flavorful\n- atmosphere:  comfortable inside\n- staff:  nice, friendly \n- price: average\n\nadditional info:\n- the spice level can be too much for some", "author": "J. B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-10-28", "description": "Cool place, good food, but slightly overpriced and there are better choices within a short walking distance. I definitely prefer Zante's Indian food on cortland and mission and on cortland nearby to little Nepal, Piqeo's, vinorosso, and liberty cafe are better all around.", "author": "isaac t."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-05-24", "description": "I really love their food here but I don't like the service at all. I do highly recommend their kukhurako ledo served in a delish cream sauce. Give the combo a try because the sides are interestingly good. Their garlic naan is one of my faves in the city. The tandoori chicken is a little too dry for my taste so I can't say I'd enjoy that.\n\nI really love the cozy atmosphere and that they're located away from the hustle and bustle. But due to my dining experiences here I just haven't found a time when they were attentive or alert. It's a small restaurant and I don't understand why they don't do their rounds more frequently, like taking orders, refilling water and maybe smiling would be awesome. Because of the poor service I haven't been back in a while.", "author": "Cristine I."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-02-17", "description": "This little gem hovers in the exclusive realm I call my \"PT5\" (Permanent Top 5) for all-around thumbs-up, tongues-up all-purpose snackeries.\n\nAll-purpose in that it's a sumptuous place for a romantic dinner, an exotic meal for out-of-town visitors, a comforting choice for those times you just want delicious food delivered to your door, and a high-quality, reasonably-priced restaurant staffed by friendly folks.\n\nIs that enough hyphens?", "author": "Jaina D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-02-06", "description": "Having camped and trekked the Himalayan regions extensively, both in Nepal and India, I got to eat a lot of good, authentic Nepali food. \n\nSo when a friend told me about this place, I brought my appetite here immediately. I went, I sat, ordered, ate, and walked out smiling ear to ear! We started with the steamed vege momo (just like it tasted in Bhaktapur!); I LOVED the vegetable Chowmein - they cooked it in mustard oil, which is oh so aromatic! My husband had the Kukhurako moola (chicken with daikon) as a combo order. He said his food was just as delishhhhh!!! \n\nRay, the seating host, is sweet and so is the young lady. The decor is warm, the place is cozy and food is \"ramro\" (good).", "author": "Me Iz S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-22", "description": "Great location it was very easy to find parking spot. Cute atmosphere with a replica of Nepal. Very friendly staff. The Taj Mahal beer is great! Try the sampling dishes for 2 or 4 they are worth it. Reasonable price.", "author": "Eric S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-06-21", "description": "I love indian food and I love chinese food. So obviously nepalese/nepalian food was a hit for me.  What I loved about Little Nepal was the intense flavors each dish had.  I shared the set meal for two with my boyfriend and it was way more than enough food to induce food coma. \n\nThe appetizer sampler came with momos (asian pork dumplings), samosas (pastry puff is diff than the indian kind, less oily and a little less yummy, but the inside stuffing compensated- less mush of potatoes and more peas and onions and spices), and finally this cubed marinated lamb thing that exploded in your mouth. NOM.\n\nWe shared the tandoori chicken that came out on a sizzling hot plate.  It was surprisingly juicy, I guess because I've only had dry to semi-dry tandoori chicken.  We also got the black eyed peas and potato dish.  It was hearty and delicious.\n\nI loved the presentation of the rice, naan and little veggie sides on the huge silver plate.  It was awesome.  The veggies and lentils were great on the rice and with the two main dishes.  I ate almost my entire plate and what I didn't finish my boyfriend did his job and finished.\n\nJust when you think it's over and you can not move or sit up straight.  They serve you dessert- rice pudding.  I did not eat much of this since there seemed to be milk or cream in it.  \n\nThe only downside is that the house wine tasted like box wine and was pretty disgusting. Oh well....\n\nI already want more.", "author": "Skye W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-04", "description": "My husband took me here for my birthday dinner... and it was lovely! :) The staff was friendly and accommodating. They shared stories of their hike to the top of Everest. How cool is that? The food was flavorful. We tried to tandoori mixed platter and followed it with the most delicious rice pudding. I will definitely be going back to this hidden treasure.", "author": "S. M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-19", "description": "Good Nepalese--smaller portions though. Ordered a chai tea but waiter forgot for about 20 minutes until we followed up (of which they also kindly waived the charge). Extra charge for the rice.", "author": "Jefferson S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-09", "description": "Great neighborhood restaurant. I got the curry tofu dish with green beans (cannot remember the name) and my husband got the tandoori combination platter.  Both great dishes, and they came with a small dish of lentils, a small portion of veggies, and two pieces of plain naan.  My only complaint is that the prices are a bit high.  I felt that each of our dishes should have been about $5 less.", "author": "Emille L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-06-10", "description": "A hidden treasure; love that Little Nepal is tucked away on the furthest end on Cortland (east end).  I like the out of the way places in San Francisco--in some ways I feel like I am in a small town and not in San Francisco.  The best of both worlds--well prepared, presented and great ingredients.  \n\nI enjoyed the Poleko Maccha (Tandoori) Salmon--the sizzling presentation, a fun touch and Kukhurako Pakuwa, chicken in a tomato curry sauce.  Order the combination--fresh and gorgeous Naan, small vegetable and lentil beans; a nicely spiced sauced on the side and served on a nice stainless steel platter.  The flavors are interesting--reading the menu you will see ginger as a opti-present.  The ginger used superbly well--it does not overwhelm and take over as ginger can do if it is overly used.  The ginger is nearly a hint and cascading with the other spices.  The spice notes can be best described as southwestern-Mexican chiles (Poblano, Guajillo, New Mexican): spicy-sweet and slight heat and coming together with the precisely used spicing formulation.  \n\nIt is a tiny restaurant; I wish there was some candle flicker action; and the wine list needs a heavy revamping.   Excellent wines for this food (which I wish were on their wine list and are missing):  Carménère, Refosco / Refosk, Petite Sirah, Cabernet Franc, Plavac Mali, Mondeuse.", "author": "Jaime Patricio M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-01-29", "description": "I went to Little Nepal tonight for what had to be like my millionth serving of Kukhurako Ledo. As I sat there scooping up the last delicious morsels with a bit of naan I wondered, yet again, if I should write a review. I've weighed the pros and cons and as much as I don't want my cozy little dinner spot to be invaded by the masses, EVERYONE should experience it - I think word is getting out anyway.(: The food is ABSOLUTELY fantastic and very fairly priced, especially by San Francisco standards. I must admit I have not tried the entire menu (for Kukhurako Ledo & me it was love at first bite), but what I have had I highly recommend. A few suggestions:\n\nKukhurako Ledo for dinner (obviously)\n\nLittle Nepal Special Chhoila or Himalayan House Salad as an appetizer \n\nExtra order of naan (a side of naan comes with your entre, but if anyone in your party is a big eater you're gonna need it!) \n\nOn top of the food being to die for, the service is flawless! All of the servers are incredibly sweet and attentive. They go above and beyond to accommodate their patrons and ALWAYS remember that I drink my water through a straw.(: The chef and the general manager are also very friendly and pop in from time to time. It's just a great little spot overall. Dim lighting, soft music and shareable entrees make Little Nepal perfect for a date night as well.", "author": "Nattles L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-08-18", "description": "DO NOT ORDER TO GO!!! RIP OFF.  They send you 1/8 of the portion served in\nthe restaurant. DId not even send the complete order and did not even offer \na solution.  Worst experience ever.", "author": "Oscar P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-12-08", "description": "The food is good and the service is friendly. I enjoy the curries and the tandoori.", "author": "Brandon L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-05-31", "description": "My boyfriend and I LOVES this place. Glad I found it on yelp. \n\nWe always order the set meals for two. \n\nMomos are GREAT! especially with their sauce, we always have to ask for more sauce because my boyfriend literally can drink it.\n\nSamosas are very good too and it fills me up fast.  \n\nMy boyfriend loves tofu, so we will have the tofu tarkari - very very flavorful. \nWe will also get the poleko kukhura - very big portions. I get soooo full from the appetizers. \n\nVery great service, always help us refill our water.", "author": "Willa L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-10-12", "description": "I lived in Kathmandu for a year, and while this isn't the most authentic Nepali food I've eaten outside of Nepal, I think it's the best.\n\nGet the set meal for however many people are in your group so that you get to try pretty much everything -- the portions are huge and you'll have leftovers. The lamb momos are their best, although their veggie and pork are excellent as well. They also have amazing lamb samosas. Very good chai. Great sauces. They even have choila!", "author": "Adam Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-12-19", "description": "The Nepalese food here is really tasty. If you get a chance, check this place out. The servers are also very nice and courteous. I would give 5 stars but the bathroom was kind of filthy. That's a really important aspect for a restaurant; don't gross your customers out with a nasty head.", "author": "Michael S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-05", "description": "This place is great. Let me tell you why.\n\n1) Light but flavorful. Skips all the heavy cream and spicy-but-with-no-real-flavor food you find in similar restaurants and gives you nothing but well-prepared and well-seasoned food. I particularly like this restaurant's momo.\n\n2) Complete meal options. In a lot of similar restaurants, you have to order lentils, veggies, rice, and bread separately from your main dish. You usually don't end up ordering everything because it's too expensive and you're left with way too much food afterward. Here, you have the option of paying a little extra to get a nice platter with a little bit of everything included. Thank you, Little Nepal, enabling customers to [affordably] order balanced, complete meals.\n\n3) Ambiance. From the traditional steel/bronze dishes to the background chanting, everything about this little restaurant exudes calmness and warmth. What a nice place to go to when you feel homesick.\n\nThis is going to be my go-to restaurant for my best and worst days. I recommend this place to everyone.", "author": "Sofia T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-10", "description": "We were a party of Three. We ordered Four dishes: Mismas Pakoda-deep fried spinach and onions w/mint dipping sauce;  Pleko Machha-Tandoori Salmon served sizzling on a iron platter; Tofu Tokari-velvety pillows of tofu in a delicious Tika sauce; Khasiko Masino Masu-ground lamb meat balls in a tomato curry sauce. We ordered A La Carte instead of combo. Each of us had Chai Tea with our dinner. Our bill came to $57. We were too full for dessert. Little Nepal is a small yet cozy family run restaurant. The wait staff was friendly and helpful explaining the menu and making suggestions. A friend suggested this place to us. Since we choose a Thursday night to dine out, we found a nearby parking space easily. The Muni 24 Line bus stops near the door step which is a plus. We had a very pleasant time and will visit Little Nepal again to try other entrees!", "author": "Kailey W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-07-31", "description": "This spot, while not technically Indian, has the best Indian food in the city by far.  Total hidden gem.\n\nI've actually only gotten a couple of things on the menu, but they're sooooooo good, I find myself always craving them, knowing that I'll be extremely satisified.\n\nSamosas:  check.  Very flavorful.  A-/B+\nNaan:  yep.  I've had naan in every major city in the country on a constant basis over the last 20 years, and this actually holds up and is almost as good as what I've had at places like Dawat in NYC.\n\nThe Dal.  OMG.  A+.  When you order the combination, you get your entree and rice, naan, mint and tamarind chutneys, and two very small containers - one with vegetables, the other with dal.  Let me just say it right now, do yourself a favor and ask for a side order of the dal instead, especially if you're ordering for 2 or more people.  It is some of the best I've ever had...and it's not some generic style, either, it's Kali Dal (the best style you'll ever have, made with black Urad lentils).\n\nBut yeah, great deal w/ the combo for the amount of food you get.  You definitely get leftovers out of it.  The Kukhurako Ledo is like a combination of Korma & Tikka Masala...enticingly good sauce.  Highly recommended.\n\nI actually need to get on the ball and try the Momo and mango ras (lassi?)...\n\nEverything here is made with really fresh ingredients, and the staff are genuinely nice people who make you feel at ease, whether dining in, or taking out.\n\nThe only negative :  closed on Mondays!  Will definitely miss this place when I move.", "author": "Bryan M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-08-24", "description": "I've been to Little Nepal twice now (about 2 years apart) and both times I've been happy with the choice. \n\nWe ordered the set meal for 4, which was a ton of food and everything was really good:\n\nMomo (like a pot sticker): we got chicken, pretty good\nPakauda (onion/spinach battered and fried): everyone liked this, best fresh, I probably wouldn't order this for take-out\nAlu Tama Bodi (potato, black-eyed peas and bamboo shoots in a sauce): thumbs up\nKhasiko Masino Masu (lamb curry with mushrooms): thumbs up, but I love lamb\nSizzling Kukhura (tandoori chicken): very large pieces of chicken that were very very tender\n\nThey also gave us a few other dishes that I didn't get the names of and naan, rice, and dessert. \n\nTotal bill for 4 with some wine and tip was $120. Not a bad deal.\n\nStreet parking in the area hasn't been too hard (although I don't know if that is typical or not). \n\nThey aren't on OpenTable, so I called when they opened for a reservation although on a Sunday night at 7 pm it didn't seem to be necessary.", "author": "Ryan S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-06-30", "description": "Oh boy . . . . .\n\nCalled at 5:04 to order food for delivery.  I'd ordered once before and was very happy.\n\nOne hour and 45 minutes later it arrived, stone cold, soggy, falling apart.  Cold pizza on the morning of a hangover is more appealing.\n\nYes, I had called to see what the delay was.  I called 5 times.   The driver is new and was lost . . . . like super lost.  My house is an 8 minute drive from Little Nepal, minimal turns, off a main road.  Easy!   But I guess they don't give their drivers GPS.  Hello, this is 2000freaking9 . . .why no GPS or even an old school paper map?\n\nAnyway, on my last phone call I said I did not want to pay full price for what would be cold food.  She told me  \"We give you a discount, next time\"  NEXT TIME?  What about THIS time?   She was willing to take $9 off a $48 bill!  What an insult!\n\nSo much so that I paid the full amount - I believe in my own good karma.  They can stew in their own rotten karma.\n\nAnyway, the food arrived just as I feared - stone COLD.  Momos were soggy,  Mismas Pakauda cold, soggy, falling apart and completely unedible.  I tried something new, Khaskihki Masio Masu which is like lamb Hamberger Helper.  Awful - even piping hot it was obvious that it would be awful.\n\nI would have been better off telling them to not bother completing the delivery, and making toast and butter for dinner.\n\nThey answer their phone with a Namaste . . .I'd say it's more Na-Nasty.   Note to owners of Little Nepal - ethics in business is everything.   You should have comped me this meal which mostly ended up in the trash.", "author": "Cinnamon Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-10-01", "description": "I've eaten here about 6x already so I felt now was a good time to review them.\n\nI've had a few of the dishes on here but I won't get into all of them, just the ones I recommend.\n\nI will also say that for the price, you get a very fair amount of food, especially if you order the Full Combination on take out...you get a LOT of food for your money...I eat like a damn pig and I have leftovers.\n\nThe service? the people I've dealt with on the phone and in person have always been nice to me and very accommodating. When I went there to pick up my food they gave me tea as I waited for my order.\n\nalways smiling, always cool and polite...\n\nthe dishes...\nI've favored the Tofuko Tarkari lately to be honest, it has a very creamy texture and taste with some sweet overtones in it. The sauce is plainly put...incredible. I've eaten it alone with just rice and had a meal in itself. The tofu that accompanies it is soft on the inside with a bit of a skin on the out. It is obviously flash fried to seal the skin. Very tasty and again mixed in rice...fantastic.\n\nPoleko Kukhura is also a very good dish, the meat is never over cooked or dry and retains a lot of the flavor from the spices and yogurt.\n\nSabjiko Jhol is a great lentil soup that has a bit of a kick to it but nothing that even a person who hates spicy food can't cope with.\n\nRice is rice and its done right here as well with just the right amount of starch to add to the stickiness.\nthe mango shake is very good as is the Naan bread...especially the G-Naan which is basically Garlic Naan.\n\nwell that's it kids...that's my review of this place, check it out...for 50.00 in San Francisco you can eat a lot worse TRUST ME...this restaurant is on my speed dial", "author": "Dean M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-11-17", "description": "SO. YUMMY. Ordered takeout from here tonight to my apartment in the Mission, and it was eminently crave-able. From the naan to the salmon curry to the yummy coconut rice that came in the bag (didn't even know I'd ordered it...) - top notch!", "author": "Carol S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-07-07", "description": "Little Nepal is an absolute gem.  My fiance took me as a surprised a few months back and we're about to head there again.  After weeks of being in a food funk and tired of our go-to spots, I was excited to try something new and Little Nepal did not disappoint.  \n\nThe restaurant was a small but inviting neighborhood spot in Bernal Heights.  We had the lental soup (daal), and the Tofu Tarkari.  Both were fantastic.  The tofu was tender and floating in a creamy curry that warmed my whole being (it was a cold day).  \n\nAfter our wonderful experience, we were hoping to have our rehearsal dinner here however, they are popular enough to have reservations 2 months in advance!", "author": "Van T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-06-16", "description": "I freaking love this place. Went last weekend and going again tonight. The food is so yum and there's no grease! Great replacement for Cafe Tibet in Berkeley, though the momo's are not quite as good.\n\nService and atmosphere is great. The restaurant is small but cute.", "author": "Cece L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-03-27", "description": "We started out with samosas - the outer dough seemed hard and chewy, which i was not a big fan of. I don't think I would order these again. I loved the green sauce that came with it. \n\nI got the Khasiko Pakuwa (lamb in a tomato sauce).  The sauce was a little runny. The flavors were decent. \n\nKukhurako Ledo  - the sauce was a little to sweet for my taste. \n\nAfter reading all the reviews on this place, I expected to the food to be really good. Unfortunately, I was a bit underwhelmed. The food was just okay and I'm not sure that I would come back. \n\nPro: very friendly staff.", "author": "Amanda W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-03-16", "description": "Yes, for their Kukhurako Ledo! My second visit followed a few days immediately after my first because of this dish. I'm salivating just thinking about it as we speak!  Their naan is delicious! My cousin orders 3 of their different varieties each time.\n\nCute little restaurant. Attentive staff - they make sure to fill your water glasses every time they walk by. We've been fortunate enough for zero wait time. \n\nAn added star for not leaving the place smelling like you saunaed in their kitchen.", "author": "Denise N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-04", "description": "Good service, great food. i love the tofu tarkari and naan!", "author": "Ashley C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-12", "description": "LOVE the food! Wonderful atmosphere!  A cozy place for a date, and a wonderful place to hang out alone/or with friends. I really like that it's a family operated business. And, as a gluten free person/I was thrilled-very few things on the menu contain gluten.", "author": "Sharon B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-08", "description": "Before we rang in the New Year, we headed to Little Nepal to have our last dinner of 2008 with a friend and her boyfriend.  I was not familiar with Nepalese food, but, I'm adventurous like that and was game for something new. \n\nMy friend had made a reservation beforehand, and thankfully so, because by the time we were through our entrees, the restaurant was packed.  The restaraunt is fairly small and probably seats around under 40 people.  \n\nSince there were four of us, we decided to get the set meal option that gave us the following:\n\n- Momo -- think potsticker-esque things\n- Pakauda -- Fried, battered onions\n- Alu Tama Bodi -- black eyed peas (bebot!) in a curry sauce\n- Khasiko Masino Masu -- minced lamb curry\n- Sizzling Kukhura -- grilled chicken on a hot plate\n\nEach of us also received a metal plate with rice, two pieces of naan, and some other sauces to compliment our food. \n\nFor a newbie like me, it was a good introduction to Nepalese food.  Each of the items were good, and reminded me somewhat of Indian food, but not as oily or spicy; which was quite nice. \n\nService was spot-on, and I think that for the four of us it was under $20-$25 a person with tax and tip, and drinks.", "author": "Eugene F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-09-05", "description": "BEST DELIVERY EVER!  We regularly order from Little Nepal, and the food is ALWAYS great.  We love the Kukarako Ledo, pork momos, and chow mein.  It's our regular order and is always so delicious and fresh.  You can tell they put a lot of love in their food.  Another plus is they store your contact info and credit card info, making it so convenient to order delivery.  Highly recommended.", "author": "Jennifer N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-04-17", "description": "This is a charming place on Cortland that seems to be the perfect neighborhood place. Someplace that serves almost familiar food but with a local distinction. And I don't mean Californian \nThe Saturday night that we visited, there was a large table of drunk/loud tourist (from LA) that did hamper the otherwise great atmosphere. And I'm really playing this down....at one point one of them dropped his wine all over the tables, and was highly concerned with the effect of red wine on his dark leather shoes and dark jeans (rolling eyes). He proceeded to jump all over the place including backing into our table various times, and then decided to douse himself with a THICK layer of salt. Brilliant! The staff was really helpful (to us and them) and managed to deal with them without any attitude. 5 stars to them just for handling that table on an otherwise busy night! \nSadly this is where my praises end.  Service was great, but the food left me a little unsatisfied. I've had wonderful delicate momo's before, and this was not it. They were dense and doughy. The sauces for the main dish (sorry can't remember which chicken sauce we ordered) were not well balanced, and had an almost non fresh preservative after-taste. I really wanted to like this place and will probably give it a couple more chances before writing it off.", "author": "Bushra S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-08-17", "description": "The food is okay, the service is really bad, I wasn't going to write anything, but my son who is eight said \"Dad you have to tell everyone this place sucks\" if it was our first time I wouldn't do that. It was our third and each time gets worse.", "author": "WildBill C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-31", "description": "Had momo and choila...Both were very good but they use horse radish in Choila so don't order Choila if you don't like horse radish.", "author": "Susie S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-27", "description": "Thankfully we live in Bernal and are able to get Little Nepal delivery regularly.  Hands down our favorite delivery.  Last night was the first time we were able to enjoy the restaurant itself.   \n\nOur group started with the Little Nepal Special - Lamb Chhoila.  I don't usually eat lamb, but the group chose the Chhoila after the server recommended it.  It was very good!  The beaten rice and pop-soybean are an excellent, crunchy accompaniment to the meat.  My favorite item on the menu is the Kukhurako Ledo.  The creamy, spicy, yet delicate sauce is unbeatable!  I get it every time we order out, but last night I decided to step out of my box and ordered the Poleko Kukhura (Tandoori Chicken).  This was also very tasty, but I prefer the sauce in the Ledo.  The Tandoori, is not in a sauce, but is marinated to retain some moisture.  Served sizzling with peppers and onions.  Think Nepalese fajitas.  Ha.\n\nService was okay.  Everyone was friendly, but our server seemed newer at her job and missed some opportunities to sell us more wine.\n\nAmbiance is nice.  Nothing special, but nice.  The consistently delicious food is the real reason to check out Little Nepal and then keep going back.", "author": "Dani W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-02-24", "description": "Cute and quaint little restaurant tucked in Bernal Heights. The staff greets you with a respectful namaste, which is always welcoming.\n\nI thought the appetizers were delicious. \n\nCHICKEN HIMALAYAN MOMO served with chutney. This appetizer looked similar to pot stickers. The chutney sauce was made of chili, sesame, and tomato. So, it was delightfully spicy.\n\nVEGETABLE SAMOSA with mint sauce...yum. If they went wrong here,  I would have judged them very harshly - like whip harshly. But, they perfected the samosa. I just love samosas!\n\nLITTLE NEPAL SPECIAL CHOILLA - This was absolutely divine. There was a spice that I couldn't quite figure out that gave it a nice little kick. I was thinking horseradish...but still not sure.\n\nKUKHURAKO LEDO - tandoori chicken...tender and delicious. I was stuffed by the time the entrees arrived!\n\nThe best part about this place is the ventilation is amazing. You don't leave the restaurant smelling like tandoori meat and curry. Which is cool because the neighborhood dogs don't start following you to your car like they want to lick you from head to toe. But, the down side to that...it gets quite cold in there. Then again, it could just be me. I like to be snuggled in warmth.", "author": "Liz K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-07-18", "description": "My mom lives in a box. (My town growing up has 98% caucasians.) So when she visits me I like to do things with her she's never done so when she goes home she can tell everyone in our small town how cool SF is and how her Ali-gator does really cool things all the time. \n\nMom visits. We're hungry. Scratch that... We're STARVING. \n\nMe: How about Little Nepal?\nMom: Nepal? Is that one of those countries with little starving kids on the tv commercials?\nMe: Uh.... *trying to recall Sally Struthers in Nepal* *ACK! go away image of Sally Struthers!*\nMom: Do they serve food there?\nMe: Uh... Yes, that's why I suggested it. You'll like it mom. Trust me. \nMom: What's it like?\nMe: It's like Indian food.\nMom: Acorns and buffalo?\nMe: No, spicy tasty food with yummy bread and rice. \nMom: I love rice!\n\nproceed to Little Nepal....\n\nAfter dinner...\n\nMom: YUM!!! I love Nepalian food!! Too bad there's no Nepals in our town. \nMe: Uh.... Yeah Mom, glad you like it.... \n\nNow every time my mom comes she wants to come here. I've been to LN numerous times (before taking my mom there) and always had a great experience. \n\nI love their naan. (Which my mom was confused about... \"This is so good but is it considered a tortilla or bread?\")\n\nThey also have a couple of Indian beers I had never tried before coming here so that was a highlight. \n\nI like it so much it that it might be in my top 10 favorite restaurants. \n\nThey have take-out too and I'm pretty sure you can order online.\n\nAnd... I LOVE the look and feel of the inside. Rarely do I love a restaurant's interior decorating, but I just love how fresh it looks.", "author": "Ali R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-08-01", "description": "They've got poorly-designed spoons here.  Definitely a case of form over function.  You know how when you drink a spoonful of soup, your upper lip kind of slides across the bowl of the spoon to usher the soup into your mouth and ensure that you don't leave any clinging to the spoon surface?  The bowls of the spoons are too deep, so you can't do that.  Result: precious soup residue left cold and saliva-y after every swallow.  And since they serve their soups very hot, the thick metal retains a lot of heat, so if you do try to cram your lip in there you'll get burnt.  Poor spoons in every aspect.  Try harder with the spoons, Little Nepal.\n\nI'd like to leave the review at that but I guess I should address the food too.  I've only had vegan stuff, of course, so take the following with a pinch of salt.  In fact you may need more than a pinch, because a randomly chosen 75% of their food is unaccountably bland.  The lentil soup?  Delicious.  The vegetable samosa?  Utterly lacking in flavor.  Same with the veggie entrees, but the dal that comes with them is lovely.\n\nThe decor is nice, and the waitstaff is attentive and polite, but basically I come to a place for the food (and the spoons, natch).  Maybe it's just about the vegan food, but Little Nepal is not working for me.", "author": "Joel K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-04-19", "description": "It's been awhile since we last made it down to Little Nepal but this was the first real Nepalese restaurant I'd been to in the states. For years in Boston we knew lots of Nepalese who worked in (often Indian) restaurants, and there were a few Tibetan places with momos and such, but we were sorely missing an honest-to-goodness straight-up Nepalese joint. So on a visit to SF we ran over to this place. \r\n\r\nI recall the food was pretty good -- momos, curries -- with a number of Indianish options rounding out the menu. The decor is nice, probably the prettiest of the 3 Nepalese restaurants in SF (that I know of; also there's more in the East Bay). The service: excellent and kind. In fact my wife recognized our waiter from TV in Nepal! She's like, did you use to host a music program in Kathmandu....? Yup. We're planning a return visit soon.", "author": "Tom L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-10-01", "description": "I like to call it \"indian lite\". Nepalese food is very similar to Indian food, just a little lighter. This is one of the first places I tried on Cortland when we moved out to the southeast side of the city. \n\nAt Little Nepal, the food comes either 'a la carte' or 'combo'. They both come with rice and naan. But the 'combo' also comes with a lentil soup, mixed seasonal sauteed veggies and a spicy tomato chutney. If you're a party of 2, I would suggest one person get their meal 'a la carte' and the other as a 'combo' and just share, or else you will end up with too much food! \n\nLast night we had the Sabjiko Tarkair which is potatoes and cauliflower. The Indian equivalent to Aloo Gobi. Very tasty and great amount of flavor and spices! \n\nWe also ordered the Chhyauko Takari which is a mushroom dish with spices. This was like a mushroom masala. Also very good! \n\nThe service is pretty good and friendly. I enjoy coming here and should come here more often! \n\nTotal dinner and appetizer with tax, tip and drinks: $45.00", "author": "Caroline C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-03-12", "description": "Mrs M, being Indian, always looks down on Nepalese food as just a blander knock-off of her own country's cuisine, and while I find that critique a bit pithy, it's not totally wrong.  We all know the correlation between climate and spiciness, and Nepal's certainly got some frigid altitudes.  Besides, I expect when you've been trekking across the Himalayas, you appreciate the hearty sustenance factor (yak's milk chai, anyone?) over exotic flavors.  And on that front (Little) Nepal certainly delivers.\n\nConsider the \"set meal\" for 4 (set meals are totally the way to go here, providing you a great overview of the cuisine and removing agonizing decisions over what and how much to order):\n\nMomo - Basically pot stickers (ah, now that's something you don't see in Indian food!)\nPakoras\nBlack-Eyed Pea Curry (sort of the signature dish in my eyes)\nLamb & Pea Curry\nSizzling Tandoori Chicken\n\nPlus those big metal \"thali\" plates for everyone, with naan, rice, and assorted dals and sauces.  The point is, come open-minded and hungry and you'll get that same great feeling of natural-food nourishment as you would at any Indian place.  And I guess you spice nuts could always ask the watier to kick up the heat factor.", "author": "Wes M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-11-17", "description": "Really flippin' good.  Great spot in Bernal Heights - Cortland at Folsom.  The staff is super friendly, the room has a great warm tone - nice warm wooden interiors, but enough soft surfaces to prevent it from being too noisy when it's full (and there's good reason it's full).\n\nThe food is great.  We shared vegetable momos (deliciously steamed - pefect tastes and textures), stewed, curried lamb (the lamb was rather tough, but the stew was delicious) and black-eyed beans with bamboo shoots (amazing!  simply amazing!)  The nan was very good and the basmati rice was just right.  We left very, very satisfied.\n\nWine selection is a bit limited (Metro Kathmandu has a better list), and the Indian beers were all right (Flying Horse was a better beer than Taj Mahal).\n\nThe staff was extremely friendly and helpful.  From the Namaste greeting at the door, to the flawless, unobtrusive service, we loved everyone who came to our table.  The recommendations, the questions/clarifications were great.  I will make future trips to Bernal just to eat here.  Love it.", "author": "Evan G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-08-15", "description": "Dayum!\nI was so not expecting this place!\n\nWhen I grew up, you didn't venture into this neighborhood unless you were crazy, a hooker, or trying to score some drugs.  This place was crazy-dangerous.  Several decades later, it's a gourmet ghetto extraordinaire!\n\nI can't even tell you the names of what we had--we got the combos (included rice, naan, sauces, etc) one with the prawns, one with the lamb, chicken and salmon.\n\nIt was AWESOME and so much better than Roti, which I happen to like, until coming here...the food here was much better and the service was less stuffy.\n\nI'll definitely be back :)", "author": "Lisa B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-09-25", "description": "Damn.  That was a tasty meal.  I'm confused as to why they don't just give you chutney with everything instead of requiring you to get the combination.  I didn't have the chutney and I am sad.\n\nThe other stuff we had was great and I apologize for not writing exact dishes, but I'm convinced things are to be good all around here.\n\nI'll definitely go again.", "author": "cindy p."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-10-16", "description": "Little Nipple (as my friends and I call it) is yummy delicious! I have been going there since it opened a few years ago and I have never been disappointed. \n\nNepalese food is very similar to Indian food, but this place is better than almost any local Indian restaurant. (Take that Zante's Pizza!) \n\nThere are a few items on the menu that you must try. I always start with the Little Nepal Special Chhoila (pork) and the Himalayan Momo (potstickers). Both of these items are unique and excellent. \n\nFor entrees the big crowd pleaser is the Kukhurako Ledo (like Chicken Tikka Massala, but BETTER), the Chhayau Tarkari (mushroom curry), the Machhako Mitho Tarkari (salmon curry), and Tofu Tarkari (Tofu curry) are all fantastic. \n\nYou should try this little Bernal Heights gem out immediately. The restaurant has decent enough surroundings and the wait staff is good, but I usually order take-out.", "author": "Yvette K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-09-04", "description": "This beautiful restaurant has it all: decor, ambiance, and most importantly, amazing food.  We started off with mo-mos and merlots and moved onto the entrees pretty quickly.   The hit  dish was definitely the Tofu Tarkari -- the tofu was incredibly soft and creamy inside with a perfectly chewy outside. It was drenched in an equally creamy tomato-based curry that put me over the top.  If you get the combo, it comes with naan (the best naan I've had in my life - crispy and buttery!!), veggie curry, lentils, and rice.  \n\nService is excellent and the owner of the restaurant is a super friendly, hospitable guy.  I also like knowing where my money is going.", "author": "Sid D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-11-11", "description": "I came here after reading up on some Yelp reviews about a good dinner date place.\n\nWhen we were there, I remembered some reviews had said that the set meals were good, so we got the set meal for 2 people.\n\nI've never really ventured out this way so thank goodness for GPS.  But maybe some of you are better at directions, or maybe my GPS unit took me through some backroads instead of the main route.\n\nAnyway the place was quite quaint.  Small restuarant, and there was no wait when we arrived.  We got there for a late diner, probably 9ish.  I was starved!\n\nThe meal started with appetizers:\n1. Momo - basically they're potstickers. We got vegetarian.  Potstickers.\n2. Samosa - My former roomate used to make these grea potato samosas.  I miss her cooking.  Anyway we got lamb samosas, and they were deeeeelicous.\n3. Choila - We got lamb. Basically lamb cubes. Garlic. Lamb and garlic is always good in my book. You can get pork or some other meat product, too.\n\nThen came the entree.  It came with rice, naan, some vegetable soup thing, some bean dip type thing, and we got some sort of other vegetable dish and a chicken dish.  I had a few bites and I was full.  The food didn't seem to come in really big portions, but I was good and stuffed.  We both ended up taking most of the entrees home.\n\nThey say Nepalese food is influenced by the foods around Nepal.  At least that's what they say on the menu.  And it's apparent, too.  I could just as easily have been in an Indian restaurant.  The food here is good and portions are plenty.\n\nThe verdict: A good place to bring a date.  Kind of like a more upscale Naan n' Curry. Just hope you don't mind smelling like the food after.\nFour stars for \"will come back for a nice dinnerdate.\"", "author": "Robert L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-07-31", "description": "I dined here last night with my dad, it was my first time to Bernal Heights, and what a find!  I had the Kukhurako Ledo (Boneless chicken from clay oven (Tandoori) cooked in light cream, cashew nut, fresh tomato sauce, garlic, ginger and spices ) - it was DELICIOUS!  Wrap the chicken and sauce in the naan... yum.  I think my dad got the Poleko Kukhura (Tandoori boneless Chicken marinated in yogurt, ginger, garlic and spices).  He liked mine much better (his was a little boring... compared to mine).  Cute, little ambiance.  Overall, great night!\n\nFor the Corkage Fee, go to www.SFCorkageFees.com!", "author": "Brittney B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-18", "description": "Yum, we went here last night after attending a friend's poetry reading nearby. It was suggested by a bernal heights local - a true sign that we were in for some serious yum yums.\n\nIt was late on a Saturday, and the place was about half full. They were able to accommodate our party of 5 with no problem. Everyone ordered differnt entrees, from black eyed peas, to lamb, to chicken. I highly suggest the tofu, it tastes homemade and the cream sauce that they use is divine.\n\nLittle Nepal is part of the slow foods movement and you can taste the high quality ingredients. That being said, the service is also a little on the slow side - it is not unpleasant however if you are starving you should consider an appetizer to tie you over.\n\nOne last tip: order the combo. Simply because the plate that you get to eat from makes you feel like royalty.", "author": "Allegra F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-11-19", "description": "Food is excellent, very traditional. We love the service. Don't be fooled by the portion, we were so stuffed and still had left overs to take.", "author": "Lovetea C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-03-11", "description": "Just when you think you'd run out of small little restaurants to celebrate that most nefarious of greeting card holidays (hint: it drops on you every 2nd week of February), a cool little joint like Little Nepal sticks its hand out to rescue hapless and hopeless romantic dinner-planners such as myself. It's situated in the southeast quarter of Da City in the quiet, hilly Bernal Heights area. The dining room is small and simplistic but with enough alcove area to comfortably separate tables from diners. \n\nThe pork momo appetizer is always an ideal way to start the meal. I enjoyed wolfing down the goodness that incarnated itself in the Jhinge Machhako Tarkari. In Nepalenglish, it means King Size Tiger Prawn cooked with ginger, garlic, tomato and spices. My Lady N noted that her Khukhurako Ledo (Boneless chicken from clay oven (Tandoori) cooked in light cream, cashew nut, fresh tomato sauce, garlic, ginger and spices) was satisfying and tasty. Each of our meals came complete with naan, rice and a good mix of seasonal veggies. A reasonably priced (6 bones) crisp pinot grigio and a chablis both complemented our meals nicely. The portions may seem less-than-huge, but they're 'hearty' enough for someone like me who's nauseated from all the red hearts and roses.", "author": "Chris C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-11-22", "description": "Went back to little nepal tonight and was reminded how much I love this place. The lamb chhoila is FRICKIN AMAZING. The Kukhura Ra Mula is pretty bomb too and it's fun as hell to say. The Poleko Machha (although perhaps not the most authentically Nepalese dish on the menu) is another favorite.\n\nA word of advice- skip the combination and just order an appetizer instead. The daal-like lentil dish and the veggies you get with the combo meal have never impressed me. All you really need are the rice and naan. Ask for a side of chutney though- especially with the tanndoori entrees!", "author": "Brian H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-09", "description": "Five stars because I honestly can't remember anything negative about my meal here.  Ultimate comfort food.  So flavorful, so delicious and a great really calm and inviting atmosphere.  We had the meal for two and were able to take leftovers and make a decent lunch out of them the next day.  The chai was great! I wasn't finished with my cup when our meal was over and they packed an extra container of it.  The lamb was the best I've ever had anywhere.  Period.  Unbelievably tender and juicy. I'm looking forward to many more meals here.", "author": "Bella P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-10-25", "description": "Delicious food! Lamb is amazing, garlic gnan is great, and the rice pudding is a perfect finish!", "author": "Jeff M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-05-05", "description": "When was the last time you ate a meal and every few seconds you couldn't help but go \"mmmm?\"  I mean constantly you're going \"mmmm\" and you can't help it but it's just that good.  Well for me it was when I ate here last week.\n\nThe food was incredible.  I got the Khasiko Pakuwa and the lamp was so unbelievably tender and tasty.  My wife got the Kukhurako Ledo and loved every bite.  Next time we're definitely going to try the set meal for two.\n\nThe food is much like Indian, but to us not as heavy.  \n\nAnyway, half a star off because their tandoor wasn't working until we were almost done with our meal.  So we barely got any naan.\n\nBut this place is my new favorite restaurant in the city!", "author": "Ben C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-11-06", "description": "Love Little Nepal. It is definitely a hidden gem. Everything is consistently delicious with stand-outs being the Kukhurako Ledo and the garlic naan. The atmosphere of the restaurant is pleasant and never crowded and I love that they deliver!", "author": "Ashley B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-01-29", "description": "Okay, I live a few blocks from Little Nepal and not Berkely.  But, the Nepalese restaurant in Berkeley is a way better value and brings the momos.  Little Nepal doesn't bring the momos.  And the masala chai may be authentic, but that doesn't mean I like it.\nThe second time I went here, they were playing the most aggravating music I've ever heard in a restaurant.  Not eager to return.", "author": "Lego S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-02-21", "description": "Ridiculously delicious. Almost stupidly delicious. So good you want to cry a single tear of joy. \n\nI've always had mediocre service, but, frankly, I don't really care when the food tastes this good.", "author": "Cary M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-10-01", "description": "Amazing food & lovely people\nWe eat here all the time ( get  food to go allot) never a bad dish..Really,  really tasty. I am so impressed by their recipes and the fresh ingredients. The nan is probably my favorite from all in S.F.Try everything....All winners...", "author": "mary k."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-10-17", "description": "Nepalese food is a milder take on Indian. We ordered a bunch of ala carte entrees for the 7 of us. The most memorable was the salmon dish. Make sure you get a plate of white rice and bread. VERY NICE interior. I didnt realize Bernal Heights had a downtown area, I'll check this area out next time.. About 20 bucks a person for dinner, great deal. And they pour water in a fancy kettle thing..", "author": "Thomas L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-01-26", "description": "***Update as of 2/10/2008***\nThe food at Little Nepal has been consistently improving each time I go there. Last night I dined there with two friends and we ordered three vegetarian curries to share. We had some kind of roasted eggplant dish, a mustard greens dish, and a mushroom dish. All three of them were delicious. The bread was great. It was covered in butter, probably ghee, and was really lovely.\n\n***********1/26/2006*******\nI want to like them more I really do. They're located on cute little Cortland avenue. The decor and ambience are very nice. The food is just ok though. If the prices were lower it would soften the blow.", "author": "Kelly S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-03-04", "description": "A true neighborhood treasure!\r\n\r\nA bit of Nepal in Bernal Heights!", "author": "A P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-02-24", "description": "I looooove new food, but I may have psyched myself up a little too much. I was expecting my first tastes of Nepalese (is that how you say it?) to be yet another favorite, but I was disappointed.  We chose the 2 party meal so that I may taste as much as I could.  The Momo  (aka potstickers) were average, the Samosa was yummy, the chhoila stopped me mid-chew... \"What the hell is that flavor?\"  I racked my mind to determine the spice, but I could not place it.  Is it possibly just a meat smoked like never before?  I would actually like to know if anyone has the impetus to tell me.\n\nFor the main dish, the Kukhura was really good, but nothing new as it was your basic tandoori.  The Bodi was enjoyable but I love black-eyed beans in any form.\n\nAll in all, I am glad I went.  The service was fabulous and I did have a new flavor... whatever it was... but I would not go back.", "author": "Hayley W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-04-03", "description": "Little Nepal is such a gem, I love this place.\nI went here with my mom who while fabulous is also super picky and she loved it too. I thought the food was excellent and well presented. I had soup and Nan and mom had a chicken dish which unfortunately I cannot recall but it was wonderful. Mom also loved the Chai tea (and shes a tough customer when it comes to her tea!) and I had a glass of excellent (and cheap!) wine. The service was extremely polite and the decor is super cute. I plan on several repeat visits!!", "author": "Catty C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-11-20", "description": "I wanted to try something new this weekend and searched around Yelp for a little help.  Though the reviews were mixed, I decided on this place.  I enjoyed my meal but would probably order something different if I went back because I felt the mustard greens lacked some flavor.  To echo other yelpers, it is very reminiscent of Indian food, yet they use a lot more tomato and ginger.  It's a cute little place and certainly not as overpriced as others might have you believe.  I believe in stating the exact prices in my review so here you go:\nappetizer 5.95 split by 2\nveg. combo entree 12.50 (15 for meat combos)\nlarge bottle of imported beer (2 glasses) 6.00\nWe spent $45 with tip for two people.", "author": "angela k."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-14", "description": "This place was terrific! We went there for the first time tonight and loved it. We ordered the set menu for two and it was more than enough food. The service was friendly, the decor simple but lovely and they food was delicious! We will definitely be back. For the money, this place is a MUST try.", "author": "Cheyenne C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-09-27", "description": "Buy a ticket, find that long lost passport and enjoy your 100 hour long flight to Nepal ! or you can make your way to the laid back, intermittently classy yet always welcoming Courtland street (it's in bernel heights but then you already knew that! don't lie!) and dine at little Nepal. \n\nI dined there with a friend and we both agreed that the place gets maximum points on cuteness! The ambiance is warm and welcoming, chic but not overstated. It's like a book that doesn't blow your mind away or seduces you to hell but just lulls you into a peaceful slumber, ah! zzzzZ!\nThe food is delicious, and flavorful. i tried the fish curry and it was MmmmMM! Service is good and everyone seems to have a smile on their faces. overall a satisfying experience. \nI would go there again and i would take my friends. its that kind of place - good food + good company = an evening well spent. \n\nNow go book your flight to Nepal!", "author": "Nabil B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-26", "description": "I met a taxi driver last year that told me the best place for Nepalese food is Little Nepal....don't ask me how I remembered this after all that time.\n\nI guess, if I'm not traveling there directly, I want to at least experience the food by getting a taste of it here in SF.\n\nWhat a nice surprise.... it was a very refreshing experience the moment you walk in the door with bright colored walls and a nice warm feeling to it.\n\nI too noticed the music which sounded like Gregorian chanting and was quite soothing and created a nice ambiance for our evening.\nAgain, it wasn't crowded so it felt very relaxing inside.\n\nI ordered the Jhinge Machako Tarkari combo which came with the nan and the other side vegetable and side sauce.   The prawns were very fresh and the dish was very flavorful!\n\nI also ordered the Mango shake (not the juice), which is pretty much like the Indian lassi drink and was quite delish!\n\nI thought overall the food was reasonable and staff were friendly although as my 'date' indicated in his review, she forgot to bring his order.  Maybe English wasn't her first language...all the more to make the experience truly authentic!\n\nIts in Bernal heights and it seems like a quaint neighborhood but a bit far  to go when coming from South of Market.\nStill I'm glad we went to check it out.  I feel good that I honored my words to a taxi driver and went to check it out!", "author": "Ahnee M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-01-15", "description": "We have ordered take out from this restaurant for some time, in our attempt to support local business. Recently, not only did they make a significant error in our order, the portions we were given in the dishes we received were relatively far less than before. The expense of the food did not jive with what we received. When we attempted to discuss these issues with them, they were dismissive and rude. Sadly, we will not order from this restaurant again.", "author": "Diana A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-09-07", "description": "Ahh! Little Nepal! So many good memories.\n\nDiscovered this a while back and every time I find myself in that neighborhood, a dinner is mandatory!\n\nPROS:\n- Food is great, authentic (I've been to Nepal and its pretty close), well priced, very flavorful, simple, rich and umm umm good!\n- Service staff are so very friendly that you almost hate asking for the extra glass of wine\n- Atmosphere is comfortable, homey, love the music they're always playing and its attracts a good crowd\n- Go there enough times and they remember you and where you always sit (my fav is by the window)\n- The platters are great and the fact that you can share from the same plate is great (I'm India... part of growing up)\n- I'm always very calmed and \"Zen\"d out when I'm there... could be the company as well!\n\nCONS:\n- I live far away from Bernal Heights but that makes it all the more special each time I come here every two weeks\n\nOVERALL:\nLove it. Give it a try anytime you're in Bernal. If you like flavorful, spicy, rich food that is no nonsense (the kind where ALL the effort has not been put in the icing!), Little Nepal is great.", "author": "Amit S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-09-17", "description": "Tried this place finally.  It was alright, nothing special, in my mind.  The food is just like Indian, with some Chinese influences.\n\nWe tried tandori lamb skewers for appetizers (with puffed rice), which wasn't too bad.  The portion was generous, but the meat seemed a tad undercooked.\n\nFor the main entree, I ordered the chicken and radish and my friend ordered the mushroom dish.  Both were tasty.  I got the combo, which came with an assortment of small things (daal, vegetable curry, hot sauce), in addition to the rice and bread.  The bread was delicious; that's what really stood out for me.  Dipping it into the chicken curry sauce was heavenly.\n\nSo no big shakes.  Worth the trip up to Bernal Heights?  I live here so it's no big deal.  For others though, I guess the novelty of trying Nepalese cuisine would be worth it.  At least once.", "author": "Ramon C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-12-15", "description": "Seriously the best tandoori chicken I have ever tasted!! Everything is so fresh and spiced so good. Friendly staff and oh man I'm going tonight!", "author": "Scottie L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2006-05-20", "description": "My boyfriend and I drove to Cortland last night looking for a new restaurant to try. We stumbled upon Little Nepal and decided to give it a try. We started with the Himalayan Momo. We didn't know what to expect, so when we saw the appetizer, we both looked at each other puzzled and said \"oh... pot stickers??? with curry sauce?\" We gave it a try and it seriously tasted like what we thought. It was good, but not impressive. Next, we had the tandoori king prawns. The platter was sizzling and the prawns where huge. I thought they were good, but it certainly did not wow me. Then we had the curry chicken with tomato, onions and spices with rice and garlic naan. It was good, but nothing special. Oh.. don't order wine there.. NOT good.\n\nOverall, the food wasn't bad, but it was that good. I probably won't come running back....", "author": "Denise L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-09-28", "description": "I get an \"LP\" craving once every two weeks. This is far from the only Nepalese restaurant in the city- but it's certainly the nicest. The achar they serve with the momo's (dumplings) isn't anything I'd ever tasted in Nepal but its downright AMAZING. My absolute favorite is the Lamb/Ginger/Tomato Curry scooped up with garlic naan. The tandoori is quality as well. I haven't tried much else on the menu and I don't need to.\n\nIt's a nice neighborhood spot, tablecloths and all- a bit on the pricey side but the curries are big enough to share. Watch out for the waiter when he  pours the water- they drop it in your glass from 3 feet up in the air. \n\nItinerary:\nIf you're making a trek out to Bernal, grab a drink at Wild Side West, grab Moki's or Little Nepal for dinner and hit up Maggie Mudds for dessert. If you can still move after gastronomic nirvana, get lost on the hill before you head home.", "author": "Sita B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-03-19", "description": "N-E-P-A-L.  Viva Nepal, Viva Nepal!!!\n\nTen bucks to who can tell me what movie that's from.\n\nThis place is fan-fucking-tastic.  I've never had Nepalese food before, but I imagine this is one of the better places.  I got the Tofu Tarkari and the Khasiko Pakuwa.  The tofu was so creamy and good, but not heavy.  The lamb in the Khasiko was so tender and it was just simmering in the spicy sauce of ginger and spices it was sooooooo good.   I went back and got seconds of it before anybody else could.  Veggie Somosas are also extremely good and not greasy but perfectly crunchy.  \n\nDelivery was also really quick to boot.", "author": "Dustin S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-08-18", "description": "How can you not smile when they greet you with a warm, polite bow and a gentle \"Namast\"?\n\nMy little secret: I order the Poleko Kukhura   la carte for pickup.  In less than 20 minutes, I have delectable chicken, fresh naan, rice, green peppers and onions as a dinner that satisfies two at home with barely a dent in the budget.", "author": "Brent D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-02-14", "description": "Hmmmm... delicious! I had the combo plate with salmon, lamb and chicken: yummy! The lamb was a bit chewy, but the flavors were glorious :)\n\nWhy the 4 stars then? Well... there was a faint stale, humid scent, a bit moldy... boo! My nose could be overly sensitive, who knows? Also, it is now February, and they still have the X'mas decorations up... ooops!", "author": "Ange M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-15", "description": "Portions were small, meal was overpriced, but damn the food was good. We ordered four entrees, two a la carte (with naan and rice), two combo (naan, rice, lentils, stewed vegetables, and tomato sauce). I did not try the rice, but the naan was warm and buttery, perfect for soaking up the cool tomato sauce. The dhal was very good, a warm and well seasoned mixture of beans and lentils. The tandoori lamb was piping hot, just spicy enough, and tender without being overcooked. The chicken was a bit overcooked, although it was still moist and there was plenty of sauce to smother it in. Finally the eggplant was well cooked, neither rubbery nor disintegrating, and while  I'm not the biggest fan of it to begin with, it was tasty. I left Little Nepal with an empty wallet and a not quite full stomach, but I was glad to have dined on such a comforting and well seasoned meal.", "author": "Jeffrey L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-01-19", "description": "2 much expensive and waste of money.momo tastes like frozen dumplings from Chinese grocery stores.guys try some other Nepali restaurant rather then this", "author": "Kishan A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-11-01", "description": "I'm a fan of Little Nepal. I was looking for a nice, quiet, and casual restaurant for dinner one evening... and I'm glad I stumbled upon this restaurant. \n\nWe were one of the two patrons at 7:30, but the place quickly filled up afterwards. Started off with the pork momos. I was a little disappointed with what looked like potstickers, but the spicy chutney mix really made this appetizer better. For our entree, we order the Bhanta Tarkari  veggie curry combo and Khasiko Pakuwa combo - both were delicious. And the naan... little flaky bits of buttered heaven. \n\nThe service was great. The wait staff were very welcoming and attentive. Not once did my water glass fall below the half-way point without it quickly being filled up again. I will definitely be back next time I'm in the area.\n\nOne other thing.. the spoon was gigantic compared to the rest of the utensils. Thank goodness for Ikea.", "author": "R H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-10-24", "description": "After what I am told was multiple changes of ownership in the last year, this restaurant is once again one of my favorites.\n\nI used to eat here all the time when I was dating someone in the neighborhood. It was our go-to place for take-out or an easy & delicious dinner out. When we broke up, I wasn't around Bernal much so I hadn't been to the restaurant in a year or two. I always think of the food fondly though, so I went back with the new boyfriend sometime around June or July of this year. And the food was terrible. So awful, in fact, that I was embarrassed and confused about why I ever liked the place. I vowed never to go there again.\n\nThankfully, my boyfriend's co-worker is a Bernal resident & keeps up with the local news there. He let us know that Little Nepal had a confusing series of changes of management, a chef leaving, then the old chef coming back to purchase the restaurant. My experience had been so bad, that I didn't believe him at first (I looked up the dates of awful craigslist reviews & had my bf double check with his friend twice) - but finally we did decide to try it again.\n\nI'm so glad we did! The food was incredible again (mmmm... momos!). The funny thing is that through all of it, nothing else seemed to change. The menu is the same, the waitstaff is the same - but now, I guess, the food is back to being excellent.\n\nSo, I thought I'd just write up a review in the off-chance that someone else had the same experience of extreme disappointment at Little Nepal earlier this year. The old chef is back! The food is fantastic!", "author": "wanda k."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-02-25", "description": "I went to this place with no idea what I was in for, I didn't have a clue what Nepalese food tasted like and I had done zero research on Little Nepal as it was a place that my friend had been wanting to check out. The directions were a little strange coming from downtown, I think there is a much better route however that is not the fault of the restaurants only the driver and the co-pilot however we will blame it on google maps :)\n\nI was presently surprised when we entered the place, it was very clean and modern looking except for the Nepalese decorations. The staff was very friendly as they seated us right away, the first thing that caught my attention was the music which was slow chanting type music that made me feel like I was in a Thailand temple. \n\nThe menu looked surprisingly yummy and I had a hard time deciding what to get, I ordered the Kukhurako Ledo with chicken and my date had the Jhinge Machako Tarkari with prawns which were both very good. So you ask why only three stars? Our very nice waitress happened to forget the meal I ordered and only brought out my dates meal, we had to ask where my meal was and at that time they started cooking it. It wan't a huge deal as I got to eat a little of the other meal while I waited and it didn't take very long to get. \n\nOverall the price was decent, the service was fairly good minus the small hiccup, the location is a bit out there so I am not sure I would make the trip on a regular basis however I would reccomend this place is someone wanted to try out what the food tastes like or is in the area. Oh and by the way it doesn't taste all that different than some Indian food I have had.", "author": "Bobby B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-05-02", "description": "Love Little Nepal!\n\nI wish it were closer, so I could go there more often. I guess it does get me out of the neighborhood though... The staff is quite nice and patient with my insulting pronunciation of their dishes.\n\nThe last time I was here we ordered Mismas pakauda (deep fried spinach and onion) for an appetizer. It was interesting, very good and very fried. Maybe too heavy to start for some people. For an entree I ordered the Tofu Tarkari, which was really lovely. The Poleko Kukhura was also ordered and apparently very good as well. You can order your meal a la carte, or combo (includes Basmati rice, naan, lentil, mixed seasonal vegetables and Chutney sauce). Getting the combo is only a couple dollars more and the sides are great- -also provides enough food for a good take-home portion. I recommend having the Talus Pinot; it goes well with all the flavors.", "author": "Yes P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-08-10", "description": "My boyfriend once insisted on carrying my tandoori left overs for me while we made the trek home from the closest 24 stop -- what a gentleman. He spilled them all over Haight Street. I'll never have that chicken back -- you can't un-drop things.\n\nLittle Nepal is: Fabulous. Close to my heart. Worth taking the 24 all the way to Cortland (yikes). \n\nI love the interior here -- the blond wood and vaguely Himalayan decor. It makes me feel all cozy inside, which compensates for the cold wind that seems to constantly plague Bernal Heights. \n\nThe food is yummy and reasonably priced to boot. The servers are lovely, lovely people -- all of them. The food is just short of being a confident five stars, but I'm trying not to be a five-star-whore, so I'm sticking with four. I'd give it four and a half if I could. \n\nI like the radioactive colored dish with the silky soft tofu chunks (hmmm  can't remember what it was called) though the chicken tandoori is also memorable. Don't let your boyfriend carry it for you. \n\nGo to Wildside West (is that even what it's called?) afterwards for a nice cheap pint o' Guinness. You will be happy.", "author": "Beah B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-06-29", "description": "I moved to Bernal Heights about 6 months ago and have been making my way through all the restaurants in our new neighborhood.\n\nLast night we went to Little Nepal. The food was really really good - the tandoori chicken was succulent and perfectly cooked and spiced. They brought it out on this black cast iron platter that had been heated to like a hundred thousand degrees, sizzling and sputtering, a real show-stopper. Also the tofu totally melted on my tongue like little Himalayan clouds - I think it was the best tofu I've ever had. Yogurt on the side tasted like it had been made fresh, Naan bread, lentil soup were great, etc etc.\n\nI take stars off for the ambiance - the dining room was nicely decorated, but it was too brightly lit and I could smell someone mopping the kitchen during our meal (I have a thing about that). Never felt totally comfortable. Also it seemed a little expensive ($15 for our entrees) but in fairness the food was really good. \n\nAfter dinner we went home and watched the Karate Kid. What a great night.", "author": "Bart C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-09-03", "description": "Terrific service, relaxed atmosphere and excellent food best described as \"Indian-lite\". Delicious tandoori, right-sized portions and hospitality that was warm and welcoming.  Nepalese food, while hearty, won't make you feel like you've cleared the buffet table- but will reward you with a satisfaction second to none.  \n Similar to Indian and Pakistani food, but without the heat of Indian or the grease of Pakistani, this small, clean, charming restaurant is highly recommended. Cortland is probably one of the better 'main streets' parking wise, but give yourself some time.", "author": "Johnnie W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-05-11", "description": "This is really a fantastic restaurant.  When you look at it from the outside you think it looks fashionable and probably has good food, but a little too fashionable for the type of food that reminds you of your trip to Nepal.  However, when you step in you smell Nepal and feel a little like you are in a tea house.  They nailed it, and you haven't even had the food yet.  I felt so good inside that it didn't even matter what the food tasted like, but then I tasted the food.  The food is fantastic.  I have found that a lot of the times nepali/indian restaurants will control the taste of the dish simply through the curry.  However, at Little Nepal you could taste the flavor in the Lamb as well not just through the sauce.  The meat was well marinaded and the momo's were top notch.  If I were ever sophisticated enough to be able to open a Nepali restaurant in San Francisco this is what I would create.  I couldn't ask for anything more.", "author": "Harry B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-05-07", "description": "The appetizers are lovely and I only wish they offered tamarind sauce.  We enjoyed the vegetable momos (dumplings), vegetable samosas, mismas pakauda (pakoras), and lentil soup.  The menu is heavy on the Indian food, but is still delish.\n\nThe decor is really lovely, but not so comfortable.  The benches should have cushions for your back and the heavy wooden chairs make a terrible noise when scraped across the floor.  We arrived right when they opened at 5 and had to listen to the crush ice for five minutes.  Otherwise, the service was very attentive.\n\nNext time I would love to try to Alu Tama Bodi (potatoes, black-eyed beans and bamboo shoots).  Visit MaggieMudd (http://www.yelp.com/biz/RY3jZ3_jzj9eMXddYLN8uQ?hrid=yIm3y1Glwszyvkt7kWACFQ) for dessert.", "author": "Rachel R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-31", "description": "By far my favorite restaurant on Cortland Ave.  Food is excellent!  I've tried most everything on the menu, many which I had never had before, and was very pleased.  Staff and servers are very friendly and attentive.  The ambiance is calming, with Nepalese music playing in the background, and lovely art on the walls.  Small restaurant, which can get noisy and feel a bit crowded, but the vibe is so very relaxing in Little Nepal that I've never been bothered.  If so inclined, you can call an order in and pick it up.  Great place.  Check it out!", "author": "Lupe H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-04-14", "description": "The food is just mediocre. $18 for the equivalent to chicken satay is way overpriced. The chana saag is watery. The interior is meh. Friendly service.", "author": "Sophia L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-02-26", "description": "The flavors and dishes of Nepalese food are akin to Indian cuisines (at least from what I experienced at Little Nepal). The significant difference that I noticed is that nepalese food is a tad bit on the not so greasy side. \n\nLittle Nepal is awesome. I was introduced to this nifty little treasure by my co-worker on a friday evening. The next day, I had returned with some friends. Yup, you read that correctly - it was that good for me to come back two consecutive evenings. \n\nThe service is great. Space is limited, so I expected to have to wait for a table for hours. However, with a party of 6, we were seated within 15 minutes. \n\nThe food is wonderful. For appetizers, I've had the momos and samosas. Momos are aight, at best, sorta like nepalese pot stickers. The samosas are crispy burst of curry-flavor goodness. For the main entrees, I've had the Prawn Tandoori, Chicken Tandoori, and the Chicken Curry dish. All were intergalactically mind-blowingly delicious-alidocious! No, I never/ never had curry like this before. \n\nGreat place to visit for a delightful dinner with friends or a date.", "author": "MrBoomBastic .."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-20", "description": "Found Little Nepal on GrubHub -- it was listed as a restaurant that delivers to my neighborhood. I decided to order from them, thanks to the favorable reviews on Yelp. I already knew I'd be spending a little more money than usual for delivery, but it was surprisingly expensive for two people. The delivery took well beyond the estimated 45 minutes to get our food, which had, in the meantime, gone cold. Worse, the samosas had been forgotten from my order. I phoned the restaurant; the man who had taken my order remembered me. He said he would cancel the charge to my credit card and reprocess for a lesser amount. He even phoned back after he'd done so.\n\nSo now you know everything that went wrong. I wasn't especially angry or inconvenienced, and honestly, the gentleman at Little Nepal was courteous and helpful.\n\nIt was easy to see how the samosas had been forgotten; we'd ordered combination meals, and that made for several containers of food. Each combination dinner comes with sides of rice, naan, chutney, vegetables, and soupy lentils. Wow! I'm tough to please when it comes to rice and naan, and this was perfect.\n\nThe vegetables were wonderful, and the lentils were out of this world. We split orders of Kukhurako Ledo (that's Tandoori chicken) and Bhanta Tarkari (that's a spicy eggplant dish). The Kukhurako was, for the price, a little on the dry side, but it was delicious. The eggplant dish was stellar. Eggplant, of course, has a naturally spicy, slightly nutty flavor which, in this dish, was enhanced and complemented by subtle spices. Mmm! I'm a believer.\n\nWhile I'm not opposed to having food delivered again, I think next time I'll make the trip out and visit the restaurant proper. Really wonderful food; highly recommended.", "author": "Jenn X."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-02-12", "description": "I have been to this place twice with some good friends and I just loved he atmosphere there. The people there are VERY friendly and funny. I just had a GREAT experience over all. The food was quite delicious with enough flavor even for me (flavor snob here)\n\nI would highly recommend you go with some friends and enjoy the food.", "author": "Gody J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-11-25", "description": "what can i say about this place that hasnt already been said.\n\nHow about ...I had my 24th birthday in this joint 4 years ago.  I have been eating here since i first discovered Bernal Heights, which can be a review all in itself..(note to self: find a way to review bernal heights)..anyway,  the food here is amazing.  So much flavor, it felt like there was an explosion going on in my mouth.  Seriously.  So, i would reccomend the chicken soup, especially if you are not feeling well.  Its spicy and it will open up your sinus passageways in no time.  the curries are delicious, the tandoori is very good too.  I have eaten here over 20 times, and i have never been disappointed.", "author": "Ariane M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-04-13", "description": "We had a good meal here. It's a small, quiet place that's somewhat off the beaten path. Definitely recommend stopping by.\n\nFor an appetizer, I would definitely recommend the Little Nepal Special Chhoila. So friggin' good.  It looks like tandoori chicken, but has this strong (but not overpowering) Dijon mustard taste.\n\nPlus, it's cool that they say \"Namaste\" when you leave. This probably means that I have been watching too much \"Lost.\"", "author": "Mark G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-07-06", "description": "This place is my favorite South Asian place in San Francisco.  Better than any Indian restaurant in the City.  The restaurant is a nice little space with helpful service, but let's talk food.\n\nWe have a few faves that we stick to.  First off are the lamb samosas.  Nice, rich and bursting with flavor.  For mains, we always get either kukhurako ledo, kukhurako pakuwa or tofu takari.    Yum, yum, yum.  The tandoori is also pretty good.  \n\nIt's not cheap but it's well worth it.  Stick with the ala carte which comes with naan and rice.  We never finish all the naan!\n\nWe get delivery most of the time.  There never is a long wait like Pad Thai.  You can get your food delivered in usually 30 minutes or less.  \n\nOne of the best reasons to visit (or live) in Bernal.", "author": "Michael E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-09-02", "description": "Four stars.  I like Nepali food.  I sometimes have a craving for momos.  Momos are little dumplings, sort of like rice buns or potstickers I guess would be the best way of describing them.\n\nIt helps if you recognize that geographically Nepal is located south of Tibet, between China and India.  So the cuisine is a mixture of Chinese and Indian.  Is it spicy Chinese or bland Indian food?  You be the judge.  \n\nI am sorry they don't have Jand, which is a homemade rice wine kind of like a unfiltered Nigori Japanese Sake, but a bit more sweet-sour and not as potent.  They have this at Taste of the Himalayas, and I enjoy drinking this with my food.\n\nWhere else are you going to get chow mein, daal, and naan all in one place?  The food is well prepared, tasty, and the price is reasonable.  Okay, it's not French Laundry, but for what it is, it is a surprisingly elegant restaurant with good food.", "author": "Adrian B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-10-17", "description": "A friend of ours who use to live in the city drove up from SM to take us to her favorite place in the city, Little Nepal. You know when someone tells you a place is her fav, you let her order--do not be stupid, go with the Master. Well we did, and we rejoiced in our decision.\n\nShe ordered a nice array of items for all the different tastes, but my favorite was the Tofu Takari--it had a nice crispy outside and a creamy velvet inside--truly the best tofu I have ever had--and yes I am a meat eater, but considering a 12 step program if all vegetarian food tastes that good. \n\nWe also had a chicken korma like dish; spicy prawns, and the combo set up. This place was great--but I have to say this, but it is not a dis, I prefer Hotel Kathmandu. The sauces are lighter there, but damn that tofu makes my statement a hard one--but it still gets 4 stars!", "author": "Deborah S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-11-26", "description": "Yummy. I'd give it 4 stars but the service was a little cold. We had to move because they put us right near the kitchen (when the restaurant was fairly empty) and then looked a little grumbly when we asked to move.\n\nBUT . . . the sizzling chicken tandoori was the best I've had in SF. Very tender and spicy, with a dipping sauce that was amazing. I would definitely go back for the food.\n\nAmbiance and service . . . .hmmm, not too much of a deterrent, but not great either.", "author": "Elizabeth S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-05-02", "description": "3.5 stars:\n\nI had a really nice dinner at Little Nepal this week.  My gf & I hadn't been here in ages, so we decided to do the 2 person set menu ($45, though with two large beers, tax & tip it was $75.)  It didn't look like a ton of food, but we still came home with a small lunch for each of us.\n\nThe set menu features the three best known Nepalese appetizers: momos (4), samosas (2), and their special chhoila (\"barbequed lamb or pork marinated in mustard oil, with garlic, ginger, and chooila masala.)  The Chhoila turned out to be our favorite dish of the night, though the first piece of lamb I tried was so tough I had to spit it out.  The rest of the dish was fantastically flavorful - the chhoila masala is a great compliment to the taste of the lamb, and the whole thing is deliciously garlicy.  The momos and samosas were fine, but not as good as I've had at other Nepalese/Tibetan restaurants.\n\nThe entrees chosen for the set menu don't seem to be the best pairing: tandoori chicken and alu tama bodi - black eyed peas & potatoes.  Both were tender and savory in their own right, but I'm not sure I'd order them together again.  (It's worth noting that the chicken was still incredibly moist when I reheated it for lunch the next day.)\n\nThe meal finished with tiny dishes of sweet but soupy rice pudding.  It was tasty but a bit like drinking (coconut) milk with one's rice, rather than eating a firmer pudding.\n\nOverall, a nice experience.  I wouldn't come here all of the time as the prices seem a bit high for the amount of food and occasional lapses of quality.  I have to agree that the IKEA silverware is doing nothing for this place (some pieces even look like they've been chewed up in the bottom part of the dishwasher) and my gf told me she had once cut her mouth with the spoon when eating the lentil soup here...", "author": "Holly B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-08", "description": "I went here a while ago and enjoyed both times I have been. The food was more spicy by default versus other Indian / Nepalise restaurants. Already a big plus. \n\nThe service was friendly and the decore nice. We had a salmon dish and a potatoe dish. We left very full and happy. :)", "author": "Benjamin T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-08-22", "description": "Two words:\nThe Best.\n\nI have to say this place soothes my soul everytime.", "author": "M C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-02-26", "description": "I love Nepalese food! The only reason I go to Little Nepal is to either take a friend and to have Momo's! Momo is very similar to dumplings, but much better! If you go to Little Nepal, try their Momo's.", "author": "SF S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-11-12", "description": "This is a cozy little restaurant in Bernal Heights, great for a date\nwith warm exotic choices.  The staff is friendly, and the food is divine.", "author": "Ingrid N."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2006-03-17", "description": "Little Nepal's claim to fame is being the first and only Nepalese restaurant in San Francisco. It's a lot like Indian food. Their lentil dal and mustard greens tarkari are tasty and spicy. But I will forevermore remember them as the creators of a really grody dish I had there recently. It was described on the menu as tofu and green beans in a light tomato cream sauce with ginger and garlic. It came to the table as a fluorescent orange glob. The tofu was the soft variety (usually used to make sauces), which doesn't absorb any marinade or sauce, unlike the firm stuff. The tofu had a tough exterior and a mushy bland taste. The sauce must have been almost all oil. I couldn't even taste the tartness or sweetness that a tomato sauce would impart. Every bite tasted like fat. Fat is supposed to enhance flavor, not be flavor. \n\nThe ambience is nice and the prices are on the high side. Food is hit or miss.", "author": "Wendy C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-05-04", "description": "What a charming night... 6 of us went for dinner, and got the 6 person combo. First came out two appetizers, a pot sticker like creation called a Himalayan Momo ... man, I would go back in a moment and eat an order of those alone. Totally fabulous- great taste, texture, everything. The other appetizer was a Pakauda - deep fried onion and spinach. Deep fried anything isn't my favorite thing isn't normally my thing, but I still went back for seconds :)\n\nFor entrees, we and a tandoori chicken that was surprisingly tender. The lamb that we had was perfect- rich, and not too gamey.  The salmon was perfectly cooked.  In the end, everything that we had was totally delicious. The staff is sweet and warm, and they helped to make for a great evening for friends.", "author": "Misha M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-09-07", "description": "Gorgeous interior, spacious bathroom, great decor, atmosphere, friendly service.  Authentic music.\n\nWe ordered all vegetarian things.  The tofu dishes were decent, the eggplant dish was amazing taste-wise, but i'm weird about textures and it was a little too mushy for me.  The combo is well worth the $12, and so was the carafe of house red wine, which was cheap and tasty and got us a little tipsy, up there on the big hill.  Definitely a cute date place, and for sure try the Momo appetizer.  Along with it being my nickname, they are curiously delish potsticker appetizers which are filled with a curry-samosa like filling.", "author": "Kyle T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-17", "description": "I am so glad I found this adorable little neighborhood gem! I came on a Saturday night with a group of people and they were easily able to accommodate us. We ordered the group tasting menu and were very pleased with the variety of options. It was so much food and so delicious that I ate myself to the point of not being able to walk.\nI'll be back.", "author": "Angela N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-08-22", "description": "This is by far the best Indian food that we've had in San Fran over many years of sampling. This place is well worth the drive and delivers an authentic, high value, mouth watering experience. Our meal here set a new standard for us against which all other places will be measured - will be back for sure. Wish it was closer!!", "author": "M L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-01-31", "description": "Loved this place. Service was friendly and efficient and the food was tasty. We found all of our apps and entrees to have a light, fresh flavor that wasn't weighed down with super heavy/greasy sauces. There was definitely a noted care in the way the food was cooked and presented.\n\nWe ordered a combination dinner for two and there was probably enough for three. The presentation plates were a pleasant surprise. Worth checking out. Dinner for two with wine and beer was $60 and we had enough to take some home for lunch the next day.", "author": "Richard F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-09-12", "description": "This place is in Bernal heights area a nice little area of Sf that is uncomfortably close to the projects off Alemany. Nice decor, cute  and intimate. That was the good part. the food itself was also nice and tasty. But the problem I have with this place is what I feel about the legendary Burma Superstar...the food is too pricey, and the portions small-ish. \nThe momo (chicken dumplings) was nice, but nothing I haven't tasted before. The tandoori chicken was very moist and tender, but there were only four pieces! At 13 bucks, you better have a whole chicken ready for me. We had the lamb curry, and again, it was tasty, but for the price, I could have gone to any old thai place and get it for cheaper. the Salmon dish was also great, but too little portions! I know i am sounding like a pig, but in a City where there are many great Asian places at cheaper prices and larger plates, I can't say that I will be coming back.", "author": "Jerry C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-07-12", "description": "The first (and only?) Nepalese restaurant in SF.  The place is real cozy, but feels clean.  I say feels, because there are a few things, like hanging drapes that are very dirty when looked at closely, but the place feels modern and clean for the most part.  We had the chef come out and give us his personal recommendations, so we assume we had the best the place had to offer.  \n\nWe started out with the Himalayan Momo for $5.95.  These are Minced Chicken, Pork or Vegetable wrapped in flour dough and steamed.  Served with chutney sauce made of sesame, chili and tomato.  These are basically pot stickers.  You get quite a few and were quite good.\n\nFor Entrees we got a Kukhurako Ledo Combo for $14.40.  This is Boneless chicken from clay oven (Tandoori) cooked in light cream, cashew nut, fresh tomato sauce, garlic, ginger and spices.  This was our favorite dish.  We also got the Mismass Poleko Masu combo for $17.95.  This is Mixed Tandoori chicken, Atlantic Salmon and lamb marinated in olive oil, garlic, ginger and spice.   This is good, but kind of bland.\n\nAll in all I would recommend this place if you live, or are driving through, Bernal Heights, but I wouldn't drive across town for it.", "author": "Pele N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-11-12", "description": "The food here is pretty tasty and the prices are OK, so I definitely recommend trying this place if you're local. Get the combo versions of the dishes; they have some tasty little side dishes and a really spicy dip for the nan it comes with.\n\nIt's a tiny place, with low-key functional decor, not trying to be too fancy. Good for a meal with a friend, not so good for a date if you're trying to impress someone.\n\nUnfortunately, the waitresses are a little lacking in personal charm. OK so my friend and I took a surprisingly long time to figure out what we wanted, not being very familiar with the menu, but the display of impatience from one of our waitresses made us feel like we were being a pain. We also had communication problems with both of them in terms of trying to get our questions understood and answered clearly. If they can brush up their customer interfacing, I'll give them a 4.\n\nV", "author": "Victoria B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-02-12", "description": "Food was fresh and delicious\nTandoori Chicken was so tasty.\nLentils, veggie curry - huge sized portions", "author": "Pug P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-02-23", "description": "What should we get for dinner? \nWho delivers?\nI don't know, I'll look on grub hub and see what I can find...HEY Little Nepal Delivers!!\n\nGreat food and now we don't have to go up to Bernal to enjoy it.", "author": "Jen S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-03-17", "description": "Great little asian place. Very veg friendly but good meat, too. I'll save you the trouble of reading other reviews: there are no bad reviews. Even the three star ones read like four stars. Another gem on Cortland.", "author": "seth c."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-21", "description": "De-lish! The Kukhurako Ledo is off the chain as are the vegetable samosas. And the Naan...oh the naan! Truth be told, we have only ordered delivery so I cannot comment on table service. This is our favorite take out place as of late!", "author": "Shannon C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-07-12", "description": "This is a great little restaurant!  I can't wait to go back.  The food is DELICIOUS and wait staff is very friendly and attentive.  I really love the lamb Samosa appetizer, spiced and minced Lamb wrapped in thin layer of flour and fried crisp. It is served with mint sauce.  I also love the Kukhurako Ledo, boneless chicken from clay oven (Tandoori) cooked in light cream, cashew nut, fresh tomato sauce, garlic, ginger and spices.  Yummy!  If you haven't been to Little Nepal, you should definitely give it a try.", "author": "Natasha G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-10-31", "description": "Not different from Indian food. Dinner was pricey for the mediocre food served. Same base sauce seems to have been used for all dishes.", "author": "Whiterock R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-04-07", "description": "I love everything at this place. For details, see someone else's review.  \n\nWhat I also enjoy is the contrast between the \"Namaste\" atmosphere and service of this Nepalese-owned-and-run place, and the \"Whaddyawant?\" atmosphere and service of the Nepalese-owned-and-run Pizza Express next door.", "author": "Eggy P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-08-16", "description": "I had never been to a nepalese restaurant before and our server helped me to pick out an entree, which i appreciated.  she was excellent and our food was hot, fresh and delicious!  i ordered the chicken dish in a tomato-based sauce with ginger, onion, garlic and spices.  my date ordered tofu with green beans in a really yummy light cream sauce.\n\ni just have a few petty complaints:  i think that the portions here are pretty small considering the prices that they charge, and i didn't like that my date's plate was picked up way before i had finished eating ( i felt really rushed, which i think is a big no-no in fine dining ).", "author": "Charly G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-09-28", "description": "The best (read: only) Nepalese cuisine I've ever had. This is the kind of place you take your parents when they come to visit and you don't want to go somewhere too nice, but pretty nice.\n\nThe entrees are reasonably priced, and for less than $2 more you get the full meal with rice, naan, veggies, lentils and sauce. They have quite a few good sounding vegetarian dishes available, two of which I tried.\n\nWhen you're done, go next door to MaggieMudd for dessert.", "author": "Tyler J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-07-24", "description": "I wanna rate this place higher.  I really do.  The food is stellar, the place is cute, and the prices aren't bad. But damn, we got AWFUL service.  Ignored for ten minutes (seriously). No apology when they finally acknowledged us.  They gave our appetizers to another table, then didn't apologize to us for bringing them out, get this, AFTER our entree.  They were kind of surly the entire time.  Get your shit together, Little Nepal, and I'll be back, but as long as you're this bad, I won't ever consider it again.", "author": "Adam T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-04-02", "description": "Yet another thing that makes me happy to call Bernal home.\n\nLittle Nepal is cute little neighborhood restaurant that serves great food, offers great service and makes you feel very welcome.", "author": "N K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-02-05", "description": "EVERY time I'm in the neighborhood, I head to Little Nepal.  Tandoori Chicken is yet another addiction of mine.  My god, must I continue to love only one dish at each of my favorite restaurants??  I guess the answer is a resounding yes.  Tho' I feel better now that I noticed that my better half always orders the eggplant curry! Ha!\nOK, first it has a small, beautiful, modern, warm subtle interior with a very pleasant staff and a truly wonderful owner.  I've known him since he opened up the place.  He actually WAS a Sherpa!  I can't even imagine walking up Potrero Hill! \nThe food is always delish and the flavors are delightfully different, yet most tasty!  It's always fun when your taste buds discover something new and delicious!\nAlright, I'm getting too hungry describing this place, just go there and enjoy it.", "author": "doug b."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-05-18", "description": "I had come here a couple of year ago and remembered that the food was delicious and the service great. I went again last night and it was even better than I remembered. We had the set meal for two, which came with three appetizers, two main courses, and a little dessert, all for $44 total. The appetizers were delicious, but by the time we finished them, we were pretty much full. I don't know how two people are supposed to finish all that food! The main courses were equally tasty, and since we brought most of it home with us I'll have the pleasure of eating it again tonight! The dessert was a sweet little bowl of creamy rice. Nothing spectacular but a nice end to the meal. \n\nThe service was really worth noting. Our waitress was so attentive and sweet. She really paid attention to little details, such as asking us if we were finished before taking our plates and whether we needed our take home in two bags or one. All in all it was a great experience!", "author": "Jen R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-07-14", "description": "First time having Nepalese food and it was great!  A lot like Indian food (which makes sense given the proximity), but I found that the food wasn't as \"spicy\".  The samosas were great and the meat dishes were cooked perfectly.  The restaurant itself is very small but cozy and the staff was really attentive.", "author": "S R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-11-16", "description": "Thanks to the Tibetan monks sacred dance and song performance at Herbst Theater, I looked up this Himalayan place to eat for our small group of three. Sure glad I did.\n\nThis is the second Himalayan place I have ever eaten at and the first one I have liked. San Francisco's only Himalayan restaurant is holding up their end quite well. I'm very familiar with Indian food and this place did a great job on the meats, they were  tender juicy and smoothly consistently spiced yet mild.  We shared appetizers vegetable samosa, chicken Choila,and  lamb Kukhurako Bhutan. Our favorites were the last two - chicken choila and lamb K. Bhutan. \n\nHowever, to enjoy the naan, as well as rice and some vegetable side curries (rather unremarkable) you must order an entree and get it combination style. I read the raves here about the naan so I tried it and wasn't sorry. Delicious with the chicken Ledo!  But who can eat all that rich sauce??\n\nThat would be me. We shared two entrees, the super rich creamy chicken kukhurako ledo combination (so I could get naan with it),  and tandoori combination of salmon, lamb and chicken, called Mismas Poleko Masu. \n\nWinners were both entrees! \nThe Ledo is so darned rich that you cannot eat it with rice, you fill up too fast. But it makes superb leftovers the next day - out of this world in fact.  \nPoleko Masu: Of the three tandoori-cooked meats, salmon was the first to disappear, lamb next, then chicken. Truly a meat eaters platter.\n\nI reccommend the lamb anything and the tandoori anything. Get combination style so you can taste it all, enjoy the buttery naan, and have enough to take home.\n\nIf you just get appetizers, you will fight over who gets to take the Choila and Bhutan lamb home. Better get your own. \n\nWe drank nonalcoholic beer to help it all go down and mint teas to help digest it all. Absolutely no room for rice pudding.\n\nI dont usually eat that heavily but it was mild enough and greaseless enough that I could. DELICIOUS. After a short walk, you will be in the mood for a little dessert.\n\nBeautiful courtesy and excellent service. Peaceful clean and  modern ambience. A popular place, a few families with kids, and some Indian couples. \n\nThis is a good place to introduce people with varied palates and spice tolerance levels to Indian style food because there is next to no chili. Flavorings are mild and balanced. My near vegetarian midwestern friend broke rank and devoured the lamb and my sushi-all-the-time manly friend devoured the tandoori salmon, chicken and lamb all with naan.\n\nStreet parking is challenging but possible. Worth the effort to find parking!", "author": "Nan L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-04-04", "description": "Tried the tofu tarkari and chow mein noodles on the latest visit. Both were surprisingly delicious. The tofu tasted like nothing I've had before, and the chow mein was addictive. Not even remotely chinese in flavor or spicing, but I'm a fan!", "author": "Purnima M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-05-15", "description": "Cute ski-lodge ambiance but food a little suspect. The chicken tasted off, like mothballs! Limited menu (mostly variations on 4-5 basic dishes) with weak desert options. Despite enthusiastic staff, really slow service given the small size of the restaurant.", "author": "Sempro S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-04-16", "description": "I love this place, great ambiance, good food, and decent prices. If you're looking for a good selection of vegetarian stuff, they've got that too. I think I could totally be fine doing a tapas kind of thing where I just fill up on appetizers. I met some old friends there and really enjoyed it.", "author": "Aaron W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-03-24", "description": "Yummy food - probably the best samosas I've had - tandoori lamb and a potato and black-eyed peas dish were really good too!  I would definitely go back.  Waitstaff was really friendly.  Re a previous reviewer - they told me they were Hindu's not Buddhists - but there's a Buddha on the shelf!  Nepali's are pretty bi-religious that way, though...", "author": "Ravi C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-03-19", "description": "Holy smokes!  We finally got around to ordering take-out from here the other night, and my socks were officially rocked.  Hands down the best naan I've ever had.  You may say to yourself, \"Naan?  That's just bread!\"  But I'm telling you, I could be easily persuaded to eat Little Nepal naan every meal for the rest of my life.  We ordered the Kukhurako Ledo (combo) and some samosas and it was plenty of food for the both of us.  My guess is that everything on the menu is just as delicious, but I will honestly probably order the exact same thing next time because it was so good.  I'm telling you, go there.  Now.  RIGHT NOW!", "author": "Genevieve T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-14", "description": "At the risk of making my new favorite East Asian spot very popular, I am highly recommending Little Nepal. We dined at Little Nepal for the first time on a very slow Sunday evening, so I can't comment on service or food quality on a busy night, but on the night we visited, the staff was very friendly, the courses were timely, and the food was super tasty. \n\nLittle Nepal is the best of three Nepalese restaurants I have tried so far. If you have not had Nepalese food before, the flavoring and spices will seem similar to North Indian cuisine and equally as savory. However, Nepalese food is lighter on oils and dairy, so I don't find myself as uncomfortably full as when I have eaten a number of Indian dishes. In addition to a number of excellent vegetarian offerings, Little Nepal serves chicken, lamb, prawns, and (okaaaay) Atlantic Salmon. There is a dash of Chinese influence as well - Little Nepal serves tofu and a chow mein dish. \n\nWe stayed vegetarian. The samosas were best of show and the Himalayan Momo (steamed dumplings) were wonderfully light, savory, and served with an excellent medium-spicy chutney. \n\nWe ordered three entrees for two people (one ala carte and two as combination dinners with naan, vegetable stew, and chutney. That was plenty and we arrived with an appetite. The mustard greens (Saagko Tarkari) were heavenly, and the potato/blackeyed peas/bamboo shoot (Alu Tama Bodi) and mushrooms (Chhayau Tarkari) were very good. Washed down with several tall bottles of Indian beer, we walked out of Little Nepal for $20 each before tip. \n\nThe decor is modern, but nicely done. We were very comfortable on a night when the fog was blowing in sideways down the Alemany Gap. Tell your friends (or keep it to yourself). Little Nepal is very, very good.\n\nFour stars instead of five not for any fault, but merely because this is a neighborhood family restaurant and as good as it gets in that category.", "author": "Scooby S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-09-17", "description": "This is just what I imagine a dinner at a cool base camp on Everest  would be like, minus the discarded oxygen tanks and frozen bodies. The first thing I noticed as I walked in San Francisco's first Nepalese restaurant was the prayer flags adorning the walls. We were seated immediately by the hostess and received prompt but not overbearing service all night long. The food was excellent and I had a nice little sweat going on by the end of the meal due to the degree of spice of my dish. My order came with bread, rice, sides, and sauces. I was immediately tempted to discard the utensils and dig in with my hands. I finally succumbed to my urges about a quarter of the way into my meal, which made for a better dining experience. Worth making your way into Bernal Heights for.", "author": "Bucky K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-10-06", "description": "So, Bloopie loves this place but she's been to Taste of the Himalayas, so I'm surprised.  The pork momos were disappointing because they tasted a bit too much like thick skinned pot stickers.  I've definitely had better at Taste of the Himilayas.  I had the Khasiko Pakuwa (lamb cooked with fresh tomato sauce, garlic, ginger and spices) which was pretty good with fresh pieces of ginger.  I could live off this restaurant's naan.  They also make this awesome chile sauce which my roommate actually took home.  The service was great - our water glasses were always full but the food was just good not great.", "author": "Elena S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-06", "description": "Great food and really interesting.  Nepalese food is similar to Indian, but unique in its own way.\n\nI like the Khasiko Masio Masu  and always get the combo.  The lentils and chutney are delicious.\n\nThe atmosphere is cozy and warm.  This is a great place to go on a foggy SF night.", "author": "Jimmy C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-12-27", "description": "Himalayan and Nepalese authentic food.  I had the tandoori chicken comes with lentils and naan  and rice. Pretty yummy. Atmosphere was great, service was good.  Great dining experince. I would come again and recommend to others if you want to try something new", "author": "kate b."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-05-22", "description": "Yummy!  This place is delicious.  We started with the samosas, which was thick fried pastry flour filled with lamb and peas.  They were huge and heartier than Indian samosas.  Then the ultimate: Kukhurako Ledo which is like Chicken Tikka Masala but better.  I don't know why...it just is! Then the Khasiko Masio Masu: lamb curry with peas and mushrooms and Alu Tama Bodi: curry with potatoes, black eyed peas and bamboo.  I suggest ordering A la carte because each entree comes with nan (which was the best I had ever had) and rice.  The combo plates come with lentil soup and mixed vegetables in addition to the nan and rice but the small amounts are not worth the extra money in my opinion. Namaste.", "author": "Stacy R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-09-03", "description": "I am glad I discovered Bernal Heights. This place is super yummy, but I think we may have ordered too much food. Their combo plates are pretty large and I think my boyfriend had two days worth of leftovers. I will definitely come back here to over eat.", "author": "Naomi C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2005-08-12", "description": "The menu borrows elements from Indian, Thai, and Chinese cultures, with familiar curries, stir-fries, and sizzling tandoor platters the dominating dishes. The spicing is subtle, perhaps too much so for those expecting a bit of fire in the food. Himalayan momo (steamed pork dumplings) and mismass pakauda (spinach and onion fritters) make great starters. Naan and rice are perfect additions to any main course, but skip the lentils and vegetables, which tend to be overcooked and uninspiring. Never a fan of soybean curd, I need to go back and see if the tofu takari recommended by Kristie will warrant the addition of another star.", "author": "Gourmet G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-07-02", "description": "Good stuff.  We had the momo which was yummy, then tandoori chicken, and he had some kind of lamb (don't remember the dish name) The tandoori chicken was fantastic.  Will definitely go again.", "author": "Rodney P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-02-06", "description": "Suffice to say, we just ordered from them two nights in a row. \nFirstly, they are SO nice. \nSecondly, the delivery is speedy. \nAnd lastly... the food is sooooo good. The Kuhurako Ledo is my favorite dish. If you have never had Nepalese before, compare this dish to Chicken Tikka Masala only the chicken is more moist and the sauce is better. The naan is chewy and sweeter than most people are used to, but nontheless super yummy. \nMy only teeny tiny complaint (if you can call it one) is that the portions are not always consistent. In terms of entree, you always get the same size tupperware. However, when it comes to rice, lentils, and mixed veggies... sometimes we don't get the full-size. \nAnyway, super great. If you like spicy, make sure to ask for Chutney. \nEnjoy!", "author": "Nicole F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-11-17", "description": "Mmm....so good!  One of my favorites restaurants in SF.  Great food, good sized portions, friendly staff, and a buy one get one free coupon in the entertainment book too!", "author": "Jo M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2005-07-10", "description": "It's a cozy little place, and the service is friendly.   The thing about Little Nepal's food is that it's reminiscent of Indian, Thai, and Chinese food, but comes across somehow as a more watered down version of the originals.  It was fun to eat there and say I'd done so, but I was left wanting more vibrant Indian food.", "author": "Andi T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-06", "description": "All of the curries that I have had here are excellent, but some of the appetizers lack seasoning. I would recommend the black eyed pea and bamboo shoot curry.", "author": "Matt L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-01-17", "description": "a big disappointment, being a nepali myself, i was pretty excited to come to this place infact i have been waiting for days so i can just go and try their food, thier authentic nepali food phrase really caught me. I have been to all the nepali restaurants in the bay area, i miss my country food and if i hear any new nepali restaurant i get really excited. This was one of the worst Nepali restaurant. I entered inside the restaurant . it is small and comfortable, the ambiance is ok. I went there early dinner so we were the first table, being a nepali my eyes went to the momos  which is pretty famous dish from my country. I then ordered  veggie momo as appetizer and the salmon fish curry. The momo was such a big disappointment.. the wrapping was horrible, It was breaking up and the vegetable inside it had no flavor it felt like blended mixed steamed vegetable, the chutney was a very big disappointment too. i make momos at my house and i am not one of the best cook , the first time i felt i can cook way better momos than the cook over, then comes the fish curry wow felt like a tomato soup with chunk of grilled salmon in it really? it came with side of rice and dal and mixed veggie curry., everything had no flavor and thef ood was cold inspite us being their first guest ,WOW\nthe service is ok, but the food very bad, i expected a lot from an authetic nepali restaurant. i would reccomed nepali restaurant in berkeley with better tasting food. sorry but had to give one star , there was nothing i liked about it, it was my first and last trip,", "author": "zyotika s."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-07-02", "description": "Pretty good, but nothing too spectacular here food-wise. Samosas were a little chewy (not a good thing). Also not real sure about the difference between a la carte and combo meals - I could be mistaken, but I think the only difference is that the combo is served on a golden platter. Maybe some people are willing to pay a few bucks more for that?", "author": "Jennifer W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-05-13", "description": "Holy effin Himalayan god! Wow - just wow. \n\nIn my ongoing quest to find additional restaurants that deliver to my ghetto-fabulous neighborhood (something besides pizza or Chinese), I stumbled across Little Nepal, who happened to deliver in my area - yay! I have never had Nepalese food before, but after doing further research here on good ol' Yelp, I was certain that it would be a decent experience. So I placed my order online and received a confirmation that it would take about 45-60 minutes for my order to arrive. About 25 minutes later, I was pleasantly surprised with Little Nepal's delivery guy ringing by doorbell - yes, I said 25 minutes - unheard of in the City. \n\nI ordered a chicken in cream sauce dish and their chicken chowmein - food orgasm baby.... \n\nIf you are one who favors quick delivery of food full of flavor, you need to give Little Nepal a shot - they won't disappoint.", "author": "Mrs. F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-07-19", "description": "I should mention that this business advertises in the \"Entertainment Book\" and that is how I found it.  This is actually the second time we've eaten here and it was good both times. Tonight, the service was great, and we like the ambience.  We ordered the tandoori combination which consisted of Salmon, chicken and lamb. Very moist, very tasty,  spicy on the outside, moist and soft on the inside. Also served with lentils and mixed vegetable if ordered as a complete dinner instead of ala carte.  i'd recommend it for anyone to try and I consider this a good value.", "author": "Jerome W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-11-06", "description": "Yummy!! I had one of the two-person dinners, where they give you a selection of appertizers and entrees, with a dessert, all for around 20 dollars. The appetizers were amazing, and the entrees were pretty good too. A nice atmosphere in cute Bernal Heights. I'm going to make this a regular destination from now on.", "author": "Cyrelle D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-11-20", "description": "MMM, mmm, good. Had a girls night out and had a great time at this cabin in the woods looking restaurant. It's set in a quaint area of SF, service was great, and food was yummy! Tastes are similar to Indian food. Naan tastes more  soft, dough-y, and a tad sweet, than at Naan-n-Curry, and there tofu curry is comfort food for cold weather. Their combos are worth it for 1 person or to share, they include rice, naan, and 3 sauces for you to eat with your entree. Very nice, modern ambience - not too loud, stuffy, or dim lighting. Great for dates! Parking sucks.", "author": "Jamie R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-03-18", "description": "Friendly service with a nice ambience, which makes it a good date spot. Food is good, and I recommend the combo platters. I'd have to knock off a star as I think it's a bit overpriced for its portions. However, if you're looking for something different for your taste buds, and if you like Indian food but find it too hot and spicy for your liking, Nepalese food will do it for you.", "author": "Zell C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-13", "description": "the food here was lovely, and that orange sauce was so spicy. my date and i both were suffering, but in the good way. :)   fine selection of drinks and many veggie options. garlic naan, mmmmm.\n\nlovely service, lovely ambiance inside.  an easy walk in the new neighborhood, and bonus, next to maggie mudd's. in case you do not succumb to food coma.", "author": "Kat R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-06-22", "description": "Best naan ever! You gotta at least try the naan here! It was hot and fresh, like it just came out of the oven. It had a light, but still noticeable buttery flavor to it. The texture was what completed the winning combination. It was light and had the perfect amount of flakiness and lightness, but also doughiness. The other dishes we had were also terrific, portions fairly generous, prices good, atmosphere chill, service friendly and attentive. Great experience overall, definitely going back.", "author": "Jenny W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-03-26", "description": "The best way to experience Little Nepal is to get one of the set meals. You will get to try a little of everything for a bargain price ($45 for the 2 person set) and you will probably end up with way more food than you need.  Lunch tomorrow!  Such a bargain.  So delicious.  You will also need some Kingfisher beers to wash everything down.  This is food nirvana.", "author": "Miss Information X."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-11-19", "description": "My friend and I wanted to find a new place to eat. Little Nepal was really good. We read some yelp reviews that said it was overpriced Indian food. I could see how someone would say that but then again I totally cant. We started with the Samosas and they were excellent. Next we split two of the combo meals. One was a a veggie curry and the other was the mustrard greens. I loved the spice in the curry. Wasnt as big of a fan of the greens. The combo was great because it came with rice, naan, veggie side, beans and lental. We also split a large beer and the bill was not as bad as we thought it was going to be. the waiters were all really nice and the service was prompt. I would go back again  and get the same thing or even try somemore.", "author": "Carli M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-02-01", "description": "I've spent some time in Nepal so maybe I'm biased, but Little Nepal is one of my favorite restaurants.  My boyfriend is addicted to the chicken with cream tomato sauce, while I can't get enough of the mustard greens.  He likes the naan more than I do (I think Pakwan's is better) and we both like the veggie momos and the samosas.  Daal (lentils - national dish of Nepal) is also delicious, mild and smoky.  Haven't tried the tandoori yet but it always smells good and arrives dramatically sizzling, although they need to improve the ventilation on account of all the smoke.  The service is excellent and the decor and sitar music is very soothing and takes me back.  As for those who are calling it \"bland Indian\" - well, it's Nepal.  A completely separate and very special country.  Go if you get the chance!  (both Nepal and Little Nepal)", "author": "Esther K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-08-10", "description": "I just used Urbanspoon on the iphone to make my choice of cuisine tonight. It said Little Nepal, so off I went. We were greated with \"Namaste\" and a bow before being seated near the window.  We shared the MIsmas pakauda for a starter and also shared the Kukhurako Ledo and Machhako Mitho Tarkari. The service was gracious and fast, but not hurried. The spices were perfect and the portions generous. Never having had Nepalese cuisine before - I am now a HUGE fan. I can't wait to go back!", "author": "Erica C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-08-11", "description": "My favorite \"upscale\" curry place in SF.  A nepalese coworker actually recommended the place to me.  Love their chicken curry dishes and appetizers.  Tandoori items I have had were good too. Their naan is fluffy, moist and flavorful.  The rice is not greasy at all which seems to be typical of nepalese/indian/pakistani joints.  Plus, even when cooled down, their curries don't have the typical layer of oil/grease on them. They have delicious homemade chutneys and lentils. Now that I know that they deliver, I will be eating from here more!  Everyone keeps complaining how overpriced it is, but even their ala carte dishes include rice and naan.  You are paying a couple bucks more for non-greasy curry plus their portions are very large.  Its totally worth it!", "author": "Larissa W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-02-03", "description": "I really like this restaurant. Nice atmosphere, great food, friendly service. Perfect for a weeknight dinner or a mallow weekend night. I'm a big fan of their Kukhurako Ledo .", "author": "Iphigenie S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-02-02", "description": "It is a cute little place up on the hill.  Before I entered this place with my husband, this woman outside said, \"You are making a good choice\". So we felt easy on going inside.  A lot of people.  They all look settled down cozily.  I thought that was a \"good sign\" :-)  Because we sometimes do adventure stuff, trying out new restaurant spontaneously.  You never know what you are getting into.\nWe had \"Himalayan Momo\" as appetizer and Khasiko Pakuwa and Chhayau Tarkari  as entry.\nThey were delicious enough to satisfy our hungry stomach.  However, my husband pointed that Lamb should have been more juicy and softer.  Other than that we were happy to be there.  Please experience different and oriental style food if you want to experience new adventure.", "author": "rie k."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-06-02", "description": "This place is super tasty, albeit a *tiny* bit pricey. We'll definitely be back.", "author": "Mark C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2005-06-02", "description": "nice little neighborhood east asian. The food is not spicy so if you think nepal is pakistani you are in for a disappointment. Many crossovers here in this warm inviting bernal shop. I like it and reccomend highly. nice staff.", "author": "Ricote F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-11-18", "description": "This place is magical. I have eaten a couple of times & am consistently delighted to recommend it to friends. The food is so delicious and waitstaff are attentive & friendly. The portions are filling (I always bring home leftovers) and they are quite vegetarian friendly.", "author": "Anna O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-04-15", "description": "I'm cheesy but I watched the movie 7 years in Tibet and I absolutely had to have Himalayan food.  And what a gem of a place Little Nepal is as well as the neighborhood...I would never otherwise have gone to Bernal Heights but I'm glad I did and I've noted to myself to return to the area for food treasures and will likely return to Little Nepal.", "author": "Debbie Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-06-14", "description": "The momos were quite good and that and the entree fed two of us so we were happy gormanders.", "author": "Peter O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-11-04", "description": "What can I say...Little Nepal is my girlfriend and my favorite place to eat in the city or anywhere for that matter. The food is INCREDIBLE. Not only that but the servers here are some of the most kind people I've ever encountered while eating out. They've become somewhat of a family to us and we have a lot of great memories here...\n\nAs I mentioned it's our favorite restaurant in the city. We come here once a month to celebrate our anniversary. We've celebrated birthdays here and brought family from out of state to share the good eats.\n\nJust a tip...if it's your first time eating here order the Kukhurako Ledo...your mouth will thank me.", "author": "Edwin M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-03-16", "description": "Nice food, just different enough from standard North Indian fare. Not really a destination restaurant, but nice enough atmosphere for a date.", "author": "anita c."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-13", "description": "Loved the food, not over spicy or oily, so unlike the food served in most indian restaurants...it felt healthy, each dish had a unique taste...just loved it...yummm...even plain yoghurt tasted so good..I am going there again very soon!!!", "author": "Tushi P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-01-03", "description": "I finally got over to Little Nepal and the food is GREAT! A little expensive, and atmosphere on the quiet side, but worth the trip up to Bernal, if you're in the mood for sit-down Nepalese on the nice side.", "author": "Bowen D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-06-18", "description": "I've only been here once for a casual dinner with friends, and to be fair, a few friends really enjoyed their dinners.  But sadly for me, it was a not-so-memorable, yet expensive, meal; the menu was really pricey for what seemed like simple fare.  I love the location (Cortland Street is a great little neighborhood corridor) and am in the neighborhood every now and then, so maybe I'll give them a second try if I ever have a little extra cash in my pocket.", "author": "Andrea U."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-11-18", "description": "I love this place. I have eaten here countless number of times! They even have my name, CC number on record given how many times I have placed an order. Its like having home cooked food, and thank god they are not greasy unlike their counterparts!", "author": "sandhya .."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-03-18", "description": "As others have written, this really is  a good date spot. Especially for vegetarians. There is a whole section of vegetarian dishes. The food is nicely presented and in a way that is good for sharing (a plus for a date). I can't handle anything spicy and they actually made my food mild. The dipping sauce they offer with everything is incredibly hot, but you don't have to use it. Oh, and the naan is top notch. \n\nAtmosphere 4 stars\nService 5 stars\nFood 3 stars (all around good but nothing special or great)\nPrice 4 stars (not dirt cheap, but a fair price for type of place)\nPortions 5 stars (I split a combo and app with my husband and it was plenty)", "author": "Happy M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-05-09", "description": "Was very disappointed at the quality of the food.  We're vegetarian so we tried the tofu curry, an eggplant dish and a potato and bamboo shoot dish.  All were really average and somewhat bland.  I'm guessing Sarah W's review is right - probably something has changed in the ownership or the cooking.  Service was fine but absolutely too expensive for the quality of the food we had.  In a culinarily amazing city like SF, there is no reason to accept food of this quality at this price.", "author": "Ryan M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-07-19", "description": "I love the atmosphere and always feel sooo welcome! A little pricey but still worth it! Love the shrimp! If you like Indian food, you'll like this place a lot!", "author": "Mel P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-03-29", "description": "A little gem of a restaurant in Bernal Heights.  Great service and delicious food.", "author": "Valerie D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-09-20", "description": "what a find! i came here last night with a bunch of raucous girlfriends.  when the food came, that sure shut us up.\n\nwe got the vegetarian himalayan momo as an appetizer. yum. kind of like a steamed wonton with much more flavor. we also ordered the alaskan salmon. dear lord, these big chunks of fish come out piping hot on a sizzling platter, and with a little lemon squeezed on top they are just to die for. i found myself scraping the crispy onions and green pepper off the plate with my fingers. mmm...shameless. \n\nbonus: the waiters pour your water from way up high and it somehow makes it into the glass without spilling a drop. go li'l nepal!", "author": "jean w."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-07-18", "description": "This place is awesome! While it's a bit overpriced for a good weekday meal, this food is truly to die for. They deliver, which is a huge plus, and the food is like indian with a different spice background. Their tandoori, which goes by a different name, is fabulous. They got me hooked on lamb and I hate lamb! The decor and the staff are sweet and they really make sure you are taken care of. We often take people here for a special dinner just because it's so different.", "author": "Kris S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-01-10", "description": "I think this place is delicious.  The puffed rice chicken appetizer is seasoned with god knows what but its addicting and heavenly.  My tandoori is always tender and juicy and I love all the makings it comes with.  Top that with a few ice cold Flying Horse's and grab Maggiemud on the way home and you have an amazing food evening.", "author": "Em S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-07-17", "description": "First off, it seems fair to say that with the stiff competition out there when it comes to Indian food(or at least Indian inspired), one may not be inclined to want to pay more than 10$ for a plate. Well to all you out there thinking along those lines(I was one of those) I say: PAY!\nThis place is oustanding! We ordered the Party of 2 special, so we got\nto try an assortment of appetizers and other stuff. Every single dish we tried was amazing. What stood out was the lamb appetizer, which comes with the party of 2, which was perfect, the fresh vegetarian samosas as well as the lamb samosa.", "author": "Steve P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-10-16", "description": "So my friends from out-of-town came to visit us last weekend and they wanted to try a new restaurant in SF.  We went on Yelp and Little Nepal popped up.  The review sounds good so we've decided to go check out the restaurant.  Have to say, the food is GOOD!  There were four of us so we decided to order two combinations and share, plus some appetizer.  We've ordered the Khasiko Pakuma (lamb) combo & Poleko Kukhura (chicken) combo.  We also had a side order of garlic naan...it was so delicious, we had to order another order of garlic naan...you gotta have this....it's nice and warm and the garlic and butter on the naan smells great.  The Chhoila (pork) appetizer was also yummy.  Everything we ordered was delicious.  The only thing I would caution you is that some of the dipping that comes with the combo plates are a bit spicy, but I'm a spicy eater so I enjoyed it very much.  It's a tiny place, but service is great and the restaurant is very clean.", "author": "Sue N."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-12-04", "description": "It was great visiting for the first time. Very friendly service. However, in the long run, there are a lot better nearby Indian restaurants that have, essentially, the same food for half the price. It was good to experience once, but not enough to return to.", "author": "Nick S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-07-07", "description": "I LOVE THIS PLACE!!  Excellent food, great prices and great service can I say anymore.  The  Kukhurako Ledo is yummy, a wonderful chicken dish with a creamy tomato sauce.  I always get the combo as you get the lentals and veg with it.  The house wines are very good for the price.  A must if you are in the area", "author": "julie c."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-12-19", "description": "Little Nepal is one of my all-time favorite SF gems.  The cozy little dining room is a perfect place to spend a chilly evening, and the staff are friendly and equally warm.  The food is consistently delicious; the Kukhurako Ledo (chicken) is hands down the best thing on the menu, though they do have some very good vegetarian dishes.  I always order the combo, which comes with rice, bread, and a few little other dishes (lentils, vegetable curry, and a couple of yummy sauces).  Their starters are good too. Add a cold beer and it's the perfect meal...", "author": "Caroline G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-08-19", "description": "I've had nothing but wonderful experiences here every time I've come here. You can't go wrong with the combination dinners or using them as guides as to what to order, and the staff are terrific. But whatever you do, be sure to order momos (delicious dumplings) and the heavenly naan.", "author": "Sharman G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-09-27", "description": "delivery always seems like a compromise--convenience for taste or quality of food.  \n\nand in the mission or in bernal, it's touch and go with sanitation and whatnot.\n\nthe good news is that little nepal is the absolute best tasting, most consistent, and overall excellent food i've ever had from a place that delivers.  it's so good i get cravings for the food specifically.  not the old, shoot who delivers who isn't too nasty type of thing...\n\nwell done little nepal, i love you.", "author": "threeholepunch y."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-04-17", "description": "The food is just okay, and complicating matters, there's a funky (mold?) smell that permeates the dining room.", "author": "Mark T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-03-27", "description": "Wow, where shall I begin, it is all so good and the atmosphere so calming, and the service is great. The flavors are spectacular, we always get the Meal for two, and we love it, you get to taste many of their dishes, from appetizers to dessert. We love their tandoori chicken and all their appetizers. Their chai tea is good and it is all just lovely!", "author": "lima b."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-08-08", "description": "This place is the bomb - for real. I live in the neighborhood and go here all the time. The atomosphere is warm, the food is spicy and aromatic. The people who run this restaurant have the best story about why they are here in SF - it's just a great place. If you have a sensitive stomach -this is probably not your place. The wine selection is adequate as well. i have talked a dozen friends into tryin out this place over the years and they all love it.", "author": "Tom R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-01-05", "description": "Our group debated whether to go to Rasoi's or Little Nipple (yes, I think many people call it that, affectionately of course) and I'm glad I finally gave this place a try.  I had a great meal here and coupled with great conversation and friends, it was a sweet experience.  The tandoori lamb was tender on the inside, crispy outside- perfect!", "author": "P-Rock F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-06-20", "description": "sooo.... totally my fav take out.  I'm lucky enough to live within their delivery range.  I love the food there... although I must admit that I get pretty much the same thing everytime.  Oh well.. I'll branch out to new dishes next time.", "author": "Sang L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-01-15", "description": "Food was good, service was nice, and I like the wood interior. I like this neighborhood, but it's pretty far for me, being that I try to walk as much as possible, what with global warming and all.", "author": "jen n."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-02-17", "description": "I love this place! The Chicken Tandoori ALWAYS is the best thing on the menu. Super reasonably priced and super quick service!", "author": "Al G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-09-01", "description": "This quaint establishment has been a nice addition to Bernal Heights.  As a resident of Bernal for many years I have been a bit disappointed by the lack of affordable neighborhood restaurants until now.  An added bonus is that Little Nepal offers several vegetarian dishes - something to that is lacking in my hood.  The food is delicious with attentive service.  And the combo dinners usually leave enough food for leftovers. You really cannot go wrong.", "author": "Rebecca G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-03-25", "description": "Great little find on top of Bernal Heights. Their is limited seating so you might have to wait, and I wouldn't trust their \"reservations\". Once inside the decor is quite serene and the food delicious. There is a lot of Indian influence in the spices used. I would recommend starting with the Chhoila, which are well spiced cubes of lamb or pork (I prefer the pork). They cook it perfectly. The Momos, which are much like pot stickers, are also very good. For the main dishes, I've yet to have a bad one. My favorites are the Kukhurako Ledo (similar to chicken tikka masala) and the Khasiko Pakuwa (lamb in spicy tomato sauce). You can order a la carte (comes with Nan and rice)  or combo (Nan, rice, lentils, veggies and chutney). If you get the combo make sure you are hungry, cause it's a lot of food. And for those lucky enough to live on Bernal. they will deliver, and they are fast.", "author": "Chris R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-06-20", "description": "i didn't really know what \"nepal\" food is, so me and a friend decided to give it a try. we ordered the set meal for 2, which is $44 total.\n\nit came with i think 2 big dishes plus lots of small side dishes. i think we had a total of 7-8 plates.  A lot for two people. the Momo and the chicken ( not sure what its called) were both very good. the rest was just ok...\n\ni felt that the samosas were alright..i prefer the ones served in indian places better\n\nthe side dishes it came with were interesting to taste, but def. not for my preference. \n\nthe place itself has a cute quaint ambiance to it. feels legit, although i have no clue about nepal culture", "author": "krystina ann r."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-12-18", "description": "This was a fantastic 'little' restaurant.  A group of four of us went on a Wed. night.  The service was excellent and the food was unbelievable.  The staff made sure our glasses were full, and even with the hot tea gave us extra hot water.  For dinner we had the momos to start - a Nepalese classic, and the dipping sauce was great.  Then we had a combo Tandoori salmon and lamb... both cooked to perfection - and great quality food.  I would definitely come back and highly recommend it to others.  The space itself was a bit small - but if we were there on a weekend, it would definitely be worth the wait!", "author": "Faith K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-04-13", "description": "I am not big on curry so I didn't want to try it but the food was excellent.  As people have stated in other reviews it seems to be mild which was great for me.  If you have wanted to try Indian food maybe you should start here.  The atmosphere is very nice and the staff is friendly.  The first time I went I waited almost 30min for a seat but the owner brought us a glass of wine to help pass the time.", "author": "Enzo S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-07-05", "description": "Good cheap nepalese food. My grandmother who was in the foreign service in Pakistan awhile back enjoys this place, which says to me its fairly authentic. I have to give it a thumbs up too.", "author": "Emmy B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-04-24", "description": "Delicious.  My boyfriend and I ordered the Kukhurako Ledo and the Saagko Tarkari, and both were fantastic.  I just ate here last night and already I am fiending for more.", "author": "April G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-11-25", "description": "Food's pretty good but TOO PRICEY for this type of food.  Vegetables should not cost $10+.  I hope the owners take this pricing recommendation seriously.", "author": "Sheila S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-11-20", "description": "Large portions. Food and service was very good, however slightly pricey. The sizzling chicken was tender and very good. I would agree with the other reviews that it is \"indian lite\".", "author": "Phill and Molly O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-09-01", "description": "Cant remember what I had but I remember it was bomba.....this place is small so it can be cramped and prices are fair cause you'll get a good amount........go try the ice cream spot next door, or die.", "author": "Len C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-06-11", "description": "Maybe I'm being too generous by giving Little Nepal 5 stars, because it's the only Nepali food I've ever eaten -- Nah, they're amazing: little place, big flavors, sweet people, great price, they deliver. Where could you go wrong?", "author": "Ju B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-07-27", "description": "How come people are lukewarm about this place? It ROCKS! i love it. so super tasty! the prawns tickle my fancy and the veggies (i've tried most of them) are all 5 star fantastic. I guess that one tofu with string beans dish is a little scary because of its fluorescent nature but i wasn't put off by it. sometimes, you just have to take risks in life. and i did. and it was damn tasty.", "author": "bloopie s."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-05-31", "description": "The food here is excellent (the seasonings are wonderful) and the atmosphere is calm and quaint.  We always eat our fill and have leftovers for the next day.  One of our favorite places in the Bay, and our number one pick for Bernal.", "author": "Jessica H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-08-28", "description": "for my last meal on earth, i'd like an order of kukhurado ledo with extra naan for dipping, please. a saucier, more savory version of chicken korma, this nepalase extraction likens the nectar of the spice gods raining down upon your tastebuds.\n\nmmmmmmmmmmmmmm.", "author": "Mia L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-04-25", "description": "this place is adorable and delicious and the staff is so friendly and helpful!  they will make all vegetarian dishes vegan, even the bread if you ask for it without butter (you won't miss it).  everything is super flavorful and if you get the combination you'll have tons of dipping sauces and rice and bread.  i love the alu tama bodi curry--potatoes with black-eyed peas and bamboo.  goes great with the mint tea.  also, fun photos of the himalayas all over.  who can argue with that?", "author": "kate s."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2005-03-30", "description": "or as my husband and i call it \"little nipple\" has some tasty but small selection of nepalese dishes. one of the many cute restaurants on courtland st. small, quaint, with nepalese decor, i'd go to rasoi over little nepal in an instant.", "author": "Sanaz E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-06-08", "description": "A bunch of friends and I went to dine at Little Nepal on Saturday and all of us loved the food. Napalese food is similar to Indian food with chutney, naan, cooking style but a lot less greasy and heavy. We ordered the following food to share: chicken momo, Chicken Ledo (combo), Chicken Pakuwa (a la carte), Lamb Masu (a la carte)  and the Tandoori chicken (combo). All entrees come with naan bread, rice and sauce and combos come with that plus salad, lentil (soup) and chutney sauce. The chicken momo is like a dumpling stuffed with chicken and comes with chutney sauce (not spicy.) The Chicken Ledo is sort of like curry with tandoori chicken cooked in creamed sauce. The sauce was excellent with rice and naan but the chicken was overcooked. My favorite is the Chicken Pakuwa (chicken cooked with tomato sauce similar to the marsala) because the meat was very tender and delicious. I normally do not eat much rice but I overate that night because the sauces were so delicious. The tandoori was a very tasty breast meat cooked to perfection with spices. The Lamb Masu was very tender (taste like Rendang beef) but it still taste a bit gamey. My other three friends loved this dish and ate everything even the sauce with naan bread. I do recommend the mint tea with ice for easy digestion.  The bill turned out to be $23.00 per person and it is worth every penny. I will definitely be back to sample more of it.", "author": "Allison H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2005-05-05", "description": "Like everything else on Cortland, this spot is a little over-priced ($10-12 entrees when they should be $6-8). I recall waiting an eternity for the food to arrive and small portions. There was enough to choose from on the menu and the food was flavorful, but it wasn't anything special.. the same fare can be found at cheaper indian restaurants throughout the city.", "author": "Alex D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-06-11", "description": "I came here with a vegan friend and although I'm not vegan, everything was really great! We were both really happy:)", "author": "Ms. G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-12-13", "description": "it was a rainy night when i had my first  taste of nepalese food. fortunately, we got a parking very close to the restaurant and we were also seated right away. we mutually decided to get the set meals which was the national nepalese bhojan for two. on the set, you could get momo which was a steamed pot sticker (we had the chx), samosa (which was huge and we had the veggie), chhoila, alu tama bodi ( i don't know which one is which, but we had the mung beans and squash with potatoes and this two dish were similarly cooked just like the filipino way..=)) and of course the main dish, sizzling kukhura (chx) with fresh green peppers and onions. we truly enjoyed our first nepalese cuisine, though we quite waited for our food. staff were attentive and friendly", "author": "Nelle A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2005-08-10", "description": "i give Little Nepal 4 stars because it has the most amazingly fresh tofu dish i have had in the city - tofu takari.  they make the tofu fresh there and it shows.  the bright orange sauce it comes in may scare you at first, but once you taste the smooth, creamy sauce you will wonder why you haven't tried this dish before.", "author": "Kristie P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-04-19", "description": "A little on the expensive and bland side for my taste, but I wouldn't turn down the offer to go if someone else was paying.  I don't see myself running back when I get an indian/nepalese craving.  Still pretty good.", "author": "John D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-05-27", "description": "We just ate here for the first time and we absolutely LOVED it! Everything we ordered was amazing! Little Nepal is now on our short list of favorite restaurants. YUM!", "author": "amy m."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-04-15", "description": "What a little gem!  Wondeful food, cute cozy atmosphere, outstanding service.  They also deliver and are super polite and gracious.  This place is so much better than your standard Indian restaurant.", "author": "Kristi S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-07-07", "description": "I LOVED that place. I ended up there because the restaurant across the street was packed and didn't want to wait as it was late. The food is delicious, the service is great and the prices are amazing.", "author": "pau g."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-10-28", "description": "I love this place, but i must admit i order the same thing every time: kukurako ledo (chicken in cashew cream sauce) and sagko tarkari (greens), both combo meals.  Others have said that this place is pricey, but i disagree.  If you order the combo meals, you get the most bang for your buck - it includes naan (better than any Naan I've had at any Indian restaurant , hands down), veggies and daal.  This for the same price you'd pay for an entree only at Zante's (Indian) down the street..  The Kukurako ledo is seriously good.  Kind of like tikka masalla but sooooo much better.  Be careful when you reheat it as a leftover - do it slooowly, otherwise the creamy sauce will break.  the samosas and their other tandoori dishes are very good too.", "author": "Mirit C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-01-11", "description": "my friends and i had a car at our disposal so we wanted to try someplace different. j sat me down in front of yelp and ordered me to find something. i thought i have no idea where bernal heights is, so i'll look there. i ended up picking little nepal. 5 of us drove over there like tourists and found this tiny restaurant and it was good! i think the best thing was the mango lassi type drink, which was called something else on the menu. i wish it'd been bigger. it was normally priced, and normally decorated iniside. we had momas for apps (pork and chicken) because everyone was talking about them on the reviews. they were good. just little dumplings... we ate them in 2 seconds. some people had the tandoori, but found it just ok, a little dry, boring. n had the chicken cashew dish. (they cant take the cashews out, theyre in the sauce). it looked good, and he liked it. i really liked my lamb red saucy thingie i had. i'd say do get a saucy or curry type dish if you go. we got the combos so it came with naan and rice. there was also a sauce and then some dal which was too watery for anyone to eat, and some yummy veggies. service was medium. they brought over a new sauce when the momas came with peanut sauce and 3 of us were allergic. but then again, every time they refilled water, they skipped me. all the guys would have their water refilled, then theyd just stop before me. no matter where they poured on the table, even if my glass was next to someone else's. finally, i just had to set my glass loudly on the side of the table while saying how thirsty i was... and it got filled. what was wrong with my cup? maybe cuz i was the only girl at the table? nah. i dont know.  anyway, i'd come back, it was tasty, only that i doubt i'll often if ever be in this neighborhood again.", "author": "Merredith L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-06-25", "description": "pretty good. not fanstatic, but pretty good. i had the tandoori combo (lamb, chicken & salmon). it was nicely cooked and nicely presented. however, it lacked the smoky flavor that you usually have with tandoori. the decor is nice. the tables are a little close together. the service was friendly. possibly a good date spot.", "author": "Ben H."}
