{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-09", "description": "The pork combo sandwich is the what you want to get, its amazing and delicious and it'll complete your life. For those haters out there dropping some 2 star reviews... its cause your life sucks and you dont know how to fucking appreciate a good sandwich.", "author": "Alan F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-10-10", "description": "Little spot and one man operation on Steuart street right off the Embarcadero and fairly close to the ferry building.\n\nGot a pork banh mi and it was standard fare. When I walked in there was no one in the facility although the store was unlocked. Turns out the guy was grabbing something from the back. \n\nNo place to eat but a solid option for a quick grab n go solution if you're craving a banh mi and don't want to go deeper into SF. \n\nIf you like my reviews, consider \"following\" my profile for reviews all across the SF Bay Area . Why \"follow\" someone?  It causes the person you follow's reviews to tier to top when you pull up a business. I find this very handy when researching venues. \n\nRod's Review grading scale explained. Essentially I personally base it on the likelihood of a return visit and I try to be stingy with 5 star reviews since they should be \"special\" in my eyes. Price/Value also play a role obviously but there are $ and $$$$ littered across my grading scale. \n\n5 stars - \"I'll go out of my way\" (approx 6 % of my reviews)  4 stars- \"If I was in the area I'd go here and would recommend\", (approx 38% of my reviews)  3 stars \"Maybe if was nearby\", (approx 37% of my reviews) 2 stars -\"Would likely not return, Only if you want to go\", (approx 16% of my reviews)  1 star -\"No thanks, even if I was hungry\", (approx. 3 % of my reviews)", "author": "Rod M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-07-06", "description": "I've been here twice. \n\nFirst time was ok, i got the chicken banhmi w extra vegetables (but they were out of cucumbers and daikon...) is it was just a ton of orange carrots and jalapeños. \n\nSecond time was today. I got another chicken banhmi w extra vegetables. They were out of jalapeños, no problem. But when I opened my sandwich it didn't have any extra vegetables; same amount as a regular one anywhere else (one piece of cucumber and a small bunch of carrots). \n\nThe sandwich also tasted kind of weird. Whoever made the pickled vegetables was p heavy handed w the vinegar. And the chicken was super dry. \n\nThe person working today was also touching their face when I walked up to the window. They didn't wash their hands before making my sandwich. Just put on a glove and used tongs in the other. But how hard would've it been to wash your hands really quick??\n\nAlso, the first time I went the guy made it seem like it was cash only. But today the person there today had a square cube to take card. \n\nOverall, neither the food or the service was consistent. Probably wouldn't go back.", "author": "Phalicia C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-09-07", "description": "Eating my combo banh mi as I'm writing this review. \n\nI work walking distance to this deli and decided to stop by to order a sandwich to go. Quick and easy to order but unfortunately no seats. \n\nOrdered the combo with pate and no jalapeños. Bread was crispy and meat was mediocre. Not sure why the pork was boiled... I've had a lot of banh mis and never had something like this. \n\nAlso, the carrots had a weird picked taste to it. \n\nPretty pricy for a sandwich but not a shock since it's San Francisco. Debating if I will return.", "author": "Elaine C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-13", "description": "Got a very tasty pork sandwich here through MealPal. It wasn't ready when I arrived after my designated pick-up window, but boy was it tasty. I'll definitely order in the future. :)", "author": "Katherine G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-18", "description": "This place is really close to where I work, so I happen to pass by often! It's a small hole in the wall store, but it always smells like waffles (absolutely DELICIOUS) and the Vietnamese iced coffee here is really good! It's strong and sweet, good for a mid morning pick up! I've never tried the waffles, but just going off the smell (and the other reviews)- they must be heavenly. The Bahn-Mi is decently priced, it's about $7 which is a great deal for a hefty sandwich in this area. The owner/staff person is really nice- he walks me through the menu options whenever I ask and makes the sandwiches really quickly. I've only ever had the vegetarian Bahn-Mi, which is pretty good- but it's got a lot of pickled veggies and I like how dense the bread is.", "author": "Kulmeher D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-03-28", "description": "Not a good value for Mealpal/pass. The regular price of the sandwiches are lower than the per meal price of some Mealpal plans. Also it's made when you arrive so that defeats the benefit of preordering. The banh mi street cart on Market and Main premakes their sandwiches and toasts them in less than 3 minutes, giving you a warm crunchy baguette. If this place did that and threw in a pandan waffle, I'd reconsider since it's really convenient to grab lunch here after a workout at the Y.", "author": "Mimi N."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-12-09", "description": "Review for 12:30p lunch order for chicken ban mi sandwich. \n\nWas disappointed:\n- no pickled daikon, lots of carrots and minimal cilantro\n- chicken is a bit shredded and stewed, not BBQ pieces of chicken. However, there was a lot of meat. I'm not used to ban mi meat that is a bit more \"wet\".\n- bread is like a roll, not a French ban mi bread. This was the most disappointing. Maybe they ran out of the usual ban mi bread?\n\nComing back?:\nFor a little over $7 for my sandwich, I would walk a little further and get a ban mi at Cafe Dolci on Market Street (same price) or walk up to Chinatown and get it at Latte Express in Kearny.", "author": "Mary H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-08-18", "description": "I stopped by Little Saigon Deli with some co-workers for lunch. We work in the Financial district of SF and they had just signed up for MealPass where they ordered a Pork Banh Mi for pickup.\n\nFREQUENCY: I've ordered at this establishment once.\n\nFOOD: I actually ordered a combo sandwich which contained both the pork and the fancy pork (not sure what made it fancy besides a difference in color) on the sandwich. A buddy of mine got me into Banh Mi sandwiches when I lived in Philadelphia so I've been a fan for a while now and this was a pretty good one. Not the best I've had in SF thus bar but also not the worst. Plus for lunch prices in the Financial district you can't beat a $7 sandwich.\n\nDRINK: I did not order any drinks while at the Little Saigon Deli. I believe I remember they had coffee and some fountain drinks on the menu. A co-worker of mine commented that the coffee is very good but I have not tried it.\n\nATMOSPHERE: This place is literally a hole in the wall. You could walk right by it and not even know it. That being said there isn't much atmosphere besides standing outside the window and placing your order. Make sure it's nice weather out (relatively easy in the Bay area).\n\nSTAFF: I did not speak to the staff besides placing my order but he got it right any was polite during the process. That's all I ask for in a fast food style joint.\n\nPAYMENT: Credit cards or cash were acceptable.\n\nFor the Financial District I'd say this is a good spot worth stopping by if you've had a Banh Mi before. If you've never had one, look up the sandwich and the ingredients. Based off my experience this sandwich isn't for everyone but I enjoy them. Good lunch spot and I will return.", "author": "Christopher D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-13", "description": "Surprised they're not rated more highly. \n\nJust had a tasty, quick, reasonably priced, pretty authentic sandwich from here.", "author": "Mark P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-05-23", "description": "Um, no. $8 sandwiches aren't unheard of in SoMA - in fact, they're on the cheaper side. But, they're not very good! Neither delicious nor authentic. Pass.", "author": "Kristen S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-09-09", "description": "FiDi is as you would expect saturated with quick eats (e.g. sandwiches, salads) and expensive spots for the business lunches and dinners. It's hard to find good Vietnamese but now that I'm spending more time in the area I'm noticing there is a shocking amount of Vietnamese sandwich places.\n\nLittle Saigon Deli is a one man operation, serving a limited menu of to go items from a window (cash only). They have a variety of banh mi with a complete set of meats (meatball, bbq, fancy pork, egg, shrimp....), they are unique mostly because they offer egg add-ons and their famous green coconut waffles. \n\n* Super Combination Banh Mi - 2.5 STARS ($5.25): Pretty good, but I prefer Soup Junkie. If you're going for price, the food truck around the corner on Market is cheaper. If you're willing to walk a little farther, Saigon Deli in TL is ofcourse the gold standard.\n\n* Coconut Green Waffles - 3 STARS ($2.50): The waffle is made soft and the dough is chewy, it is not crispy on the outside, which I actually don't mind at all. It was a little too sweet, and tasted like a fortune cookie. Wish there was some butter or salt for contrast.\n\nNot my favorite, nor the cheapest in the area, but the food is decent, the prices are affordable, and the menu is diverse.", "author": "Jess C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-22", "description": "This spot is right underneath my dentist. It's a grab and go kind of place. They sell sandwiches, chips, drinks, candy, and even made to order coconut waffles! Let me tell you,the coconut waffle is super delicious! You have the option to have it made soft and chewy, crispy or in between. It's hot and fresh! It's just good, trust me. They also sell coconut water with pulp here (the Asian version). It's obviously sugary, but it's delish. Trust me on that, too.  I know I probably shouldn't have ingested all of that sugar after just having gone to the dentist. I was super hungry, and didn't have time to run somewhere else. This place is perfect for when you're on the go!", "author": "Jenn R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-01", "description": "Special sandwich\nVietnamese iced coffee\n\nMade to order.  I got the special sandwich that comes with pork, chicken, and \"fancy pork\" (steamed).  I add pate.  Loaded sandwich with fresh crunchy/soft bread.\n\nReally nice iced coffee.  \n\nUnder $9 for lunch in downtown SF.  Been back many times.", "author": "Denise M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-07-21", "description": "Noticing that there happened to be a handful of banh mi shops around my work in FiDi, I've decided to take it upon myself to try them all and rate them! \n\nTo maintain consistency across the board, I always order the Combination (usually aka Special, Vietnamese, or Dac Biet) Sandwich as the standard by which I rate each place. I mean, if they can't even get the proportions right in a regular cold cut banh mi like that (no cooking required!), how're they going to get any other sandwiches right?\n\nFirst off, it was the most expensive sandwich so far ringing in at $6.50. I can almost buy two sandwiches at any other place. For that alone I probably wouldn't come back. \n\nLength-wise the sandwich was on the smaller side, but it was thick and seemed like it would be generously filled with meat. To my unpleasant surprise upon opening it was stuffed primarily with the pickled veggies. A lot of it. I do love my pickled carrots but when I'm paying $6.50 for a banh mi I'm going to expect way more meat. \n\nAnd pate. Lots more pate (chicken liver spread). Did it even have any? Ugh.\n\nThis is my third stop after going to the Les Croissants and The Sandwich Stand. It's definitely a step up from Les Croissants but doesn't come close to The Sandwich Stand in both price and quality.", "author": "Derick N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-08", "description": "90% of the time, my sandwich is made in less than a minute every time.\nNumerous options under $5, while other places charge up to 2x for lesser sandwiches.\nIf they stayed open till 2am (or later), I'd be liable to eat here twice on some days.\nFrom the staff guy: if you're watching your weight or cholesterol, ask for no spread.", "author": "Dan B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-25", "description": "And now for a dramatic reading of Dr. Seuss's \"Green Eggs and Ham\", we have the erudite Ed U...\n\nSam!\nIf you will let me be,\nI will try them.\nYou will see.\nSay!\nI like green eggs and ham!\nI do!! I like them, Sam-I-am!\n\nBut I like the $2 Green Coconut Waffle more, especially when it's freshly baked in the well-worn waffle iron and left to crisp up a bit (see photo). I will eat them in a house. And I will eat them with a mouse. And I will eat them here and there. Say! I will eat them ANYWHERE!...OK, maybe that's an overstatement. I doubt I'd eat them on MUNI with some derelict who hopped on through the back door staring at me with drool coming out of his mouth. No , I would not eat it on a bus. I would not eat it and make a fuss.\n\nI did, however, order the bargain-priced $5.25 Super Combination Banh Mi, which contains chicken, pork, \"fancy pork\" (I assume this refers to the fatty parts), julienned carrots and daikon, cucumbers and jalapenos and a touch of cilantro (see photo). Now that's a Little Saigon sandwich worthy of something you'd find in Little Saigon, not in a nondescript kiosk competing for lunchtime attention with Boulevard, Chaya and Perry's on the waterfront. It's most definitely an option amid all the pricier options in the vicinity. I do so like Green Coconut Waffle and Banh Mi. Thank you! Thank you, Sam-I-am.\n\nFOOD - 4 stars...the waffle makes this worthwhile, the banh mi is an added plus\nAMBIANCE - 2.5 stars...it's a kiosk, so make sure you go on a nice day to you can eat it on the waterfront\nSERVICE - 3 stars...pretty much what you'd expect\nTOTAL - 4 stars...when a touch of Vietnam is what you need for lunch", "author": "Ed U."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-06-03", "description": "I'm a bit mixed with this one. On one hand, it's a window counter located on prime real estate, so I can understand the heavy price mark ups. On the other hand, I hit sticker shock when I visited the other day: The shrimp spring roll, advertised as 2 pieces at more than $5, was actually just one roll divided in two. (For context, most Vietnamese places in the city will state \"two pieces\" and serve two rolls divided into two pieces each, for a total of four.) I had the Super Combination banh mi, which, to their credit, was stuffed with meat. The taste was, however, meh, the bread was toasted but not glass-shattering crunchy, and I was disappointed that I missed the small print on the sign that said, \"Pate available upon request.\" (Why isn't this standard?!) Overall, given the prices, I'm probably going to visit when other local options aren't available.", "author": "Andrew L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-07-27", "description": "Disclaimer: Having eaten enough vietnamese sandwiches in my life to fill up The Transamerica building leaves me a bit more critical than your average reviewer.  let's put it this way. You may have grown up on PB&J or ham & cheese. I grew up on vietnamese style sandwiches so even though this place is cheap (under $5) I can't excuse what they pass for a Banh Mi. First time here so I get the super combo with viet iced coffee and the coconut waffle. \n\nSuper Combo: The bread was fresh and soft (saving them from the one star review). Skimpy on the carrots and complete absence of the other veggie staples in a banh mi. No Pate. Jalepeno's had no kick. Meat was well cooked but there were too many fatty chunks to fully enjoy it. \n\nCoconut Waffle: Basically an undercooked egg puff in the shape of a waffle. Where's the crisp? Just as important where's the coconut? \n\nViet iced coffee: Check out my list for my caffeine fixers and you'll see that I like strong coffee. Sweet is a plus but it HAS to be strong! They poured theirs out of a pitcher (definite no-no) and loaded it with that low grade truck stop ice that melts quickly therefore diluting the coffee. Plus serving it in a dixie cup? seriously? \n\nFinal thought: I really wanted to like this place even sneaking away from my usual Banh Mi spot of Les Croissants to try it out but I was let down on all counts. This might fly in the sticks but this is San Francisco. Step up your game.", "author": "Norris T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-03-25", "description": "My second attempt at Vietnamese sandwiches.  \n\nNOTE: This is the same place as Saigon Deli Express @ Embarcadero 4!  Just another location... \n\nFew things:\n- Pork is better than chicken\n- It's not a sit-down place... there's a take-out window and you just order from there.\n- There was one lady working and a line forming... she was quick to make my pork sandwich but it took some time to make the waffles so be patient.\n- Didn't taste like the Les Croissant sandwiches.  I think I like the flavors better at Les Croissants because it has more of that \"pho\" taste.. think cause they add more cilantro and asian stuff.\n- Jalapenos were stuffed in the second slice of my sandwich!  Like the spice\n- They run out of the spring rolls early.\n\nOverall, nice place to grab a quick bite (unless you get the waffles).  Maybe I'll try some other stuff in the future.  It's ok.", "author": "Kat C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-05-27", "description": "I had time to kill when I was in the city so I actually tried to find this place. Good Call.\n\nIt took be a while to find this place because it isn't even a sit down place. There are not tables. There are no chairs...only a single window and the delightful smell of freshly made waffles. I wasn't hungry enough for banh mi but I was determined to order their green coconut waffle. I ordered one...good timing too because the guy  just finished making one when I arrived. It was great... not exactly eye-popping but you can tell it isn't your everyday ego. The outside is a bit crunchy and the inside is slightly doughy. \"So does it taste like waffle\" you ask? Well, the flavor of the green coconut is very subtle. The waffle is solid on it's own but I feel like it could use something else. Maybe something sweet. Either way, it was $2 well spent.\n\nThe service is friendly.  \n\nThe atmosphere is really nonexistent.\n\nIn short: They have banh mi, the green coconut waffle is great, The price is reasonable, the storefront is like 5 ft wide, I'll stop by again if I'm in the area and recommend that you stop by too.", "author": "John B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-01-05", "description": "I was really jonesing to get a Pork Vietnamese sandwich. I live and work in SF so I don't always get to go to Cam Huong in Oakland(the best sandwiches ever, in my opinion). \n\nSo I did some yelping and decided to try this joint. I screwed up and didn't see the \"no credit cards\" notice on their yelp page so that wasted about 15 minutes of my lunch. When will these small shops get their act together and start taking cards? That is annoying.\n\nI ordered the Double Pork Classic I think it was called. It had the Fancy Pork and the other pork and it had Jalapenos. It was $5 even. \n\nI walked all the way back to my office and ate it at my desk. \n\nI uploaded the picture of it with the pen for perspective. \n\n1. I thought the sandwich was too small and not filled up very much. I know this is a bit typical with these sandwiches, but they are also less then $5 typically as well. \n2. I thought the bread could have been more crispy, some parts were super soft and had no crisp at all. \n3. The pork inside was good. I liked the flavor of it and want to eat more now that I'm done eating it. \n4. I would go back here after trying about 3 more places in the area. If they turn out to be the best, I'll go back, but for now I have some more testing to do. \n\nPut more meat in your sandwiches, take credit cards, or lower your prices a little. \n\nweeeee....", "author": "Mack L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-12", "description": "I found this place walking to the Griffon hotel for my stay here in SF.  When I passed by there was a small line of several people.  That is a great sign.  Popular but not too popular.  I got a super combination sandwich and one of those green colored coconut waffles.  The sandwich was great with chinese style bbq port, tofu, jalapenos, pickled carrots, etc.  And only $5.75.  The green colored coconut waffle was good but very quickly lost any of its crispiness by the time I got to eat it.  Tasty though.  Not sure why it is green.\n\nBTW, cash only.  More work on my expense report.", "author": "Marc W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-01-10", "description": "Botton line: my bahn mi was VERY dry and lacked flavor. \nI was quite excited to find this place, as it has decent reviews, is across the street from my office and is literally a \"whole in the wall\" spot with bahn mi sandwiches.  I am a big fan of Saigon Sandwiches and Soup Junkee, but was looking forward to Little Saigon Deli. Bahn Mi is not supposed to be saucy by any means, but this one was way too dry. There was also a significant lack of flavor, and way too much fat on my meat.  Not terrible, but I don't anticipate I will go back. :(", "author": "Sarah F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-07-05", "description": "Got the combination sandwich and added an egg for $1 more. Happily drinking my sweet Vietnamese iced coffee and opening the sandwich to pick out the jalapeno pepper that I forgot to ask them to leave out when I notice the egg is not a fried egg but just entirely egg whites!  T_T Why would you do this? I was so looking forward to a nice half runny egg (if done right) to ooze over the sandwich. So disappointed. Sandwich itself was OK. Would have been perfect with and egg that had a yolk.", "author": "Stephanie L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-05-26", "description": "Decent Vietnam sandwiches fairly priced. \n\nThe waffles taste like they have a hint of pandan leaf flavor. YUM!!!", "author": "DANIEL T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-27", "description": "I am not gonna lie. I purposely waited until 9am so I could have a Vietnamese coffee and banh mi for breakfast. I took it back to my hotel room next door and devoured it while watching American Dad. So this shop gets 4 stars for opening early and making me a decent combination sandwich with pate.  I would have given 5 stars if the sandwich had included the following: authentic ham with gristle (the one they served was similar to Boars Head), sweet minced pork, more condiment such as mayonnaise and sriracha. I did not order the super combo because I was not interested in having slabs of roast pork in my bahn mi.  So it was not the best bahn mi I had (a now closed small shop under the Manhattan Bridge), but it was a darn delicious breakfast alternative. The Vietnamese coffee was a great alternative to hotel coffee, too.  So I do not advise to purposefully travel to this shop for a meal, but if you are in the area, it is nice to have the option.\n\nTip: Bring cash or you will need to go to an ATM, like in Hotel Griffon or at the Wells Fargo a couple blocks away.", "author": "Siu L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-09-05", "description": "The sandwich was Ok. Very basic. Not amazing, but I would go back if I really wanted banh mi, because it is one of the only places that serves them near my work. \n\nThe spring rolls were $5 and has 3 tiny, tiny shrimp inside. Total ripoff. \n\nMy advice is to get the 5 spice chicken sandwich, no spring rolls, and take your sandwich and eat it by the Bay for a simple lunch.", "author": "Alanna R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-11-05", "description": "I had both the spring rolls and the pork sandwich.  \n\nThe spring rolls were average at best, with teeny tiny little flavorless shrimp.  \n\nThe sandwich had the fattiest piece of pork ever and not in a good way.  I had to remove half of it - because it was just fat.  On the positive - it had really good crunchy bread.  \n\n2 stars: \"meh, I've experienced better\" seems to apply here.  \n\nYou get what you pay for - at $5.50 for a sandwich.  Not mad at ya, but probably not going back.", "author": "Christie d."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-01-09", "description": "Green waffles were a novelty, but a little soggy for my tastes.  The roasted pork sandwich was also ok, but did not wow me.  Overall I thought that this was a good place to try if you like bahn mi, but I don't think I will be back until I've tried all of the other similar spots in the area.", "author": "Patrick S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-19", "description": "My latest go-to place for a fresh, tasty, and inexpensive lunch.  I'm addicted to their chicken sandwich, and will often munch the green coconut waffle as my salad-equivalent first course.  (It would be a shame to have a cold and soggy green coconut waffle for dessert.)\n\nBring cash, wait patiently, and then waltz your lunch over to a bench off the Embarcadero before the America's Cup reconstruction takes off.", "author": "Mutant O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-05", "description": "Short lunch break? Need to bust back to your desk and grind more spreadsheets than an intern? Broke?! \n\nAs a college student interning 2 days a week in FiDi, I've gotta say this has turned into the spot to duck to when the workload can't wait. I go with the combo because two different ways of cooking pork. I still need to try the waffles. \n\nThis hole has a mini convenience store's arsenal of tasty treats as well--shrimp flavored chips in regular, hot garlic, & garlic and onion!", "author": "Paolo V."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-08-23", "description": "Love their pandam coconut waffles. I suggest to eat them right away.\nBan mihs..I ve had better.", "author": "Margaret C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-04-24", "description": "I work across from the street from this place but I kid you not, I would not have noticed it if it weren't for a sneeze that threw me off balance right in front of the ordering window... (I did not sneeze in your food... promise)\n\nThe lady was very patient and helpful. There's only like 12 things on the menu, and it took me 15 minutes and a sample to decide what I wanted. She was incredibly patient. \n\nBottom line. Green Waffle Coconut thing.... how do I describe it... it's like hotel sex in your mouth. You know it's gunna be good, but it still surprises you how good it is. \n\nAlso. They have a lot of candy.", "author": "Dominique D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-10-29", "description": "Spring rolls are okay... the peanut sauce is a bit watered down. \nHad the pork banh mi..  The meat is tender and flavorful... bread is nicely toasted. A bit heavy on the pickled carrots...would have enjoyed more daikon.  At $4.50, Ive had better sandwiches but its near work so would be a great quick pick fix.", "author": "Ivan D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-14", "description": "This place is  pretty damn good. I have tried the Chicken Sandwich as well as the Meatball sandwich. I like them both literally the same. \n\nTHE only Con about this place is that the Jalapenos are ridiculously hotter than any jalapeno I've ever had. \n\nAny insight?! \n\nBad Surprise! \n\nNO JALAPENOS next time hah. \n\nVery Friendly employees !", "author": "Jimmy C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-06-02", "description": "green waffle is ok, made to order, and comes hot off the grill (if you don't mind the wait) ... ask for it to be crunchy or it'll be soggy\n\nthere's could be a line inside the building as well as outside the window so be prepared that the wait might be longer than expected\n\nhowever the combination banh mi was the worst vietnamese sandwich that i've ever had ... the vinegar (and maybe fish sauce) in which the carrots were soaked in made the bread soggy and leaked through the wrapper down my sleeve. the sandwich was also made and warmed very quickly so it was unevenly toasted (lukewarm in some areas, cold in others). otherwise, ingredients were fresh; you need to request for the pate. they also hollow out the middle of the bread (i saw a lot in the garbage). at $5, i guess you get what you pay in the Embarcadero area if you don't want to spend double that amount for a Vietnamese sandwich at the Ferry Building", "author": "Diana B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-11-24", "description": "Got the \"Super Combination\" + Coconut Waffle + Vietnamese Iced Coffee for $10 total.\n\nThe banh mi sandwich was tasty and hit the spot, although it's not as good as Saigon Subs down by the civic center. The bread is a bit tougher and the vegetables + fillings don't quite have the same tangy/sweet kick. Regardless, location counts for a lot in the game called Lunch - so it will most likely be frequented in the future.\n\nThe coconut waffle is great! Really tasty and only $2. And for those who were a bit confused (like I was earlier) about what a \"coconut waffle\" is; it's a belgian waffle that's slightly sweet and tinged green.\n\nThe vietnamese coffee comes in a small cup filled high with ice. At first I was a bit put off considering that the coffee was almost as pricey as the sandwich. Drinking it however, it tastes like espresso with coconut milk added in. It definitely has a kick. Delicious but not sure I'd do it every day.", "author": "Brian T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-12-08", "description": "12.07.10\n\nPlease don't try to pass off the slab of green dough in waffle shape to me as your coconut waffle again.  It was soggy, flavorless, and pretty much disgusting.\n\nGood thing your classic combo sandwich saved you.\n\nPate upon request.  No extra charge.\n\nNot the best in the city, but it will have to do in SOMA.\n\nTotal damage: $6.75", "author": "Jenny L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-07-29", "description": "Sandwich is alright. The pickled carrots were a bit bland and seemed like they weren't pickled long enough. The jalapeno unfortunately had zero spiciness to it. Bread wasn't toasted enough--probably because of the line. Yeah, I could probably go on and on but overall my sandwich wasn't amazing in flavor but did fill me up.\n\nThere was only one person working when I went so it was a bit of a wait especially with a line quickly forming. Oh, and CASH ONLY!", "author": "Hwan L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-14", "description": "Awesome place for a quick bite. I usually go for the pork sandwich (no jalapenos) plus a Teas Tea. Lots of meat and the right amount of tanginess. \n\nThey did raise their prices and they're cash only... \n\nMy biggest complaint is that at peak lunch time the wait is spotty and you will need to adjust your time budget if you have a 1 pm meeting. (Yes, I learned the hard way)", "author": "Karen K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-04-28", "description": "Avoid at all costs especially when the delicious Les Croissants is only a few blocks away. \n\nThe pickled carrot etc here is bland so I asked for hot sauce added to my sandwich (saw it sitting there) and the grumpy employee forgot to put it on. The super stale bread left my mouth raw after half a sandwich. So lousy that I threw the second half out.", "author": "jizzie b."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-11-29", "description": "2 stars for the sandwiches but..\n+1 another STAR for the GREEN COCONUT WAFFLE: deliciously crispy and fluffy with a hint of coconut at the same time! \n\nGreat customer service!\n\nSandwich - however, was dry and nothing comparable to saigon sandwich. Sadly dissappointed. Not enough meat or carrots in the sandwich. \n\nUnder $5 - reasonablely priced\n*Cash ONLY.\n*Very small - Orders taken TO-GO", "author": "Tiffany N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-06", "description": "We only made a stop here on our recent trip to SF was because of the coconut waffle sandwhich! It was a clever twist to the original banh mi, very new and different from the Vietnamese sandwhiches I've had in Virginia. I LOVE coconut so this to me was really perfect. The coconut waffle smelled amazing and had a nice crispy and sweet taste. It's definitely a MUST TRY!. The girl that was working there was really nice and friendly too.", "author": "Twitney L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-19", "description": "The sandwiches and the green waffles are great.  (Who would've thought green waffles could be so addicting..it's true what the other Yelpers are saying about this place).\n\nIt's a small little place, take out only, but the service is quick and good.  And the food is tasty.  I wish they served the sandwiches on a larger roll, but I still come back whenever I'm in the area and craving green waffles.  \n\nCash only.", "author": "Miss P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-06-03", "description": "The sandwiches all come on a soft and chewy fresh baguette roll with just the right amount of crunch on the exterior.  There's a good line up of fresh veggies: cucumber, daikon, carrots, jalapeño and cilantro.   Would have been better with some spicy mayonnaise.  \n\nPork Meatball Sandwich - Softer and more crumbly than the typical rubbery meatballs you'd find in pho.  Good spices woven into the meat.\n\nTamarind Shrimp Sandwich - I appreciate the attempt to add a little variety to the standard Vietnamese sandwich options.   Kind of shrimpy-sized shrimp, but packed with a good marinated flavor.  Overall, the bread-to-protein ratio fell a little short making me feel like I was eating a shrimp flavored baguette roll (a cousin to the shrimp cracker?).  I'd suggest either more shrimp or a thinner more baguette-shaped roll for this sandwich as opposed to the current hoagie shape.   \n\nGreen Waffle - Mostly chewy with some crunch along the thinner edges.  A tasty snack by itself, but probably carb-overload after having a Vietnamese sandwich or two.  Perhaps a Starbuck/Peet's afternoon break alternative: Vietnamese Coffee & Green Waffle?  I didn't like the fact that my waffle came from a stack of cold, pre-made ones.  With their array of waffle irons, they should be able to make them on demand.", "author": "Adam B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-03-23", "description": "I always order the number 6- shredded tofu with veggies hold the mayo. I've only had Vietnamese sandwiches from a couple of places and they pale in comparison to what they serve here! The tofu is flavorful, the veggies are always fresh and the bread always seems freshly baked even when most of the time I don't make it in until 2 pm. Also, the ladies who work there are friendly, the sandwiches are made quickly and are under $5.00! The only times I was disappointed were when they were out of tofu for the day. I highly recommend this place!!!\nImportant things to keep in mind:\n-Cash only\n-Small place and seating is minimal", "author": "Natalie M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-24", "description": "I used to live in Seattle, so I've had my share of Vietnamese street-meat sandwiches (they're practically the regional cuisine up there):  nasty, gristly, mystery meat, crammed in a spongy roll, with a few, sad sprigs of cilantro and a squirt of the \"special source\".  Ick.  \n\nThus, after my experience with the northwest's love of rat-on-a-bun, I tried Little Saigon with only the greatest trepidation -- and you can imagine my surprise when the place actually turned out to be good!  There's not much on the menu here, but the sandwiches are tasty, the ingredients are fresh, and the prices are low.  About the only complaint I have is that I wish there was a bit more to the sandwiches -- I'd gladly pay a buck more for a slightly larger portion (one sandwich is too small, but two would be way too much).  Maybe I should buy a waffle....", "author": "Tim R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-02-17", "description": "I went there today for the first time since it was close to my office. I ordered a \"combination sandwich\" with ham and jalapenos. The sandwich would have been just fine if it wasn't for the super stale bun. It was probably a day or two old. Sorry, but this is a no go for me...", "author": "M H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-07-14", "description": "Had their class combo.\n\n-  The bread was hard and stale\n-  The fish sauce they used was pretty tasty.\n-  Not enough carrot and jalepenos.\n-  The pork was cooked pretty well but could add some salt.\n\nNot bad overall, but I expected more for a $5 vietnamese sandwich.", "author": "fatfat w."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-12-23", "description": "Hole in the wall, but AMAZINGLY DELICIOUS SANDWHICHES! \nPork sandwhich is DA BOMB!\n\nAlso great prace for financial district. Usually vietnamese sandwhiches are very cheap but not in this area. Anything worth 4 bucks is very rare to find.\n\nDefinitely worth walking by, stopping, knocking in their window, and ordering a pork vietnamese sandwhich (TIP: do not ask for ANY substitutions of ingridients. everything is perfect the way they make it.)", "author": "NC B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-12-14", "description": "About the baguette, I'm going to have to agree with David D. \n\nI usually come here because it's close to work and the employees are nice and pretty quick in whipping out a Bánh mì ga sandwiches.  What I like most about the Bánh mì ga sandwiches is the  fresh ingredients (shredded carrots, cilantro, chili peppers, and cucumber, lite vinaigrette dressing) and I always request that the pâté and Sriracha Hot Chili Sauce are added.  I always get the super combo because I'm a carnivore - its genetic, I can't help it.   The shrimp spring rolls are fresh and tasty too.\n\nMy experience here is usually good, but today there were two employees who I am unfamiliar with.  I ordered my sandwich to my liking, paid the ladies and tipped them a buck like I normally do.   \n\nHowever, when feeling my sandwich, I noticed the baguette was as hard as a rock.  I should have, at that moment, gone back and requested they make a me another sandwich with softer bread; but I thought its rough texture to be my imagination.\n\n   W  R  O  N  G   !    !   !  \n\nThe bread was so tough it hurt my teeth when biting in to it, therefore ruining the freshness of the sandwich.    Wah wah 8^(  Really made it hard to eat, so I took it apart and ate the meat/veggies and tossed the baguette in the trash.\n\nLessoned learned; in the future, not only will I ask for pâté and Sriracha hot chili sauce - I will also ask for SOFTER bread.  8^P", "author": "Cris B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-02-02", "description": "Well many things about this place would have given me cause to give it 4 stars or more... \nFast, Friendly, Accomodating service\nFlavorful sauce\nSpicy Jalapenos\nCrunchy Veggies\nCost effective\n\nBut the baguette! WTF? Stale as hell!\nThis is sad. Maybe they buy the bread and bulk and it get's old after awhile? Perhaps the day they get their bread is the day to go.\nIDK, what a bummer.", "author": "Edi B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-07-24", "description": "Wow! Cheap and YUMMY...\n\nThe look of the sandwich it's self doesn't give my taste buds justice. The sandwiches might have looked 'eh, not so great' but in reality they were fabulous. I had a combo sand, with pork, fancy pork veggies and a special sauce that spices up your mouth leaving you with 'MORE GIVE ME MORE' sensations. Then to top off the sandwich you have to order their green coconut waffle, o man, I could eat ten thousand of those in one day and never complain. \n\nBetween my boy friend and I ordering two combo sandwiches, and two Waffles the price was under $10... Yes, thats right my friends, UNDER TEN DOLLARS IN THE FINANCIAL DISTRICT!", "author": "Ashley M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-07-15", "description": "Pretty good! I've had three vietnamese sandwiches in Fidi: Les Croissants, this place, and the cart stand on market and battery (i believe). this ranks in the middle of the three. Definitely better than Les Croissants, but didn't have the same authentic taste as the ones from the cart stand. it tasted a bit american? not that anything is wrong with that, i just dont like it in my vietnamese sandwiches :)", "author": "Thach N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-05-01", "description": "This is a good and good value Bahn Mi. Nice crispy roll, good meats and great condiments. I had the classic pork combination and it was fine... not much in the line of jalapenos though. It does deserve more than 3 stars but not quite up to 4 in my book. I'll have to keep sampling and it will be a pleasure.", "author": "Dennis U."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-22", "description": "Came here with the coworkers for lunch. I've always had the pork vietnamese sandwich which is only $4.75! Pretty good deal and not that expensive! The sandwich is a bit small; however, it fills me up! The sandwich includes pork, carrots, cucumbers, and jalapenos. The bread is a bit crispy/crunchy; however, after awhile it becomes hard. The flavor of the pork was not too bad. Service was pretty efficient and quick. It may not be the best vietnamese sandwiches, but it's doable.", "author": "Philana C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-06-25", "description": "The nicest people who run the place. While I was waiting for my food they were explaining the different types of sandwiches and telling me exactly how he makes the most amazing Vietnamese waffles. \n\nThis was my first Banh Mi and it was tasty. I think next time I will go for the super combination that contains pork, fancy pork, and chicken. For some reason I expected these to have a BBQ sort of flavor but they have a fresh delicious flavor with a little zip by the jalapenos. I will most certainly go back! \n\nWhen there please do yourself a favor and get a Vietnamese Waffle. It is a green coconut waffle. The most amazing fluffy bit of goodness. It is hot off the waffle maker and folded and put into a bag for you to devour before you even leave the Steaurt Street location. \n\nCan't wait to go back!", "author": "Scott P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-02-26", "description": "Perfect midday sandwich.. cheap, fresh, crusty-warm, potent with a kick. Just want to give another shout-out to a favorite little lunch place.\n\nI hope Jesse and his brother opens another in the Embarcadero center(as they are trying to do). They are family with Saigon Sandwich in the TL, but Jesse's sandwiches has its own signature flavor-- more savory than sweet.\n\nSometimes I grab just a warm coconut waffle for an afternoon treat-perfect to eat in-hand while enjoying a walk along the Embarcadero waterfront.", "author": "Vicky P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-05-15", "description": "Any place that serves sandwiches with both 'pork' and 'fancy pork' has got to be delicious!\n\nDefinitely try the green waffles, they're delicious!", "author": "Craig E."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-10-27", "description": "Bread was chewy, flavors of garnishes were muddled and old. I had never had a bad banh mi before this.\n\nMaybe it was just the time of day on which i had it, 4pm?  Or have I become permanently spoiled by the sandwiches of Sunset Park and Manhattan Chinatown?", "author": "Rural J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-07", "description": "I was working nearby for a while and was trying all the places that had banh mi in the area. I hit the jackpot with this one. Well toasted bread, enough jalapenos to get that burning sensation in your mouth and good flavor. I noticed that the sandwich wasn't as good as the first time, if they were super busy and were trying to make them quickly (i.e., the bread wasn't toasted enough). Sometimes I wish they'd add a little more sauce, but I liked them enough that I had one every week. Yum!", "author": "Norma .."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-07-15", "description": "Since there are few options for Vietnamese sandwiches within walking distance of my home, I go here once in a while.  I really want to like this place, but the inconsistency of the bread makes it hard to recommend.  It seems like I get a good sandwich there every other time.  Unfortunately, the other times, I get sandwiches with really stale, hard bread.  \n\nMy recommendation:  do the \"squeeze test\" on the sandwich before you pay for your sandwich.", "author": "Cuong D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-10-29", "description": "What is a Vietnamese sandwich all about?  A lady handing out flyers gave me the incentive to go find out.  \n\nThis was a little take-out window on the sidewalk.  The outside air was cold, so I would have done better waiting for my sandwich at the inside window, in the building lobby.  One cook, covering both windows, prepared my sandwich for me in about ten minutes.  \n\nThere were six sandwiches on the menu, and I decided to go for the big one:  Combination.  It boasted roast pork, \"fancy pork,\" pate (mustard, not goose), carrots, daikon, cilantro, cucumber and pepper on a French roll, for $3.25.  \n\nIt was nice to have the exotic flavors dancing on my tongue for a few minutes, but I ate the sandwich in less time than it took the cook to make it.  When I was done, I was still hungry.", "author": "David D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-03-20", "description": "My opinion about Little Saigon Deli is similar to previous reviewers that rated this place with a 1 to 3 star rating, so if I regurgitate any similar phrases, don't throw a vietnamese sandwich at me.\n\nOne of the best things about Vietnamese sandwiches are the tasty vegetables. Normally, the carrots and daikon are marinated in sugar, salt, water, and vinegar for a delicious sweet-tart taste. Unfortunately, Little Saigon must have missed this step.\n\nI was also disappointed in finding that my BBQ Chicken didn't look or taste like the BBQ Chicken that I am used to in a Vietnamese sandwich. The chicken had a weird taste, maybe overloaded on one spice which caused the sandwich to fail my expectations. As my friend and I were crunching on our sandwich, we got to the point where we looked at eachother and said \"Is this really chicken?\"\n\nThe bread was also a disappointment. Usually Banh Mi shops bake their own bread. I understand that Little Saigon Deli is \"little\" with no space to bake proper bread, but this bread was so hard that I almost gave up on eating it. But, my hunger pangs wouldn't allow it.\n\nThe positives about this shop. \n-Their Vietnamese waffles are a delicious treat at $2.00! The difference between regular waffles and Vietnamese waffles is Vietnamese Waffles are made with green coconut. Love it! \nTRY THE WAFFLES!\n-Perfect for a cheap lunch in the Financial District. My BBQ Sandwich cost $3.50 and Sparkling Water cost me $1.00 for a $4.50 value lunch.\n-The guy at the window was very pleasant and nice.", "author": "Liz K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-09-10", "description": "Oh hell yeah!  How in the world did I not try this place sooner? \nOh because its like 5 feet wide at the front.  Its easy to miss things that are only 5 feet wide at the front.  Cars you can sometimes find hard to notice.  People not so much.  A five foot wide person would be pretty hard to miss dare I say Impossible to miss...especially if we're talking about throwing things at him/her.  But a store front thats 5 feet is pretty easy to miss.\n\nTheres a strong smell of peanut soup (is there such a thing?) wafting around this area from Yank Sings exhaust vent.  They must be making tons of peanut soup.  Theres also a strong bleach smell outside Ozumos.  They must be doing laundry.  They both play a big part in distracting you from noticing this place.  \n\nThe only thing that is of use in this whole find me game is the funky yellow sign.  \n\nTo be honest I was looking for a noodle shop that used to be here somewhere.  Its gone.  Maybe this shop took its place.  If so I sho am glad it did.  Im going to make LSD a regular for lunch breaks.  Its a trip.\n\nDavids bottom line-  cheap and welcome change from the standard sandwich.  The guy inside was listening to trance while making my sandwich.  He also called me \"Guy\"\n\nEdit 09/11/08  \nI came here two days in a row.  Hooowah!!  Thanks guy.\n\nEdit 10/25/11  Turns out the owner is my NEIGHBOR.  Awesome how the universe works.", "author": "David L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-10-28", "description": "My vietnamese bro is undercutting the entire neighborhood by a mile with his $4 sandwiches.  Its not often you get good food and good service at such a cheap price.  Variety is not his spice; would you like Chicken, Pork, or Fancy Pork?  If you're feeling fiesty you can get the pork and the fancy pork on one sandwich.  Hell yeah.\n\nMy buddy and I went there the other day and brought back our sandwiches to our desks.  Two VPs walked by and asked what smelled so good, and he told them where we got them.  The VPs grabbed a couple sandwiches and  were so excited about them that my buddy almost got promoted.", "author": "Jackson R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-11-01", "description": "Lunch happiness!  For just $5.50!\n\n$3.50 for a roast pork Vietnamese sandwich with a zingy sauce, cilantro, and cucumber (it says pate in the description, but they were out of it when I went today).\n\n$2.00 for the glutinous green coconut waffle...something so wonderful about eating green food.", "author": "Sooj O."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-04-22", "description": "I have been looking for a Vietnamese sandwich shop around this area for awhile. I finally look it up on Yelp this place popped up and I went.\n\nI ordered the chicken Vietnamese sandwich, it was good - the veggies were tasty and the chicken flavorful but the bread was hard but for $4 that is pretty good deal for this area especially for a filling sandwich. \n\nI also tried the green waffles because of the Yelp reviews and it was only $2. Ummm...it was okay nothing special but then again it wasn't fresh. It was cold, and both soggy and crunchy at the same time. I am not sure how it is supposed to taste or if you are supposed to eat it cold but I won't be eating them again.\n\nI'd probably come back for the only the Vietnamese sandwiches but not waffles....", "author": "Deanna J."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-10-27", "description": "This was the first banh mi that I didn't like.  Overall, the sandwich was smaller than I'm used to getting at New York joints.  The bread was a little chewy, the meat lacked flavor, the vegetables didn't have a bright, fresh flavor, and even though I asked for \"spicy,\" there was no spicy sauce on it, only a few peppers.  The green waffle had a good flavor, but was a little soggy - should have been cooked another minute or two.  I do have to say, the vietnamese iced coffee was good and strong, with a rich flavor.  It seems like there are better places to get this kind of sandwich in SF.", "author": "Chris J."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-11-30", "description": "GROSS. \n\nI came here for a sandwich because I've been on a hunt for the best Vietnamese sandwich around work... and it led me to this place. The service was kind of slow, the shop SUPER hole in the wall (literally tiny spot) and my meat - kind of disgusting tasting. \n\nIf you're going to go for a meal in this area, at least go for a good one. Cheap does not equal good. EVER. My bread was also soggy.", "author": "Lisa L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-09-09", "description": "As good as they are in Hanoi, you gotta get the Classic Pork Sandwich with jalapeno peppers. You will be very happy! My five stars are for this FOUR DOLLAR sandwich (Little Saigon is approx. 96.214% authentic in the Vietnamese sandwich category)\n\nThe Green Coconut Waffles are pretty yummy too, though you may want to have him make you a fresh one. You can tell him how crispy you like it.\n\nThis is a perfect example of the one man ethnic food stall/sandwich shop as a success.", "author": "Michael F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-01-27", "description": "Today, I asked for extra jalapeno (no charge!) and happened to have a small lime from a friend's garden in my pocket - just adding the lime juice really kicked up the sandwich to \"outstanding,\" so next time I am going to ask if they have lime on hand.  Yums!", "author": "Jenn C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-04-27", "description": "I spend so much time eating pho that I neglect to sample the rest of the wide world of Viet cooking.  Fortunately for me, my pho sifu has a big enough heart to also become my banh mi sifu, and I happen to love sandwiches as much as I love soup. \n\nWhat a nice place to try banh mi for the first time, watching the one guy briskly and carefully assemble our sandwiches-- please, don't come here  if you're in a mad rush and need your food in thirty seconds, but he'll get you out and about so that you can find an outdoor table and enjoy your midday break.  The bread was crusty and chewy, the veg fresh, plenty of cilantro.  Sifu's only gripe was that the meat was too moist and sogged up the sammich a little, but this is a small snaggle.  And yes, get the green coconut pandan waffle.", "author": "Laura Y."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-06-02", "description": "I'm hesitant to write this review because maybe I'm just not a plain pork banh mi kind of person. That said, I'm not sure anyone would want a pork banh mi again after the one I had here. I was expecting grilled pork, and probably should have noted the lack of \"BBQ\" qualifying the pork sandwich description, but didn't want the \"fancy\" pork which another reviewer described as processed meat. What I ended up with was a lot of sliced fat/cartilage in my sandwich. Not tasty at all.\n\nThe place is little more than a small kitchen with an order window, and the guy who took my order was really nice. For that I would encourage people who like non-pork sandwiches to give the place a try. But ugh, that sandwich did NOT satisfy in the least.", "author": "J C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-03-01", "description": "Green waffles!\nThey have green waffles.\nThey have green waffles and they're not in San Jose!\nThey have green waffles, they're not in San Jose and I can order them\nwithout having to use languages other than English.\nHow awesome is that?\n\nMmmm. Green. Waffles. Yum.\n\n\nI think they sell other food too... but why bother, when you can have\na waffle that is green?\n\n\nP.S. Green by design, not because they're moldy. You know. In case \nyou're wondering.", "author": "Max R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-14", "description": "I enjoyed the food. I enjoy Vietnamese food, but never tried it at a deli. I was not expecting much, but was pleasantly surprised. I definitely will go back and look forward to trying the green waffle next time.", "author": "L H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-11-09", "description": "Blink and you'll miss this place.  It is TINY.  Just a little take-out window, that's all.  And it's location is hilarious; on the same street as my two fave lunch spots near my office: Ozumo and Chaya.  However, since I do not want to spend $25-40 and take a 90-minute lunch every day of the week, this little place fits into the mix very nicely.\n\n$3.50 for a 6-inch Vietnamese sandwich.  I had the pork: carrot, daikon, cucumber, parsley, pork, and their special sauce all in a french roll.  \n\nIs it a little small for some appetites?  Well does a 6-inch at Subway fill you up?  They're frickin' tasty and hella cheap, so quit your bitching and buy two if you're hungry!\n\nOh, and they can get busy at lunch since they make each sandwich to order.  If a short lineup bothers you, go a bit before or after the lunch rush.", "author": "Marcus W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-01", "description": "Little Saigon Deli is a great place to get your lunch on. I had the chicken sandwich for less than $5.00. It's marinated chicken on a roll with sliced carrots and jalapenos. What's also great, is the Embarcadero is 1 block away where you can go post up and enjoy.", "author": "Ryan B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-04-23", "description": "I sucked it up and paid $4.50 for a banh mi.  But it is not ok to be served a carrot sandwich for this price.", "author": "Mimi L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-02-05", "description": "I'm not sure the sandwich here really qualified as a banh mi.  I had a roast pork sandwich.  The lean, thinly-sliced pork (oddly ringed with black pepper) wasn't really roasted, or if it was, it was a while ago, because it was kept warm in a rice cooker.  I suppose that's why the pork was still moist.  The pate wasn't pate, but some sort of mustardy sauce.\n\nThe bread was nice, since it was warm and a little hollowed out to allow for a favorble filling to crust ratio.\n\nIt was a pleasant sandwich, but there wasn't anything aside from the carrots, daikon, cilantro and chili pepper that made it a \"Vietnamese\" sandwich.  I'll give it 2.5 stars and round up since the guy who works there is nice.", "author": "Suo L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2007-12-07", "description": "Sorry, i have to knock this rating. I was hoping for something more. I was so happy to find that finally the financial district was going to have some good ole vietnamese sandwiches, and that i wouldnt have to travel to tenderloin to the other popular place on Larkin St. That place has been in business for over 20 years and there are still lines coming out the door everyday for lunch. \n\nBut lets get back to \"little saigon deli\". It Turns out i was very disapointed here. There's nothing in these sandwiches that really emphasize a good tasty sandwich. I've had the Chicken Sandwich, and was so disapointed. The meat was bland - except i think they overloaded on one of the spices, and did not taste right. The carrot/daikon slaw was lacking in its sweet and tartness that it should have. I would try out different sandwiches, but i dont think i would change my mind. \n\nThe vietnamese shrimp rolls here are a disapointment as well. It is full of noodles and bean sprouts as fillers. A huge discredit also goes to the fact that it wasnt prepared correctly - everything falls apart when you pick it up. \n\nthere seems to be lack of technique and lack of understanding the flavors of the food they prepare here. My take is they see a market that is unfulfilled and decides crank out the food with no concern, but only to reap in the benefits. I used to think, at least its cheap, but I've noticed the price keeps going up!..", "author": "Mai T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-06-01", "description": "I am not a fan of soy sauce in my Vietnamese sandwiches.  It's just not for me.  Now that's out of the way, my pork combo sandwich was OK to good.  I tasted the sauce and don't think there was pate in it (I'm biased, the pate is kinda my favorite part that makes the rest of the sandwich better), so eh.\n\nI would come back, though.  Why?  Because the green coconut waffle someone else ordered smelled damned tasty and I don't even really like coconut.  Plus I want to give the sandwiches another chance.  Yelpers mention pate, so I must get their sandwiches proper with pate before I can compare to the ones at Les Croissant.\n\nThe guy who took my order was nice and explained what fancy pork was (steamed).  This place is super cheap for the area.", "author": "Amy N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-02-02", "description": "Simple, tasty, and fast.  This place is a window on the street that serves Vietnamese sandwiches.  At $4 each I consider it a bit expensive but what do you want in the financial district.  I also wouldn't call it the best Vietnamese sandwich I've had but it is the best I've found in my hood.  \n\nOverall worth a try but don't go too far out of your way.  Hit up the food court across the street if you're still hungry.", "author": "Garrett D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-09-08", "description": "Little Saigon Deli is a great place for Vietnamese sandwiches in the financial district. Not as cheap as what you'd pay in the loin but you pay for the convenience of not having to make the trek all the way over to Larkin and Ellis.\n\nI ordered the \"classic pork\" but failed to notice that it was not grilled pork which is what I think of as a classic pork Vietnamese sandwich. The flavors of the pork were not entirely what I expected, but delicious nonetheless.  The pork was moist, savory and rich without being fatty and had just the right amount of spices and pepper that kept my taste buds wanting more. \n\nCheck this place out, but as the other reviewers have stated, it's not exactly fast unless you get there ahead of the lunch time rush.", "author": "Jeff K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-04-17", "description": "This is a real hole in the wall kind of place towards the end of the financial district.  The food isn't exactly exquisite or robust tasting Vietnamese, but cheap sandwiches don't get much better than this.\n\nThe cook works very hard to get everyone served in the lunchtime rush, but its pretty tough as one person in a cramped space.  Oddly, he's extremely nice, offers advice on what to have, and always gets my order perfect.\n\nThey have some interesting breakfast items (almond waffles) and dessert choices (almond gelatin) here, but the main offering is the sandwiches.  Your basic options are bbq chicken or pork with various Vietnamese veggies and jalapenos.  They will certainly remind you of Vietnamese rice paper rolls in taste.\n\nIts not a whopping meat-stacked sandwich, but I'll take a satisfying $4 meal downtown any day.", "author": "Sean B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-18", "description": "These Vietnamese sandwiches are awesome!  Bread is fresh and crunchy when you bite into it.  Reasonable price.  It's a tiny little spot next to ONE Market, but they have everything you need!  SO DELISH!", "author": "YUMM E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-10-15", "description": "This is a great place to go when your downtown... i like their BBQ Chicken sandwhich or their Meetball sandwhich.  They also... make those green waffle things....", "author": "Sheenie L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-10-15", "description": "I remembered someone mentioned this place and decided to check it out instead of a $8 working girl sandwich.  It is hidden and can easily be missed.  The owner was cool, it seems like it gets busy during the lunch crowd.  I went after 1:30 p.m.  The meatball sandwich was pretty good.  I'm used to Cam Huong in Oakland or even Lee's where you get a large sandwich for under $3.  It's not bad compared to what's around here.  I think two would hit the spot, but then that would be $8.", "author": "Josh L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-11-18", "description": "The bf loves this place and has been trying to get me to try it for ages. A tiny little stand with one window where you order, it's easy to miss. I love how basic the menu is as well. Only 12 breakfast and lunch items to choose from! \n\nFeeling adventurous today, I stopped by and tried the pork sandwich. The pork tasted juicy and flavorful, although a little fatty like KB says. I found myself having to open my sandwich to trim some of the fatty pieces off.  The cucumber, thinly grated carrots, daikon, and cilantro were all fresh, crunchy and colorful. It was perfectly seasoned and  oiled. Overall, for $4 it was great! I'll definitely be back to try the green coconut waffles and condensed milk ice coffee.", "author": "Dee I."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-12-02", "description": "The price is cheap considering the location: for $4, you can't even pay valet for the neighboring restaurants on Steuart.  But the pork sandwich just isn't that good.  \n\nThe meat and condiments like marinated carrots aren't that flavorful.  The bread is a bit too hard.  \n\nI am not sure why this place gets as much business as it does now.   Are they using Subway as a standard for measurement or something?", "author": "Candice B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-04-22", "description": "You really can blink and miss this place!  I have worked nearby and must've passed this place umpteen times over the past 1.5 years and just last week had a coworker share this discovery with me for the first time!  Its literally just like a window you walk up to on steuart st. right before the back door in to Chaya with a friendly guy running a one man show.  \n\n-Vietnamese Sandwiches (big surprise):  yummy\n-Spring Rolls:  I would for sure get these again (in addition to a sandwich, which is not too huge either).  \n-Other tasty looking items included coconut waffles and almond jello . . . . the waffles did smell amazing", "author": "Rachel T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-04-12", "description": "Best $4 buck sandwich in town... try the pork sandwich, with jalapenos, and a coconut waffle (they'll make you a fresh one on the spot)\n\nIf you don't want to trek out into the 'loin, then this is your best bet, and they're open late for lunch (I think until 4pm).\n\nDefinitely would recommend this little shop!", "author": "Peter V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-01-19", "description": "I love this place! I can't believe there are bad reviews. Granted I don't have the best frame of reference for Vietnamese sandwiches, but I do know what tastes good-- and these sandwiches are great! I love the jalapeno, pate, chicken, carrots and daikon... such an amazing combination of flavor and always so fresh. I, unlike other reviewers have never had a soggy bread experience. I eat my sandwich right away though because I work across the street. \n\nYou MUST end the experience with a green coconut waffle. He'll make one fresh and hot for you if you ask even if there are some ready to go.", "author": "Sonal B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-12-05", "description": "With a name like Little Saigon Deli (LSD), I guess I expected something more.  Something psychedelic!  Something addictive!  Something ... verboten.\n\nThe fancy pork sandwich I ate was okay - too bready, not meaty enough - but I'm willing to give the other flavors a shot.\n\nBut judging from my fellow yelpers' reviews, it looks like they've increased their prices this past week - probably to stay competitive with the other lunchtime establishments on the block!", "author": "Marcus C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-03-25", "description": "This Banh Mi shop adds a much needed affordable option to the neighborhood. The owner, Jesse, sells his sandwiches through a window onto the sidewalk. Service is fast and friendly. And the price can't be beat in the neighborhood -- $3.50 for a filling sandwich.\n\nThe BBQ Chicken is my favorite. I know some of the prior reviewers were disappointed, but I actually think the flavor is strong. I like it better than the pork. Although the bread isn't freshly baked, he toasts it up so that it's crispy and pretty tasty. I usually skip the pate.\n\nIf you like spicy, the jalapeno's are fresh and really HOT.\n\nAnd the coconut waffles smell so heavenly in the morning when I walk by.  Jesse also makes ham egg and cheese croissants for the breakfast crowd.", "author": "KristenAngel O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-09-12", "description": "My first visit was when my co-worker brought me here.  \n\nIf you didn't know this place existed you'll probably miss it.  It's located within a building behind the Rincon Center.  You'll see a little sign above the take out window.  However, in order to get drinks you must walk inside the building.  \n\nThis place is your typical Viet Sandwich joint.  Parish bread, meat and spread.  Yum!  I think there are 6 options for sandwiches.  \n\nSandwich were about $3-4.  Not bad for the area.  \n\nTaste of the sandwich was pretty good.  Not the greatest but pretty good.  The toasting of the bread makes everything better.  The spread could use a bit of work, but still good!\n\nI'm going back again for more tomorrow.", "author": "eric l."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-09-17", "description": "tiny little storefront.\ngood thing it was reliable when i went\nsuper combo banh mi $4.50, not the strongest of flavors, but acceptable.\nhave your expectations right -- minimal vietnamese stuff in this area, and no BBQ pork avail., bread can be hard, waffles can be soggy, etc.", "author": "Rob C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-12-30", "description": "The green coconut waffle is delicious! I was hooked ever since I tasted them. It's a small store front so you can miss it easily, they have another location at Embarcadero 4 now, its easier to find and the food still taste the same.  I like their sandwiches, they're really juicy but the bread can sometimes be a big tough.", "author": "Nancy L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-06-09", "description": "One sentence review: This place is not as good as Saigon Sandwich but at least it's close to my office and fast.", "author": "Kevin W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-04-22", "description": "This is my first review on Yelp.  The catalyst for this is that I got to talking to Jessie the owner of this deli when I was in SF a month ago.  On my second visit in three days, Jessie asked me if I liked his sandwiches.  I replied that if I didn't I wouldn't have come back.\n\nYou see, Jessie needed a sanity check.  He mentioned that some people on Yelp were trashing his sandwiches.  I was surprised by that statement and told him so.  I asked if the reviewers were Vietnamese because they obviously don't know what they're talking about.  I told him I was born in Saigon, grew up in LA and Banh mi as well as Vietnamese food in general is one of my passions.  I told him his pork was spot on.  Jessie said that he modeled the recipe on a deli he visits in Saigon.\n\nI dunno what other people have been eating, but all the sandwiches I've ordered here have been outstanding.  I've ordered the three pork (dunno what the menu name for it is), the ja one only and the chicken.  All were exceptional.  As a side note, my friend is a vegetarian from Georgia (the Baltic Sea country, not the state) and she thought the vegetarian sandwich was also very good.\n\nThere is enough pate, enough jus, good daikon, carrots, cilantro, jalepenos...everything just comes together very nicely and tastily on a very fresh baguette.  My only disappointment was not being able to try the deli's ngoi guon as the woman who specializes in making them was out and Jessie wouldn't allow me to roll my own.\n\nI know there will be people here that will disagree with me, but if you can find a better Vietnamese sandwich in the Bay Area, please message me as I'd like to try it out.  In fact, if you've got recommendations for Banh mi shops in LA/Chinatown, the San Gabriel valley and ESPECIALLY (pretty puhlease!) Manhattan, let me know.", "author": "Thomas V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-04-07", "description": "Since I work in the building across the street from this place it's super convenient for me (unlike that Rube Goldberg Breakfast machine that I made, it took an extra 5 minutes just for the candle to burn though the rope releasing the bowling ball onto the plank to knock the eggs into the frying pan (and that was only step 3 out of 142!)). Although there are many food places on that block of the street, only Little Saigon Deli is a practical choice since all the other eateries there cost as much as it would be to feed an entire village from a developing country or a limited edition gold collector's plate of the original transformers cartoon (I know what I'm going to choose). \n\nI'm all about diversity and I'm a strong believer that variety is the spice of life. I especially like it when that variety is smashed together to create an abomination to everything that is good and holy. That's why I ordered the Super Combo sandwich. Like many other hybrids that probably came about from indecisiveness (pie topped with ice-cream, turducken, platypuses, etc) the super combo sandwich is basically taking pieces from all the other choices of sandwiches and cramming it into an indecisive person's fantasy (sexual fantasy). \n\nI was a little concerned when the person who took my order didn't speak with an accent. Just as you would call into question the authenticity of a Scottish Terrier who spoke with a German accent, I questioned the authenticity of the Vietnamese Sandwich into question. However, they were able to pull it off well. The pickled vegetables, the meat, the unreasonably spicy peppers were all there. The bread was hard, but then every Viet Sandwich I have ever eaten have had hard bread, so like the emperor's new clothes I'm going to say that all authentic Viet Sandwiches have hard bread and if you disagree you're an fool, a fumbling buffoon. What was disappointing is that lack of symmetry throughout the sandwich. For example in my sandwich the peppers were only located in the middle and the beef was in a separate part of the sandwich from the pork. It was like racial segregation at its worst causing much civil unrest in my taste buds. Eventually after much upheaval all ingredients mixed and were together harmoniously in my tummy. But I shouldn't have had to put that much effort and metaphors for an equal distribution of ingredients in my sandwich. \n\nOn the other hand the price was only $4.50 which is great for the financial district, plus since it was to-go and the sandwich is served cold not only did I not have to pay the 1% increase in sales tax, I didn't have to pay for sales tax at all. Take that Board of Equalization!!! I'm going to take my $0.42 savings and invest it into stocks, and then they're going to go up, and I'm going to be like \"SELL SELL SELL\" and I'm going to be a trillionaire and I'll have all the gold transformers collector's plates I want and I'll be able to eat all the roasted platypuses I want because I can't decide between duck or beaver.", "author": "Youchen W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-03-06", "description": "The tofu sandwich here was decent. Wish the tofu was more flavorful. Can't beat the price though esp. in FiDi.", "author": "Tiffany L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-05-31", "description": "Delicious!\nI usually go for the 1/2 tofu, 1/2 pate (it isn't on the menu but I've come here quite a few times so they make it for me, hopefully it isn't too much of a bother :-s), which is delish, and of course one of the big yummy waffles which they make right there at the window. I prefer it when its made on the spot of course. The main guy that works here is so fast, he told me that he had it down to about 40 seconds (total for making the bhan mi). It's great, and I will definetely make it back.", "author": "pesya i."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-08-21", "description": "Mmmmm!\n\nTried a $4 meatball sandwich here today and I thought it was a great tasty sandwich at a great price (had it with everythign on it, including some kick-ass hot peppers...omg). I also grabbed a fresh-made $2 green coconut waffle for my sweet tooth and that was just as tasty.\n\nGranted I could go over to the Ferry Bldg and grab a similar sandwich from Out the Door for $8 (or is it $9 now?)  with a tiny bit more filling but at $4 I'm not going to complain.  While on jury duty a couple of months back I fell in love with the Saigon Sandwich shop on Larkin.  These are very similar so I'll save the trip across town and just walk to LSD.\n\nI'll be back to try another kind , maybe tomorrow!", "author": "Rick G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-06-16", "description": "A super combo and a coconut waffle for just $7.00? Saigon Sandwich has got nothing on this place.", "author": "Jordan M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-10-01", "description": "I like this place a lot. The Banh mi is smaller here than at Happy Donut, but the meat at this place is so much better. I would add Sriracha sauce to it and make it a little spicy. \n\nI will be coming back here.", "author": "Michelle M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-07-02", "description": "Got a long black hair in my tofu sandwich.", "author": "Skeptical Spee .."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-03-21", "description": "i dont know, I think maybe its hard to fuck up vietnamese sandwiches.. or maybe I just like them so much I'm willing to let small variences in quality slip past me.  LSD sandwiches seemed fine to me, and I love that its located so close to my office.  People bitch and moan about it being over $3 well it probably comes down to the fact that rent is much higher in the financial dist than it is in the TL, you cant make ends meet floggin bahn mi for 2.50.. could be spicier.. and faster..  otherwise, its all good", "author": "Ian H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-01-09", "description": "ok when this place first opened the sandwiches were like $2? $2.50? thats pretty dirt cheap. if i'm paying $2.50 for a sandwich, i really don't care what the quantity or quality is, b/c i'm only expecting not to be totally hungry after i'm done eating it. well now, the sandwich prices keep going up!!! last time i was there it was like $3? 3.25 or something?\n\n***** edit: they are now $3:50 for a chicken sandwich, but it looks like they are trying to increase the price, and the quality of the sandwich is a quarter's worth better!!!!!!!!! i got my chicken sandwich today all nice and toasty and fresh. ******\n\nthey're probably marking it up b/c they can probably get away with it, i mean the only two options for cheap $3 sandwiches is here and subway... so theres not much of a choice. so i still go buy a sandwich here and there. if there were other viet sandwich places within close proximity, i would def take those a try....\n\nchicken sandwich is my usual. this is of course after trying to pork sandwich, which was not very good, not much meat, and pretty dry. the chicken is much more moist, more quantity, and seasoned much better than the pork\n\nthere is only one or two people (they're really nice) in that tiny room cranking them out, so it does take some time, so if theres a line, expect to wait 10-15 mins,  which sucks if u're looking to get in and out, so i usually call in an order for a sandwich from the office and tell him the time i expect to pick it up and pay for it. they have been very good with having my sandwiches ready by the time i tell them. kudos to that!!!\n\ni also really like the green tea coconut waffle thing that they have, i think it used to sell for $1 but now its $2??? this waffle thing was worth a buck, but i no longer buy them unless i'm totally craving it, then i will shell out the $2.... sometimes b/c it takes a few mins to make, during rush hour, they will make some in advance, and leave them on a cooling rack, and when u order it, they will already have some avaliable. this is NO GOOD. its gotta be FRESH from the waffle iron to be good. one time i paid $2 for one and it was not the crispy on the outside, soft and warm on the inside waffle that i once knew and loved at the original $1 price. But most often they will have a tray with little samples of this for people to try. really great thing to eat for a breakfast snack w/ tea.\n\nwell time to go and pick up my chicken sandwich.... off i go....", "author": "Irene C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-12-21", "description": "This place is great AND cheap. Don't pay attention to the bad reviews above - the people are crazy yelpers with hundreds of reviews who expect a Food Network hidden treasure on every block in the city. Use some common sense in a review, and review things for what they are.\n\nVietnamese sandwiches are a simple, well-thought combination of flavors for a quick and light lunch. If this is what you are looking for, this place is great. The sandwiches are a good price and it's a refreshing change from the lame $8 sandwich or $20 fancy meal that makes the Financial Disctrict lunchtime a chore. While this place is nothing spectacular or a new, unique food discovery, it is a VERY solid lunchtime option if you want cheap food without going to a McDonalds. You wouldn't knock a Tapas place for not having big enough platters, and you wouldn't knock a 4-star restaurant for not having cheap options, so you shouldn't knock a deli for serving simple, good-tasting sandwiches. Context, people. That's the point of this site.", "author": "Anthony O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-10-09", "description": "For the past three years I have worked in San Francisco's Financial district and today I am ashamed to say it has taken me this long to discover Little Saigon Deli. The MeatBall Sandwich would turn a vegan into a cattle rancher. It is unlike any meatball sandwich.  I pictured a the conventional sub with several meatballs dripping with marinara sauce, but what was handed to me as quite different. Instead it was a two large slices of roll bread with a couple of meatballs seasoned with spices that I couldn't place. No mess, no frills and tones of flavor. Thanks to my co-worker Randall for making me try something new. Best of all it's only $4.\nWhile I waited in line, I couldn't help but notice everyone else was ordering waffles. These waffles were not sweet and drowning in syrup, just plain old waffles handed over folder in a wrap. People were just eating them plain in the middle of the day. I will have to try those next.", "author": "Alejandro M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-05-14", "description": "I work at Spear/Folsom, and my coworkers and I go here at least once a week. We love it, and the guy who is always there is terrific! You sometimes see their long line and think it will take a while, but it moves fast. Their pork sandwich is our favorite, although chicken is pretty good. They also have these waffle looking desserts that are tasty. You also can't beat the price. Highly recommend it!", "author": "jey o."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-05-24", "description": "Jesse, the owner, knows what I like.  Meatball sandwich, no jalapenos please.  He's a really hard worker for being the only one in that tiny little shop, hidden next to Boulevard and Rincon Center.  He's really nice and will give you tips on what he likes.  Usually when I go, there may be one or two people ordering.  But one Friday I went and it was so crowded at lunch time!  Five people waiting inside, plus 5 more waiting at the outside window.  Jesse was running back and forth taking orders on each side, then made all the sandwiches at once.  Ran back and forth again to distribute the sandwiches.  It was a long wait, but what do you expect when the place is getting popular and still only one server?  Then after the first 10 people got their sandwiches, I waited with the next group of seven who came and he repeated the same thing, running back and forth, window to window.  I gave him a big tip that day.  \n\nAnyway, my five stars goes to the hard-working owner, plus the cheap prices that I haven't been able to beat in FiDi, and the meatball sandwich is pretty good!", "author": "Stacey C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-05-26", "description": "Who would have thought anyone would find a cheap eat in the financial district? LSD steps up when it comes to a decent lunch for  a fraction less of what you would normally pay for lunch anywhere near the embarcadero. I definitely recommend the coconut waffles. It's a great alternative, when I can't get to San Jose for them. My favorite is the chicken sandwich. Calling in your order helps, if you are in a rush and can't wait in line during the busy lunch hour. This place is getting popular, so plan ahead!", "author": "Tiffany E."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-08-31", "description": "I had the pork sandwich - the one i use for comparison.  really greasy, no fish sauce, and no dikon.  Weak!", "author": "Christa W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-21", "description": "it was $4.\nit was not the best sandwich, not the best Vietnamese sandwich, but it was tasty.\nyes, the bread is a little hard, but I had the tofu which was nicely spiced with great accompaniments: carrot daikon, jalapenos so I forgot about the bread.\nas I said, it was $4.\nyou can't even get a cheap glass of wine for $4.\nand it's close to work...", "author": "Margaret K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-07-29", "description": "This little hole in the wall advertises beef curry for $5.50, which would be a steal in FiDi if in fact it were curry. The sad fact is that this curry has a lot more in common with beef soup, which can be a good thing, especially since the broth tastes home-made with large chunks of easy-to-shred beef and, if I'm not mistaken, turnip. But it's not the curry that I was expecting. It's a lot like pho but without the noodles if you add chili. \n\nMaybe it was an off day and they were all out of curry and tried to pass off hot soup as spicy curry. But at least now I know where to go the next time I have a cold.", "author": "Ls Y."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-07-29", "description": "I usually get the pork but it is quite inconsistent. Sometimes the bread is good and nicely toasted. other times stale. The only thing i look forward to at the end is the green coconut waffle, which you must request for a fresh one or they might give a already made one that's cold and sitting for a while. for a fidi lunch, it's cheap. but i think i'll stick with little paris", "author": "Patrick M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-09-24", "description": "This place is great.  Fast.  Cheap.  Delicious green coconut waffles.  I usually get the sandwiches without jalapeños, as they can be spicy.", "author": "Gerad S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-05-15", "description": "Just picked up a pork bahn mi and green waffle for lunch and I must say Little Saigon did not disappoint. There was harmony and balance between the perfectly toasted bread, pork (fancy pork is \"processed\" by the way, which doesn't translate to fancy for me), carrots, radishes, the greens and the light dressing. Now I'm usually not a sandwich gal, but I devoured this in mere minutes. Then there's the green waffle which is a cross between savory and sweet. I would prefer tasting more of the \"green\" coz I don't have a sweet tooth, either. However it was still yummy. No standout, but  yummy. I would highly recommend this cute hole in the wall for a good bargain lunch. You can't beat $4 for a satisfying lunch!", "author": "C P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-10-22", "description": "First off, they're very inexpensive for lunch in the Financial District.  $3.00 for a pretty big sandwich (pretty big for a vietnamese sandwich, at least) is a steal.\n\nI like the BBQ Chicken sandwich - it's my favorite so far, but the others are good too, if you like the pork or meatballs.\n\nOne thing I will say is that it takes a while to have a sandwich made.  I would recommend calling ahead to get your sandwich made.  There's just one guy making the food and the line can start building up pretty quickly.", "author": "Steve L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-09-30", "description": "The green waffle was delicious--hot, steaming, and gooey.  Good enough on its own to make syrup jealous.\n\nUnfortunately, the pork sandwich was lackluster.  I didn't expect much for a $4 sando and it mostly met my expectations... except the pork was more than 50% fat.  I don't mind a little flavor in my meat, but this was glorified strips of pork fat.\n\nThe rest of the sando was okay, pickled carrots and jalapenos.  The bread was good, soft with a crunchy crust.  I'll try it again with a different meat, but now I'm leery.  The waffle salvaged the rating.", "author": "Chris S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-07-15", "description": "Unfortunately my first experience with this place was the fancy pork. It was some processed sliced pork log....not at all what I expected.  I thought it would somehow be a step up from the regular pork. Definately not the case...I did not like it at all. I will give it one more try with a non-fancy meat.\n\nThey should really re-label that sandwhich.", "author": "angela p."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-05-08", "description": "AWESOME! Absolutely delicious! I love this little walk up window, perfect for getting a Vietnamese sandwich to go and sit by the bay. Very friendly and very fast!!!", "author": "Frank B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-01", "description": "Steaming hot, green coconut waffle!  So delicately sweet, I could eat one every day.  Bonus: they feel kinda \"healthy\" too since there are no sugary toppings on them.", "author": "Krystle S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-04-29", "description": "I am excited to find this deli by work. The selection is small but pretty much everything on the menu is good. I especially love the coconut flavor waffle. The cook is super nice and really efficient in getting the order deliver.", "author": "Ervinna L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-08-15", "description": "I went here yesterday for the first time.  The sandwich was cheap and delicious.  As I am not an expert in Vietnamese sandwiches I don't know how it ranked along those lines.  I also tried the shrimp rolls which were good.  Maybe too much lettuce.  But I'm going back today to try the pork.  Can anyone tell me what fancy pork is?  I didn't know pig was ever considered fancy.", "author": "Jen C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-17", "description": "3.5\nsolid banh mi @ a bargain price for this area.  the fact that it's a tiny shit shack in the middle of the financial district gives them a certain bit of cred that makes me throw my business their way.  not the best not the worst and occasionally i curse to get my point across.", "author": "beltrand a."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-03-27", "description": "I prefer the bahn mi at Les Croissant but service is fast and the fellow was really calm and nice.  The green coconut waffles are delicious--not too sweet.  They're \"green\" because he uses crushed \"padan\" leaves in them which helps give them the flavor.  Only $2 for a whole waffle.", "author": "Kai T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-05-13", "description": "i work across the street, and never knew this joint existed.  all those times i walked by, i've never seen it.\n\nthe baguette is definitely the right consistency, crispy on the outside, airy on the inside.  just enough mayo/sauce on the inside, and an ample amount of chicken (i had the BBQ Chicken).\n\nthere is a wait.  it's one dude, making vietnamese sandwiches.  i think we waited like 15 minutes or so.  downtown sf, that could be a deal breaker especially if you want to be in and out quickly.  but worth a definite go-back when i'm looking for a cheap lunch.", "author": "Jason J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-09-09", "description": "I had the combination - which had both pork and chicken.  A little small for my taste - and not too many veggies.    The best thing it had going for it though was the flavor.  The bread was also just okay - small and it seemed more chewy which is a bit of a different experience.   I also had the waffle - while the flavor was good, it was a bit soft.  So if you ever order this, ask for a fresh waffle and perhaps tell him to leave it a bit longer on the waffle iron.", "author": "Gina C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-12-03", "description": "Not even the best vietnamese sandwich in the FiDi......doesn't compare to my current favorite at Kearny/Sacramento.....does the trick for a cheap fix,  but after having tried both the #1 and the #2, i think it may be a whlie before i come back.", "author": "Pete D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-11-11", "description": "The pork sandwhich is ok, but nothing to write home about.  The ingredients were definitely fresh, but lacked some spice.  The pork was a little on the fatty side, so next time I will try a tofu sandwich.  Overall, for $4 it was a decent lunch though and I appreciated the friendliness of everyone and the speed (I went after 1:30).", "author": "K B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-05-07", "description": "Pretty decent sandwich. Good size, not huge like some places. Got the classic pork. The green coconut waffle was quite nice, and the iced coffee with condensed milk is super strong.", "author": "Brent F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-10-16", "description": "Just as yelp is saying for me when I click four stars, I'm a fan. The other 12908430918 reviews cover that this place is tasty and cheap but what they don't tell you is that if you ask for extra meat, they will give you double for free.", "author": "Collin G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-11-15", "description": "You can't help but like this place. Tasty vietnamese sandwiches, super friendly service, and at least when I went, samples of the waffle everyone raves about. I wish this place the best of luck", "author": "Jason B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-01-09", "description": "this place is alright, the tofu could be a bit more flavorful, and the sandwich would have benefitted from some mayo, but they bread is fresh and tasty.", "author": "Jared Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-05-15", "description": "after reading on yelp talk of all the yelpers raving about these vietnamese sandwiches, i was curious.  so i went to the window and asked the sandwich maker which pork was better, he said do the combo and get both.  $1 tip in the jar for that.  the sandwich smells delicious and each bite packs a punch, but being the little pig that i am, it could've had more pork in the sandwich.", "author": "Pickle R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-09-23", "description": "i totally didn't know this existed except for the brilliance of my coworker Matt and the day he unveiled this blessed place to me saved me from a horrible hungover state.  $4 for a Vietnamese sandwich is unbeatable. i recommend skipping the fancy pork/chicken (it's like cold cut deli meat) and going with a regular pork or chicken.  the spicy/sweet mixture is right on and i am now contemplating getting 2 sandwiches for the road from now on.  what i really want is 1.5 but figure i can save the other .5 for a few hours later.", "author": "Cathy L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-31", "description": "i usually come here because i want to eat something with cilantro in it, and the coconut waffles are fun to munch on while you're waiting. i get the pork sandwich with a little jalapeno - it's quite filling for being so cheap. and the owner is friendly!", "author": "David P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-09", "description": "Finally!  A decent place to get lunch for cheap in the financial district.  I'm sick of paying over $10 for a basic sandwich.  This place has great vietnamese sandwiches with fresh ingredients and for only $4!  Can't beat that.  Their bbq chicken sandwich can rival Out the Door's...  And the guy who works there is always so nice.", "author": "Ming Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-11-28", "description": "I love love love the tofu sandwiches from here.  Jesse is incredibly considerate and really cares about his customers, which in this day and age is getting rarer and rarer. I'm so glad my friend and I stumbled on this window when we were sick of the same old places for lunch nearby.", "author": "Jessica L."}
